{
    "id": 2931,
    "video_id": "A_yqqNAAhvg",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Kevin Coello",
        "Andy Cortez",
        "Nancy Lam"
    ],
    "title": "Is The Joker Movie A Bad Idea? - Kinda Funny Morning Show 08.23.17",
    "description": "Thanks to Uber for sponsoring this episode. Go to uber.com/drivenow to drive with Uber!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1503521587,
    "duration": 3196,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to the Kinda Funny Morning Show for Wednesday, August 23rd, 2017. I'm one of your hosts, Greg Miller, alongside the peer one, Tim Gettys. Let's see, most Greg, it's one of those things where the August 23rd, how at the end of this month, I feel like every what this happens where it just speeds by and the next thing you know it's gone. That is almost like I don't like it. Yeah, it just keeps happening, it's slowly doing it, keep stumbling faster and faster and faster. We can get away from it and we keep getting older and older and older. But the good news is that this just brings the video games quicker, quicker. That's true. A lot of them. We are less than seven days away from Everybody's Golf. Are you **** kidding me? Hideo Kojima, is it confirmed? Because they dance around it. Was he just in it for them? I'm sure he said, \"Okay, you should not put him in there.\" But I remember that being is something ever danced around and then they go mooing. I'm not prepared. Did not have to",
            "start": 0.21
        },
        {
            "text": "It was he just in it for them? I'm sure he said, \"Okay, you should not put him in there.\" But I remember that being is something ever danced around and then they go mooing. I'm not prepared. Did not have to have that danced over my face. I wanted, you know, you know, it's a, you want confirmations, you want trophies attached. Yeah, here's my next problem. What's your next problem, Greg? I love coffee. Yeah, very coffee a lot. Mhm. Something's happened where coffee now tastes sweet to me and I don't like sweet coffee. I want the coffee. No, exact same. They happen to get recently. She likes it. She didn't, she just stopped. Oh, no. Yeah, just stopped. Yeah, drinking coffee. Yeah, I think I put ice in it. It's the iced coffees. I haven't tasted. No, I actually know what it was. A black coffee that was hot yesterday. Oh, sweet. Woke up at 5:00. Coffee opposite of sweet. Why cook breakfast for my in-laws and then go to Muir Woods with everybody? The big Muir Woods. Yeah, yeah. What a place. What a place indeed. Yeah, lotta I saw but everyone",
            "start": 46.77
        },
        {
            "text": "Coffee opposite of sweet. Why cook breakfast for my in-laws and then go to Muir Woods with everybody? The big Muir Woods. Yeah, yeah. What a place. What a place indeed. Yeah, lotta I saw but everyone. So I got that going for me. Yeah, yeah. Three one honey buckets and literally got a sound honey bucket too. Yeah, we literally have gone through the entire thing all the way through and all the way out. And all I can think about was Planet of the Apes and the Planet of the Apes went there. And then I think it was like Jan or Jen's dad mentioned Star Wars. Oh, yeah, they did Star Wars here too. Yeah, that's not a big deal. But James Franco Planet of the Apes, huge deal. Yeah, what's up with Caesar is what I say. What is up with Caesar, most? What's your stance on the movie The Departed? What is my stance on the movie The Departed? I know that yesterday's show is titled Nick Fights Everyone and that I saw the tweet that it was so crazy that everyone poured in my stance on The Departed. Here's my thing about my stance.",
            "start": 90.84
        },
        {
            "text": "The Departed. I know that yesterday's show is titled Nick Fights Everyone and that I saw the tweet that it was so crazy that everyone poured in my stance on The Departed. Here's my thing about my stance. Like, don't think I, I don't, I don't know. I could get, I don't think I'm feeling strong enough about The Departed to fight anyone of The Departed. I watched The Departed and I remember enjoying it. I remember and then I left and then I've never really thought about it again outside of Matt Damon getting shot in the head by at the end by Marky Mark lamping around. That was a big problem Nick had with it. Generally the things not, he's irrational yesterday. Yeah, but he was saying it's a bad movie. Yeah, yeah. The guy who likes Daddy's Home. Yes. Okay. And it, the chat turned on him, Greg. It'll hate. I've never seen the chat turned on automatically. This is our movie person. This is the person we want a movie show from. Yeah, now you finally know why that doesn't happen. And I'm pretty sure they might swap doors so",
            "start": 134.32
        },
        {
            "text": "The chat turned on automatically. This is our movie person. This is the person we want a movie show from. Yeah, now you finally know why that doesn't happen. And I'm pretty sure they might swap doors. So maybe you're not going crazy. I mean, you know, I wasn't here yesterday. No, that's, that is not even one of the cups of coffee I'm thinking about. I'm thinking about the coffee yesterday was all we have same phone with his family where I had it and I was like, \"Die.\" I was making the food obviously. I mean, I didn't, I'm cooking with gravy coming up September. But I made five all of us at once. You know what I mean? You know, pretty **** depressed that I was able to create this long way and I'm all plated. Yeah, right. Way overcooked. Music playing three. But then I took the first two I made, wrapped him in tin foil, 'cause I was maybe I became one, huh? Yeah, overcooked. It does, it does. Never just get it now. Yeah, sports something. Don't worry about it. Cooking was great. Um, but then I was like, I thought I knocked sugar",
            "start": 184.93
        },
        {
            "text": "'Cause I was maybe I became one, huh? Yeah, overcooked. It does, it does. Never just get it now. Yeah, sports something. Don't worry about it. Cooking was great. Um, but then I was like, I thought I knocked sugar into my coffee to the point that a quart of that I was like, \"I brew with this.\" And then this morning I had, I got by his coffee on the way on. I was like, \"****, is it just the coffee we're using? It's sweet.\" And then here my same old Dunkin' Donuts per cup taste sweet. That's my life now. Everybody cursed. Have you tried this? I tried the cold brew. It was disgusting. What we **** love that you hated it at first. You didn't like the taste of her especially. Oh, I'm sorry, you're right. I was like, \"These **** good cold brew cup.\" I might sometimes minorities. I can't tell apart. Good Lord, no. If you were to compare Andy to Jon Snow, I could see that just from here though. Yeah, just from, yeah. Yes, this has been covered in at length on the shows, y'all. I'm not sure where we've talked about it. Okay, good.",
            "start": 234.55
        },
        {
            "text": "To compare Andy to Jon Snow, I could see that just from here though. Yeah, just from, yeah. Yes, this has been covered in at length on the shows, y'all. I'm not sure where we've talked about it. Okay, good. As long as everyone knows that Andy Cortez sent out an image via Slack of Jon Snow. Like, no, it's just his eyes, his clothes. It was his clothes. And here's what I'll say, it did look like Andy Cortez. It did look like Andy. Yes, from saying it was this, hey, it looks like, I agree. I mean, yeah, it does look like him. He's a man with black hair. Yeah, if you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show each and every week to hear at Twitch.tv/KindaFunnyGames. We come to you with the nerdy news we want to talk about. We're jumping the shed to answer your questions, comments, and concerns, giving away video games and having a good time. I'm excited because it's Wednesday, Tim. What's Wednesday? Comics Comic Day. That means you should have done a required reading of Black",
            "start": 280.71
        },
        {
            "text": "And concerns, giving away video games and having a good time. I'm excited because it's Wednesday, Tim. What's Wednesday? Comics Comic Day. That means you should have done a required reading of Black Science Vol. 1. The extra-credit and set by Kevin Coello was the boys super excited on the bus. One that wins **** popping off on Wednesdays here for nothing. Book Wednesday for a man that maybe can't get enough. Mmm, just can't. You don't mean Black Science Vol. 1 was a private reading. But of course, we'll go through the news before. But before that even, yes, Timothy, yes, we have special guest me off. We do. I would like to invite her here. Nancy, please come to the stage. Nancy, ladies and gentlemen, reached out to me a few weeks ago. The governor, she saw me at one of the, \"I know me, are you come to this, become me?\" Okay, good. She saw me at a show called RTX at which I set the world on fire, on fire. Cool Greg, by dressing as Wonder Woman, being carried, the Martha chant. You all remember it was on the news. USA Today",
            "start": 339.06
        },
        {
            "text": "Okay, good. She saw me at a show called RTX at which I set the world on fire, on fire. Cool Greg, by dressing as Wonder Woman, being carried, the Martha chant. You all remember it was on the news. USA Today today covered and covered us that weekend. And I assume it was somehow related. It needs my cup already. Testing Nancy. Upon seeing this, Tim said, \"Greg, I am horrified.\" No, say, \"Greg, I appreciate your demand for Wonder Woman and your love of Wonder Woman. I want to help you be able to do that every day because I run a website called SixOnClothing.\" Cool Greg, shoulder. This is it. Nance, coming over here. You see yourself down there. And what you do is basically, what do you call it? Casual cosplay, right? So you can make all these awesome hoodies. Yeah, all in there. All handmade by me from patterning to like sewing everything by myself. That's fantastic. Like, how long does it take you to make one of these? I'd say depending on the design, between one and a half hours to it like three hours. Wow, this is like",
            "start": 381.99
        },
        {
            "text": "Sewing everything by myself. That's fantastic. Like, how long does it take you to make one of these? I'd say depending on the design, between one and a half hours to it like three hours. Wow, this is like super this small business. You're making something happen here. It's just me by myself, two machines. How long have you been doing it? I just saw made my five-year anniversary. Self is Overwatch. Yeah, that's good. You go back and show because I have people in the chat work freaking out about Overwatch. I also direct it. Yeah, right. You have to show Cool Greg who Overwatch it. You got the D.Va at the top. That has D.Va. It's not anybody caller D.Va. Not the way I'm saying it. It's like D.Va. They're weird. I don't know. Kevin, I don't try to get into Overwatch and more like Kevin Coello just makes messes. It's something laughter himself yet at SixOnClothing.com. Maybe pick up a hoodie here 'cause they're awesome. But you brought a special one. Oh, yes. I'm getting a custom. Somebody you guys then this all",
            "start": 446.28
        },
        {
            "text": "It's something laughter himself yet at SixOnClothing.com. Maybe pick up a hoodie here 'cause they're awesome. But you brought a special one. Oh, yes. I'm getting a custom. Somebody you guys then this all one-of-a-kind is just for you guys. Oh my God, what a sweet. Okay, poor Tim. The Kingdom Hearts Guardian. For this, is this from Kingdom Hearts 3? The dark 40. There we go. Very stoked about that. I was featured in the trailer in the Olympus Coliseum. Thank you. This one's totally one-of-a-kind 'cause I can't find this fabric. Thank you very much. Yeah, she's a Wonder Woman one we're talking about. Okay, so now I don't have to show everyone everything. I have a built-in bustier. Well, I don't, I have a built-in boost. The other outfit will come out at times. Don't worry about that one. They'll be under the, yeah, exactly, exactly. But anyways, beyond here, what is this one? This one is I fell out the Superman movie. Why? Because you're totally raving about it. Yeah, Batman, maybe Superman's a good movie. Gonna be heard. So it's a",
            "start": 493.62
        },
        {
            "text": "Exactly. But anyways, beyond here, what is this one? This one is I fell out the Superman movie. Why? Because you're totally raving about it. Yeah, Batman, maybe Superman's a good movie. Gonna be heard. So it's a hoodie. You're showing me this off camera. It's exactly what you expect. Superman hoodie makes sense. But what is the hood do? It actually unzips and he comes out. Key. Yes. Thank you so much. Yes. Okay, I was gonna get it. Don't worry, man. I put on a hoodie once or twice. Total fresh coffee. You know what I'm saying? No, I know what you're saying. All right. It's almost, it's a crossover almost between of course the DCEU suit and then Smallville. As I'm zipping it up, like, you know, Tom Welling used to do with, you know, mine. I know it's all about. Yes. Oh my God. Turn for you, mister. Twirl power. Wanna fly thing? Remember? Oh, this is levitating around me to remember. You might have Superman: Man of Steel. It's a good thing. Good deal. Nance's are awesome. Thank, thank you so much. Thank you very much. Yes. Oh my God. No, thank you for",
            "start": 552.26
        },
        {
            "text": "Is levitating around me to remember. You might have Superman: Man of Steel. It's a good thing. Good deal. Nance's are awesome. Thank, thank you so much. Thank you very much. Yes. Oh my God. No, thank you for coming up, guys. Check out SixOnClothing.com. There's a whole bunch of cool stuff. Undertale stuff. Yeah, check it out. Yeah, there's all sorts of really cool stuff up here. I want to be, I want to point it out. Of course, they, Nancy, so cool. So in to help us flew herself up here. Didn't ask for any help from us when her flight got canceled coming to San Francisco. She flew into Oakland and figured bad. Oh my God, car ride. Honey, like at San Francisco. So she is awesome. In the chat, shrub, Tim said, \"Prepare for your **** site to crash.\" So hopefully we can crash your site. Handmade casual cosplay. This is awesome. I'm very happy of this. I'm very, very happy with this. Thank you so much. Thank you, thank you so much. All right, no problem. Take care. Hiromi Jin, look at my hands. All right, guys, you're free. Thank you, thank you.",
            "start": 624.92
        },
        {
            "text": "Happy of this. I'm very, very happy with this. Thank you so much. Thank you, thank you so much. All right, no problem. Take care. Hiromi Jin, look at my hands. All right, guys, you're free. Thank you, thank you. So right away, I love it. I look good. Yeah, don't you know? I mean, you could tell me how bad it. I'd say you're a liar. That's what I was born to wear. It definitely was. Now I will say as I love it, I'm gonna take it off right now. Oh my God, I miss the easiest one. You know what? It's more like, it's more like Jonathan's outfit right now in Super Sons slash anything happening in the DC Comics. This is exactly his thing except, you know, a bigger shoe. She doesn't it. I love it. I'm very happy. Now here we go. Cool Greg, pull it up. Cool Greg has a Slack. Andy Cortez, he showed us this. This does look like Andy. This does look like Andy's face. Everybody meet their Nick's. Oh my God. Like any bottom part. I mean, that looks like you. That looks like you. Don't even screen cap. Everyone screen cap this right now. Screen cap",
            "start": 676.55
        },
        {
            "text": "Look like Andy's face. Everybody meet their Nick's. Oh my God. Like any bottom part. I mean, that looks like you. That looks like you. Don't even screen cap. Everyone screen cap this right now. Screen cap the, the Jon Snow image. Got it. Screen capped it. Good. Now Cool Greg, go fullscreen. Andy, do your thing. They'll screen cap you. Then they'll cut it out. They'll put them on comparison shots. Okay, should we do the, won't you going on one? Yeah, sure. Okay, that's smarter than what I thought. This is a real important. Oh, yeah. Either one is, I'll get more arguing whichever. I mean, it looks a lot like. Are we good? Are we just lying to ourselves? Does that word it that it doesn't look like Andy? No, no one says it doesn't look like him. It's just that it's, that's not a unique. I'm gonna like when it comes down to it, I'm gonna **** sue HBO for top dollar. Got it. I'm so **** good. Oh, man. Showed me right. Yeah, we still have to show news. Nerdy News. We need an article. Housekeeping things. There's some logs over on Patreon.com",
            "start": 732.35
        },
        {
            "text": "**** sue HBO for top dollar. Got it. I'm so **** good. Oh, man. Showed me right. Yeah, we still have to show news. Nerdy News. We need an article. Housekeeping things. There's some logs over on Patreon.com/KindaFunny. If Cool Greg and Kevin's adventures in New York, we could talk about this for of them there. Check those out. The dollar above level gets you all of them. And then also this weekend, we will be at GameStop Expo. Oh, yeah. Down in Vegas. So if you're Vegas, come say hi. Screaming awesome. Nope. Twitch.tv/GameStop. Where these funny games. Yes. But you should watch it on Twitch.tv/GameStop starting at 10:00 a.m. Pacific. Having your way. Exactly. Have some fun. Talk to each other. Mmm-hmm. What's than it is that we're gonna puff up my chest a bit more? We talked about what then with the city behind you. It looks pretty cool. Heroic. Exactly. I was reading at the capelet kind of fly. It sounded like somebody else. Okay, man, did a AMA over on Facebook. We don't need to watch it. There was only",
            "start": 802.98
        },
        {
            "text": "City behind you. It looks pretty cool. Heroic. Exactly. I was reading at the capelet kind of fly. It sounded like somebody else. Okay, man, did a AMA over on Facebook. We don't need to watch it. There was only one quote. Okay, that I thought was that was important here. On someone asked, \"What characters can we expect to see in Guardians?\" And his answer was, \"Nova comes up occasionally as someone we might use. One of the things I'm doing with creating Guardians of the Galaxy Vol. 3 that will take place after the next two Avengers movies and it will help to set up the next 10 to 20 years of Marvel movie. Yeah, it's gonna really expand the cosmic universe. We're gonna be setting up new characters. It'll be the last movie of this version of Guardians of the Galaxy.\" Oh, no. How do you feel about that? I'm fine with that. Okay. Yeah, time look up time. I'm, yeah, everything runs its course essentially. I, I don't ever want to get too excited. I've been burned before by my excitement of things and then they don't pan out. I",
            "start": 867.45
        },
        {
            "text": "That okay. Yeah, time look up time. I'm, yeah, everything runs its course essentially. I, I don't ever want to get too excited. I've been burned before by my excitement of things and then they don't pan out. I feel like this next Avengers movie, he's gonna really shake **** up, right? Anymore. Yeah, yeah. It's gonna shake some **** up 'cause I want you to shake them. Yeah, that's the thing is this next one's gonna shake things up. But I feel like so much of it's gonna get immediately unhook up on the next one. Okay. 'Cause there's so much Power Stones and Infinity Gauntlet. All the stones though. You know, they're gonna, they have so much different powers and **** that look, I feel like they can write their selves out of fun. Oh, what do you have a lot of all the Marvel characters in one movie? Yeah, hell yeah. This is the first time since Avengers 1 that there's been this type of build up to event, right? No, Majesty was just more anyway. So that's pretty cool. The next new story, there was a shot from the shooting",
            "start": 919.65
        },
        {
            "text": "Is the first time since Avengers 1 that there's been this type of build up to event, right? No, Majesty was just more anyway. So that's pretty cool. The next new story, there was a shot from the shooting of Bumblebee and I'm pretty damn stoked about this. Look at that. The movie takes place in the 80s. Oh, I don't know that excited is true for this. Is it's like a Beetle, the Volkswagen Beetle. Okay, I'm not that Camaro ****. And this is right at red Marino. Bumblebee and John Cena. I can't see the main characters. Hailee Steinfeld, the girl from Pitch Perfect 2. That's a great point actually. 'Cause yeah, whoo. Yeah, but she was the girl that was added to Pitch Perfect 2. That wasn't it one. She knows she's usually like the main YouTuber. Yes, she's now a no fan. He was in one. Yeah, let's talk about that. Amy, I'd say fat ain't no Doctor Trisha. But spoilers. Oh, at the end, right? What a great joke. Yeah, it definitely was. It was where any of the other Pitch Perfect good. That's their only been one. Others only been to the",
            "start": 963.75
        },
        {
            "text": "Ain't no Doctor Trisha. But spoilers. Oh, at the end, right? What a great joke. Yeah, it definitely was. It was where any of the other Pitch Perfect good. That's their only been one. Others only been to the third one's coming out this year. Because I remember Pitch Perfect 1 so much. I was excited for Pitch Perfect 2 and then it was very disappointing. And then three looks like a Fast & Furious movie. Like it's like an action story of that. So baby, don't worry about actually. I doubt it. But instead of going to Japan, now go that I places out. I'm not, I'm not happy with this. The next news story comes from HeyUGuys.com. Nice **** website. Channing Tatum confirms his Gambit movie is being rewritten following the success of Deadpool and Logan. He was on a podcast. A quote that he had was, \"I look for a personal connection to the movies I make and it may not be immediately obvious in every story. I have a personal connection with Gambit. I just never found that personal way in. We lit a",
            "start": 1038.24
        },
        {
            "text": "I look for a personal connection to the movies I make and it may not be immediately obvious in every story. I have a personal connection with Gambit. I just never found that personal way in. We lit a fuse on the first one and it just blew it completely out of the water. I think we got lucky. We got hit with some setbacks and it was all good for a good reason. We were trying to do something completely different. We were trying to do something that this genre of movie has never seen before. We kept running into the same problems and then Deadpool and Logan came through and kicked the doors down. Now we're really getting to do some things we've always wanted to do with the script. We just sort of started over. Okay, well, this movie ever happening? I mean, I would think, yeah, here's what I'll say is I think yes, it will happen. It's just I look down to look so **** cool. I do think it'll happen based on the fact that now Fox wants to make all these **** Rated R movies, right? They're like, \"Oh, there is an\"",
            "start": 1094.28
        },
        {
            "text": "Yes, it will happen. It's just I look down to look so **** cool. I do think it'll happen based on the fact that now Fox wants to make all these **** Rated R movies, right? They're like, \"Oh, there is an audience for this.\" So Channing Tatum, we all love him. Yeah, we all love him. Check, do you love Channing Tatum? Yeah, you do. Shaking his head. So I don't know. I know the streets love Channing Tatum. That's what I want to know. So like you put you Rated R's. Oh, yeah, that's what he's talked about right now. This farm is success of Deadpool. Okay, yeah, exactly, exactly. Like, hey, let's play with some eating cards. Like, I mean, that's what X-Men, it will always be. It's PG-13. And you take these side projects and you show it like what it could be to have this. Hmm. Justin R. vs. Heli. I love Channing Tatum. Ah, I'm a Jedi says no. But he's not a sub and he doesn't have Twitch Prime. So we made listen him. I don't know, man. I mean, I love, I love Channing Tatum. I love Gambit. I just feel like the time has come and",
            "start": 1130.91
        },
        {
            "text": "I'm a Jedi says no. But he's not a sub and he doesn't have Twitch Prime. So we made listen him. I don't know, man. I mean, I love, I love Channing Tatum. I love Gambit. I just feel like the time has come and gone for this movie actually happening. I disagree. I think that with Deadpool and Logan there, I don't know. I'm interested to see. I have this whole Marvel/Fox situation shakes out. I'm still being hopeful that there's gonna get straight-up bought sooner than later. Like hopefully before any of this even share. Mr. Four Words. I think so. Now then, now that Fox sees dollar signs in all these movies. I really cool. We should get Kevin like them. And this is it. I don't mean right now. I'm saying for future with you sitting on the side. You're a great down in my dropping character. You need that. You still into my coat. You still need me miked up. Yeah, if anything, we should move you a little set up back here. It's like Tom Green. But nobody remembers a world. Nobody remembers that boo doesn't. Yeah, well, sure you",
            "start": 1172.82
        },
        {
            "text": "My coat. You still need me miked up. Yeah, if anything, we should move you a little set up back here. It's like Tom Green. But nobody remembers a world. Nobody remembers that boo doesn't. Yeah, well, sure you think that what old guy on the UPN show us. Yeah, right. Yeah, well, I didn't know that every time. I never watched that one. Very cool. I would say that if this movie happens, yeah, let's get a movie. Yeah, it will not be Rated R. Why? I don't know. What does this mean then? What does this mean? The movie's being rewritten following the success of Deadpool and Logan. What do you think they're doing to it if it's not gonna be Rated R? I think it's all ****. Like I think he wants that to happen. Sure. I don't think that's gonna happen. All right. Well, you heard it here first. I don't know, man. I don't know about that. I think HeyUGuys needs to listen to our podcast. I read a new story. Who's Greg? Speaking of podcasts. Unless this yesterday, I was in the Morning Show. You were. Yes, you guys talked about the Joker",
            "start": 1220.55
        },
        {
            "text": "Movie. I assume no, that happened after. So why would that not be something we talked about today? We didn't think about it, you **** idiot. Do we know about it? Does anyone want that? Like this gives a Greg Miller definitive I answer to the Joker. So confirmed that there are, they having confirmed the rumor is they're doing a Joker's a Joker origins DC movie outside of the cinematic universe produced by Martin Scorsese, directed by the guy who did Todd Phillips, who did Hangover and the other one or whatever. It's gonna be set in the 80s. Even like this, a Joker origin story. No, give me the bad guy. The thing is about the Joker that makes them special is that you don't know any of the stuff. And anytime they go back and they try to like let you know what happened, it's never that great.",
            "start": 1272.11
        },
        {
            "text": "the bad guy the thing is about the Joker that makes them special is that you don't know any of the stuff and anytime they go back and they try to like let you know what happened it's never that great sure but maybe it's like you know thinking about a bunch of different or a source maybe you know maybe it's that kind of thing maybe you don't know me they did that brilliantly in The Dark Knight right or not Dark Knight Rises The Dark Knight that's what that's the best origin story there is where every time he just says something different that's not a joke huh telling joke I don't love it yeah okay and watching that movie really confirms my think about the Joker origin story I don't even I don't think it needs to be DC knows this I don't think it needs to be I was really needs to do this I mean this is what we are this is what you were **** want right get away from the **** up canon let's just make a movie that's true so there's a you don't like Jared Leto guess what doesn't ****",
            "start": 1317.39
        },
        {
            "text": "mean this is what we are this is what you were **** want right get away from the **** up canon let's just make a movie that's true so there's a you don't like Jared Leto guess what doesn't **** matter he's not he'll be in Suicide Squad too and Gotham City Sirens great this is your own thing it's a new thing maybe it's just Joker in the purple suit **** **** up maybe it's Jack Nicholson as the Joker telling his story to someone yeah this is like what I talk about on this show then having basically in quotes the Elseworlds brand where it will be outside of continuity read some got mentioned this article stuff like that you can do whatever the hell you want with it so I give vague into it how they want with it that make this if I can do it through the Batman be on one hand like feed me Bruce Wayne cool Greg you're you were making really good points if that's what they were to do what they're gonna do is they're gonna give Joker a origin story like they're gonna go back and",
            "start": 1357.35
        },
        {
            "text": "feed me Bruce Wayne cool Greg you're you were making really good points if that's what they were to do what they're gonna do is they're gonna give Joker a origin story like they're gonna go back and it's gonna be lame as **** well cool Greg what I was shouting out before I realized I had of course babysitting here of course you know what I mean we got Pre-K over here okay Greg I got to make sure the shows run right talk about the Joker thing I put in a new link can you put it in there it got at it it's the Batman-News.com one this one is the continuing I want to pick up a brick and beat myself over the **** head with it because nothing ever works out for good old Greg Miller Matt Reeves why are we still talking about Matt Reeves on the Batman it's a standalone this is a part of the extended universe like I said Batman-ActionNews.com one read the story do you know a couple days before Comic Con last month the Batman director Matt Reeves was on the business podcast hosted by The",
            "start": 1405.77
        },
        {
            "text": "universe like I said Batman-ActionNews.com one read the story do you know a couple days before Comic Con last month the Batman director Matt Reeves was on the business podcast hosted by The Hollywood Reporter's Kim Masters Reeves spoke about his position I'm making the movie and had an interesting comment about how it was pitched to him by Warner Brothers when they approached me what they said was look it's a standalone this isn't part of the extended universe Reeves said he also confirmed that he has an idea for a trilogy in his head Reeves said he's totally fine not making a Batman movie if Warner Brothers doesn't want him doesn't want doesn't want to make the movie that he wants to make so far though he said that Warner Brothers has been on the same page you can listen here Reeves comments about the Batman not being part of the DC Extended Universe are interesting yesterday we learned that Warner Brothers will be launching a brand new DC Comics movies Oh a brand a new brand of DC Comics",
            "start": 1450.41
        },
        {
            "text": "about the Batman not being part of the DC Extended Universe are interesting yesterday we learned that Warner Brothers will be launching a brand new DC Comics movies Oh a brand a new brand of DC Comics movies that will be separate from the current DC Extended Universe right now they're working on a Joker movie that won't start your jet Jared Leto one last thing I think is worth mentioning is this The Hollywood Reporter's Kim Masters interviewed Matt Reeves on the podcast on July 17th on July 1st she published an article about Ben Affleck's Batman future coming to an end soon make what you will but it's certainly interesting time this **** Batman movie you know I want to do Greg what do you undo I want to come up with a list of **** headlines know about the Batman movie the Batman all right then I want to hit up Batman-News.com and Comic Book Resources calm and all these goddamn websites and just give them the listing be like you know what guys you can just use the same article",
            "start": 1488.0
        },
        {
            "text": "right then I want to hit up Batman-News.com and Comic Book Resources calm and all these goddamn websites and just give them the listing be like you know what guys you can just use the same article just change the headline and every day just put out a new one because that's all that you've been doing and I can help you we can help them I want to help these people sounds like you wanna you something you're putting down there so I'm pretty salty about this Greg this is garbage why are we still talking about this when this is nothing this is nothing there's nothing being said here I mean Reeves it was approached that way so easy is it or is not in the universe is it a trilogy years and now the trailer here's Ben Affleck in under is he not let me let me give you the answers lay down if this movie happens it will not be a trilogy it will be part of the universe let's not be stupid okay right I just like to present the news out there that needs to be known over here you got you Hey",
            "start": 1528.44
        },
        {
            "text": "this movie happens it will not be a trilogy it will be part of the universe let's not be stupid okay right I just like to present the news out there that needs to be known over here you got you Hey Channing Tatum **** farted out a story about a Gambit you don't even talk about the Joker movie the internet playing favorites the Internet's supposed playing favorites Tim I like the Joker out of all these things I just don't want they're gonna ruin him it's gonna ruin it's gonna be we've learned our lessons Deadpool pretty good yeah good good really good yeah they both terrific I'm not come on the mark so is it R like what does that mean it will be rated R favorites he won't I don't think that benefits Gambit in a way that that's not appealing with you it's Kevin same throw the car to blow people up yeah it doesn't matter to him like you know **** **** people and tits everywhere just need to make people explode Wow by the way I watched Red last night because Adi Shankar was",
            "start": 1564.15
        },
        {
            "text": "to blow people up yeah it doesn't matter to him like you know **** **** people and tits everywhere just need to make people explode Wow by the way I watched Red last night because Adi Shankar was supposed to be on the Game of a Greggy Show today but then Adi got sick and his mom called me this morning to say you couldn't come true story all around uh man's right it's **** amazing so goddamn great holy **** no of course not come hide it am I saying I'm right I did know and this is the first time I watch something on my TV in 3D it's the best TV for 3D curved yeah well then just as the curve just like it's all LED and it's beautiful okay Dredd 3D is a masterpiece way they like Dredd seems more like all the bright lights are just sparkling in 3D yeah I know you hate experience okay is it time for comics it is time to Comic Book Wednesday I'm the Kinda Funny Morning Show is always comic day where we run you through what we're picking up off our pull list but more importantly",
            "start": 1627.18
        },
        {
            "text": "okay is it time for comics it is time to Comic Book Wednesday I'm the Kinda Funny Morning Show is always comic day where we run you through what we're picking up off our pull list but more importantly talk to you about Required Reading I'm all throwing up in the chat right now so I can see what you all say Required Reading before we get to the comments do you want to get rid of like get through the other segments so that we can just have the comments the name of the show whatever you want let's do that let's do that I feel like that just that makes sense because I forgot the we're gonna read the tips okay this comes from Outcast212 I just want to say I hate everyone who used bought programs to snatch up all the SNES Classic pre-orders I was trying to get them for the Best Friends but couldn't get any **** scalpers oh you mean Andy Cortez so I want I want I want to say this yeah on a Kinda Funny Games deal yesterday Andrea said she got four huh and she's getting a lot of ****",
            "start": 1678.57
        },
        {
            "text": "couldn't get any **** scalpers oh you mean Andy Cortez so I want I want I want to say this yeah on a Kinda Funny Games deal yesterday Andrea said she got four huh and she's getting a lot of **** in the comments from people she got them for her friends sure she's not reaching not yeah she's not like reselling these to like make money and screw people that you know of though Andrea could be lying I know she didn't come in to work today it's not holiday oh okay I assume that bing-bong a second ago was him initially Debbie says you mentioned on the last up to the Game of Thrones finales called The Dragon and the Wolf referring to Jon and Dany and he chants the title is just referring to Jon since he's both anyways keep killing it probably yeah he finds out and then dead bone town Jamie yeah nobody has ever been rooting for incest more is just like robbing for it I mean that's what they want that's what they want I'm gonna give it to us to you we're gonna be on an airplane when",
            "start": 1721.62
        },
        {
            "text": "yeah nobody has ever been rooting for incest more is just like robbing for it I mean that's what they want that's what they want I'm gonna give it to us to you we're gonna be on an airplane when this is happening playing cool unreleased games I'm very upset about this I'm scared with their track record it seems like those would be leaked and I hope it leaks I hope it looks right now I need it I'll put it in my veins 5.5 Minutes if you guys can pick a comic to get the manga slash anime treatment ie comic gets turned into a cartoon what would it be I think East of West or Saga would be cool also please do East of West one week I want to Netflix Saga just give it to me and make it just legitimate and real and gritty and I think way too much to make it look cool because of all like like they're cool like I don't think they could pull that off just with like they got Netflix money though yeah no one that supposed to do I mean I know I think I've said this before because we say",
            "start": 1769.53
        },
        {
            "text": "like they're cool like I don't think they could pull that off just with like they got Netflix money though yeah no one that supposed to do I mean I know I think I've said this before because we say the same things over over I think stay with me Kevin I say Paper Girls and I think cuz I think actually seeing it play out and having a seasoned and consumed as you went might help us make because we're always like where is it going what's happening than having an end in sight if they haven't actually you have a season you have X amount of episodes tell this you'd have a better arc for like this is what we're doing this season here's the overarching thing with like All-Father or whatever house is gonna work out I am oh yeah no because I want to see HBO - lucky crazy **** sure okay and like that is uh you can do that like what three seasons probably that's it for tips I'm outside for PS I Love This XOXO you know to KindaFunny.com Joey didn't do this part Joey did you bug",
            "start": 1834.43
        },
        {
            "text": "that is uh you can do that like what three seasons probably that's it for tips I'm outside for PS I Love This XOXO you know to KindaFunny.com Joey didn't do this part Joey did you bug your best friend yeah I don't see it every hole every hold I did but any if you could pulling in thank you we'll do the giveaway okay now sponsored by Uber every day you know we give away video game here at Twitch.tv/KindaFunnyGames how do you win the video game it's simple being the chat like so many of you are right now or amplify your chances with three other ways to win number one you can be a sub here on Twitch if you subscribe to us on Twitch you of course get the Kinda Funny logo next your name cool emotes private chat time with us need to play multi-player games with me like I'm gonna do next **** week with Everybody's Golf I don't know how the online works though but so stick with stay tuned for that and you also get the show ad free unless we bake them in most",
            "start": 1883.87
        },
        {
            "text": "like I'm gonna do next **** week with Everybody's Golf I don't know how the online works though but so stick with stay tuned for that and you also get the show ad free unless we bake them in most importantly if you subscribe to us on Twitch you get enter to win each and every giveaway even if you're not here one of those days it don't matter remember if you've Amazon Prime you have Twitch Prime and you need to give away that free sub each and every month so why not give it to us you can also amplify your chances but go to Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames there the $10 and up level you can subscribe to Kinda Funny get early access to many of our videos and get enter to win each and everything we give away on anytime we give away anything now tell them one more thing we sponsor most Uber a bunch of Greg the summer is almost over it sure is is there anything that you haven't done that you've been trying to do even rather raising some money for a rainy day",
            "start": 1948.13
        },
        {
            "text": "one more thing we sponsor most Uber a bunch of Greg the summer is almost over it sure is is there anything that you haven't done that you've been trying to do even rather raising some money for a rainy day planning to take Jen out some nice big I haven't plan and take Jen out for rainy days yeah yeah well if Jen loves eating in the rain she loves it give her a bowl of soup in a great day she's happy as a clam well if you didn't have enough money to to make that dream happen Greg you might need the ultimate side hustle and do I have the job for you sure check this out if there's something you want to accomplish in getting extra money can help you do it driving with Uber's an easy way to earn extra cash when you want on your schedule that's why I driving with Uber is the ultimate side hustle and you can make every day payday thanks to Uber's Instant Pay you can cash out straight from the app up to five times a day so you can just view it if you were trying to get some some coffee",
            "start": 1985.74
        },
        {
            "text": "hustle and you can make every day payday thanks to Uber's Instant Pay you can cash out straight from the app up to five times a day so you can just view it if you were trying to get some some coffee share some of the sweet sweet coffee what about the soup or some soup if you want you should get Jen's soup you can you can drive okay then use the app get the money soup instant I stand by this as I've said it before I'm a good driver I'm a sociable person I like to do things on camera mm-hm we would just buy a Kinda Funny car we could then film me going and be you know exactly exactly okay and then we in hey you're getting me over cool you're gonna be on this show with me alright let's go well if you wanted to do that Greg you can make the most of your summer during the extra cash when you want to help meet your goals get your side hustle on sign up to drive with Uber today go to Uber.com/DriveNow that's Uber.com/DriveNow certain restrictions apply see site for details",
            "start": 2029.64
        },
        {
            "text": "want to help meet your goals get your side hustle on sign up to drive with Uber today go to Uber.com/DriveNow that's Uber.com/DriveNow certain restrictions apply see site for details I don't know I don't a bad car well it's not like a car can we get a Batmobile here getting after one you're gonna do one actually I want a cool car yet okay okay nice one wave it away I'll walk in the dark on Xbox One to my dude Steven Osland Patreon.com/KindaFunnyMen go home go home he's all over yes he is great man you have been great things now speaking of great men and women doing great things Greg wave yeah we have a PS I Love This XOXO for Tim to read there you go you got a KindaFunny.com/BestFriend two nominees some of the community doing cool stuff just like AJ Meadows did shouting out DJ Kento Dean Ware not only I want to give DJ Kento a shout out because he has been one of my Best Friends for years now not only is he an avid contributor to the Kinda Funny",
            "start": 2072.09
        },
        {
            "text": "AJ Meadows did shouting out DJ Kento Dean Ware not only I want to give DJ Kento a shout out because he has been one of my Best Friends for years now not only is he an avid contributor to the Kinda Funny community but he's a totally rad and generous dude to anyone lucky enough to call him a friend all the Kinda Funny Best Friends should make getting to know him a priority your lives will be better for it shout out to DJ Kento you're a cool **** and a great Best Friend can we send some sweet nasty love to at DJ Kento on Twitter pretty please kay thanks bye boys do that soon after we did it and it's done dude your Kento you can't do another homie he is definitely the homie yeah alright now it's finally time to talk about comic comics yeah we got just dump the news unless it's Joker movie related it's just taking too long to get it Required Reading Black Science Vol. 1 submitted by one big dog Kevin Coelho Kevin's one of your favorite comic you said correct sure it is Tim plus let",
            "start": 2129.77
        },
        {
            "text": "related it's just taking too long to get it Required Reading Black Science Vol. 1 submitted by one big dog Kevin Coelho Kevin's one of your favorite comic you said correct sure it is Tim plus let me tell you right now great yeah we've been doing five or six of these so far hands down my favorite one why yeah the thing is there's a consistency to this from start to finish well I'm just like wow they got me with the the pace they got me with the action I love the character designs yeah like they're the main cast is like whatever but all the other characters and the different dimensions and **** they do do Wow the the what's the proper way to say Native American the night I didn't know if you meant yeah the Native American characters are so rad new designs are amazing and then when you get like the Frog people look super cool and what this boils down through to me is it reminds me a lot of the 2009 Star Trek movie where she made me care about space and all",
            "start": 2168.95
        },
        {
            "text": "amazing and then when you get like the Frog people look super cool and what this boils down through to me is it reminds me a lot of the 2009 Star Trek movie where she made me care about space and all these like aliens and **** and the way that I normally don't care got a Star Wars guy I love Star Wars sure cool Star Trek never gave a **** that movie made me give a **** it was because it pulled me into the world this pulled me into the world and I cared about all the designs of the characters so much and the story super fast pace kept me going places and it never reaches any height that it's like oh this is life changing your game changing it feels like a really fun action movie and I love that cool how do i yeah I know when you what you said it yes but interesting pick yeah I mean it's the arts nice and it's I think I think part of it is just me you know what I mean like it's it's a lot like Sliders which is the show I liked or whatever but like I thought the worlds they were",
            "start": 2227.51
        },
        {
            "text": "it's the arts nice and it's I think I think part of it is just me you know what I mean like it's it's a lot like Sliders which is the show I liked or whatever but like I thought the worlds they were jamming to weren't that fascinating in a way I just thought we didn't give enough time to do stuff on those worlds I would rather see more of that I thought the cast is a bit too big to the point that even in this first trade the deaths I just didn't find meaningful or whatever like when Warren goes down again Required Reading show series it's like okay that was the one that smarmy business guy who of course is just an **** it's like yeah alright whatever like Grant isn't a good guy which isn't bad like I like the fact that he's multi-faceted or wherever but again it was just like it is in terms of art I think arts pretty it gave me points of like having trouble following along really Rebecca is talking to his daughter there's a big something happened I forget what and then we went",
            "start": 2273.22
        },
        {
            "text": "in terms of art I think arts pretty it gave me points of like having trouble following along really Rebecca is talking to his daughter there's a big something happened I forget what and then we went back and I had a good page back I'm like who did what oh when Rebecca kills the guy by something driving him in the water to keep shut up which is a cool thing ah I was like wait is this the daughter is this for a second I go back and identify by earrings and stuff yeah yeah and especially when they're the same out exactly you're in the same space - yeah but it's an interesting concept I feel like I almost want to give it another volume but it was just like at no point reading this was like I am hooked I gotta know exactly it's really interesting yeah so I would it's caught your attention a little bit keep going if you really like it definitely keep going to share it better and it is very fast-paced want to come over here and we're gonna talk a lot about this one your how many volumes in",
            "start": 2312.65
        },
        {
            "text": "bit keep going if you really like it definitely keep going to share it better and it is very fast-paced want to come over here and we're gonna talk a lot about this one your how many volumes in are you right now uh I believe I'm caught up okay whatever its current okay and it's I love the art style my favorite thing about the art style is I feel like it sells the action scenes very well what I like where there's a lot of things where it comes out from the panel's and like there's like four or five times that it does is can you zoom in or give me the one yeah yeah like that where kind of comes out through multiple panels yeah I think it's super cool and it like ties it together and I add actions always hard to show and yeah in comic books and I feel like this one does a really good job of making it clear all right yeah I want to like it because of the space stuff but I I'm like I didn't think you liked it because of how much action like what's going on I didn't know if that would hook",
            "start": 2357.67
        },
        {
            "text": "making it clear all right yeah I want to like it because of the space stuff but I I'm like I didn't think you liked it because of how much action like what's going on I didn't know if that would hook her or not so I'm like this recommendation was for the Best Friends because this is a comic that I really really enjoy and I'm glad you liked it and I say give it a little bit more another volume because the the story starts to develop in a really cool way and the character is kind of the more separation happens and like it's it's really cool there's the first shot that really sold me where I was I I actually really like this the beginning of it reminds me exactly of Star Trek to the opening scene of Star Trek - were there on that like red planet running away from the I'm like this is the exact same thing it was the miners right it doesn't matter but yeah but then there's a shot where it shows them is like oh we can't jump off this this cliff and it zooms down there on this giant turtle",
            "start": 2407.35
        },
        {
            "text": "same thing it was the miners right it doesn't matter but yeah but then there's a shot where it shows them is like oh we can't jump off this this cliff and it zooms down there on this giant turtle thing and then the next shot is like a bunch of the giant turtle things like this looks really yeah like I love that they'd really did a good job of creating the world and having a lot going on and then we went to the next world totally different it's like very very different and like it's a little bit just like confusing I think just seeing these totally different worlds and then they jump to another world it's totally different than this these characters here like what's going on there's like stripper fish yeah that's a cool scene to like I like that part of it but I think if you commit it like pays off really well because there is like an overarching story that like like why is that why are things going wrong yeah yeah all that which one is we looking at here it's hard to see the turtles",
            "start": 2453.8
        },
        {
            "text": "pays off really well because there is like an overarching story that like like why is that why are things going wrong yeah yeah all that which one is we looking at here it's hard to see the Turtles yeah it was the Turtle and all the Turtles I'm just look at the colors in the chat Nikolai Gang said Nikolai Gang says I got completely caught up and I was until volume 3 was like okay I like I really like this now Mr. Yaz Man 300 says I'll buy for the stripper fish is a really **** up scene yeah so that's not what's the required reading for next week oh no chat what do you want to read for next week you gonna shout Slipknot, Kev you look like you're about to say something well through the chat has to say they put stuff on they can say what's in there well they the chat I want to see your suggestions for what we all read together and go on this one item what are you pulling this week this is a this is an old comic that a long time ago but I was I'm gonna I'm gonna go back and catch up on my",
            "start": 2497.09
        },
        {
            "text": "for what we all read together and go on this one item what are you pulling this week this is a this is an old comic that a long time ago but I was I'm gonna I'm gonna go back and catch up on my trip to Vegas The Wonderful Wizard of Oz okay they did a run with Marvel and the art is beautiful which is well this is a really cool story and Oz is a really interesting world with a lot of cool characters once you get beyond the original movie yeah and so this series kind of covers the plot of the original movie it's a six-issue run then there's like six or seven follow up series that are other six issues that take place and other things in Oz and it's really cool and it's not dark and gritty but like The Tin Man is cooler than he was in the movies in sevens it's a kid's thing but it reminds me of like Pixar movies where it's like there's stuff for adults too so check it out for me I didn't submit a link because I'm dumb obviously Generation Gone issue two is out right now this is the one of",
            "start": 2548.84
        },
        {
            "text": "like Pixar movies where it's like there's stuff for adults too so check it out for me I didn't submit a link because I'm dumb obviously Generation Gone issue two is out right now this is the one of these Millennials getting superpowers it's drawn by our Kinda Funny best friend who puts all the Kinda Funny references in there but it's also a fun book I liked issue one a lot one of the main characters in and he made look like her a Okajima which I'm a fan of and then of course now get cooler he's about to pull it up number two is out right now for it what these kids dealing with having superpowers and apps like chronicling yeah and what's really cool that I don't see a lot of comics do is the fact that is we look at the cover here yeah you look at the cover here this actually is like the first panel of the comic mmm like you open the page in this it's the same way issue one did the exact same thing to where the actual cover is a panel that starts the story it's not some red herring",
            "start": 2592.52
        },
        {
            "text": "first panel of the comic mmm like you open the page in this it's the same way issue one did the exact same thing to where the actual cover is a panel that starts the story it's not some red herring exactly it's not trying to sit summarize everything it's cheaper right there you see right there he's wearing a Kinda Funny hoodie bottom right a screen but outside of that odd man it was who is it Flynn Lives over here was asking me his Nightwing: The New Order on my list it is I might pull this this week issue one of Nightwing: The New Order let me summarize it for you Nightwing: The New Order is the story of a future world without weapons quote quote unquote weapons where superpowers have been eliminated in the outlawed the man responsible none other than Dick Grayson aka Nightwing now leader of a government task force called the Crusaders who are charged with hunting the remaining supers but when events transpire which turn the Crusaders aimed towards Grayson's own family the former Boy",
            "start": 2632.55
        },
        {
            "text": "of a government task force called the Crusaders who are charged with hunting the remaining supers but when events transpire which turn the Crusaders aimed towards Grayson's own family the former Boy Wonder must turned against the very system he helped create with the help of the very people he's hunting for you the very people he's been hunting for years the last metahumans in the DC Universe don't miss this new bold new vision from the team behind the New York Times bestseller Batman: Gates of Gotham sounds really cool made it to my list yeah I'm interested ok now look at in the chat yeah to that I'm seeing a couple times that we've read we know we can recommend American Alien because people like oh we should get Sharon and some love and Sex Criminals what I want to do for American Alien is hold off because again they're not collected yet it's October I believe is what we talked about it's win no wait movie I'm sorry you were talking about Green Valley thank you the next land is",
            "start": 2671.58
        },
        {
            "text": "is hold off because again they're not collected yet it's October I believe is what we talked about it's win no wait movie I'm sorry you were talking about Green Valley thank you the next land is yeah yeah no American Alien is totally collected let's totally do that weren't you insured hell yeah bye bye Max Landis your Canadian required reading for next week's Kinda Funny Wednesday Comic Show we expect you all to go read it have fun because it's amazing we love it mm-hmm we'll talk about why it's amazing yeah I'm damn gonna love it now time for the old three and three we're gonna go to the chat read three things from the chat and three from the sub-only chat okay that sounds like a good plan to him I like your headset good hey well for 35 cents can anyone link me the casual cosplay website it is SixOnClothing.com it's been links again cultured they'll link it again I tweeted an Instagram to two you can find it there - Mariana Pro says guys Taylor Swift what happened she finally dropped",
            "start": 2712.38
        },
        {
            "text": "is SixOnClothing.com it's been links again cultured they'll link it again I tweeted an Instagram to two you can find it there - Mariana Pro says guys Taylor Swift what happened she finally dropped information about cuz she did oh yeah go to it twitter.com/TaylorSwift13 Twitter tweet Twi GT yard it's a single tomorrow Reputation album November 10th yeah that's farther than I wanted to yeah I know I wanted it to be instantaneous too but we get a single tomorrow what's wrong what are you making the grimace of I don't I'm not I don't not feeling it so far I don't like this album art if it is and I don't really like the yeah this is is isn't it based on look at I mean it answers the second image shows it's ready table shows all newspapers and stuff it's my head masthead title you know this looks like snappy a **** what like you know you didn't have to be cryptic you're not coming out with like a a two-disc prog album tell you this amazing so it's gonna be pop singles",
            "start": 2760.62
        },
        {
            "text": "you know this looks like snappy a **** what like you know you didn't have to be cryptic you're not coming out with like a a two-disc prog album tell you this amazing so it's gonna be pop singles enough yeah sock you suck I just November 10 but I don't like that it should be closed tonight yeah yeah I know that it's like everyone else saw my albums it's like now or next month Brian Reich Writes Code says Andy I'm gonna **** murder you oh yeah so there you go be careful Andy I'll protect you I'll be your champion many won't Mighty Mouse 56 Tim have you ever watched the anime FLCL think Nick, sir watch it I have not but I watched an amazing video by Captain Christian on YouTube breaking down why he loves it and it made me realize I don't need to watch it but there's a lot of really cool things going on in it and Seven Optics says Greg when Disney leaves Netflix do you see DC coming in with their own Netflix series interesting question I'd honestly probably see Image doing it",
            "start": 2817.68
        },
        {
            "text": "cool things going on in it and Seven Optics says Greg when Disney leaves Netflix do you see DC coming in with their own Netflix series interesting question I'd honestly probably see Image doing it more that seems more like a crazy Image like we're gonna put a Saga comic or whatever anime whatever column she's so amazing that'd be the way to do it I was served and also they got that deal with the Mark Millar now so Mark Millar Universe in the mail our universe Rudia 87 says I hope Kanye comes out with an album on November 10th I'd be amazing it would it be hey would you feel like more people would care about Taylor Swift I agree some glad we all agreed with this I agree to Ear Sins Greg I've heard that you if you complete Everybody's Golf with Shuhei Yoshida it unlocks the ability to change your PSN name that'd be **** the best thing ever we're already a subscriber only mourning the benefits ha Falafels says what's the best Teen Titans comic wow that's a loaded question Marv Wolfman ****",
            "start": 2884.12
        },
        {
            "text": "PSN name that'd be **** the best thing ever we're already a subscriber only mourning the benefits ha Falafels says what's the best Teen Titans comic wow that's a loaded question Marv Wolfman **** from way back in the day was awesome people really loved that personally I like I love Geoff Johns when it was Robin Superboy Wonder Girl all that jazz I think that runs **** phenomenal it's Geoff Johns who's great mmm DJ Munch-Munch this is Tim I watched your episode of Fan Service on Rooster Teeth and against all warning decided to binge all of School Days the most insane ending for the worst characters I've ever seen yeah School Days is a it's something people get irrationally mad about that show I guess it really triggers people it goes too far it goes too far School Days, School Days it's a it's an anime about a bunch of high school kids yeah and there's this one dude that gets like he realized that realizes he can have sex with people and he ends up kind of abusing that and it turns",
            "start": 2931.64
        },
        {
            "text": "a it's an anime about a bunch of high school kids yeah and there's this one dude that gets like he realized that realizes he can have sex with people and he ends up kind of abusing that and it turns in ways I use my powers no no just like it's yeah you get to get to the sex okay like we've all been there and there's like a love triangle and spoilers it ends with a lot of blood oh wow it's like it's a although I would say fun but the high school drama and there's like a lot of just characters that you know back stabbing each other in love and stuff and then yeah that it ends with a lot of stabby stab all right Drew Baca 13:13 says Greg what did you think of Southern Bastards of course is a comic recommended by my Kinda Funny Games Daily Show host Daniel Dwyer who's in the other room right now I bought it when he recommended it last week brought it home and Jen's father read it and loved it and I haven't had the time to read it yet and I'll be entertaining I'm doing over these people",
            "start": 2981.45
        },
        {
            "text": "now I bought it when he recommended it last week brought it home and Jen's father read it and loved it and I haven't had the time to read it yet and I'll be entertaining I'm doing over these people Kevin have you heard about the Queen biopic no I'm not in the chat here J Peck 1098 says what do you think of the resent what do you think of the recent casting announcement of the band band mates of the Queen biopic are you a Queen are you Queen fan and then links us out here to Bryan Singer's Bohemian Rhapsody this is Hollywood Reporter yeah I don't know yeah that's the problem a huge you love Queen people and then Ryan Santilli gets the first earned last question have to take do you guys ever by physical comics from the shop downstairs Kevin does every Invincible Kevin does I'll do it when I either wanted to go down and buy a bunch of stuff line and see if I like these trades and then like last week when Danny was like oh Southern Bastards it's great I went downstairs and popped in there's",
            "start": 3036.5
        },
        {
            "text": "wanted to go down and buy a bunch of stuff line and see if I like these trades and then like last week when Danny was like oh Southern Bastards it's great I went downstairs and popped in there's like throw them some business when I came I'll make experience Outpost Gitmo hook up if you're a big old s come by say hey cool Greg sent me for the mini comics going by it yeah also American Alien about every single issue when they were coming up nice and remember American Alien you're required reading for next week's comic shop mm-hmm Tim yes that's it yeah now it's time for Kinda Funny Games Daily I'll read all the subs and re-subs and all that stuff meanwhile you Daniel Dreyer getting ready talk some games mm-hmm it's gonna be a good job yesterday with Andrew I really enjoyed it was only through the show but it's good yeah yeah wasn't as good okay good if you didn't know a gentleman this has been the Kinda Funny Morning Show each and every weekday here on twitch.tv/KindaFunnyGames",
            "start": 3088.13
        },
        {
            "text": "the show but it's good yeah yeah wasn't as good okay good if you didn't know a gentleman this has been the Kinda Funny Morning Show each and every weekday here on twitch.tv/KindaFunnyGames we come to you with the nerdy news we want to talk about then we jumped on the chat answer your questions comments concerns we **** amount movies we make fun of Fight Fall aka Candy Andy aka Handy Cortez feel like that follow the channel subscribe do it do all that business we give away a game each and every day you can win by being here or subscribing to us Amazon Prime you got Twitch Prime you got to give to somebody give it to us please you know it's got a Patreon support us there it's really however you want to get it new party mode up on youtube.com/KindaFunnyGames it's to the editing awesome ending like awesome awesome awesome ending like the very end so check that out oh SixOnClothing right here yeah I'll see you man outfit looking good I'm feeling really good in it",
            "start": 3127.64
        },
        {
            "text": "editing awesome ending like awesome awesome awesome ending like the very end so check that out oh SixOnClothing right here yeah I'll see you man outfit looking good I'm feeling really good in it yeah it was hot at first and then it just became that it just became is that skin part of you know how supposed to know this is how it's supposed to well until next time it's been a pleasure to serve you",
            "start": 3166.25
        }
    ]
}