{
    "id": 2901,
    "video_id": "AA9DD4K7stY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Troy Baker (Special Guest) - The GameOverGreggy Show Ep. 193 (Pt. 3)",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/greggy\n\nThe Kinda Funny store is having an End of Summer sale! Shop through August 20th for up to 40% off select items-  https://goo.gl/E3TpJN\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502866800,
    "duration": 2271,
    "transcript_chunks": [
        {
            "text": "Hey, you, you know what you need? Razors. You know what the Dollar Shave Club has? Razors. So stop paying so much for razors and join the Dollar Shave Club, you hairy person. They let me write this ad and I know you like being insulted a little bit, don't you, you hairy degenerate? Dollar Shave Club is the smarter choice. Get a great shave at a great price, conveniently delivered right to your door. Think of it as a life hack that keeps you near your video game console and not out at some store being eyeballed by that cashier. Yeah, I know you're looking at me, Tony. What are you going to do about it? Tim uses Dollar Shave Club's Executive Razor with that Dr. Carver Shave Butter and you know what he's always telling me? He says, \"Ooh, I'm a smooth boy, Greggy.\" And then he takes a bath. For a limited time, new members get their first month of the Executive Razor with a tube of Dr. Carver Shave Butter for only $5 with free shipping. After that, razors are just a few bucks a month. That's a $15 value for only",
            "start": 0.0
        },
        {
            "text": "members get their first month of the Executive Razor with a tube of Dr. Carver Shave Butter for only $5 with free shipping. After that, razors are just a few bucks a month. That's a $15 value for only five bucks. There are no hidden fees, no commitments, cancel anytime you like. You can only get this offer exclusively at DollarShaveClub.com/greggy. That's DollarShaveClub.com/greggy. Kevin made me read this ad multiple times against my will so I didn't laugh. Okay, what, have you gone on a trip yet with your lady? No, with your older, elderly. We're, we're driving to LA this weekend actually. Nice. Okay, to a friend's wedding. I, which is, is traveling a thing for you? Like what, Kevin? Jesus, this to give you a glimpse. The Friday, all the cool kids are going to Kevin Co's bachelor party in Las Vegas and it's about to be ridiculous. This guy has a wedding. He has, I'm going to one of my best friend's weddings in LA. Gone. Now they don't, they don't matter anymore. He keeps saying best friend too. We've never",
            "start": 50.68
        },
        {
            "text": "it's about to be ridiculous. This guy has a wedding. He has, I'm going to one of my best friend's weddings in LA. Gone. Now they don't, they don't matter anymore. He keeps saying best friend too. We've never heard this guy's name. My best friend says we were like four years old. Kevin, name him. That's a lie you made. Wow, he just pulled hero Miguel. Okay, Miguel Herard. Um, okay, well, you're going to miss a fun dude. Vegas, bro. You want to come to Vegas? He said he, I am in Boston. You always have an excuse. I would, I, I seriously totally be there. Shenanigans. I recommend you listen to not next week's episode of The GameOverGreggy Show. We're definitely going to get into the stories of it. Andy, you should be there too. Wait, are you, are you guys going to shoot from there? Are you going to? No, no, no. This can't be, this can't be filed to our social media accounts. There'll be some. So where you can, can you say where you're staying? No, we don't want to say that on camera. Okay, we're going to do that afterwards, but I do want",
            "start": 113.48
        },
        {
            "text": "be filed to our social media accounts. There'll be some. So where you can, can you say where you're staying? No, we don't want to say that on camera. Okay, we're going to do that afterwards, but I do want to point out that it'll be actually a really good episode. So again, to what he's saying for programming note, tomorrow live, we're recording with Anthony and Guber. So that'll be the week after Troy's. But the one we're recording, it'll be Kevin's Bachelor story. Mariel Turney. So that'll be a great pairing for everything that's about to be. Wait, wait, Turney? Yeah, you ever heard of her? Yeah, she's going to be on the show. Former coworker of mine. Cause I used to let you. No, they're not. They said they're, they're having a lot of trouble. They wish they had a content plan as strong as we did with all your party modes that are doing so well. Oh, thanks, thanks. Good segue. We're just trying to make sure Andy doesn't leave ever. Understood? Because it's one of those, Andy is too talented. Wait, I, oh, so",
            "start": 167.16
        },
        {
            "text": "all your party modes that are doing so well. Oh, thanks, thanks. Good segue. We're just trying to make sure Andy doesn't leave ever. Understood? Because it's one of those, Andy is too talented. Wait, I, oh, so this is the question. Is it, is traveling, uh, is it your thing? Like it is my thing. I, I don't feel, I feel so comfortable on a plane. I love flying. I love the whole process of flying. I love it. Okay, you're a monster. I, I love. No, are you not? I hate it. I hate it so much. You're, you're cramped. Okay, so here's the first class once. Okay, that's the key. The key is they all spend a lot of money. No, no, no, no, no, not necessarily. Just commit to somebody. Now, if you're like Greg and I, you, you, you hit your star or hit your wagon to the wrong star and they get bought by Alaska Airlines. Now, for the record though, every time I fly Alaska, I get upgraded to first class now because I'm Virgin America Gold. So it does transfer. Yeah, okay. Oh, yeah, I know your, your points and everything transfer. Yeah, yeah, yeah. I just know if your",
            "start": 205.96
        },
        {
            "text": "I fly Alaska, I get upgraded to first class now because I'm Virgin America Gold. So it does transfer. Yeah, okay. Oh, yeah, I know your, your points and everything transfer. Yeah, yeah, yeah. I just know if your status, do your status does. I have my Alaska VIP, whatever. But then I just complained about American Airlines once and they moved to gate and got me a cart to drive me. I think I might switch over there. We've never told the story on the way. We've never told the on the way to Rooster Teeth to RTX. I was, uh, I was obnoxiously late. It was like the most Andy move ever. So I get, I get a text. So Andy's the most timid. Like I don't want to deal with problems. No, no, no, check this out. Troy, girlfriend, this is ridiculous. I get a text. Like eventually me, Nick, Nick's wife and Gia get into the, the gate and we're all hanging out just waiting for this thing. And Nick's like, \"Is what's up with Andy? Is he going to be here?\" And I'm like, \"Oh, yeah, I'm sure he's fine. Like we don't need to worry.\" I get a text from Andy, \"Hey, when",
            "start": 255.4
        },
        {
            "text": "out just waiting for this thing. And Nick's like, \"Is what's up with Andy? Is he going to be here?\" And I'm like, \"Oh, yeah, I'm sure he's fine. Like we don't need to worry.\" I get a text from Andy, \"Hey, when are you guys going to get here?\" I'm like, \"Oh, we're here, dude. We're like in the gate.\" And he's like, \"Oh, man, I've been waiting for you guys out at before security.\" Now that's a great question. Why would for like 40 minutes? Why, why would you wait before? I understand this is your first work trip with us ever. We messed up. We should talk. I've never had anybody buy tickets for me, right? I've never had a company buy plane tickets. I'm used to like, \"Oh, so I'm sorry when Big Bad Rooster Teeth was sending you all over the world to meet your fans, they weren't sending.\" Well, I was showing up with employees at that point. So, so this time I showed up by myself, right? I didn't know I could just swipe a card and have my identification like pop up on the screen or whatever. So I'm waiting. So I'm waiting for Nick",
            "start": 301.64
        },
        {
            "text": "so this time I showed up by myself, right? I didn't know I could just swipe a card and have my identification like pop up on the screen or whatever. So I'm waiting. So I'm waiting for Nick and Tim. I've been waiting for Nick and Tim. I got there like an hour and ten minutes before the plane is about to take off. Um, and I'm just waiting. I'm like, \"Man, where are these?\" And eventually I'm like, \"I got to text them cause like they're not here yet. I got to figure out what to do, right?\" Um, and I've taken, I've been on several planes, right? Like I know the process. I'm taking, I've been on, I've been on several, which is actually three. At least seven. At least seven. So I don't know. Is many? Two, three is a few actually. So I didn't know that I could just buy my debit card, right? So eventually I text him. I'm like, \"Hey, uh, are you all here?\" And he's like, \"Yeah, we've been here.\" I was like, \"Oh, by this point the line to check a bag is so packed.\" And I'm like, \"How long are you gone for? Huh? How long are you gone",
            "start": 337.2
        },
        {
            "text": "like, \"Hey, uh, are you all here?\" And he's like, \"Yeah, we've been here.\" I was like, \"Oh, by this point the line to check a bag is so packed.\" And I'm like, \"How long are you gone for? Huh? How long are you gone for?\" Um, like four days. Borderline. I always take a bag. I have to take my hairspray. You think this happens naturally? You think this happens naturally? Trust me. Okay, you can get that down. I can tell you. Okay, so I'm like, \"All right, this line's packed.\" And Tim texts me. He's like, \"Dude, there's a red carpet area from Virgin America. They'll just like go over there and like tell them that you're really desperate.\" I was like, \"All right, I got to do this.\" Like, and I hate doing this, Troy. I hate doing this. I hate being the guy that's like trying to get something for free or trying to like, I hear you. Like, I hate that, dude. Even when I was a fan of Kinda Funny, I hated talking to them because I'm like, \"I don't want to be a burden to these dudes. Like I'm just a fan. Like I don't need to go say",
            "start": 382.04
        },
        {
            "text": "like, I hate that, dude. Even when I was a fan of Kinda Funny, I hated talking to them because I'm like, \"I don't want to be a burden to these dudes. Like I'm just a fan. Like I don't need to go say hi if they're busy, they're busy. I'll talk to them whenever, you know.\" Um, I just hate being that dude. So I had to, I had to bite the bullet and I, I went to the red carpet area, right? And there's like one person in front of me as opposed to like the 15 people in line for the check bags. And I'm walking up. I have a Virgin America card, a Virgin America credit card, not the like top level one. No, no, just one, the standard like silver member or whatever. So I walk up and I'm like, \"Hey, I'm, uh, here to get my thing.\" And I just like show the card. She's like, \"Oh, okay.\" But I, you know, I had to act confident. I had to act like I belong there. Exactly. You're supposed to be. I show her the card and she's like, \"Oh, are you a Virgin or are you an Alaska card member?\" And I was like, \"No, but I'm Virgin America.\" So I",
            "start": 430.88
        },
        {
            "text": "I had to act like I belong there. Exactly. You're supposed to be. I show her the card and she's like, \"Oh, are you a Virgin or are you an Alaska card member?\" And I was like, \"No, but I'm Virgin America.\" So I just like kind of like did that thing. She was like, \"Okay, uh, when's your flight? When does your flight leave?\" I was like, \"Um, like ten minutes.\" And she was like, \"Okay, we got to get you out of here. We, we got to go.\" So like Tim texts me, \"Hey, we warned everybody that you are running very, very late. We warned the people at the gate that you were like on your way.\" So I do the, I check my bag and it's all good. She's like, \"All right, we got to priority you.\" You checked your bag ten minutes before your flight. Yeah. And she was like, \"Hey, this is priority. We got to get it on there.\" So then I run, right? So then I run to the security area and the woman in the security line is like, uh, she's like, \"When does your flight leave?\" I was like, \"Ten.\" She's like, \"Well, there's something in your bag that we need to check in your backpack.\"",
            "start": 470.16
        },
        {
            "text": "security area and the woman in the security line is like, uh, she's like, \"When does your flight leave?\" I was like, \"Ten.\" She's like, \"Well, there's something in your bag that we need to check in your backpack, your carry-on, right?\" So she looked at two gallon jug of water. It's not water, it's urine for no reason. No, I forgot it was, oh, you know what it was? It was my, uh, it was my acne wipes. It's my acne wipes that sort of like blew the trigger or whatever. She's like, \"When does your flight leave?\" I was like, \"Like ten minutes.\" She's like, \"Oh, God, we got to get you out of here.\" Gave me the thing. I'm, doesn't matter if you have a bomb, we got to get. I'm sprinting to the plane, just running like this. Greg Miller, I'm sprinting horrible way. Kermit the Frog running like Kermit the Frog. Yeah, so I'm running and she's like, uh, and as I'm getting to the gate, the guy's like, \"Andy Cortez, you're running late.\" And I was like, \"I sure am.\" So I like got there and thankfully everything was good or",
            "start": 512.32
        },
        {
            "text": "Yeah, so I'm running and she's like, uh, and as I'm getting to the gate, the guy's like, \"Andy Cortez, you're running late.\" And I was like, \"I sure am.\" So I like got there and thankfully everything was good or whatever. But dude, that's the most nervous I've ever been before a flight. I've never had that happen to me in my life. Now being on the other side of it, I had to deal with Nick who, I don't know, Nick does not deal well with, \"Where's Andy? Why isn't Andy here?\" And I'm trying to be cool. I'm trying, \"Andy got this, man. Andy got this.\" Meanwhile, I'm like texting. I'm going to read you guys the text between me. Little did you know I was sitting like waiting for like an hour. You're like Spider-Man: Homecoming. In front though is I went up to the dude and I was like, \"Hey, man, I'm just letting you know one of my friends is running late. Can we stall this plane as long as humanly possible?\" And he, he was a cool dude. Like, \"You know what, we'll do what we can, but we have to leave at this certain time. There's",
            "start": 554.52
        },
        {
            "text": "of my friends is running late. Can we stall this plane as long as humanly possible?\" And he, he was a cool dude. Like, \"You know what, we'll do what we can, but we have to leave at this certain time. There's nothing, no way around.\" Look, Alaska about to my ass. I was like, I was like, \"Well, I call him, doesn't like Mexico.\" I was like, \"I call him Andy, but like his, his name is actually.\" I was like, \"I can't say it correctly. Andrés.\" I was, \"I'm not even going to try.\" But it's A-N-D-R. It's like undress. Yeah, it's like undress. Yeah, I'm not even going to. There's a fun way you say it that I just can't do. Yeah, and I'm like, \"So just call him Andy if you see him.\" So that's why he called you Andy. But let's go through here. Uh, you, you just go at 9:35 a.m. \"You're not here yet, right?\" I was really nervous. And I go, \"Yeah, we are.\" \"Oh, I've been waiting out near the line. We're at the gate. I don't have the confirmation in for or anything. Just swipe your credit card in the thing.\" And then like I send him the confirmation picture and he",
            "start": 593.4
        },
        {
            "text": "been waiting out near the line. We're at the gate. I don't have the confirmation in for or anything. Just swipe your credit card in the thing.\" And then like I send him the confirmation picture and he goes, \"Man, I'm an idiot. I'm waiting line now to check my bag. I've been here since 8:30 LOL.\" Not LOL. \"Oh, no. Tell them you're running late if there's no line on the carpet area. I would just go there and tell them you're.\" He sends me a picture of like how long the line is. \"It's packed here.\" I'm like, \"No, no, no, no. The red carpet. I don't know what that is. The pre-bag check. Like the line for Virgin Gold people. There's an actual red carpet.\" And I look, \"There it is. I'm on it. Let me check. Okay, they let me do it in line for security.\" I'm like, \"They just started boarding. You got to be aggressive, man.\" He goes, \"KK.\" And I was like, \"Ask people if you can cut. You got this. How far out are you? I asked them to stall as much as possible. You got four minutes, dude.\" But you, so you were asking me this stuff as I was getting in line for",
            "start": 636.28
        },
        {
            "text": "security. I'm just looking at my phone like I don't want to like, I'm so like, I'm so nervous about missing this flight. And we all were on the flight. Andy Cortez gets on. Check it out. I'm like, I've been a fan of Rooster Teeth podcast forever and all they always talk about is like problems with flights and like problems with being late to their checking or whatever. And like this whole time I've been so proud that like on the 15 flights I've taken in my lifetime. Oh, now it's 15. I've never had to worry about being late. And this is the one time that I was like, I messed this up. For me, it's the biggest change about, \"Hey, how are you? Could see you, Troy.\" It's the biggest change about what Kinda Funny's become in the way that it's no longer just what was the four of us, the five of us and we brought all the",
            "start": 687.16
        },
        {
            "text": "about, \"Hey, how are you? Could see you, Troy.\" It's the biggest change about what Kinda Funny's become in the way that it's no longer just what was the four of us, the five of us and we brought all the. Well, it's cause we were all so seasoned at traveling that why would I ever think to explain to him how to get on a plane? And it wasn't until we were, because this is, you know where the story is going, where I, Andy, should, I didn't think I'd have to tell him just cause I, I think of Andy as a full-blown adult who knows what he's doing. Why would he have to be told about this? But it was when we were packing up to go to E3 and we're all going to come to work, do some work and then go to E3. And Cool Greg shows up. Cool Greg shows up with a plastic shopping bag full of clothes. And we were like, \"What's that?\" And he's like, \"It's my clothes for the week in LA.\" We're like, \"We got to get you some kind of bag.\" To defend him a little bit, he thought he had a backpack at home. The guy at the Tumi store at, at the airport was",
            "start": 726.76
        },
        {
            "text": "he's like, \"It's my clothes for the week in LA.\" We're like, \"We got to get you some kind of bag.\" To defend him a little bit, he thought he had a backpack at home. The guy at the Tumi store at, at the airport was like, \"Finally, there's a reason why I'm here.\" Oh, no, no, we took care of him before that. He, he came here thinking we'd have some kind of bag. We went in into the closet at the giveaway closet and we had, uh, these ThinkGeek, uh, Zelda shields. And so we took one of those from Breath of the Wild and stuffed all clothes. It's a Zelda shield, but it's a backpack. So it's a circular backpack. I dig it. About like three inches deep maybe. You, he packed it full. That's my favorite thing about it. Show, show the people, show the audience too. My favorite thing about it was when we were at the airport and it came out of the security, the security, um, whatever the hell it's called, the, what's it called, belt. And it falls off and it rolls away like 15. As I was waiting there, I see Cool Greg's bag like roll three feet. Yo,",
            "start": 773.84
        },
        {
            "text": "the security, um, whatever the hell it's called, the, what's it called, belt. And it falls off and it rolls away like 15. As I was waiting there, I see Cool Greg's bag like roll three feet. Yo, that's mine. Sorry about that. They fit them. They fit Cool Greg's. Everything. What's this topic about? Troy Baker. Whole show. I was just wondering. The whole point of me even bringing this up is that if travel is a thing for you, like if you want to do that, I cannot recommend traveling with your partner if on a romance, the lady. Yeah, you just, you need to know what you're getting into. Like I did that. One of the first things we did, I was like, \"Let's go and play together.\" How, how, how first? Not your like second date, right? This is beyond like, \"Ooh, we're, we're something special.\" Maybe a month then. Okay, we went to Vegas, uh, and then I was like, \"Okay, you're cool. Now I need to see you travel internationally.\" So within a couple months we did. And she could correct me, uh, but I know for a fact, uh, was, uh, New Year's Eve.",
            "start": 818.6
        },
        {
            "text": "to Vegas, uh, and then I was like, \"Okay, you're cool. Now I need to see you travel internationally.\" So within a couple months we did. And she could correct me, uh, but I know for a fact, uh, was, uh, New Year's Eve. Like we started dating in October. So that New Year's Eve, we were in Mexico. And I was like, \"I need you to travel. I want to see you go through like Customs. I want to see you like pack.\" Like the Troy Baker trials here. See, because I like, look, this is a thing for me. Like I, I love traveling. I believe, look, we have looked for trillions of miles in every direction and we still haven't found a place like this. So I believe that you have to explore every inch of this planet. And there's something that's, first of all, something so that is so humbling when you go around the world and you see both the, the similarities, um, and the differences. And you realize that you fit in into this much larger. It gives you a more of a macro view of who we are as a, as a people. And you're not so closed off. And, and you",
            "start": 870.8
        },
        {
            "text": "similarities, um, and the differences. And you realize that you fit in into this much larger. It gives you a more of a macro view of who we are as a, as a people. And you're not so closed off. And, and you also see that everybody struggles with the same things. And so you're just kind of like all connected in that. So that helps. But as far as like traveling with your partner, there's nothing to me that's better about that. Because when you go to some place that's, that's foreign and the only thing that's familiar is the person that you're with. A, that better be a really good hang. And B, it just galvanizes the two of you because you're, you're like, \"Let's get lost together.\" And you feel more adventurous. You're a little bit more whimsical. Um, and some of the best experiences we've had, like the first time that Pam and I went to Paris, um, we're sitting at this little sidewalk cafe and I'm like, \"This is, this, I've been waiting to come back since I was 13 years old with a, with my lady in Paris.\" Like this is what",
            "start": 925.04
        },
        {
            "text": "Pam and I went to Paris, um, we're sitting at this little sidewalk cafe and I'm like, \"This is, this, I've been waiting to come back since I was 13 years old with a, with my lady in Paris.\" Like this is what I've been waiting for. We're sitting there. It's this beautiful spot and they're bringing us wine. We got bread and cheese and and this guy walks up was Alfred. He goes, \"It, it was Alfred just like in The Dark Knight Rises, man. Good movie. Great movie.\" I across and see your face. No, terrible, terrible. Just in the movie when he flies off. God damn it. Uh, but this guy comes like, \"No, no, no.\" He holds it the sign. He like points. Like, \"I don't, I don't, I don't know what you're saying, man. Sorry.\" He's like, \"Okay.\" And he leaves. And the, the guy was taking care of us comes over and he goes, goes, \"Who is it?\" I was like, \"Just some guy who's asking for money or something.\" He goes, \"Did you have anything on the table?\" But no, I didn't. \"Son of a, where's my phone?\" And he put down the sign, grabbed the phone, leave, fight, blue. And",
            "start": 971.44
        },
        {
            "text": "some guy who's asking for money or something. He goes, \"Did you have anything on the table?\" But no, I didn't. \"Son of a, where's my phone?\" And he put down the sign, grabbed the phone, leave, fight, blue. And so there I am in Paris, no phone. And I went, I started run after the guy and I looked, I was like, \"Okay, I'm in Paris with my girl on a beautiful day. I have two options here. I can be a douchebag and I'm going to go chase that guy down and get my phone back. Never going to find the guy. Telltale choices came up. Or do I go back to her and go, 'Let's get another bottle of wine.'\" And she thinks I am cool as. \"This guy can afford multiple phones.\" So that's what we did. It's a $600 phone. Like my favorite, one of my favorite memories in Paris. So I just, I think that that traveling with your partner, if that's a thing for you, if you don't give a and you're like, \"I, I just want to live on a farm and like not do anything.\" Then don't worry about it. But if it is a thing for you, get in a car. Yeah,",
            "start": 1018.72
        },
        {
            "text": "if that's a thing for you, if you don't give a and you're like, \"I, I just want to live on a farm and like not do anything.\" Then don't worry about it. But if it is a thing for you, get in a car. Yeah, or get variation of it. Farm, maybe not, but like somewhere with a computer in a bed. You have to bait people stealing your phone. Tim, like, \"Hey, you want this?\" I will tell you a story though, Troy, tell. First time I ever had a flight with my girlfriend, Gia, we were flying to Austin and I had to understand how she is in a flight, which is very cuddly, which I'm like, \"All right, cool. I'll deal with this.\" Uh, we don't even start. Don't even start. We watched a movie called Batman Begins. Oh, I've heard of it. And now I've seen this movie. Film, foreign film. Yeah, this will give you a good window into Gia. So earlier you asked me, \"Did I teach Gia anything?\" She brought me The Bachelor. What did I bring her? I brought her the, \"What's this guy's deal? He dresses up.\" Hold on. And then I brought her, I",
            "start": 1073.24
        },
        {
            "text": "Gia. So earlier you asked me, \"Did I teach Gia anything?\" She brought me The Bachelor. What did I bring her? I brought her the, \"What's this guy's deal? He dresses up.\" Hold on. And then I brought her, I brought her the Batman. So we're watching Batman Begins and there's a, there's a pivotal moment in that film where, um, there are two parents in an alley with a young Bruce Wayne and they get shot and die. She spoilers audibly gasps. Could not believe it that Bruce Wayne's parents were dead and that's what made a Batman. And I was like, \"I had to pause it. That's going to with him. Like I loved it so much. I hope he bounces back from this. I hope he doesn't hold it forever. What happened? Did he go to an orphanage?\" Oh my God, it was so good though. I had to stop and be like, \"Nick, she didn't know. She didn't know.\" She's like the soft reboot of Ino man. She just like missed everything. Her first introduction to superheroes being Nolan's Trilogy. Oh, wow. What a bar. Is just, I mean, well, the first two",
            "start": 1117.92
        },
        {
            "text": "**** know she's like the re soft reboot of Ino, man she just like missed everything her first introduction to superheroes being Nolan's Trilogy oh wow what a bar is just I me well the first two movies **** you it **** over third one's good everything everything man no come on defensively the third movie I don't even think Nolan wanted to make that movie yeah and he's talented Christ it's not just me saying it was of a whole bunch of stuff you weren't sure what you wanted to do Dark Knight Rises or Batman v Superman what's the better movie Dark Knight Rises 100% thank you that's all see you won't get an honest answer out him because has Superman in it yeah I know it's the better super can be blowing an here's the holding up a Nazi flag and be like I mean it's still good it's an interesting interpretation of the character you're a **** you're a **** I'm just saying for Dark Knight Rises it wasn't a good Nolan Batman and it wasn't a good comic book movie and again I will to this",
            "start": 1169.28
        },
        {
            "text": "interpretation of the character you're a **** you're a **** I'm just saying for Dark Knight Rises it wasn't a good Nolan Batman and it wasn't a good comic book movie and again I will to this day I will always say I've said this since that movie happened I this is not a Batman v Superman thing I will always come up and be like I like Batman v Superman better right I think it's a better comic book movie your mom's name was Martha   there's a lot of level there do you understand cuz Bruce is a human and this is the first time he sees the alien K as a human get I don't know if you do I need to get I need she goes to the chopper where you going get her to Gotham just just over there I if you guys are busy had no idea that there was a river separating Gotham from Metropolis looks like your Dark Knight has betrayed you Greg no cuz we're still together that Dark Knight Returns isn't a good movie no I'm not saying that it's a great movie I'm saying that it's better than Batman Versus",
            "start": 1218.0
        },
        {
            "text": "your Dark Knight has betrayed you Greg no cuz we're still together that Dark Knight Returns isn't a good movie no I'm not saying that it's a great movie I'm saying that it's better than Batman Versus that's your only argument yes oh okay that let's get I want to be on the same page with you Dark Knight Rises is it a bad movie or is it just bad movie at all can you trust this guy who doesn't like dude dark if you guys want to talk about Game of Thrones being overhyped Dark Knight Rises' hate is on a whole other level of like watch the movie again Bane goes into the like they go into the stock trading center right yeah here comes a really cool moment he's going to tank the market he's no he's going to take every hostage and blow stuff up but okay there's that too he goes in before the Market opens right and then he's there for 15es minutes and leaves it's pitch black and it's pitch black why because we got to show the Batwing laziest riding traps all the cops underneath there and they always",
            "start": 1266.76
        },
        {
            "text": "right and then he's there for 15es minutes and leaves it's pitch black and it's pitch black why because we got to show the Batwing laziest riding traps all the cops underneath there and they always come out **** clean shaving Nolan was in a rush guys minor issues it's a **** movie I don't think he busy working on here no this is my thing this is my thing every stop for a second my problem with these small things we're calling out yeah there are small things they're dumb Nolan did such a great job with the first two movies of so **** real Rises is not nearly as good as Begins or Dark Knight I would never argue that but to argue that it is your real name Robin oh there you go with that that's fun that is I will fight people that is fun I will F I will f i I've been waiting for this for a long time go to the pl Kevin this isn't a you Kevin's my dude he's my muscle he just had to take shirt off a this is like I feel like I'm at the weirdest Thanksgiving dinner right now we've all",
            "start": 1313.6
        },
        {
            "text": "for a long time go to the pl Kevin this isn't a you Kevin's my dude he's my muscle he just had to take shirt off a this is like I feel like I'm at the weirdest Thanksgiving dinner right now we've all been at Uncle Greg is just like he starts crying for no reason and dessert hasn't even come my little Carlos from Arizona that you mentioned have you ever seen you like the new boyfriend that my sister's dating that I haven't quite figured out I want to be cool with you like go outside every once in a while to go smoke and Mom's weird about it but I kind of want to have a cigarette with he middle gear Sal cool um I I uh have you seen Following no okay if you want to to me if you want to distill Christopher Nolan down to his quintessence he and Jonathan Nolan both watch his first movie which is called Following it's black and white um it makes it makes Memento look like is linear it will **** with you it is beautiful Hitchcock um great storytelling character-driven movie um and it's all",
            "start": 1363.36
        },
        {
            "text": "called Following it's black and white um it makes it makes Memento look like is linear it will **** with you it is beautiful Hitchcock um great storytelling character-driven movie um and it's all about a guy who get becomes obsessed with following people and one day he follows the wrong person Twitter the prequel oh where do you stand on The Prestige okay so this was a I know I T I was like do I have strong opinions about The Prestige I don't know about do you how do you feel about The Prestige um it's so good we got to bring bourbon back to the game show we did it on the Kevin Show and it was nonsense by the end we were all speaking in the tongues Shai um I think it's a great movie it's a great movie yeah I think that first of all you got David Bowie yes as Nikola Tesla as Tesla um this the magician movie Yes you but this is like the weird thing where the it was early  000 but like late ' 90s early  000s there was a whole thing was like we offered a choice a and a choice B we had a",
            "start": 1423.12
        },
        {
            "text": "the magician movie Yes you but this is like the weird thing where the it was early  000 but like late ' 90s early  000s there was a whole thing was like we offered a choice a and a choice B we had a CO coconut Pepsi for every movie you had Armageddon you had Deep Impact you had The Prestige and then you had The Illusionist Illusionist you had all these different choices like it was probably the most frustrating time for writers in Hollywood oh what was a Volcano or The Core no no no no no uh or um Dante's Peak bam I can do my shitty movies all day long dude Dante's Peak they got over that death really quickly by the way all right keep going with the grandmother no no no with the main dude in Dante's D like no no no maybe it was D Dante's Peak is the one with Pierce Brosnan no I'm thinking of the I'm thinking of The Core oh yeah oh they get crushed they they **** man they they got over that death really quick Delroy Lindo yes burned up yeah Delroy Lindo pull that um bye Tim bye Tim where's Tim",
            "start": 1489.88
        },
        {
            "text": "I'm thinking of The Core oh yeah oh they get crushed they they **** man they they got over that death really quick Delroy Lindo yes burned up yeah Delroy Lindo pull that um bye Tim bye Tim where's Tim going bathro twice no now got car the I'm afraid that if I if I leave like I will be so far out of the conversation I'll come in I was like it's kind of like we are moving quickly you come back we talk about like M. Night Shyamalan's Avatar or something no that's even still linear from this um hold on hold on what what I do Tim's gone okay Andy's in Andy's in let him throw something out let's talk about what Andy wants to talk about is this a new topic I mean what the the whole show has just been maybe it's just been Rand pop shots what do you want to know about uh what do I want to know about Troy what are you talking about sure um I'm saying Andy there's a GameOverGreggy Show blank page in front of you you say something and we'll all keep vibing off of it you keep killing the vibe like you're",
            "start": 1539.28
        },
        {
            "text": "are you talking about sure um I'm saying Andy there's a GameOverGreggy Show blank page in front of you you say something and we'll all keep vibing off of it you keep killing the vibe like you're killing it gotum shut up Kevin so a few weeks ago Trident announced don't do the gum stuff are you serious we're going into gum right now Trident announced that they have unveiled a brand new flavor well that they have improved their flavoring that their flavoring is better than ever before for but I don't really want to come we'll move on to another subject he's not taking we'll hold on go with that for a second you can't stop Troy once the train leaves the station why you the train leave the station buy the ticket take the ride baby so let's say that there was bubble there there was gum there was **** flavored gum are we about to here we go there's **** flavored gum Troy let me let me let me pref you have you have **** flavored gum **** flavored gum um tastes like plapple and you're",
            "start": 1589.6
        },
        {
            "text": "**** flavored gum are we about to here we go there's **** flavored gum Troy let me let me let me pref you have you have **** flavored gum **** flavored gum um tastes like plapple and you're you're like talking to a chick and you're at a bar where we all right flavored gum you have C flavored gum you're talking to a chick a bar talking to a chicken in a bar and she's like I know I had such a great time anyway and she puts that in her mouth pops a c flavor gum what are you what's going through your head um I think that I'm going to have a great night or do you go I need to leave oh wait what oh it's kind of like the thing on her story this is like this I love saying in this universe there's a Trident that is comum flavored in this Nolan Universe it's on the store shelves you pick it up you fine she but **** flavored gum okay and and like you're with a girl she's like I wait wait it was so funny I was watching that and she puts in the gut and you see that it's comum flavor G",
            "start": 1636.72
        },
        {
            "text": "it up you fine she but **** flavored gum okay and and like you're with a girl she's like I wait wait it was so funny I was watching that and she puts in the gut and you see that it's comum flavor G she tells you this is the first time you we live in a universe where this exists you make a snapshot Batman flies by in the Batwing you don't bat eye that's just life here you see **** flavored gum on the box what do you do what do you do he goes I'm Gna have a great night I'm like are you he jumped at conclusion it was like a Matthew McConaughey oh because she likes this is really about you you're like automatically assume if she likes this I'm going to have a good night you're going to have a good night so whenever you're whenever mean anything you're at a bar the woman breaks out gum takes strawberry like oh we're going Strawberry Patch tonight we're picking some strawberries what are you **** talking about mon social flavor doesn't indicate anything about anything there something about the",
            "start": 1686.16
        },
        {
            "text": "like oh we're going Strawberry Patch tonight we're picking some strawberries what are you **** talking about mon social flavor doesn't indicate anything about anything there something about the activity she's not going to go out and like you know I'm going to I want to pick strawberries to be fair to be fair I mean I I agree with the message being said oh I wish there was a live chat window that I could see right now cuz I just want to see all other girls going I just like the flavor no that's the thing though is that strawberry is a normal thing what if a dud this universe come in hold on what if a dude did that are you like dude are you gay no he's just like I like the flavor have you not tasted your own **** no man now here's my thing I haven't either we talked about this on the show recently on the Morning Show someone was like have you ever tasted your own com I was like I haven't I can't believe I haven't though but since it's all my to-do L I feel like I may have",
            "start": 1727.8
        },
        {
            "text": "on the show recently on the Morning Show someone was like have you ever tasted your own com I was like I haven't I can't believe I haven't though but since it's all my to-do L I feel like I may have accidentally want do Kinda Funny Reaction there's nod no there's definitely accidentally like I left a triplet somewhere and then I like ate some chicken wings I've only hit myself in the face when did you when did you leave a driblet didn't watch come on bro I mean I'm very negligent is it's just all over me anyway I was having swings and Oh I thought that was it's on my chest like let me just no that I I think this is a very fascinating thing because again if you saw a chick that that popped out in her mouth or if you're hanging out with a dude and he just put that in his mouth the automatic assumption is that a she's going to blow me or B my boy's gay I don't think so you just like here's the thing flavor Things N Out of 10 times don't taste like the thing they're supposed to taste",
            "start": 1768.68
        },
        {
            "text": "assumption is that a she's going to blow me or B my boy's gay I don't think so you just like here's the thing flavor Things N Out of 10 times don't taste like the thing they're supposed to taste like oh true like watermelon Panda Express doesn't taste like Chinese food oh very good point Panda Express Chinese food it is not Chinese why it doesn't tast cherry doesn't taste like Cherry Cherry don't taste like Cherry Cherry fact facts **** probably doesn't taste like how do we know theast how would you know how do we know still don't know I'm going to taste my own C what you guys have done here is right the problem is you're not tackling this from the right method you've currently you're you're talking about it as if it was I feel I'm the only adult at DIS table right now too cuz you guys are Hammer drunk I'm not Hammer drunk I feel like it's the current thing of like if we went there and bought you could buy the **** gum right now right gum gum **** gum I love that I this was this",
            "start": 1812.64
        },
        {
            "text": "Hammer drunk I'm not Hammer drunk I feel like it's the current thing of like if we went there and bought you could buy the **** gum right now right gum gum **** gum I love that I this was this gum thing your fault yes a th% it's his fault Kevin Kevin said gum he said Trident is unveiling a new flavor and I went come flavored come what you've inadvertently done is written episode of Sliders where we've walked into the universe where **** gum is a thing where it's odd to us but clearly they all like **** enough in the flavor of **** that it's there yeah 100% 100% here's the thing though **** can't taste that bad no not at all I think this is an extra life goal it's salty and stuff what what what is the goal no somebody taste their own **** I will taste my own C genuinely interested at this so you're telling me if we hit if we hit $100 000 you'll taste your own if we hit $100 000 I will try my own come every Everybody well he's going to go to the bathroom do you know that",
            "start": 1859.84
        },
        {
            "text": "at this so you're telling me if we hit if we hit $100 000 you'll taste your own if we hit $100 000 I will try my own come every Everybody well he's going to go to the bathroom do you know that $100 000 is not Out Of Reach we've hit like bro that's like I think last year you guys hit like something we got to hit 100 this has to be like  00 we're setting no **** that we're sitting the bar I got to do this you guys heard first if we hit that he'll taste his own **** I'll dye all of my hair blue again $100 000 wow those are like totally dis hey man I'm playing ball all right I'm getting out Andy you on this too Andy what's up you going to change my C too in addition to that SK SK skate skate both of us what's up Will D our tips blonde for Boy Orgy cuz we know Nick won't blonde just the tips just the tips just the tips just see feel we have a boy band named Boy Orgy oh I know this you would have known if you came Kinda Funny last three I couldn't be there you want to be fourth member",
            "start": 1905.44
        },
        {
            "text": "just the tips just the tips just see feel we have a boy band named Boy Orgy oh I know this you would have known if you came Kinda Funny last three I couldn't be there you want to be fourth member let us know okay well fifth Xavier Woods oh Xavier Woods wants to be position yet but I want to be the one who never joined but got kicked out already you know what I mean like and automatically went on to do his solo down in the in the negotiations portion of it I'm and then and the negotiation in defense of in the in the negotiations is a hard word to say I did not have sex not it's fantastic in the Oval Office has anyone here tasted their own come cool grg dude you're not going to get no I mean I would honestly tell you I know you would yeah I can't believe Kevin has is this on the level of like I can't you the who farted no no there there to me there's a difference between like I farted an elevator and there was a night at home when I said shot my **** into my mouth there was I mean",
            "start": 1959.32
        },
        {
            "text": "like I can't you the who farted no no there there to me there's a difference between like I farted an elevator and there was a night at home when I said shot my **** into my mouth there was I mean again there's only one time but there was one time where it shot in a way I didn't expect and it hit me in the face oh didn't taste it now what's but it hit me in the face now what is interesting about this for you the jury is the fact that you tried to sell the lie to me you would never jerked off lying down that wasn't a lie I believe how the **** did you hit yourself in the face not jerking off lying down get **** whiff of this Troy Len to this **** the end of it you only like crouched over like a neanderthal what what do you mean I was more of a sit down he was hanging from his feet I would sit down just like I am right now have you never been in a hotel before well that's the thing I hadn't really you asked for for a chair I excuse me I did issue that's the I haven't had any",
            "start": 2012.68
        },
        {
            "text": "I would sit down just like I am right now have you never been in a hotel before well that's the thing I hadn't really you asked for for a chair I excuse me I did issue that's the I haven't had any that's the creepiest thing just just the angry just tell like so wait you're jacking off you're jacking off sitting up I was want to make sure I understand I guess that makes sense that makes sense yeah yeah that makes sense because you're a young kid right uh no that it was more recent than I'd like wow really no it must have been like three four years ago maybe and that should just pop me in the face young too though okay that's that happens though you know a lot of protein I don't know a lot of milk drink a lot of milk you don't get to bring up any more top um how how do you say that word what milk milk okay milk not milk how do you say it so it's a big thing cuz it sounded like you said it the way I said no I said milk what do you say have always been a milk guy it's milk get all upset",
            "start": 2058.6
        },
        {
            "text": "milk milk okay milk not milk how do you say it so it's a big thing cuz it sounded like you said it the way I said no I said milk what do you say have always been a milk guy it's milk get all upset about it like fine it's milk sure I'll say milk I'll make sure I put that eye in there but it sounded like you just said said milk it's no no no no putting the eye there is not a concession that you're making that's the way the world is spelled it's not like you know what I'll I'll grant you that eye I'll give it to co because otherwise it's not a word in the English language what I'll say is that I say a lot of words wrong a lot of people tell me I don't say roof right I think I say rof just fine you say it wrong what do you what's the first meal of the day breakfast okay it's not breakfast I've heard that one too okay go ahead Kevin says breakfast all **** up breakfast Kevin say breakfast in your microphone what breakfast breakfast he he says it all he says Pizza wrong he says McDonald's",
            "start": 2107.52
        },
        {
            "text": "heard that one too okay go ahead Kevin says breakfast all **** up breakfast Kevin say breakfast in your microphone what breakfast breakfast he he says it all he says Pizza wrong he says McDonald's wrong he says McDonald's wrong for sure mcdonaldd McDonald's yeah okay let me ask you a question what's the number one uh uh Mexican food chain fast food chain Taco Bell what is it Taco Bell what is it Taco Bell Taco Bell Tim Taco Bell Taco Bell no do you see see the differences here we have two Taco Bells and two Taco Bells Taco Bell oh you're talking about the enunciation Taco cool Greg what is it Taco Bell thank you tiebreaker what did he say though are you seeing that the Bell is enunciated it's Taco Bell it's not Taco Bell it's like Taco Bell as the composer it's Taco Bell yeah Tac Bell Taco Bell yeah I'm with you okay cool no you said Taco Bell no I didn't I had a buddy of mine who would always always say Pro let's go to the Taco Bell guy let's go to Corner Store corner store it's",
            "start": 2155.68
        },
        {
            "text": "Taco Bell yeah I'm with you okay cool no you said Taco Bell no I didn't I had a buddy of mine who would always always say Pro let's go to the Taco Bell guy let's go to Corner Store corner store it's like no it's Corner Store yeah not the corner store like he would annunciate the store it's the it's the store that's on the corner it's the Corner Store it's Leva not Levio exactly Le I had a friend who said the nword a lot we don't hang out good Lord we don't hang out with him hey party people guess what there is a sale over at KindaFunny.com store up to 40% off select items Monday through Sunday go check it out have a good time and of course click here to go check out our Patreon click here to subscribe to Kinda Funny click here to go to Kinda Funny Games and click down here to go to the Mystery Spot guess what it's just a playlist of fun videos we enjoy that's what I like to put there o I'm a smooth boy Greggy M",
            "start": 2209.6
        }
    ]
}