{
  "id": 2940,
  "video_id": "B0MRtm8jV-Y",
  "show_name": "Kinda Funny Games Daily",
  "hosts": ["Greg Miller", "Tim Gettys"],
  "title": "WB Is Really Pushing Shadow of War - Kinda Funny Games Daily 08.25.17",
  "description": "Greg and Tim debate how big Middle-earth: Shadow of War is going to be while going over WB's comments.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1503695585,
  "duration": 3499,
  "transcript_chunks": [
    {
      "text": "What's up everybody, welcome to Kinda Funny Games Daily for Friday, August 25th, 2017. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys. Look at what you made me do. What you made me do, and you like it. I like, I like it. I mean, yeah, it took me a while. It took me a few listens to us. We'll track, turn me around, but yeah, I'm on. I mean, I think it's our best thing ever. I'm enjoying it. I'm excited for Reputation. Mm-hmm. I signed up for the tickets. We're in. He'll let you know how that's going, okay? Because there's like a whole meta game, you know, I gotta go. Well, get out. We're getting object, ladies and gentlemen. This, of course, is Kinda Funny Games Daily. If you didn't know, each and every weekday here on a variety of platforms, we run you through the nerdy video game news you need to know about, getting in-depth, giving you perspective, answering your questions, reading bad PSN names, and doing whatever you really want us to do. You said go to KindaFunny.com/kfgd and tell us.",
      "start": 0.65
    },
    {
      "text": "To know about, getting in-depth, giving you perspective, answering your questions, reading bad PSN names, and doing whatever you really want us to do. You said go to KindaFunny.com/kfgd and tell us. We're game monkeys. Game monkeys, and monkeys are hard to command. Super Monkey Ball, underrated. Okay, sure. Which one? Two? Okay, 'cause I mean, a lot of them. Yeah, the Vita one was pretty good too. Mmm. You can watch the show live as we record it on Twitch.tv/KindaFunnyGames, but we don't interact with you. The only way you can interact live is by going to, you know, sorry, kindafunny.com/yourewrong. Tell us what we screw up as we screw it up so that at the end of the show, we can set the record straight. You can also get it later on YouTube.com/KindaFunnyGames or podcast services around the globe. No matter where you get it, thank you for your support. Consider supporting us over on Patreon.com/KindaFunnyGames. You get a bunch of cool bonus stuff, early stuff, party mode.",
      "start": 42.61
    },
    {
      "text": "Around the globe. No matter where you get it, thank you for your support. Consider supporting us over on Patreon.com/KindaFunnyGames. You get a bunch of cool bonus stuff, early stuff, party mode, whatever you want it. Not whatever you want it, but you know, Tim, yes, I got some housekeeping for you. Oh, I, number one, the new Kinda Funny Doodle is up and free for everybody over at YouTube.com/KindaFunny. Something special. I love that one. That's one of my favorites. As a reminder, GameStop Expo is this week. Kinda Funny will be there on Sunday, 10:00 a.m., streaming all day long. You can watch it live at Twitch.tv/GameStop or check it out as we hosted on Kinda Funny Games right here where you might be watching us now. Developers, new games all day long, talking about them, seeing cool stuff. Very excited. Then the next weekend is PAX. There's a whole bunch of stuff from the Kinda Funny crew. Friday, Andrea and What's Good Games have first off, a Life is Strange panel. Then they have a Life is Strange.",
      "start": 80.71
    },
    {
      "text": "Very excited. Then the next weekend is PAX. There's a whole bunch of stuff from the Kinda Funny crew. Friday, Andrea and What's Good Games have first off, a Life is Strange panel. Then they have a Life is Strange party that night. Saturday, no, that's not right at all. No, that, now that that is right. So Andrea is doing the Life is Strange panel Friday. There's the Life is Strange party hosted with What's Good Games Friday night. Then Saturday at 5:00 is the What's Good Games panel. Saturday at 8:30 is me playing Batman at the Telltale panel. You should come hang out. We're gonna go to drinks afterwards. Sunday at noon is Daniel Dwyer's Witcher panel. Sunday at 5:00 is my cancer panel. I'll figure that one out yet. Filmy wise, no need to figure that out. Yeah, yeah. Ah, but for right now, let's begin the show with what is and forever will be the Roper Report. Time for some news. There are four items on the Roper Report. Half-assed doesn't know that's never do that. Alright, it's always a baker's dozen or it's not.",
      "start": 120.88
    },
    {
      "text": "What is and forever will be the Roper Report. Time for some news. There are four items on the Roper Report. Half-assed doesn't know that's never do that. Alright, it's always a baker's dozen or it's not. You're getting, oh man, he's getting, now he's getting cocky. He was, you did before, you did it out. You know what? I'm not gonna, no, I'm not gonna put on your permanent record. I'm just saying I don't like that one bit. Alright, I love you, Kevin. Number one, the Xbox One X is the fastest pre-ordered Xbox console ever, according to Xbox. Xbox says, quote, you, our biggest fans, have pre-ordered more Xbox One X Project Scorpio Edition consoles in the first five days than any Xbox ever. Quote, Microsoft has done it again. This is a GameStop quote. It's buried at the very bottom. Microsoft has done it again. The innovation and power behind the new Xbox One X consoles driving excitement and demand among our customers worldwide. The speed at which we sold through our initial pre-order supply surpassed expectations and what.",
      "start": 162.76
    },
    {
      "text": "Power behind the new Xbox One X consoles driving excitement and demand among our customers worldwide. The speed at which we sold through our initial pre-order supply surpassed expectations and what we experienced with pre-orders for the original Xbox One console. This new system is definitely going to change how video games are played. I appreciate your excitement. Media Markt also put out a quote, quote, a great piece of tech with a great onrush. Microsoft's high-end console hits the hearts and minds of our console fans. We were absolutely astonished with the run on Microsoft's new flagship console of the Xbox One family. The Xbox One X Project Scorpio Edition was the fastest sold out Xbox console ever. Back to Xbox. Although our fans may no longer be able to pre-order the Xbox One X Project Scorpio Edition in their country, we know people are still anxious to get their hands on the world's most powerful console. We'll be announcing details of the next wave of Xbox One X standard issue in pre-orders next.",
      "start": 209.98
    },
    {
      "text": "In their country, we know people are still anxious to get their hands on the world's most powerful console. We'll be announcing details of the next wave of Xbox One X standard issue in pre-orders next month, so stay tuned for more information. We can't wait for November 7th. Excitement is building from developers who have committed and than 100 new and existing games will be enhanced for Xbox One X to the 300,000-plus European fans who got the chance to experience the full power of Xbox One X this week to receiving the Gamescom 2017 award for best hardware. So a lot of PR speak there. Oh yeah, a follow-up to what we were talking about yesterday. Andrea and I did the story from Windows Central about Xbox One X pre-orders on Amazon.com being ahead of PlayStation 4 Pro for the entire year. And I think there's a little bit more back-end stuff that puts that there. I don't know if it's just numbers from what I understand, but still impressive, still there. There still isn't a man for the.",
      "start": 254.68
    },
    {
      "text": "And I think there's a little bit more back-end stuff that puts that there. I don't know if it's just numbers from what I understand, but still impressive, still there. There still isn't a demand for the Xbox One, as I was saying throughout the weeks, because we've been talking about Xbox One X quite a bit. And then yesterday on that Kinda Funny Gamescast we recorded with Ryan McCaffrey, available now on Patreon.com/KindaFunnyGames, available for free on Monday on YouTube.com/KindaFunnyGames. There's a lot of goodwill behind the Xbox One X that I didn't see for PS4 Pro personally. Well, I mean, I think that's because Microsoft is doing that. They're creating that. Alright, they're going out there and they're saying like, this is the most powerful console. #PowerfulConsole. Yeah, that's, they're screaming it, right? Whereas PlayStation 4 Pro was a bit more, hey, there's a thing. Sure. You know, I feel like they did that push. They're doing, they did the push wrong. They did the push for VR in.",
      "start": 301.32
    },
    {
      "text": "They're screaming it, right? Whereas PlayStation 4 Pro was a bit more, hey, there's a thing. Sure. You know, I feel like they did that push. They're doing, they did the push wrong. They did the push for VR in the way that Microsoft's doing the push for Xbox. Whereas the PS4 Pro was the equivalent of what I thought the Xbox One S push was, which is a good point. Here's just, there's another thing. Do you want it or not for you? Yeah. Whereas the Xbox was really like, yo, this is, this is what we're doing. And I feel like all the, the vocal gamers and gaming journalists, people are like, who is this for? And it's like, once before, the same people who peacefully, it's argument I was making before. I think it's the people that bought the PS4 Pro are the ones that wanted it for the reasons that it exists. Yeah, they're gonna keep buying it. You don't know the numbers of that. And I would be willing to bet that they are great. Yeah, and this awesome goodie, you Xbox, like this is what they needed. They needed this kind of good.",
      "start": 339.63
    },
    {
      "text": "Keep buying it. You don't know the numbers of that. And I would be willing to bet that they are great. Yeah, and this awesome goodie, you Xbox, like this is what they needed. They needed this kind of good news to get those numbers up. Like, I wonder how much it's gonna close the gap between the consoles sold at PS4 and Xbox One. I don't think it's gonna get it up there, you know? No, like in the grand scheme of things, I'm sure this is a drop in the bucket. Exactly. How many are you talking about? 16 million PlayStation 4 sold. So we always say what, 40 million, 30 minutes, between 33 million Xbox Ones as a guess, 'cause there is no official number out there. You go ahead. Imagine this is in the five days or whatever. That's a spike. Sure. Yeah. Oh no, totally. I mean, that's what you want. You want you to that moment we talked about, you know, at length on these shows. And like I said, the Gamescast was Ryan McCaffrey. That's why I was this Xbox focused, is the fact that I've really been, you know what I love about what we do.",
      "start": 378.3
    },
    {
      "text": "About, you know, at length on these shows. And like I said, the Gamescast was Ryan McCaffrey. That's why I was this Xbox focused, is the fact that I've really been, you know what I love about what we do, obviously, is the relationship we have with you, the best friends who listen to watch. But what I've loved what Kinda Funny Games Daily is the, having an ongoing conversation, having you guys chime in and talk about it and talk to it. And the people who've written in being like, hey, you know, I love the show, whatever. I'm excited for Xbox One X because of this. I'm still in the Xbox ecosystem because of this. It makes sense in a way that I'm not, I, I wouldn't have thought about it before. And just the fact like, you know, yesterday's letter, I thought was so good in terms of just like, hey, I am buying an Xbox One X. I am here. I would recommend it because this. And I'm a gamer who plays a few games a year, plays this. And this matters for that when I'm using it as this. And I'm not buying 13 games a week. This.",
      "start": 421.18
    },
    {
      "text": "One X. I am here. I would recommend it because this. And I'm a gamer who plays a few games a year, plays this. And this matters for that when I'm using it as this. And I'm not buying 13 games a week. This is what it's all about. That makes a lot of sense. Shredberg wrote in to KindaFunny.com/KFGd, just like you can, and says, hey guys, today Xbox announced that the Xbox One X is the fastest selling Xbox pre-order ever. Also yesterday, Eurogamer's Digital Foundry went hands-on with several Xbox One X upgraded games, concluding that the console is 53% more powerful than the PlayStation 4 Pro and more than four times as powerful as the original Xbox One. My question is this, who do we consider the Xbox One, who do we consider the Xbox One to be a quote, another PS4 Pro? I think means, wah-wah. Why do we consider the Xbox One X to be another PS4 Pro despite being powerful enough to be another console generation? In my opinion, Microsoft could call this Xbox Two with the added benefit of all Xbox Two.",
      "start": 459.01
    },
    {
      "text": "Do we consider the Xbox One X to be another PS4 Pro despite being powerful enough to be another console generation? In my opinion, Microsoft could call this Xbox Two with the added benefit of all Xbox Two being completely compatible with Xbox One, with Xbox Two games running on Xbox One because of the compatible operating system. It seems like people got, got caught so much into comparing this with PlayStation 4 Pro, but they ignored how much more powerful the system actually is. I think it's a simple answer, and it's just at the end of the day, what does the console provide that's different than the, the last one in terms of software? Mm-hmm. And the answer is nothing. Yeah, it's, I mean, yes, it looks better and it performs better than all that, but it's still the same games. And I think that that's can, that is the difference. And it's not even like ported versions. It's not like when you see the, like every time there's a new console launch, there's that weird period of a year where it's like you get.",
      "start": 507.91
    },
    {
      "text": "That is the difference. And it's not even like ported versions. It's not like when you see the, like every time there's a new console launch, there's that weird period of a year where it's like you get Assassin's Creed on both, yeah, Call of Duty on both, but they're different. You have to buy two versions of the game. Right now, this is the same game. So it's, I think that's why it's not the Xbox Two. And I feel like that would have been a bad look if they released it as the Xbox Two or whatever they'd call it. And it is just the same games that are on the PlayStation 4. It's just they are the better versions. I know not only that would have made people happy. I mean, why do people consider this another PlayStation 4 Pro? Because that's all we've known. I think that PlayStation 4 Pro, as we just talked about, I still stand by that little lead up in announcement of that was all **** up in the wrong way to do it. Should have been a press release. Should have been a PlayStation Blog post. Here you go, it's a more.",
      "start": 548.74
    },
    {
      "text": "Stand by that little lead up in announcement of that was all **** up in the wrong way to do it. Should have been a press release. Should have been a PlayStation Blog post. Here you go, it's a more powerful PS4 if that's what you want. Helps out with VR. Yeah, the fact that they made a new big thing, I think a lot of us got hyped up that this was going to be something really cool. This was going to be something more like what you're talking on here. The Xbox One X is, there's gonna be like noticeable 53% more powerful. This is that. And bottom, it was gonna be like, holy ****, this is actually really cool and interesting. And when people got quote-unquote burned by PlayStation 4 Pro, probably just being that's more, it's just better. Maybe you want it, you don't want it, no big deal. I think then that set expectations at an odd level. And then when we start comparing people, PlayStation 4 Pro and Xbox One X. But when we thought it was Scorpio, toward, I was gonna be what I was gonna be. E3 gets announced this.",
      "start": 592.33
    },
    {
      "text": "At an odd level. And then when we start comparing people, PlayStation 4 Pro and Xbox One X. But when we thought it was Scorpio, toward, I was gonna be what I was gonna be. E3 gets announced this. Is that it was, it seemed like the same messaging and it seemed like the same thing. What you're talking about here, what Digital Foundry is interesting. I think it will be really fascinating if these things get out into the wild and there is that, oh, holy ****, this is doing something drastically different. This is making my gaming experience drastically better. Because that wasn't the case with PlayStation 4 Pro. PlayStation 4 Pro got out and yep, Horizon looks better. Yep, it's really beautiful. Yep, it can I connect to the 5GHz wireless because of the new card. And it's like, oh, those are all cool things. They're not a thing that makes me want to run out and buy a PlayStation 4 Pro because those aren't issues I personally have. Yeah, Xbox One X, if it gets out there and it is this, and Microsoft kind of pulls off.",
      "start": 622.51
    },
    {
      "text": "Not a thing that makes me want to run out and buy a PlayStation 4 Pro because those aren't issues I personally have. Yeah, Xbox One X, if it gets out there and it is this, and Microsoft kind of pulls off the curtain when it's out there and you start seeing noticeable improvements and reasons people are saying like, holy ****, I didn't buy one and now I'm going to go buy one because of X, Y, and Z. That changes the story. But right now, people only know, and it sounds stupid, people only know what they know. And they know PlayStation 4 Pro. So until somebody shows you this Xbox One X and shows you, hey, this is something really impressive you need to have, I think that's why it's just another PlayStation 4 Pro. Yeah, I mean, it's, it's so funny how much we've talked about this in the last couple years because it's a new thing to consoles where we never really had to experience this type of mid-cycle refresh, iPhone S type thing. Yeah, and not to pull the whole, I told you so type ****, but it's alright, we can.",
      "start": 660.94
    },
    {
      "text": "A new thing to consoles where we never really had to experience this type of mid-cycle refresh, iPhone S type thing. Yeah, and not to pull the whole, I told you so type ****, but it's alright, we can go back two years to the two Gamescast episodes where we're talking about iterative consoles and what this is gonna mean. And there was just so much like doom and gloom about, oh man, like developers are gonna say that this is gonna ruin everything that I felt for all these things in mind. Second, what doesn't seem like it's really causing too much of an issue. And what at the end of the day, and I remember I always used to argue, I'm like, we've seen things like this before with the Xbox Elite and during the 360 where it is just like, it's just a better version of the console we have. And granted, how that was better versus how these are better is very different. And these are substantial upgrades to the actual gaming experience. Yeah, as it was just like HDMI and bigger hard drives and that stuff. I, I.",
      "start": 697.75
    },
    {
      "text": "Was better versus how these are better is very different. And these are substantial upgrades to the actual gaming experience. Yeah, as it was just like HDMI and bigger hard drives and that stuff. I, I just feel like we're now living in that world where it's just like, alright, these things came and the Xbox One X isn't here. I think you're making a really good point that we'll have to see when this is in people's home. Yeah, and when people are talking about it because Digital Foundry, yeah, Digital Foundry are **** awesome. They are the utmost authorities on visual fidelity and telling us actual 53% in it better. That's not gonna mean anything to people unless it's noticeable. And like I was saying yesterday on the, the Gamescast with Ryan McCaffrey, I love my PlayStation 4 Pro. I love my TV. I love how amazing it all looks. However, I just love how the Horizon looks anywhere. It's like, it's one of those things where it, unless they're side by side, I don't know the difference. I just, you know, it.",
      "start": 740.38
    },
    {
      "text": "Love how amazing it all looks. However, I just love how the Horizon looks anywhere. It's like, it's one of those things where it, unless they're side by side, I don't know the difference. I just, you know, it looks great. Sure, sure, sure. And that's what's so fascinating about this, I think, in the long grand scheme of things, is that when we talked about PlayStation 4 Pro, once again, asked me, knew what it was. It was the idea of like, oh, it's a little bit better. It's like an iPhone, right? It's like the Xbox One X is the one where it's noticeably more powerful, 53%, all the teraflops, all this garbage, right? And we literally are in a brand new space here with gaming where Xbox is saying, we're done with generations. We're done with console life cycles. This is, we're gonna do it like this. And I, you know, I think I speak for a lot of gamers, just don't know what that looks like or how that feels because it's mind-boggling right now to think that Xbox One X, like you're saying here, Shredberg, is the Xbox Two. But we're.",
      "start": 782.92
    },
    {
      "text": "For a lot of gamers, just don't know what that looks like or how that feels because it's mind-boggling right now to think that Xbox One X, like you're saying here, Shredberg, is the Xbox Two. But we're gonna make games for it that run on the Xbox One X, run on the Xbox One period, run on PlayStation 4. It's like when you start getting into that thing and we start moving to, I guess the easiest way is, we're moving towards a PC environment. But rather than buying components to make my own PC, I'm upgrading my system as I go. It's just hard to wrap my head around that when we have been on, we're in a place literally where the PlayStation 4 can't play PlayStation 3 games because of cell processing technology. And I know PlayStation 4's whole thing was different architecture. We can run PC. But are we to the point that, and I'm stupid, I'm not a PC gamer and I'm not a game developer, I know. Are we to a point where we think that the architecture and infrastructure for games now is so universal that this is the way.",
      "start": 828.5
    },
    {
      "text": "That, and I'm stupid, I'm not a PC gamer and I'm not a game developer, I know. Are we to a point where we think that the architecture and infrastructure for games now is so universal that this is the way consoles compete with PCs and how it works? I mean, I feel like that is part of the equation. I think the other thing is it needs to be kind of just like a truce between everybody that everyone just agrees, alright, this is how we're gonna do it to benefit everybody. Who else is gonna turn into a system where if the moment that Xbox is demonstrably more powerful than PlayStation in a way that it separates away from the pack in the opposite direction of Nintendo? Mm-hmm. What's happening with Nintendo? Games aren't coming in Nintendo because people are not going to invest in that system when it has to be so drastically different when they can sell to millions and millions and millions of consoles when it's on Xbox and PlayStation. And that's what I, and that's what when this is one, Tim, where.",
      "start": 874.37
    },
    {
      "text": "To be so drastically different when they can sell to millions and millions and millions of consoles when it's on Xbox and PlayStation. And that's what I, and that's what when this is one, Tim, where it's just, it feels like uncharted territory that I don't understand is the fact that, yeah, so it's 53 percent more powerful. What then at what number does Xbox One X have to hit for Ubisoft to make a game that's just for Xbox One? Yes, that can take advantage of that to not make it feel like you're always getting built for the lowest common denominator that is PlayStation 4's install base or just Xbox One or Xbox One periods. And it's a confused thing. Another thing that complicates it even more is it starts to get to the point where when you go higher and higher and higher with that ****, there's just going to be more cost associated with the game. It's gonna be more expensive and it's just gonna become this premium, premium product where at the end of the day, why would Ubisoft be like, you know.",
      "start": 920.69
    },
    {
      "text": "Going to be more cost associated with the game. It's gonna be more expensive and it's just gonna become this premium, premium product where at the end of the day, why would Ubisoft be like, you know what? We're gonna make this game just for the system that can only potentially reach X amount of people. But when it comes to that, so the answer would be, oh, well, Microsoft would pay them. But it's like, well, if Microsoft paying them a certain amount, then at some point it's not worth it for all of the trouble to make this huge game with huge maps and yeah, 8K visual fidelity and all this stuff when they could just do what they're doing now and grow together and make sure that Ubisoft has a library that's gonna come out across both. Yeah, multiple things. Have an exclusive here, have an exclusive there and profit. And this is the same thing. And I need kindafunny.com/yourewrong because I'm going out here. I'm fairly certain correct. And like, don't tell me if I'm right, only tell me if I'm.",
      "start": 960.96
    },
    {
      "text": "Profit. And this is the same thing. And I need kindafunny.com/yourewrong because I'm going out here. I'm fairly certain correct. And like, don't tell me if I'm right, only tell me if I'm wrong. I'm fairly certain it's been an Xbox. This whole thing has been like, no, the Xbox One X games will play on Xbox One. And done. So you're hamstringing this thing that's so much more powerful. And Ubisoft's never gonna make an Xbox One X only game. Like, I just, it's so muddled. It's such a muddled message right now. And that's the one thing I don't have an answer for in the fact that it would need to be Phil Spencer and Shuhei or Shawn Layden on a stage being like, hey everybody, we're, got chills, you just saying, we're making this move, right? Where we want to continue like everybody, if every shooting for the middle ground, we're never pushing it forward. And that's my concern right now is the fact that, you know, it's, and I'm doing this because I like human beings, you fear change, you fear the unknown. Is that.",
      "start": 998.88
    },
    {
      "text": "middle ground we're never pushing it forward and that's my concern right now is the fact that you know it's and I'm doing this because I like human beings you fear change you fear the unknown is that I feel like you can keep powering all this stuff up and souping up these boxes but if there's no longer common ground there's no middle thing everything's gonna shoot for the middle which means nobody's getting it used to the right thing am it it's just so confusing and weird and I just don't understand how it all Nets out in the end yeah I mean I just think that it can't be half step if they need to commit full in or full out when it comes to are we all just gonna be where we're at and do this and we'll have like the slight the definitive editions and better versions on the PlayStation 4 Pro and Xbox One X or are we gonna just have one guy like let's say it is Xbox and it's just like that is the better system right and it's exclusives and it reaches a point where gamers need to buy all",
      "start": 1040.16
    },
    {
      "text": "and Xbox One X or are we gonna just have one guy like let's say it is Xbox and it's just like that is the better system right and it's exclusives and it reaches a point where gamers need to buy all three systems if they want to get the most games if I guess what I'm saying is like cross-platform games being a thing of the past that's hard for me to believe I know and that's the thing you look at this thing you're you're worrying I'm not worrying about but it's being confused about that if Xbox is serious about like no more console life cycles where you know where to continue doing it this way what happens when PlayStations like we're making a PlayStation 5 here's the PlayStation 5 it's **** whatever specs are crazy it does Xbox not get worried about this arms race or is there and then we're making the Xbox One whatever it's gonna be called and that's it's all so **** convoluted right nice weird and it's granted it's because it's been for me 34 years in this earth of knowing how",
      "start": 1077.96
    },
    {
      "text": "we're making the Xbox One whatever it's gonna be called and that's it's all so **** convoluted right nice weird and it's granted it's because it's been for me 34 years in this earth of knowing how console life cycle and what when it comes to the Xbox thing what you're just saying of even if they were to put out another one then it is still the idea that those guy off work I just lost my chair without their sorry no it's fine it's the idea that like there's just all the it and I I know it makes sense when we say phones and like the most iPhones can run all iPhone games I mean at varying degrees of was gonna say is that the the games that are coming out now are is that the pinnacle of video games yeah because if so then we're ready for this you know if we're just admitting like hey where we're at like the Assassin's Creed and Call of Duty like we're good then it's like alright cool we can do that and then we can have the iterative console updates that will just add these little cool I",
      "start": 1121.76
    },
    {
      "text": "we're at like the Assassin's Creed and Call of Duty like we're good then it's like alright cool we can do that and then we can have the iterative console updates that will just add these little cool I mean that's been the thing with PlayStation 4 right and this let me dial the back that's been the thing with this Lifeson of PlayStation 4 Xbox One is the fact that like you know it's calling you to say or brought up as a point because games are great sure and they're awesome but it's not like the technology and the power of the boxes has pushed us to this new thing right these are games that we could've been playing on PS3 but now the maps a bit bigger or now is more clear and this thing isn't it that is that in the other which then comes back to this argument of like okay cool so let's for argument's sake say for Xbox One X PlayStation 4 and just stick with me they PlayerUnknown's Battlegrounds comes to both systems and on your Pro additions the draw distances way better the maps are",
      "start": 1167.87
    },
    {
      "text": "argument's sake say for Xbox One X PlayStation 4 and just stick with me they PlayerUnknown's Battlegrounds comes to both systems and on your Pro additions the draw distances way better the maps are wait and they can't be larger because they're all playing on the same thing so I guess that's how you get around this on as you go down to PS3 Xbox One then that there's a fog of war that comes in there's not as much strata sness is it's just it's I guess that's possible that is PC gaming but it like it is and it what's what's interesting to look at is Nintendo as an example you know a lot of people that aren't Nintendo fans they're like all underpowered and **** and can't have the ports or whatever but it plays Nintendo games very well yeah and those Nintendo games are designed with that in mind and it's interesting to look at Nintendo may be a Nintendo decided this a generation to go and they like yeah our games only need to have this much power look at Mario it looks fantastic it plays",
      "start": 1205.09
    },
    {
      "text": "and it's interesting to look at Nintendo may be a Nintendo decided this a generation to go and they like yeah our games only need to have this much power look at Mario it looks fantastic it plays fantastic whatever that's all that they need what would Mario look like on if it if Nintendo developed a Mario game on PlayStation 4 yeah would it look much better than it does on the Switch I don't know yeah but I feel like Microsoft and Sony don't have that mindset and I can't imagine they ever will yeah it's fascinating and it's one of those I you know I'm gonna be really really interesting Xbox One get into the wild what it means what it looks like how the games are different and then yeah just to see two three years from now what are we how is all this shaking out doesn't matter are we looking at new consoles how does it go we'll figure it out number two on three hoofer report but then you want to talk about you these crazy games look amazing Secret of Mana is getting a rebate",
      "start": 1248.17
    },
    {
      "text": "we looking at new consoles how does it go we'll figure it out number two on three hoofer report but then you want to talk about you these crazy games look amazing Secret of Mana is getting a rebate PlayStation Blog Square popped up over there to talk about this they say one of the greatest RPGs of all time Secret of Mana is coming back to life in 3D Secret of Mana will come to PlayStation 4 and the PlayStation Vita digitally on February 15th 2018 worldwide the game will faithfully adapt of the beloved story and top-down gameplay while adopting modern 3D graphics and controls meaning that the game has been fully rebuilt from the ground up but still remains true to the whimsical gameplay of the original in this remake you can expect the game you can spec the great game you and your friends have in this new remake you can expect the great game all your friends have been saying you missed out on reborn additions are voiced characters that's right you heard Randy in the trailer and you'll",
      "start": 1286.18
    },
    {
      "text": "have in this new remake you can expect the great game all your friends have been saying you missed out on reborn additions are voiced characters that's right you heard Randy in the trailer and you'll finally get to hear Rande, Prim and Popoi and some many other characters talk and express themselves throughout their adventure to add to that the game will have language options and will allow players to experience the game using Japanese voices or and/or subtitles a newly arranged soundtrack we're excited for you to hear a beautiful newly arranged soundtrack that pays tribute to the original and then local multiplayer yes sit down with two of your friends up to three players to experience the adventure together let's do something for you just make your little Dingling I am one of those people that all my friends said I missed out on Secret of Mana not one of the RPGs I played back on the Super Nintendo yeah I love this I think this is great that Square is doing this sorry for all",
      "start": 1328.18
    },
    {
      "text": "people that all my friends said I missed out on Secret of Mana not one of the RPGs I played back on the Super Nintendo yeah I love this I think this is great that Square is doing this sorry for all the **** that they get they did it with World of Final Fantasy last year and then doing this I and I'm said sooner I love that there's these smaller titles that they're still doing the more traditional JRPG games and look like this list with the exception of the newly arranged soundtrack paying tribute to the original because that doesn't sound like something fans are gonna want the rest of it this is fanservice this is great stuff oh cool we get to play multiplayer awesome the voice acting and all that stuff you can listen to Japanese or English with subtitles dubbed whatever you want great that's what the fans of this game are gonna want to do this is awesome news yes across the board with the exception of it not coming to the Switch but you know yeah whatever your Vita though does",
      "start": 1368.14
    },
    {
      "text": "that's what the fans of this game are gonna want to do this is awesome news yes across the board with the exception of it not coming to the Switch but you know yeah whatever your Vita though does yeah all right you don't hate talk about the small buttons all it's **** I want to hear from you just **** play get some trophies have some fun not ya real cooool I'm I never played it I know people love it I like to get a shot number three according to MCV Shadow of War is WB's biggest marketing campaign ever MCV had a conversation with SVP of International, well I guess WB International, Oliver Wolf. He says in quotes, \"Our sales expectations are massive, top 5 or top 10 massive. We've never had and we've never had such an investment in one game and in a marketing campaign and we believe that we have the right product in order to seduce a mass audience. We have very high expectations. It's definitely going to be our game of the year, there's no doubt about that.\" He continued, \"Pre-orders are pretty",
      "start": 1410.98
    },
    {
      "text": "have the right product in order to seduce a mass audience. We have very high expectations. It's definitely going to be our game of the year, there's no doubt about that.\" He continued, \"Pre-orders are pretty strong. They are above what we had for Batman Arkham Knight and we are very happy with what we have when our brothers is already planning to support the title over the long run.\" - with Wolf adding quote, \"It's a title that for us is going to last a long time. I'm going to support it for at least 18 months after launch. Middle-earth is a broad franchise with lots of appeal. We think we just scratched the surface in a very nice and successful way with the first game, but we believe Shadow of War can seduce a lot of other players because there is so much innovation in the gameplay.\" He likes to seduce people. Yeah, I should get him a source. I should. Yeah, big kind of that. This is interesting to me. Yeah, I feel like I might just be outside of this audience and maybe I'm just not seeing this, but this is the",
      "start": 1458.56
    },
    {
      "text": "yeah I should get him a source I should yeah big kind of that this is interesting to me yeah I feel like I might just be outside of this audience and maybe I'm just not seeing this but this is the biggest marketing campaign they've ever had I'm not seeing much about it yeah and you know again I'm not targeting I'm not looking for this stuff so maybe he's just not coming to me. Lord of the Rings never been my thing, don't fully understand it, but the fact that they're putting more behind this than Batman. Yeah, but I mean that's my thing right? Solicit. Yeah, that's that's a great point. Waste. Yeah, exactly. There's more marketing behind it than Arkham, according to this. Maybe this is just not Hannon quote, but it's what he said. And then he says in that thing, I would that doesn't blow my mind right there's more marketing behind the Batman is their biggest marketing of all time. Sure, you're pushing this game really hard. You need to be like, hey everybody, there's the Lord of the Rings game, there's a",
      "start": 1497.21
    },
    {
      "text": "more marketing behind the Batman is their biggest marketing of all time. Sure, you're pushing this game really hard. You need to be like, hey everybody, there's the Lord of the Rings game, there's a sequel of this game you heard about that was criminally underplayed. Hey, hey, hey, hey. It is the one of like when he comes up here and he's talking about the fact that the pre-orders are pretty strong. They are above what we had for Batman Arkham Knight and we're happy that way. That's weird. I wouldn't have expected the pre-orders to be beyond Batman. What this selling Batman Beyond? Oh yeah, only rocks even do that on it. Shout out eight years. Batman Arkham Asylum. Yeah, eight years ago. Yeah, yes. That's it is shocking to me, but I mean that just shows that we are not necessarily the target audience. Well, staying now while my thing about it to dial it back is and I don't mean to take I'm not taking a shot here at all. This is a guy about marketing talking about marketing. I don't know, is is there hyperbole",
      "start": 1536.03
    },
    {
      "text": "now while my thing about it to dial it back is and I don't mean to take I'm not taking a shot here at all. This is a guy about marketing talking about marketing. I don't know, is is there hyperbole here? Is I mean, I'm looking I went to VG Charts which is far from the end all be all, but they guesstimate all the time and they're wrong a lot, but they're not they get it right too. Global total for Middle-earth: Shadow of Mordor right was a little over three million units. Now for all the platforms that was on right? That's not, you know, maybe that was just for a PlayStation. It's the whole thing with it's just such a weird thing if people liked it. It reviewed well. I just don't remember there being really liked it. Yeah, but I I feel like that was not a Batman game. You know, the Batman games that mainstream like everybody put the people that play Madden only play Batman Arkham Asylum. Sure, head and Arkham Knight and all those. Yeah, the current played **** Batman. Lord of the Rings was the game that the",
      "start": 1578.24
    },
    {
      "text": "like everybody put the people that play Madden only play Batman Arkham Asylum. Sure, head and Arkham Knight and all those. Yeah, the current played **** Batman. Lord of the Rings was the game that the gamers play. Yeah, right? Yeah, but everybody loved the Nemesis. Gamers aren't the this mainstream marketing thing, right? Like that's the this to me says bus images like they beside the buses and all that stuff. I don't know, Tim, I just don't know. I feel like I what I see when he's talking about like they're going for this, they think it's gonna seduce a lot of players that like the gameplay I've seen of it and what I've seen a judge week-10 make me think it's going the other way that again you're drilling down into the the hardcore gamer. Yeah, where you want to take down these bases and you want to get these guys and put them on your team and have all these things. I don't know that doesn't that what I saw met a Shadow of War looks cool, runs really well, looks like fun if that's your kind of game, but",
      "start": 1625.92
    },
    {
      "text": "these guys and put them on your team and have all these things. I don't know that doesn't that what I saw met a Shadow of War looks cool, runs really well, looks like fun if that's your kind of game, but it doesn't look like it's going to be using anybody. Yeah, exactly. What's the title of the game? The full title? I think it's Middle-earth: Shadow of War. You know, Lord of the Rings in there that were your job. Yeah, that's all. It's a weird title for a game that you're trying to seduce people with. Hold on, you keep filling to keep Sargon say some say anything about this, anything you produced. There you go. There you go. That's one. I don't know. I feel like Lord of the Rings should be in there if that's if you're trying to target and push that and if you're not, I don't think it's gonna work to attract somebody with a game called Middle-earth is so shadow a woman contraception. Oh man, yeah, that's all good. Yeah, you figure 87, 84 and 84 or the Metacritic right now and the first game out there and stuff. I",
      "start": 1672.28
    },
    {
      "text": "with a game called Middle-earth is so shadow a woman contraception. Oh man, yeah, that's all good. Yeah, you figure 87, 84 and 84 or the Metacritic right now and the first game out there and stuff. I mean, I wish him well. I know the people who loved Shadow of Mordor are, you know, love Shadow of Mordor. I just it's mm you're rolling on home sale. Shadow of Mordor's release was the most successful for a Lord of the Rings video game. The game debuted at number two in UK retail software sales in its first week and was the ninth best-selling game in the United States in October 2014. This, well, we have very high expectations thing. It's like, okay, you have high expectations that and then goes on to say it's definitely gonna be our game of the year. So high expectations of the game being good or high expectations of this game selling millions and millions of millions? Well, he says our game of the year, so I mean that makes sense for WB's catalog. I would assume even though it's kind of a I mean a roundabout",
      "start": 1713.97
    },
    {
      "text": "of this game selling millions and millions of millions? Well, he says our game of the year, so I mean that makes sense for WB's catalog. I would assume even though it's kind of a I mean a roundabout shot at Injustice, 'cause Injustice was the spring, right? Yeah, of course. So I mean like I don't know. I I wish him well. If you're a Lord of the Rings Shadow of Mordor fan, I want you to go get him, but it's just yeah, this was May this year. I just don't see it being this runaway success, but maybe again we're just missing. All right, KindaFunny.com/kfgd if you're **** outstandingly excited and can't wait for Shadow of War. I wanna I think is I know there are people like know before. I just don't think that it's a massive, massive audience. Like it's not a mainstream game. Is I'm with you on that too. So to be clear, that's the thing. Are we wrong or are we right? Let us know. Shadow of War because I feel like Batman Batman is in the same conversation of Assassin's Creed and Call of Duty. Shadow of War is",
      "start": 1760.12
    },
    {
      "text": "be clear that's the thing are we wrong or are we right? Let us know. Shadow of War because I feel like Batman Batman is in the same conversation of Assassin's Creed and Call of Duty. Shadow of War is not. Yeah, man. Middle-earth is a broad franchise, lots of appeal. We think we just scratched the surface in a very nice and successful way with the first game, but we believe Shadow of War can seduce a lot of other players because there's so much innovation in gameplay. Well, see, gonna have to wait long October of course, right around as all the video game industry goes crazy and a million games come out, but let's let's see what happens. Roll the dice. Get me that man PD numbers. Let's jump ahead dot in November. Number four, Xbox has admitted Crackdown was announced too early. This is a Polygon article. It's an interview with Shannon Loftus, the general manager of Microsoft Studios publishing. Quote, \"I think we probably announced Crackdown too early,\" Loftus told Polygon during a Gamescom interview in Cologne,",
      "start": 1803.23
    },
    {
      "text": "an interview with Shannon Loftus, the general manager of Microsoft Studios publishing. Quote, \"I think we probably announced Crackdown too early,\" Loftus told Polygon during a Gamescom interview in Cologne, Germany this week. \"Crackdown 3 contains three distinct game modes,\" Loftus explains, \"and the three studios working on the title, Reagent Games, Sumo Digital, and Cloudgine, I hate that name, needed most needed more time to push the quality bar higher.\" The game was most recently delayed to 2018 launch last week, but that was only latest setback to hit the title originally promised for the second half of 2016. Jelena Crackdown 3, Loftus said it was the result of the Xbox publishing team realizing the game needed to be a better experience rather than just making it out the door on time. Quote, \"We definitely underestimated a challenge of making sure the quality bar of all three of those modes was high and it delivers on what we need to deliver on, so we had to take the extra time and make sure we're\"",
      "start": 1849.58
    },
    {
      "text": "underestimated a challenge of making sure the quality bar of all three of those modes was high and it delivers on what we need to deliver on, so we had to take the extra time and make sure we're delivering the game the Crackdown fit that there, the Crackdown fans want. It was a super hard decision to do that and it made harder, it was made harder because we announced the game. This reflection was part of Xbox's changing strategy with game announcements, Loftus said. While fans may not see as many exclusive titles now, though Loftus points out there are four coming Xbox One and Windows 10 for the holiday. Funny definition of exclusive is always, but I'm I'm with you, I understand you're saying there are more on the way. Quote, \"I think in the past we have made the mistake of announcing some exclusives a bit too early,\" she said. \"We're trying to learn from that mistake and do better, so we have a bit that's in development now that we're not talking about. We're in this for the long haul and we're gonna\"",
      "start": 1891.81
    },
    {
      "text": "a bit too early,\" she said. \"We're trying to learn from that mistake and do better, so we have a bit that's in development now that we're not talking about. We're in this for the long haul and we're gonna make sure that not just the spring of 2018, but in the summer and in the fall and in the spring of 2019 that we have great unique fun experiences for Xbox gamers.\" Good luck with that. I think it's a great quote. I think it's a great message. I'm glad they're getting out in front of it. I'm glad they're - I mean that's the thing is this is what we're talking about with what the **** going on with Xbox One X. How did the console generations work, right? There's not enough straight talk. Mmm. And like don't get me wrong, this would have been great straight talk to have when you delayed Crackdown. I would have, you know, I would have run it's impossible to think about running Xbox or PlayStation like we'd run Kinda Funny, but hey, we **** up. Let's do it. Let's live to talk to you and do all these",
      "start": 1930.27
    },
    {
      "text": "would have, you know, I would have run it's impossible to think about running Xbox or PlayStation like we'd run Kinda Funny, but hey, we **** up. Let's do it. Let's live to talk to you and do all these different things. That's the way I try to handle everything. This is a good quote here of like, hey, the question has been in this like two weeks of us talking about Xbox and Xbox One X and where they're going in the future has been of just like I'm hoping that Phil on the team have all these exclusives they're hiding away and getting ready for it, but a lot if this is the message they want to go with, that's a great **** message. Yeah, we **** up with Crackdown and Scalebound and all these games we told you about too early, so we're not talking about anything in 2018. We're gonna get there and you're gonna see what we have. Yeah, I mean, I think it's good that they're talking that way and I think that you know, Tom out Crackdown is important too. It's I'm always gonna support game delays if it",
      "start": 1968.1
    },
    {
      "text": "you're gonna see what we have. Yeah, I mean, I think it's good that they're talking that way and I think that you know, Tom out Crackdown is important too. It's I'm always gonna support game delays if it means the games gonna be better at short of the day, right? That's just it be stupid not to, right? But my problem is I don't think Crackdown 3 is gonna be good. Mm-hmm. Like I I don't I think that once it comes out no matter how many delays it has, this is not gonna be a great game. It looks like a strong 7.0. Yeah, hey, and this is fun, but it's empty and it's vapid and we're jumping around, we're doing. And for me, I'm like, is the whatever six months later that we have to wait for this game going to change that? Yeah, or is it just gonna be a different 7.0 game? Mmm, right? Or is right now not even a 7.0 game? I don't know. Yeah, but I just not the Xbox business, dude, but I would kind of be like, oh, let's just **** get this out. And she wanted it. That's that's a great counterpoint to it of what you're",
      "start": 2002.93
    },
    {
      "text": "I don't know. Yeah, but I just not the Xbox business, dude, but I would kind of be like, oh, let's just **** get this out. And she wanted it. That's that's a great counterpoint to it of what you're saying. Yeah, like you can say it and say that you put an S too early, but are you able to fix it? Is it going to be on track? Is it how do you make that game amazing? Yeah, am I sexy when there's all these different modes and different developers and different that's that that whole quote sounds like a mess to me. Yeah, that's like, oh, there's like these three things in the end. It was a bigger deal than we thought to get them all good. Okay, were any of them good? Yeah, if one of them is good, focus on it, put that game out. Yeah, right? Yeah, we'll see. Well, I don't wait and see on this episode, but it's how the news rolls, Tim. Yeah, if I'm done waiting scene and I wanted to play games that came out today, where would I go to find out what came to the Mom and Pop digital shops? Greg, you can go to the official list",
      "start": 2046.58
    },
    {
      "text": "rolls, Tim, yeah, if I'm done waiting, Tim, and I wanted to play games that came out today, where would I go to find out what came to the monograph digital shops? Greg, you can go to the official list of upcoming software across each and every platform is listed by the Kinda Funny Games Daily show hosts each and every weekday. Today: F1 2017 on Xbox One, PS4, and PC; Madden NFL 18 on Xbox One and PS4; Naruto: Ultimate Ninja Storm on PS4; Naruto: Ultimate Ninja Storm 2 on Xbox One, PS4, PC; Naruto: Ultimate Ninja Storm 3 Full Burst on PS4; Naruto: Ultimate Ninja Storm Legacy on Xbox One, PS4; Naruto: Ultimate Ninja Storm Trilogy on PS4. Jesus. One Piece: Unlimited World Red Deluxe Edition on PS4 and PC; NeverEnd on Vita; One Piece: Unlimited World Red on PS4; Path of Exile on Xbox One; Absolute Drift: Zen Edition. Let's try it again. Absolute Drift: Zen Edition Xbox One. Battle of the Bulge Xbox. We're gonna stop you there, Greg. Yeah, Battle of the Bulge. Yeah, be careful now. It's a very historical term, so before you put your foot in it",
      "start": 2084.86
    },
    {
      "text": "Absolute Drift: Zen Edition Xbox One. Battle of the Bulge Xbox. We're gonna stop you there, Greg. Yeah, Battle of the Bulge. Yeah, be careful now. It's a very historical term, so before you put your foot in it and act like this is something they don't even know what it is. Okay, inform me. What is this Battle of the Bulge, gamer? Like, it was a historic battle in World War II. Yeah, never heard. Yeah, you gotta pay more attention to history books and less to your mangas. All right. Yeah, you gonna watch Death Note this weekend? Hell yeah, we're gonna watch it. Well, actually, not this weekend. I have to wait for Gia. And where this whole shit thing, Eventide: The Sorcerer's Mirror, was me on Xbox One. And then Danganronpa V3 has a demo up on the PSN. You can check that out. In terms of new dates, there's a remake of Yakuza apparently on the way called Yakuza Kiwami 2. It was leaked on the Taiwan PSN with a supposed release date of December 17, 2017. Be on the lookout for that. Tim, mm-hmm. You ready to jump on some",
      "start": 2140.87
    },
    {
      "text": "Yakuza apparently on the way called Yakuza Kiwami 2. It was leaked on the Taiwan PSN with a supposed release date of December 17, 2017. Be on the lookout for that. Tim, mm-hmm. You ready to jump on some reader mail? Yes, looking for a good one to kick it off with. You know what I mean? Good. Stickles writes in. Stickles@KindaFunny.com/kfgd and says, \"Hiya, Greg and guests. Sorry, I'm two days behind. You'll see my question on, no, on Friday, maybe. Maybe it's Tim. I'm listening to Wednesday's show and you heard and heard the listener who was unhappy about the Uncharted: The Lost Legacy review. You mentioned it felt a lot like Uncharted 4 all over again and wished you perhaps could have played it before the excellent conclusion of that Uncharted 4 had. I'm in the situation where my backlog has been constantly growing and I've kicked the World of Warcraft habit clean for three months in counting. I've only played the original Uncharted and have to play 2, 3, 4, and now Lost Legacy. Should I carry out",
      "start": 2183.11
    },
    {
      "text": "growing and I've kicked the World of Warcraft habit clean for three months in counting. I've only played the original Uncharted and have to play 2, 3, 4, and now Lost Legacy. Should I carry out your wish and play Lost Legacy before 4, or would I be spoiling any of 4 if I did that and just stick to the release order? I know I've been missing out and hopefully will affect to rectify the situation soon. Thanks and happy Friday. Stickles.\" Interesting question, Stickles. Let's break it down into parts. Should you play The Lost Legacy before Uncharted 4? No. No, under no circumstance. You won't get references about Nadine's relationship to people. You won't get out of things. However, should you play Uncharted 4 and then when the epilogue begins, stop Uncharted 4 and play The Lost Legacy? I say yes. No, I say 100% yes. Your answer, and it is no. I, there are rules to this game. One of the writing, things are designed in a way to be watched. We're not doing this Machete Order Star Wars shit. You're not",
      "start": 2235.28
    },
    {
      "text": "No, I say 100% yes. Your answer, and it is no. I, there are rules to this game. One of the writing, things are designed in a way to be watched. We're not doing this Machete Order Star Wars shit. You're not watching, \"Oh, watch Fast and Furious 3 and then watch parts of it.\" No, fuck that. No. You're supposed to have the knowledge of all that when you play Lost Legacy. I think you're supposed to have the knowledge of everything before the epilogue because that's how timelines work. But here's my argument. It's like what might, you know, might when I'm in the review where I talk about it's just the fact that Uncharted 4 ended so perfectly and it closes everything up so great. I would much, I would totally prefer to have Nadine and Chloe's story inserted before that. And then I, and then, and, and because I was like, I'm talking about, right, this is gonna be the final, is I like Lost Legacy, but this is gonna be the final taste that Uncharted I have for years and years and years, maybe forever, which isn't true.",
      "start": 2284.33
    },
    {
      "text": "I'm talking about, right, this is gonna be the final, is I like Lost Legacy, but this is gonna be the final taste that Uncharted I have for years and years and years, maybe forever, which isn't true, but maybe forever. And I would, I would much rather insert them there and then close it off with the epilogue of Uncharted 4 and just end it there. Now, granted, you're then putting eight hours of something completely different in there. I hope The Lost Legacy performs well enough to make Naughty Dog go, \"We need to do more of this, more just side things as we're going on.\" Still have the big temple game, have like The Last of Us or whatever new thing they do, but then also have an Uncharted experience. The world is too good to to leave. And I think that this game shows how you could have just side stories with these awesome characters that we love, but they're always gonna feel like side stories. Yeah, but I'm fine with that. Like, I had fun with this. I liked this. And you're ruining the sanctity of my Uncharted, dude.",
      "start": 2330.8
    },
    {
      "text": "awesome characters that we love, but they're always gonna feel like side stories. Yeah, but I'm fine with that. Like, I had fun with this. I liked this. And you're ruining the sanctity of my Uncharted, dude. No, it's good. It's good. Enjoy. I'm gonna apply to MIT and I just want more. That's not games like that. There's no other game that feels like Uncharted, that plays the controller, that tells a story like Uncharted. So until that hole is filled with something else, I just want more of this. And I think that they can keep doing cool things with it because there's so many cool characters that they can. I see. And I also think that the the epilogue after like playing 4 and then Lost Legacy, whatever, doesn't work because the if it was Sam and Sully, like Uncharted 4 kind of hints at, yeah, that would have been made sense. Now, what a cool idea that is too. Hmm. Don't like it, Greg. Don't like it. One. Okay, I hear you. Oh, I, we're gonna play the beginning, or not beginning, but the little kid part of Uncharted 3 before you",
      "start": 2372.05
    },
    {
      "text": "sense. Now, what a cool idea that is too. Hmm. Don't like it, Greg. Don't like it. One. Okay, I hear you. Oh, I, we're gonna play the beginning, or not beginning, but the little kid part of Uncharted 3 before you play anything else. Well, no, but that says the storytelling, what, that's why I'm in this storytelling structure that they're telling you a story a specific way. There, I think the storytelling structure here of ending with that epilogue makes more sense if we just put it. Doesn't matter either way. Playing the way they were. Don't play. Just play Uncharted 4 and then play Lost Legacy. Don't do what I'm saying. I'm just saying it's an interesting argument. It is an interesting thing to talk about. You're right. I don't know. And I love, I had a lot of fun with Lost Legacy. I don't want to see them keep doing this. I want to see them continue to be the triple-A. We take a few years and we come back with something awesome. I want to see their next idea. I want to see them branch out. I want to see The Last of Us now",
      "start": 2418.62
    },
    {
      "text": "I want to see them continue to be the triple-A. We take a few years and we come back with something awesome. I want to see their next idea. I want to see them branch out. I want to see The Last of Us now becomes their franchise or that's the game they focus on. And then we get something brand-new from them next time. I do too. I want that above all. But I also want this game to perform well enough that they can hire more talented people and have another team that does this. Brand new team going on doing that. No way. Not a brand new team, but like, like, work, expand the team so that it can do more than one thing, more than two things even. This is, but then we're into a Batman situation where we can, they can end it right now and die the hero, or they can keep going at all another, fuck, Chloe and Cutter, and for whatever story. Uh, yeah, I mean, else, I'm not talking about, I don't want ten more of these things. Yeah, but I would be super down for two more side stories. Okay, super down. Once a year, fuck, give it to me. I don't",
      "start": 2462.3
    },
    {
      "text": "story. Uh, yeah, I mean, else, I'm not talking about, I don't want ten more of these things. Yeah, but I would be super down for two more side stories. Okay, super down. Once a year, fuck, give it to me. I don't know, man. Just let it rest because it'll be cool. Naughty Dog's, man, they'll figure it out. What if they just, if they just chill out for five, seven years, then PAX Uncharted and it picks up after the epilogue with a new character? Yeah, it'd be great. That'd be great. But if I fuck, have fuck Sam and Cutter and all these fucks going around getting every goddamn treasure in the world, fuck off. Let him sit for a while. Jesus Christ. Let's jump to Chris. Chris writes in and says, well, he wrote into KindaFunny.com/KFGD, just like you can, says, \"Hey, guys. Over the years, I've seen many videos of physically handicapped people playing video games. Many of them have to come up with elaborate homemade setups just to play sometimes a single video game. It's moving and impressive to see such passion to be to",
      "start": 2501.39
    },
    {
      "text": "handicapped people playing video games. Many of them have to come up with elaborate homemade setups just to play sometimes a single video game. It's moving and impressive to see such passion to be to be able to do something I often take for granted. But this leads me to my question: Do you think enough is done for handicapped gamers, whether that be software features or hardware developers making accessories that are easy, that's easier for handicapped gamers to use? What are your thoughts? Thanks and keep up the good work.\" There was an amazing panel at PSX 2016 that I recommend you you look up and watch that is about this and about how Sony really cares and is investing in this type of stuff. And there's a lot of things in games that they don't talk about that much, but they're there. And there's a lot of accessibility things that especially the first-parties really consider as much as they can. And there it was interesting. They're like, \"We can't make it so that everybody can do everything.\" Yeah.",
      "start": 2552.26
    },
    {
      "text": "a lot of accessibility things that especially the first-parties really consider as much as they can. And there it was interesting. They're like, \"We can't make it so that everybody can do everything.\" Yeah, but they they have teams like theirs. Sony has a team of people that go to the different developers and are like, \"Hey, you should think about these things,\" because otherwise they wouldn't have thought about it. 100%. And that that was the interesting thing is like, I think until it was brought to my attention or, you know, you meet somebody who plays games differently or so, you know, I'm Colin Campbell at IGN. I remember did a piece about a guy who played with had to play with one hand. Uh, it's that thing of, \"Oh, yeah, I never thought about that.\" Or like, one, I even like subtitles in games that I hate these and I turn them off. Or maybe I don't even there sometimes. And for deaf gamers, they're like, \"Oh, well, that's a huge thing for me.\" Until you meet someone or have somebody who is advocating for those people,",
      "start": 2596.78
    },
    {
      "text": "I turn them off or maybe I don't even there sometimes. And for deaf gamers, they're like, \"Oh, well, that's a huge thing for me.\" Until you meet someone or have somebody who is advocating for those people. It's not something I remember. Panel was really good. But when this question came in from Chris, my reaction was basically, is he's like, because it comes down, right, his question is, my question is this: Do you think enough is done for handicapped gamers? I don't think that's for us to say. And I don't because I don't think I'm, with all due respect, paying enough attention to that, right? I'm more worried about what the fuck going all these trophies because that's what's, you know, affecting my life on a daily basis. So what I did is I hit up my friend Steven Spohn from AbleGamers. He's the CEO of AbleGamers.com. And I asked him to write in and answer this question since we really don't have any legs to stand on on it. That don't try to make that into a pun. \"Hello, fellow gamer. You have a big heart and this",
      "start": 2636.89
    },
    {
      "text": ".com. And I asked him to write in and answer this question since we really don't have any legs to stand on on it. That don't try to make that into a pun. \"Hello, fellow gamer. You have a big heart.\" And this is Steven again. Obviously, \"Hello, fellow gamer. You have a big heart and a lot of empathy to ask a question like this. I'll do my best to answer you honestly. My name is Steven Spohn, the Chief Operations Officer of AbleGamers, which is the biggest charity enabling gamers with disabilities to play games. My dear friend Greg asked me to lend a hand when answering your question. Now, you owe me a pizza. And that makes me happy. Damn it. Do you think enough is being done for gamers with disabilities? No, I don't think enough is being done. There are there are over 33 million gamers with disabilities in America alone. And that number just keeps climbing the more countries you include. If you'll take a look at the numbers from the World Health Organization and the ESA, you'll see there's a ton of people with",
      "start": 2675.9
    },
    {
      "text": "alone. And that number just keeps climbing the more countries you include. If you'll take a look at the numbers from the World Health Organization and the ESA, you'll see there's a ton of people with disabilities who will also want to play games. But the truth is that you see people coming up with elaborate homemade setups because it cost too much to buy customized specialty equipment designed for video games. A standard controller is only 30 bucks, but each one of the assistive technologies we grant out cost hundreds of dollars. They are incredibly expensive. Imagine paying $450 just to be able to play your Xbox or $1500 to be able to play your Vita. It's a shame. And I, that's a Greg here chiming in. Oh my God, 1500 will play a Vita. It's worth it. But what? Oh, Jesus. Back to Steven. It's a shame because there are so many controllers that we can recommend and so many more we can build thanks to 3D printing and a little elbow grease. There are hardware devices that I can get for you that I'm sorry, there",
      "start": 2718.71
    },
    {
      "text": "there are so many controllers that we can recommend and so many more we can build thanks to 3D printing and a little elbow grease. There are hardware devices that I can get for you that I'm sorry, there are hardware devices that I can get for you to play games on even if you, quote, aren't that, quote, only have the use of one hand or one arm or some fingers on each hand. If you can only move, if you can only move your head, and if all you can do is press a single switch, there are options out there for you. I'm extremely privileged to work for such an amazing company. AbleGamers provides controllers for hundreds of gamers every year and advice for thousands. I get to spend 10 hours a day interviewing people with disabilities, finding out about their lives, fearing their challenges, and then working with them one on one to get them back into the game. Honestly, it's the best job in the world. I met a young profoundly disabled boy outside of Chicago. He came to one of our demonstrations with his mom, dad,",
      "start": 2761.67
    },
    {
      "text": "them one on one to get them back into the game. Honestly, it's the best job in the world. I met a young profoundly disabled boy outside of Chicago. He came to one of our demonstrations with his mom, dad, and look, I'm sorry, dad, who looked like The Rock, brother and sister, maybe all 10 years old. The boy was in a wheelchair, reclined, but back with a heart monitor on his on his table. He was unable to speak except for making a few sounds. He had never been able to play video games because standard controllers are too difficult. But the family was intrigued by our Forza setup. After a few moments, after a few month, after a few moments with us, we were able to locate that he had some movement still on his left foot. We clicked, we quickly gathered the right equipment and put together the an Xbox controller that operated like a gas pedal. We placed the pedal in the air, his foot. He pressed down and the car came roaring to life, took off down the speedway where it immediately crashed into a wall. The young boy",
      "start": 2803.37
    },
    {
      "text": "operated like a gas pedal. We placed the pedal in the air, his foot. He pressed down and the car came roaring to life, took off down the speedway where it immediately crashed into a wall. The young boy laughed and giggled, having just enjoyed his first experience with a video game. I wish I could tell you, like, I wish I could tell you that stories like this get more attention, but they don't. It's hard for some people to relate to disabilities if you've never experienced the medical world. It's almost impossible to describe. It can be a frightening place and it can't and it can make you feel very alone. But video games can solve them. Video games can open a window to an otherwise inaccessible world for people with disabilities and men in medical medical situations. I try, AbleGamers tries, all of our allies, including Kinda Funny, tries to help us the best they can. I, the work, oh, I'm sorry, my work is expensive and time-consuming, but it's so worthwhile. I hope that as more and more people realize the",
      "start": 2845.28
    },
    {
      "text": "including Kinda Funny, tries to help us the best they can. I, the work, oh, I'm sorry, my work is expensive and time-consuming, but it's so worthwhile. I hope that as more and more people realize the importance of video gaming for people with disabilities, that we will continue to see more publishers supporting the accessibility options we advocate, more support for charities that support people with disabilities like AbleGamers, and more people following the brave streamers who will put up with the trolls mocking their disability just to have the game, just to give the world a reminder that we all want to play together. Our hashtag on Twitter is #SoEveryoneCanGame. And it's a match and it's the mantra of our lives. We will not stop until everyone with a disability who wants to play a game has the chance to join. Final note, if you need help playing or just want to talk about accessibility, you can reach me at Steven Spohn. I'm always happy to help. Thank you. Shout out to him.",
      "start": 2883.68
    },
    {
      "text": "has the chance to join. Final note, if you need help playing or just want to talk about accessibility, you can reach me at Steven Spohn. I'm always happy to help. Thank you. Shout out to him for putting this much work into this. That's all. I mean, this is what Steven Spohn. Yeah, he's awesome. He's amazing. AbleGamers is awesome. I'm always happy to help out when I can, but I wish I had more time and that we had more time to do stuff with him. But AbleGamers.com is a fantastic charity. If ever we could go over there, check it out, toss him a few bucks if you got them, that'd be awesome. If you're one of the people watching Twitch right now, rather than tipping us or subbing us today, it'd be great if you could go over there and toss him a few dollars because they deserve it and they're great. I'm pretty sure there'll be a PAX. Is always Steven's always. Look for him. All right, I'm gonna pull it together here and real quick, we're gonna go to Nick. Nick has a Would You Rather. I love Would You",
      "start": 2925.6
    },
    {
      "text": "I'm pretty sure there'll be a PAX. Is always Steven's always. Look for him. All right, I'm gonna pull it together here and real quick, we're gonna go to Nick. Nick has a Would You Rather. I love Would You Rather. And this is Nick from New Hampshire. Nick from New Hampshire, you wrote into KindaFunny.com/KFGD, just like you can. It says, \"Dear Greg and Tim, but I like it. Would you rather be given the top 5 games from the NES, SNES, N64, GameCube, and GBA in their original format and on their original systems for free, or pay to have these games on the Switch?\" Then you put some asterisks in there. \"Top 5 is harder to determine, so let's say according to IGN's lists of the best games from each platform. Prices comparable to Virtual Console prices on Wii U / 3DS, so $5 to $15. Note: You must play the games in this scenario using one of your current entertainment setups. Yes, this means plugging, unplugging all the adapters and whatever than HDTVs. Is there any hesitation for you?\" No, Switch. Yeah.",
      "start": 2962.83
    },
    {
      "text": "the games in this scenario using one of your current entertainment setups. Yes, this means plugging, unplugging all the adapters and whatever than HDTVs. Is there any hesitation for you? No, Switch. Yeah. Yeah. Okay, good. Make sure on the same page. Oh my God, of course. A Nintendo. There's all these things on the Switch. It's all about ecosystem. It's all about convenience. I just want it on Switch. I want it so I don't even need to play him. I just want to like hit left and right to look through him. Yep. Having a game like once in a while, popping, play a couple Mario 3 levels, call it a day. You know, I still haven't ever beaten Mario 3. I started playing on the 3DS that one day at a bar and I've got into it. But you know, I keep saying this, yeah, that at some point I want to do a definitive look at Mario 3 vs. Mario World. We need to figure this out. You need it. We need to figure out you beating Mario 3. And critical, it is a garbage. Good Lord. Sorry, I get it fired up when I think about Cheep Cheep Jr. Yeah, jeez. Time",
      "start": 3015.81
    },
    {
      "text": "World. We need to figure this out. You need it. We need to figure out you beating Mario 3. And critical, it is a garbage. Good Lord. Sorry, I get it fired up when I think about Cheep Cheep Jr. Yeah, jeez. Time to Squad Up. This is where one of you writes into KindaFunny.com/KFGD. You give me your name, your username, the platform you're on, the game you need help with, and why. I read here, best friends hit you up and everybody has fun on the internet. Phil, aka Clutch Black Cops, stick with me. At first I was like, what? He explains, writes in and it says, \"I'm looking to Squad Up. This might be a conglomerate of a segment, but I love it all. I'm looking for best friends to play Destiny with on PlayStation 4. Currently, my greasy friend and I are trying to shore up our trophies and finally get the Destiny Plat. We've been trying to earn Flawless Raider. This is where the second, this is where the second topic segment comes in. This trophy can go fuck itself. We've been trying for weeks to earn the fuck of a",
      "start": 3054.16
    },
    {
      "text": "we've been trying to earn Flawless Raider. This is where the second, this is where the second topic segment comes in. This trophy can go fuck itself. We've been trying for weeks to earn the fuck of a Platinum breaker. All the other trophies in Destiny are completely reasonable, but doing an entire raid without a single person on your fire team dying is completely fucking ridiculous. So this is my plea for best friends to help us with Flawless Raider and to enjoy our Destiny experience to fruition so we can move on to Destiny 2. My PSN name is Clutch-BlackCops. Yes, I thought I was in a cool clan for Black Ops in high school, but didn't we all? That made more sense. Like, all right, whatever. It's KluTCH-bLaCkCoPS. All of the coming, all of this coming from a vehement trophy whore like yourself, Greg. Keep on whoring trophies. Will make or break a game for me and it's a big deal to a lot of us. Love the new show format and all you do at Kinda Funny. Phil, aka Clutch Black Cops.\" Squad Up with them.",
      "start": 3105.19
    },
    {
      "text": "Greg, keep on whoring trophies. Will make or break a game for me and it's a big deal to a lot of us. Love the new show format and all you do at Kinda Funny. Phil, aka Clutch Black Cops. Squad Up with them. Squad Up! Go get that trophy if you're really good at Destiny. You know what I'm saying? Tim, what you're saying. Ah, Tim, yes. Do you have what we got wrong? Or would you like to me? I have a couple extra segments today. I can roll into. Why you do that? Yeah, why you looking what we wrong? It's kindafunny.com/yourewrong. I'm gonna read you a bad PSN name. This comes Venice. It isn't Black Cops. No, yeah, he could have been three segments there. But I'm gonna give this one the in there to Sir Davos writes in and says, \"Not a question, but a bad PSN name, Greg. So I know you don't like this one. It's not our own name, but I have to say it. So my mates and I were playing some good old Friday the 13th. We were hiding in a cabin gathering supplies for the journey of the car. The music changes. Jason is knocking on our",
      "start": 3154.54
    },
    {
      "text": "but I have to say it so my mates and I were playing some good old Friday the 13th we were hiding in a cabin gathering supplies for the journey of the car the music changes Jason is knocking on our door after a struggle Jason kills us all that's when we discovered who killed us none other then Anal With Grandad Anal With Grandad A and Ul With Grandad please Shuhei let us change our names that is horrible I'm telling you Shuhei Yoshida hates you and he'll never let you change your names because you did this but there it is that's just yeah I don't know I'm gonna go through these Greg it's why I'd be wrong Cry B says last Thursday Tim said the Splatoon Joy-Cons are only pink left and green right in Japan on the My Nintendo site you can customize your Switch to do both left and right green or left or right pink we we don't live no Japan though we don't live in Japan that is true Secret of Mana Remake is also coming to PC says come I'm sorry I saw on a PlayStation Blog and and see any",
      "start": 3197.11
    },
    {
      "text": "or left or right pink we we don't live no Japan though we don't live in Japan that is true Secret of Mana Remake is also coming to PC says come I'm sorry I saw on a PlayStation Blog and and see any stuff outside of doodling a Superman symbol for you to use at home I often do this is what I do Charles J says the original Secret of Mana also had three player co-op back on this and he asked to made it sound like it was a new feature I did not know so you sent up a British can't believe you'd lie to the kids like that 10 I'm such a liar Shadow of Mordor sales 4.8 million total 3.5 on PS4 and 1.37 on Xbox thank you respect really good I'm not trying to knock it I'm just saying great even the way I'm talking about it they're making it sound like this thing is gonna be the Jim James on the Jim Dodge you know I'm saying cool Greg ain't gonna happen M. Murphy J11 says Shadow of War not being called Lord of the Rings is due to a licensing issue and how the world of Middle-earth spans",
      "start": 3247.36
    },
    {
      "text": "the Jim Dodge you know I'm saying cool Greg ain't gonna happen M. Murphy J11 says Shadow of War not being called Lord of the Rings is due to a licensing issue and how the world of Middle-earth spans multiple world works of literature a piece of work has to pertain directly to Lord of the Rings such as The Lord of the Rings Online their likeness is only for what happens in the books and nothing more turn the name the Shadow of Mordor series takes place in Middle-earth but outside the literature The Lord of the Rings Tolkien Enterprises is super finicky and straight with licensing and naming thank you that is very interesting so I'm sure WB wishes like it's laughs Lord of the Rings in the box to tighten matrix is drafting some editorial whatever I just want to read this Greg cool well talking about I'm trying to Lost Legacy Greg said he was gonna Platinum it no just as incorrect Greg can't platinum games anymore he lost his mojo he can't even start Persona 5 you're all pieces of work I'll",
      "start": 3297.74
    },
    {
      "text": "about I'm trying to Lost Legacy Greg said he was gonna Platinum it no just as incorrect Greg can't platinum games anymore he lost his mojo he can't even start Persona 5 you're all pieces of work I'll tell you what I'm not gonna Platinum Hot Shots Golf or Everybody's Golf I play that right now trophies went up and I looked at under like that me like not to say I mean I'm gonna play a lot of it for sure very excited about it button what do you do speaking of trophies Greg way a lot of you Overwatch fans wrote in melting down about it so I'm gonna explain it here Burt wrote in says yesterday's changes to the character Mercy and Overwatch change what charge were announced what yesterday changes to the character Mercy in Overwatch charge were announced completely changing her ultimate ability this change makes it impossible to get a trophy that required you to use our old ultimate on for people you're supposed to heal for people with this ultimate to him but not she can't do that with games",
      "start": 3336.05
    },
    {
      "text": "change makes it impossible to get a trophy that required you to use our old ultimate on for people you're supposed to heal for people with this ultimate to him but not she can't do that with games becoming services in multiplayer games specifically needing balances can this affect future trophy lists or does Blizzard just not care about the non Master Race nerf this am I right nerf this indeed yeah I saw this going around I saw people writing in about it keep being a lot about it Blizzard will change it they'll fix it yeah I'll get in there I mean for everything I know about Blizzard they are a very attentive company I'm sure all this is just something they look past now they'll see it they'll get in there and update the trophy list and do some kind of back in shenanigans to do it and if not I didn't say it but burn about Kinda Funny Games Daily remember each and every weekday on a variety of platforms we run you through the nerdy video game news you need to know about before",
      "start": 3383.21
    },
    {
      "text": "and if not I didn't say it but burn about Kinda Funny Games Daily remember each and every weekday on a variety of platforms we run you through the nerdy video game news you need to know about before jumping to the chat no that's not our hasn't different I just did before jumping your questions comments and concerns that you leave it KindaFunny.com/KFGDD Monday, Tim and I will be back so that's who's on the show don't screw it up go through running through did you see I added it mmm there's a new segment here that says who's on cuz every is always people right in there always so upset if I don't say and they don't know is gonna be I appreciate that you can get it on Twitch live as we do it you can go to YouTube.com/KindaFunnyGames watch it there you can get it on podcast services around the globe but no matter where you get it thank you for caring until next time have a great weekend it's been our pleasure to serve you you",
      "start": 3417.78
    }
  ]
}
