{
    "id": 2883,
    "video_id": "Cj_OAZ-5o2k",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "UFC - The GameOverGreggy Show Ep. 192 (Pt. 3)",
    "description": "Thanks to Pro Flowers for sponsoring this episode. Go to ProFlowers.com and use promo code Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502262000,
    "duration": 2061,
    "transcript_chunks": [
        {
            "text": "You know who loves flowers? Everyone. You know who doesn't like flowers? My old landlord. Today's sponsor, ProFlowers, sent some to my old address. My former landlord got so pissed off. I don't know why. ProFlowers are beautiful, they smell great, and are guaranteed to stay fresh for at least seven days or your money back. But that didn't stop my landlord from calling me all pissy about me still getting packages at the old crib that I never am ever coming back to get. I told him it was a mistake, he could keep the flowers. I love them. I've always been happy with every arrangement I've gotten, but he wouldn't listen. So don't be like my landlord. Get 20% off any of the unique summer rose bouquets or any other bouquet of $29 or more by going to ProFlowers.com and using my code Greggy at the checkout. That's ProFlowers.com and the code Greggy. Don't wait to make someone's day. And my former landlord, you can go to hell, you free flower hating monster. Tim, what's your topic? My topic is UFC.",
            "start": 0.0
        },
        {
            "text": "That's ProFlowers.com and the code Greggy. Don't wait to make someone's day. And my former landlord, you can go to hell, you free flower hating monster. Tim, what's your topic? My topic is UFC, specifically because I just spent a weekend in my boy James Burke's bachelor party. His bachelor party was insane, quite possibly the most ridiculous uh bachelor party of all time in terms of events, number of events crammed into such a short period of time. So I joined them halfway through. They started it Thursday and Friday, Vegas. Okay, they did it, they hit Vegas super hard. Nick joined them Saturday uh morning. We went to I went to LA to meet them. So they drove, they drove from SF to Vegas, drove from Vegas to LA. I flew into LA. Uh we went to a Giants versus Dodgers game. Who won? And uh the the the Dodgers won, which was not good for the my group of people that were very loud and orange. Lot of orange, lot of black. I was wearing blue and white because that's what I do. They gave me a lot of **** for that, yeah.",
            "start": 46.6
        },
        {
            "text": "Was not good for the my group of people that were very loud and orange. Lot of orange, lot of black. I was wearing blue and white because that's what I do. They gave me a lot of **** for that, yeah. That's Dodgers, but you blend in. Our team won, I guess. There you go, go Dodgers. But anyways, so we did that and that sucked and that's where I got blistering uh sunburns. Why wear horrible fashion over function? That's not it. It doesn't have anything to do with fashion, honestly, because I didn't **** expect my dumb **** friend to get seats where sitting in the sun. It's like he's like, \"Nah, dude, we got this.\" I should have known when you said we're in a section that's all you can eat, that that's yeah, going to be. He showed me pictures of it and he's like, \"No, dude, like here's where we're at.\" And I'm like, there's covering, there's shade, there's this indoor area. Indoor area blocked by bleachers, you can't even see the game. Not a problem for me. We're getting way ahead of myself. It doesn't even **** matter. I",
            "start": 113.92
        },
        {
            "text": "Covering, there's shade, there's this indoor area. Indoor area blocked by bleachers, you can't even see the game. Not a problem for me. We're getting way ahead of myself. It doesn't even **** matter. I got really badly sunburned. Then we went straight from the game to Anaheim to go to the UFC event. Yeah, Cormier versus Jones, Jon Jones. Yep. And uh that and the next we went to that was when I actually had fun. Uh and it was a lot of fun. But back to the UFC thing, I've never watched UFC. Nick, you're a huge fan of UFC. So I got to be there. I got to see this whole spectacle, big deal fight. I was tweeting, I was live tweeting it as you do, as one does. And people kept asking, \"Is Nick at the fight?\" To which I begrudgingly had to respond, \"No, but Tim is at the fight.\" So many people texted me saying, \"Are you and Nick at the fight?\" I'm like, \"No, just me.\" No, it was it was quite the experience. Did you ever is this like the one moment you're like, \"Man, I should have been better friends with James?\" Uh yeah, 100%. 100%. It's one of",
            "start": 153.72
        },
        {
            "text": "The fight. I'm like, \"No, just me.\" No, it was it was quite the experience. Did you ever is this like the one moment you're like, \"Man, I should have been better friends with James?\" Uh yeah, 100%. 100%. It's one of those things like I never even think to go to a UFC fight largely because I actually just like watching them at home. Uh it's a better experience for two reasons. One, I think it it's easier to watch. Uh and two, you get expert commentary from from Joe Rogan. I think Dominick Cruz was uh was announcing this fight as well. Um it's I like hearing that. I like being like, \"Oh, I think that's this,\" and then either being corrected or being validated. Um and there's something about that live event of UFC where people get like there is an an alpha male aspect of UFC goers that I think you get a lot more of when you go to the event. You get like I I haven't been to one in a really long time, but last time I was one, I looked around and there was a sea of Affliction shirts and a lot of people were getting drunk.",
            "start": 201.08
        },
        {
            "text": "You go to the event, you get like I I haven't been to one in a really long time, but last time I was one, I looked around and there was a sea of Affliction shirts and a lot of people were getting drunk. And you get a lot of people who train, quote unquote, and who really want to try to like use that on someone, like looking for a fight, basically. Well, I mean, even more than that, like you put them together and I mean any sporting event's this way. Like even being at the Dodgers SF thing, there's obviously rivalry there. So it's like it was uncomfortable when people would start yelling **** at us and I'm like, I didn't give a ****. But had my group of friends been a little more drunk and a little more, you know, ready to fight, that could have been an issue. Sure. You put that in a fighting environment where people are betting on these two dudes and there is thousands of dollars on the line. By the way, James Burke won $3,000. What? He put He put all his money on Jones. Uh no, it was like a parlay he did.",
            "start": 243.24
        },
        {
            "text": "Where people are betting on these two dudes and there is thousands of dollars on the line. By the way, James Burke won $3,000. What? He put He put all his money on Jones. Uh no, it was like a parlay he did. This whole interesting he spread. Anyways, um yeah, but yeah, what you're talking about is so true. It was like it was kind of like, \"Oh, there's a lot going on here,\" and I'm like, \"I don't want no part in this.\" It's a fun energy and I shouldn't shouldn't speak ill of people who go to those fights. I'm generalizing ultimately. Like I've never I think I I went to four, I think been to three fights, been to three fights, seen a scuffle at one of them once. So it's not like people are going to like beat in the **** out of each other in the bleachers. That's an unfair statement. Say there's a lot of aggressive that I saw. Did. Oh yeah, no, whether in or right outside the area. Baseball this? No, no, this the you went to a baseball game in the morning and then the UFC fight that happened there. No fights at the baseball. No.",
            "start": 279.24
        },
        {
            "text": "I saw. Did. Oh yeah, no, whether in or right outside the area. Baseball this? No, no, this the you went to a baseball game in the morning and then the UFC fight that happened there. No fights at the baseball. No fight at the baseball, but a lot of attempted fights. People tried to start **** with us for sure, but it didn't happen. Uh but then yeah, the UFC thing, man, it was interesting because I I agree with what you're saying where I'd rather watch on TV. Like even like with wrestling, the closest thing I got is WWE. And any wrestling event I've been to has been cool for the spectacle of it, seeing everyone be there and hearing the cheers and stuff. But like you really lose a lot when you're not hearing people explain to you what's happening. The commentary is a big portion of it, right? And especially more in wrestling, I'd say, because that is the storyline of it. Well, that's also the entertainment aspect. Oh my God, he's doing it. You know, there's that adds to it for sure. It's it all comes down to how deep you're",
            "start": 313.76
        },
        {
            "text": "I'd say because that is the storyline of it. Well, that's also the entertainment aspect. Oh my God, he's doing it. You know, there's that adds to it for sure. It's it all comes down to how deep you're into anything. Wrestling is the one thing I think going to is a different experience. Not the one thing, but in terms of this, like I, you know, I I've gone to dozens of WWE shows and ECW shows and whatever shows. And going there, it's that shared experience of we're all so in, we don't need to be told that's a suplex. We don't need to be told he's going for something. It's that thing and that shared crowd reaction, the screaming and the fall and, you know, the the ride of it all, I guess. Whereas when I go to UFC, I I fall in the same boat as like, well, what you're talking about. It's just like, I don't know what the **** going on. I mean, I don't know what the **** was going on either. It's really interesting for me to compare the two because like even though we know what the suplexes are, I don't think they're",
            "start": 354.16
        },
        {
            "text": "**** going on. I mean, I don't know what the **** was going on either. It's really interesting for me to compare the two because like even though we know what the suplexes are, I don't think they're entertaining to watch unless someone's telling me they're entertaining to watch. Whereas with the fight, because it was two people literally beating the **** out of each other, it's like it was a bit more like real where I'm like, I don't need to understand what's happening. You just see someone fall down bloody. If someone falls down, doesn't get up, like that's the end of it, right? And so like that to me was one of the things. WWE obviously much more of a spectacle, a lot more pizzazz and everything that they do, the entrances and it's uh it's like theater, right? Absolutely. It really is. It's live theater. Not just their their performances, but even just them walking out, even just like the lighting and the just everything. It's so hype. The UFC thing, I was just like, are you kidding me with these",
            "start": 390.72
        },
        {
            "text": "Theater. Not just their their performances, but even just them walking out, even just like the lighting and the just everything. It's so hype. The UFC thing, I was just like, are you kidding me with these entrances? No presentation for dude. The presentation was like sad. It was bad. Like they come out to songs. Most of them would come out to songs where it'd be like it'd play one verse, stop, and another song would start. And I'm like, who who decided this was okay? Like it doesn't even make sense to me. And every all the lighting was all the same. All that stuff was like so similar. I'm like, all right, I get that they're there for the real reasons, which is the fights. But it's like, man, I I wouldn't ever want to pay for this. I think Bellator or the glitter, man, I want to say it's Bellator does a little bit more hype entrances than uh than UFC. Like they'll do the entrances where it's like down the ramp and it's it's a competing fighting brand, a competing MMA uh promotion, I think is what they call him. I mean,",
            "start": 425.52
        },
        {
            "text": "Hype entrances than uh than UFC. Like they'll do the entrances where it's like down the ramp and it's it's a competing fighting brand, a competing MMA uh promotion, I think is what they call him. I mean, that was a shout out, you know, I mean, to CM Punk for his fight that he came out to his WWE music. Yeah, I mean, it's just called personality, but whatever, it's that's **** cool. And to be fair, like there's people that came out to music that fit their personality and like there was some of that there. And as we went through the card, it did get a bit bigger and bigger. Like the for the final Cormier versus Jones fight, like that definitely they did have entrances and they were way more like focused and they'd cut all the lights and like do cool stuff with it. But like I'm getting really in the weeds of the of that stuff. Really though, like watching the fights, I just feel like the the storytelling of all of it and as it was happening, it was very exciting to watch and it was super fun until it wasn't.",
            "start": 469.76
        },
        {
            "text": "The of that stuff. Really though, like watching the fights, I just feel like the the storytelling of all of it and as it was happening, it was very exciting to watch and it was super fun until it wasn't. And it's like there was certain matches where I'm like, holy crap, this is so boring. The match you're referring to was the second to last match was Tyron Woodley versus Demian Maia. And that unfortunately happens sometimes, right? Um the so let's go the the the matches out on the main card. I didn't watch a lot of the undercard, so I don't know when you guys got there, but there's an undercard and a main card. The main card is what's televised. The undercard is dark fights, basically. We were there. We watched there was I think 10 fights or something like that before the main card. Yeah, that's that looks about right. We saw three before the okay, so I started with uh Volkan Oezdemir versus uh Jimi Manuwa. I can't say any of these guys' names. That fight lasted that was the very first fight that was televised.",
            "start": 507.4
        },
        {
            "text": "Right. We saw three before the okay, so I started with uh Volkan Oezdemir versus uh Jimi Manuwa. I can't say any of these guys' names. That fight lasted awesome 42 seconds. So pretty much what happens is it's the first real match of the night. ****. They come out with their entrances. They come in. It's like ding ding ding, go man. Excuse me. Bam, done. And I'm like, holy ****, this is going to be awesome. And then the rest of the fights were like slow. So the next fight was I would disagree. Say the next and that's the thing. You if you watched it, I think you could have gotten a lot more because the other problem with UFC is like it's not like boxing. You have a cage in your way. So if you're far if you're really far away, you have to watch the big screen to see what the hell's going on. If you're not watching the big screen, you're just seeing two little dudes like kind of doing. You don't get the intricacies of it. The Robbie Lawler Donald Cerrone",
            "start": 546.8
        },
        {
            "text": "To see what the hell's going on. If you're not watching the big screen, you're just seeing two little dudes like kind of doing. You don't get the intricacies of it. The Robbie Lawler Donald Cerrone fight, which was the next fight, was a **** bloodbath. And if you didn't if you didn't if you couldn't feel the energy of that fight, like it went five rounds and it went to decision. Robbie Lawler won, but I thought it was a fight of the night. So the thing with that is like being in the room as it was happening, the whoever won, everyone's like, \"Are you **** kidding me? Like he did not win.\" I thought Cerrone should have taken that fight too. But Rob so back home, was it that clear as well? Um no, I I didn't like I I to me it was because I was like, I think I thought Cerrone should have won that fight. But I guess he he lost on strikes, man. Just we like unanimous decision. This guy won. Everyone around it was like that was one of the boo moments of the show. Cause the Cris Cyborg Tonya Evinger fight was awesome. Was",
            "start": 586.84
        },
        {
            "text": "He he lost on strikes, man. Just we like unanimous decision. This guy won. Everyone around it was like that was one of the boo moments of the show. Cause the Cris Cyborg Tonya Evinger fight was awesome. Was it awesome or is it just proof that there's no match for that one? There's no match for Cris Cyborg. But that's what everyone wanted and that's what they got. Everyone wanted for to pat you guys up. Cris Cyborg, I forget where she comes from, but they've she's fighting at 145, but she really probably walks around around 160. And she no one can beat her. And they're trying to they're have they have a little bit of a a problem in the yeah, well, they have a problem in the women's league is that it's still coming up and they're still adding talent to it. And so when you have the superstar like Cris Cyborg, you don't like you have to sort of get people to fight her. To be clear, she changed her name to Cyborg. Yeah, okay, yeah. But like she goes by Cris Cyborg. Like and dude, seeing her, it's like, did she come",
            "start": 621.16
        },
        {
            "text": "You don't like you have to sort of get people to fight her. To be clear, she changed her name to Cyborg. Yeah, okay, yeah. But like she goes by Cris Cyborg. Like and dude, seeing her, it's like, did she come out of the Terminator too? She changed her name to Cyborg. No, no, no, no. I forgot she's from, but she comes out to she's Brazilian, I'm sure. But she's very Brazilian then like that's her whole. What is her real name? Like a robot. But yeah, she came out and then uh there was this this other woman and they built it up like they showed the whole like hype trailer of like what this match means. And I'm like, all right, cool, let's go. And then the fight starts and it's just like, oh, that other woman is ****. There was yeah, I follow a guy named Brendan Schaub, uh who is he does a podcast called Fighter and the Kid. But he's an ex-fighter and he does a lot of commentary. And he was like, \"Am I the only person that feels really bad for Tonya Evinger right now? Like scared for her because Cyborg if you look at the\"",
            "start": 659.32
        },
        {
            "text": "But he's an ex-fighter and he does a lot of commentary. And he was like, \"Am I the only person that feels really bad for Tonya Evinger right now? Like scared for her because Cyborg if you look at the difference between show me a photo of Cris Cyborg.\" Oh my God, it's fantastic. But like seeing them fight, like the other woman, like Cris Cyborg is **** like destroying Jesus. Oh wow, she is. She's an action figure. No, she is. She looks like Mrs. G from she took that fight on short notice too. I think Tonya Evinger actually stepped in to take that fight. I don't think I don't know how long she had for that. So that was the other thing. Tonya Evinger uh her nickname because you of course they all have the the nicknames, right? Hers was Tonya Triple Threat. So that's Tonya Evinger. Yeah, so you see a lot big difference in their body types. Um obviously Cris I mean Cris Cyborg just looks like she could **** bench press a car for Christ's sake. Is that right though, the Triple Threat? What do you mean? I'm sorry, I say that.",
            "start": 699.0
        },
        {
            "text": "Body types. Um obviously Cris I mean Cris Cyborg just looks like she could **** bench press a car for Christ's sake. Is that right though, the Triple Threat? What do you mean? I'm sorry, I say that again. The Triple Threat. I don't know. I I don't know. Triple Threat. Sure. So I got super excited thinking we're about to see three people fight at once in the **** ring. And I'm like, is that I was like, is that a thing in UFC? What the ****? And awesome. Can you imagine that? Beu. I got super hyped. And then instead I just got to see Cris Cyborg almost kill this woman. Yeah, she almost killed her. It was it was exciting, really. I mean, dude, no, really. Like she looked so scared with every she's just like and like you see her mouth guard like she was just biting on like, \"I'm just going to take this hit and I just hope it doesn't actually kill me.\" Did she did well, she held she held her own. Um but yeah, I think Cris Cyborg just was able. I have a question for you. Yes. So you're a fan of wrestling? I am. I'm",
            "start": 744.48
        },
        {
            "text": "And I just hope it doesn't actually kill me. Did she did well, she held she held her own. Um but yeah, I think Cris Cyborg just was able. I have a question for you. Yes. So you're a fan of wrestling? I am. I'm about to say something so offensive here. Did you found the spectacle and the the of of wrestling far more entertaining than you did UFC? But did it not did the whole risk factor of the fact that these people were literally beating the crap out of each other and that it wasn't as I want to say staged, but the other one the other one is a sport like it's a real real deal thing that not heighten did that not heighten it knowing that they were really that's the thing. It's it's weird to me because I mean all this pro to me is I'm not into fighting. I don't like it. It's this is way too brutal for me. I just don't I'm do not enjoy it at all. Wrestling that's what I like. The wrestling is my least favorite part about wrestling. So I like I could I could totally do without any of that. You love the story.",
            "start": 782.96
        },
        {
            "text": "Just don't I'm do not enjoy it at all. Wrestling that's what I like. The wrestling is my least favorite part about wrestling. So I like I could I could totally do without any of that. You love the story. Yeah, just just and also it's like it's not like I'm the biggest wrestling fan in the world. It's more like I enjoy what it is. Like I am in it for the spectacle. Watching these fights was interesting because it was more like, all right, I don't know any of the backstory. I'm trying to get it from my friends who are are all super hyped. They all bet thousands of dollars on this. So they're super into it. So that was cool where I'm like, we don't know what's going to happen. This isn't Triple H versus The Undertaker where it's like and that's the thing. Lot people in chat are talking about this. Uh first off, Tonya went up from 135 to 145, which is a big big a big weight increase to be able to fight at that level. You know, it's hard to do that. Um but she did at first. I I saw her and I saw Cris Cyborg and I",
            "start": 829.68
        },
        {
            "text": "Tonya went up from 135 to 145, which is a big big a big weight increase to be able to fight at that level. You know, it's hard to do that. Um but she did at first. I I saw her and I saw Cris Cyborg and I was like, there's no way Tonya Evinger is going to get the **** kicked out of her in the first round. Show me some video of it. Show me some video. It's going to be hard to find video. Okay, I'd have to I'd have to I don't know. It's it's UFC so they have to WWE rights and stuff. But I can find. But anyway, she held her own for the first couple rounds. Like she she did she she I mean the first few people were like, oh God, she's going to get destroyed. But she was she stood up against her and did and did fairly well. Yeah, I mean, but my thing is within about 30 seconds, it was clear to me that she should tap. Just just say, \"I'm done. This was a bad idea.\" She did. What was the next round? Next uh next round after that was uh Greg just went off it. But it was I thought you might be able to remember. Sorry. Uh Demian Maia.",
            "start": 865.12
        },
        {
            "text": "Just say, \"I'm done. This was a bad idea.\" She did. What was the next round? Next uh next round after that was uh Greg just went off it. But it was I thought you might be able to remember. Sorry. Uh Demian Maia versus Tyron Woodley, I believe, was the next one. And that was the one that went five rounds and was there you going to show us Cris highlights of this mugging? I mean, look at her. Look at how scared she looks. She's just like, \"Stop. Just please.\" But she's I mean, her bells. Yeah, it's you know, oh, I hate that one. But I mean, again, the the the guts it takes to step in with someone. Yeah, no one taking away from bigger than you. She could beat the **** out of me. This Tonya woman, crap out of all of us. Um so the next fight was Tyron Woodley and um too nice and Demian Maia. And Tyron Woodley has been champ for a while. He's one of those guys that's very very much like Floyd Mayweather, very strategic, puts on very boring fights and wins. And he's he's you know, he won. He beat uh Demian Maia with a unanimous decision. And Demian",
            "start": 901.32
        },
        {
            "text": "Of those guys that's very very much like Floyd Mayweather, very strategic, puts on very boring fights and wins. And he's he's you know, he won. He beat uh Demian Maia with a unanimous decision. And Demian Maia it was just it was a boring fight. It was it was five rounds. Conor McGregor probably it's going to be boring as hell. He's just going to he's just out boxing unless Conor **** knocks his block off. I don't think he but I don't think Floyd will even let him touch. It's going to be anyway. I just think he's going to be super defensive. You're right. A lot of people would agree with you. It's going to be a big let down unless you're Conor McGregor, in which case he thinks he's going to knock him out in the fourth round. That's what Conor said. Conor reckon. Conor said, \"I about who the **** is this guy?\" I can't do it either. ****. I Irish accent. Do it. No, no. Oh, racist. Sorry. Racist. I'm sorry. He's Irish though. What do you want? No, he talks. God bless Conor. Conor is one of those guys that is just so",
            "start": 946.08
        },
        {
            "text": "Good at the promotion game. Oh, he's fantastic. Like he's a guy that you love to hate. He's a guy that gets in the the head of his opponent and he sells **** tickets, man. He sells he sells pay-per-views. He is he has said said such crazy **** to to **** Floyd Mayweather. Didn't he wear a jersey? He wear no, he wore a suit that was pinstriped. No, no, no. He wore a Golden State jersey. Did he? And it had a player's number. And I don't know if this is true, but apparently the player who he was wearing, Draymond, slept with Floyd Mayweather's wife. Oh, and he's bowling around in the guy's **** jersey. Dude, he wore a suit. Psychological. He wore a suit to one of the press conferences that everyone thought was a pinstripe suit. And then someone zoomed in on it and the pinstripe it wasn't it wasn't wasn't a fine line.",
            "start": 986.08
        },
        {
            "text": "suit psychological he wore a suit to one of the press conferences that everyone thought was a pinstripe suit and then someone zoomed in on it and the pinstripe it wasn't it wasn't wasn't a fine line it was just the tiny words fuck you and it just was all over it's fuck you fuck you fuck you fuck then he starts talking shit about Floyd's mother and he's like I'm going to kick your little tiny he's like I don't care about you with your tiny head and your tiny hands and your tiny little body like what does that mean like he's not like it's so fucked up but he gets in your head but see that's my thing is so much of this I mean we talk about wrestling it's like I feel like so much of this is fake as hell when I see them go up against each other and interviews and stuff this is all set up there's so much money being put into this and it bothers me that they're not admitting it there is no there is to a degree there are some love there's no love lost between some fighters some fighters",
            "start": 1039.92
        },
        {
            "text": "there's so much money being put into this and it bothers me that they're not admitting it there is no there is to a degree there are some love there's no love lost between some fighters some fighters legitimately don't like each other like I don't I don't disagree with the fact that I don't think Jon Jones and Daniel Cormier get along all that well but having said that it's the same every time a lot of shit's talked because you gotta you got to have the rivalry and then afterward what did Jon Jones Jon Jones do he was literally like Daniel Cormier is awesome I aspire to be more like this guy this guy's a real champion I have my I'm still fighting my demons which is how he really feels did did Muhammad Ali pioneer that style of promotion you know the build up where where chased after Frazier and for cuz Joe Frazier and him did not like each other that was not a publicity stunt I supposedly he would like call his house at night like fuck with him like he was just call I'm gonna beat",
            "start": 1074.76
        },
        {
            "text": "and for cuz Joe Frazier and him did not like each other that was not a publicity stunt I supposedly he would like call his house at night like fuck with him like he was just call I'm gonna beat you I'm gonna beat he's like stop calling my fuck house well in a more sinister way Joe Frazier felt bullied and hated the way he that the Muhammad Ali had turned the community against him and felt like his kids were being picked like that was a real shit like like Muhammad Ali went for him and in some ways I guess from the prof like the Thriller in Manila and The Rumble in the Jungle is that right you like is that what everyone's trying to emulate now that kind of rivalry that kind of what but the problem is not a lot of fighters can do it right like Conor is the best at it by far Jon Jones Daniel Cormier they had they had a good back and forth it was it was it was a good try but like UFC Conor and then UFC Conor versus Nate Diaz and that was that was the big that's the big rival right now",
            "start": 1108.56
        },
        {
            "text": "Daniel Cormier they had they had a good back and forth it was it was it was a good try but like UFC Conor and then UFC Conor versus Nate Diaz and that was that's the big rival right now he has and Nate Diaz is like he's one of those guys that like doesn't give a shit and those that's when they started throwing shit at each other and he started talking mad shit and they started getting fined and it was like in this the video for Cormier versus Jones like the way that they got in each other's face and start like punch each get pulled apart it's like I don't know man shit said that like where Jones was like you're not a real champion and you know and he was like it's fucked up but it's true cuz he's like you're not the real champ you got my belt you never beat me for that belt and when I beat you you're going to spend the rest of your life thinking about that you're going to spend the rest of your life fucking knowing that you couldn't beat me and it happened and that's",
            "start": 1150.8
        },
        {
            "text": "and when I beat you you're going to spend the rest of your life thinking about that you're going to spend the rest of your life fucking knowing that you couldn't beat me and it happened and that's just going to be the case head ourselves going back to the fight you were talking about there was the Tyron Woodley Demian Maia Demian Maia is an excellent jiu-jitsu practitioner and was constantly trying to get him to the ground and that's what's interesting is when this match was first being introduced and they set it up and these two dudes came out for the first time in the night I was like I am enthralled by this this is awesome they set up the story perfectly where one of the dudes Brazilian Jiu-Jitsu guy if he gets you to the floor you're fucking done he finishes usually finishes by submission if he gets you in a in a good fucking flurry you're fucking done and I'm like oh man this is straight up Street Fighter this is straight up you know this guy has these pros and cons this guy has these",
            "start": 1189.96
        },
        {
            "text": "if he gets you in a in a good fucking flurry you're fucking done and I'm like oh man this is straight up Street Fighter this is straight up you know this guy has these pros and cons this guy has these pros and cons based on let's go I can understand this the story just based on watching them fight right then uh it starts and first off Tyron Woodley Tyron Tyron Woodley Kevin can you look up Tyron Woodley to show these people what this this man is you talk about action figures this man superhero this the guy who's ground Demian Maia has more of the traditional jiu-jitsu body where he does he's like a little lengthier he's very skinny he's not he's not this guy by any chance to that's oh is he the guy from Hound who I called out no that's Alistair Overeem you take this guy you take left left left oh my God the middle one in the top row the green one that one yeah yeah like just look at his arm he really he looks like someone carved him out of like plastic or steel so seeing him get in the ring I was",
            "start": 1225.08
        },
        {
            "text": "the middle one in the top row the green one that one yeah yeah like just look at his arm he really he looks like someone carved him out of like plastic or steel so seeing him get in the ring I was like oh awesome it's spelled um Maia so then they start and like again I don't know any of this stuff I just know that they told me this so as I'm seeing them fight within the first round you see anytime that the other dude gets the him almost down he like he's like fuck this it like runs away right and it was like oh man they're serious about what they're saying and when the like the same shit with him when he would start punching the other the other guy would just like dip out but then it turned in to 15 minutes it felt like at least 25 minutes was it really 25 minutes dude it wasn't even a dance they would like look at each other and like run away and it was like watching two people played in Smash Bros. and both are Marth and they just keep trying to counter each other and it was so",
            "start": 1269.48
        },
        {
            "text": "a dance they would like look at each other and like run away and it was like watching two people played in Smash Bros. and both are Marth and they just keep trying to counter each other and it was so damn put in terms our audience can understand that's good so but what's important about it is this actually broke the record for least strikes in the history of UFC of a Welterweight Title Fight This broke the record for fewest I think strikes landed or no maybe it few strikes thrown thrown that's what it was and it's like I'm not exaggerating it was ridiculous so bad that Demian Maia Demian Maia was shooting in for the same takedown over and over again he shot in for 21 takedowns and all 21 of them were stuffed pretty much with relative not with ease but stuffed you could tell that he was like I'm just going to train specifically to stuff these takedowns it got so bad that at one point Demian the announcers were like are his knees bleeding from shooting cuz when you shoot him for a takedown you",
            "start": 1313.6
        },
        {
            "text": "just going to train specifically to stuff these takedowns it got so bad that at one point Demian the announcers were like are his knees bleeding from shooting cuz when you shoot him for a takedown you shoot a knee first so you scoop it up and grab double leg takedowns and he kept doing that but Tyron Woodley at one point just took all of his fucking weight and just put it on the back of Demian Maia's neck and just pushed down pushed his face into the ground and then escaped over and over again to the point where his knees were bloody and it was like you would think that sounds exciting but it was the most boring and the crowd start you can hear at home the crowd starts to boo so the dude the crowd slowly like round one it was Boo round two this is boring and I'm like oh yeah let's go WWE shit I love this and then it was just like round three the glass broke Stone Cold comes out my felt like it round three like the crowd was not having it so much they started doing the wave and it was",
            "start": 1352.68
        },
        {
            "text": "I love this and then it was just like round three the glass broke Stone Cold comes out my felt like it round three like the crowd was not having it so much they started doing the wave and it was like it went around the the auditorium the arena went around again went around again and then started getting like where they would chant boring with the wave so everyone would jump up and go boring and it was just like go and it didn't stop it just kept fucking going and I have videos Kevin I'm going to send you one of these but like they just be yelling at them they started putting up all their lights their phone lights and everyone just fucking making a scene they're screaming boring Dana White came out chairs it was a bad fight but the problem is that's how you win fights and that's how you stay on top right you don't win fights by getting in there and smash and letting someone smash your face in until you knock them out that's a bad that's a bad way you win fights but the same way Georges St-Pierre",
            "start": 1388.68
        },
        {
            "text": "on top right you don't win fights by getting in there and smash and letting someone smash your face in until you knock them out that's a bad that's a bad way you win fights but the same way Georges St-Pierre won fights which is you look at your your team looks at the opponent and goes what is he strong at okay Demian Maia is really good at takedowns and or really good at submissions from the ground okay so if we neutralize that if I just don't get taken down do I have a better chance of winning cool so that's what you're that's what you train for and that's why it was most interesting to me because they set that up and then once it started I was like this is so interesting that they are they're really sticking to that and it's obvious that they trained against this and ready and prepared but I'm like that's where the WWE fakeness comes in where I'm like they would have told that story in a way that wasn't boring as all hopefully but see the the problem is like the other problem is like",
            "start": 1435.88
        },
        {
            "text": "I'm like that's where the WWE fakeness comes in where I'm like they would have told that story in a way that wasn't boring as all hopefully but see the the problem is like the other problem is like that that was an interesting stylistic match the other stylistic match that I thought was better was Robbie Lawler versus Donald Cerrone which is one you thought was boring as well to me that was two fighters that were standing up and just wanted to fucking kick the shit out of each other and that's what they did I I didn't think that one was boring my problem with that was that I I thought it was fucked that the guy won one oh I see okay it was that's a match up of two really good strikers and you just let's see what happens like put put two strikers in the row and see what happens that's what I like the UFC though like is that is if Tyron Woodley had been a little bit more aggressive that fight could have been really dynamic but what happened was after that first round he he realized he won",
            "start": 1469.48
        },
        {
            "text": "like the UFC though like is that is if Tyron Woodley had been a little bit more aggressive that fight could have been really dynamic but what happened was after that first round he he realized he won the round with very little strikes very few strikes and and his corner was like keep doing it just if you do that four more times you win this fight and you walk away unscathed and you could probably fight again tomorrow if you wanted to commission would allow so clear to everyone so then when he won he was like holding up the the belt and like it was just you couldn't even hear him talk like when the when Joe Rogan came up was interviewing him all you heard was like goddamn Savage it was Savage so what about the main event did that the main event was so interesting like I was completely nervous when it started when they started fighting cuz I was fucking nervous oh no for Daniel Cormier really yeah I was actually more nervous for Jon excuse me not DC because there's because it's it's",
            "start": 1504.16
        },
        {
            "text": "when it started when they started fighting cuz I was fucking nervous oh no for Daniel Cormier really yeah I was actually more nervous for Jon excuse me not DC because there's because it's it's an interesting dynamic Daniel Cormier is one like a standup guy he is the champion that when you if you write a champion into a movie he's the guy you write right like good he is he's a good guy family guy never talk like doesn't like talking shit about his opponents they like you can tell they're making him do this stuff like he's held the belt he's defended the belt he's had a lot of good fights right he fought Anderson Silva recently when Jon was supposed to fight him but Jon got popped for steroids Anderson Silva came in they had a great fight but he didn't like overwhelm him he showed a lot of respect to his opponent and like showed a lot of respect to the sport then you've got Jon Jones who is just this phenomenally talented human being that won the youngest ever light heavyweight",
            "start": 1546.88
        },
        {
            "text": "a lot of respect to his opponent and like showed a lot of respect to the sport then you've got Jon Jones who is just this phenomenally talented human being that won the youngest ever light heavyweight title to a winner to win the title just did shit he's like the kind of guy that like watched the YouTube video about Bruce Lee and then can all a sudden fucking do a spinning back kick and do it and really do it and like actually knock someone out with it so you you look at him and you're like this is a guy that like is probably pound-for-pound one of the best fighters ever to live and then he does something where he's like high and crashes his Bentley into a a woman who's pregnant a a car who a woman a pregnant woman is driving it and then he goes I don't want to be here and runs away from it and you're like ah Jon you can't do that so Cormier is the the champion that we want or that we deserve and need but but Jon's the one we want right Jon we want to win because we want to see that",
            "start": 1586.0
        },
        {
            "text": "and you're like ah Jon you can't do that so Cormier is the the champion that we want or that we deserve and need but but Jon's the one we want right Jon we want to win because we want to see that guy who's the best ever like we want to be able to like I watched Jon Jones fight he's the greatest ever he's never been beaten he has been beaten but but like all intents and purposes he's unbeatable and then these two come together and you're emotionally because you've got Daniel Cormier is the nice guy and you want to believe nice guys win but you secretly just want to watch Jon fuck him up and you don't know why and so when those two came together I was like oh my God I almost wanted to like bow to each other and walk away I don't even want to see them fight like this there is no champion good night that's so funny cuz I from not knowing any of it and just watching it like fuck Daniel Cormier he was an asshole the whole time so they're fighting they're having a great fight and it was",
            "start": 1626.64
        },
        {
            "text": "good night that's so funny cuz I from not knowing any of it and just watching it like fuck Daniel Cormier he was an asshole the whole time so they're fighting they're having a great fight and it was really even at some point it started looking like uh Daniel Cormier was who was Nick's good guy uh was decidedly winning and then he started getting really cocky and like you'd see it where the other guy would punch him in the face and he'd look at him and like go like that and he punched him again he like and he just kept doing that and it was like all right this is kind of awesome but it was such heel shit like it was such He's the bad guy right now and then eventually he got way too cocky with it the other guy takes him down one of the most brutal things I've ever seen anyone do to another human being in my life dude fucking kicks him the guy like you could see it he had a moment of like oh shit he was out cold and the other guy was like I'm taking advantage of this shit went and just",
            "start": 1664.16
        },
        {
            "text": "human being in my life dude fucking kicks him the guy like you could see it he had a moment of like oh shit he was out cold and the other guy was like I'm taking advantage of this shit went and just started knocking him into the fucking fence he fell down and then he just like was trampling the dude's head in his hand, but like was hammer fisting his head why did the ref stop it well that's that and a lot of people are like he should have stopped it a little earlier the thing is on on a fight that on a fight that important you don't want to have there be any doubt that the guy could have defended himself so had Daniel Cormier being able to like it's mostly it's weird to say but it's actually kind of for Daniel because the the the ruling is if you can't defend yourself if the ref thinks at any time you you can't put up an adequate defense he stops the fight right that's how it goes has a technical knockout right there but there have been times when people have been in worse spots than that",
            "start": 1704.56
        },
        {
            "text": "time you you can't put up an adequate defense he stops the fight right that's how it goes has a technical knockout right there but there have been times when people have been in worse spots than that where they regain their senses and boom they clinch up and they just need a couple seconds and they get back to their feet and they're ready to rock and roll and so you it's it's one of those weird like I think he should have stopped it about three seconds before he did but I'm also not a judge or a ref like three seconds too late what's it yeah I think I prefer getting my money's worth I mean that's thing three minutes too late I don't know but like but Jon but that's a perfect example of Jon right like the whole the first two rounds really getting his getting a sense of like the range getting a sense of where his kicks were landing and then what did he do he was kicking the leg kicking the leg kicking the leg head kick kicking the leg kicking the leg kicking the leg fakes a kick to",
            "start": 1744.2
        },
        {
            "text": "a sense of where his kicks were landing and then what did he do he was kicking the leg kicking the leg kicking the leg head kick kicking the leg kicking the leg kicking the leg fakes a kick to the leg Daniel Cormier goes to block it fucking head kick that rings his bell harder than anyone's bell I've seen it a long time then he did something very interesting right cuz most fighters would go he's wrong and they they they freak out and they start just like bombing punches Jon didn't do that Jon went like he did a little footwork first to see if he was really wrong right well that footwork tripped the other dude up didn't trip him he he did footwork realized he was stunned like stunned faked a punch and then kicked his fucking heel as hard as possible it spun him around and then he followed up with a fucking flying knee to the chest that like put him right against the cage down and then just hammer fist it sounds really cool describes it that's dude that moment was fucking awesome it was that fight",
            "start": 1781.04
        },
        {
            "text": "fucking flying knee to the chest that like put him right against the cage down and then just hammer fist it sounds really cool describes it that's dude that moment was fucking awesome it was that fight totally but then after the fight they're announcing the winner and doing the whole thing and then the fucking Daniel Cormier the loser like is trying to get up and he's still trying to fight the guy which that was the thing is like I think he was so knocked out that like he didn't even understand that it was over he didn't know it's over he was still trying to fucking fight him even though there's like 10 people holding him back and I was like all right cool that's aggressive and then he goes like they're about to announce the winner like hey come over here and do the thing and he like shoves the ref's hand away and walks off I was like he was it was very emotional for one um because you have to understand this has been like a two-year buildup to this fight and he should have fought him a long time",
            "start": 1818.08
        },
        {
            "text": "hand away and walks off I was like he was it was very emotional for one um because you have to understand this has been like a two-year buildup to this fight and he should have fought him a long time ago and just Jon just kept pulling out for different reasons like he kept getting disqualified or suspended or popped for steroids so there's a lot of emotion built into this um one guys don't champ do that. Yeah sure but two they should not when a guy's knocked out that badly put him on camera oh my God it was horrible and now and now this fucking thing is is a fucking meme and that pisses me off because he should should not like and Rogan didn't want to do it you can tell like no because he said specifically on his podcast I what is I you're I didn't see this I don't know you're talking Jon Jones they interviewed the person who won generally but if the person gets knocked out as a general rule and Rogan's talked about this a lot on his podcast he does not like interviewing the guy that just",
            "start": 1853.08
        },
        {
            "text": "they interviewed the person who won generally but if the person gets knocked out as a general rule and Rogan's talked about this a lot on his podcast he does not like interviewing the guy that just got knocked out because you just got knocked out you're not all there you don't know what's going he's like most more often than not people think they're still fighting they don't know what the fuck's going on they shit their pants yeah they just they just lost they do they literally do yes wow your body your body does that sometimes and so he was like he said it when he started interviewing DC he's like I really don't like doing this but I want to give you an opportunity to like talk about this and no dude really no seriously he was like he was so knocked out he and he just started bawling and tears and it was like really really fucking bad but it's like I don't know I don't buy that at all that's some Joe Rogan showmanship shit because he fucking went in there so he's gotten in trouble",
            "start": 1894.56
        },
        {
            "text": "tears and it was like really really fucking bad but it's like I don't know I don't buy that at all that's some Joe Rogan showmanship shit because he fucking went in there so he's gotten in trouble before about that like he's he's actually stated a lot because I think it was I forget it was uh I forget who it was but he interviewed someone and the guy was like no I totally won that fight the guy tapped I swear to God and Joe's like I don't think he did man the guy's like no he fucking tapped I know he tapped and he goes okay let's bring up the footage and in front of everyone like basically humiliated the guy because the guy I forget which fighter it was but he was was there for that one it was I was there for and he he just was he doesn't fucking know like when you get knocked out you might lose the last like 5 minutes of your life you don't know what happened and so and now as a general rule they won't they won't do it if the person gets knocked out like they'll just just interview the",
            "start": 1931.6
        },
        {
            "text": "lose the last like 5 minutes of your life you don't know what happened and so and now as a general rule they won't they won't do it if the person gets knocked out like they'll just just interview the person who wins but this was such a big fight that I think they probably made him yeah he hasn't talked about it yet I haven't listened to would you go again no God knows uh but shout out to Joe Rogan though like the through line that the show needed him doing the the post or post round or post match whatever the fuck interviews was like super helpful and I thought really move things along and I love that he just is Joe Rogan like he is such his own character where uh even during the boring match I thought he was going to be like a professional about it and like act like oh you guys were just beast in the ring or whatever he's like hey so everyone's booing you how's that feel no I mean he get Joe's also at a point where I think he's almost done like he's he's talked a lot about maybe",
            "start": 1970.6
        },
        {
            "text": "just beast in the ring or whatever he's like hey so everyone's booing you how's that feel no I mean Joe's also at a point where I think he's almost done like he's he's talked a lot about maybe retiring from that and he's basically he's pulled out a lot from a lot of the events like he used to do all the worldwide events and he doesn't do those anymore I think they're training Dominick Cruz to come up and and help maybe not Dominick Cruz but I forget the other guy they're losing announcers basically but I think he's he's at the tail end of his career as an announcer for UFC he's also a comedian that talks about right crazy **** so every once in a while he'll slide something in there like he got in trouble the first time he ever did it for like talking about one of the chokes in a really bad way I don't want to go into that but um yeah shout out to Joe Rogan click here to subscribe click here to watch a playlist of other episodes click over here",
            "start": 2006.88
        },
        {
            "text": "one of the chokes in a really bad way I don't want to go into that but um yeah shout out to Joe Rogan click here to subscribe click here to watch a playlist of other episodes click over here to go to the Patreon for Kinda Funny and click over there to go to Kinda Funny Games all sorts of stuff to click on click on this you'll go to pound town",
            "start": 2037.44
        }
    ]
}