{
  "id": 2949,
  "video_id": "cJBIPkgIXM4",
  "show_name": "Kinda Funny Games Daily",
  "hosts": ["Greg Miller", "Andrea Rene"],
  "title": "Telltale Game of Thrones Sequel: Don't Hold Your Breath - Kinda Funny Games Daily 08.30.17",
  "description": "Greg and Andrea don't care how Telltale dances around it -- they don't think there will be a Season 2 of Game of Thrones.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1504126495,
  "duration": 3670,
  "transcript_chunks": [
    {
      "text": "What's up everybody, welcome to Kinda Funny Games Daily for Wednesday, August 30th. I'm one of your hosts, Greg Miller, alongside the busiest lady in the business, Andrea Rene. What's up, Greg? I should have told you, I should have saved it before the show went live. I complimented this dress, I love this dress. Thank you, audio listener, she looks like Darth Vader. That's what's going on. Yes, I bought this at Disneyland during D23, not this year, but two years ago. Yes, and I saw it in my closet this morning, was like, you know what, that dress does not get enough air time. How is it, D23? I've never gone to that convention. It's really fun. Yeah, it's um, it's much different than like PAX, for example, or Comic-Con, because the scope of it is much smaller. One of the really interesting parts about D23 is that you get to see what the parks have in store. They have like booth space where they do mock-ups, exactly. So when I was there, they were talking about all the mock-ups for Disney Shanghai, I believe it, it was",
      "start": 1.7
    },
    {
      "text": "get to see what the parks have in store. They have like booth space where they do mock-ups, exactly. So when I was there, they were talking about all the mock-ups for Disney Shanghai, I believe it, it was. And so it was really neat to see how a high noon that was. It was really cool. And then back then, that's when Disney had a bunch of video game stuff, sure, really pertinent to Disney Infinity. Obviously sad Disney Infinity is no longer with us, but this year they talked about obviously Kingdom Hearts and the Marvel Powers United VR, I think that's the name of that game, and some other stuff. But yeah, Darth Vader dress, what's good? Have you back? I've missed you. I know it's about a whole week. I know I don't like it one bit. Like I look over there sometimes, it's Danny got Ashley a little green hat, he's grant me wishes. It sucks. Gentlemen, this is Kinda Funny Games Daily. Each and every weekday we jump into the nerdy video game news you need to know about. We give you opinions, perspective, we have a good",
      "start": 57.08
    },
    {
      "text": "me wishes. It sucks. Gentlemen, this is Kinda Funny Games Daily. Each and every weekday we jump into the nerdy video game news you need to know about. We give you opinions, perspective, we have a good time. We answer your questions, weird your bad PSN names. Basically, we do anything you want us to do that you tell us to do over at KindaFunny.com/KFGD. If you like that, you can watch as we record it on Twitch.tv/KindaFunnyGames, but we don't look at the chat. The only way to interact is to go to kindafunny.com/yourewrong. Correct us on the things we screw up during the show so at the end of the show we can set the record straight so that when it gets to YouTube.com/KindaFunnyGames and podcast services around the globe each and every day it's correct and everybody has a good time. Housekeeping for you, you mentioned it, PAX, right on the corner. You leave tomorrow, tomorrow morning. We then Friday, your host in the Life is Strange panel at 1:00, correct? At night,",
      "start": 109.04
    },
    {
      "text": "has a good time. Housekeeping for you, you mentioned it, PAX, right on the corner. You leave tomorrow, tomorrow morning. We then Friday, your host in the Life is Strange panel at 1:00, correct? At night, you're doing the What's Good Games/Life is Strange launch party panel or a party, not Pam, correct? Saturday at 5 o'clock, there's the What's Good Games panel, correct? Saturday at 8:30 is my Batman crowd play with Telltale. Yeah, woo! Sunday, thank you. Sunday at noon, I'm doing a Rooster Teeth signing over the Rooster Teeth booth. You can come get my autograph, maybe I'll write it on your face or even for a limited time for the first 5 people who ask, I'll forge Kevin's signature, forge it for him. So yeah, it's a, I've seen it, it's just a giant circle. Yeah, did it Sunday at 5 o'clock, Smite Cancer panel. Come watch me cry. Oh, I'm a dog dude, putting together the presentation now, great. Tonight I was having a few beers and I was reading emails I hadn't read in five years. Yeah, I'm gonna cry on that panel and",
      "start": 147.52
    },
    {
      "text": "watch me cry. Oh, I'm a dog dude, putting together the presentation now, great. Tonight I was having a few beers and I was reading emails I hadn't read in five years. Yeah, I'm gonna cry on that panel. And then also Party Mode is up right now on YouTube.com/KindaFunnyGames. Go check that out. It's a really, really funny one with Driveclub VR. Does Andy get sick in it? He does. For now, let's begin the show with what is and forever will be the Roper Report. There are five notes, three items on the Roper Report. Three was definitely a baker's dozen. Number one, now I'm violating rules of the show you and I have established. Okay, but I'll, we're gonna get to the newsy part of it. PlayStation Plus has revealed a lineup of the free games for September. You know as well as I, sure, and this should go down in Deals with the Day. However, the first crack in the dam has formed. All right, so what you're getting on your PlayStation Plus lineup for September is Infamous Second Son on PlayStation 4, Strike Vector EX or",
      "start": 193.78
    },
    {
      "text": "with the Day. However, the first crack in the dam has formed. All right, so what you're getting on your PlayStation Plus lineup for September is Infamous Second Son on PlayStation 4, Strike Vector EX, or Strike Vector EX PS4, Master J in Battlegrounds PS3, Hustle Kings PS3, Hue on PlayStation Vita, which is cross-buy with PlayStation 4, and phenomenal. I really enjoyed that game. Do you play it? I did not. Well, it's over Christmas when I was up in March. This is what I was playing on the Vita. Had a great time. Then Skyforce Anniversary is coming to PlayStation Vita, cross-buy with PS4 and PS3. Then Dead by Daylight will be free September 15th through the 18th. You can get a discount afterwards. That's a small window. Yeah, I think it's just to get you and get you in there free, kid. And then the reminder is that Hue is available as a free download still through October 3rd. However, the news here that we've all been waiting for is this. I'm gonna quote right from the PlayStation Blog. Here's a bonus for",
      "start": 243.22
    },
    {
      "text": "PlayStation VR owners. PlayStation Plus members in the US and Canada will also get Rigs: Mechanized Combat League as a free bonus game from September 5th through November 7th. Rigs is a first-person arena based shooter developed from the ground up for PlayStation VR. Then it goes on to tell you more and more about it. What's exciting about this is we've been waiting and waiting and waiting, when will they add PlayStation VR games to the PlayStation Plus lineup? And here they are. I assume testing the waters. What does this mean? And many people have questions. Are you ready for them? I'm ready. First off, Jeremiah Jux wrote into KindaFunny.com about this and says, good morning, Greg and Andrea. Just saw the PS Plus lineup for September and I surprised, I was surprised to find Rigs is on there, a PSVR",
      "start": 292.78
    },
    {
      "text": "Jeremiah Jux wrote into KindaFunny.com about this and says, good morning, Greg and Andrea. Just saw the PS Plus lineup for September and I surprised, I was surprised to find Rigs is on there, a PSVR title. I was in the quote, 'PSVR equals dusty headset' end quote, question a few weeks ago, but boy does this announcement instill confidence in me. I think it's time to bust out my Swiffer and put my expensive hat back on for some Rigs. My question is, what other surprising or maybe not so surprising moves can we expect from Sony when it comes to PlayStation VR, especially for PSX 2017 coming up? This is a fascinating announcement, a fascinating move based on the fact that on Monday we talked about the new bundle for PlayStation VR, right? Price drop by them putting in the camera, price drop on the VR Worlds bundle they had been doing before, which for me was interesting, but also not alarming, but interesting in the fact that we've seen all the other VR headsets are coming down in price and what does that",
      "start": 336.7
    },
    {
      "text": "bundle they had been doing before, which for me was interesting, but also not alarming, but interesting in the fact that we've seen all the other VR headsets are coming down in price and what does that mean? Are people getting scared? They want to leave the market space? Are they worried about this? Do they still believe in VR? So on and so forth. Add to that at GameSpot Expo this week, and when we're up there, Asad was on the program, sat there with Tim and I, and I asked him point blank, what is going on with VR? Is VR dead? Do you guys still believe in it? Are we still doing thing? He said, no, we still very much believe in it. Went through a whole bunch of stuff they're doing, talked to us about how triple-A VR to them doesn't necessarily mean triple-A, a triple-A game you're going to get, a The Witcher 3, a Naughty Dog game. It means the fact that a Farpoint to them is a triple-A VR game in the way that a lot of time, a lot of work, it is a full-fledged experience. Something's going on there, but",
      "start": 381.37
    },
    {
      "text": "3, a Naughty Dog game. It means the fact that a Farpoint to them is a triple-A VR game in the way that a lot of time, a lot of work, it is a full-fledged experience. Something's going on there, but people like Moss and other games in there, you know what Supermassive is doing with The Impatient. These are other experiences there that show their commitment to it. And I was like, well, we're gonna see more of that. Do you have more things we don't know about? And he said, of course we do. I would venture to guess PSX is there. Andrea, what is your read right now on PlayStation VR? I think it's just getting started. They certainly invested a lot of money researching and developing that piece of hardware. It's sold pretty well. Yeah, and they have their Paris Games Week press conference as well, where we might see some PSVR announce. TGS, you guys just announced the TGS thing yesterday. And of course, you know, PSX is a great place to showcase PSVR exclusives. There's just too much money in VR for it to go",
      "start": 422.44
    },
    {
      "text": "some PSVR announce. TGS, you just announced the TGS thing yesterday. And of course, you know, PSX is a great place to showcase PSVR exclusives. There's just too much money in VR for it to go away. Yeah, it's not gonna go away. I think they probably are wrestling with ways to make it more approachable and accessible to people. Clearly a price drop, you know, helps make it more accessible, getting it into more people's hands. But not only that, it's not exactly the most user-friendly experience. There's a reason why I don't plug our headset in very much at home, because you have to like to set up the chair and then you have to get the, you know, Move controllers, you have to make sure the camera's in the right spot and they're not charged. Okay, yeah, so there's a lot of moving parts to it. And I think that if they can figure out a way to make that plug and play experience just a step or two easier, I think more people will play. The interesting thing for me is keeping the fanbase happy, you know,",
      "start": 466.03
    },
    {
      "text": "that if they can figure out a way to make that plug and play experience just a step or two easier, I think more people will play. The interesting thing for me is keeping the fanbase happy, you know, Jeremiah Jux's points out that he was a question from a couple weeks ago, like, oh man, I'm not using it. I've week after week been surprised we don't get more of those emails in the fact that I think people, and I know I've beaten this dead horse, but continue to beat it right now. Okay, good. The messaging that is PlayStation put out and then people like us talked about all the time of this is Gen 1, it's gonna go, we're gonna see where it goes, we're gonna build this together. It's not gonna come out and be a must-have. You have to understand this bowl on the fact that PlayStation again is talking about it is really helpful in the way that I think that was the alarming thing for me who's seen PlayStation Move and PlayStation Vita and things kind of fade away, right? Where they, it's out for a while, it is",
      "start": 513.1
    },
    {
      "text": "is really helpful in the way that I think that was the alarming thing for me who's seen PlayStation Move and PlayStation Vita and things kind of fade away, right? Where they, it's out for a while, it is the hot thing. It doesn't do great in launch or in terms of critical acclaim or also, I guess, you know, units moved for definitely both those things. The people back off of it, whereas with PlayStation VR, I loved the messaging going in. I loved Andrew House being like, we'd, I didn't expect, I told people to be, you know, conservative on this and clearly are too conservative. And I love the fact they are talking about it again. I do think that to Jeremiah Jux's point, like putting Rigs in there is going to get more people to play Rigs, especially if they passed on that. I pass them that I buy. Absolutely. I mean, look what it did for Rocket League, you know, like you make, you make a game free, it makes it an easy choice for people to try it out. And then once you get them hooked back on that experience again,",
      "start": 553.12
    },
    {
      "text": "mean, look what it did for Rocket League, you know, like you make, you make a game free, it makes it an easy choice for people to try it out. And then once you get them hooked back on that experience again, they're more likely to go and look at what else is available, what else is for sale in the PlayStation Store right now, or VR running down the line since the last time I plugged this in. What has changed in the store? What else? It's a way when I'll boot up the Switch and I haven't played in a week or whatever and I'm going on a flight, like, wait, what if I missed her in last two weeks? Whatever. I'm going out of my way to see. And I think that adding PlayStation VR titles to PlayStation Plus lineup is the way to do that in the same way to get those final dominoes to fall, right? I've seen stuff, reviewer, it looks cool, but I don't know. And then suddenly when it's like, well, I already have four games, five games is the months tick by. Well, now I have a reason to buy it. I have a library established. Mark",
      "start": 591.37
    },
    {
      "text": "it looks cool, but I don't know. And then suddenly when it's like, well, I already have four games, five games is the months tick by. Well, now I have a reason to buy it. I have a library established. Mark Freeman writes in on that vein. He says, hi, Greg and Andrea. With today's announcement that Rigs, the PlayStation VR title, is joining the line of lineup as a bonus game, do you think this is the beginning of the end for either Vita or PS3? If so, how long notice, how much notice will we get? I think it means personally, if PS3, personally, if PS3, think, I know Mark Freeman, he doesn't write like this. If personally, if PS3, think it's a great move to strengthen PSVR sales as now he, you know, I'm sorry, Mark, at all right, someone get to a doctor, it seems like you're having a stroke as you wrote the question. How much longer do you think? Because that's been the argument we've had, right? In the thought that they'll add PlayStation VR, but they'll also remove your Vita game, your PS3 games, something to that effect.",
      "start": 628.78
    },
    {
      "text": "much longer do you think? Because that's been the argument we've had, right? In the thought that they'll add PlayStation VR, but they'll also remove your Vita game, your PS3 games, something to that effect. They'll try to level it off that way rather than just continue to give you more free than they have to. I don't know if that's, oh no, I mean, it all comes down to for Sony, it comes down to a cost, right? So the PlayStation Plus games aren't free for Sony to give to you because they still have to pay the developers for those games, right? So I think it's all about whatever deals PlayStation is making with people that particular month. I don't think they necessarily need to take something off the table in order to put PSVR games in the bundle of games you get for free. I think it all just depends on what the game is, who the studio is, and what their overall, you know, business dealings are for the future. Sure. See, I think that Vita will be the next to fall. I think, I think they do take one away because it",
      "start": 676.87
    },
    {
      "text": "the game is, who the studio is, and what their overall, you know, business dealings are for the future. Sure. See, I think that Vita will be the next to fall. I think, I think they do take one away because it is still money out of their pocket. They have to pay these people for the giving away. And I think the problem is that when you remove Vita, that's literally like, all right, the Vita is dead. And I think as long as people are still putting out Vita games, which they are, you can't do that because it, why would I continue to support your platform if you're not supporting it? And granted, have to be something that's definitive. They can just take Vita games out for like a month or two and promote PSVR games. That headline will go, you know how social media go, that's it, they've turned. No, come on, calm down. It's fine. I don't know if you've met me. I don't get calm. I've eaten. What's interesting is they are doing this bonus game, right? That it's a bonus game for you. And this is, I wonder if they'll just do that",
      "start": 718.6
    },
    {
      "text": "fine. I don't know if you've met me. I don't get calm. I've eaten. What's interesting is they are doing this bonus game, right? That it's a bonus game for you. And this is, I wonder if they'll just do that from now on. But even that lacks the oomph, right? When it was September's line, I've got announced all the headlines word about it from the Second Son. And I even, I missed it in the first thing because I went right to the bullet points that they had. I was like, okay, cool, these games. And I read below, oh ****, they're adding Rigs to. I think it's interesting in a way that you have to figure out a way to balance it, but it'll be another good PSX announcement of, hey, we're also adding a, you know, VR game, one VR game a month or whatever. We just got to ask Shu what's happening with PSVR and PlayStation Plus. We gotta ask you a lot of things. Just don't ask me with how Sucker Punch's next game is, because it'll keep saying it's great. We will tell you what number two. Telltale got interviewed over at",
      "start": 758.76
    },
    {
      "text": "Plus, we gotta ask you a lot of things. Just don't ask me with how Sucker Punch's next game is, because it'll keep saying it's great. We will tell you what number two. Telltale got interviewed over at Eurogamer. Our friend, friend of the show, Job Stauffer got asked about Game of Thrones, the next Game of Thrones season. Eurogamer says, so The Wolf Among Us in the back half of next year, will that be alongside Game of Thrones? Job says, no. Now, long after the conclusion of the first season, we said, we said would be continuing and we had designs of the future of Telltale Games. Telltale's Game of Thrones right now that is on hold. We haven't announced it, which does not mean it's never coming back, but I think right now we're anxious to get back into The Wolf Among Us, Walking Dead, and Batman and see where things go in with the narrative of the Game of Thrones show before really come back to the table with something we're excited about. Eurogamer, right? Obviously next year's last season of Game of Thrones TV show, so you'll",
      "start": 798.16
    },
    {
      "text": "narrative of the Game of Thrones show before really come back to the table with something we're excited about. Eurogamer, right? Obviously next year's last season of Game of Thrones TV show, so you'll be keeping an eye on the, is that before making any decision? Job, right now we're backing, right now we're back into being huge Game of Thrones fans. So for us to say what will be the best follow up to that first season and when that is gonna happen is too soon to say. I don't think we'll ever get another Game of Thrones season for games. I don't think so either. And that's sad to me because that series had a lot of potential. Of all the license stuff that Telltale has been working on, I really enjoyed the writing in the storylines. It felt very true to the, you know, kind of intricate relationships that are set up in not only the series of Game of Thrones, but also in the books. And I thought the original characters that they created for that, it's set inside the the world of A Song of Ice and Fire was",
      "start": 840.31
    },
    {
      "text": "are set up in not only the series of Game of Thrones, but also in the books. And I thought the original characters that they created for that, it's set inside the the world of A Song of Ice and Fire was really great. I was really disappointed in the execution of that game. Yeah, which we've talked about on this show before. There's me more in depth about it though, because what I did is I, I'm not the biggest Game of Thrones fan, but I like Telltale. So I played episode 1 and I was like, all right, not for me. I'm just, this isn't where it's going. I mean, knowing what it was, but it was just what I, and then I, it feels like I never heard anyone really talk about it. Like I completed the season, I love Game of Thrones, I hated Game of Thrones. Here's why. I couldn't get through the fifth episode because of the jank. It was real bad. Okay, maybe if I was to go back and play it now and finish it now, it would be better. I don't know if they've patched it. Has been quite some time since that game came out. The biggest",
      "start": 887.28
    },
    {
      "text": "it was real bad. Okay, maybe if I was to go back and play it now and finish it now, it would be better. I don't know if they've patched it. Has been quite some time since that game came out. The biggest problem I had with that game was the art style because certain properties felt good in their art styles. The Wolf Among Us felt perfect in that art style. The Walking Dead felt great. Borderlands, they all really fit that same type of art style. Yeah, Game of Thrones just did not feel right, especially since they used the likenesses of some of the characters from the series. Gonna say, right? And they just looked a little weird. Yeah, because you know these characters from the real workers front from the series, which is clearly they can't afford them now, right? Like they're their paycheck is way too expensive. Oh, um, and so I think that is an issue as well is that these actors are like, well, we're not gonna do VO for this game unless you pay us X amount of money, which is the whole reason why they're having",
      "start": 926.8
    },
    {
      "text": "oh, um, and so I think that is an issue as well is that these actors are like, well, we're not gonna do VO for this game unless you pay us X amount of money, which is the whole reason why they're having a strike right now. And so the more importantly though, like the the backgrounds, the character design, the overall art direction, I just felt was a big miss. And I was incredibly disappointed to see a tentpole license like Game of Thrones kind of glossed over in that way. And I haven't gotten a chance to talk to Telltale about why they made the artistic choices that they did in Game of Thrones, but I would be interested to know like why they went with that, because there are some close-ups that are just plain ugly. I'm saying, why are you doing this? It looks like bad watercolor. And I'm just like, why, why did you do this? The story is so fantastically written in that game. They make you make some really gross choices, which is very Game of Thrones. Yeah, and like so few Telltale games recently have had",
      "start": 974.02
    },
    {
      "text": "choices that have a huge amount of weight behind them in my personal opinion. Like it's hard to really compare to the original season of The Walking Dead from Telltale, because those choices really felt like you were having to make life-and-death choices. And some of the newer stuff, you just, it's kind of like, oh, well, I side with this person or this person, but it's not like I have to kill this person or this person should have forever gone from your game. Yeah, and Game of Thrones had some really heavy choices like that. And so I was, I was disappointed. I wanted to like it more, but she let me down. Well, I don't think you'll ever get a second chance at it. So no, they won't. I, I really, no, I mean, I would be super shocked if they, if they made a season to do spoilers. Did it, do you know what the ending",
      "start": 1017.31
    },
    {
      "text": "well, I don't think you'll ever get a second chance at it. So no, they won't. I, I really, no, I mean, I would be super shocked if they, if they made a season to do spoilers. Did it, do you know what the ending was like? Was there a giant cliffhanger? Because that's what the Eurogamer interviewer kind of implies that like they left us all on that. I never finished. Yeah. Oh, I didn't know if you read the Wikipedia or something. I should, I should go back and figure out what happened. So I don't read. They put the different arcs or with the characters that are still standing at the end. But here it's all just, it's all just takes place in a forest reserve. A lot of it is in a forest. That's true. Number three, this is for our UK viewers. CEX, the second hand video game retailer, has been hacked. This is a GameSpot story. European retailer CEX has suffered a security breach with up to two million customers details at risk. The company says the data includes quote, some personal information such as first name, surname,",
      "start": 1062.66
    },
    {
      "text": "European retailer CEX has suffered a security breach with up to two million customers details at risk. The company says the data includes quote some personal information such as first name, surname, address, email address, and phone number, as well as encrypted data from expired credit and debit cards up to 2009. CEX says it is liaising with quote the relevant authorities including the police regarding the hack, which was carried out by an unauthorized third party. It's clear, I'm currently unclear precisely what data has been shared about specific customers, but the company is contacting up to two million people as a precaution. It also notes that no valid financial information has been lost as it stopped storing customers credit card and debit card details in 2009. The retailer claims no in-store customers should be affected, only online ones, and although passwords are not stored in plain text, customers are advised to create a new one as quote a third party could still determine the original",
      "start": 1103.56
    },
    {
      "text": "customers should be affected, only online ones, and although passwords are not stored in plain text, customers are advised to create a new one as quote a third party could still determine the original password and could attempt to use it across other unrelated services. Finally, the company states that if you do not receive an email containing recommended next steps, then your account is safe. Stupid hackers. Hackers are done. Heads-up though, I mean, you're technically really smart, but you're bad. Yeah, come on. Don't go after these people. They're second-hand video games. That's all they cared about. Andrea, yes, if I wanted to know what noon on second-hand video games were out in the digital mama graph shops, where would I go? You would go to the official list of upcoming software across each and every platform as listed by the Kinda Funny Games Daily show hosts each and every weekday. Do-do-do-do-do-do. Out today, Ys Seven PC, The Art of Fighting Anthology on PlayStation 4, exome or defense on Xbox",
      "start": 1146.01
    },
    {
      "text": "as listed by the Kinda Funny Games Daily show hosts each and every weekday. Do-do-do-do-do-do. Out today, Ys Seven PC, The Art of Fighting Anthology on PlayStation 4, exome or defense on Xbox One and PlayStation 4, The Metronomicon: Slay the Dance Floor on Xbox One, Surf World Series on Xbox One, AeternoBlade Xbox One, Feral Fury on Xbox One. And then Chase wrote in KindaFunny.com/KFGD, just like you can, and says, DC Universe Online, the new power comes out today, Water. Just something new I thought you might add. Thank you, Chase. I would not have known that one. The King of Fighters XIV Special Anniversary Edition is available digitally today, includes all the DLC. I'm Xbox One. No, it is on, we're getting the press release, PlayStation 4. I gotta get all the times and put up on Tuesday. Come on, King of Fighters, who you trying to be? Track, be something special out there Tuesday. Let's Play 60. We got a whole bunch of new dates from that Nindies event today. You watched it, right? I did.",
      "start": 1188.01
    },
    {
      "text": "Come on, King of Fighters, who you trying to be? Track, be something special out there Tuesday. Let's Play 60. We got a whole bunch of new dates from that Nindies event today. You watched it, right? I did watch it. What do you think? I thought that they showed some really cool games and they showed some, you know, franchises that we know coming with special editions to the Switch. Super Meat Boy Forever, which looks cool. And that's new though, right? It's a new. It's like the levels get harder once you beat them. So if you come back, you're gonna be grinding. And I saw punches and kicks and stuff like that. Yeah, I thought that looked good. They have another expansion for Shovel Knight, Shovel Knight: King of Cards. Yeah, more kids. I thought it looked cool. Yeah, a breakdancing begin, the one with the elephant Yono, right? No, no, no, the Celestial Elephants. He looks so cute. He doesn't break you. I know. And you could throw a fire with his trunk. Sure, just like all elephants. Yeah, Golf Story. That's the real one. Anyway, let me",
      "start": 1247.74
    },
    {
      "text": "no, no, no, the Celestial Elephants. He looks so cute. He doesn't break you. I know. And you could throw a fire with his trunk. Sure, just like all elephants. Yeah, Golf Story. That's the real one. Anyway, let me through these dates. You stop me if you want to talk about the game. Okay. Super Meat Boy Forever. They're all Switch games. And if they aren't, I'll tell you when we get down to it. Super Meat Boy Forever coming in 2018. Shovel Knight: King of Cards early 2018. Mom Hid My Game! later in 2017. Golf Story September 2017. Can't **** wait. Floor Kids Holiday 2017. That's a Nintendo first game. Wulverblade September 2017. That's another Nintendo first game. Poly Bridge December 2017. Kentucky Route Zero: TV Edition coming in early 2018. That's coming to Xbox One, PS4, and PC as well. And of course, for PC, it would just be the last episode because there's already a bunch of episodes up for that. Earth Atlantis is coming this fall, first on Switch. Next Up Hero early 2018. SteamWorld Dig 2 is coming September 1st,",
      "start": 1297.03
    },
    {
      "text": "just be the last episode because there's already a bunch of episodes up for that. Earth Atlantis is coming this fall, first on Switch. Next Up Hero early 2018. SteamWorld Dig 2 is coming September 1st, premiering on Switch. Mulaka coming early 2018. Yono and the Celestial Elephants coming October 1st. No, October 1st. That is, it's been out, it turns out, for five years now. October 1st. Dragon Marked for Death is coming this winter, exclusive. It launched. Chef's Brigade from Adult Swim's coming out on December 2017. Morphies Law is coming this winter. It's a console exclusive for Switch. It looks weird but cool. Like, I want to try that one. That's the one where you shoot each other and parts get bigger or smaller or whatever, right? Sausage Sports Club comes Fall 2017, first on Switch. Light Fingers is coming early 2018. Nine Parchments is coming Holiday 2017. And then No More Heroes: Travis Strikes Again is coming 2018, launching exclusively on Switch. A lot of stuff. What do you think about that, Suda51?",
      "start": 1346.89
    },
    {
      "text": "early 2018. Nine Parchments is coming Holiday 2017. And then No More Heroes: Travis Strikes Again is coming 2018, launching exclusively on Switch. A lot of stuff. What do you think about that, Suda51? Whatever. Not, not yours. I tried to get into No More Heroes. I played it for a while on Wii when the first one came out, right? And it was like, okay, cool. Not really my style, not really my thing. And this one's weird, right? Because it's six different games. So is it exactly so? Or is it because, you know, you get stabbed by the controller and then pulled into six different games? You have to beat the boss. And it's like, so is it gonna be the No More Heroes people want? Or is it new take? It could be awesome. Don't get me wrong. But we'll see. Deals of the day. I couldn't find any good ones, but I did find over on Kotaku a heads up for you. Rock of Ages 2 that came out. Yes, sir, you're talking about it. It's also coming. There's the Rock of Ages 2 Complete Bundle on PSN. It claims to be a PlayStation 4 game. It actually",
      "start": 1391.77
    },
    {
      "text": "a heads up for you. Rock of Ages 2 that came out. Yes, sir, you're talking about it. It's also coming. There's the Rock of Ages 2 Complete Bundle on PSN. It claims to be a PlayStation 4 game. It actually includes a PS3 game. So it's a PS3 game, a PS4 game. Heads up if you were to buy it. Atlus has apologized and is correcting it, but right now, heads up, PS4/PS3 game, no matter what it says. Don't panic when you get it. No panicking. Don't panic. Heaven. Time to check in with the readers. Remember, you can be part of the show, KindaFunny.com/KFGD, just like Reverse-Flash did. Hey, Greg and Andrea, yes, are you leaned in like here to say some? I wanna give you something. Okay. Fire Emblem Warriors got a release date for Switch the other day. And I can't help but wonder if this release is too close to Super Mario Odyssey, one week apart. You guys have talked about how all these Switch games, Zelda, Mario Kart 8 Deluxe, ARMS, and Splatoon 2 have all sold over a million copies. That's fantastic. But they've all had their own month to",
      "start": 1439.23
    },
    {
      "text": "one week apart. You guys have talked about how all these Switch games, Zelda, Mario Kart 8 Deluxe, ARMS, and Splatoon 2 have all sold over a million copies. That's fantastic. But they've all had their own month to shine, so to speak. Fire Emblem Warriors does not seem to be getting much of a marketing push from Nintendo, given the release date announcement was just a small tweet out of the blue. I can't help but think everyone will be spending their money on Super Mario Odyssey and forget or not notice Fire Emblem during that time. Will this be the first Nintendo Switch game not to sell so well? What's your read on this, Reverse-Flash? I think there are quite a few Fire Emblem games, and I don't think it releasing in that window is going to be its downfall. I think its downfall is that there's just a lot of Fire Emblem to play, and I don't know if the same audience is going to be playing both of those games. So I don't think it's a fair comparison. I mean, clearly, like, they are still competing in the same space, but I don't think",
      "start": 1484.89
    },
    {
      "text": "I don't know if the same audience is going to be playing both of those games. So I don't think it's a fair comparison. I mean, clearly, like, they are still competing in the same space, but I don't think it's going to be like, I don't think they were going head-to-head. Yeah, my read on it was the fact that Fire Emblem fans are Fire Emblem fans, and they know there's a Fire Emblem coming up. They're stoked for it. They can't wait for it. And I think that when you talk about a Mario game's gonna have this mainstream mass appeal to everyone who has a Switch, Fire Emblem was gonna speak to people who are Fire Emblem fans or skipped out. And I, like I did, or I didn't play the other Fire Emblem that have come like 3DS. And there was like, now, but I'd never channel the first one and not be first, but the one that hit on 3DS that everybody loved, then everybody was playing. It was like, oh, people really like care about this game. That's interesting. Then I felt like, yeah, there's been like 17 more since then. And it",
      "start": 1528.31
    },
    {
      "text": "hit on 3DS that everybody loved, then everybody was playing. It was like, oh, people really like care about this game. That's interesting. Then I felt like, yeah, there's been like 17 more since then. And it seems like they haven't gotten that buzz. But a Fire Emblem name finally making its way to Switch. I don't, I think that even if you were under the, the first one or the one of these, and you burned out and didn't play anymore, now that it's on the Switch, which we want to buy games for, I feel like people gonna pick that up and be excited for it. No, and I don't think it was ever gonna come out and do three million units or something like that. Or, and I would say, I don't think it was ever gonna come out and do the one million unit. But I'm not sure what the Fire Emblem sales have been. They keep **** put these people in Super Smash Bros. So they've got to be popular. And I, I'm totally missing the boat, as I'm sure. So I think it's, I think it's gonna be okay. It's what it is, what it is. Fire Emblem fans, no video",
      "start": 1572.29
    },
    {
      "text": "people in Super Smash Bros. So they've got to be popular. And I, I'm totally missing the boat, as I'm sure. So I think it's, I think it's gonna be okay. It's what it is, what it is. Fire Emblem fans, no video game fans know. And I think if you were gonna buy Fire Emblem, you're gonna buy Fire Emblem. You're not be worried that Mario is there a little bit. Absolutely. I think Mario is going to crush it. And Fire Emblem is again, exactly what you just said. They're not going head-to-head. Andrea, yes. Elle writes in, and I want your opinion on this. You have, you remember, we've, we've had conversations about The Lost Legacy. We have. Yes. I forget, have you beaten or were you still working away through it? Um, I am still working my way through, but I watched the end with John when he beat it. Okay, cool. Heads up, we're not gonna, this is not, there's nothing worse here. And Elle's question doesn't go into spoilers either. But stick with me. Elvis writes in and says, hey, Greg and Andrea, I wanted to respond to something you discussed in",
      "start": 1608.74
    },
    {
      "text": "is not, there's nothing worse here. And Elle's question doesn't go into spoilers either. But stick with me. Elvis writes in and says, hey, Greg and Andrea, I wanted to respond to something you discussed in your mini Uncharted: The Lost Legacy spoiler cast that was like a couple episodes ago here on the Games Daily show. But don't worry, this isn't really a spoiler. It's about the relationship between Chloe and Nadine and how you said you felt that the story might have been better had Chloe partnered with another character. I personally loved Chloe and Nadine's relationship, and I usually agree with most of your takes on games. But do you think it's possible that you missed out on some of the great nuances in their relationship because you've never, you've never experienced female friendship? I'm not talking about you being friends with a woman, but the unique relationship between two women. It's something really special and hard to describe, but I think Naughty Dog absolutely nailed it in the",
      "start": 1649.75
    },
    {
      "text": "about you being friends with a woman, but the unique relationship between two women. It's something really special and hard to describe, but I think Naughty Dog absolutely nailed it in the writing of this game. This realistic portrayal of female friendship made it one of my favorite Uncharted games, especially since Uncharted is a series that mostly focuses on male relationships and experiences. Just hoped you might consider another point of view. Love the show. Sorry that was long. You got nothing but some of these kids all. Don't worry, that was no, no, that was definitely not that long. So here's the thing, as a woman who has experienced many female friendships in my life, I'm going to agree to disagree. I think also all female friendships are different. So perhaps Elle has had a friendship with a female that resembled the kind of relationship they had, but I would argue that what Chloe and Nadine have isn't a friendship. They make it clear through specific dialogue choices that this is",
      "start": 1686.11
    },
    {
      "text": "with a female that resembled the kind of relationship they had, but I would argue that what Chloe and Nadine have isn't a friendship. They make it clear through specific dialogue choices that this is just business. And they clearly, you know, become closer throughout the course of the game. But when the game ends, I don't think that they're running out to get mani-pedis together, right? Well, see, that that's my thing. And again, no spoilers, bubbeleh. The, when I was talking to spoiler cast, that was my problem. Of course, you know, I, we talked like, I was, it wasn't, I would have liked to seen Chloe paired with somebody else because I didn't think Nadine was that great in this game in terms of her, I mean, Laura Bailey's performance is great, but in terms of her motivations, where she's going, what she's doing. But at the end, I do feel they are trying to make us think that they are like, we're a team now. Well, and I was like, that doesn't really, that didn't feel earned. None of the moments in their journey felt",
      "start": 1726.31
    },
    {
      "text": "but at the end, I do feel they are trying to make us think that they are like, we're a team now. Well, and I was like, that doesn't really, that didn't feel earned. None of the moments in their journey felt earned. And it was just like I talked about this pretty extensively on the What's Good Games podcast last week. You could get that at Patreon.com/WhatsGoodGames or on podcast services or at YouTube.com/WhatsGoodGames. So what I said was the dialogue choices that happened between them in moments like you're in a climbing sequence, right? And you can hear Nadine and Chloe like kind of bantering back and forth with each other. It just doesn't feel friendly. It feels like they're acquaintances that are working together. And that they could be chummy with each other, but it doesn't feel like Chloe's gonna pour her heart out to Nadine, right? And I think that maybe Naughty Dog intends to explore that relationship further, but in The Lost Legacy, it just didn't feel like it clicked, which is",
      "start": 1770.71
    },
    {
      "text": "Chloe's gonna pour her heart out to Nadine, right? And I think that maybe Naughty Dog intends to explore that relationship further, but in The Lost Legacy, it just didn't feel like it clicked, which is my biggest problem with the game. And why I was a little disappointed because as I mentioned to you on the show last week, it didn't have the same chemistry that Nate and Sully have. Yeah. And granted, they have developed that relationship over several franchises, or excuse me, over several games in the franchise. And Nadine and Chloe just haven't had that. Nadine as a character is just hard. She's got an edge. She was a mercenary leader. You know, she is a gun for hire. She is a badass. And she's a really strong character. But I don't think that they have a female friendship because every female friendship I've ever had was not built on like, you're a badass ****. I'm a badass ****. We're just gonna only go around being badasses. Friendship is built on being able to be vulnerable with somebody and being",
      "start": 1816.13
    },
    {
      "text": "ever had was not built on like, you're a badass ****. I'm a badass ****. We're just gonna only go around being badasses. Friendship is built on being able to be vulnerable with somebody and being able to have a deep connection with someone over those vulnerabilities. And that's why you're friends with people. At least that's my perspective. Mic drop. I think you nailed it. But thank you. Well, I'm glad you enjoyed that. A good Austin. Austin writes in to KindaFunny.com/kfgd and says, hello. I want to know if you guys have ever had a phone game that you have gotten addicted to and play every day for months. I usually don't play a ton of phone games for a long time, but I've been playing Star Wars: Galaxy of Heroes for months now, every single day. It has hooks in me, and I don't want to stop anytime soon. What felt phone games have hooked you? For me, it was Game Dev Story. When that originally dropped, like that, I played that every night to our, every day, I should say, on the way to",
      "start": 1865.78
    },
    {
      "text": "to stop anytime soon. What felt phone games have hooked you? For me, it was Game Dev Story. When that originally dropped, like that, I played that every night to our, every day, I should say, on the way to and from work on the train, non-stop, trying to get the best game, make my sequels, make the money, do all this, crush the bugs. Because it really gave you a window into how easy it is to be a game dev. You know what I mean? I can't believe how many people screw this up because I just go crush the bugs, put it out, and sequels, and I make much money. The one game that really sunk its hooks into me was The Hobbit: Kingdoms of Middle-earth. Really? So this is a game designed by Kabam, a very successful mobile developer. Sure. And it was kind of part RTS, a little bit of base building, and you could form alliances and be part of like a guild. And I just got way sucked into this game. And part of it was my love for, you know, the universe of The Hobbit and The Lord of the Rings. And then part of it was it just was like",
      "start": 1911.43
    },
    {
      "text": "be part of like a guild. And I just got way sucked into this game. And part of it was my love for, you know, the universe of The Hobbit and The Lord of the Rings. And then part of it was it just was like so addicting. And becoming part of an Alliance really allowed me to connect with people in a way that I had never done in a mobile game before. Like I downloaded the LINE app so we could actually chat about strategy. And we were Melona. So it's kind of like WhatsApp, just like a chat app. Because you, there's no way do you talk to people in game? It's like a little bit walking. Yeah, I mean, the chat line in game is okay. But like people would like send photos in the in the chat. And we would talk about our lives. And like people be like, oh, I'm at work. I can't go pick up this gold over here or whatever. And we had like leaders who would, you know, rotate the the packs that you would buy from microtransactions. So they would do these deals where if you spent like $100 on a microtransaction pack, yeah,",
      "start": 1956.25
    },
    {
      "text": "and we had like leaders who would, you know, rotate the the packs that you would buy from microtransactions. So they would do these deals where if you spent like $100 on a microtransaction pack, yeah, everybody in your Alliance would get like the $5 pack for free. Mm-hmm. So we would just like take turns. Like somebody, somebody would buy the hundred dollar pack, and then everybody would benefit. And then the next time it was somebody else's turn. Yeah. And I spent a fair amount of money. I mean, because you have to check in with it constantly because you to defend your castle or whatever your fort in the game. Because otherwise, an invading army can come in and steal all of your resources. And so you have to constantly be monitoring the game. And I would have these nearby bases that I would go farm because I could tell like the person stopped playing because I could just keep attacking their their base and maybe never, it's all over. I would never defend it. And so that's what my base is now. I have a",
      "start": 2004.31
    },
    {
      "text": "I could tell like the person stopped playing because I could just keep attacking their their base and maybe never, it's all over. I would never defend it. And so that's what my base is now. I have a pretty good farm for somebody who have found it. I just stopped playing. But yeah, I I spent many, many hours. So when these people you randomly met her? Yeah, I had no idea of these people in person. I still don't talk to. I deleted the app a while ago. So I was like, because this, here's what happens. And the Alliance is the moment that you stop playing or that you lapse even. You, we used to have to report in to the heads if we were going to be out of town or if we were gonna be at work for extended periods of time because they would check in on you and be like, hey, why aren't you contributing enough? Because they're pool all of your resources when you're in the Alliance. And then they're like, hey, you, you haven't checked in. You've logged in for 48 hours. What's going on? What are you doing? And then they would",
      "start": 2053.42
    },
    {
      "text": "pool all of your resources when you're in the Alliance. And then they're like, hey, you, you haven't checked in. You've logged in for 48 hours. What's going on? What are you doing? And then they would boot you from the Alliance. Yeah. And there was like an approval process. You had to request entrance to the Alliance. And a lot of these had like high benchmarks. They're like, you have to have these kinds of stats in order to be considered. It was ruthless. That's awesome. Yeah, that's really, really cool. So yeah, if you're interested, cool one game. It's cool in the video game nerdy way we all like to do things. But like, I don't hear people getting into mobile games like that or these talking about it, right? That's why you're fascinating. You play so many different things. This is people I keep saying is people are ignoring mobile games. There are some really fantastic mobile games. There's a reason why they make more money than any other video game platform right now. You should make a video. You should do a",
      "start": 2094.25
    },
    {
      "text": "are ignoring mobile games. There are some really fantastic mobile games. There's a reason why they make more money than any other video game platform right now. You should make a video. You should do a video for us. Yeah, for us, not for What's Good Games. Yes. Like, hey, Kinda Funny Best Friends, here's five mobile games that don't suck and why you should play them. Sure. Okay. Thomas H. wrote in to KindaFunny.com/KFGD, just like you should and can, to wash the mobile game takes out of our mouth and says, what's up, Greg and Andrea? Is the essence of the console generational leap dead? Stick with me here. I know Sony has reassured us that there will be a PS5, but that can only really be true to a certain extent. To me, the success of a new console generation world walls around the hype and excitement of the generational leaping graphics, performance, gameplay, et cetera. For ample, the huge graphical leap from PS2 to PS3 and Xbox 360, which also brought around entirely new genres of first-person shooters and new",
      "start": 2129.95
    },
    {
      "text": "of the generational leaping graphics, performance, gameplay, et cetera. For ample, the huge graphical leap from PS2 to PS3 and Xbox 360, which also brought around entirely new genres of FPS, yeah, and open-world games to the forefront. But after Xbox One X, I can't help but feel that the next generation will feel like an underwhelming shuffle towards the future rather than the massive mind-boggling generational leaps of the past. Have, I'm sorry, has the success of the next generation already been capped with a glass ceiling thanks to Xbox One X and PS4 Pro? And what does the generational leap mean to you? Obviously, it's been coming up a lot. The Xbox One X, the PlayStation 4 Pro, and what's happening in the future. And we've talked about it this week already before you got here. Obviously, they were talk about this everything. That's the thing is, I feel like right now, I personally, as a video game fan, I'm a bit rocked by everything just in the way of like, you may just have we",
      "start": 2170.81
    },
    {
      "text": "obviously they were talk about this everything that's the thing is I feel like right now I personally as a video game fan I'm a bit rocked by everything just in the way of like you may just have we gone undo that can they just keep making games like they are now that'll play on all these systems but look better on Xbox One X or Xbox or PlayStation 5 or but they're all backwards compatibility but then there are we going are we gonna get like it is like it's that really **** weird question of like well if Xbox One X is the most powerful console and they're saying they can make everything run on the Xbox One no matter you know what platform you buy it on does PlayStation 5 games work on PlayStation 4 but just look terrible I just can't wrap my head around where we are and it's very alarming being in the industry I don't know what's happening it's challenging because the technology is just moving so quickly now and it's not just the game makers or the console makers if you",
      "start": 2215.46
    },
    {
      "text": "very alarming being in the industry I don't know what's happening it's challenging because the technology is just moving so quickly now and it's not just the game makers or the console makers if you think about the internal parts think about how often AMD Nvidia Intel are constantly updating their chipsets and their component pieces and the console makers have to try to keep pace with that I mean that's like obviously the beauty of owning a PC and gaming on the PCs that you can constantly swap out those pieces but it's expensive to do that you can't be updating your graphics card every six months you know and so it's a challenge for the people who are building this stuff to say okay how do we balance trying to keep pace with like the best technology that's available today while also not leaving people who have invested in our platform behind and clearly the rise of digital gaming has opened up the door to say there's more possibilities now we don't necessarily need to have a giant",
      "start": 2260.91
    },
    {
      "text": "leaving people who have invested in our platform behind and clearly the rise of digital gaming has opened up the door to say there's more possibilities now we don't necessarily need to have a giant generational leap that we had from say the 360 to the One or even from like the original Xbox to the 360 at night in my counter-argument to this would be actually that I feel like PS3 or PS4 Xbox 360 Xbox One sure it looks better and I mean like we can get into the you know the Mark Cerny demonstration of a million triangles falling I understand the text there but it's not PS2 to PS3 yeah yes PS1 to PS2 like there those were the ones I remember playing Madden on PS2 on launch day me like this looks like this I can't fathom that I'm seeing this whereas like oh man oh man Second Son looks really great like I'm not like oh man this looks nothing like the Infamous I've played but yeah it's different because I actually was just recently talking to someone about the generational leap from the SNES",
      "start": 2304.38
    },
    {
      "text": "like I'm not like oh man this looks nothing like the Infamous I've played but yeah it's different because I actually was just recently talking to someone about the generational leap from the SNES to the Nintendo 64 and how that was super mind-blowing because the technology just really jumped forward it's totally different perspective right right and we're just not we're just not there anymore because we're taking so many more micro steps between those generations that like it's incremental change right it could be argued even that going from an Xbox One to an Xbox One X is just an incremental visual change clearly they have like a lot more processing power and there's a lot of other back-end things that are going to make it bigger but to the naked eye it's like what am I truly getting is GTA going to run so much better on an Xbox One X versus an Xbox One mmm I don't think it will no and that's why it's weird of like I are we to a point where that can happen we're PS you know Michael",
      "start": 2350.52
    },
    {
      "text": "GTA going to run so much better on an Xbox One X versus an Xbox One mmm I don't think it will no and that's why it's weird of like I are we to a point where that can happen we're PS you know Michael Pachter you know I don't put him in the rundown I love Pachter obviously he'd great dude but you know he was making predictions yesterday about PlayStation 5 and how are we backwards compatible with PS4 and all this different stuff any other you saying 2019 right and it's like all we do is **** shout out dates we think things are gonna happen so he's got a professional analyst behind I know I know it but it's that thing of like are we to the point now where this and I'm this sounds shitty stick with me this is as good as games are where we're there are we there are no longer the giant leaps and it is like our cool like we're borrowing a bit for PC we're borrowing a bit from mobile where it's like yeah there's going to be the Xbox S and the Xbox X and then like these incremental things",
      "start": 2392.55
    },
    {
      "text": "and it is like our cool like we're borrowing a bit for PC we're borrowing a bit from mobile where it's like yeah there's going to be the Xbox S and the Xbox X and then like these incremental things and eventually there'll be a new you know iPhone 5 or iPhone 10 or whatever in there'll be a new PlayStation 5 but does the do that is there a way that the PlayStation 5 games are somehow running on older hardware is that a thing or two Sony totally throw a wrench in the works and say all right Xbox you've been trying to catch up and keep goodwill you're letting all your stuff be you know Xbox One X Games or we know I mean Xbox there's the Xbox ecosystem everything plays on everything we're sticking with what we know where PlayStation 5 is such a leap forward that you have to come join us if you want to play these games rather than that I think with something like PlayStation Now still existing and hypothetically going to be existing on the next console whatever that is that musician makes",
      "start": 2437.58
    },
    {
      "text": "want to play these games rather than that I think with something like PlayStation Now still existing and hypothetically going to be existing on the next console whatever that is that musician makes I don't I don't see that going away if I mean backwards compatibility has clearly been successful for Xbox in their ecosystem but I'm always of the mindset I've said this many times on this show I don't care to spend that much time playing old games sure so it's not important to me for me it's not you know backwards compatibility as much as cross compatibility ok is how with Xbox making the argument that we're done with generations everything plays here just looks better on Xbox One X what does that mean for PlayStation PlayStation 5 because it could go one of two ways we're all right let's say one or two ways being that PlayStation 5 said PlayStation says PlayStation 5 is its own thing there will be PlayStation 5 only games you can't play them on PlayStation 4 either that means suddenly",
      "start": 2474.92
    },
    {
      "text": "one or two ways being that PlayStation 5 said PlayStation says PlayStation 5 is its own thing there will be PlayStation 5 only games you can't play them on PlayStation 4 either that means suddenly the PlayStation 5 is so powerful it's getting even more exclusives knock on wood because people are buying it that those games aren't going to Xbox One or are we getting the Xbox One versions up rezzed again over like it's always like every time you talk about the future of video games like what a facet fascinating time to be alive but in terms of the industry truly shifting and everything being really different and does the Xbox One X if they're gonna say that's their next thing and they're gonna say what is that gonna become the Dreamcast or does PlayStation 5 become the Dreamcast cuz we're all over here me like well **** Xbox One X section nothing becomes the Dreamcast oh no no I can't wait to ticket it Kevin get a wrench and knock me out for four years I want to see what happens when I",
      "start": 2517.94
    },
    {
      "text": "over here me like well **** Xbox One X section nothing becomes the Dreamcast oh no no I can't wait to ticket it Kevin get a wrench and knock me out for four years I want to see what happens when I wake up no okay sorry okay don't do that don't add thanks Kevin oh do I feel like there's two really Andrea heavy questions here to close out okay I'm gonna give them both back-to-back Mark writes in says hey Greg and Andrea I was curious about your thoughts on how a developing community or lack thereof around a game impacts the players experience of it Absolver looks like it will definitely have it dedicated followers and I want to give it a shot as the community develops specifically before anybody gets way too good for the game to be enjoyable I found myself using this rationale justify my purchase because I have missed the community boat for games like The Division Dark Souls 3 and Metal Gear Solid V I know I can still technically play them but I feel like their times in the game space",
      "start": 2559.25
    },
    {
      "text": "because I have missed the community boat for games like The Division Dark Souls 3 and Metal Gear Solid V I know I can still technically play them but I feel like their times in the game space have passed going back at this point with going back going back at this point seems like it would produce a less-than-ideal experience of the game seeing as the majority of the population still playing at this point would be a small community of the most dedicated Pro unless the game specifically accounts for it as Robyn was talking about a journey on the Gamescast it seems like the flaw that most games have Andrea you might have to translate some of this for Greg Destiny covers a similar spectrum for me to Vault of Glass will always be a treasured gaming moment because my fire team and I legitimately figured out the raid on her own for Crota's End there were only three of us left so we had to join in and be sure pert around almost reluctantly by pros and as the last as last one left for King's",
      "start": 2605.93
    },
    {
      "text": "figured out the raid on her own for Crota's End there were only three of us left so we had to join in and be sure pert around almost reluctantly by pros and as the last as last one left for King's Fall I was forced to research the raid strategies in order to even be a viable candidate for LFG sites looking for group I got that hi I'm all infer Destiny 2 but I wonder if this pattern will release itself thanks all the amazing content until Kinda Funny Games Daily I never realize how much I would appreciate having a podcast look forward to each and every day keep up the great work Mark communities and games tough sometimes yeah I think it really depends on the game and its widespread popularity I mean look at a game let's stick to two games Rainbow Six Siege and GTA Online one game community has continued to grow over time almost exponentially so it gets bigger and bigger all the time more more people keep playing GTA Online Rainbow Six Siege has a very dedicated but very",
      "start": 2647.12
    },
    {
      "text": "game community has continued to grow over time almost exponentially so it gets bigger and bigger all the time more more people keep playing GTA Online Rainbow Six Siege has a very dedicated but very small hardcore community and as he's saying here it's very difficult if you were to pick up Rainbow Six from now to try to get in because the people who are playing there are really really good sure and so unless you're willing to put in the practice time to get good you know you're gonna you're gonna be frustrated sure when he brings up Destiny it's a fair point to say hey like I lost a lot of my clan along the way I also lost a lot of my clan along the way when it when King's Fall came out I was in the same boat where it was like me and like one or two other people that were in our original Destiny clan yeah and that's frustrating because using the previous LFG sites for Destiny was challenging I had a little bit easier because I could just tweet out and be like who wants to play just",
      "start": 2692.39
    },
    {
      "text": "Destiny clan yeah and that's frustrating because using the previous LFG sites for Destiny was challenging I had a little bit easier because I could just tweet out and be like who wants to play just like you tweet out and you're like okay best friends let's play together but if you're just a person who's playing who needs friends and you have to go to an LFG site it's pretty daunting because sometimes playing with strangers in that setting especially for a raid where you have to work together and you're committed to probably playing for at least two to four hours depending on your skill level in a raid like that's a long time to like be with people on chat that you don't know yeah I'm glad that Destiny is taking big strides to fix that with their new community features and their new you know raid and clan and LFG features that are built into the game but that doesn't mean every other game is gonna do that and it's it's tough I think that you should never be afraid to try a game for",
      "start": 2741.05
    },
    {
      "text": "know raid and clan and LFG features that are built into the game but that doesn't mean every other game is gonna do that and it's it's tough I think that you should never be afraid to try a game for this reason always keep an open mind cuz even though there are clearly like bad trolls out there who are just gonna make your life miserable there are far more good people out there who are willing to say hey I love this game I want you to have a good time let's do it you've always got the best friends yeah and that's that I mean that's my shorthand answer is like I feel like what the Kinda Funny community is in the way we've built it if you were to go to the forums if we would go to Reddit if you go to the Facebook great me like hey I want to try this game for the first time does anybody want to join me you're gonna get folks who want to join you and go play with you and then the same thing like it's interesting because right this is kind of my argument of what turned me off to Destiny was",
      "start": 2782.51
    },
    {
      "text": "join me you're gonna get folks who want to join you and go play with you and then the same thing like it's interesting because right this is kind of my argument of what turned me off to Destiny was the fact of I was into it enjoyed it went away everybody got good started coming below people wanted to pull me through and I didn't wanna be pulled through and that I think for me it wasn't I and then so many best friends we will play and just let you figure it all out and do that it's like that also doesn't fit it right like what I'm excited about with Destiny 2 is you and me and Andy and we're all gonna be playing and doing this thing and be on similar ground like obviously you're gonna be better than me you know Destiny what better than me all these different things but we'll be figuring it out and I'll be in the race still of like oh man I'm still not competitively getting close to but I mean even as you pull away or have more levels than me I'm still within a few of you I don't feel",
      "start": 2826.55
    },
    {
      "text": "out and I'll be in the race still of like oh man I'm still not competitively getting close to but I mean even as you pull away or have more levels than me I'm still within a few of you I don't feel like I'm just like I don't know what the hell any of this is or how any of this works like I want to be in that with my friends if that makes sense like what motivates me like right now with what's happening with Everybody's Golf or me Joe and Andy are like obsessed with it just playing right now Jen is at home today obsessed with it it's like that's awesome I like the fact that we're all in the same where are you but like when Andy gets to golf tier seven or in our golf tier seven and I'm in golf tier four because I had to **** work pack something like that Damian I would hope that you would maybe let go of that reluctance to be sure bud yeah I think and you said I don't want to be pulled through like but why not like I think there's something to be said about trusting your friends",
      "start": 2859.16
    },
    {
      "text": "would maybe let go of that reluctance to be sure bud yeah I think and you said I don't want to be pulled through like but why not like I think there's something to be said about trusting your friends when they have you know a leg up on you to say like hey you're clearly better at this than me I want to do it help me out that's what friends are for sure no and that's true I just feel I hate I hate feeling like the kid brother in any game where someone's like oh do this while you do it that way and I'm not being **** about it even right like no don't do oh you did that right well that now it's like I don't well clearly what you have to be with people who have the patience particularly more talking about raiding and Destiny everyone has to get Sherpa through at some point because figuring out the first time is really challenging for all players right like somebody's going to be the one to figure it out first yeah every time I did a raid in Destiny I played through with someone who had",
      "start": 2897.11
    },
    {
      "text": "out the first time is really challenging for all players right like somebody's going to be the one to figure it out first yeah every time I did a raid in Destiny I played through with someone who had completed the raid before I never went into a raid fresh with it with a fireteam of people who had never done the raid before there was always at least one or two members on the fire team that had completed it and we're like okay guys here's where we're gonna go because no matter even if they finished it every playthrough is a little bit different because everyone has a role to play and how you execute that role is going to be different depending on your play style as a as a guardian next question comes from Will J. Newsome who writes into kindafunny.com/KFG just like you can it says hello Greg and Andrea this question is mainly for Andrea sorry Greg it's totally fine I've had Mass Effect Andromeda since launch but due to the number of great games in the PlayStation 4 at the time",
      "start": 2938.54
    },
    {
      "text": "and does I haven't gotten around to playing it I haven't played it now after putting 100 hours into the game I can't understand where all the hate is coming from sure there's quite a bit of pop in and but other than that it's another Mass Effect the relationships are there the dialogue is great and witty and the characters are all interesting why is Mass Effect Andromeda getting such a shaft and him being put on hiatus the reviews were all good albeit not great is this EA responding to the Internet's overreaction to the game many people thought they were going to be better than it actually was I'm actually disappointed now because I was really enjoying it in there won't be any direct sequel or story DLC Andrea what's up you got to play it after they fixed it yeah and I think that's the big",
      "start": 2980.68
    },
    {
      "text": "I'm actually disappointed now because I was really enjoying it in there won't be any direct sequel or story DLC Andrea what's up you got to play it after they fixed it yeah and I think that's the big thing here is that they put out a massive patch and they've done you know a couple smaller patches as well that really fundamentally improved the game I still intend to go back and play that game again and really experience it with the pay way they wanted it's a patch in place because I enjoyed it even with its multitude of problems it is a Mass Effect game but there are a number of reasons why that game is not as good as any of the games in the original trilogy and that has nothing to do with the animation or the lines of dialogue it has to do with just fundamental design of the way that they set that game up and that's just the way that game is and EA didn't put that game on hiatus they didn't",
      "start": 3015.72
    },
    {
      "text": "set that game up and that's just the way that game is and EA didn't put that game on hiatus they didn't bench that game so to speak because of critical reviews they benched it because of financial sales like the game just didn't sell and I don't know if it didn't sell because the critical reception at launch was so bad or if it didn't sell because people really didn't want Mass Effect without Commander Shepard it's gotta be though the backlash right of everything and the funny gifts and this and the reviews and it's not mad I feel like that because it if it would have been another stellar Mass Effect people would have bought that oh absolutely clearly had an influence but I don't know if it was like the defining reason I think there were a multitude of reasons why people didn't buy that that also came out in the same four-week period as Breath of the Wild and Horizon Zero Dawn so you had",
      "start": 3060.0
    },
    {
      "text": "like the defining reason I think there were a multitude of reasons why people didn't buy that that also came out in the same four-week period as Breath of the Wild and Horizon Zero Dawn so you had these massive RPGs that are right now the two top contenders for Game of the Year Oh in the same space as Mass Effect Andromeda which we have all hoped would have been a Game of the Year contender and then when it fell flat people were like wow I've got Zelda or I've got you know Horizon yeah I'm already making my way through why would I let me wait but now it's just like the the ship has sailed yeah you know it's too late for Andromeda and that bums me out as a Mass Effect fan sure it's good answer I see why we put you on the show time to squad up this is where one of you writes in to kindafunny.com/KFG give me your username your platform the game you need help along with the story just like Bob did Bob's on PlayStation 4. His username is OtherBob2 that's the numeral 2 and",
      "start": 3106.98
    },
    {
      "text": "KFG give me your username your platform the game you need help along with the story just like Bob did Bob's on PlayStation 4. His username is OtherBob2 and OtherBob2 says missing out I'm playing Everybody's Golf with you guys was the last straw I need to find some best friends in Europe to play with I'm an older gamer who buys and sometimes plays a lot that's why I'm looking for a group a good group of hardcore casually mature players - - Hogan Hogan Hogan Hogan Hogan with this past week I bought Everybody's Golf Cities: Skylines Elite Dangerous and Golf Club 2 and next week I'm considering purchasing Destiny 2 and Friday the 13th if I have some show people in European time zones to play with thanks and keep being Kinda Funny from Bob in Denmark so hit up OtherBob2 if you don't play any of those games with them good stuff Andrea yes Greg what's going on in kindafunny.com/yourewrong what if we messed up today well let me pull that",
      "start": 3151.53
    },
    {
      "text": "page up real quick I can pop in with one if you want a man or woman named Smokeahontas overrun Reddit chimes in with a you're wrong to defend the honor of Greg Miller i listened to the podcast version of Kinda Funny Games Daily so I didn't get a chance to ride in live but at the top of the show Greg said him and Danny were so stupid for not trying to predict which game would try to make their own battle royale mode saying they thought it would be the Rainbow Six but never thinking of GTA Online I don't know why but I could have sworn that someone on the show had mentioned GTA would actually be a great fit for it upon my highly unnecessary research into the subject I found that around the 34 minute mark on the July 19th episode the one with the original Ubisoft slash PUBG discussion",
      "start": 3197.22
    },
    {
      "text": "be a great fit for it upon my highly unnecessary research into the subject I found that around the 34 minute mark on the July 19th episode the one with the original Ubisoft slash PUBG discussion it was Greg himself who said that GTA Online already had the guns the cars and a map large enough to pull it off and not have to change much so props see you Greg for the accurate debt guess you were right did everybody the first one is about the Morning Show it's about the Cheeto thing oh **** god that's not bleeding over no sorry bringing it up PlayStation actually changed the free games for September a little bit ago and they are now Infamous Second Son Strike Vector Truck Racer Handball we are doomed Hatoful Boyfriend no not really a mistake more of a correction well unless something's changed while we're on this show I believe you're reading the UK games PlayStation America there was a question about this for somebody's like why do they get different things I'm like licensing rights",
      "start": 3242.55
    },
    {
      "text": "while we're on this show I believe you're reading the UK Games PlayStation America there was a question about this for somebody's like why do they get different things I'm like licensing rights that but yeah Hatoful Boyfriend I know is happening over in the EU but I don't think that's okay in this the second one was about that too okay you're saying we nailed it that's right pick up dog oh this is the initial listing of free games for PS Plus was incorrect on the blog okay go Andrea engage take me the PlayStation Blog no because we have Infamous Second Son, Strike Vector EX, Monster Jam Battlegrounds, Hustle Kings, Hue, Sky Force Anniversary alright I'm pulling up the way with the website the website is loading Sid Shuman is being the full says update an earlier version of this post featured an incorrect version of the September lineup we have updated the list below with the final lineup for September the full lineup is Infamous Second Son, Strike Vector, Truck Racer, Handball 16 we",
      "start": 3299.4
    },
    {
      "text": "an incorrect version of the September lineup we have updated the list below with the final lineup for September the full lineup is Infamous Second Son, Strike Vector, Truck Racer, Handball 16, We Are Doomed, and Hatoful Boyfriend cross-buy with PS4. We Are Doomed also cross-buy with PS4 is on us and giving us a little bit of the information there because that was confusing with the EU getting different games all the time. Yes, that's on Sid Shuman, everybody, or actually it's on Ryan Clements. Extras on this, only James Holohan, he's the one who wrote it. Okay, okay, props to you. There's another Cheeto's thing, you know, says, \"Yes, Game of Thrones: A Telltale Game Series ends with a huge cliffhanger.\" Is he spoiling it? No, it says, \"was really looking forward to the new season after playing the PlayStation Plus version just for the hell of it.\" Writing, 'cause I'll forget to look at this up after the show, go to KindaFunny.com/KFGD, tell me what the spoiler was. Nobody else, that's right, and just that one gentleman.",
      "start": 3357.27
    },
    {
      "text": "just for the hell of it. Writing, 'cause I'll forget to look at this up after the show, go to KindaFunny.com/KFGD, tell me what the spoiler was. Nobody else, that's right, and just that one gentleman or a woman. Okay, gentle lady. Agus, hey guys, a lot more games were announced for the Switch thanks to the Nintendo UK YouTube account yesterday. Not everyone would like to know, some were announced today, but a lot weren't. These are the games that weren't announced on the US stream today: Monster Boy and the Cursed Kingdom, Yoku's Island Express, Away: Journey to the Unexpected, Flipping Death, Flat Heroes, Hollow Knight, Battle Chasers: Nightwar, Owlboy, State of Mind, Shu (maybe Shu, Shu, that's the one that came to the PlayStation already), mmm, Rogue Trooper Redux (Redux is probably the way I should say that), yes, Wargroove, Tiny Metal, Portal Knights, Brawlout, Unbox: Newbie's Adventure, and Constructor Plus. Goddamn, a lot of here. Thanks for the update thing. Okay, Fire Emblem Awakening has sold 1.7 million copies as of",
      "start": 3405.39
    },
    {
      "text": "Wargroove, Tiny Metal, Portal Knights, Brawlout, Unbox: Newbie's Adventure, and Constructor Plus. Goddamn, a lot of here. Thanks for the update thing. Okay, Fire Emblem Awakening has sold 1.7 million copies as of December 2014, so the series is at least a potential million seller. Okay, I'll give it to you. Okay, what do you think, Shirtless Shulk? I don't know about it there, and I'm kind of coasting off of that. This person says, \"Fire Emblem Warriors is not a traditional Fire Emblem game. It's Fire Emblem-themed Dynasty Warriors, so a niche game themed after niche series, so I think they already know it won't sell as well as Mario.\" That was a good point, good point, tit for tat, as they call. Yes, um, this one is also about the PlayStation Plus games. That space is not about Cheeto's. Alright, great, thank you. Now it's not for a new segment called Hard Truth with Greg Miller. Mad Easy writes in the KindaFunny.com/kfgd and says, \"Angry Greg voice, please, 'cause I'm **** angry Greg, **** Lone Wolf Miller. What does a best",
      "start": 3456.18
    },
    {
      "text": "a new segment called Hard Truth with Greg Miller. Mad Easy writes in the KindaFunny.com/kfgd and says, \"Angry Greg voice, please, 'cause I'm **** Angry Greg, **** Lone Wolf Miller. What does a best friend and devoted fan need to do to get a question answered on this **** show? Seven times I write in, seven times I am denied. **** Chris Brown gets two letters read, I can't get one. I will write this until you read it on air.\" Yes, that may be crazy or dedicated, I haven't decided which one yet. \"Which podcast do you like to listen to while you're game?\" I choose personally to partake in yours and Angry Greg voice. P.S. I love you guys, keep doing your doing. Mad Easy, it's time for Hard Truth. Your question's not good, that's why it didn't get read. This is a few questions I get asked all the time, and so I gave you, I guess, respect, which was a mistake clearly, of not telling the world your question was bad. I assumed you were such a Kinda Funny fan, you would have heard me talk about Death, Sex & Money or",
      "start": 3508.03
    },
    {
      "text": "you, I guess, respect, which was a mistake clearly, of not telling the world your question was bad. I assumed you were such a Kinda Funny fan, you would have heard me talk about Death, Sex & Money or This American Life already, but apparently you're one of these fake **** Kinda Funny boys I hear about on the internet all that much. So now the respect is over. You have disappointed your family, disease, and so that's what you need to know, son. Don't come into my house. You're right in seven times in a squad like, \"Why do you think the question didn't get read?\" It wasn't **** good, Mad Easy. It wasn't **** good. Tomorrow's host is gonna be Danny. Remember, ladies and gentlemen, this is Kinda Funny Games each and every weekday. We run you through the nerdy video game news you need to know about on a variety of platforms. You can catch it live on Twitch.tv/KindaFunnyGames or catch it later on YouTube.com/KindaFunnyGames. You can also get a podcast services around the globe.",
      "start": 3558.29
    },
    {
      "text": "on a variety of platforms. You can catch it live on Twitch.tv/KindaFunnyGames or catch it later on YouTube.com/KindaFunnyGames. You can also get a podcast services around the globe. Remember, PAX is coming. Andrea is leaving. Goodbye, goodbye. You'll be doing stuff Friday. She's a panel, she's hosting Life Is Strange. One Friday, they have their party. It's a Life Is Strange party. Saturday, they have their panel. So what could game panels? I have my panel, it's a Telltale panel. Sunday, I have autograph signings. Sunday, the cancer panel. I'll still be here. Danny's here tomorrow. Until next time, it's been our pleasure to serve you.",
      "start": 3608.63
    }
  ]
}
