{
    "id": 2954,
    "video_id": "CYlP_xlpHJA",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Definitive Fast and Furious Ranking w/Meg Turney - The GameOverGreggy Show Ep. 195 (Pt. 4)",
    "description": "Thanks to Blue Apron for sponsoring this episode. Go to www.Blueapron.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1504162801,
    "duration": 2688,
    "transcript_chunks": [
        {
            "text": "this September we're launching a new show called Cooking with Greggy and you know one of the things that fueled my passion in the kitchen our sponsor Blue Apron. Blue Apron's mission is to make incredible home cooking accessible to everyone and it totally helped me when I was starting out by giving me step-by-step instructions along with pre portion ingredients that make cooking so easy even a dummy like me could do it. You pick the meals you want, they're delivered to your door and you finally get to use those pots and pans you got as a Christmas gift from Grandma and Poppy. Blue Apron knows you're busy so now they are offering 30-minute meals. These meals are made with the same flavor and farm-fresh ingredients you know and love and are ready in just 30 minutes or less. Check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Greggy. That's BlueApron.com/Greggy. Blue Apron, a better way to cook, also known as what",
            "start": 0.0
        },
        {
            "text": "week's menu and get your first three meals free with free shipping by going to BlueApron.com/Greggy. That's BlueApron.com/Greggy. Blue Apron, a better way to cook, also known as what else you need a shoe. All right, we'll make what's your topic? My topic is something that's been so long in the making, something we have, I'm so ready, two decades in the making. We're gonna do the definitive ranking of The Fast and Furious films. I think everybody bought in Furious Five. Okay, then we would talk about doing this. Mad Decent doesn't work anymore. Now I'd to get hammer. There you go. Now what I'd like to bring the table before we begin, 'cause I think about clearly the least of the Fast and Furious fans here, even though Nick apparently makes that like I've never watched them, even though I did an entire marathon of all of them for second viewings or third viewing sometimes. But Nick, you know, doesn't care what I want to do is bring up a comment from the one-and-only Reddit.com/r",
            "start": 41.04
        },
        {
            "text": "did an entire marathon of all of them for second viewings or third viewing sometimes. But Nick, you know, doesn't care what I want to do is bring up a comment from the one-and-only Reddit.com/r/KindaFunny, right? In which HellTeacherLoki wrote in and said, \"They are doing the ranking every wrong every time. After that Marvel ranking, I thought, okay, this isn't how they're supposed to do it, but whatever. At least Amy made a respectable list I can get behind. But they did a ranking again with the Tarantino movies and oh boy, I'm just so pissed. Every ranking talk is then talking about their personal list followed by variations of, 'Yeah, no, you're crazy,' or, 'That's a good list,' from someone the group and then moves on to the next person's list. This way of ranking is so stale. It doesn't promote discussion between these guys enough.\" Well, gentlemen and Joey Noel, why not create a list that represents Kinda Funny as a whole? Each one writes down their list in order, get get the sum of each",
            "start": 114.45
        },
        {
            "text": "discussion between these guys enough. Well, gentlemen and Joey Noel, why not create a list that represents Kinda Funny as a whole? Each one writes down their list in order, get get the sum of each item, arrange them for most to least discussing groups of five, rearrange that for ties, and then he does a little shrug of them. Okay, complicated. I think first of all, take a step back, sir. Let's just take a breath. Second, we all wrote our **** list, right? All right, so we're each gonna present our list, I think with a lot of arguing, and then we make a definitive list, do we not? Now he's, yeah, we do. How does this went down with, hey, that's it. There are some good points. We did not discuss the Tarantino movies enough. We did, there was some in the Tarantino discussion, but I feel like we could have taught, I could talk for two hours about which movie I liked better, a Reservoir Dogs, Pulp Fiction. You know why it's called Fiction? And I could talk to you about that later if you want. I get that the the thought of",
            "start": 161.7
        },
        {
            "text": "talk for two hours about which movie I liked better, a Reservoir Dogs, Pulp Fiction. You know why it's called Fiction? And I could talk to you about that later if you want. I get that the the thought of doing the official lists, I did not think was mathematically possible. What he's saying that seems like it matters. Like I didn't I didn't think, okay, we're gonna average all let's see movies movies to figure it out. And I feel like we're gonna be close on the same page. I've got a little hint, subtle hints. We don't know each other's lists. I feel like 10, we are gonna go to war. I don't think so. Cortez, in a dry erase marker, sir, over there. You know, chair frame. Before time to do this, I want to go through the movies and give people a refresher of what the movies are. Get Nick's list doesn't **** up one sentence. Why do you think I don't remember? Bring another chair. It's because there's eight movies and my feeble old brain can only keep four. So I've written the list down. Okay, this is my definitive. You did",
            "start": 207.33
        },
        {
            "text": "why do you think I don't remember? Bring another chair. It's because there's eight movies and my feeble old brain can only keep four. So I've written the list down. Okay, this is my definitive. You did list. Thank you guys. Like you don't, it's clearly numbers in order for eight eyes. All right, so should we go back and forth? You think, Andy, have you been paying attention? We're ranking these so you need to write all the data. This is what's important about the movies. All right, are you listening? I'm listening, Nick. I'm listen. It doesn't look like you listen. I got I'm texting my brother 'cause he's not listening. That's the opposite. Can do two things at once. That's sure. I can't hear. I don't get Fast and Furious One. Paul Walker's a cop. Vin Diesel's a thief. Suddenly he loves thieves. He's not plot, not plot, not movie. It is. Wait, it's in LA. Bring to the table that Tim Gettys shuts up and let's make doing her away 'cause I think that'll help the audience. Paul, Tyrese, Miami, hungry Miami, right? Hungry Heyman does",
            "start": 257.31
        },
        {
            "text": "movie. It is. Wait, it's in LA. Bring to the table that Tim Gettys shuts up and let's make doing her away 'cause I think that'll help the audience. Paul, Tyrese, Miami, hungry Miami, right? Hungry Heyman does cop, right? They jump into a pontoon boat onto a like what are those things called? Yacht. They go into a swanky club that consists of just a curtain. Number three, Fast & Furious: Tokyo Drift. Justin Lin, the turning point for the series, right? Someone say the most important on the most critical character to the in the whole franchise. I'm sorry, Gal Gadot is really great. Love her and I love it. They're together. Has so many women took you adrift, but that's okay 'cause it was all Han, his love interest. So I'm okay with it. That's why I'm trying to get over it. He never did and we know he never did. Fast & Furious 4, the low point. Okay, and she's got a sidekick, an important part of that. But the phone person. Okay, okay. And yes, it's important. Fast & Furious 4 is that it brought back the original cast and",
            "start": 308.52
        },
        {
            "text": "Fast & Furious 4, the low point. Okay, and she's got a sidekick, an important part of that. But the phone person. Okay, okay. And yes, it's important. Fast & Furious 4 is that it brought back the original cast and Michelle Rodriguez, his character Letty. That's very key, right? And if he should be worse, DG seen in movie, his how dare you? He's been through. Oh no, I'm not even talking about. I bet you met the part where he just for whatever reason Casillas house. Yeah, it's basically the what is that? Heavy Rain moment. Yes, I'm talking about the the mountain final chasing Buddha Mountain where it's like through the cave, a PS1 game. That's the cave. 1:1 and Tokyo Drift when they're drifting the mountains also looks really bad at first point of car disappears. They have one less car at the end of the Fast Five. The Rock joins the franchise. They're not gonna be found out. Boom, all the money there. There you go. Yeah, here's the deal about Five that everyone needs to understand. As far as as good as Three was and for what",
            "start": 394.96
        },
        {
            "text": "joins the franchise. They're not gonna be found out. Boom, all the money there. There you go. Yeah, here's the deal about Five that everyone needs to understand. As far as as good as Three was and for what Three did this series. The Rock say Four and Five endowed in that order were necessary because Three was like, look, this franchise can be good. Four was like, we gotta bring back, wait, to get the plot out of the way and get everyone back so that we can have the majestic this Five. Now I've said this before, I'll say it again, and this is a little bit of a little bit of a tangent, but I'm gonna go off on it. When The Rock was in that movie, I've seen The Rock in movies prior, but for whatever reason, he showed up in that movie with a good 75 pounds more of muscle on him and he was just sweating the entire time and every line it was was the most Rock scene. So **** Rock at osius. Never. That is that that's the one where they have the chase scene through like the the barrio of Brazil, right? So a key thing",
            "start": 460.7
        },
        {
            "text": "time and every line it was was the most Rock scene. So **** Rock at osius. Never. That is that that's the one where they have the chase scene through like the the barrio of Brazil, right? So a key thing, Fast & Furious 4 and what Fast & Furious as it's known, dropping the dust. No, does there. It ends with Vin Diesel, Dominic Toretto, be in a boss on the way to jail because he got arrested, right? Here that immediately starts off. We can box in the mouth with the **** coolest scene of all time. Yeah, that was one where it's like he runs on the thing right up to was that is that that one which was on when Paul Walker runs up the side of the yeah, the truck as it's going off and say that's why we're doing this day trying to help you here. So what should I bring down the cassette tear the cassette tape? But the other key thing about Five is the one where The Rock was introduced and he at one point tells the team of SWAT people, whatever you do, do not let them get in the cars. That's right. Number Five also the",
            "start": 505.55
        },
        {
            "text": "other key thing about Five is the one where The Rock was introduced and he at one point tells the team of SWAT people, whatever you do, do not let them get in the cars. That's right. Number Five also the first time we see a tank, gonna be important to franchise. Also the first time we see a bank vault being spun around physically and possibly turn to superheroes. By the way, Five is the moment they turn into like superheroes, right? Six is Letty's back. Do you think about that? And that's why Five is key to it. Really took the family to the next level. So then when Six had to face a rival family, things are gonna get real. Okay, now Six I liked because they were like up until that point it had been about like souped up new cars, right? And then in Six, that's when that's when Tej goes and buys like he's a millionaire, right? So he goes and buys all the classic cars and how all those badass like old 60s and 70s cars. There is no one in London, right? Also Paul Walker goes to jail. Oh, go to go to find Braga, yeah.",
            "start": 563.68
        },
        {
            "text": "right? So he goes and buys all the classic cars and how all those badass like old 60s and 70s cars. There is no one in London, right? Also Paul Walker goes to jail. Oh, go to go to find Braga, yeah. Not to be confused with Eight when The Rock and Statham are in jail and because buddy scream for no reason, they just drop all the pretenses. You don't love each other. Most important scene in all of Fast and Furious history and the post-credits scene where we see the connecting it all weirdo about to Tokyo Han dies. Jason Statham did it. I did it. The **** I get it. Could you have made it look at all like the end of Tokyo Drift? Because it just doesn't look anything like that in Tokyo Drift. In Tokyo, song started playing them. I was like, oh, you don't know me, but you're about to. And Vin Diesel, he blows up Dominic Toretto's family home. Yep. Yeah, that's right. Jason Statham is here and he's a force to be reckoned. That those two things alone, killing Han and blowing up your family home that you grew up in and",
            "start": 612.5
        },
        {
            "text": "Toretto's family home. Yep. Yeah, that's right. Jason Statham is here and he's a force to be reckoned. That those two things alone, killing Han and blowing up your family home that you grew up in and that you want to have one day kids and would be enough to not to warrant not getting invited to the barbecue. But guess what? Dominic Toretto can forgive them, forget. We're in Furious 7 now. Mmm, hi P. Okay, 307, the last minute future Paul Walker. Yeah, The Rock spends the entire movie in affordable. Dominic crashes a helicopter by like shooting at it. It's the thing about Seven is it is the most crazy set pieces. That is the most over-the-top the series has ran thus far. Not true because then we get Eight and we get a friggin submarine as a vehicle that they can go through when that car went from building to building, having cars. Yes, but uh Seven also has, oh my god, what is her name? Ronda Rousey. And she kicked Michelle Rodriguez's ass. And it's amazing about that scene was that if you remember correctly, plot wise,",
            "start": 671.42
        },
        {
            "text": "having cars. Yes, but uh Seven also has, oh my god, what is her name? Ronda Rousey. And she kicked Michelle Rodriguez's ass. And it's amazing about that scene was that if you remember correctly, plot wise, the entire thing was they had to steal the car to get the drive to use the satellites to find Jason Statham. And every time they went anywhere, Jason Statham just showed up. Yeah, he just showed up. That seemed particularly like we have a supercar that's I guess it's kind of bulletproof because I kept firing out and uh then having doesn't matter. And the Jason Statham shows up and instead of hitting with a car, they chose to jump to the other building. Genius. Important importance a step. They introduced what I feel like is probably gonna be the standout character, Kurt Russell. Great addition to the cast. Pretty sure he had no idea what was flowing. You know, time walked in, just smile, slicked his hair back. But as soon I was like, give me a check and got the **** out. Also, there was the the chicken fight",
            "start": 730.12
        },
        {
            "text": "pretty sure he had no idea what was flowing. You know, time walked in, just smile, slicked his hair back. But as soon I was like, give me a check and got the **** out. Also, there was the the chicken fight between Statham and Vin Diesel when they drove their cars towards each other, jumped out and **** beat the hell out of each other. Call back to his uh his his wrench beating. Was that the one where they took down the the parking structure where The Rock took down a **** Gatling gun? Many guns. Like, yeah, Gatling gun to take down Eight. Like what was that? A spaceship takes out a helicopter. Fate of the Furious. I'm chilling out about babies are furious. And then we've gone a little bit too far. Melisandre from Game of Thrones is back from Furious 7, which I'm down for. Yep. Love her. She's bright. She's fantastic. Um, she's good to go. Hey, got a gift as a little love interest. Shout out to - man, shout out to Tej. I don't I'm not gonna say whether or not I do or do not like Fate of the Furious, but we've brought",
            "start": 781.73
        },
        {
            "text": "um, she's good to go. Hey, got a gift as a little love interest. Shout out to - man, shout out to Tej. I don't I'm not gonna say whether or not I do or do not like Fate of the Furious, but we've brought back characters from goddamn baby that nobody gives a ****. But it gave us a great scene of them on the plane, the Statham brothers putting the baby around. And with why can you brought up earlier, Statham being invited to the **** bar because right, which is god damn sacrilege. That's even Michelle Rodriguez had problems with this. That's how bad it was. She's been on the record about it, which I appreciate. Michelle Rodriguez, no post-credit scene in a **** ****. Post-cutscenes are what make this. There's no more vehicles left to drive. We do not care. I'm gonna give a shout-out to a little movie called Superman Returns because having a kid and that worked out so well for him that they were like, let's take that and let's bring it into you. Really? That's like, do you think that oh, it's just a",
            "start": 846.23
        },
        {
            "text": "called Superman Returns because having a kid and that worked out so well for him that they were like, let's take that and let's bring it into you. Really? That's like, do you think that oh, it's just a terrible idea? There's nothing fun or heroic or sexy about a **** baby. Not a baby, but then they got your name it Brian. I get him a kid, Han. It's a great plan. It's a Brian. It's right for **** sake in real life. Yeah, that's the **** shout out, bro. I guess boys played Han still float around there somewhere. Easy. Yeah, ****. They shouldn't have named the baby Brian. They should have named the baby Paul. **** Diesel spends his days thinking about his lost Han and not Brian who's living in **** Reseda. Or this kid. Can I just say one thing about Tokyo Drift? 'Cause I know we all love somebody about Tokyo Drift. When the final drift scene in which DK flips his car and the next shot is everyone cheering. Do those sick **** have any idea that you can die in a car? And they are cheering. He's fighting for",
            "start": 904.61
        },
        {
            "text": "Drift when the final drift scene in which DK flips his car and the next shot is everyone cheering. Do those sick **** have any idea that you can die in a car? And they are cheering. He's fighting for the uncle. He's bringing up his dead dad. What's worked? Yeah, uncle who's Sonny Chiba. And Sonny Chiba was a badass. He's one of the only three people in the film who's actually Japanese. Fair. All right. I met I met Brian T, the guy who played DK. And I'm bright red in the photo 'cause I'm so happy to my men about The Streamys one year. And I literally was like, I was so excited. All right, so are we ready for lists? We already frivolous. Yes. Joey Noel's charming the question. We're not including Los Bandoleros. We're not including Turbo-Charged Prelude. And we're not including Better Luck Tomorrow. All right. I know what are those? Those are so okay. Just for education to people. Thank you. There's a bridge between Fast 1 and Fast & Furious called Turbo-Charged Prelude that explains how Brian got from LA to Miami. And when I say",
            "start": 969.75
        },
        {
            "text": "are those? Those are so okay. Just for education to people. Thank you. There's a bridge between Fast 1 and Fast & Furious called Turbo-Charged Prelude that explains how Brian got from LA to Miami. And when I say that, I mean they showed a map and then they showed the little thing go turbo chart. Or Los Bandoleros takes place between Tokyo Drift and Fast 4, which explained how Han met Vin Diesel and how they met those two dudes that are in some of the movies and not others. They're not in Six. They're not in Seven. Then they're at Eight. And it's like, why do I always fights like I sharted make a point where voices for the Transformers and my Transformers - what they're like - stupid cures that were like that. If you're really dumping things down. Yes, fair enough. Yes. Okay, let's do this. And now here's the thing. Remember, we're not talking favorites. We're talking best. This is the definitive ranking cast, which changes the game. You got to keep that in mind slightly 'cause it totally James. No, none of these movies are great.",
            "start": 1020.78
        },
        {
            "text": "we're not talking favorites. We're talking best. This is the definitive ranking cast, which changes the game. You got to keep that in mind slightly 'cause it totally James. No, none of these movies are great. That's not true. We all know we love. We all know what we are. Are we ready? Yes. All right, so I'm gonna show you the top. Stop it at the bottom. Number Eight. Okay, so then you're gonna give from starting and give it one point. Then number Seven gets two points. That sort of thing. Did you understand the rules? I understand the rules, Greg. Okay, great. Drops. We go for Andy to write them a little bit bigger. Are we running out of time for that? I mean, we can make whatever you want happen, Joey. Okay, okay, okay. Are we ready? Yeah, yeah. Number Eight. Yeah, Too Fast Too Furious. Easily the worst phone in the franchise. Do we all agree? No, I'm gonna agree with you on this one because I know that Tim thinks Four is the worst. No, he's a flow monster. No, you say things, Nick. He thinks it's good about a cut. All right, Fast and",
            "start": 1071.45
        },
        {
            "text": "we all agree. No, I'm gonna agree with you on this one because I know that Tim thinks Four is the worst. No, he's a flow monster. No, you say things, Nick. He thinks it's good about a cut. All right, Fast & Furious, which is number Four, is number Seven. Got it. It's awful. Number Four, which is number Seven. Fast & Furious (4). Wait, should he be putting? Yeah, is he doing? There's a character in Fast & Furious named Roman. That's right. Number Five, right? What number Six? Who cares? I'm good over the Fate of the Furious. Oh, I put way down. It's too much. It's over the top. **** this movie. Oh, gotten too much. I am right there with her. Everyone can agree on like with the bottom three. Okay, here's where it is. The word Tokyo Drift is on your list. It can be very very telling. Shy Furious 7. Controversial. It's getting controversial. Look good. A lot of people give her credit. It was a very endearing movie. It was it was a tearjerker. It was it was a farewell to someone we loved very much. But it was not a",
            "start": 1129.36
        },
        {
            "text": "it's getting controversial. Look good. A lot of people give her credit. It was a very endearing movie. It was it was a tearjerker. It was it was a farewell to someone we loved very much. But it was not a good move. But it had the best action. Get the cars jump it out. That was it. No, the building cars. The cars parachuting out of this. Your most charismatic characters isn't a goddamn hotel room. The home. But all of his scenes are go annoying. So annoying. And the Paul Walker like off the cliff thing was also Seven. Stop and didn't come together for me. Okay, it's gonna get even more contrast. Five. Oh man. Can somebody do me a goddamn favor? Go back and listen to all the turned with everybody like it actually being fun action movie. I completely agree with that. But it's just I have other movies ahead of it. Fast Five is there. Okay, then still a good movie. Still a great movie. I just don't what I think about the ones I want to go back and watch. It's not in my top three. Wow. I bet you could find a quote of Nick",
            "start": 1211.29
        },
        {
            "text": "Five is there. Okay, then still a good movie. Still a great movie. I just don't what I think about the ones I want to go back and watch. It's not in my top three. Wow. I bet you could find a quote of Nick saying the exact opposite of everything else. Like no one gives a **** about the 16 games that come before the **** Super Bowl. You're right. You're exactly. Thank you. Fast Five features one of the best ad-libs of the whole series, which is when The Rock comes up and everybody he says, \"You better hide your baby oil.\" And then The Rock ad-libbed, \"You better provide that big-ass forehead.\" And Ludacris choke times beer. An actual ad lib. I love that. Fast & Furious 6. Yeah, we're getting now. It's splitting up, isn't it? Followed up by The Fast and the Furious. Started at all. Absolutely. Under the the 18-wheelers. Hadn't we'd never seen anything like it. I was sad when the kid who smoked pot, the engineer, died. I feel like and then obviously Tokyo Drift. I love you. I love you so much. But again, Tokyo Drift,",
            "start": 1276.64
        },
        {
            "text": "hadn't we'd never seen anything like it. I was sad when the kid who smoked pot, the engineer, died. I feel like and then obviously Tokyo Drift. I love you. I love you so much. But again, Tokyo Drift, my favorite ball. I can't say it's the best choice. It's I think as a standalone film, yes, it is. It is a great. It is a like is when you're talking just raw story beats that it hits all of them better than any other films in the franchise. I feel like honestly, it's not relying on huge ridiculous stunts. What am I thinking? Three words. Zachary Ty Bryan. I understand when you make the kid from Home Improvement is the bad guy. I'm sorry. I wish I had Jonathan Taylor Thomas thought it. No, because I would've been **** amazed. Or what? I understand the beginning is it. We're gonna call that a vignette of that movie. It's like my favorite thing about Tokyo Drift is that it doesn't rely on submarines or warheads. These things people actually do. People can actually drift if they're actual. And it came back to actual",
            "start": 1333.34
        },
        {
            "text": "it's like my favorite thing about Tokyo Drift is that it doesn't rely on submarines or warheads. These things people actually do. People can actually drift if they're actual. And it came back to actual racing and actual driving trials as opposed to - submarines. Yeah, that's a good lot. Great list. But it's a good list. There's a couple points that you made that I really agree with. But then there's just some things I think we just fundamentally disagreed on. That's I got it. I totally gather. Nick, I'm up next. Okay, so we we you got me all the way until the top of three choices. Okay, so what? Same three in the top three, but they're just there. We have a same three, but we have different. I don't put that far off one another, right? I think right. Oh, yeah. So I have bottom. I list two, four, eight, seven. Yeah, there you go. Okay, don't cry. Uh, Five. Now again, I like Five a lot. And I think Five was a good turning point for the series. But I feel like they I feel like Six took it up a notch. And Six to me in this well",
            "start": 1393.75
        },
        {
            "text": "you go okay don't cry uh Fast Five now again I like Fast Five a lot and I think Fast Five was a good turning point for the series but I feel like they I feel like Fast & Furious 6 took it up a notch and Fast & Furious 6 to me in this well let me you know let me just go and keep one where I'm sorry apologize at the number three spot Tokyo Drift love Tokyo Drift love it as a standalone movie but it's too far removed from it for the Majesty that is the rest of the series for it to be number two or number one now Tim here's where you and I are gonna diverge Buckingham my friend don't do it Nick I got a do it don't do it the number two spot goes to Fast & Furious 6 I see and I'm gonna tell you why so mom I'm gonna tell you what our definitive ranking of the Fast and Furious is the first one is gonna be high this is bull tell you I'm gonna tell you why right now Fast & Furious 6 I feel like and again the strong argument can be made for Fast & Furious 6 being number one Fast & Furious 6 did took everything that the series was and just went boom we're gonna perfect it it doesn't get",
            "start": 1457.05
        },
        {
            "text": "why right now Fast & Furious 6 I feel like and again the strong argument can be made for Fast & Furious 6 being number one Fast & Furious 6 did took everything that the series was and just went boom we're gonna perfect it it doesn't get better than Fast & Furious 6 I don't think they're ever gonna I don't think they're ever in a climax Fast & Furious 6 as far as like the action set-pieces the fifty five **** mile long runway yeah the fact that like all that were happening all the **** Star Wars action that was like on five different ways alibi Gisele dying that that emotional moment upon great but it was it was when they went back to the Tokyo we see we see uh what's-his-name Lucas Black of the his name um so I love Fast & Furious 6 I love what Fast & Furious 6 did I think Fast & Furious 6 had I think Fast & Furious 6 had the most court best choreographed action everything just hit on all cylinders for me but I still hold boom that you don't get there without the majesty that is number one and I think number one has o Super Mario Bros. is the best Mario game I used to smoke and reefer I",
            "start": 1508.32
        },
        {
            "text": "for me but I still hold boom that you don't get there without the majesty that is number one and I think number one has o Super Mario Bros. is the best Mario game I used to smoke and reefer I think that I love I when I go back are you a truant officer 1956 but I I here's think I love one so much because I think one it's perfect in its purity right it is the mood it's just it's the most raw, purest form Fast it's uncut cocaine the Fast and Furious right we're get it really is about the racing it's about that culture it's about the you know the modified like Japanese racing cars all that stuff and that in in that world of a street racing some would argue that it's not the most pure Fast and Furious movie because Fast and Furious is about one thing Nick what is that family and what do we meet in that family and how it becomes a part of that family is there a barbecue at the end of that movie there is but the family the we family hum is barbecue at the end of that movie oh well maybe",
            "start": 1553.68
        },
        {
            "text": "meet in that family and how it becomes a part of that family is there a barbecue at the end of that movie there is but the family the we family hum is barbecue at the end of that movie oh well maybe have one absolute to say grace doesn't he let him go what he does go but it's not like the end end okay hi I go back and watch one every so often right and I'm like this is a good movie it is I love I just there's something so nostalgic Lee like perfect about that movie it's a sign of the times I mean I think there if I remember correctly they're still in like DVD players there's some **** in that like TV VCR yeah yeah like they weren't fighting the the best crime on if I think no there was no earth-shattering like MacGuffin that was real go over every it was real it was real it was just a this is a small little story and it was about Brotherhood and I like that which I would argue is why Tokyo Drift is such a good film because again you're not trying to end the world I enjoy both of them",
            "start": 1604.04
        },
        {
            "text": "is a small little story and it was about Brotherhood and I like that which I would argue is why Tokyo Drift is such a good film because again you're not trying to end the world I enjoy both of them I'm actually happy with your list I'm okay my my top three are not so set in stone that I can't see that there is another way to order them I appreciate that alright first Tim would you like to come with your budget I would love you say you haven't even heard it bottom of the list is 2 Fast 2 Furious yeah I'm hungry next up we all worries Cory next up is The Fate of the Furious oh wow I can't believe The Fate of the Furious was so I thought The Fate of the Furious would be controversial for as good as any of the modern ones I was covered the thing I want to make clear about The Fate of the Furious is that yeah one inch whoa bro dude it's a great movie but I mean the other ones that was my fourth one The Fast and the Furious is my fourth I'm gonna tell you I'm gonna tell you one thing right now okay and this something you need to take with you you're taking office today you didn't even",
            "start": 1657.59
        },
        {
            "text": "was my fourth The Fast and the Furious two three The Fast and the Furious is my fourth I'm gonna tell you I'm gonna tell you one thing right now okay and this something you need to take with you you're taking office today you didn't even know what nitrous oxide was before The Fast and the Furious my friends true is true yeah before that I just thought what you turned this no I don't know what the **** it did I know you can put that your car boom I'm serious about that **** that's what I'm saying to me Fast and Furious is the over-the-top **** now while you're talking about about the standalone it's a smaller story yeah obviously next up is Tokyo Drift it is a great story my favorite right next up Fast & Furious 6 oh man I love Fast & Furious 6 love it to death wait where's I'm sorry I'm lost on your list where is Fast & Furious 6 number three number three Fast & Furious 6 yeah number three is Fast & Furious 6 we have a tie three ways right number seven or whatever the next one is Furious 7 so number so because I say it best Furious movie is Furious 7 because it is cheating a little bit because of Paul Walker",
            "start": 1723.08
        },
        {
            "text": "Fast & Furious 6 we have a tie three ways right number seven or whatever the next one is Furious 7 so number so because I say it best Furious movie is Furious 7 because it is cheating a little bit because of Paul Walker and that whole scene which I'll give it that and yeah there's a lot of problems with the writing and the plot because they had to ride around and edit around all that however I do believe that it is the most Fast & Furious movie the action scenes everything about it the stupid engine is the one over in his grave right now that he's like he's not on film better than his well that number one Fast Five Wow okay that's fair Wow so you're gonna get Fast Five mm-hmm I don't know I can't give her his lowest answer to number one I knew they spend the entire movie training to rob a **** thing and we don't want them they don't even do it hold it we got fifty you **** like feels like 50 minutes then trying to run this stupid **** race course and then you're like you don't always should",
            "start": 1780.14
        },
        {
            "text": "and we don't want them they don't even do it hold it we got fifty you **** like feels like 50 minutes then trying to run this stupid **** race course and then you're like you don't always should do instead just go get the vault and drag and drift at Han who taught the amount of drift it was a beautiful money that's that movie that has the scene of all of them no matter what happens the most important thing laws through the people in this room right here right now he says that **** every **** time that was the first family at family now we're number two on the list number three Tim giggle all right Greg do you have a list yeah okay why does everyone think I hate the Fast and Furious yeah I just thought because you were seven and Andy I didn't know he I'm not so I just want a TV part of a conversation Nick again was trying to get me off this f this topic to bring in Andy for because Andy actually cares watch all these movies multiple times Virgin America tiny true you watch",
            "start": 1830.78
        },
        {
            "text": "of a conversation Nick again was trying to get me off this f this topic to bring in Andy for because Andy actually cares watch all these movies multiple times Virgin America tiny true you watch Fast & Furious 6 on a Virgin America airplane Greg see the post-credits scene do you have to do because there's only anyway time you're about to **** up no I don't know why I went last but you guys gave me a lot of power here we go question yeah because this is the definitive Kinda Funny ranking this means that me and Kevin and Andy and Cool Greg get a say in this as well not Cool Greg because she hasn't seen them all they're all get to that point we have to have a conversation cuz I never saw Fast 8 what so that's unrighteous no you guys what I went and I wouldn't hang out with The Walking Dead cast ranking if I haven't seen them I should be penalized one way or another should it be that I don't get to give out as many points for my number one or I don't give out any points for",
            "start": 1878.51
        },
        {
            "text": "Dead cast ranking if I haven't seen them I should be penalized one way or another should it be that I don't get to give out as many points for my number one or I don't give out any points for what would be my last choice I've brought it the table this works though I think I think we have to rank it somewhere and it has to be dead last and you're listening cuz you haven't seen it no interesting well I mean this the whole reason I didn't see this movie first you can't be like this is about know it goes against I the him coming to the barbecue is **** this is the **** tricks I'm gonna be honest and when we do this rank it's gonna go all red and someone's gonna put a **** asterisk by but like it doesn't count because Greg hasn't seen it I just feel like Andy's list should sub in for Greg's too bad it's not called The GameOverGreggy Show you bend over Andy alright then give Furious 8 or whatever yeah that's The Fate of the Furious right hey man no I don't want to play it this way but you guys",
            "start": 1929.93
        },
        {
            "text": "one point I'm happy with that I'm totally good I then my first one that I hate the most is 2 Fast 2 Furious we hungry you've got my respect back then it's a Fast and Furious, sir you had my curiosity and then Fast & Furious 6 sorry no watch it no you didn't watch the end I did a groan from Joey over the peanut gallery sorry sorry guys ah we then moved to Tokyo Drift Wow we then we then moved to Fast Five Wow that's right the mother **** The Rock Wonder Woman is good oh yeah then The Fast and the Furious okay you're about to give the family breaks one is it's a great flick great here's my problem you were inside a womb when that movie came out I was inside an AMC theater watching it let's take Star Wars right let's say I'm sorry to know if I don't mind do you think we're on",
            "start": 1971.51
        },
        {
            "text": "here's my problem you were inside a womb when that movie came out I was inside an AMC theater watching it let's take Star Wars right let's say I'm sorry to know if I don't mind do you think we're on the same steps away Rogue One's great it's a better movie than A New Hope right but you can't give you can't rank it above A New Hope you just can't do that then it's not a better movie Nick you can't A New Hope is better because it was the original because it did everything that everything else is based off of but that's when you're talking about better that's the like literally not the definition of my you said not as revolutionary I'd rather go back to Furious 7 I like Furious 7 Furious 7's probably like it's it's a more pleasurable fun we'd watch what you said when we started this off which one is the is like the movie like the ranked movie like better the best yeah yeah the best then my number one pick is Furious 7 and I feel like that's where I need to stop with the franchise and it's other than the",
            "start": 2038.26
        },
        {
            "text": "the movie like the ranked movie like better the best yeah yeah the best then my number one pick is Furious 7 and I feel like that's where I need to stop with the franchise and it's other than the reason I don't want to watch it because it was the perfect ending and we don't need to go back into anything else I don't need to see Jason Statham at the table saying it's me Oh what that's the thing for many of you urine that you were in Vince's car where the road just kept going I was in Brian's car I went over there I'm over there with Brian Brian is what Sloan from Entourage see what she's Joey make you a list right now when you do this get Mikey I'm gonna read Kevin's list all right we're reading Kevin's list you want to stop okay sure oh you know abacus out yeah sure okay so starting at this is Kevin's list or as read by Nick Scarpino are Kevin's list do you wanna read your list do you want me to read it okay Kevin's list starting at the end number five here's why did you just take this",
            "start": 2077.26
        },
        {
            "text": "is Kevin's list or as read by Nick Scarpino are Kevin's list do you wanna read your list do you want me to read it okay Kevin's list starting at the end number five here's why did you just take this back don't don't write which ones wish just write your list starting from one all the ways that Chad, Joey, worse moving the series yes to the Fast and Furious there's no other answer no we hate at some point I think Tyrese just stopped acting the movie he was like a hair like write it into the script people comment on Twitter and YouTube all the time like choose one of the better is that you're **** crazy blessing I'm located you **** piece of **** alright a cyst though did you know that that Steve Aoki's sister I did not know that but he was what I love is how amazing Ludacris's career went from running illegal wave race fight like fight like braces to then being like a satellite genius and a computer programmer really fascinating if only they hadn't killed off the original genius at computers",
            "start": 2126.03
        },
        {
            "text": "illegal wave race fight like fight like braces to then being like a satellite genius and a computer programmer really fascinating if only they hadn't killed off the original genius at computers in the first film which one was that Conrad I got a smoke pot he had a **** jet he wasn't here next we racing for pink slips okay then we have The Fate of the Furious this is joking at the bottom for you all right the bottom the bottom four are confirmed or three list the bottom good all right I can't forgive brawn yeah okay okay never forget all so let's just call a spade a spade didn't Dominic Toretto turning on his family there's no plot device that can make that make sense we've been literally through hell together over the last 15 years I can't believe you I would say Charlize Theron deserves better also just let me say that okay are those dreads dreads she hurt mmm his number as number seven do you think that that was her choice to wear that way no way that is the makeup who she spurns. Number seven",
            "start": 2208.92
        },
        {
            "text": "just let me say that okay are those dreads dreads she hurt mmm his number as Furious 7 do you think that that was her choice to wear that way no way that is the makeup who she spurns Furious 7 Furious 7's next Furious 7 as the fourth get four points sorry one, two yeah Furious 7 to go for I'm confused by all of this I have no idea of his math is correct next movie The Fast and the Furious. Why Fast and Furious and that is ranked so wrong that's that's brutal that's it that's a choice rounding out the top three Tokyo Drift now I again I think Tokyo Drift belongs on the top it warms my heart to hear Tokyo Drift alright I'm okay that next movie number two wait Fast & Furious 6 okay in the second slot Fast & Furious 6 and her top is Fast Five that's running on number one Kevin what a list what a goddamn list Joey okay got it it does okay what last number two then Kevin's for I think we'd all agree those the lot those that died I think it's been universal unless Andy **** it up for everyone no good then Fast Five should be ashamed of",
            "start": 2266.07
        },
        {
            "text": "okay what last number two then Kevin's for I think we'd all agree those the lot those that died I think it's been universal unless Andy **** it up for everyone no good then Fast Five should be ashamed of your saddle then very low on his list much lower than it should be the original Fast and Furious Wow no Kev heartbreaking a tunafish number The Fate of the Furious the Corona popping into the top three Tokyo Drift is next like dad's gonna be fine Tokyo Drift's been in that spy like in those last two spots Wow Furious 7 is the next one and then Fast & Furious 6 is his number one spot respectable now I can respect that your number one spot I can respect ah this right here is **** we're number one ranked but you know Tokyo Drift in Fast & Furious 6 as long as Tokyo Drift in Fast & Furious 6 make it to the top three I'm fine I'm okay with that not Andy you better throw a wrench in your **** career son what's your body this is your career worse is of course 2 Fast 2 Furious it's an old movie it's **** terribly acted it's important to note everyone at",
            "start": 2336.89
        },
        {
            "text": "better throw a wrench in your **** career son what's your body this is your career worse is of course 2 Fast 2 Furious it's an old movie it's **** terribly acted it's important to note everyone at home Andy Cortez had never seen any of these movies I'd see most of The Fast and the Furious as a kid because that's how I got into it used to be done right you watched all of them six months ago so you weren't a part you weren't a part of the family until six months if that gives in perspective if that gives in the wrong for spent three months ago yeah that's like the best this is the kind of **** that makes people think Phantom Menace is a good film four points goes to Tokyo Drift Andy that's a bad let's go just one or is this just the longest I let alone goes to Furious 8, The Fate of the Furious well it doesn't matter Fast and Furious can make another part memory I'm doing six points for Fast Five hell yeah you are rounding out the top two one two three four five six seven eight Furious 7 got that and then Fast & Furious 6 gets",
            "start": 2399.32
        },
        {
            "text": "Fast and Furious can make another part memory I'm doing six points for Fast Five hell yeah you are rounding out the top two one two three four five six seven eight Furious 7 got that and then Fast & Furious 6 gets the eight point Fast & Furious 6 is my favorite Fast & Furious 6 whew this is tense mm-hmm I cannot believe what's available will do what they calling Vamp okay sure while it's Blessing oh right I want to know yeah I'm not gonna tell the kids mommy does the man I'd always playing into a bit and you **** stepped it into the ground The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bringing a random top a discussion for your amusement if you like dad head over to Patreon.com/KindaFunny where every dollar helps us be better than the last we don't get those dollars will go back and be bad meat babies if you don't want to see children now like Kevin would look at you you would **** over here put a baby the sous-vide machine bet if there's a country or as",
            "start": 2470.07
        },
        {
            "text": "will go back and be bad meat babies if you don't want to see children now like Kevin would look at you you would **** over here put a baby the sous-vide machine bet if there's a country or as little de baby it's kind of like you know what you can go over to YouTube.com/KindaFunny get the show broken up by topic we talked about Sabich day by day until it goes up is one big video an mp3 the following Friday how do we do start at the bottom sure bottom of the list of course 2 Fast 2 Furious with eight points the next one is Fast & Furious (4) with 16 points third worst movie now are we calling them worse at this point our weekly play okay the third bottom third on the list is Furious 8 with points yeah we fourth worst movie that's being you is The Fast and the Furious with 36 so far this is my list this is a fat load of **** that is so bad okay next on the list is Tokyo Drift with 40 the following one is Fast Five with 41 points damn followed by Fast and",
            "start": 2539.59
        },
        {
            "text": "one with 36 so far this is my list this is a fat load of **** that is so bad okay next on the list is Tokyo Drift with 40 the following one is Fast Five with 41 points damn followed by Furious 7 with 4 points and Fast & Furious 6 with 46 points Fast & Furious 6 is the winner if this list for a national anthem I'd be taking a knee as it gets it is valid with Fast Five and Fast & Furious 6 which I am protesting this list let us know in the comments what your list is and why Need for Speed is a better movie than any of these Meg thanks so much for joining us everybody follow her Patreon.com/MegTurney Instagram don't follow in real life and until next time know it's been a pleasure sir I think there's actually like debate on whether or not the math wait is the math wrong thanks for watching The GameOverGreggy Show everybody click here to go to Patreon.com/KindaFunny and click here to see a video of a very very young Andy Cortez we don't have that video is just the other content of ours Kinda Funny",
            "start": 2603.84
        }
    ]
}