{
    "id": 2898,
    "video_id": "eGGmXSfyLIY",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "The Last Jedi is The Empire Strikes Back  - Kinda Funny Morning Show 08.10.17",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/morning\n\nThanks to naturebox for sponsoring this episode. Go to http://www.naturebox.com/MORNING\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502398232,
    "duration": 2862,
    "transcript_chunks": [
        {
            "text": "what I don't know I don't know why he makes any of these decisions to be perfectly honest I dare say before his bachelor party he could just waited two days and been totally fine but now he's gonna get carded everywhere he goes because he looks like a 14 year old girl I just want that out there I'm just putting that out it's bad it's not good but anyway I can say about it is f***ing feeling we will be swimming, Kevin, to the set what the f***? Hey, I can't see what it looks like but why what goes through your head when you think these things? Not not a lot, not a lot. I I did not expect Nick to be this upset about it. I love how come what do you had when he called up the bachelor party? Oh right, he's like where am I? See, here's the thing, you said we're about to take a lot of pictures. Are we really? The best parties usually get to places you don't change. I'll take at least three pictures. I will need three pictures. We'll take pictures, we'll take pictures like of us partying and doing that stuff.",
            "start": 1.15
        },
        {
            "text": "the best parties usually get to places you don't change. I'll take at least three pictures. I will need three pictures. We'll take pictures, we'll take pictures like of us partying and doing that stuff where I can take pictures when we go to the the f***ing drug den and do heroin together for the first time all three of us and there's luck in what you do here without me. Of course, you son of a b****. Everybody got a haircut. Oh my God. Oh yeah, how's your hair, guys? We got a plan we can plan. I don't want I want to look slick this weekend. Okay, I heard you tonight because I got it. I have no phone. We complying and he doesn't have friends. The dame doesn't believe in friendship. No, it would have been way cooler if like this person that you're going to the wedding that you never see but usually you didn't go to that person's whatever when you hung out with us. You, Kevin, looks like a villain in a crime movie. No, he looks like the victim in a crime movie. It looks like the person is a very beginning of Law & Order.",
            "start": 63.63
        },
        {
            "text": "to that person's whatever when you hung out with us. You, Kevin, looks like a villain in a crime movie. No, he looks like the victim in a crime movie. It looks like the person is a very beginning of Law & Order SVU that's like a butt naked on a bed. Why there? I've done that before. Why do I think that you can't touch me on purpose? I did not. I just I took go to come come. You look like the brother of a gang member in a drug movie with Edward James Olmos where you're like the innocent one. You're like, \"We can't be doing this, Johnny. Here Leahy's when I die.\" You know, music, Charlie, if it can't be good in the something and also at the end Paco dies and there's a call. We love Paco. Yeah, but it was like it was the worst. There you go, there he goes. I love you, Kevin. Hi, Kevin. Huh. Welcome everybody to the Kinda Funny Morning Show. Yeah, if you're if you're at home, Kevin, shades beard everything tonight. Yes, or if you're one of the podcast listeners, my apologies. Kevin, you for no really, you got an",
            "start": 109.91
        },
        {
            "text": "Kinda Funny Morning Show. Yeah, if you're if you're at home, Kevin, shades beard everything tonight. Yes, or if you're one of the podcast listeners, my apologies. Kevin, you for no really, you got an Instagram or this. I don't wait for you out back is my defending it. It looks terrible about it. Well, you need to watch, you need to see. This is something you need to see with your own. I just imagine Kevin look, just imagine Greg with a finished or with longer hair and you, guy, Kevin. There you go, there you go, there it is. Look, I hope now he didn't know. The Kinda Funny Morning Show comes to each and every day at 11:00 AM Pacific Time, Monday through Friday here at twitch.tv/kindafunnygames, bringing you all the nerdy news we want to talk about that you need to know, that anyone needs to know, or just s*** we like. It's super fun. If you can't watch live, you can get this on YouTube, of course, posted every day to youtube.com/kindafunny and we also post it as a podcast audio only to podcast",
            "start": 153.14
        },
        {
            "text": "s*** we like. It's super fun. If you can't watch live, you can get this on YouTube, of course, posted every day to youtube.com/kindafunny and we also post it as a podcast audio only to podcast services around the world. So get us there, go there, rate us, give us a nice rating even if you don't like it, like what the hell was a podcast? I know what the title of it is. I just watched it, right? Well, here quick, be in the chat, maybe give us a subscription at the logo next your name. Cool prizes, win everything. You get to talk to us, right? That player games with us. You have Amazon Prime, you have Twitch Prime, why not steal that money from Amazon? Give it to us. Remember, each every 30 days you have to use it or you lose it. We'll read your tips and subs as they come in. Goobles keeping things. Kinda Funny Live 3 is live. It's been live for everyone probably enjoy. Not that that housekeeping you want to do that. It's your turn, son. I know we're going to we're going to sunset but it's over, it's over. I'm",
            "start": 191.66
        },
        {
            "text": "Kinda Funny Live 3 is live. It's been live for everyone probably enjoy. Not that that housekeeping you want to do that. It's your turn, son. I know we're going to we're going to sunset but it's over, it's over. I'm going to bring up another housekeeping note though. Joey, can you bring up that Twitter feed a little bit right there under housekeeping? There's a Twitter URL. You could bring that up. That needs to be brought up apparently. Scooch it over for me. There it is, there it is, there it is. Let's take a look at Bad Big Ol' Kev's says, \"I weigh 188 pounds this morning. I have been eating better for 53 days. Four pounds away from my goal.\" Let's see how much. Don't clap for him, dammit. I can lose now. I was good at clap for him until he pulled this stunt and now the beard clearly really helped get. I mean, I was even the beard took. We didn't think that there's a lot of weight in his like very prepubescent weird scraggly beard but it turns out there was a lot in it. Kevin, how much of",
            "start": 231.31
        },
        {
            "text": "helped get. I mean, I was even the beard took. We didn't think that there's a lot of weight in his like very prepubescent weird scraggly beard but it turns out there was a lot in it. Kevin, how much of the beard do you think is attributing to your weight loss? How much weigh, how much even the beard took off pound wise? Because you're 180. We're looking at your Twitter media with how much money or how much weight you are. How much money, huh? I don't know, a fair amount cuz it was doing a lot of hair. It was a lot like it was a lot more work than I thought it would be about your home. Oh right there, didn't it? See, for me, I think the very good thing about it. I think it would look fun. It would look fine. I it's going to be obviously if your hair is no matter what we've told you for so long with it here and your hair is short. I think we'd play this better. Yeah, that is better. Make the why that's better. I just think it's fine. I just got to get used and we will come here tomorrow. You",
            "start": 275.21
        },
        {
            "text": "here and your hair is short. I think we'd play this better. Yeah, that is better. Make the why that's better. I just think it's fine. I just got to get used and we will come here tomorrow. You gonna cut your hair? That's what I don't see if you guys want me to do it all. No, I think you're not doing that hair anymore, right? This is the chess game we're playing with Paola, is it not? That's the thing is it's not like games or who follows because Paola basically Paola wanted this then she got it like as a bad pal right away. I want all right, let's get off this. She doesn't belong here either. I feel like we want to do the hair. There's no way out of it. There's no man. Yeah, the problem is you're out here, little angel. You're giving up all of your power in this relationship one by one and that's good because that's marriage. Just give everyone whatever she wants. You're going to find out eventually and drinking and again improving in little follow-on to you know, giving them the hot s***. It is a",
            "start": 319.43
        },
        {
            "text": "because that's marriage. Just give everyone whatever she wants. You're going to find out eventually and drinking and again improving in little follow-on to you know, giving them the hot s***. It is a hot s***, Jay, a lot of fun. You're welcome. I know you said all this up. I don't know. Okay, in top Terraria, lol, she tried talking to me and I was just yak yak yak about barbecue and I got things to do. American City isn't going to build itself. It's City Skylines. Are you sure you're not tearing down the city? You don't know and your brand. Are you really and your branding? You Batman of the Joker. Which one of you? Which one? I of course, come on. You don't know, you don't know me. You're the Joker. You're the best. You want a feeling, burn. Speaking of things that are burning, yeah, DC Universe, DC Extended Universe, would look like they're calling it now. Turns out all that water is making Aquaman super complicated as values from The Hollywood Reporter director James Wan revealed details of this highly technical",
            "start": 365.44
        },
        {
            "text": "would look like they're calling it now. Turns out all that water is making Aquaman super complicated as values from The Hollywood Reporter director James Wan revealed details of this highly technical challenge, challenging a DC movie and how he ended up casting Dolph Lundgren. There's a couple different parts of the story. Not much here other than, hey, it's really hard to shoot underwater. An issue for an issue. So it's not in complaining, he's just stating the obvious. Basically saying that's very cool, Trey, quick blurb article. It's a very technically challenging shoot to be on set. One, as he was shuttle B being shuttled the film's Australia set, working with water and even the dry for wet sequences are very complex. Our equivalent of two people sitting around chatting in the underwater world. It's super complicated. You have to think about CG with the hair and how their clothing moves, how they are floating, what kind of rig we put them in and all that stuff. Yeah, that's just him stating, hey, I'm",
            "start": 424.11
        },
        {
            "text": "super complicated. You have to think about CG with the hair and how their clothing moves, how they are floating, what kind of rig we put them in and all that stuff. Yeah, that's just him stating, hey, I'm interviewed about my movie. Let me tell you that is hard. It's like, \"Hi, DJ, now long Hollywood Reporter talk about Joey, Esther, Ziva.\" More more importantly, speaking of the waterlog shoot last month, video star Dolph Lundgren's practicing underwater senses. You see these? No, don't wonder in a huge part of this movie, job. Yeah, and and rightfully so. Well, the huger is just in the movie. You just joke and went on it. I have no idea. He plays a the King, right? King Nereus says, \"When I was processing, I was the process right in this character at the King Nereus in the world of my command.\" A friend of mine, director Mike, is working with Dolph on one of his films and Michael is just raving about how great Dolph was, said Wan. And I thought, \"Oh my God, Dolph would be great for this role as well.\" So it kind of came about from",
            "start": 470.89
        },
        {
            "text": "working with Dolph on one of his films and Michael is just raving about how great Dolph was, said Wan. And I thought, \"Oh my God, Dolph would be great for this role as well.\" So it kind of came about from that roundabout way. So basically he was just like, \"Hey, Dolph Lundgren would be cool for this.\" And it's like, you know, it, sure, why not? Yeah, look, we all know a revitalization. Do we know people in these movies that could be like, you know, what would be a great villain for Captain America next? Are people I would be super short. I have to be one of those smart phones, right? Because no one's going to believe that I can actually technically take down Cap in general. I got to be the Riddler to his Batman. Sure, I can't be f***ing Bane. So I can help. Oh, I'll call you the General. Oh, Kollar should. Oh, good general services. Anyway, so that was kind of cool that he was like, you know, Dolph Lundgren would be cool for this and now Dolph Lundgren is back in the world. Like I haven't seen Dolph Lundgren and you haven't seen him",
            "start": 510.42
        },
        {
            "text": "services. Anyway, so that was kind of cool that he was like, you know, Dolph Lundgren would be cool for this and now Dolph Lundgren is back in the world. Like I haven't seen Dolph Lundgren and you haven't seen him really headline something since probably Rocky 4. He's not headlining this either. Well, me, but he is he's going to be a main character in this which is grandma is great. If you think you're not gonna be on the poster for sure, but you might be. I mean, if it's a poster like a Thor Ragnarok, they got everybody on there. They gotta be excellently. I just think it's cool that Dolph getting its comeuppance finally, finally. Should it be Rocky and Rocky 4 putting that out there? Wow. Should it be about your country? You're going to get your country. Well, you know what? Pretty sure we're PG-13. Also pretty sure what part of Russia already. Make sure we are not sure. Doesn't sound right. Next story. Facebook wants tons of original shows but it doesn't want to buy them. Oh great. Okay, spoilers. Yeah, there you",
            "start": 550.29
        },
        {
            "text": "sure what part of Russia already. Make sure we are not sure. Doesn't sound right. Next story. Facebook wants tons of original shows but it doesn't want to buy them. Oh great. Okay, spoilers. Yeah, there you go. Hagar, shocker. Uh, do you go to Facebook to watch episodic TV style shows? Me neither, writes we look like this Todd Spangler. No s***, it's named Spangler. Seriously enough Spangler to do. I gotta be awesome. And that's the social giant wants to change with a new Watch video tab launching this week and limited tests in the US to start with. Facebook Watch will be stocked with several hundred short form shows from slew of partners including A&E Networks, ATTN, BuzzFeed's The Try Guys, Condé Nast Entertainment. Yeah, yeah, lots of people. Myke's got a show which is great. 0 will show. Daddy Bernstein's gonna have everything to have. So that's a lot already. But Facebook wants even more. Eventually Watch will open the gates to all comers. Facebook's aim is to build something like the world's biggest collection",
            "start": 589.85
        },
        {
            "text": "have everything to have. So that's a lot already. But Facebook wants even more. Eventually Watch will open the gates to all comers. Facebook's aim is to build something like the world's biggest collection of cable access shows. You know, just like YouTube's trying to do. At the article reads, quote, \"We are what the f***? We are a platform for any creator of show,\" said Fidji Simo. It's a malfunctioning robot. Yeah, \"We are platform for any shows or shows an era that Ryan, any creator or show,\" said Fidji Simo, Facebook's VP of Product who oversees all product for video news and advertising for the moat. For most of the stuff on Watch, Facebook is not paying content providers anything in front. It will split ad revenue with minimal spots sold by Facebook's sales team. Publishers also can make money from brand branded content in their shows as long as it squares Facebook's policies. Now, what about original shows that Facebook is or not? You know, what about and it's paying to produce? Well, it is funded a handful of",
            "start": 638.75
        },
        {
            "text": "content in their shows as long as it squares Facebook's policies. Now, what about original shows that Facebook is or not? You know, what about and it's paying to produce? Well, it is funded a handful of shows including Myke's Feel Good, Returning the Favor, Condé Nast Entertainment Virtual Dating in which couples. It's finding a few shows but the effort is just a jump start Facebook Watch and to provide real examples of what's possible on the platform. According to Simo, \"The main reason we are funding them is to see the ecosystem.\" She said, \"The goal but the goal long term is absolutely the ecosystem will be creating these shows.\" What do you think? Whatever science with such a passion. I always thought, hey, you know what? We need one more video platform for creators. You know what? You can't even you can't get on your high horse about this yesterday. You're like, \"Oh, I like the idea of a Disney. I like what didn't we make.\" Yeah, you should like in another platforms. They should work together. So when I have a",
            "start": 685.76
        },
        {
            "text": "get on your high horse about this yesterday. You're like, \"Oh, I like the idea of a Disney. I like what didn't we make.\" Yeah, you should like in another platforms. They should work together. So when I have a f***ing million platform, I don't the same thing we already got at YouTube. I don't need to go see another YouTube. Facebook, if you want a Kinda Funny show on YouTube is awesome. They're on Facebook not paying. Oh, maybe where they will one day, right? Nobody paid up. That's the thing. We got to start being smart about it. We got the YouTube game late, right? We got to fit with. Are they going to not pay here and then eventually they'll pay and what? Oh, they're even established. Oh, they even say they're going to they're going to split ad revenue but they're not going to pay for shows. Get any on YouTube or Reddit. Yeah, but fair, but but at the same time, you've got a huge built-in audience there, right? If you've got like Facebook videos huge, get millions, millions of you so that they can replicate that to some",
            "start": 724.05
        },
        {
            "text": "Yeah, but fair, but but at the same time, you've got a huge built-in audience there, right? If you've got like Facebook videos huge, get millions, millions of you so that they can replicate that to some degree with this new Watch tab that could be f***ing awesome. Yeah, that's the problem there. Somebody, I Facebook's is one of the platforms they passed me by. I was cheating. I thought I was too old for it when Mizzou was one of the Facebook schools. So I didn't do it and then by the time I got into it, I didn't tell you that much. Then Twitter came around like, \"This is way better. I'm all in here.\" And then now I just never used it. I pop in there. People are messaging me, trying to talk to me, screaming. I go to Facebook every once in a while because a lot of comedians in an open-mic seem like in the scene example just go. They all use Facebook, generally. And one person actually was like, \"Hey, I'll hey, on Facebook Messenger.\" And I laugh. I was like, \"Are you serious?\" Yeah, and she was like, \"Yeah, that's yeah, I'm serious.\"",
            "start": 759.09
        },
        {
            "text": "just go. They all use Facebook, generally. And one person actually was like, \"Hey, I'll hey, on Facebook Messenger.\" And I laugh. I was like, \"Are you serious?\" Yeah, and she was like, \"Yeah, that's yeah, I'm serious.\" I'm like, \"Okay, it's like it now I have to start paying attention.\" Right? Well, sure. And it's annoying because the Facebook UI, it's so much. Yeah, there's a lot that she had every reason you get. I click on a tab and I like, \"Wow, that wait, am I buying something? What does what the f*** is this tab for Facebook?\" Right? I don't really understand how groups work versus normal pages. The newsfeed is always just a hodgepodge of people complain about their s*** day. It's too much for me. Johnny, well, should we start putting all our stuff on Facebook too? Is that a thing we should be doing? I want to do different stuff on things that not a normal guy. You know, like more work though. And you say you want to that we don't do it. So I mean like, should we just start putting the breakouts up on the Facebook as well? Leave it.",
            "start": 794.58
        },
        {
            "text": "things that not a normal guy. You know, like more work though. And you say you want to that we don't do it. So I mean like, should we just start putting the breakouts up on the Facebook as well? Leave it. No, I mean like, God, episode whatever part one on Facebook. Enjoy, suckers. You got a Watch tab. Here you go. My mom is watching in great living, watching from heaven. That's feeling in my Facebook Messenger. People, anyone can message you. Anyone. It's annoying. Yes, I'll prove it. And he that's it. But it still shows up in your feed. Not like 400 messages right now for me. Whatever, Nick, you're so popular. Well, people are like, \"Hey, I remember that thing you said about Keto. You're wrong. My God dammit. No D here.\" And, \"Oh, hey, Nick, we not notice you're ignoring our. You can come it already. How they are Kinda Funny for in common. You are going to kill. We along with your lack of knowledge. We've come to pain going to tell you. You are sitting people down a dark path. We insert back. Oh my God. Oh my God. It's terrible. So\"",
            "start": 833.04
        },
        {
            "text": "in common. You are going to kill. We along with your lack of knowledge. We've come to pain going to tell you. You are sitting people down a dark path. We insert back. Oh my God. Oh my God. It's terrible. So yeah, I don't know. I mean, that's the thing. We've talked about Facebook video a lot. Obviously, it does well for people but it's one more thing to worry about. At what point are we too saturated with all this s***? I guess is the point you're probably trying to make, right? Yeah, like at what point? I mean, I understand this is the thing that we, you know, at IGN talked about all time and we talked about all time with our community. Like you have to be normal places where these people are. Yeah, you know, I mean like IGN was for a long time weird. IGN.com, that's where we are. And then when it was they started being a Facebook content. They start making YouTube content. They started putting their stuff up Snapchat. Yeah, like immigrants a lot that happens after I leave is the fact of life. You have to go",
            "start": 877.71
        },
        {
            "text": "being a Facebook content. They start making YouTube content. They started putting their stuff up Snapchat. Yeah, like immigrants a lot that happens after I leave is the fact of life. You have to go where your audience is. You can't sit there and cling to this IGN.com. We can't sit there and cling to the idea that youtube.com/kindafunny and Kinda Funny Games, right? Like wherever isn't going to find us. If people want to consume the content on Facebook, maybe we should be put in the plaintiff. It's fair. This is fair. Let us know, let us know in the chat. You guys want that or in the comments of this video. Like, \"Hey, I'm watching this on YouTube. I f***ing hate how easy it is to watch video on YouTube. I'd really love to go to Facebook and watch video there and try to find that with some random search algorithm that we know probably doesn't work on three years.\" Or the question for Kinda Funny Games, should we all message Nick right now? And I'm probably no, you can't. You are. I don't pay attention.",
            "start": 911.7
        },
        {
            "text": "algorithm that we know probably doesn't work on three years. Or the question for Kinda Funny Games, should we all message Nick right now? And I'm probably no, you can't. You are. I don't pay attention. I'll tell you what, if anybody mess, I might get back to one of you six months from now and be like, \"F*** if you're wrong with a various dude comment. Dance for demons. It's f*** face for calling crap.\" There you go, there you go. But I think Facebook to me is one of those things where I never here, I'm with you. I never really got into it. It was always one of those, I don't know, it like it's cool. Like Myke, for instance, right? Yeah, it's a new dog. He shares it on Facebook. That's great. That's not I'm sweater. Did you see us wearing it? I think I may have seen on Twitter first. No, I thought I gave its where we are. It's just a water. Sure, please. You know, but then like Snapchat just one too far removed for me. I'm now I'm not going to figure out how to use that platform. I don't think anyone",
            "start": 944.16
        },
        {
            "text": "I gave its where we are. It's just a water. Sure, please. You know, but then like Snapchat just one too far removed for me. I'm now I'm not going to figure out how to use that platform. I don't think anyone even knows. Well, Snapchat I would have used except when I went there to do it when I was told we should do the Snapchat. Somebody already took GameOverGreggy and I was like, \"I will f*** this platform.\" I love it, man. And then ever since then I've been working against it. You've been just I got made any her side. I.E. heart. Yeah, that's too obvious. Eric H. Yeah, and he isn't working to better throw away them from the entire. And right now it's weird because his um, yeah, f***ing photos below. Hang up with Facebook, f***ing tiger. Ah, everyone wants to connect with Nick. There you go. Very God. Now that's that's f***ing annoying. Why ask whatever? It's fun and turn off. You know, I know but I need them on because that's how people communicate. You think I'm sure this is not. There's got to be a notification where you",
            "start": 983.97
        },
        {
            "text": "can just turn their already. Don't let people message me than our friends right now, right now. But it's one of the things to find that in Facebook. I guarantee it's not easy. It's hard. Fun. I guarantee it's not easy in there and everything with Nick. You know, I f***ing can't stand. Yeah, when it's a Facebook owned property, it's like, \"Hey, login with Facebook. F*** you. Let me just see the picture that I want to see. Suck a dick.\" Whoa. All I'm saying, okay, is all I'm saying, okay. My apologies. All right, stop messaging me on Facebook, people. It's annoying. Next news story. The Last Jedi. Here we go. This is that this is my headline for this, not io9 headline. The Last Jedi is pretty much just Empire Strikes Back. My areas again. Rian Johnson, right? John, adult man who could have changed it all and changed his name to be a",
            "start": 1034.04
        },
        {
            "text": "headline for this not io9 headline The Last Jedi is pretty much just Empire Strikes Back my areas again Rian Johnson right Rian Johnson, adult man who could have changed it all and changed his name to be a regular Rian but instead wants to stick with this what his **** parents cast on him like a pox that he get away right so now he is really Rian Johnson said it's fully aware The Last Jedi might sound like Empire Strikes Back and he doesn't care since James Whitbrook over on the io9 one of those popular refrains used to critique in The Force Awakens was it's pretty much just a remake up A New Hope which we all agree to and even before we got to look at The Last Jedi people are already declaring it's going to be just a remake of the Empire Strikes Back. Rian Johnson is more than happy to admit ESB's influence on the movie and thinks that in the end it doesn't really matter a quote I just tried to kind of ignore that aspect of it and have a story take shape that it needs to be but look Rey",
            "start": 1074.57
        },
        {
            "text": "ESB's influence on the movie and thinks that in the end it doesn't really matter a quote I just tried to kind of ignore that aspect of it and have a story take shape that it needs to be but look Rey is off in a remote location with a Jedi Master and the Resistance is in a tough spot. We're intercutting these stories but it's very but by its very nature there are some structural parallels but there are new characters they're dealing with and with new things and that ultimately is what defines the movie so I think it's going to be unique. Now I read that out of the article by the way out of order order because I wanted to read that quote first and I wanted to repeat the above paragraph so speaking as part of a larger piece Entertainment Weekly about Finn and Rose's journey The Last Jedi which will see a reluctance in with the starstruck Rose that aside go on a mission to a luxurious casino city of Canto Bight in the wake of trouble times for the Resistance. Johnson acknowledges that yes it",
            "start": 1119.19
        },
        {
            "text": "will see a reluctance in with the starstruck Rose that aside go on a mission to a luxurious casino city of Canto Bight in the wake of trouble times for the Resistance. Johnson acknowledges that yes it might all sound a bit like Han and Leia visiting Cloud City especially since Rey is off getting taught the Jedi ways with Yoda. Imagine the old mentor and when you put it like that that says a lot like it was a lot like Empire Strikes Back. Oh a lot like Empire Strikes Back. Ah very weird. Whose Rose? Rose I think is this new character. It's like Finn's new sidekick character character. Yeah I don't know I've really been following these too much. I watch the movie. They're two sub no spoilers there. We all sort of saw it coming with The Force Awakens and it'll still be a good movie. Everyone like before he's away and we're safe as well. I swear to Christ if they'd a story another **** Star Destroyer in the third movie. We producer, yes sir, another movie. Come on, we've rebuilt to come out against this.",
            "start": 1159.87
        },
        {
            "text": "he's away and we're safe as well. I swear to Christ if they'd a story another **** Star Destroyer in the third movie. We producer, yes sir, another movie. Come on, we've rebuilt to come out against this time. Even there's other stories to be told here. Here we go. Okay, I'm going to get out of defense training but I'm here to turn on a defense my favor. Wow, one Kevin, look a life saver. Would you get a few can pick? Wow, you go green one, I go red Kelly. Anyway, I'm going back now. You don't want to use this. You know what I want? Invisible Reds. Bad. A fire burns so hot that it's clear. If you were like, I got this guy and I know you didn't have it, turned out may walk right into it every time the fly out of rainbow on was like, God, what's America know? I don't know. To the galaxy far far heavy on Star Wars news today. Poe Dameron regional article is key component in the future of Leia's Resistance in Star Wars. The passing of Carrie Fisher puts a very sad cloud over the lease of Star Wars: The Last Jedi. It's last time",
            "start": 1200.34
        },
        {
            "text": "Poe Dameron regional article is key component in the future of Leia's Resistance in Star Wars. The passing of Carrie Fisher puts a very sad cloud over the lease of Star Wars: The Last Jedi. It's last time we'll see Fisher in her iconic General Leia role but according to a news story she's passing along some over knowledge to a fan favorite. Speaking to Entertainment Weekly, Oscar Isaac revealed that a major part of Leia's story in The Last Jedi has to do with their relationship to Poe Dameron. Quote, Poe is in some ways a surrogate son for Leia, Isaac said. Except rather son killed her father. Just don't want to know exactly know. This is like, hey, if I didn't raise you and totally **** you up and put all this magic in your head. Oh, there's ghosts everywhere and there's **** bacteria in your blood. Let's see, move ****. Let's go learn about that right. **** whatever is cool. Go to the golden degree. You know what the problem is? They're a home school. That's the problem. It is. I know right. All these",
            "start": 1252.04
        },
        {
            "text": "let's see move **** let's go learn about that right **** whatever is cool go to the golden degree you know what the problem is there a home school that's the problem it is I know right all these **** Jedi kids are home-schooled when I leave and I think socialize they all into one giant school they got murdered by Leia is dead that's fair a fair enough fair enough like it's a terrible kind of stuff that they should probably stop like it's just not having kids. Skywalker, I should probably stop having kids. I like the Trumps now at this point. They're just ruining everything they touch. No, I mean, sure, I'll follow you on this one. Yeah, yeah, it's not a comparison. I'm gonna **** walk out of there. We go to go to the next story. Well, there wasn't much more in that last story so **** it. We'll just go the next story. This I thought was pretty cool. Now Greg, as a huge fan of Star Wars, you remember the Emperor's Guards, the weather girl in red that was just Darth Vader every entire time and every when",
            "start": 1294.05
        },
        {
            "text": "go the next story. This I thought was pretty cool. Now Greg, as a huge fan of Star Wars, you remember the Emperor's Guards, the weather girl in red that was just Darth Vader every entire time and every when we were a kid you like do something cool and it is a **** thing and people walk out. Yeah, because it turns out the Emperor doesn't need a goddamn bodyguard. Sure, because he's a G. Yeah, he can do all this stuff like he have lightning that comes out of it. What the **** you gonna do? What do you do? What you gonna call someone makes Americano Italian? I would have just maybe when I was getting lifted up really slowly maybe Goldar backwards maybe money feelings is shooting in the round like you know when I was **** fighting Yoda he was no electrocuting him but I know it wasn't helping. It's like when you're a police officer and you're tasing like there's like 15 people you're gonna guy who gets tased really times and runs away still. There's like, I don't know, I don't really was not PCP. Sure, some",
            "start": 1337.23
        },
        {
            "text": "you're a police officer and you're tasing like there's like 15 people you're gonna guy who gets tased really times and runs away still. There's like, I don't know, I don't really was not PCP. Sure, some level of it. Sure. I don't think it's Darth Vader. One of them one coming through this little **** circuit board. It was all robot handle he's. You find easier to stop an agenda. Remember the part in in Short Circuit where you get to lecture fight and then shuts down for a while and I like you Ted and it's like or the part where where they were the other Terminator shove the **** thing through his heart. Yes sir, we're outta circuit. So come on back here man. No wedding day. We went for Short Circuit. Yeah, I changed my trophy 81,000. I remember. Yeah, that was awesome. Same thing with Darth Vader. He just got short-circuited. It went around and then he **** threw my things. I'm just saying this no somewhere in the Star Wars universe those two guards you're like **** with you and it sounds like something's",
            "start": 1376.2
        },
        {
            "text": "it went around and then he **** threw my things. I'm just saying this no somewhere in the Star Wars universe those two guards you're like **** with you and it sounds like something's happening is going on in there. Doesn't like being interrupted. He's screaming. I like it when we go in there. He's doing that Michael Jackson's familiar screaming. We like, yeah, that was probably Samantha laughs. Ah, you know, no, he, oh, you mean he's doing Jared Leto's Suicide Squad laughs from the officer when you film who's let's be right Kadeem the award-winning Suicide Squad. Uh, this is cool if you're into costumes at all. They're bringing back a little bit of the throwback of these guards would enter Supreme Leader Snoke personal bodyguards. Always know good to be some people theorize that he Samuel L. Jackson, no, not the way and they Mace Windu character. No, it was just a random rumor going around last week that I thought really died out. That's the case. I thought what the article I was a rumor they wanted him",
            "start": 1416.07
        },
        {
            "text": "the way and they Mace Windu character. No, it was just a random rumor going around last week that I thought really died out. That's the case. I thought what the article I was a rumor they wanted him to be Vader's dad. Vader's dad is, oh, interesting. It's he be way too old but they generate themselves the whole thing in the spy way loser. Like what did I forget to in Episode I, II, or III that they talk about him me like an immaculate conception? I was just the line in one. The mom was like, he, there was some father I raised and so you know, thank. I mean, she was a sex life. So while I was the dead water it with it. Look, it was still alive right. So why do you want to come back? There's no way they don't kill people like water. They don't kill me like water. You can inherit. You're that good. You want to know how to spin up coming to Disney Channel soon? Maz Kanata and Watto. When I'm talent it up, they start a new thing in Q7 that is like they gotta be released for a reason like say after",
            "start": 1456.63
        },
        {
            "text": "want to know how to spin up coming to Disney Channel soon? Maz Kanata and Watto. When I'm talent it up, they start a new thing in Q7 that is like they gotta be released for a reason like say after Maz Kanata's whole world blew up for a man that I guess goes to hang hang out with her college roommate. She finds out, oh my god, you've been a slave trader this whole time. Let me turn it around. Yeah, let's open up an ice cream shop. Me a question. Weird prune faces bring you back into life is strange and then it's a will they won't they thing for several seasons before it can come to kill them all. Just look at write them all out, all of them. You can see pictures here of the new bodyguards. They look pretty cool. They little more samurai style. Rian Johnson wanted them to move a little bit better so they actually will be able to fight what if a weapon move and different styles. So you can see that the helmets here a little bit different. One has a little bit more of a RoboCop to helmet and going on",
            "start": 1510.58
        },
        {
            "text": "actually will be able to fight what if a weapon move and different styles. So you can see that the helmets here a little bit different. One has a little bit more of a RoboCop to helmet and going on right here. The other one is a little bit more of a Tron helmet. So that's pretty cool. Remember the remember the bad guy RoboCop? I think was **** terrorizing Mommager. And that Greg, is it for new stories for them? Nick, I'd like to read you some tips. Please do. First off, yesterday Ignacio Rojas give us several tips in a story but did it before we went on air. Now of course we can forgive this. Ignacio Rojas has never watched this show before. I'm sorry. What? Ben's before we started it. Yeah, saying forever, huh? Knows we don't read tips before. I love it. Yellow inch punish him. Knew this was a mistake to do. Why he somehow he says it, huh? All of something. Alright, anyway, yesterday he said, may I suggest you read a manga, A Silent Voice? It's about a kid who bullied the deaf girl after the girl",
            "start": 1555.43
        },
        {
            "text": "a mistake to do. Why he somehow he says it, huh? All of something. Alright, anyway, yesterday he said, may I suggest you read a manga, A Silent Voice? It's about a kid who bullied the deaf girl. After the girl has to transfer school because of this, his friends and teachers start isolating him. Now in high school, having no friend, the kid contemplates to is that. But before he does that, he reconnects with the deaf girl and tries to atone for what he did to her, making friends along the way. I've only read two chapters but the movie is basically the same. Even the most beautiful emotional film. One of and it's the most beautiful and emotional films I've ever seen. The manga is available on Crunchyroll. If you want a better idea what the manga is about, you should watch the trailer for the movie. I thought aren't mangas comic books in animes or the animated, you know, Japanese personals? Yeah, tell source. Yep. But Crunchyroll has comic books on it. I need it seems confusing. I've never been a naughty or",
            "start": 1596.9
        },
        {
            "text": "aren't mangas comic books in animes or the animated, you know, Japanese personals? Yeah, tell source. Yep. But Crunchyroll has comic books on it. I need it seems confusing. I've never been a naughty or honest. Not not in the big confusion. Yeah, he's not a smart guy. Oh, that's not true. That's not sure. Nick is very smart. Well, the problem is he did a lot of drugs. What I that might be true. I'm not around really not a drug. We're chewing kids probably watching right now giving this little heart rolling. It's not a heartbreaking situation. We're talking about him. That's what everybody wants right. But I could call anybody out right now. Here, let me look in the chat at Skipworth11 is right here right. Skipworth11 is here and he's a pedophile but he's thrilled that I'm talking about him. He knows everyone knows we're just making this up. We are just making it more at 11:00 on Twitch is a pedophile. Melissa with the Y who always clarifies everything for us as yes Crunchyroll does in fact have manga.",
            "start": 1644.91
        },
        {
            "text": "knows we're just making this up. We are just making it more at 11:00 on Twitch is a pedophile. Melissa with the Y who always clarifies everything for us as yes Crunchyroll does in fact have manga. Thanks Lo. So I did not know that. Live people say yes there's manga on Crunchyroll. Very cool. We did not know that as we do not read very often here. I read comics all comic comics. Awesome. I don't agree. Yesterday's episode. How was Private Eye? Good. Like a Net Worth Grading. It's okay. I'll see you tomorrow. Yeah, pick up my pen tomatillo moto. It's all me. Let's go. That'd be great. Oh, D_Rocks87 France. Dear oh oh using that Euros **** like when the Saints they go paying my bachelor party tax. I'm off to Montreal to celebrate my last days as an unmarried man. Hope you boys can use this for big Kevdog celebration this weekend. Keep up the great content. Great. Thank you very much. If the healthy tip. I didn't say that. Worth pointing out of course that this is the last Morning Show of the week. There what's next?",
            "start": 1691.14
        },
        {
            "text": "this weekend. Keep up the great content. Great. Thank you very much. If the healthy tip. I didn't say that. Worth pointing out of course that this is the last Morning Show of the week. There what's next? When we do Kinda Funny Games Daily next class. Kinda Funny Games Daily week because tomorrow I'll be on a plane to Vegas. They're ready to celebrate big Kevdog's bachelor party. Joey will not be. She's giving me a thumbs down. Um, so if you want to give a bachelor party kit, pay your bachelor party tax. This is the time. The money will be funneled to Kevin through our paycheck system. MakeupLoving44 gave a Kinda said, hey all, wanted to tip is thanks for everything Kinda Funny has given us including our group Kinda Wrestling. We're coming to our first anniversary and 1,000 1,000 member. We'd like to invite Greg to be our Mr. 1K. Congratulations. This is a Facebook group right after all the **** we just talked about Facebook. You want me to log on and join? Yeah, yeah, Facebook groups are great. I'll",
            "start": 1735.82
        },
        {
            "text": "invite Greg to be our Mr. 1K. Congratulations. This is a Facebook group right after all the **** we just talked about Facebook. You want me to log on and join? Yeah, yeah, Facebook groups are great. I'll do it. Honestly, Shifter, you're going. Yeah, yeah, next week you go to **** you tournament. You're excited about that. Somehow I am excited about that. Wheel and Sunday and I thought no no you're right Thursday Thursday night. Love you. I'm joined Kinda Reveal and answer stuff. Milly's are done and we have time to go to that. Keith the GLA does look very excited. Couple eyes. Jericho's last name for crash. I'm trying to give a show going. If there's a questionnaire from there are these amazing. You got your questions are in. Next tip. I'm excited for you guys. You and cool red go to New York in SummerSlam and make cool videos. Alright, yeah, yeah. Is your beer gonna be back on it? Alright, we got it from Breanna who left no message. IvoryRavens77 tip consent. Hey guys, I absolutely adore you but that isn't the",
            "start": 1779.26
        },
        {
            "text": "make cool videos. Alright, yeah, yeah. Is your beer gonna be back on it? Alright, we got it from Breanna who left no message. IvoryRavens77 tip consent. Hey guys, I absolutely adore you but that isn't the point of this tip. I wanted to let you guys know I work for Netflix. You have any questions about Netflix, let me know. I'd be happy to answer. IvoryRavens77, why Shellshocked not on Netflix? That's the first one we've all submitted. We need you to make that happen. Go down there. This one Netflix, make that happen. Number two, apparently Netflix just throwing money people. Why don't we have some kind of, yeah, why can't I have to own it? What happens if they can put season 94 of Trailer Park Boys on Netflix? How can we can't have real question would have only finally finished on Kinda Funny Animated Series? We put that on Netflix. How does that work? Let us know. But none of these answers on there yesterday for generators. They said Jacket gave a tip and said, hey guys, Jacket here from the KFD UCM. Shout out to the",
            "start": 1833.95
        },
        {
            "text": "that on Netflix. How does that work? Let us know. But none of these answers on there yesterday for generators. They said Jacket gave a tip and said, hey guys, Jacket here from the KFD UCM. Shout out to the daddy soft loving Kinda Funny Discord members. Hashtag Bean Gate. Love long live The Senate. Now what it surprise you to know that I don't understand one word of that depth now because this is, I mean, Discord is another thing. I'll happily gotta Kinda Funny Discord group over there. They're often another universe. Have fun ever. They have another language over there. I heard The Senate fail but I heard it was a joke but I don't know. I don't you rip The Senate. Joey said rip The Senate and then did the time across which is offensive Denver. Okay, PoopyPants9 gave a tip and said, got out of work early in time to catch the show live. Here the funny clip that made me laugh. Ah, can't be on a show. Joey Doyle, how to vet fun club. MrYesMan300 tape and said, guys, do you fire Kevin and replace them with",
            "start": 1879.85
        },
        {
            "text": "in time to catch the show live. Here the funny clip that made me laugh. Ah, can't be on a show. Joey Doyle, how to vet fun club. MrYesMan300 tape and said, guys, do you fire Kevin and replace them with Steven Seagal? Also Greg, will you talk about Severance which news on Games Daily is the news that Severance on Switch because we talked about that when it happened. We're watching this clip by the way. We are a thousand percent watching this. Are ready to go. Yeah, let's do right there. We go. RubyPM9 gave us two tips both with the same fun clip and here it is. This is a clip that made them laugh. Do we have audio on this? Yes, we don't audio. It has audio opening. No choice. Isis. I think it matters. I want a hedgehog. Great. Can I get a hedgehog? Yeah, sure. I had a head. Y'all gonna really get let useless bit me. Okay, kill Jared. You smash up next. Riley, would it would quickly gone the support you please. There's actually a chance Hamed spikes the folks fur. No, no, it is not those right. Oh, why the ****",
            "start": 1922.45
        },
        {
            "text": "bit me. Okay, kill Jared. You smash up next. Riley, would it would quickly gone the support you please. There's actually a chance Hamed spikes the folks fur. No, no, it is not those right. Oh, why the **** would anyone keep that as a pet pen? They're monsters. They need a rabbit right. Did I ever like 15 seconds? That was even cool too. Gave a tip and said, alright, chance this teacher has students to teach come Monday. So I won't be able to watch live anymore but I hope to see you all in Vegas at GameStop Expo. I'll be hungover still drunk. Dude, it's weird that people tea is like a lot of people in our audience have real jobs like that where there's a sharp will for teaching children. Sure, considering how affordable we are on the show and how funny people think it is. Yeah, I think maybe they shouldn't allow that spring out. Oh, sure. Yeah, That_Master said, first time see first time w seeing the show live. Thanks for applying on Twitter Kevin. Congrats on your big day and I hope you all have an",
            "start": 1979.16
        },
        {
            "text": "that spring out. Oh, sure. Yeah, That_Master said, first time see first time w seeing the show live. Thanks for applying on Twitter Kevin. Congrats on your big day and I hope you all have an amazing weekend. Much love from our Raleigh, North Carolina. There you go. Skateboard11 as I said was a pedophile. Don't wait. Yeah, well, this is a weird confluence of faith. Greg, in just five days now, I'm heading off the University of Missouri to bring my freshman year at college as I'm gonna do alone. Do you have any advice thoughts on what I should do? Thanks Will. Well, I think you should of course join TKE. It's a great group to be crazy with and have some fun and you should go see some sporting events. I have a good time there and then just, you know, get out, see new people, meet new people. That's when I went there. You should just walk the halls knocking on doors. Hang out there big freshman year. Just no one's in there. He's open it up. Face with no head. That's great. Good smooth. I'll go to Shakespeare's.",
            "start": 2026.83
        },
        {
            "text": "went there. You should just walk the halls knocking on doors. Hang out there big freshman year. Just no one's in there. He's open it up. Face with no head. That's great. Good smooth. I'll go to Shakespeare's. Go to CJ's. When you go to CJ's, tell them I sent you but they're like, I don't know. Say I want to speak to Tim or I want to speak to Tim or no like Tim or hasn't worked here in a 15 movie. Gave a healthy $0.07 here to pay my birthday tax. I'll be turning 3 and two days. I can't believe Kevin turned babyface before the bachelor party but party hard this weekend boys. Cheers. Gonna be interesting. It was Santo Rico. I just didn't expect. I just I can only live in the moment. The thing is been Sheila not at first. I was like opposed to this right. I was like, I don't like change. I love beers. I think Kevin look great with the beard. It's come along. The smooth face is growing on me a little bit like I'll get used to eventually. But what I can't wait but I can't wait for is 48 hours of my brother seeing",
            "start": 2073.45
        },
        {
            "text": "look great with the beard. It's come along. The smooth face is growing on me a little bit like I'll get used to eventually. But what I can't wait but I can't wait for is 48 hours of my brother seeing Kevin face and all this **** is going to come out of his mouth because of it. It is going to be amazing. All right, Bobby. Okay. Oh me. Matty G said, hey Greg and Nick. For Greg, you plan on watching the Chicago Bears this football season? Also for both of you, be sure to watch Hard Knocks, the sequel to the award-winning drop a ball our dodging. Isn't amazing. I love our knock. So if I knew Dan right. Uh, yeah, I think so. Did they put Mary follow them one like in their entire run? Yeah, I I can't go far that far back anymore. Yeah, I look for that **** show looked up. I just don't care about football but you know because it's a documentary. It's sure sure like they needed a row novel. I watched I watched one season of it because I was like this is **** beautifully shot. Oh, it's amazing. The cars knob and the",
            "start": 2120.68
        },
        {
            "text": "because it's a documentary. It's sure sure like they needed a row novel. I watched I watched one season of it because I was like this is **** beautifully shot. Oh, it's amazing. The cars knob and the way they turn it around in a week. It's all it's **** rad. And then for the Bears, yeah, I'm going to watch. I'm not going to go out of my way. I don't have NFL Season Pass this year. I probably won't pick it back up. We're on the road obviously for a few the start of the season for a lot of it too. So I'll pick it up at sports bars in here and when I can and see what's going on. But I just dropped the NFL Network because I've really been use it enough to justify last year. Well, believe me how many games I catch a lot. If you get Disney streaming networks on, give ESPN for free now. Well, I have if you don't have that's not the problem. Cool. It's the fact that NFL balls deep about how they like games. They're dumb. Come on. Neil03 give the final tip for right now and says, hey guys, keep up the awesome",
            "start": 2164.12
        },
        {
            "text": "don't have that's not the problem cool it's the fact that NFL balls deep about how they like games they're dumb come on Neil 0-3 give the final tip for right now and says hey guys keep up the awesome content I'm shaving my head for St. Baldrick's to support childhood cancer research on September 3rd tell all the Kinda Funny Best Friends I'll spam this link in a chat for you mmm thank you Greg and that's it for tips right now on the show of course you guys want to give tips more later Greg will be back it's Kinda Funny Games Daily but now is the time on this show that we like to spread a little over on yeah we like to take that love off our belly and put it onto other people's bellies just like very bumpy as I love them but I'm dating to it kind of on me you want us to show you how to show my God I gotta **** flow I'm doing here right I'm gonna check in for my bachelor party flex a good I can be a bachelor party but very bad for I went to California I accomplished best friend to",
            "start": 2196.49
        },
        {
            "text": "show my God I gotta **** flow I'm doing here right I'm gonna check in for my bachelor party flex a good I can be a bachelor party but very bad for I went to California I accomplished best friend to nominate one of you out there for a second meal it's called PS I Love This Best Friend XOXO he is shouting out Alex Alex Look says I don't know Alex Love I have no idea if Alex Love is a pseudonym or if that is indeed Alex's real name however Alex is thoughtful comment on your YouTube videos deserve the shoutout he/she always let's go don't notice something Alex is not a boy he always gives detailed and well written criticism support and it's just a constant source of general positivity in an area of the community that is often a total dumpster fire I see you off and I hope others will too good job Alex Blanks Alec we appreciate that good job a very accordionists there which only Barry doing good work to Barry but apart I've seen that name a lot it's hard to miss Bum Foot that's a great",
            "start": 2237.63
        },
        {
            "text": "job Alex Blanks Alec we appreciate that good job a very accordionists there which only Barry doing good work to Barry but apart I've seen that name a lot it's hard to miss Bum Foot that's a great last name that is a last name of like a fun detective care of character in a cool like Annie Sheldon I'm Barry Bumper I know he's the killer because he's Babyface they call it a Baby Fae the Babyface Peruvian Greg it's giveaway time what if I always want every cup yeah whatever no beer girls back we'll let it go that's right now is beard yeah well you took pictures of it now is your fatal flaw ladies gentlemen uh each and every day we like to give away something likely we can grab back and give something back to viewing via a code for a game and today is no different how do you win the code of course is four different ways you can win you can enter it into wind you can be in the chat you can be a subscriber to our Twitch channel of course if you don't feel like paying five dollars and you",
            "start": 2281.71
        },
        {
            "text": "course is four different ways you can win you can enter it into wind you can be in the chat you can be a subscriber to our Twitch channel of course if you don't feel like paying five dollars and you know Amazon Prime you get one free Twitch client subscription that we'd like to go to us unfortunately you have to up that react that every month it's a pain in the ass but it really goes a long way if you don't give it to us give it to someone because it's free money and Amazon takes I'm not for your money haven't you had a net the money back from Amazon money you don't use it they keep it and use it to make drones that will one day land on your face they can tear out your teeth and you'll say why and as it flies away with all your teams will be like because you didn't support Kinda Funny there you go you can also support the two dollar above level on either of our Patreons so course KindaFunny.com excuse me Patreon.com/KindaFunny or a Patreon.com/KindaFunnyGames",
            "start": 2331.99
        },
        {
            "text": "there you go you can also support the two dollar above level on either of our Patreons so course KindaFunny.com excuse me Patreon.com/KindaFunny or a Patreon.com/KindaFunnyGames which is where today's random randomizer has picked from Jesse Dyceck has won Boss Tucker in Quatro are you going in as I said back in the day I enjoy it I think you will too so Jesse and I want to say this is dick but it spelled Dyceck has won this game day it is dick right then that's all she did Jesse a congratulations everyone else out there this in the chat we appreciate you very very much we appreciate you so much talk to you right now alright then with Moriarty three-year-old Moriarty three four on all run Gamer47 says rig the Russian hack to get jesting dick in there Jesse did Nick did you see GSP signed on to fight Michael Bisping in UFC 217 in November then has a terrible terrible idea but I will watch",
            "start": 2370.08
        },
        {
            "text": "says rig the Russian hack to get jesting dick in there Jesse did Nick did you see GSP signed on to fight Michael Bisping in UFC 217 in November then has a terrible terrible idea but I will watch the **** **** out of that fight that is going to be a great fight I guess it's a good idea then I'm really excited about it now now you're in do you know you play with Georges St-Pierre right oh yeah nearly everything GSP old-school but yeah come on back out every time it I like the current and Ian Mike that I'm like a bad idea I would like a husband one of the top fighters in the planet fighting right now with a detached retina doctor said hey I that tougher is that stupid well you don't have a left eye you can't see out of your left thigh or was right they have to put oil in the **** thing every day so like doesn't dry up and die or whatever um the doctors keep saying hey we want to reattach that but you have to quit fighting because I just got the championship don't ****",
            "start": 2418.73
        },
        {
            "text": "thing every day so like doesn't dry up and die or whatever um the doctors keep saying hey we want to reattach that but you have to quit fighting because I just got the championship don't **** yourself I'm making money he's peeling off cheddar left but what about what he can't see me well then I'll just fell fix it maybe not the money I guess to fix the I yeah as soon as he loses he'll probably stop fighting guess what he got yeah he's been brawling he's been **** on people a raccoon ferret today Greg do you read Mr. Miracle it's pretty crazy comment from the creator of the new Vision miniseries I feel wonderful what the **** of a comic and we're full of no I know if you watch yesterday which you apparently didn't you **** fake fan it on my Pick of the Week it might not be it might be why your laptop doesn't work we got to shake it to turn it on I didn't shake it to turn it on you know I ever read it yet I did pick it up it is someone pulled this from yesterday hopefully I'll",
            "start": 2467.37
        },
        {
            "text": "be why your laptop doesn't work we got to shake it to turn it on I didn't shake it to turn it on you know I ever read it yet I did pick it up it is someone pulled this from yesterday hopefully I'll talk about it next week on the show if I don't die in Vegas with Kevin and the Babyface Kevin over there disgusting it looks too smooth the only specific it's creepy keep looking at it because of weird but you don't want to look at it I think right right it's like a banana slug you know what I mean you ever seen a banana slugs yeah yeah you look at you're like you can't look away KingFranchise88 says Nick what is Kevin's favorite game to play in Vegas and of course you don't know I don't know but I want to know what you want gambling you're gonna do a little Blackjack with you I think the video Blackjack team here's one I love it because we're staying in the same place I stayed for dice yeah so I already know exactly how to get to the video Blackjack here's what I would like to do with",
            "start": 2503.79
        },
        {
            "text": "Blackjack team here's one I love it because we're staying in the same place I stayed for dice yeah so I already know exactly how to get to the video Blackjack here's what I would like to do with you I would like to do a number of rounds of video Blackjack while sipping Bloody Marys oh okay sure how do you feel about sure now video our day there endured a Larry go boom boom boom maybe that's watch me that's denim if you don't need to spend my everyday keep drink our **** food I'll do that I will tell you this I don't know the term for there is a term for it but I don't know what it is I every time I go to Vegas and the more money I bet I lose the more I lose everyone else around me wins like this I don't know why it is hanging out with you but I will drop I'm going to put a hundred bucks down for the peasant see how fast it can go I'm going to try to get a hundred bucks to last at least a couple hours okay but it probably won't that's an abscess what if I swear to God if I lose 100",
            "start": 2547.08
        },
        {
            "text": "down for the peasant see how fast it can go I'm going to try to get a hundred bucks to last at least a couple hours okay but it probably won't that's an abscess what if I swear to God if I lose 100 bucks you're going to get 500 bucks in your pocket I'm guarantee it I don't know why it works that way it's just I didn't remember of course weeks ago I said on one of our **** shows that I was going to I wanted I a time I'll read a Blackjack book I'll start playing it didn't do anything you did didn't do any of you watch the movie 21 then you were like I got it I well I understand the basics I just need to I want to look real quick for a nap here it's gotta be in a bucket yeah I'll tell you how to do it in five days from where one day we have yeah we have a night a night now the subscriber only mode of course this one of your benefits of subscribing to us whether it's with regular money or Amazon money if you use that Twitch Prime remember no matter what you used to do it thank you for",
            "start": 2588.0
        },
        {
            "text": "only mode of course this one of your benefits of subscribing to us whether it's with regular money or Amazon money if you use that Twitch Prime remember no matter what you used to do it thank you for your support this is a business and we need you guys what if you get drunk and Greg accidentally marries Kevin to the wrong woman in Vegas fantastic a great movie that's never been done but let's do that hold on I'm gonna look for a Blackjack that's my ball says hey Nick have you seen the new leaked nude pictures of Alison Brie no I don't do that I don't generally go looking for those things mostly because she's nude in an Glow yeah why would I need to look at new pictures where she chose in the news there and that's what really everybody yes creep over there listen when you choose to be do somewhere I'm gonna look at you of course you want me with you may Bank doing it yeah it would and it was consensual good for you now you said this Greg I like taking my shirt off in front of people",
            "start": 2623.96
        },
        {
            "text": "somewhere I'm gonna look at you of course you want me with you may Bank doing it yeah it would and it was consensual good for you now you said this Greg I like taking my shirt off in front of people sure but if someone gave me $100 I would gladly took my I would go full naked but keep it honest here's not weird I am I'd rather go pants lifts and shirtless yeah that is weird we talked about that before I love my dick I appreciate that I'm glad that you're so proud of it it's true and there's a lot of Blackjack games hearing you I don't want to get a bad one you know I feel like SpaceTimeDay says Nick will you make any trips to special clubs in Vegas I assume you mean strip establishments my friend and that is none of your business the power strip clubs is it's it's just a bar yeah so if you bring in as what you get out if we bring in a fun vibe we're all having fun and we're all partying it's going to be a great time if we go in and we just want to like stare creepily ahead of us and",
            "start": 2663.66
        },
        {
            "text": "bring in as what you get out if we bring in a fun vibe we're all having fun and we're all partying it's going to be a great time if we go in and we just want to like stare creepily ahead of us and spend lots of money it's going to be terrible so we're going to we're just going to go wherever the flood takes us guys that's what's going to happen there Blackjack but now Joe may have a phone you used to make mobile games can you recommend a good mobile Blackjack game for me to learn to Blackjack tonight flash on the plane tomorrow got to get you feeling gamble all your money away did you read the book know what I know I know I know Jerry Cole says Nick you're probably gonna go dude for free huts tree or a couple drinks Emiru Mr. E has made 300 and says Nick have you heard that Blade Runner 2049 is officially rated R I have not annexed **** awesome it should be it needs to be a hard R in final question for the day comes from Trevor J.X. Greg any chances of Kinda Funny collaborating on",
            "start": 2708.18
        },
        {
            "text": "is officially rated R I have not annexed **** awesome it should be it needs to be a hard R in final question for the day comes from Trevor J.X. Greg any chances of Kinda Funny collaborating on a comic book woo Never Say Never on anything I'd love to write a comic book but the problem is we are up to our eyeballs and work so the fact that I my inbox is currently filled with hey design this character a tweet a video game and I haven't able to do that and hey play these three games and give us feedback on trophies and everything we'll do that I'm kind of a **** I had a great idea for Humble Anonymity and here it is ready yeah okay everyone's information gets hacked and so there's no more and omitting on it anymore anyone else wore masks all times it's not a private eye area my God damn it well that sounds off maybe he can bring Emily you Rihanna point I might sneak puck now why did you wide wide Mark Wahlberg tell me it's a big one hey this look Joe no revenge anymore that's the kilt",
            "start": 2749.21
        },
        {
            "text": "well that sounds off maybe he can bring Emily you Rihanna point I might sneak puck now why did you wide wide Mark Wahlberg tell me it's a big one hey this look Joe no revenge anymore that's the kilt reason to make that thing if you need no lady be shot negatives been the Kinda Funny Morning Show each and every weekday except tomorrow because we're going to Vegas to make sure Kevin Coello comes back with one I run you through the nearly news we want to talk about and we gentlemen chat have fun with you it's just a rolling garbage truck up phone over here I don't be Absalon I hope you enjoy it if you like that of course please subscribe to us here on Twitch if you're watching on YouTube.com/KindaFunny please subscribe there if you listen on a podcast service please rate and share it with your friends remember we have two Patreons and every dollar helps so please go over there toss is a buck if you like what we do or do it on Twitch use Amazon Prime because you got Twitch",
            "start": 2792.02
        },
        {
            "text": "it with your friends remember we have two Patreons and every dollar helps so please go over there toss is a buck if you like what we do or do it on Twitch use Amazon Prime because you got Twitch Prime and yada yada yada **** is going to go off camera read subscriptions I'm gonna get ready for Kinda Funny Games Daily and until Monday morning for this show come on to another show right here it's been our pleasure to serve you you",
            "start": 2830.24
        }
    ]
}