{
    "id": 2892,
    "video_id": "EzzXvxEdA9M",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Tim Gettys",
        "Mike Drucker"
    ],
    "title": "Mike Drucker Joins Us! - Kinda Funny Morning Show 08.08.17",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502225370,
    "duration": 2838,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to the Kinda Funny Morning Show for August 8th, 2017. I'm Tim Gettys joined by Mike Drucker. Hello, I'm here making his return. You were just, you were just in town. I was just in town hanging out and I texted Greg and I was like, can I do something? And Greg was like, yeah, sure. All right, fine. So, why are you here? I'm here 'cause uh, I just finished uh, the season of Bill Nye Saves the World on Netflix. We just finished wrapping it. Season Two. Season Two. Yeah, I, I think it's much, much better than season one. We really took a lot of the criticisms to heart and we, I think we made a much better season. And uh, yeah, so now I'm here and I'm sort of finishing up personal projects, writing stuff for myself and I like San Francisco. So what does that mean, writing stuff for yourself? Is that like standup stuff? Or it's standup stuff. It's also when you want to get hired on a show like a sitcom, uh, a lot of time you have to have something called a spec script. And in the past, the spec script",
            "start": 0.41
        },
        {
            "text": "like standup stuff or it's standup stuff. It's also when you want to get hired on a show like a sitcom, uh, a lot of time you have to have something called a spec script. And in the past, the spec script used to be something like you'd write a sample of a show. Like if you liked Archer a lot, you'd write a sample episode of Archer. That's fallen out of style now. You have to write an original pilot, which is a lot harder because you can't just go, I know these characters, I know the games that they play with each other. You have to create a new thing, but also create a new thing that's marketable to people. Like if you want to be on Archer, you have to create a show that's like Archer, but not so much like Archer that they think you've just copied Archer. So it's a really narrow thing. Um, but I'm, I like writing, but I can only do it when I'm really isolated. I'm very easily distracted. So I, what I like to do when I'm writing something for myself is I'll book a hotel in another city so I don't have like my TV",
            "start": 54.56
        },
        {
            "text": "but I can only do it when I'm really isolated. I'm very easily distracted. So I, what I like to do when I'm writing something for myself is I'll book a hotel in another city so I don't have like my TV. Like I still have my Switch with me, but I don't have like everything I have of all my comfort. So I'm not your excuses, right? You have bad Hotel Wi-Fi. Um, yeah, you just limit your excuses and right. Okay, yeah, that's f***ing awesome. So how was the, the standup thing you doing? Have you been doing a lot of standup? I, well, you know what? I haven't as much as I'd like. I, I think the last big show I did was Kinda Funny Live, which is available now YouTube/KindaFunny. Your set was amazing. And also I just love that Nick intro'd you. It felt right. You know, it's kind of like this Padawan-esque thing we got going on. Um, Nick, should I, is Nick my Padawan or am I Nick's Padawan? Though, Nick, you definitely Nick's, Nick's master. Master. Yeah, I like that. Sounds hot. It, yeah, that was great. It was just with um, you know,",
            "start": 89.44
        },
        {
            "text": "on um, Nick, should I, is Nick my Padawan or am I Nick's Padawan? Though, Nick, you definitely Nick's, Nick's master. Master. Yeah, I like that. Sounds hot. It, yeah, that was great. It was just with um, you know, when I got, when we start doing the season of Bill Nye, like a lot of it's like 12-14 hour days, especially when you're shooting. So a lot of the time, like went straight from finishing season two of Adam Ruins Everything right into Bill Nye's World. Like I didn't even have a week off. I finished and then that Monday started the next show I was working on. So I've been doing standup, but because I have these Monday to Friday jobs, it's hard to go on the road. Yeah, so when these shows happen, they're seasonal, right? Yeah, you right, you, you're there for the shoot. So when you're a writer on the show, what does that entail? You write the episodes before they happen, obviously, but then do you have to be at the taping for like, are you like making rewrites on the shoot? Yeah, and it also depends on, it depends on the host.",
            "start": 128.92
        },
        {
            "text": "you write the episodes before they happen, obviously, but then do you have to be at the taping for like, are you like making rewrites on the shoot? Yeah, and it also depends on, it depends on the host. It depends on the show. Like it depends on the director of the show, the producers. Some shows you write, they make them and you never hear anything again. Some, they really want the writer there because especially like a show at like Adam Ruins Everything, Adam is very interactive with the writer. So we'll be on set and he'll be like, hey, I want to change this line. Do you think that's a good idea? Do you think it's a bad idea? And he doesn't want you to be a yes man. He wants you to be like, oh, that's a great idea. Or like, what if we did this instead? Um, you know, but on shows I've done in the past, like something like when I was writing on The Tonight Show, Jimmy Fallon had been doing it for decades before I was a writer. So like, you know, you'd write something and they'd take it and they'd make it. It wasn't",
            "start": 171.24
        },
        {
            "text": "like when I was writing on The Tonight Show, Jimmy Fallon had been doing it for decades before I was a writer. So like, you know, you'd write something and they'd take it and they'd make it. It wasn't necessarily as interactive. Um, but different shows have different needs for different writers. Um, on a show like Bill Nye or Adam, which are both sort of educational shows, we'd spend a couple weeks really researching topics, talking to experts, interviewing scientists, uh, figuring out what we were right and wrong about. Then we'd write the episode, then we'd make it. Um, Bill Nye's show was in front of an audience and this season we also have a much bigger audience. So the audience actually sounds like it's there. It's, it's much better audience. It's a much bigger audience. Um, so we did that. But Adam's show is, you know, we shoot on locations. So it's an entirely different setup, man. Okay, so then you take that, you, you write it, you shoot it, then do you just not have a job for, yeah, until the next season? Um, you don't",
            "start": 203.04
        },
        {
            "text": "know, we shoot on locations. So it's an entirely different setup, man. Okay, so then you take that, you, you write it, you shoot it, then do you just not have a job for, yeah, until the next season? Um, you don't have, usually you, you look for another job and it's not like you look for another job like, I quit, I'm done. It's just, okay, I know that we're not coming back until December, January, February, March. And so you try to find a three-month gig or a four-month gig. And sometimes that means you don't come back or sometimes it means you find a short gig and do that. Some people will even just, you know, I'm not married, so I don't have like the dual incomes, but like some people will just not work. You know, they'll be like, okay, I'm going to be a stay-at-home parent this time or I'm going to just work on projects for myself. Well, um, some people just tour, which I've done in the past, but I'm more of a, I think I'm more of a writer than a performer. Huh, that's interesting. So I'm very interested in this stuff now because",
            "start": 240.32
        },
        {
            "text": "for myself. Well, um, some people just tour, which I've done in the past, but I'm more of a, I think I'm more of a writer than a performer. Huh, that's interesting. So I'm very interested in this stuff now because of Nick. Nick went from Zero to Hero when it comes to the standup stuff and seeing him talk about it on GoG and then now go to the open mics and just continue to do kind of behind our back for a while, which was awesome. Be revealed that he just did it and now he'll invite us out to the things. We're seeing him get better and practice his set and his set goes from 3 minutes to 5 minutes. I think he's at 10 minutes now. Like that is so interesting to me. But where are you at in, in that kind of game? Like you're obviously past the open mic stage, but like what, what does Nick have to look forward to and where are you at now? Um, well, I'm at a weird place in that I've sort of transitioned more into writing. Um, like I'll still tour, I'll still headline a couple times, but I'm, you know, I don't love doing",
            "start": 280.04
        },
        {
            "text": "where are you at now? Um, well, I'm at a weird place in that I've sort of transitioned more into writing. Um, like I'll still tour, I'll still headline a couple times, but I'm, you know, I don't love doing the road that much. I like it. Um, I get very lonely on the road. So like the hour on stage I love, but the other 23 hours always tend to bum me out. And I realized that and I was like, oh, I don't mind having a desk job. I just want to sit at a desk doing something that I find creative, if that makes sense. Uh, what Nick has to look forward to is, you know, getting past at clubs, especially around San Francisco, which has clubs like Cobb's, they have Punch Line. Um, you, Punch Line, his goal right now. Punch Line's great. Um, and you do those shows and then they start doing something, you start opening at those clubs. And opening means you do 7 to 10, depending on who the headliner is and what they want. You know, it could be even like five, but like, let's say 7 to 10 minutes up front. You're sort of like easing",
            "start": 322.6
        },
        {
            "text": "clubs and opening means you do 7 to 10, depending on who the headliner is and what they want. You know, it could be even like five, but like, let's say 7 to 10 minutes up front. You're sort of like easing everybody. You do announcements, you tell people not to, you know, shout, take photos, but you're also doing your material. So it's sort of hosting like you'd host anything, but also you get to do your material. After that, something called featuring. And featuring is the middle guy or woman, or woman, the middle person. Uh, and you do about 30, you do about 20 to 30, again, depending on what the headliner wants. Some headliners don't want to do a lot of time, so you as the feature will do more time to complement that. Um, sometimes they want to do a lot of time, so you as a feature will do just a little bit of time. And sometimes the host and the feature will be combined. Um, but the feature usually you're paid like 500, 750, maybe more, depending on who the headliner is and what the club is, but it's not a lot of money and",
            "start": 359.6
        },
        {
            "text": "the host and the feature will be combined. Um, but the feature usually you're paid like 500, 750, maybe more, depending on who the headliner is and what the club is, but it's not a lot of money and usually they use local people because they won't pay to put you up. Got it. And uh, I know when I was starting, I would sort of eat the cost of it. Like I would fly to a city like Philly and do Helium or Portland and do Helium. Helium's a good comedy, um, you know, Helium. Helium's, one of my favorite comedy chains. Um, but you'd go to like, I'd go to like Philly or Washington D.C. and I would pay like $300 to stay in a hotel for the weekend and then make $500. And then with the plane ticket, I might have lost 100 bucks. But you get to do 30 minutes five times in a weekend. And that's really good for improving you. And so if you're featuring, does it really matter who you're opening for? Like, is that something where you're like, oh man, I get to say I open for? Yeah, well, not it, it matters who you open for. One, because",
            "start": 396.24
        },
        {
            "text": "so if you're featuring, does it really matter who you're opening for? Like, is that something where you're like, oh man, I get to say I open for? Yeah, well, not it, it matters who you open for. One, because of the audience. Sometimes, you know, there's this, there's two, there's two schools in standup. There's either you should appeal to everybody or you should figure out who your audience is and go after it. And if you appeal to everybody, that's great and you can usually do well. But you'll always find a headliner who has an audience that's not your audience. And so sometimes you'll feature and you'll do 30 minutes in front of people who don't want you there. Yeah. Um, you know, whether it's someone who disagrees with your politics and that's fine. Or if it's someone, you know, like you'll get somebody who's like a huge party dude who's not my audience. And they'll be like bachelorette parties and bachelor parties and you're making Castlevania jokes and I'm making Castlevania jokes. So the headliner and also",
            "start": 438.04
        },
        {
            "text": "a huge party dude who's not my audience. And they'll be like bachelorette parties and bachelor parties and you're making Castlevania jokes and I'm making Castlevania jokes. So the headliner and also sometimes the headliner, like when I, you know, featured for Brian Posehn or Patton Oswalt or Jian G, like these audiences come in that are these audiences that are my audiences. There are people that speak to me who like what I like. So it's a lot easier now. Yeah, you should develop skills where you can appeal to everyone, but I won't lie when I say the headliners that you like are a lot more fun to work with. Yeah, and sometimes you'll work with headliners that are assholes. Am I allowed to swear? I'm sorry. Yeah, you're allowed to do. Am I allowed to swear? Absolutely. I, I was told I'm allowed to swear as much as you want. That's what you guys get for subscribing. Um, uh, you know, sometimes you get headliners that are assholes. They're, they're not like mean to you like in, but you know, you're, you're hanging out with",
            "start": 477.88
        },
        {
            "text": "you want. That's what you guys get for subscribing. Um, uh, you know, sometimes you get headliners that are assholes. They're, they're not like mean to you like in, but you know, you're, you're hanging out with someone for three nights for hours at a time. And you'll have someone who totally ignores you. On the flip side, you'll have someone who's like, hey, you want to hang out? You'll see movies with someone. You'll, you'll make a new friend. Yeah, so there's a lot of cool things and weird things about the road, uh, that Nick has to look forward to. So the other thing that I wanted to ask you about is the duration of a set because I've been watching a lot of standup specifically on Netflix. And Nick and I have kind of been every week just talking about, oh, which ones did you watch and comparing them. There was a series called The Standups recently. Did you see that? I did. Yeah, where it was 30 minutes instead of an hour. And I think that has a much better time because it's like, it's much tighter and it just, it's",
            "start": 515.64
        },
        {
            "text": "series called The Standups recently. Did you see that? I did. Yeah, where it was 30 minutes instead of an hour. And I think that has a much better time because it's like, it's much tighter and it just, it's gets in and gets out. Whereas the hour can kind of drag on a bit. And I found myself even if it's really funny, like, oh, I can pause this and come back later. And then I don't really ever come back later. Yeah, and with you, the idea of burning material. Have you ever had a one-hour standup special? No, no. I've done, I've done like small things on stuff like Seeso, which is always hard to say. But like, um, I, I haven't done a one-hour standup special 'cause then that is impressive to me because for Kinda Funny Live, for example, you did a 10-minute set at Kinda Funny Live 2. And then you did an entirely different 10-minute set at Kinda Funny Live 3. Yeah, that's 20 minutes of material that you might not want to waste on us on some stupid internet shit, knowing that it's going to be put out there that",
            "start": 551.96
        },
        {
            "text": "10-minute set at Kinda Funny Live 3. Yeah, that's 20 minutes of material that you might not want to waste on us on some stupid internet shit, knowing that it's going to be put out there that everyone can see it and, and all of that. Like, does that stuff cross your mind? Or you just kind of like have enough material? Or are you able to like make curated sets based on where you are? Um, yes and no. One, it's a good challenge. You know, because it's so easy, especially for someone like me who doesn't do standup as much as I'd like. It's so easy to fall into just having the same 10 minutes that you do for 15 years. I haven't been doing comedy for 15 years, but like I know people who like, you know, I saw them eight years ago where I'm like, oh, you're still doing that joke. And I've done that. Like I've done a set, you know, I've been doing, you know, I'll do like a 45 minute set somewhere and I'll be like, you know, okay, I can see this crowd doesn't like this new stuff. I need to go into old stuff. And it, it's",
            "start": 594.48
        },
        {
            "text": "a set, you know, I've been doing, you know, I'll do like a 45 minute set somewhere and I'll be like, you know, okay, I can see this crowd doesn't like this new stuff. I need to go into old stuff. And it, it's annoying. That said, um, it doesn't really burn material. Like if you watch carefully, you'll see someone on a do a late night set on something like Conan and then you'll see that material sort of repurposed for a Comedy Central Presents type thing. It's not unusual to take that material that you've used elsewhere and then package it up in that hour and half hour. It's not always the best thing to do, but it definitely happens and it's not illegal in any sense. What's cool too is like seeing Nick when he did the thing in Kinda Funny Live 3 and then right, my timeline's mixed up 'cause I don't remember if it was before we actually did KFL or after it was published, but we published uh, his standup that he did at an open mic and it was the same set, but it was so different just based on like little changes",
            "start": 632.48
        },
        {
            "text": "was before we actually did KFL or after it was published, but we published uh, his standup that he did at an open mic and it was the same set, but it was so different just based on like little changes that he made and all that stuff. Like how hard is it to keep track of the jokes in your head? And like, is at this point, are you just like material that you know you just have and you can kind of pull from at any point and like mix and match? No, I forget stuff all the time. Like I'll have once in a while, I'll have a friend who's a comedian be like, oh, I used to love that joke you did. And I was like, why don't I do that any? Like I'll forget that I had this thing that I really like doing and it just slipped my mind. I mean, some people are masters of remembering everything. I have notebooks and notebooks and notebooks that are just full of junk and set lists that I'll go back to and be like, oh, I need to revive that or I should like bring that back but add to it or change it a certain way. That's the other",
            "start": 672.04
        },
        {
            "text": "notebooks that are just full of junk and set lists that I'll go back to and be like, oh, I need to revive that or I should like bring that back but add to it or change it a certain way. That's the other thing too is you'll have old material that it's not like you write a new joke and it's different from the old joke. You'll have an old joke and then you're like, oh, I have a new idea that adds to it. Then you'll add to it, then you'll add to it. So you're still doing that old joke, but that old joke might have been 30 seconds and now you have 6 minutes that, that's the foundation of. Yeah, I saw recently you've been doing a thing in L.A., the, I forget the name of it, but Shitty Games F***ing Arcade. What is that? F***ing Arcade. Uh, August 17th, if you're in uh, Los Angeles, we have comedian and Greg did the first one. We have comedians and streamers and games people play, play bad video games from the past and just comment on them live, sort of Mystery Science Theater 3000 style. Um, but we're still figuring out",
            "start": 708.08
        },
        {
            "text": "we have comedians and streamers and games people play, play bad video games from the past and just comment on them live, sort of Mystery Science Theater 3000 style. Um, but we're still figuring out the format. We've only done three of them. We do them at uh, Meltdown Comics where Kumail used to have his live show. And it's super fun. You know, we've had games like we've had Shaq Fu, great. We've had uh, we've had Bubsy. We've had M.C. Kids. So right now, M.C. Kids. M.C. Kids. That's what system was that on? NES. NES. M.C. Kids. Good Lord, can't even imagine. Had um, the Mary-Kate and Ashley Olsen Organizer for Game Boy Color. We've had the French Translator for Game Boy. So really bad video translator for Game Boy. And the fun of it is, is it's sort of this like interactive event. We give away a lot of the games. I don't, the only games I don't give away are the ones that cost me like $50 to buy. Like I recently for the next one coming, the 17th, bought Time Killers. Time Killers. Time Killers is a fighting game that was",
            "start": 744.44
        },
        {
            "text": "the only games I don't give away are the ones that cost me like $50 to buy. Like I recently for the next one coming, the 17th, bought Time Killers. Time Killers. Time Killers is a fighting game that was supposed to be a Mortal Kombat killer. And in it, it's hyper violent. You can cut off people's limbs mid-fight and then they have to fight missing limbs. And they, that's kind of cool as a mechanic. It's kind of cool, but the game's awful. Okay, it's, it's, it's, it's like it wants to be Mortal Kombat meets Samurai Shodown. And it turns out Shaq Fu. It's Shaq Fu. And they made a port for the Genesis that's even worse. It looks like, it looks, you know, those old DOS games that had like bright palettes, but like it felt like they didn't have enough color. So they, it was just super bright. That's what it looks like. Um, but it cost me $60. And I'm like, I'm not going to give this away. Like I think my threshold is like 30 bucks for giving away game. I'm going to keep Time Killers. One day I might need to bust it out.",
            "start": 793.0
        },
        {
            "text": "um, but it cost me $60. And I'm like, I'm not going to give this away. Like I think my threshold is like 30 bucks for giving away game. I'm going to keep Time Killers. One day I might need to bust it out. Might need to bust it out again. I gave away Shaq Fu in the box, uh, and I gave out Bubsy in the box. So I need to find a new game that I can give away in the box. How stoked are you for the new Bubsy: The Woolies Strike Back or whatever the fuck the opposite of stoked is? Yeah, okay, okay. And I like, I like, I like that company. Was it WayForward that's doing it? Is it WayForward? No, I don't think it is. Hold on, let me, let me look that up in that GameStop. Oh, is it? Oh, what said it sounds like game, sounds like games, sounds like video games for children. Uh, yeah, no, it's being made by Tomo. Oh, Tomo. I'm WayForward's games. Yeah, why do I think it was WayForward? I, I don't know. WayForward make good games. That's what I thought. No, no, no, no. This looks like it's going to be trash. Yeah, uh, we don't need another Bubsy. You",
            "start": 830.92
        },
        {
            "text": "yeah, why do I think it was WayForward? I, I don't know. WayForward make good games. That's what I thought. No, no, no, no. This looks like it's going to be trash. Yeah, uh, we don't need another Bubsy. You guys, well, ladies and gentlemen, this is the Kinda Funny Morning Show. Each and every weekday we get together right here on Twitch.tv/KindaFunnyGames and talk about all the nerdy things that we want to talk about. Right now over on YouTube/KindaFunnyGames, the Metroid: Samus Returns Let's Play that we did is available. You should go check it out. It totally sold me on the game. I want to play it. Sam from uh, the Nintendo Treehouse came by, showed off the amiibo, which first off, I mean, I, I'm not an amiibo guy. Squishy amiibo. But yeah, the Metroid one, squishy. Uh, and damn, man, the Samus one is beautiful. I'm like, fuck, I actually kind of wanted, but I can't, I can't get into the amiibo 'cause once I get one, right, I'm going to go down the, I have a giant pillowcase full of them. Like I just bought a bunch",
            "start": 878.24
        },
        {
            "text": "I'm like, fuck, I actually kind of wanted, but I can't, I can't get into the amiibo 'cause once I get one, right, I'm going to go down the, I have a giant pillowcase full of them. Like I just bought a bunch for Splatoon 2 and I don't use them. Like I use in Zelda and but like I don't, I don't know why I buy them. I don't know why I buy these things. They get it. They know how to fuck get in there. Keep going, man. Uh, but Metroid: Samus Returns, I was not really like, when it was announced, I was like, what the fuck? Metroid Prime 4 blew my mind. And then, oh, and also after the E3 direct, here's another announcement, a 2D Metroid game. Like 3DS for the 3DS. It's like, who would have ever imagined? So I, I was excited because it's new Metroid. Yeah, or remake of Metroid. Whatever, it's a, a Metroid game in 2017. Much a new Metroid. Um, but I was like, I never Metroid II is the one Metroid game I didn't beat. I was kind of like, huh, so it'd be remade. Sure, I'll give it the benefit of the doubt. We were talking about it earlier.",
            "start": 917.04
        },
        {
            "text": "new Metroid. Um, but I was like, I never Metroid II is the one Metroid game I didn't beat. I was kind of like, huh, so it'd be remade. Sure, I'll give it the benefit of the doubt. We were talking about it earlier. Zero Mission, one of the most underrated Metroid games. It's amazing Metroid game. But I still wrote this off because I'm like, I'm on my Switch. I don't want to play 3DS. I don't really like the look of the game. There's all the stuff. I'm like, whatever. But playing it, I was just like, oh, you can see my excitement in the Let's Play where I'm just like, I got to fuckin' play. I got out. It looks, it looks great. And there's a new melee mechanic that is super satisfying where you can punch one of the fuckers and shoot them. And it's just like, yeah, when you, when you pull it off, it, it reminds me of Smash Bros. a lot. Like when you nail a counter with one of the fuckers, it feels so good. So good. Uh, so you can check that out. Um, I think that's all of the housekeeping stuff that we got. Yes, it is. Let's get into the news. This",
            "start": 958.32
        },
        {
            "text": "like when you nail a counter with one of the fire feel so good so good uh so you can check that out um I think that's all of the housekeeping stuff that we got yes it is let's get into the news this comes from over at IGN there we go Joey is on the the board today by the way everybody her first time Kevin is doing something he's like helping her but he's just sitting across the room which I appreciate but I like that even when you're not doing something you're still attacked like no matter what position you have you are under attack monitoring the show you're doing good work I'm on your side here I'm not I'm on your side so this this news is uh going to be particularly thrilling to you Mike Drucker and I say that my favorite movie series of all time James Cameron who's currently at work on Avatar 3, 4, and 5 I I literally I know that it's like my friend Dana Schwartz is this writer and she had this tweet once that was perfect which is like it it's the biggest movie of all time and you",
            "start": 994.68
        },
        {
            "text": "3, 4, and 5 I I literally I know that it's like my friend Dana Schwartz is this writer and she had this tweet once that was perfect which is like it it's the biggest movie of all time and you cannot quote anything from it like there's nothing I see you that was a quote Yeah you could you could that's in every movie is the phrase like I see like I don't I don't remember anything about Avatar and I saw it twice I actually really like Avatar I know people give a lot of **** oh it's Pocahontas oh it's Dancing with Wolves whatever I thought it was a good interpretation of that story an amazing use of 3D amazing use of 3D but Avatar feels like it's like someone you dated in college I don't hate it but I just I'm like that that was a thing that existed and see that's true do I need more do I need 2, 3, 4, and 5 no now it gets better uh in the September issue of Empire Cameron confirmed that Colonel Quaritch Steven Lang will indeed return to serve as the primary antagonist in each film",
            "start": 1045.0
        },
        {
            "text": "2, 3, 4, and 5 no now it gets better uh in the September issue of Empire Cameron confirmed that Colonel Quaritch Steven Lang will indeed return to serve as the primary antagonist in each film right up to five now I don't know if you remember this he died violently with two arrows through the chest is he now an Avatar I don't I don't know like he should be dead as **** but somehow he's going to come back for four sequels do you believe that we'll get Avatar 5 I hope not here you know what I know Avatar is a movie but Avatar to me is like everything that's wrong with a video game series when they're like we're creating a whole new world and I'm like just make the first one good I don't need you to promise me that it'll be good by the fifth game in the series just make the first one good yeah I mean what's crazy is I only believe that this might happen because Avatar Land or whatever the **** World of Pandora just happened this year in Disney World and I'm like they're making a",
            "start": 1092.6
        },
        {
            "text": "yeah I mean what's crazy is I only believe that this might happen because Avatar Land or whatever the **** World of Pandora just happened this year in Disney World and I'm like they're making a Star Wars land an Avatar land they did it though and it looks super cool but it's like why why the **** are they doing this and why is he the bad guy in all of them and also why would you tell us that now we know he doesn't die or maybe he does die but he comes back like the main character was a twin brother so maybe he has a twin brother too was he there we go Pandora were twin brothers we just know that his last name is Quaritch so it could be his twin brother like Dave Quaritch who's also a Colonel oh my God and then he has a triplet he's probably higher ranking too I don't like the successful brother I lot to beef with how Colonel's spelled yeah the the word in general Colonel it's like who the **** decided that they don't deserve a rise uh Guardians of the Galaxy is coming out on Blu-ray",
            "start": 1138.44
        },
        {
            "text": "I lot to beef with how Colonel's spelled yeah the the word in general Colonel it's like who the **** decided that they don't deserve a rise uh Guardians of the Galaxy is coming out on Blu-ray very soon August 22nd and they released a music video uh featuring David Hasselhoff I thought we'd watch it at least part of it let's do it oh yeah I like this audio no not hold on sorry Joey **** things up this is not true there we go oh my God see you got to give it up to the Guardians producers right like they did this they didn't need to do this they did this they made this happen for a Blu-ray release man I miss music videos with sets like that you just don't see it anymore I will say you do Korea what I've like Korea right in South Korea oh K-pop no that's different though those sets are way more advanced than this where's the Hoff oh he comes in later have you seen this already I've seen this already no I'm okay I'm okay seeing it again it's what's amazing about this is you know",
            "start": 1188.92
        },
        {
            "text": "are way more advanced than this where's the Hoff oh he comes in later have you seen this already I've seen this already no I'm okay I'm okay seeing it again it's what's amazing about this is you know we've all worked in making videos the amount of work that was put into making this look like it was not a lot of work was probably so much work do you know what I mean that is so true like they had to I don't I don't like that it's still 4x3 like I love it no this well this would have come out in the 70s sure sure back when televisions were **** green the robot doing the robot oh she's nailing it see he hey is so bad it's it's that it's so great but again like there had to be because every editor who worked on this their Instinct had to be like I this this looks bad this could look shittier this could look shitty yeah exactly cuz you cuz you've also seen like poorly done '80s and '70s parodies where you're like I can tell this was shot now you just used a filter like you really",
            "start": 1250.4
        },
        {
            "text": "this could look shitty yeah exactly cuz you cuz you've also seen like poorly done '80s and '70s parodies where you're like I can tell this was shot now you just used a filter like you really have to work to make things look bad there we go I'm really happy that he understands what his career is you know I think he went through a phase where he didn't and he's come out the other side and God bless it yeah all right we can we can stop this now you can watch the rest this is good over on YouTube but this is fantastic the next story next story once again comes from IGN let's see it Joe Scrabble is a madeup name uh Judge Dredd: Mega-City One Karl Urban is in talks to a priz lead role for TV yes Mega-City One producer Jason Kingsley has confirmed that the team behind the show is in talks with Karl Urban and shed a little light on how the show will handle its plot in a statement IGN Kingsley said we've been in discussion with Karl about his possible involvement in Judge",
            "start": 1305.44
        },
        {
            "text": "is in talks with Karl Urban and shed a little light on how the show will handle its plot in a statement IGN Kingsley said we've been in discussion with Karl about his possible involvement in Judge Dredd: Mega-City One which is a horrible name for for some time these conversations continue but we're keen he's Keen it's just a case of us making sure this show is everything we want it to be this needs to be done right the fans deserve it our team is working hard on scripts for the first season creating engaging multi-thread story lines one of which will be Dredd's but others which will take us to the wider world of Mega-City One Mega-City One I didn't even know that Judge Dredd a TV show was in talks I feel like everything's always in talks this also could be nothing my thing is I don't want it to be anything unless it's on Netflix or HBO or Amazon or Hulu like something that they can just **** be Judge Dredd exactly you wanted to have that violence and that over-the-top Judge Dredd that the",
            "start": 1366.6
        },
        {
            "text": "be anything unless it's on Netflix or HBO or Amazon or Hulu like something that they can just **** be Judge Dredd exactly you wanted to have that violence and that over-the-top Judge Dredd that the that the recent one had and like the Stallone one did not have yeah well the Stallone had one had its own kind of magic it did have its own kind of magic magic Rob Schneider right yeah that's true that is true who was also in Demolition Man with Sylvester Stallone another great movie uh but I mean Dredd 3D was amazing Dredd 3D was amazing um oh speaking of that yeah producer that Adi Shankar also produced Castlevania on Netflix I've been telling a lot about this have you seen it yet I loved it good me too I I really like more now here's what I liked about it it felt like uh a Saturday morning cartoon for adults in the sense that it's not like you know it's not like this like heavy Prestige television where I'm like okay I got to follow all these themes and learn these characters Back",
            "start": 1406.12
        },
        {
            "text": "cartoon for adults in the sense that it's not like you know it's not like this like heavy Prestige television where I'm like okay I got to follow all these themes and learn these characters Back stories I'm like oh they're killing vampires and **** and chopping off priest hands all right let's do this it's just fun and it like what I would have watched as a kid it's just fun no yeah like remember when TV was fun you guys remember when you could turn on TV and like oh this is enjoyable and you didn't have my favorite characters are getting murdered right yeah although did you see the latest Rick and Morty: Pickle Rick I'm waiting till it's all done I'm going to just watch all at once I thought it was overhyped cuz I saw like the whole mention of it online and like and I have friends who work on the show and they talked about it and I was like okay good it might be Pickle Rick might be the best episode of Television I've seen all year like I liked it more than the most recent Game of Thrones",
            "start": 1451.96
        },
        {
            "text": "on the show and they talked about it and I was like okay good it might be Pickle Rick might be the best episode of Television I've seen all year like I liked it more than the most recent Game of Thrones which I know is insane that's wild I need to catch up on this show there must be a m I've only seen the first three episodes first episode I was like I don't get it the second episode the one with the **** dogs like there was a the dogs became sentient I don't even know whatever the **** sentient not smart so they didn't pee in the room anymore yeah and that **** was hilarious and then the third one kind of lost me it's it's the series does go up and down a little sorry no go ahead no I saying the Third third one I think it's the dream one where yeah lost you he was in a weird alien planet but I think it was in a dream yeah I don't know I feel like I just need to be in the right head space and just commit and just let it flow over me if you watch you can watch the latest one it's sort",
            "start": 1490.36
        },
        {
            "text": "but I think it was in a dream yeah I don't know I feel like I just need to be in the right head space and just commit and just let it flow over me if you watch you can watch the latest one it's sort of like you know not really part of the main story line so you could watch it without really spoiling earlier Seasons outside one of two one or two things but it escalates so fast and it gets in and I don't want to spoil anything cuz the way gets insane you're just watching this and you're like oh TV can do this cartoon can do this it's so good like it was like I watched it while I was doing this sort of writing Retreat I watched it four times oh my God because I just I was taking notes I was being like this is a choice they made and not like a choice they made where I'm like yeah I'm like I'm like this is such a good choice like there's scenes in that episode where especially as a writer when you're like oh they could have easily made the character go one way and they made them go a",
            "start": 1531.32
        },
        {
            "text": "I'm like this is such a good choice like there's scenes in that episode where especially as a writer when you're like oh they could have easily made the character go one way and they made them go a different way which up the energy of it it's such a good it's a well-written episode it has amazing action in it it's perfect TV okay okay okay yeah um next story comes from Deadline Paramount will now construct Amusement Park on March 2019 you know that could be good so here's the thing Kevin and I grew up with a Paramount amusement park Paramount's Great America which is Six Flags now which is no now it's California's Great America and Mike Drucker anywhere no it hasn't been for like 15 years so here's the **** deal dude wow you hear you know you're familiar with Disneyland right I'm from Florida with Disney World one of my favorite things of all time this was essentially just Nickelodeon Land and when you're a little kid that's there's a Disneyland and a Nickelodeon Land let's **** go",
            "start": 1571.68
        },
        {
            "text": "with Disney World one of my favorite things of all time this was essentially just Nickelodeon Land and when you're a little kid that's there's a Disneyland and a Nickelodeon Land let's **** go you'd go there's like a water park and instead of water it would slime you just like Nickelodeon that was fantastic you can do there was live versions of the game shows so Double Dare and uh Guts and all that stuff so you can like just wait in line and be one the chosen ones to perform in front of hundreds of dumb kids um there all the characters walking around so the Rugrats and all that stuff but then in addition to that the roller coasters were like Top Gun yeah where it's like are you kidding me there's a Top Gun ride the line you'd be going through it's just like Disneyland where it's like it's all themed you're hearing the Top Gun music play it was fantastic fantastic we didn't know what we had Flight Deck ride one of the best there was a James I have never heard of the same never heard of",
            "start": 1623.68
        },
        {
            "text": "it's all themed you're hearing the Top Gun music play it was fantastic fantastic we didn't know what we had Flight Deck ride one of the best there was a James I have never heard of the same never heard of Jurassic Park right by San Jose I you know I never went to California until I was an adult there was so much and it was so freaking great and then one day they just took it all from us and they're like you know what they sold it it's now California's Great America and the rides it's all the same rides they're just lame they're just lame as **** like Top Gun what was it called now like Top Pilot or Sky it's like no really though Sky Deck that's what it and it's like oh good lord this is **** lame as hell silent it's like generic stock music of like you know just think of Air Force music and it's just like a god but then the worst thing is it's like they replaced all the characters walking around and all of the the Nickelodeon stuff with Snoopy oh yeah Snoopy kids",
            "start": 1662.72
        },
        {
            "text": "of Air Force music and it's just like a god but then the worst thing is it's like they replaced all the characters walking around and all of the the Nickelodeon stuff with Snoopy oh yeah Snoopy kids love Snoopy and it's just like Li all right like you can't get Nickelodeon I guess Snoopy and friends are walking around like God damn it man a man it was such a such a disaster anyway uh for the story here update Paramount's animated feature Amusement Park what are what are Paramount I'm realizing as I reading this right now that they are not opening an amusement park they were putting out a movie called Amusement Park you fool you played yourself there was a Paramount amusement park and we will never forget Paramount's Great America whatever I guess I'm going to read this anyways I will say the the Deadline headline which I did not mean to rhyme the Deadline headline uh is being a little too cute and it confuses you I me I thought it was weird they said on instead of in right but all right whatever",
            "start": 1711.0
        },
        {
            "text": "headline which I did not mean to rhyme the Deadline headline uh is being a little too cute and it confuses you I me I thought it was weird they said on instead of in right but all right whatever Paramount's animated feature Amusement Park is now scheduled to open on March see they're getting too **** cute on March 15, 2019 the previous date I don't care about previous dates no one knew this was a movie what is Amusement Park marks the directorial debut of Pixar animator Dylan Brown and features a bigname voice cast that includes Matthew Broderick Jennifer Garner Jeffrey Tambor Kenan Thompson okay keeping in Nickelodeon a little bit Ken Jeong Kunis and John Oliver given the lead time required for an animated movie it's a really good sign when it moves up okay cool too much editorializing he see like kind of guy that would editorialize Anthony D'Alessandro you telling me that Anthony D'Alessandro won't editorialize that's how mad he looks he does whatever the **** he wants to do um",
            "start": 1760.84
        },
        {
            "text": "he see like kind of guy that would editorialize Anthony D'Alessandro you telling me that Anthony D'Alessandro won't editorialize that's how mad he looks he does whatever the **** he wants to do um wait go go to the comments for Deadline cuz Deadline were has the worst comments in entertainment I just want to scroll to see if what the comments are on it Joey scroll down oh let's see one comment ah never mind sometimes on Deadline like cuz me and my friends will obsessively read Deadline because we're selfish and the comments are always like it's like imagine YouTube comments but they understand your industry so they'll be like you're going to be a failure and I'm like oh no and here's why and like Deadline will post everything that happens so when I got signed by my agent they had like an article that was like everything that a everyone that agency had signed recently and my name was on there I was like this is so cool and the only comment was just the word who I like oh man I'm nothing",
            "start": 1803.24
        },
        {
            "text": "that was like everything that a everyone that agency had signed recently and my name was on there I was like this is so cool and the only comment was just the word who I like oh man I'm nothing you're something to me uh next story this is not much but it's Evangeline Lilly getting ready for the Ant-Man and the Wasp yeah shoot look at those arms yeah God damn she is in fighting shape and I love my girlfriend last night saw this picture as she was just like I just want to I just want that I'm going to work for that I need that get paid million for yeah exactly got a physical trainer to **** do your whole life and there you go but no this is going to be awesome I am stoked for this movie yeah I think it's going to be really good so weird you're stoked for the sequel to The Ant-Man movie who would have thought who the hell would have thought anyone would be excited for Ant-Man I like the Marvel movies I'm fine with them they're fun I love I love them but like when I heard Ant-Man was",
            "start": 1849.48
        },
        {
            "text": "would have thought who the hell would have thought anyone would be excited for Ant-Man I like the Marvel movies I'm fine with them they're fun I love I love them but like when I heard Ant-Man was going to be a movie when I heard that um Doctor Strange is going to be a movie I was like oh man we'll see and now Guardians of the Galaxy I love Guardians of the Galaxy yeah Guardians of the Galaxy is great just it's insane what we need is a Moon Knight movie or Moon Knight TV show I I hear people saying Netflix that'd be really cool and it's like that seems like a Netflix it seems more like a Netflix thing but sort of like a damaged messed up Batman type that's that's great like where you're like I don't know if this is a good idea for him to be out here but like I I'm not going to stop cuz I'm scared that is the Punisher I know that's the Punisher but I feel like The Punisher goes so far with it that you're like it's a bad thing he's out there well it's different yeah Punisher's violent",
            "start": 1894.08
        },
        {
            "text": "scared that is the Punisher I know that's the Punisher but I feel like The Punisher goes so far with it that you're like it's a bad thing he's out there well it's different yeah Punisher's violent where Moon Knight's **** up right when Moon Knight you're like are you okay yeah and I always like that anyway uh next random ass picture of people is is Hailee Steinfeld uh who plays Charlie Watson in the Bumblebee movie finally the Bumblebee movie and you can see her decked out in her '80s luck because the movie takes place in the '80s uh I'm actually no I don't want to say I'm excited for a Transformers movie not directed by Michael Bay like I'll give it that set in the '80s they're getting some right here John Cena is the star and I like John Cena I like John Cena I'm a big fan of John Cena so where can this go wrong it's it's still a Transformers movie and and her the girl from Pitch Perfect which are you excited for Pitch Perfect 3 dude okay so let me tell you Pitch Perfect One yeah one of",
            "start": 1932.6
        },
        {
            "text": "can this go wrong it's it's still a Transformers movie and and her the girl from Pitch Perfect which are you excited for Pitch Perfect 3 dude okay so let me tell you Pitch Perfect One yeah one of my it's a great movie like most surprising movies of the last 10 years where I'm like I did not think I'd like it I **** loved it right I want to put it up there in the same caliber as Mean Girls in the sense that like I didn't expect to like it and I loved it Mean Girls obviously A Step Above Mean Girls is a **** 10 out of 10 uh but Pitch Perfect One I was like this is great Pitch Perfect so excited for it was not a good movie yeah it was a bad movie we didn't need to go back to the Pitch Perfect well it we did not and now the trailers for Pitch Perfect 3 I'm like if you lost me who is your audience for this right I hope it's they're turning is Their audience you're not Their audience I don't know I feel like I should be though I really do I feel like if they're not getting me with a",
            "start": 1973.12
        },
        {
            "text": "audience for this right I hope it's they're turning is Their audience you're not Their audience I don't know I feel like I should be though I really do I feel like if they're not getting me with a cappella and Anna Kendrick I don't know who they're getting there's an executive who's walking in another another executive's office right now being like we've lost him we lost him we lost Rec this trailer have you seen the trailers for three yeah it's a Fast and Furious movie yeah they're like jumping out of exploding boats and **** yeah how I I kind of need to see the movie just to see how they get there because they're good a cappella group I guess you're right they're the best a cappella group they're the best a cappella actually so good they're going to compete against actual music groups yeah yeah that's what they're doing this time yeah Ruby Rose is in it though that's cool yeah I remember I saw there in the trailer I was like oh yeah um let's your face is real pretty let's read some t",
            "start": 2016.28
        },
        {
            "text": "tips this comes from Alex AlexV who says I just watched Kinda Funny Live 3 thank you guys so much you legit made me happier great what a great comment he was happy and now he's happier thank you very much hell yes I will take full credit for that my 10 minutes in 3 hours Anakin says hey Kinda Funny just paying my birthday tax things haven't been looking so well on my end but I always make sure I have time for all things Kinda Funny thank you guys well I hope things are get better for you you know have a good day do something nice go eat some fish I didn't mean that sexually I just meant that like nobody thought you meant it sexually until you said that nobody nobody went there until you went there we're all like oh yeah have have some salmon that's good for you so we do this thing",
            "start": 2055.48
        },
        {
            "text": "Drucker on the show called PS I Love This Best Friend XOXO where you can go to KindaFunny.com/bestfriend and nominate someone else in the community that's doing some dope **** that should get a shout out just like Dan Vile did he's shouting out John Esparo AKA John Astro who I'm pretty sure we've shouted out not once but twice on this show before no one is marking them off but I don't I think this is for a different thing though so he's just such a great dude that people just keep shouting him out which is fine great which is fine met him a Kinda Funny Live 2 when he came in clutch for a room share when I forgot to book a night love him to death we still talk often and I can't wait to see him again see we we got good community no you have a great community great people hanging out",
            "start": 2099.56
        },
        {
            "text": "a room share when I forgot to book a night love him to death we still talk often and I can't wait to see him again see we we got good community no you have a great community great people hanging out with each other sharing rooms eating fish I think it's no secret that uh a lot of the communities in games in nerdom are awful that's not a secret you have a great community like when I went to Kinda Funny Live 3 like people are excited to be there and they're happy and like everyone's like planning these meetups it's a really good community it's cool uh so thank you guys for not being awful thank you guys for being good and they love you too what I love is the Kinda Funny extended family Universe where it's like it's the people that have come to live shows watched the video seen everything like watched you on GOG in the morning shows and stuff so it's like there's this extra level of pride when see you come on stage even if they're watching the video later where it's just like ****",
            "start": 2140.56
        },
        {
            "text": "like watched you on GOG in the morning shows and stuff so it's like there's this extra level of pride when see you come on stage even if they're watching the video later where it's just like **** yeah Jer you know I know that guy it's awesome what I think you guys do right and I think you just did it you know or whether you did it on purpose or not is that a lot of communities tend to be exclusionary it's like you're a member of this community so you're in the secret group and that's cool if you're inside it but if you try to come in from inside there's a lot of like who are you why are you here and your community Kinda Funny community and it's a lot of you people doing it too I don't mean to attribute it all to these **** we don't do anything really that it feels very inclusive so people are excited when you're excited about Kinda Funny so it's like oh you're here that's so great there's more of us it's not like it's not like oh God there's more of us better than them you know",
            "start": 2182.08
        },
        {
            "text": "people are excited when you're excited about Kinda Funny so it's like oh you're here that's so great there's more of us it's not like it's not like oh God there's more of us better than them you know more like hey everyone let's just like dumb **** exactly and I think that just makes it more fun it makes it easier I don't know absolutely now it's giveaway time every day we give away a video game there's four ways to win one be in the Twitch chat two be a Twitch subscriber which you can do on Twitch or if you have Amazon Prime you can use your Twitch Prime account to get a free sign up every month you need to renew it every month which kind of sucks but we appreciate it if you'd use it on us but if not us use it on someone you're paying for it anyway so you might as well Daniel O'Dwyer's a good bet Alfredo's a good bet you have a Twitch account I do have a Mike Drucker is a good bet it's M.I.K.E.D.R.U.C.K.E.R. so yeah you can do that and it'll be great for everyone the other two ways",
            "start": 2214.92
        },
        {
            "text": "a good bet Alfredo's a good bet you have a Twitch account I do have a Mike Drucker is a good bet it's M.I.K.E.D.R.U.C.K.E.R. so yeah you can do that and it'll be great for everyone the other two ways are support us on Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames it's a $ or above level today's winner is getting World to the West on Xbox One never heard of it I hope you enjoy it I was going to say tweet at me let me know could be a great game it could be who the hell knows but let me know what you think about it uh and the winner is from Twitch chat VicDarkbomb yay that Tuesday energy we're all bringing yep exactly and now it's time to talk to the chat for a little bit what's up chat let's see what are people saying uh KJ Bell says Mike Mother Drucker yeah so there's that I like that I like that these yeah um how are you all doing I'm just going to look at you while Tim looks at the chat hope you're all feeling okay I hope you're getting through your days if you Retrobot JR says Tim",
            "start": 2251.92
        },
        {
            "text": "these yeah um how are you all doing I'm just going to look at you while Tim looks at the chat hope you're all feeling okay I hope you're getting through your days if you Retrobot JR says Tim is Kinda Funny getting a Sonic Mania review code yes we are when I don't know and I am itching for it I keep refreshing my email just hoping that it's going to be there you been in that situation I can't **** wait yeah you're like come on well you know what I I saw that when I came in today it the box oh yeah yeah you had you had the Sonic Mania mockup box and I thought you had the actual game and I got excited and I was like and I opened it and there was nothing in there and I felt so betrayed in in one of the nerdiest things I've ever done which is a testament is a testament a lot cuz this wall has buttons on it exactly exactly um I saw so Andrea Rene gave me a Sonic Mania instruction manual that they made uh that they gave out at different events in Comic-Con and I didn't get to get",
            "start": 2308.88
        },
        {
            "text": "wall has buttons on it exactly exactly um I saw so Andrea Rene gave me a Sonic Mania instruction manual that they made uh that they gave out at different events in Comic-Con and I didn't get to get one she gave me it cuz she didn't give a **** and I was like it meant a lot to me and then I saw online that someone made a custom Sonic Mania Genesis box and I'm like that's the coolest thing I've ever seen yeah I had a Genesis box so I'm like I'm going to print thing out and to be fair the print's pretty shitty right now I need to get it nicer done but boom it's a fake Sonic Mania thing they're not releasing this game physically but it doesn't matter I still have a cool thing to put on my desk cuz I'm a **** nerd and I can't wait for this theic of all time I can't wait I'm very excited for Sonic Mania I'm not even a big Sonic person I think I was for like a couple like a year in the Genesis days but I'm really excited must been a real good year though it was a good it was like the year",
            "start": 2359.08
        },
        {
            "text": "Sonic Mania I'm not even a big Sonic person I think I was for like a couple like a year in the Genesis days but I'm really excited must been a real good year though it was a good it was like the year that like Sonic 1 came out then Sonic 2 came out almost like the immediately immediately after too soon almost I remember Toys R Us had a pre-order bonus of a T-shirt and I was like you could get something for pre-ordering a video game this can't be a scam um and then and then like years later I'm like why am I disappointed by this game I pre-ordered to get a t-shirt for anyway uh I'm excited about this I think it's going to be a great game I think it's you know it just seems like it the team that made it understand Sonic and it's weird to acknowledge that the fans understand the franchise better than the owners of it do but that's I mean you we've seen it so many times like I I I'm a broken record with this but Ninja Turtles on TV now is better than Ninja Turtles has ever been",
            "start": 2400.64
        },
        {
            "text": "better than the owners of it do but that's I mean you we've seen it so many times like I I I'm a broken record with this but Ninja Turtles on TV now is better than Ninja Turtles has ever been Transformers is better now than it's ever been because the people that grew up watching and consuming the content whether it's comics or games or whatever they know what these characters mean to them so they add that level onto it there's so much backstory of the action figure games they played in their backyard that they're adding to the cannon of it that gives it that love and I feel like these Sonic games are going to be better than the original Sonic games because it's going to be how these people remember those games feeling not how they actually felt right I think that's why we liked Mario Maker so much was because it was like Nintendo meeting fans halfway where they're like yeah go for it we're still going to have complete very Nintendo control of this but we want to see what you do",
            "start": 2439.12
        },
        {
            "text": "Maker so much was because it was like Nintendo meeting fans halfway where they're like yeah go for it we're still going to have complete very Nintendo control of this but we want to see what you do yeah and then you play these levels where you're like that's the best Mario level I've ever played so good uh Peppermint Gentleman says Mike what's the best comedy show currently on television oh that's a really tough question especially because I'm applying to a bunch of them um I would say my favorite show on TV right now which I'd say is the comedy show is Rick and Morty I really like Rick and Morty I really like BoJack Horseman um I really like The President Show I'm also super political which I know it can be super annoying but I like The President Show with Anthony Atamanuik um I think Seth Meyers has really good segments it's still sort of a talk show so if you don't love talk shows but a lot of his monologue good he has I think the best joke writer in the English language working for",
            "start": 2479.36
        },
        {
            "text": "Meyers has really good segments it's still sort of a talk show so if you don't love talk shows but a lot of his monologue good he has I think the best joke writer in the English language working for him um a guy named Alex Baze that's an interesting way to put it yeah so do you know any joke writers in other languages um I know one or two comedians who do like French comedy French comedy is very weird yeah I can imagine but uh so yeah there's a ton of there's a ton of shows I like ShadowDrag says have you guys watched the Netflix Voltron series I have not I have not I want I heard really good things though similar to what I was saying I hear it's better than Voltron was yeah very cool let's do a Captain N reboot I don't know I said boot like Canadian I think it's time um Buddha of Love says hey Drucker what's the funniest thing Bill Nye has ever said to you um I've heard stories from the 70s and 80s that are very interesting when you imagine them with Bill Nye I love that um but he's",
            "start": 2514.32
        },
        {
            "text": "says hey Drucker what's the funniest thing Bill Nye has ever said to you um I've heard stories from the 70s and 80s that are very interesting when you imagine them with Bill Nye I love that um but he's actually super he's a super funny guy what's funny about Bill is um when he was a mechanical engineer at Boeing he was doing standup in Seattle at the same clubs that I did when I lived there like 20 years later so we have like stories about like the same dudes who were old when he was a kid are like ancient now but like be like oh that guy who runs that terrible comedy competition and I'll be like oh my God I've done that competition so we had this weird connection over Seattle comedy huh yeah that's awesome um Keep Him Here says Tim have you watched the new Jay-Z video I haven't but my brother ran in very excited today to talk to me about it and I didn't understand what he was saying it's a very good video and you had the blankest stare on your face list think to the description yeah it",
            "start": 2557.28
        },
        {
            "text": "ran in very excited today to talk to me about it and I didn't understand what he was saying it's a very good video and you had the blankest stare on your face list think to the description yeah it was uh it was something um it's a good video by the way have you seen it yeah directed by Alan Yang who is one of the co-creators of Master of None really yeah also a great guy great show too great show too yeah man I lost oh here we go Oceanic Survivor says Mike any chance you could bring Drucker Arcade to the internet in the future via YouTube Twitch or Patreon um I really want to the first the first two failed because um the we tried to stream it however due to Wi-Fi problems and a problem I had streaming both to the projector and through my Elgato thing it just kept falling apart so I kind of need to refigure out how to do it you need a Kevin I need a Kevin I need I need a u but I need a u that's portable like that can go to like small black boxes yeah uh blackbox theaters the the problem",
            "start": 2605.8
        },
        {
            "text": "need to refigure out how to do it you need a Kevin I need a Kevin I need I need a u but I need a u that's portable like that can go to like small black boxes yeah uh blackbox theaters the the problem is just that with the technical setup we had and the way the stage was and the know the projector things just started glitching out like either I could stream it and it wasn't going to the projector right or no sound was coming through either side but it was hitting both screens so I had to ditch at both times but I'm trying to work on that I'd love to also tour with it um I don't know if you guys ever want to do a version of it we could always do that i' **** love to that sounds we'll do it here sometime um but yeah I I definitely the answer is yes I'd really like to do that we're in sub only chat now Sean from Detroit says the name Keith irritates me so much I cannot bring myself to watch Voltron that's fair that's a fair reason to not watch a show yeah um Jesse **** Lane says if",
            "start": 2650.32
        },
        {
            "text": "only chat now Sean from Detroit says the name Keith irritates me so much I cannot bring myself to watch Voltron that's fair that's a fair reason to not watch a show yeah um Jesse **** Lane says if the whole world stopped sneezing all at once how long would it take people to notice probably like interesting question I would say like four months yeah because you wouldn't notice it then you'd be like I haven't sneezed in a long time I mean I I don't think I ever think about sneezing so I don't think it would ever cross my mind I could never sneeze again and I probably wouldn't notice that I hadn't sneezed I mean someone would talk about sneezing you'd be like I haven't sneezed and like I have a cold years I don't think so or like you think about it like that yeah I can't remember what you're sneezing is like it's it's very forceful it's one I don't know sound I know it's one big maybe we've stopped sneezing definitely not Greg sneezes all the time and it's always scary but not recently",
            "start": 2688.28
        },
        {
            "text": "sneezing is like it's it's very forceful it's one I don't know sound I know it's one big maybe we've stopped sneezing definitely not Greg sneezes all the time and it's always scary but not recently see Andy sneezed yesterday Andy did sneeze yesterday okay we're good we're good all right sneezing's back everybody it's like Voltron it's better than ever um Twitch chats suck sometimes cuz like I see good things and then they **** they just go away and I'm just like oh where did it go yeah let's see we don't have too much left oh Lexi Gunner this is the last one for the day says hey Mike are you going to audition for The Standups on Netflix if they make another season um I'd love to do it I've definitely because I've worked for Netflix I've talked to to them about doing standup stuff I just don't have the time right now I would love to do it the the honest answer is I don't have the time and it's not because I haven't been on the road as much as I'd like to the material isn't",
            "start": 2734.16
        },
        {
            "text": "I just don't have the time right now I would love to do it the the honest answer is I don't have the time and it's not because I haven't been on the road as much as I'd like to the material isn't as solid and a 60 or 30 minute block as I'd really like it to be for that big of a TV taping but I definitely like to do it some way and there's definitely been some conversations about it hell yeah yeah I'm all about that we should make it happen Mike thank you for joining us thank you for having me this is always I like that you came through like I like that you're like you know what I got a couple hours I'm spend it with my boys yeah exactly it's great right uh we're about to start Kinda Funny Games Daily so don't move your butts stay tuned and all that stuff till next time love you bye-bye",
            "start": 2787.32
        }
    ]
}