{
  "id": 2919,
  "video_id": "hLaQJELHgJA",
  "show_name": "Kinda Funny Morning Show",
  "hosts": [
    "Greg Miller",
    "Nick Scarpino",
    "Andy Cortez",
    "Geneviève St-Onge"
  ],
  "title": "Who will Play Obi Wan? - Kinda Funny Morning Show 08.18.17",
  "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to dollarshaveclub.com/morning\n\nThanks to naturebox for sponsoring this episode. Go to naturebox.com/MORNING\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1503090779,
  "duration": 3480,
  "transcript_chunks": [
    {
      "text": "What's up everybody, welcomed in a Kinda Funny Morning Show for Friday. Yes, you made it, August 18, 2017. I'm one of your hosts, Greg Miller, alongside the producer slash, you have inside, push you, doesn't something know, know what's on, is always know. This isn't a touch of feel cotton. Isn't this like, man, what didn't know your car Transformers? Here's what our today's there'd as I finished this tweet. Let me put it free it for you. Thank you. Find out how you can win at Burnie's Tesla on today's Morning Show, Twitch.tv/KindaFunnyGames. Thank you. Also, a couple space in there. I don't like William in, which is yes, but you're going to try that out right now. I was like, hey, I'm going to put a picture of Transformers in there because this Tesla getting a look kind of like a transport. It thanks is, you know what I look like, so I'll show you. They'll Shane, yeah, it looks like a clear route. I'll tell you, yeah, does actually. I was thinking, well, it came from Borderlands, but it is matter. Panel is",
      "start": 1.39
    },
    {
      "text": "is, you know what I look like, so I'll show you. They'll Shane, yeah, it looks like a clear route. I'll tell you, yeah, does actually. I was thinking, well, it came from Borderlands, but it is matter. Panel is important. Don't know why it doesn't matter. Long here, short, I can't. I was like, children, I'm going to put a transport winner who looks kindly a Transformer, which I know that if you really don't aren't intimately familiar with Burnie's Tesla, you're really not going to stand that the desert song from the Transformers movie came in. Yeah, you got it, son. Judge, I don't know the song. I don't want married. I think is it you have to power? Well, Joey, do you know if you get the f-stop adjusted over there? Dina. Hi, Joe. What are you? Joe is jumping right on it. Joey, what a proud. Yeah, you want a **** coupled well week for you. What a week for. Yeah, we look dark. Who cares? Doesn't it look like retained hookers? And I appreciate that you said before even choked up to fix that, you said, hold on, fam, and you chat, then you",
      "start": 52.38
    },
    {
      "text": "for you. What a week for. Yeah, we look dark. Who cares? Doesn't it look like retained hookers? And I appreciate that you said before even choked up to fix that, you said, hold on, fam, and you chat, then you got to do it. Joey, know everybody what Joe hired to do one job. We then gave her another job, and then we said, hey, do a third job here that you have no idea how to do. We rely Kinda Funny instead of hiring a fun camera guy in New York. Let's send Kevin to New York. Hey, okay, yeah, okay, it was cool, but I can talk about this. I think I, I look at you like you're Tim. You're not, but I think you can. I evergreed. Yeah, so here's what I want you to know. You know, Kinda Funny, we hang out, we had fun with you, we enjoy with you, baby. We jump out relaxing outside of the pool. Oh, you want a couple of guys? They were up to no good, started making trouble in our neighborhood, so we said in New York City to go to SummerSlam a few weeks ago, one Nick Scarpino, yeah, made a video touring the office, yeah, and it was because you",
      "start": 89.49
    },
    {
      "text": "no good, started making trouble in our neighborhood, so we said in New York City to go to SummerSlam a few weeks ago, one Nick Scarpino, yeah, made a video touring the office, yeah, and it was because you guys supporting us on Patreon. Thank you so much. And the universal response to that video was, this is awesome, we want more vloggy content, guys. To which we said, that's always interesting, great. We're just always busy. We're all good as you will make octo give you what you want if me hate, you know, when it's very complicated. However, when this SummerSlam opportunity came around, part of it sure was like, hey, go over there, see what's happened with the games. You have to see the communal order. Yeah, another part of it though, a huge part of it was getting rid of Kevin for a week. Exactly. And go have an adventure. You type at which one I told them, vlog everything. Like this needs to be bigger than just, you know, we're not going to go there, get some wrestling, and go vlog everything you can. To which they said,",
      "start": 135.89
    },
    {
      "text": "you type at which one I told them, vlog everything. Like this needs to be bigger than just, you know, we're not going to go there, get some wrestling, and go vlog everything you can. To which they said, all right, we're it will do that. They delivered their first vlog today, and I was like, I didn't know what to expect, right? Yeah, it's **** awesome, is it? Ah, it's really good. You want to know here? It's primarily shot via Air Card Snapchat Goggle, and it's just Kevin's perspective. It's him and Cool Greg's hair up New York City and do all the stuff and get to New York. And so Tim, I got it, watched it. I was like, all right, this is **** rad. There's no style guide to it because we're making it up as we go. Yeah, so then the question is, do we put it on YouTube? Do we put it on social feeds? What do you want to do? And Tim had the bright idea of, we should put on a Patreon. It's a pilot program. You guys want more vlogs? We're going to put it up at the dollar level today. That's fun as they come out throughout the",
      "start": 180.14
    },
    {
      "text": "in Tim had the bright idea of, we should put on a Patreon. It's a pilot program. You guys want more vlogs? We're going to put it up at the dollar level today. That's fun as they come out throughout the weekend. We'll put them up in the dollar level there, so everyone can go check it out. Patreon.com/KindaFunny. Yeah, and see what we're working on, and you tell us what you like, what you don't like, and then we can apply to future vlogs that we do and stuff like that as we try to figure out how this works for us. Love it. If you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunnyGames. We come to you with all the nerdy news you need to know about actions. What we want to talk about, we jump in the chat to hang out with you, punch each other, get nasty, have a great time here, spiteful. Sometimes you get a pie fool. I don't everyone jumping ever finger on occasion. Guys, there's a big girl kids. Burnie, man, there you go.",
      "start": 219.92
    },
    {
      "text": "with you, punch each other, get nasty, have a great time here, spiteful. Sometimes you get a pie fool. I don't everyone jumping ever finger on occasion. Guys, there's a big girl kids. Burnie, man, there you go. Before you go, Michael, sup? You know, you start calling Candy Auntie a ****. Nailed it with that. Now you're calling a five-fold. You're basing good. Quit playing games, my heart. Quit playing games with my heart. Playing game. We work on afternoon party mood. How long's a? I tell you, I challenge you to a game of Madden. Okay, cool. You want to stream it? Yeah, all right, cool. You have a trillion. I'm doing it. No, no, no. Yes, you have an edit to do today. You can't keep. I see that **** thing get put on the calendar. I can do it. I'm in a bowl to use real college. There's always better content can make. You didn't even watch the show. Where's the nutritional information? It's a lot of, yeah, I write to a camera that we can use to record that like because I know we had the the free one right now of AIDS. Okay, took the one",
      "start": 257.4
    },
    {
      "text": "the show. Where's the nutritional information? It's a lot of, yeah, I write to a camera that we can use to record that like because I know we had the the free one right now of AIDS. Okay, took the one free one way. Let me good tear. What are these often? We're done with the shows of that. That's what you'd like. Party mode has gotten a little bit bigger than than SHINee's. All right, fine. Go make party. Margo, make partner. Maybe there'll be a Madden stream when I think you're housing this. Use your cell phone if you really get down to it. Yeah, which I'm cell phone that's got to be Kane. Kevin is made of video that's going to get a million views on Patreon within goggles. So I think you can just **** figure it out. You know how those goggles? We got to go. I'm tired. I'm done. When you see when you see this vlog, you won't be. Do we feel like we should just keep Kevin out of the office for everything if Jimmy is out of the world in cotton? Well, yesterday we realized that we really needed him because there was a",
      "start": 332.07
    },
    {
      "text": "you won't be. Do we feel like we should just keep Kevin out of the office for everything if Jimmy is out of the world in cotton? Well, yesterday we realized that we really needed him because there was a lot of stuff going on that Joey and Tim were like confused about out. Like we do need a son. Yeah, we figured it out where I think Joey another week. We don't we don't use. I was always on location for down lock chatter. A drag IO5 in the chat who says, Greg dancing equals broke in a robot. Believe everybody clip that out and send it to me. I didn't get a chance to excel. If you like that, I think I was wrong. You can watch the Kinda Funny Morning Show each and every week to here on Twitch.tv/KindaFunnyGames or get it later as a podcast on podcast services around the globe or on YouTube.com/KindaFunny. No matter where you get it, thank you so much for your support. Remember, we give away a video game each and every day here on the Kinda Funny Morning Show. You can be entered to win",
      "start": 368.43
    },
    {
      "text": "Kinda Funny. No matter where you get it, thank you so much for your support. Remember, we give away a video game each and every day here on the Kinda Funny Morning Show. You can be entered to win simply by being Twitch chat or being a Twitch sub or supporting us and either one of our Patreon to the dollar up level, which would mean you get the Kevin and Cool Greg vlogs from NYC flash SummerSlam. That'll be going up. Very excited about it. It's it's really good. Like I'm like, I don't know. I don't know what I was expecting, but there's music to it. He speeds it up, he slows down, he puts on like he has titled himself, and it's him and Cool Greg. And there's always fun to watch. But Greg, I'm not selling it. I'm not I'm not this isn't like a pre-K in thing. What I am selling, driveway, go. What is it? The KindaFunny.com/store or at least kind of a KF Summer Sale. Capital K, capital F, capital F, capital F. Now here is where we discover, is it time to give away Burnie Burns's Tesla as you may or may",
      "start": 412.76
    },
    {
      "text": "KindaFunny.com/store or at least kind of a KF Summer Sale. Capital K, capital F, capital F, capital F. Now here is where we discover, is it time to give away Burnie Burns's Tesla? As you may or may not recall, this week there was one review here on the Kevin Coello like the party shirt, a very limited shirt. It was getting thumbed up, and we said if we could get it to 4,000 thumbs up, we would give away Burnie Burns's Tesla. Let's check it. Go on down. Let's see what we got here. Where are we from? Hopefully he's on this limited edition shirt type. Magnum, edit. Ah, so close. 98 thumbs up. Looks like Burnie Burns gets to keep his Tesla another week for now. But we will get it worth close. Here's how what people don't understand. Thumbs up get exponential growth as time goes by. Well, no, this is similar to the bongos thing where we set the goal, we fell short of it. Yes, Burnie Burns gets to keep his Tesla. I don't like that. I don't either. But",
      "start": 454.94
    },
    {
      "text": "exponential growth as time goes by. Well, no, this is similar to the bongos thing where we set the goal, we fell short of it. Yes, Burnie Burns gets to keep his Tesla. I don't like that. I don't either. But apparently the thousands me who watch this don't like going over there just click that **** thumbs up. Too hard for y'all to hire for a little Zayger to roll over. They want to crush his amiibos. You know what I mean? You know Amy Gill got there was you ready to click it and she's like, oh, I need more Lucky Charms. Do you think I rename your network just wants to take a **** shillelagh to all of those amiibos? Don't we old? I do. I'd like him to line them all up and I want a one by one **** recreate that golf team that from cash every building. What a tee upon the. What I would like to see is if we keep this Kevin Coello man-about-town blog series going, the first-person perspective of him kicking in Zayger's door, cannonballing through a window, knocking all the amiibos on the ground. Get the **** out, Kevin.",
      "start": 501.26
    },
    {
      "text": "Kevin Coello man-about-town blog series going, the first-person perspective of him kicking in Zayger's door, cannonballing through a window, knocking all the amiibos on the ground. Get the **** out, Kevin. I'll take it too far and do something dumb. I mean, I, well, based on the ring I just said, I don't know if I could give you taking much further than that. Sure, that's true. All house is like, like, what is I your lift the weight doesn't really something else in Southern California. I know you know how are you better the house? No, better side his room. No, should we go to his house any minute? Mom trying to try to and he ran away and left. Can you handle it that way? How did that stop you from meeting his mom? His mom what the key mom? I was like, I want to meet Zayger's mom. And he said, no. You think that it's all a lie? The furniture thing's a lie. And they're like, they're super famous. He's like, he got adopted by Brad and Angelina. And that title is all these amiibos want to buy an angel and his kid. Yeah, he's like,",
      "start": 550.18
    },
    {
      "text": "a lie. The furniture thing's a lie. And they're like, they're super famous. He's like, he got adopted by Brad and Angelina. And that title is all these amiibos want to buy an angel and his kid. Yeah, he's like, they said, kiss. Yeah, yeah, they were like, you know what? We're tired of all these like really eccentric, yes, their kids. We're going to go as Zayger. We're going to go with like, who's like, what is the mile iliac, Nick? Nobody knows. Nobody knows of something in there, but we don't know what it is. When I Gillian, what ace is in Zayger? That sounds like a thing. If you had to guess like a tiger or an eight ball, what would be those ingredients in the eight ball? You know what I mean? Well, like how much of it was like, okay, for save in mozzarella sticks. Fair enough. Yeah, okay, I care about that is, I think we should do, okay, Leila's not will tell anymore. Do this. Okay, but I think at some point, yes, we should make a trip down there and have and have Zayger's parents every mall and make it dinner. Sure. Yeah. Oh, yeah, girl.",
      "start": 587.41
    },
    {
      "text": "okay, Leila's not will tell anymore. Do this. Okay, but I think at some point, yes, we should make a trip down there and have and have Zayger's parents every mall and make it dinner. Sure. Yeah. Oh, yeah, girl. Yeah, just keep their shirts like it open. Happen where you have Amazon, Megan. What do you think of what your son is to come like to a little break? I like, no, no, no, no, no. What do you think of what he's become? I don't know. And then use the words that you can't leave. And then you just under the table **** the hammer of the gun. Ah, we live every week. You know, needs to be real fun. Now these were in their sweatpants. And I like that one bit. Friday, every weekend. Tim, start of the weekend. Four hours ago, my friend, that was good. Did Tim ever leave the weekend? Another question is next to the housekeeping business. Kevin and Cool Greg are in New York for SummerSlam. I'm sorry. I exactly know what everything I just mentioned to sale, right? That was good enough. There's a sale. This shirt's on sale. Super cheap. You can",
      "start": 628.78
    },
    {
      "text": "Kevin and Cool Greg are in New York for SummerSlam. I'm sorry. I exactly know what everything I just mentioned to sale, right? That was good enough. There's a sale. This shirt's on sale. Super cheap. You can go hang out Kevin and Cool Greg tomorrow, August 19th, at Union Hall before the NXT show. They'll be there. Don't get either them too drunk. I don't like that. What drunk? No, no, that's a bad look. Kevin, Kevin will be all grabbing people talking about how much he loves Kinda Funny. Why? So I thought them, which is what is a funny way does it to me? I like it. It's Newton, handsy. I mean, he said, why? Okay, well, we're all winter. Where you learned that from? Yeah, we're talking about learned it by watching you table. Dare you. How dare you drop a 7-7 says, are they going to NXT? I guess else to watch the vlogs on Patreon to find out. Now they are. They're going to they're going to say, I guess so. This week we wrote Nick more than anyone else happen, right? Because these packs is texture and thing. Yeah, but refer you had",
      "start": 669.13
    },
    {
      "text": "to find out. Now they are. They're going to they're going to say, I guess so. This week we wrote Nick more than anyone else happen, right? Because these packs is texture and thing. Yeah, but refer you had big hair. And you know, I'm a sucker for Meg because you sit her down, you're like, Nick, do you want you want Meg itachi of like, sure, why not? Okay. And then everyone else can just get that opened the door cheer. Then I can open the door for the Gavin, Axel open. You're going to get at RTX 8. If Gavin's kind of tough to be, you can put them. I'm going to give them the **** Patriot and the action. Yeah, but right now that's what I like to see you **** not imagine it. 7th, 11th, it's the top. That's what I think you're know tasks without representation, Veronica. Yeah, that's worth **** talking to take your **** evil empire. Go back across the pond, Gavin. Get out of your Gabby. Slow it down, sir, cuz I don't mind to speed it up on your ass. Thunder, let's get into the news. Sounds good. First news story, not much",
      "start": 718.48
    },
    {
      "text": "evil empire. Go back across the pond, Gavin. Get out of your Gabby. Slow it down, sir, cuz I don't mind to speed it up on your ass. Thunder, let's get into the news. Sounds good. First news story, not much of a news story, but Defenders is actually available now. The Defenders on Netflix. Uh, not much a minister here. I just want to see if you actually give a **** about. I do give a **** about this. Do you? I do. Do you think I like honorable death looks as things? Now that is that with a bunch of caveats. I like the Marvel Netflix things. Heard Iron Fist is terrible. Didn't watch it. Yeah, loved Daredevil Season 1. Watched one episode while folding clothes. The Season 2, it never came back, which I regret, which I regret. You're fine. But I want to have The Punisher. Watch. You can watch the first I met a letter and the last episode, but all the stuff with the ninjas in between is super boring. Okay, that's good to Punisher yourself. Jon Bernthal does a great job as Punisher. Yeah, they put on the trailer for his thing",
      "start": 759.61
    },
    {
      "text": "the last episode, but all the stuff with the ninjas in between is super boring. Okay, that's good to Punisher yourself. Jon Bernthal does a great job as Punisher. Yeah, they put on the trailer for his thing today. I use ****. He's great. He's just a great actor. Yeah, yeah. And he has some of the key has the best monologues in any of the Netflix like Marvel. Has this great monologue where you like **** up. They're not normal, but inside a lot. Love is baby. The last because this is like is like best could have a half-measure model or is like, you're a half-measure man. Like, yeah, and you're one bad day away from being me. Like bad. That's basically it's **** exhausting, but he's got such good. Hey, that happened in the first four, the last one thing is the first three. Okay, last season. Okay, I'm a first boy. Yeah, so what happens is so randomly the season kind of breaks in half and the Elektra story comes in. Yeah, as a whole other set of like villains. Yeah, like the first. It's very weird. I don't know why they",
      "start": 800.4
    },
    {
      "text": "**** this **** up like that because they you need Punisher. You even give you want to see. They need to do five episode season of The Defenders. Five episodes. Yeah, they stretch it to eight to ten, and they just got three or four. Those episodes are filler, and that's all the Elektra stuff. The woman who play Elektra is great. Yeah, I mean, she was the one on The Colonies. It's just that story. Like, I really want to get back to The Punisher. Yeah, you don't see it for like three episodes. Outside of that, the Luke Cage. I like up until the end when they **** brought in Copperhead. Never ever. The bad guy was. I mean, really when it's Cottonmouth, I was like, totally. And I loved it. I just like, I like the Mike Jones so much. The nice man met him during up at noon. Huh? Mike Jones. Don't do this, Tim. Rapper **** to",
      "start": 836.13
    },
    {
      "text": "me. And then are we going to talk about how great Jessica Jones is? Because Jessica Jones is phenomenal. I love Jessica. Jessica Jones was insane. Here's the deal. I would you like, oh, it's my man. If you know what, I want you to go home, make yourself a box of Kraft Mac and Cheese, walk all Jessica Jones tonight. Jessica Jones is what I really feel like I notice of Florida campaign, but I feel like a lot of the Netflix Marvel shows should be more like that. It was it was darker. That's what stood. Yeah, it was really **** up in time. Yes. And it was beautifully made. So like, and I had it had less to do with the powers and more to do like with the psychological aspects and the care and working in the character. Yeah, and those were great, which I haven't seen Iron Fist, but I hear that they took a completely",
      "start": 877.77
    },
    {
      "text": "the powers and more to do like with the psychological aspects and the care and working in the character. Yeah, and those were great, which I haven't seen Iron Fist, but I hear that they took a completely polar opposite approach to that, and I just made it super boring. Mmm, super generic. I didn't love Luke Cage though. I know. Okay, so here's my thing about Luke Cage is, I want to say I love the Luke Cage. I loved portions of it. I loved Mike Jones. I loved Cottonmouth. I mean, yeah, exactly. Cottonmouth. Come the **** on, Remy, my boy. Yeah, I'm all about that. It's like I said, the end there, I felt it fell apart. It went on too long. I like to pop the barbershop guy. Like, I liked a lot of it. I look back fondly on on a musical though. I think you mean my question. Damn, thank you very much. I do mean Mike Colter. Sorry. Good caller. You that be what you look like that Jess is yelling. What's **** today? I'm getting involved in Mike Colter. Mike Colter still a nice man, even though I got his name wrong. My own great rapper.",
      "start": 921.42
    },
    {
      "text": "caller. You that be what you look like that Jess is yelling. What's **** today? I'm getting involved in Mike Colter. Mike Colter still a nice man, even though I got his name wrong. My own great rapper. Don't have any no pass through Mike Jones from Marvel Games. A great guy. Uh, can we just agree like, is there a Michael Jones? Is, you know, I can't ever. There's a Lindsay Jones. She's had a baby with Kojak Paladino, Jack Palance, Tina. Hey, they're our friend anyway. No, I am excited about this then because Luke Cage, Jessica Jones, and Daredevil. All right, cool. Yeah, I like those people. I like those cares. The things I didn't like about Daredevil was, and I know this is blasphemy because we all loved him in Mighty Ducks, but Foggy is a terrible actor in Season 1. Tastes terrible. Every delivery, every line, everyone give them like, dude, I mean, I don't know, man. I feel like Nick could do better than. I know this. I mean, I'm Cool Greg. You Adam's spritzing off the edge to profit that Foggy, the actor's not bad. The",
      "start": 964.65
    },
    {
      "text": "give them like, dude, I mean, I don't know, man. I feel like Nick could do better than. I know this. I mean, I'm Cool Greg. You Adam's spritzing off the edge to profit that Foggy, the actor's not bad. The character is stupid and it's poorly written. And you movin' well, nothing interesting. You give that actor a lot to work with. That can be is great in Idle Hands. That's a great point. Maybe they maybe maybe they enough. Also be, I forgot to female lead, the redhead who plays his squad. Uh, she's she's uh, she came from True Blood. He's **** awesome too. But that character again, underutilized in Season 2. Yeah, fabulous. Um, the Daredevil. Yeah, I feel like Daredevil Season 2 is unjust a near miss for me. Jessica Jones Season 1 it **** awesome. Luke Cage. I couldn't give him the first two episodes. Those abortion. My man sucks, man, because I love him so much in Jessica's. And Jessica Jones is so terrifying during those moments were like, it was just so good. And you get to Luke Cage. Like, this is a totally flawless",
      "start": 1007.76
    },
    {
      "text": "my man sucks, man, because I love him so much in Jessica's. And Jessica Jones is so terrifying during those moments were like, it was just so good. And you get to Luke Cage. Like, this is a totally flawless lead if ur Angele from it. You created feel like it just like nothing happens for the first two episodes. Like, I'm not going to try to get involved. It's like, clearly you're to **** get involved with bro-ham. Clearly you are. There's a cool scene in the diner with everyone sighs to shoot him and **** them all up on it. That's cool. Good. And nothing happens for a while. All right. Just difficult for me. But I'm excited about this. I saw a headline that was like, every one of the Defenders is great except for one character. You didn't read that. Didn't read the story. But I'm guessing I know which one it was. It's been rough because the reviews for this already came out, and it was lighting last week or earlier this week. It's all blurry. And they were talking about how Iron Fist is as bad as he wasn't realize.",
      "start": 1052.34
    },
    {
      "text": "rough because the reviews for this already came out and it was Lightning last week, Murphy earlier this week it's all blurry and they were talking about how Iron Fist is as bad as he wasn't realize this show and everybody but this shows kind of stuff aware of that so they like Luke Cage gives a **** for if there's be another **** pretty boy everything handed to him **** whatever but it's still too much of him and out of them I'm going to give it a shot I'm not leaving a shot just judging but the problem is just too much content too much do banners bring back Jessica Jones season to have Daredevil in it from and we're not going what I'm happy with of course is that while Marvel and comic-book movies are you know maybe there's there's a lot out there you can't watch everything Star Wars not over saturated there you go not an all over segue into the next game crack away that was a Greg Way next pretty short what is that what's happen Andy we're going to party one of them Andy what",
      "start": 1089.39
    },
    {
      "text": "not over saturated there you go not an all over segue into the next game crack away that was a Greg Way next pretty short what is that what's happen Andy we're going to party one of them Andy what the **** we don't have shown here shut up John Boyega confirms Prince William, Harry and Tom Hardy cameos in Star Wars: The Last Jedi now of course the new Star Wars franchise is no stranger to fun cameos last time we had Kevin Smith with the voice of one of the stormtroopers named Craig. Daniel Craig was actually a stormtrooper yeah which is really really cool sad they couldn't ask Kevin Smith the beans he's not quite skinny enough yet that was a poke accountants man it wasn't really a poke you kind of compliment because not skinny enough yet he's been literally absolutely right on that Kevin Coello diet I've had enough with those secrets says the actor John Boyega has confirmed the UK Royals Prince William and Prince Harry and actor Tom Hardy did in fact film cameo roles in Star",
      "start": 1126.29
    },
    {
      "text": "Coello diet I've had enough with those secrets says the actor John Boyega has confirmed the UK Royals Prince William and Prince Harry and actor Tom Hardy did in fact film cameo roles in Star Wars: The Last Jedi during a movie with BBC Radio 4 this morning Boyega was asked whether the Royals were given lines in the film during the cameos as stormtroopers quote I think they took that scene out he deadpanned anyone had to say damn it I've had enough for those secrets he laughed they came to set they were there I'm sick of hiding it I think it was leaked anyway there were images every time I get asked I had to dodge it I'm tired of dodging it they were there Tom Hardy was there too now here's what I like I like a mental breakdown good job when I got clearly being crushed under the immense pressure put on him by Kathleen Kennedy and and and many of those in Disney an antenna gar money not only did he give up the fact that Prince William and Harry were there yeah he also feared Tom",
      "start": 1170.59
    },
    {
      "text": "pressure put on him by Kathleen Kennedy and and and many of those in Disney an antenna gar money not only did he give up the fact that Prince William and Harry were there yeah he also feared Tom Hardy to the flowers open Tom Hardy's like what the **** do you no one knew I was in it yeah well you don't think I'm arrogant there he's on set are they saying he would different visited upon would set in mid April of last year at the time Daily Mail quoted source who claims the princes filmed a scene in which Rey and Finn infiltrated secret base where the characters on lift with Nikola Torres character when a group of service enter two of whom are William and Harry early this year Gary Barlow confirmed that he was given a cameo The Last Jedi will be released in December Tom Hardy has intimated the same great use of that word yeah yeah apparently Tom Hardy had sort of like the mic maybe maybe I'm on if they put Tom Hardy as a stormtrooper in another **** neck we're gonna talk yes because",
      "start": 1209.41
    },
    {
      "text": "the same great use of that word yeah yeah apparently Tom Hardy had sort of like the mic maybe maybe I'm on if they put Tom Hardy as a stormtrooper in another **** neck we're gonna talk yes because the fireball you're looking for I was born in the rebellion act of rebellion because someone put me in a cave side note here that it's on track kind of what we're talking about in Wet Hot American Summer the new show is that Jai Courtney in Episode one who's like to add is that Courtney yeah that's our because I've struggled my entire life he's so much better with that kind understanding if Jai Courtney and Tom Hardy I weren't the same person because it was already you saved a courtier Michael J way like severally not because then it was the thing where Tom Hardy was going to be in Suicide Squad but then he got pulled out but that was stuck in my head so for the longest time I thought Jai Courtney knew that and then I'm like well who the **** is Jai Courtney well we could give me a clear",
      "start": 1247.75
    },
    {
      "text": "Squad but then he got pulled out but that was stuck in my head so for the longest time I thought Jai Courtney knew that and then I'm like well who the **** is Jai Courtney well we could give me a clear answer The Revenant came out and I look okay and it was it Jai Courtney I hit my touchstone with him is that he played John McClane's son yeah she's got and a really good date I thought I saw that one which was an abysmal failure which is the more Justin Long and that is Live Free or Die Hard which is in my opinion what the **** franchise should absolutely aspire to be so that's the one where Justin Long get to deliver the amazing line Regos did you just take down a helicopter with a cop car versus to get a down I haven't say that yeah I care about the dope ass dude though really does that's one during a fire sale yes okay Timothy Olyphant is a bad guy Maggie Q is one of the bad guys they somehow drive a car lost like the median I know there's a great as a weird scene and there's",
      "start": 1303.79
    },
    {
      "text": "that's one during a fire sale yes okay Timothy Olyphant is a bad guy Maggie Q is one of the bad guys they somehow drive a car lost like the median I know there's a great as a weird scene and there's something I don't get I don't really question it where they're in a power plant right and they drive a car through the wall of the power plant and then down an elevator shaft that goes like 500 feet I'm like well they on the top level of power plant and if so how the **** did they get the car of their power plant built 500 like stories into the ground we're nine man nuclear bunker yeah maybe well maybe but it's a great seat okay great senior what else the upcoming Star Wars I got more Star Wars news dude dude dude dude a news story comes from The Hollywood Reporter this is from yesterday but it was actually it came out right as we were wrapping yesterday's show so I thought it merited a little bit of back and forth a little old can't protect you guys priority that many but Borys Kit",
      "start": 1347.98
    },
    {
      "text": "it was actually it came out right as we were wrapping yesterday's show so I thought it merited a little bit of back and forth a little old can't protect you guys priority that many but Borys Kit right look at this photo Ewan McGregor has not aged well due to this insertion oh it's terrible man beer no what happened is he did he got heavier the Trainspotting 2 know a method actor I said a method actor rather than there it's all the drugs in the world Star Wars Obi-Wan Kenobi film in the works thankfully many more lot of people pick that up that is picture of Stephen Daldry who is being cool not you know it's not Ewan McGregor he's be gosh it has the word for to correct the new Obi-Wan come behold we have not confirmed yet whether or not Ewan McGregor will be in the movie he has to be the writing happen if he's not and is what our world will riot who look he's still by the way stop Trainspotting 2 yeah great movie yeah if you like Trainspotting not so great movie if you don't",
      "start": 1389.74
    },
    {
      "text": "be the writing happen if he's not and is what our world will riot who look he's still by the way stop Trainspotting 2 yeah great movie yeah if you like Trainspotting not so great movie if you don't like Danny Boyle of Trainspotting expands on the genre of everything is fine it's never lies I never watched Trainspotting 1 it was about drugs Nick I took a dare pledge it's about heroin and it's about the perils of heroin even thoughts about all the shenanigans you can get into while you're on heroin so like it's like a midsummer night's drama pick this movie to you lay it on me way to pitch in Trainspotting all traded with Trainspotting 1 a bunch of hooligans yeah okay and Scotland right get into a little bit of a little bit of trouble so they can fund their heroin addiction alright and that's it that's it well it's a Ewan McGregor uh from the hit film Phantom Menace sure would say sure Jonny Lee Miller from the hit series on Elementary on CBS right now or CBS remitted to",
      "start": 1436.87
    },
    {
      "text": "alright and that's it that's it well it's a Ewan McGregor uh from the hit film Phantom Menace sure would say sure Jonny Lee Miller from the hit series on Elementary on CBS right now or CBS remitted to Lucy Liu in it he plays Sherlock Holmes she plays a Joan Watson because you're like Watson. Watson, thank you she plays Watson of course during the mower also from Hackers which is why I watched movie because it was such a huge **** Hackers fan and I was like Jonny Lee Miller's in another movie I'll watch it let me tell you something about this movie really **** up really twisted has a scene where two scenes that stand out one where he loses this pill with like methadone pills but he was going to shut up his ass he accidentally poops it out and he has to go he's so high that he has to go into the toilet to get the pill and he's just doing he's like sweet on his head just **** yeah he's knocked out and there's another scene where he sees a dead baby crawling on the ceiling yeah",
      "start": 1478.72
    },
    {
      "text": "go into the toilet to get the pill and he's just doing he's like sweet on his head just **** yeah he's knocked out and there's another scene where he sees a dead baby crawling on the ceiling yeah I don't watch this movie at all it's locked up but from what I've gathered from the trailers correct me if I'm wrong is it true is it true from the trailer for Trainspotting 2 that the sniper from Wonder Woman is in this franchise say that one more time I saw the trailer for a Trainspotting 2 is it true that the sniper Wonder Woman is in Trainspotting 2 which I then meet he's in Trainspotting 1 and I think he might be the stuttering guy from Pearl Harbor yes yes that's my right here did I do a little harbour reference he got me I got you he's the one spikes buddy buddy spot I believe it okay yeah we can go he has a great line that I always say everyone small from Trainspotting where he's like pitching he's trying to get a job yeah and he has included is increase your leisure and my",
      "start": 1524.5
    },
    {
      "text": "okay yeah we can go he has a great line that I always say everyone small from Trainspotting where he's like pitching he's trying to get a job yeah and he has included is increase your leisure and my pleasure so to speak I love saying that there's a lot of a bunch of Lies from Trainspotting there's a lot I'm sure do you see the beached great Jonny Lee Miller doing it so anyway if the end is only one movie I hope they make it long story short they have to make it now where are we right now that there's a rumor that this is happening well I'll read the story really for me is Star Wars is do us hope the oscar-nominated drugs behind Billy Elliot in The Hours both great films in early talks to helm Star Wars standalone movie centered on Obi-Wan Kenobi The Hollywood Reporter has learned sources say talks are at the earliest of Ages and that the project has no script if a deal is made all three Daldry will oversee the development and writing with Lucasfilm, a loose stone brass everyone's",
      "start": 1569.77
    },
    {
      "text": "say talks are at the earliest of Ages and that the project has no script if a deal is made all three Daldry will oversee the development and writing with Lucasfilm, a loose stone brass everyone's going to be standalone is one of several projects being developed by Lucasfilm and digital files of the trilogy is telling the saga of this kind of Skywalker family a Han Solo movie is now in the final stages of shooting Rogue One, and Lucasfilm is also considering a pics centered on Yoda and bounty hunter Boba Fett among other characters doesn't sound like there's much more other than that well if you remember when all this started happening when suddenly people cared about Star Wars again Ewan McGregor was out there on the red carpet for whatever **** Nicole Kidman flick he was doing about it I'm getting washed away but like I'm the same age as Alec Guinness was once I should come back and he brought out their license like whoa calm down he was I could do with still and he's like doing some",
      "start": 1608.5
    },
    {
      "text": "getting washed away but like I'm the same age as Alec Guinness was once I should come back and he brought out their license like whoa calm down he was I could do with still and he's like doing some result yeah he said that and everyone was like it was weird because he kind of he was out he put himself out there was like I would totally I want to do this again yeah and everyone's like that makes a lot of sense yeah whatever unit people are like we want to create a wife to me still a lot Marvel and Disney right the whole family Disney, Marvel, Lucasfilm they do things that make sense so yeah they like money they look like when you say hey I would when you say hey Ewan, you gotta get over it okay your merit you're a married man now it's gonna live might touch you I'm not going to say anything she can touch me whenever she want is she here right now yeah did she bring her entire exchange no no no her older sister's not here okay everybody else is I'm sorry hey everyone hi so",
      "start": 1648.01
    },
    {
      "text": "say anything she can touch me whenever she want is she here right now yeah did she bring her entire exchange no no no her older sister's not here okay everybody else is I'm sorry hey everyone hi so on thing is I this makes sense I think that Lucasfilm probably think this makes sense Kathleen Kennedy she no joke she's gonna figure it out okay we're gonna get Ewan McGregor back in the cowl yeah or that rope thing that we hold with rogue guy thing yeah yeah yeah give another costume for Christ's sake give me little bit keep the boots that's all I'm saying next news story not much video story here but this was kind of fun more Star Wars right that's all we got more start with lost our still a nice start where this comes again from Hollywood Reporter's that Driver teases unexpected Kylo Ren development when asked if people were going to be happy with what happened to Kylo Ren Driver response god I hope I think will be hope I think it will be hopefully unexpected how does that means now I",
      "start": 1685.64
    },
    {
      "text": "when asked if people were going to be happy with what happened to Kylo Ren Driver response god I hope I think will be hope I think it will be hopefully unexpected how does that means now I don't care I don't want to know I don't know but I don't really I don't want to know anything about I wanted to unexpected would be him dying him going to the good side right getting legs chopped off instead of hands cuz Darth Vader is knocked off later up and they put him in and his grandfather's Vader outfit but it was all like a cool color like pink and he just was going out there and like delivering food to like like people that were sick let me lay this on you chumps legs off of the knee right starts to fall but stops with the Force right and then he's got lightsaber legs like they were laid up for a while we need a shelter peril idea keep using the Force to not melt worth the dying like I she's been a leader I think she breaks through the other side of the spaceship I oh my gosh and that's",
      "start": 1724.97
    },
    {
      "text": "for a while we need a shelter peril idea keep using the Force to not melt worth the dying like I she's been a leader I think she breaks through the other side of the spaceship I oh my gosh and that's how Kylo Ren's and I would bet that would be unexpected where the fact I just called it's another back the writers board on that with there you go Joey bring up this last news story while we're here I told you I wasn't gonna want you to bring this news story up but let's just go into it I want to see Greg's reaction to it Shaft reboot. Shaft casts independent state actor Jessie T. Usher uh sure okay do you care about Shaft at all no I mean I enjoyed this Samuel L. Jackson's Shaft Alan oh my god I did see one memory Samuel L. Jackson and I'm a soda sort of curveball crowbar member the bad guy wasn't that no Christian Bale I think I could has gotten that wrong I'm gonna look it up right now because my knowledge movies is not that bad yeah they tried to reboot with Samuel L. Jackson as a franchise",
      "start": 1767.48
    },
    {
      "text": "that no Christian Bale I think I could has gotten that wrong I'm gonna look it up right now because my knowledge movies is not that bad yeah they tried to reboot with Samuel L. Jackson as a franchise forehead me did not do what it's supposed to be a franchise you know oh yeah they wanted to make multiple Shafts and it just I don't think it fit very well you can only have one Shaft using object is awesome but then you know what it was I like look that as a precursor for him going to Nick Fury so we have that Shaft I'm sorry Nick I'm familiar with him being Nick Fury but I don't remember exactly like what a line from him is making or sound like you know Oh Nick Fury look ah ah welcome you back to ok Angela left I as a direct quote from Avengers: Age of Ultron it's Marvel I don't die did you see that he's like nah confirm for any of the other movies or some **** like that yeah here's a headline I didn't have been back I probably he's not there Daniel Craig can go back for a fifty fourth",
      "start": 1813.39
    },
    {
      "text": "that he's like nah confirm for any of the other movies or some **** like that yeah here's a headline I didn't have been back I probably he's not there Daniel Craig can go back for a fifty fourth Bond film they can get Samuel L. Jackson back for head Nick Fury yeah I've had that about you catch a fish oh shoot a few ah Joey somebody added a Twitter link here this one I think unless this is from today oh maybe that on the dock there's a Twitter link on the bottom they're Broken Lizard tweets we read it's slowly reading it as it gets brought up on the screen ok who wants a mustache ride on for 8:0 ass to karana by /drive which are you siding this yeah I bet they're here for like 0 bucks okay here's it yeah late on me unfocused attitude please then other day I think I was on a plane sure coming back from God knows where one of the many trips that we've gone to unless you were forced here I'm not sure probably Austin Super Troopers design if not haven't seen Super Troopers know",
      "start": 1857.96
    },
    {
      "text": "sure coming back from God knows where one of the many trips that we've gone to unless you were forced here I'm not sure probably Austin Super Troopers design if not haven't seen Super Troopers know there on the old headphones it's the snottiness that very first thing with ask room with the kids yeah and I'm like this movie it's still really funny sure and then I got really excited because I remembered 15 years ago however long it's been I helped kickstart this movie yeah or Indiegogo whatever the hell it was like I gave these people to I think it was so long ago you just sent them $ 0 in an envelope it was so long ago I had a carrier pigeon I wrapped around a stupid little foot hit him off and hopefully Jay Chandrasekhar I have a house key got it but it looks like they did because it's movies finally coming out now here's the thing though are you are you confident at all that this is going to pan up fighting appear to be terrible okay but because here's the deal I've always said I'm like",
      "start": 1909.87
    },
    {
      "text": "finally coming out now here's the thing though are you are you confident at all that this is going to pan up fighting appear to be terrible okay but because here's the deal I've always said I'm like they they made these guys are really talented they get one fatal error okay they should have done a film and then I go where they should have been Super Troopers then a follow-up film then immediately done Super Troopers 2 yeah they should have realized that what people want when they want it right instead here's what we're getting okay I'll show this in terms that old Greg Miller cut thanks so much right yeah we're getting hey we made this really cool movie about busting some ghosts let's wait like 30 years and then make the second the sequel is that movie when everyone's hair is all real **** weird and they're not like funny anymore chair was five years old I've been over here now this is five years later know what it did 17 years ago my problem with it what year was one everybody loved",
      "start": 1948.43
    },
    {
      "text": "weird and they're not like funny anymore chair was five years old I've been over here now this is five years later know what it did 17 years ago my problem with it what year was one everybody loved when I was in college or I feel great it's in it's funny I'm not trying to take away from it then they made doesn't want all the **** Broken Lizard you can you party resort around the hell it was which Tim stands by Tim and I made be your fella Brad was terrible Club Dread that was in that area beer **** I think they made something else made another foam in there somewhere but they just totally they tried to make like Broken Lizard was like an established thing that like you knew they were like National Lampoon's but working whether what yeah Broken Lizard with their supers again Super Troopers 2 then maybe get some name behind right here's either you make Super Troopers it makes you Super Troopers 2 one of you guys look like a couple eNOS Christ you know sure and then y'all get back",
      "start": 1988.57
    },
    {
      "text": "to then maybe get some name behind right here's either you make Super Troopers it makes you Super Troopers 2 one of you guys look like a couple eNOS Christ you know sure and then y'all get back together you make Super Troopers 3 you're on them exactly let's read some tips sounds good didn't know you can support us give us money it's great we love you we read stuff here ah Skate Street Player Kid said ask my lady to marry me laughs I mean I am and that's what the famous it was what was when we couldn't think of Slammin' Salmon they I didn't remember that movie how do you know there you go bad bad things broken loose asked my lady to marry me last night she said yes smiley emoji just wanted to share with the gang have a great weekend everybody congratulations yeah that's right uh did I hear right you're married you've met you've met someone who recently loved more less going for you so yeah I love you too babe uh Gerry B. 007 gave a tip no message thank you so much",
      "start": 2025.89
    },
    {
      "text": "I hear right you're married you've met you've met someone who recently loved more less going for you so yeah I love you too babe uh Gerry B. 007 gave a tip no message thank you so much Reading Rainbow which is a great username give it a presenter day can I please get a no call me slash Pony verse from the Suit Seducer / Producer Oh got me it's pretty did you play it not really I don't know I don't know you're gonna lean ooh that's great absolutely if it's a joke I missed it timing you have a conversation no no this is a callback to the years we're at a company called Idea Factory that I do remember that so this fun story requirement we spent three weeks making intros yes for the Game of the Year eggs and that the game of the year thing itself we put like half a day just shooting all the interviews and cutting those together yeah and we wrapped to them one of the wraps was the Okami Rap did you do this did you play it I rap out would you did you do did you say did you play",
      "start": 2068.12
    },
    {
      "text": "all the interviews and cutting those together yeah and we wrapped to them one of the wraps was the Okami Rap did you do this did you play it I rap out would you did you do did you say did you play it not really oh yeah that was that was better Brendan camo that like because everyone loved Okami but no one really plays yeah and Okami I think it gave me your linear I'm not mistaken yeah that's some yeah right, it's yeah that will get snow gee it's scary that wolf is quite funny no that doesn't even okay we also did I'm bringing a Baka with it you did Sex You Back I break it up a lot of further so we're to watch time guys open that Pandora's Box I don't worry about it my favorite thing about the Okami thing that hasn't been talked since they talked about this rerelease again they're releasing it do you remember when it came to Wii and they for the official box art that went to stores and copy and copy Okami watermark the area that you have their box art, his idea was on the cover there's wait",
      "start": 2119.66
    },
    {
      "text": "it do you remember when it came to we and they for the official boxer that went to stores and copy and copy IKEA watermark the area that you have their box are his idea was on the cover there's wait heard that first I got fired that I'm sure well that does suck but also just figure out art better Iban91 maybe I've a message to Kandy Andy Ma it's Kandy by Ball Pick on Kandy I'm here is move a general we generally hear patter when he's coming you know that piece of garbage my favorite one wave did you and Ryan Clements oh yeah then New York Chris did something dumb it was so that video is so good by the way if you owe me just a Thomas when you grab K-Dot coming full weight if it is much a weird ways doing I'm peeing of the year yeah it was fun that's what we use have fun now you're not have fun anymore if you're this stupid show all the time why not have fun or design on it none of us have fun no when we're all adults some of us are married our families are here Handy Andy so I did 91",
      "start": 2163.55
    },
    {
      "text": "fun anymore if you're this stupid show all the time why not have fun or design on it none of us have fun no when we're all adults some of us are married our families are here Handy Andy so I.D. 91 sends a message to Kandy Andy my brother's girlfriend was in Texas last week so I told her to bring us two hangers all the way to Israel so thanks to you Andy we've made some sort of history have a great weekend I will have a great weekend now they've gone international good news right you've never had at winger you got to come go get the Twitter and then have her I'll lick my hand yeah the pickle one food you have you have a pickle one take one view on taste test your brain mop bring back uh Joe Soon101 gave a healthy sentence at hey guys first time watching live is I'm an Aussie I finally made it to your country and it's great so far by the way I went to a Best Buy in Austin and found a Switch they got that day it's good yeah that's the land of opportunity that is America which is",
      "start": 2222.31
    },
    {
      "text": "made it to your country and it's great so far by the way I went to a Best Buy in Austin and found a Switch they got that day it's good yeah that's the land of opportunity that is America which is available sometimes casual racism Goddesstail_ gave a tip and said being an Indian student looking to get a bachelor's degree in computer science at Berkeley should I be worried at all especially considering the current political climate keep up the good work guys you're an Indian student looking to go to Berkeley yeah liberal of places on the planet you're gonna be fine you're gonna be fine alright cool they don't even let right-wing people into Berkeley anymore they literally protest shut down the gates every single time they come in so I think you're gonna be okay maybe okay oh god here we go I'm going to lick it and put on my hand I'm sorry this is you should not have to see that they're a boy I appreciate that they're no longer living in sin now this is of course is Twing",
      "start": 2268.78
    },
    {
      "text": "god here we go I'm going to lick it and put on my hand I'm sorry this is you should not have to see that they're a boy I appreciate that they're no longer living in sin now this is of course is Twing Twing or snack toppings according to think sprinkling on fruit veggies chips popcorn etc choose anything anything what do you like to put it on a keychain is your fiance your wife see what happen around like a like mango and **** like that no remember when we went to that we went to the the the Food Truck Off the Grid and we got a mango that had a whole bunch of hot stuff on it yeah that's when you eat something hot or granular this you know here's a weenie Spanish when you eat something hot or spicy your roots kick in what do you say when you eat soda hotter is likely if you're gonna do if you only do it come on I'm not doing it do ya do it so if I were to eat something spicy a go oh yeah I look so good get in there I've never linked to anybody to come with my mother mom look away boy",
      "start": 2309.13
    },
    {
      "text": "you only do it come on I'm not doing it do ya do it so if I were to eat something spicy a go oh yeah I look so good get in there I've never linked to anybody to come with my mother mom look away boy mom to that you can keep looking about you like it it so much of it it just it's crazy because it tastes like a pickle well you hate coffee stuff already so this is just like that do you like America oh my god one bag for the first like two months she was here she's like why why do Americans put so much salt in everything unlike other America I think you might go fine Godofsteel come to America all right everyone in Canada walking around with such self-sufficiency it's true they don't have any sodium that's why they got rickets time probably without Yawn4PS I love this best friend xoxo this is where one of you goes to kindafunny.com/bestfriend you nominate someone in the community that's doing something awesome we read their name here everybody gets the praise they deserve",
      "start": 2362.32
    },
    {
      "text": "this is where one of you goes to kindafunny.com/bestfriend you nominate someone in the community that's doing something awesome we read their name here everybody gets the praise they deserve today the Phil Online Phil McMillan is shouting out Kate ThereNoNoTKO552 on Reddit I noticed someone posted saying goodbye to their Vita sending it to someone else I responded that the recipient is lucky and I wish I could afford one then come with my PlayStation angel with the following reply quote genuinely I will mail you mine and pay for the cost I have one and don't use it I only bought it for PS4 after many thanks and Reddit messages eventually I received the beautiful PlayStation Vita from Mr. TKO552 not only this but he included a game that I've been waiting to play since I heard as I have heard Greg ranting and raving about it Persona 4 Golden please thank TKO552 from the Kinda Funny subreddit for me he is my PlayStation angel and I love hit or I love this",
      "start": 2419.41
    },
    {
      "text": "since I heard as I have heard Greg ranting and raving about it Persona 4 Golden please thank TKO552 from the Kinda Funny subreddit for me he is my PlayStation angel and I love hit or I love this wonderful and giant um or kind of heart oh I love his jaw wonderful in China heart very cool trying to find it so she bought it doesn't we can we can watch you funny videos from IGN later you don't have to just be here with me be sure with me you don't need me ask you I can you down for years time gentleman to give away to video games how do you win video games here are the Kinda Funny Morning Show it's simple being the chat like so many of you are right now or there are three ways to amplify in case you don't want to be here remember you can watch us live on Twitch.tv/KindaFunnyGames but you can get the show on podcast services around the globe and YouTube.com/KindaFunny so if you want to have a fire win when you're not here it's simple subscribe to us on Twitch",
      "start": 2463.88
    },
    {
      "text": "games but you can get the show on podcast services around the globe and YouTube.com/KindaFunny so if you want to have a fire win when you're not here it's simple subscribe to us on Twitch remember if you have Amazon Prime you have Twitch Prime you have to give away that free $5 subscription every 30 days or Amazon sits on your money like some kind of troll leprechaun just laughing you want them to be happy if they're there like Smaug from the hit film franchise The Hobbit one two and three and when that drag is just sitting all that gold nope didn't watch it don't let impaired loud okay smile I say it the right way seems like it's Smaug I'm like no if they wanted to be Smaug it would have spoke to SM oh gee how you play Shenmue Shenmue Shenmue Shenmue Wow I've always thought of Shenmue and then he was trying to me Shenmue yesterday I don't know I can you Shenmue yeah Shenmue playing Shenmue Shenmue yeah it certainly any sense a Shenmue I can't tell we spoken with me in the",
      "start": 2508.82
    },
    {
      "text": "you and then he was trying to me Shenmue yesterday I don't know I can you Shenmue yeah Shenmue playing Shenmue Shenmue yeah it certainly any sense a Shenmue I can't tell we spoken with me in the chat my defense Oh subscribe us on Twitter automatically energy when our self gets the Kinda Funny little connection name cool emotes private chat time with us and you can sway multiplayer games with me like Everybody's Golf in a couple weeks and you get show and free on the Twitch player lets me bake them in but - - that's why we're giving way to games doesn't meant you go to Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames as well support us at the $ and up level there you get to watch us do overtop cath lab do you want to you get really access to all the shows outside of the podcast you'll get to see these vlogs over on Patreon.com/KindaFunny from Kevin and cool back in New York you're automatically entered to win everything we give away even if you're not",
      "start": 2546.83
    },
    {
      "text": "of the podcast you'll get to see these vlogs over on Patreon.com/KindaFunny from Kevin and cool back in New York you're automatically entered to win everything we give away even if you're not here Nick yes you do number one add all the number two a bounce cop look at it on your Game of the Year video Metroid's 2 for Valor for me oh it doesn't matter right handle motion as it's going to take us out of the show here everything put in to do today don't get me guys maybe unwire is here to do the next show we mail or any wire just show them whenever the hell he wants and we got to talk about this for some **** Tigers I'm tired of him just using us like we're some it was really crazy when he just showed up on the show no Wednesday let's go got this in the lake so it alone like ok first Joey there's a birthing center launch it's from a Dollar Dollar Shape now a lot of shape of y'all Dollar Shave Club is bringing you this first giveaway for the great shape but great price join the",
      "start": 2584.67
    },
    {
      "text": "Joey there's a birthing center launch it's from a Dollar Dollar Shape now a lot of shape of y'all Dollar Shave Club is bringing you this first giveaway for the great shape but great price join the Dollar Shave Club new members get their first month of the Executive Razor and a tube of Dr. Carver's Shea Butter for only five dollars with free shipping on people can't stop talking about this Dr. Carver's Shea Butter the I asked him can you put it on toast and they say don't you put on something better your face your face I heard that once and you're not using it and he's using Dollar Shave Club she's using Dr. Carver's better as soon as he comes in Gia oh she's right over it yeah she licks him and she goes cheap Latoya Christmas let's spread this all over your back but yeah just to get all that shirt just get smooth get it all area know what I mean like here's my one problem with what you're doing you're saying just to get it smooth yeah it's just timid have a scoliosis problem",
      "start": 2627.12
    },
    {
      "text": "get all that shirt just get smooth get it all area know what I mean like here's my one problem with what you're doing you're saying just to get it smooth yeah it's just timid have a scoliosis problem this is a bad arch for a back no your leaned over and I'm referring she because you gotta love these sometimes you get a little okay while you get a little fluffy back there I like to do this oh yeah I get the angel wing creator you want to get that car that Dr. Carver's Shea Butter I can use the doctors are long way down dollar the crypto crack how I get this how do I get it out on point I had very easy for just a few bucks for five dollars you get with free shipping after that razor just few bucks a month stop wasting time go to stores to buy kits not wasting time going stores to buy gimmicky razors you don't need it will this will change your life that's a $15 value for only five bucks get your Dollar Shave Club.com go $ .00 should come back on slash morning that's DollarShaveClub.com",
      "start": 2669.27
    },
    {
      "text": "razors you don't need it will this will change your life that's a $15 value for only five bucks get your Dollar Shave Club.com go $ .00 should come back on slash morning that's DollarShaveClub.com/morning to get all these fun things and shave your bun so now take your buck AdamGuest1985 has an interesting question yes is Dr. Carver a genuine doctor I does he have a medical degree I'm going to throw this out there but to the best of my knowledge Dr. Carver is every bit as much of a doctor as Dr. Phil everyday nailed it okay this show is also sponsored by NatureBox we all want to eat better but when it comes to snacks sometimes it feels like the whole world is trying to tempt Kevin into caloric oblivion but Kevin it doesn't have to be this way you should have brought the NatureBox next to New York because I'm sure all he's doing is eating pizza handfuls of left and right NatureBox has over 100 snacks that taste to it and are actually better for you all snacks are made from",
      "start": 2705.74
    },
    {
      "text": "next to New York because I'm sure all he's doing is eating pizza handfuls of left and right NatureBox has over 100 snacks that taste to it and are actually better for you all snacks are made from high-quality simple ingredients which means no artificial colors flavors sweeteners so you feel good just put two pieces of beef on each foot needs a steadier I've used this rocks we've had it when we reach the health snack on it when we're at the old play day we love to get it in there got the popcorn the Sriracha stuff is what G is eating now but I would like the pretzels as I say there was a little like almond ball one Oh Halla Ball I have those on the phone they add new snacks every month inspired by customer feedback and of course if you get one of these boxes and you don't like something you can send it back here and just tell them I think actually and they send you stuff for free they replace it no big deal so right now you can save go to NatureBox.com/morning you're off you're",
      "start": 2751.22
    },
    {
      "text": "you can send it back here and just tell them I think actually and they send you stuff for free they replace it no big deal so right now you can save go to NatureBox.com/morning you're off you're offered free free snacks or the first order that's NatureBox.com our shoe now we're giving away games there you go so Joey while we did all that pulp stuff the first thing we're giving white City Skylines on Xbox One this is going the Kinda Funny Games Patreon user Michael Redkowski congratulations you've won City Skylines and Xbox One next winner is Robbie Mims from the Kinda Funny Patreon he's getting a Vostok Inc. on PlayStation 4 yeah a game I enjoy to my great great game you don't know what either those games are great guys sure you Nick tell us that buzzes yeah Nikki Oliver Sadie Scott cities skylines all imitate Mexico not this is this gem this is a darling gem little JRPG right where you go out there and you look at skylines with your phone chair take your",
      "start": 2791.81
    },
    {
      "text": "Oliver Sadie Scott cities skylines all imitate Mexico not this is this gem this is a darling gem little JRPG right where you go out there and you look at skylines with your phone chair take your phone out there and if a little animal comes out of a ball you catch it and you're going slave it that sounds like Pokémon with the next game the next game is Vostok Inc. Vostok Inc. is a great game where you have to go and pitch a bunch of German people on your new pen company this enhancer this pan will write no matter what or what upside down you have you trying to write stuff upside down every once in a while because you look so clear anything and you go sir and they go fasta stop you go buy us a spot one pen write that coma leave a upside down and they go holy **** there's a million dollars you won the game we're due three and for you to patent Moriarty three and three three questions from the chat then three sub questions from the chat then we're going to transfer over read some subs",
      "start": 2839.5
    },
    {
      "text": "you won the game we're due three and for you to patent Moriarty three and three three questions from the chat then three sub questions from the chat then we're going to transfer over read some subs while I get ready for Kinda Funny Games Daily with my Irish Cream Danny or Dwyerkev while we wait for these questions and come in I would like to point out yeah that I've lost here we go MaineAmateur says please finish with I'll Make a Man okay you want to an out yeah before I get to that DefaultAndrew asks does Nick actually know what a JRPG is did you do right I do now of course you guys know that I love singing and Randy Newman lo Singh and Randy Newman makes a song for every single occasion for every Disney film every xrj matter including the hit film Mulan with a titular song I'll Make a Manatee like googling like this I'll Make a Man you you'll make a man me this is gonna get super dark I don't care if you're with your family now when I go there I go there folks did your first",
      "start": 2885.13
    },
    {
      "text": "a manatee like googling like this I'll Make a Man you you'll make a man me this is gonna get super dark I don't care if you're with your family now when I go there I go there folks did your first exposure to us we're going to keep it r-rated GameAKidMaadCity in the chat says if I had a Power Rangers shirt design should I send it to you guys or submit it for Extra Life that's us screw the kid what we're doing it Wow that's a death at White Hart that's a when I earn from how we usually talk about it right up that's this big beautiful case somebody had a long time ago submitted a Power Rangers shirt we like it we awesome did whatever happen that just copyrights we're gonna go dude just working on it you didn't work here yet I'm not putting it on you I would think you both send it to Joey but also submit it as an Extra Life t-shirt design but if it doesn't stain leave an Extra Life primary use effectual eyes yeah unless you you have to make actually we can send it to Joey it kind of",
      "start": 2932.32
    },
    {
      "text": "but also submit it as an Extra Life t-shirt design but if it doesn't stain leave an Extra Life primary use effectual eyes yeah unless you you have to make actually we can send it to Joey it Kinda Funny back home now gonna photos out there right now is the shift gears a little bit yep shrug Tim has been giving me **** for three days straight yeah about me always just having ice yeah come is it hey Nick how about all that ice cream tonight Yeah right they said a real sarcastic like a real **** issue well we'll check it all right man yeah hey it used to have coffee in it but here's what happens when you put something in a cup with a straw Tim knows I'm talking about those oh I got a sip on what's up I can hear you never walking or didn't leave the to cool things one oh you gotta rest easy you got it yeah there's a blog I Kinda Funny what ah it is it is up on Patreon.com/KindaFunny yep $1 or above level right now it's all subscribers over there it's cool dragon cabin in",
      "start": 2981.75
    },
    {
      "text": "easy you got it yeah there's a blog I Kinda Funny what ah it is it is up on Patreon.com/KindaFunny yep $1 or above level right now it's all subscribers over there it's cool dragon cabin in New York City yeah Kevin has those goddamn Snapchat Spectacles yeah recording the whole thing Tim how no I have not seen it but let me ask you a question what how close is it to Home Alone 2 surprisingly yeah yeah it's a lot of people screaming Kevin okay yeah yeah oh hi Anna it's not about that is a good time to check thank you thank you I still have them on you put up the sum you made for put up we're on a live show we tweet about intelligence or sure thanks Lakers had two four three two sets can get am I now ready for that Olan Olan I want to watch to do this he's trying to put the in terms of the faculty other fast mysterious things but the Kinda Funny Games Daily walls are up he did it and did it let's see if it did it was amusing harm bravery okay we got you wearing your Friday",
      "start": 3017.93
    },
    {
      "text": "of the faculty other fast mysterious things but the Kinda Funny Games Daily walls are up he did it and did it let's see if it did it was amusing harm bravery okay we got you wearing your Friday sweatpants er I do this says enough nobody cares Rachel U. Cage wearing sweat pants she seems like she might cares a bit Tim I don't know ArmorTomorrow says maybe if Nick didn't use a clear cup he wouldn't get so much **** about the ice I'm not ashamed of my ice sure you know what I mean I'm not going to go out there hide my eyes from people it's because it might not be as good as your ice or as full of your eyes or as tall of your eyes or thick as your eyes this is my ice you know I think if you're in a shame not about a shame I'm gonna topping that's one thing let's no longer shame about the ice let them stand shame them about the fact that it goes to Starbucks every day and could use a reusable cup in save the environment but a standing keeps doing this which everybody knows gets",
      "start": 3073.63
    },
    {
      "text": "the ice let them stand shame them about the fact that it goes to Starbucks every day and could use a reusable cup in save the environment but a standing keeps doing this which everybody knows gets tossed into the ocean often Antarctica penguins get their head stuck in it then we have super penguins they have helmets on go to space oh they're a super race of penguins hammerhead gotta stop the penguin you gotta get rid of them you have a plastic helmet there's nothing to do exactly exactly we gotta find my jet beautifully what's that it might be a kind of any deal yes that's a short one but I mean I think you got to get more - no no that's enough that's enough suck that fine okay I put in someone go get Hank you we're all in sub only now Fanta_3Men I want to go you know cuz here's the thing I want to go like post about the wall go for the law I look like that don't I know times not gonna do right it was like a hell of log then we got out to my homie that's what it does salad all",
      "start": 3118.84
    },
    {
      "text": "thing I want to go like post about the wall go for the law I look like that don't I know times not gonna do right it was like a hell of log then we got out to my homie that's what it does salad all but if you want a guy I can answer three questions and then do this or they're going to ask okay but I want to talk about me every sometimes that PR guy says easy rule for Japanese words like Shenmue all vowels are short sounds like in Spanish when in doubt read it in Spanish but does he see okay come one piece a nope duh see you said you could do this you can even do like it well people you start asking questions well I mean like Honey Boo Boo says Nick what would be the title of your video of your video game or that I don't know I don't have a video game but if I do have it again it would be penguins and space with element the whole goes there allow this they came free exactly like this but the beginning me more generally it's nothing like a degree they are like missiles yes penguins are",
      "start": 3160.87
    },
    {
      "text": "penguins and space with element the whole goes there allow this they came free exactly like this but the beginning me more generally it's nothing like a degree they are like missiles yes penguins are awesome guys I told you sort of dad at the time I got the pet penguin texting world no it was the keynote I don't know but it's all over my favorite I wanna hear the story I'll tell you I'll tell you later it's going to be great why why why when doing the content with the people here this 1 hamster I went to SeaWorld this is before we all knew that SeaWorld was the devil with an ex-girlfriend of mine in high school and we went to the penguin exhibit great story super enthralling the guys the beginning of the exhibit goes hey everybody pay attention there's going to be a one question quiz after this and whoever gets it right first is to go on the ice and pet the penguin very very end of it he asked the following question how come polar bears don't eat penguins for the answer because they",
      "start": 3207.15
    },
    {
      "text": "this and whoever gets it right first is to go on the ice and pet the penguin very very end of it he asked the following question how come polar bears don't eat penguins for the answer because they don't exist in the same polls oh I was doing a South Pole and so I was like an angelic question he goes sir you want did everyone didn't know what else listen relation of fact three people's hands went up event but my hand apparently being the shortest with the fastest panel when her left less based on travels and most people share alarm sure when I fast win on the ice and the Penguins came out they was like that they were they were a little in a reserved at first and they wild over to us they just hung out no hands up and there was one penguin it was very cute who was in love with the trainer the human trail anybody has a little crush on me we can tell because they're like it's like super Kentucky 11 yeah a very cute that's cool okay they said hey if it's too cold for you if you notice that",
      "start": 3247.11
    },
    {
      "text": "human trail anybody has a little crush on me we can tell because they're like it's like super Kentucky 11 yeah a very cute that's cool okay they said hey if it's too cold for you if you notice that it's cold it's too late you're already suffering for hypothermia and I was like and that's something you tell them before I come on the icer it could have been that cold malleable ball okay we can't we go I coulda just stepped outside OData degrees you just screw with you I just put the Robert 1858 says dogs are burgers tough questions lately dogs and we put a little dogs yeah in particular oh this 1555med says have you seen Batman Harley yet no I heard a horrible horrible thing really yeah it's been ripped apart Oh, sh*t all right well then I'm not going to my microphone I said I'll just wait till it comes on Netflix yeah yeah yeah are you serious yeah I'm just getting destroyed right now because it's like she's super sexualized I don't give out - I'll tell",
      "start": 3286.89
    },
    {
      "text": "I said I'll just wait till it comes on Netflix yeah yeah yeah are you serious yeah I'm just getting destroyed right now because it's like she's super sexualized I don't give out - I'll tell you about I'll link you to a thing because it's all like the gifts of it like our super gross and all this different stuff and they're like they they took the Harley we liked and just totally f*cked up as well that's too bad that's too bad default damage is best Rocky movie Rocky 1 of course followed very very closely by Rocky 4 cuz go America alright yeah yeah yeah so much applied for our country here sorry folks yeah that was supposed to be a joke about tiny Canada it didn't come out right it didn't come out right and now just just going to go deeper into that whole I get a final question get us out of here Jesus is trying to get worse in The Killing Joke says Jill Wilson 1996 I mean I haven't seen it so I want exactly I know ain't Jen cool give us our final comment today says Rocky 3 yay can",
      "start": 3326.58
    },
    {
      "text": "of here Jesus is trying to get worse in The Killing Joke says Jill Wilson 1996 I mean I haven't seen it so I want exactly I know ain't Jen cool give us our final comment today says Rocky 3 yay can I hijack 14 Hi Jared Um Gilmore ask me how I'm enjoying Science Fiction which is the new album dropped surprisingly out of nowhere by Brand New my all-time favorite band yesterday I really like it who's your all-time favorite band Brand New brand okay it's confusing to my old people brain cuz the band's name is Brand New and they have a brand new album I don't I'm saying I don't understand that's great well let's check that out Science Fiction by Brand New album the band's name is Brand New album no fans name is Brand New and their if you believe electronically you know the band I really talk about Science Fiction I thought they were all anything about fiction yeah and the band's called Brand New but ladies and gentlemen we will be back next week Monday 11 a.m. Pacific Time of course here",
      "start": 3370.11
    },
    {
      "text": "about Science Fiction I thought they were all anything about fiction yeah and the band's called Brand New but ladies and gentlemen we will be back next week Monday 11 a.m. Pacific Time of course here it's which that TV Flash Kinda Funny Games with all the news you need to know or want to know or just the sh*t we want to talk about we love you very very much stick around I or Joey will be reading the subscribers in about five seconds while Greg gets ready for Kinda Funny Gaming video which will probably feature Danny O'Dwyer if you decided to grace us with this princely present Danny O'Dwyer again has he tried the 0 okay pour some twang on your hand get him to look it up don't do that put on your dad are you ladies rolling until Monday I will see you at the movie whatever Mawson perfect what a great dynamite sign-off subscribe share it I like share all that Jet Cool",
      "start": 3418.98
    }
  ]
}
