{
  "id": 2876,
  "video_id": "iIjqFq3-34Q",
  "show_name": "Kinda Funny Games Daily",
  "hosts": ["Greg Miller", "Andrea Rene"],
  "title": "Crash Bandicoot Dominates PS4 Downloads - Kinda Funny Games Daily 08.03.17",
  "description": "Andrea and Greg track Crash's success, Friday the 13th's failures, and your questions!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1501794849,
  "duration": 3936,
  "transcript_chunks": [
    {
      "text": "what's up everybody Welcome to Kinda Funny Games Daily for Thursday August 3rd, 2017. I'm one of your hosts Greg Miller alongside the busiest lady in the business, Andrea Rene. Hello, how are you? I'm excellent. I like this cat mug. I was talking about it before we went on. I want to reiterate that I like this cat mug. I appreciate that you're so committed to Kinda Funny, you've begun moving in your own mugs here. That means a lot to me. I was here 4 days this week. That's crazy. It's crazy. You still have one more tomorrow, right? Yeah, yeah. Wow. God, coming back for more. You're doing Gamescast this afternoon. That's right. If you if you support us over on Patreon.com/KindaFunnyGames, of course, you have the ability to watch that live this afternoon. If you want to watch it later, it's on Patreon Friday and then YouTube the next week for free, so you don't have to give us money, don't worry. Uh, thanks for coming back, thanks for doing all this work. Absolutely. Sorry, D, such a dead beat. Yeah, that guy",
      "start": 0.58
    },
    {
      "text": "and then YouTube the next week for free, so you don't have to give us money, don't worry. Uh, thanks for coming back, thanks for doing all this work. Absolutely. Sorry, D, such a dead beat. Yeah, that guy gallivanting around the world, interview game developers and stuff. Oh, we got a big show for you, ladies and gentlemen. If you didn't know, this is Kinda Funny Games Daily each and every weekday on a variety of platforms. We dive in to the nerdy video game news you need to know about, get really in-depthly, give opinions, give stuff, give away things. I don't know. If you want to know more about it, you should be part of the show. KindaFunny.com/KFGd. You can watch it, of course, on YouTube.com/KindaFunnyGames, later podcast services around the globe, or live as we record it, like so many of you are on Twitch.tv/KindaFunnyGames right now. Sorry for the false start. What am I talking about? If you're watching or listening later, you'll never know. You should have been here alive. For now though, let's begin the show",
      "start": 42.96
    },
    {
      "text": "Funny Games right now. Sorry for the false start. What am I talking about? If you're watching or listening later, you'll never know. You should have been here alive. For now though, let's begin the show with what is and forever will be the Roper Report. I was wondering what. Go time for some news. I was like, there's no way Kevin didn't have a plan for the Roper Report jingle. Cool Greg's got a little audio box over there like that. Uh, there are five items on the Roper Report, a Baker's Dozen. Nailed it. Good job, Cool Greg. He's you're on fire today, Cool Greg. I love it. I love it. Uh, we're going to start over on the PlayStation. August tops PSN downloads have been posted. We're talking about PS4 games and PSVR games. Rest in peace, Vita. Uh, Andrea, number one PlayStation 4 game download for the month of August, Crash Bandicoot N. Sane Trilogy. Congratulations, Vicarious Visions. Can this game be stopped? I can't. It's and it was the same in the UK. It was, you know, it charted last, it charted incredibly well last month",
      "start": 83.88
    },
    {
      "text": "Bandicoot N. Sane Trilogy. Congratulations, Vicarious Visions. Can this game be stopped? I can't. It's and it was the same in the UK. It was, you know, it charted last, it charted incredibly well last month based on two days of sales. What the hell? I mean, I thought only cared about this stupid thing. I'll be honest and say that I was also pretty skeptical about how well this would sell through. Clearly, it was going to do at least a couple hundred thousand units, but I would never have imagined that it would, you know, crack, you know, like the million mark. I thought it was totally screwing itself over in terms of sales and the fact that it was coming out so late in the month, right? In in terms of charting, like where it's going to be in terms of uh July and August sales. But to see it destroy July and then continue into August, you're like, holy ****, this thing is insane. Yeah, congrats. And I think this, you know, really kind of paves the way for more classic games to be rebuilt. I'm of the philosophy that",
      "start": 132.96
    },
    {
      "text": "continue into August, you're like, holy ****, this thing is insane. Yeah, congrats. And I think this, you know, really kind of paves the way for more classic games to be rebuilt. I'm of the philosophy that there's so many great new games that don't I don't generally spend my time playing older games, but I meaning for it, right? Yeah, exactly. Uh, Rob writes in to KindaFunny.com/KFGd, just like you can, and says, with Crash Bandicoot being the number one most downloaded game this month on PSN, is this just a sign of a slow month for releases or is the Bandicoot hype real? It's a great question. If you compare, if you see what happens afterwards, right? Number two, Middle-earth: Shadow of Mordor Game of the Year Edition. Number three, God of War III Remastered. Number four, Friday the 13th: The Game. Five, Rocket League. Grand Theft Auto V. Minecraft: PlayStation 4 Edition. Call of Duty: Modern Warfare Remastered. Ratchet & Clank. EA Sports UFC 2. It is Crash Bandicoot standing out as, hey, I am the new game. I I'm the the thing that it",
      "start": 174.92
    },
    {
      "text": "Theft Auto V. Minecraft: PlayStation 4 Edition. Call of Duty: Modern Warfare Remastered. Ratchet & Clank. EA Sports UFC 2. It is Crash Bandicoot standing out as, hey, I am the new game. I I'm the the thing that it wasn't out any of the other months, even though I'm not sure about UFC 2, how that's been out. Never heard anyone talk about that. Never heard anything else. If you're watching live, of course, you can correct us at kindafunny.com/yourewrong. Don't pull the trigger yet. Andrea is clearly working on the release date for UFC 2. March 15th, 2016. Okay, okay. So that was just a sale. So, I mean, to Rob's question, I think it's a mixture of both. I think it's very much the right time to release this game, clearly. And I think that the hype is real, 'cause it's also, you know, going out in terms of physical releases, how well it's selling. We're seeing it on NPD. We're doing it's it's moving moving units outside of just here, right? Yeah, I mean, that is a testament to Activision's ability to really put their marketing powerhouse",
      "start": 222.8
    },
    {
      "text": "selling. We're seeing it on NPD. We're doing it's it's moving moving units outside of just here, right? Yeah, I mean, that is a testament to Activision's ability to really put their marketing powerhouse behind titles. Yeah, this game clearly is right for a digital release. I wouldn't have thought that they would have wanted to spend the production resources making a box, a retail box for this. But me, it's a nostalgic game. A lot of people have a lot of love for Crash in in this franchise. And that's what I think. I think it's a mix of both where I think that, yeah, the fact that you can't get in stores are so hard to find as far as a physical copy is the fact that I don't think they made as many as they probably should have. You got to play it safe. You want to stay profitable. But then it's also the fact that, yeah, people love it, but there isn't that much out. It's it's a great time to release it apparently because there are all these other games people are playing. Friday the 13th jumps out at me in terms of",
      "start": 267.36
    },
    {
      "text": "yeah, people love it, but there isn't that much out. It's it's a great time to release it apparently because there are all these other games people are playing. Friday the 13th jumps out at me in terms of like, hey, here's a newer game people are still invested in, but they're ready for something different. They're ready for this remastered thing that they fans like Tim have been waiting for forever. Absolutely. And I think also, you know, July is a great time to dig into your pile of shame, your backlog games that, you know, you maybe bought or purchased previously early in the year that have just been sitting on your shelf or in your library on your console or your PC or whatever. Um, and so maybe they didn't buy a new game and that also helped lift it to to the number one spot. Yeah, but um, this is just for this is just August. This is PSN downloads for the month of August. Uh, I believe these are US PSN numbers. Over on the UK PSN number, there's no Crash at the top as well. Uh, Brady writes in KindaFunny.com",
      "start": 308.72
    },
    {
      "text": "is just August. This is PSN downloads for the month of August. Uh, I believe these are US PSN numbers. Over on the UK PSN number, there's no Crash at the top as well. Uh, Brady writes in KindaFunny.com/kfgd and says, Greg and Andrea, with PlayStation's list of top downloads released, I was surprised to see Ratchet & Clank still in the top 10 at number nine. I went back and saw that it was number 17 in June and not listed in May. Does this uptick along with the return of Crash and Yooka-Laylee's arrival signal a return to 3D Platformers? What other platforms do you think will likely see return? Spyro? Donkey Kong? Jak? Thanks for all you do. Keep up the good work. Uh, back to what we were just talking about in terms of the competition for Crash. I think what this signals at Ratchet & Clank at nine is the fact there was a sale, that there was something you get Ratchet & Clank super cheap. And Ratchet & Clank was a fantastic game. You need to get what Crash's success means for things like Spyro is really fascinating when we",
      "start": 350.0
    },
    {
      "text": "was a sale that there was something you get Ratchet & Clank super cheap. And Ratchet & Clank was a fantastic game. You need to get what Crash's success means for things like Spyro is really fascinating. When we were leading up to this, Andrea and Tim was all about, saved the Bandicoot, Bandicoot saved, all that jazz. And people and Double D D was in here super stoked about Crash. I'm like, great, they're clearly finding success that there are people there. And I was talking to Jen last night and Jen's like, if they put out a Spyro, that's the one I'll go crazy. I'm like, all right, didn't realize you people existed. I understood people liked Crash and they liked Spyro. I didn't think that there would be the amount of people out there to make these games or Crash number one two months in a row, get it on NPD, do all these different things. Well, I'm sure there are fans of these older franchises that have just resigned themselves to never being able to get something new in that franchise again. And hopefully this opens",
      "start": 393.2
    },
    {
      "text": "different things. Well, I'm sure there are fans of these older franchises that have just resigned themselves to never being able to get something new in that franchise again. And hopefully this opens the door for that possibility. A lot of people have been asking for Spyro. Yeah, so if you thought Jen was crazy for wanting that, I think you just haven't been looking probably. It's probably true. I don't listen to you babies wanting your baby mascots. Can you do me a favor and can you I'm sure kindafunny.com/yourewrong is already popping off. What can you see what July's top PSN downloads were? I can't remember where Crash, if it Crash, do you remember Crash was one or Crash was somewhere? You mean June's? No, July, right? July. I thought these were July's numbers. What what month what month is it now? It's August 3rd today. Oh, then I screwed this up. So this is this is July's top PSN numbers. And I'm talking about NPD numbers were Crash charted as well. There's a whole bunch of stuff, yeah, which we talked about in",
      "start": 430.68
    },
    {
      "text": "3rd today. Oh, then I screwed this up. So this is this is July's top PSN numbers. And I'm talking about NPD numbers were Crash charted as well. There's a whole bunch of stuff, yeah, which we talked about in this show before. I forget where Crash placed in that. It's possible those numbers aren't out yet. NPD. Wait, here, let's see. Wait, so then, okay, then then hold on. We're now we're caught in a time warp. Yes, Crash Bandicoot N. Sane Trilogy came out at the end of June, June 30th, the very end of June. Okay, so then we it would be on now. Okay, so now I need to know end of June. I would need to know the top downloads for PSN in June. Okay. And then it would we have June NPD already. We're Crash, I know, charted. And then July, we're still waiting on NPD for July. Man, that yeah, 'cause that comes out in the 15 area, right? The teens is when NPDs drop. It's all very complicated. Well, the NPD for June came out, I think, July 2nd, so it should be coming out soon. Okay, okay. But I'll see if I can find it. God, the number one",
      "start": 468.16
    },
    {
      "text": "right? The teens is when NPDs drop. It's all very complicated. Well, the NPD for June came out, I think, July 2nd, so it should be coming out soon. Okay, okay. But I'll see if I can find it. God, the number one PS4 game for June was Friday the 13th. Crash was number two. Got it. Just been released. Middle-earth: Shadow of Mordor Game of the Year Edition, still number three. This is almost identical. Grand Theft Auto V. God of War III Remastered. And then there was a Minecraft and Rocket League are both on there. And then there was a bunch of other games. Battlefield 1, Horizon Zero Dawn, Tekken. Okay. And then where was Crash in the NPD for the month of all right, June? June 2017 NPD. God, it's already August. It is. It's still oh man, it feels like 4th of July was yesterday. I I can't keep up anymore, Andrea. It's all it's all gone, guys. It's too crazy. It's too much. There's too many games. There's too many things happening. While you look that up, number one was Tekken 7. Okay. Two, Injustice 2. Three, Grand Theft Auto V. Four,",
      "start": 520.56
    },
    {
      "text": "guys, it's too crazy. It's too much. There's too many games. There's too many things happening. While you look that up, number one was Tekken 7. Okay. Two, Injustice 2. Three, Grand Theft Auto V. Four, Crash Bandicoot. Four, NPD. Okay, so number four overall. Gotcha. This makes more sense now and why I was so confused. Thank you, Andrea. You're welcome. Thanks for sticking it out with us as we figured all that out. Uh, so I definitely think that people who own these old licenses, Activision in general, Spyro, the stuff like that. I think now they're definitely thinking about a Spyro collection, you'd imagine. But then do you think we're going to get a new Crash game? Is that what people really want or do they just want this dose of nostalgia? That's a great question. I I think they want a new game. I I would imagine after the success of this Trilogy that people are like, hey, look it, lots of people, millions of people want this game, want this franchise to to be back. But if they're going to get a new one, I don't know.",
      "start": 570.4
    },
    {
      "text": "the success of this Trilogy that people are like, hey, look it, lots of people, millions of people want this game, want this franchise to to be back. But if they're going to get a new one, I don't know, because like if you open the door to putting something new in such a beloved franchise, they they could they could mess it up 100%, right? And that's the thing is I don't know. You they've been deprived so long of Crash, right? That when you sorry, we're bringing back the original Crash games that you already loved. We're remastering them from the ground up as Sean said on stage and then putting it out. I feel like that that scratches the itch. But then we're talking about Activision, right? Like they like to make money. If they continue to see this thing sell well, it sold so well in NPD last month. It's going to be it's doing great right now. And I think if you're seeing it right now at the top of the PS4, you know, downloads, you have to wonder then if if copies were in stores, it seems like it's going to be on",
      "start": 611.64
    },
    {
      "text": "be it's doing great right now. And I think if you're seeing it right now at the top of the PS4, you know, downloads, you have to wonder then if if copies were in stores, it seems like it's going to be on NPD again. Um, yeah, I mean, if it's in the number one and the number two slots two months in a row, I mean, I think we can expect it to be at least in the top five for August. Yeah, I don't know. It'll be interesting to see if they do it again. Let me know, ladies and gentlemen, KindaFunny.com/KFGd, if you'd want another because apparently so many of you watching are Crash fans. I need to know, would you want a new Crash or are you happy with what you got? Because they they get a new Crash, this is a chance to **** it up. Also, remember that now now that we're talking about August numbers, we got to make sure we get Patapon in there because we need a new Patapon. Patapon, you can't **** up. It's perfect. Andrea, you just get it out there. It'll be great. Number two on the Roper Report, Miss Cleo's people are suing",
      "start": 652.56
    },
    {
      "text": "get Patapon in there because we need a new Patapon. Patapon, you can't **** up. It's perfect. Andrea, you just get it out there. It'll be great. Number two on the Roper Report, Miss Cleo's people are suing Rockstar over GTA: Vice City. This is from TMZ. I'm going to read their thing. Psychic Readers Network, which holds the rights to Miss Cleo, just filed a suit against Rockstar Games and others who help make the make and distribute the GTA classic for allegedly jacking the image and Jamaican accent and slapping on another on their character, Auntie Poulet. In the suit obtained by TMZ, uh, Psychic Readers Network claims it spent well over 100 million creating and promoting Miss Cleo's persona over the years and that Rockstar and Company have gone on to make more than $500 million exploiting its character. They also say Rockstar even hired the actress who used to play Miss Cleo in real life, Youree Harris, and had her voiced the character of Auntie Poulet, which is true. We broke the story that Harris died from",
      "start": 692.0
    },
    {
      "text": "also say Rockstar even hired the actress who used to play Miss Cleo in real life, Youree Harris, and had her voiced the character of Auntie Poulet, which is true. We broke the story that Harris died from cancer last July. A company spokesperson from Rockstar has responded to the PRN lawsuit telling TMZ, quote, these claims are entirely meritless and completely ridiculous. We will vigorously defend ourselves with regard to this matter. Everyone wants to sue Rockstar. I get that, but it's been so long since Vice City. It's not like this snuck out. Really long time. Why the hell are they suddenly getting getting this bug up their butt to go after? You think do you think maybe uh while she was still alive she did not want them to engage and that she was like, don't want to be part of this? Well, that's what's interesting. And now they've waited until she passed and now they're they're going to go to bat. You would it's got to have something to do with her passing, right? Because of the fact that they're talking",
      "start": 734.0
    },
    {
      "text": "and now they've waited until she passed and now they're they're going to go to bat. You would it's got to have something to do with her passing, right? Because of the fact that they're talking about they hold the rights to Miss Cleo and that the actress who portrayed Miss Cleo also portrayed this character. So they didn't did they not want to sue her? Did they feel like what was there a defense with her being alive in the way of either she didn't want anybody to go after it or 'cause this isn't her family's estate. It's them saying we own the character she trade. There might have been something in in the the legal ease of her contracts, her multiple contracts that prevented them from engaging in some kind of arbitration. You know, I'm not sure. It is. I mean, it's not surprising that anybody's going after GTA's money because GTA is making tons and tons of money. Yeah, so I mean, I don't know. It's it's silly. It's a silly lawsuit. But I mean, I can't wait to see how it pans out 'cause it was very much her",
      "start": 780.76
    },
    {
      "text": "after GTA's money because GTA is making tons and tons of money. Yeah, so I mean, I don't know. It's it's silly. It's a silly lawsuit. But I mean, I can't wait to see how it pans out 'cause it was very much her character. It was the woman who played Miss Cleo being this Auntie Poulet who was doing the exact same Miss Cleo impression. But then where's the line for that of the Verizon guys doing the same Verizon guy thing in the ads right now for Sprint, right? Like, yeah, he's just calling Verizon out in the Sprint ad. It's really funny. It's fascinating to see like, I it's just such a weird argument of the fact that first off, it's been so long. And secondly, they do it after she's gone. Why? I don't it's I there's something here. There's some reason they decided to go after him now and not when the game came out and was actually relevant. Yeah, I don't know what it is though. I'd like to know what's Miss Cleo's people up to. Someone on the internet has done some sleuthing. Write into us. Let us know. I wonder, you think",
      "start": 820.56
    },
    {
      "text": "was actually relevant. Yeah, I don't know what it is though. I'd like to know what's Miss Cleo's people up to. Someone on the internet has done some sleuthing. Write into us. Let us know. I wonder, you think this is another one just get settled out of court or do you think Rockstar is going to go all in? I mean, generally Take-Two Interactive um hasn't historically settled. They've they've won all their all of their cases. So I'd be surprised if they settled here. If and if they did, clearly meant that there was some kind of violation somewhere. But yeah, it's going to get into the rights and who owns the character and what that that means, right? If you if she's playing Miss Cleo, but it's under a different name. Did we ever find out what happened with Lindsay Lohan's latest suit? Oh, for the that GTA V character looked like her. She sued them and then it kind of went away and then it came back. I haven't heard anything about it. Oh no, it says Lindsay Lohan's Grand Theft Auto lawsuit rules in Rockstar's",
      "start": 865.48
    },
    {
      "text": "looked like her. She sued them and then it kind of went away and then it came back. I haven't heard anything about it. Oh no, it says Lindsay Lohan's Grand Theft Auto lawsuit rules in Rockstar's favor. Surprise, surprise, right? Yeah, yeah. I think iJustine had a better case than Lindsay Lohan had that one. Yeah, she really did. Cover art. Uh, speaking of GTA though, the third in the Roper Report, GTA Online won't stop making money. This is via IGN. Grand Theft Auto Online just had its best quarter ever for parent company Take-Two Interactive. In his quarterly earnings release, Take-Two reported uh net revenue from digitally delivered content grew 7% over the same period last year with GTA Online leading the pack for recurrent consumer spending. Recurrent consumer spending refers to virtual currency, downloadable add-on content, and microtransactions. But it's not just GTA Online fans who spending the money. NBA 2K17 also keeps bringing home the bacon for the company both in recurrent spending and in",
      "start": 910.28
    },
    {
      "text": "add-on content and microtransactions. But it's not just GTA Online fans who spending the money. NBA 2K17 also keeps bringing home the bacon for the company both in recurrent spending and in overall sales with 2K17 now holding the title of Take-Two Interactive's bestselling Sports title ever. In a prepared in prepared statements, I should say, CEO Strauss Zelnick uh teased a new game, quote, from one of 2K's biggest franchise to help drive revenue for its fiscal year 2019 along with Red Dead Redemption 2. Take-Two's fiscal year 2019 begins May 2018. Now we're going to get back to Grand Theft Auto stuff. Seeing the huge success of Grand Theft Auto V and Grand Theft Auto Online might be a double-edged sword. As of February, Grand Theft Auto V has sold more than 75 million copies. Jesus God. But but in its financial statement press release, Take-Two said it has determined that it's it is necessary to extend the life of both Grand Theft Auto V and Grand Theft Auto Online for the purpose of deferrals. Rumors",
      "start": 953.0
    },
    {
      "text": "statement press release, Take-Two said it has determined that it's it is necessary to extend the life of both Grand Theft Auto V and Grand Theft Auto Online for the purpose of deferrals. Rumors began to circulate recently about the inevitable start of Grand Theft Auto VI, but the actor whose resume was used as evidence has since denied posting the information blaming an unauthorized third party for the phony info. With Grand Theft Auto V continuing to deliver for Take-Two, the company probably isn't too concerned about the immediacy of a followup. What does that do to you, Andrea Rene, as somebody who doesn't give a **** about GTA Online? This breaks my heart. Give me more single player. Give me at least give me single player DLC for five. You know, that was really the surprising thing after seeing some really incredible expansions they've put out for previous GTA. Why they didn't pick to do expansions around these three characters in GTA V was a little bit puzzling. It's kind of a heads scratcher.",
      "start": 1004.36
    },
    {
      "text": "really incredible expansions they've put out for previous GTA. Why they didn't pick to do expansions around these three characters in GTA V was a little bit puzzling. It's kind of a heads scratcher. I wonder how much it had to do with the fact of first off, online being successful, but then the fact that it was such a struggle start. Remember when they launched when they did launch it, it was crashing, it wasn't working. Too many people were trying to play it. People were getting pissed off. And it took them so long to put heists into GTA Online that I wonder if it was all hands on deck, let's get GTA Online worked out. And then we get to single player DLC. But by the time GTA Online was worked out and granted they would have been prototyping thinking about single player DLC. By the time GTA Online's up and running, they're like, wait a second, this is way more popular than single player DLC has ever been. And it's like really raking in the money. Yeah, obviously so much money they're making from GTA Online from",
      "start": 1047.0
    },
    {
      "text": "they're like wait a second this is way more popular than single player DLC has ever been and it's like really raking in the money yeah obvious so much money they're making from GTA Online from all the um you know the currency that you can buy there you know it's I don't know maybe they were just like hey people are satisfied with the content that we're putting out with GTA Online maybe we don't need to use the resources but they have so many resources that doesn't really make sense either they have so much money and their team is so gigantic like they have a team that could make the the single player DLC I just I don't know why they haven't done it yeah maybe they still will I hope so I mean that would be at least a nice compromise in terms of like what I like out of my GTA games is that like I love don't get me wrong what what people are doing in and the worlds they're creating and the adventures are having in GTA Online is awesome it's just not for me I'd much rather get like yeah",
      "start": 1085.88
    },
    {
      "text": "like I love don't get me wrong what what people are doing in and the worlds they're creating and the adventures are having in GTA Online is awesome it's just not for me I'd much rather get like yeah me another dose of Franklin or Michael or Trevor and let's see what's going on or yeah introduce a new character in that world and let me play around in that that would get me motivated to put GTA V back in and maybe if you paired that with you know GTA Online whatever free double XP weekend here's this new item here's this new thing maybe it would actually get me to try that again and get encouraged to play that absolutely but as evidenced by the NPD numbers we just looked at plenty of people are still buying this game brand new as is right I know I know and you were on the you were on the episode I think where we asked why people were buying GTA V I think Tim might have been on the one we followed up where people rode in and were talking about the fact that I was late to this generation",
      "start": 1129.56
    },
    {
      "text": "I think where we asked why people were buying GTA V I think Tim might have been on the one we followed up where people rode in and were talking about the fact that I was late to this generation I've heard great things uh I you know I've been playing it on Xbox but now my friends are on Steam so I buy it there and like the reason oh even if you know I'm just jumping from a PlayStation 3 to a PlayStation 4 I know that game's great I want to play it right it's crazy the the fandom that thing has and the success it has in the way that it just doesn't stop we talked about Guild Wars yesterday and how they put out this you know new DLC but it's only appealing to fans and it's like GTA can do that they put out stuff all the time here's this new pack here's this new costume here's these new boats or whatever and I see it I'm like okay whatever but for millions of players that's a huge deal and they get back in and they buy it 7% over last year in terms of Revenue absolutely insane let's talk",
      "start": 1169.28
    },
    {
      "text": "or whatever and I see it I'm like okay whatever but for millions of players that's a huge deal and they get back in and they buy it 7% over last year in terms of Revenue absolutely insane let's talk about another multiplayer game Let's item four on the Roper Report Friday the 13th is sold 1.8 million copies uh I'm going to go through a whole bunch of stuff here stick with me I tweeted this out late last night on my way home from work uh the folks over at GamesIndustry.biz have a great interview up with well uh Wes Keltner from Gun Media I'm going to pull some quotes here uh the entire and what what I want to do when I'm leading into this is the fact that this is a huge #AndreaWasRight moment thank you Craig quote this entire project has been a huge learning experience for both Gun Media and IllFonic we will be the first to admit that we weren't ready for the huge influx of players that hit us day one quote we looked at our player numbers from the beta along with pre-orders and then add",
      "start": 1204.68
    },
    {
      "text": "IllFonic we will be the first to admit that we weren't ready for the huge influx of players that hit us day one quote we looked at our player numbers from the beta along with pre-orders and then added a 30% cushion that's how we set up our servers and database for launch we were so wrong 100,000 players hit us up in the first 30 minutes and our servers melted our first weekend was chaos the entire team slept at their desk trying to keep up with the demand it's an experience I'll never forget with our small budget we couldn't afford a large scale QA effort we did a PC beta and gleaned a lot of great data from that but again we weren't ready for the tidal wave of players hats off to you because I've been in the industry 10 years we've talked about all this stuff we I feel like I say the same things over and over again arguments and whatnot I hadn't heard people make the arguments as you did on this show a few weeks ago in the fact of so many of our compatriots say don't pre-order",
      "start": 1249.12
    },
    {
      "text": "same things over and over again arguments and whatnot I hadn't heard people make the arguments as you did on this show a few weeks ago in the fact of so many of our compatriots say don't pre-order games don't pre-order games and then you said well people if you do that that's fine but understand that pre-orders are used to understand what server loads are going to be and I never really heard anyone say that a developer say that and then here we are a few weeks later and so there you go Andrea was right on that one I I never thought that through of like that is a probably a great use of pre-order in terms of what's going to happen and if you're looking for an online thing that's the way to go well it's not every game uses that data but certainly games that have a multiplayer online component do it's it's part of the bigger picture you know they want to be able to you know get enough discs into stores if it's a retail release and then of course you know have their server load ready on",
      "start": 1288.76
    },
    {
      "text": "do it's it's part of the bigger picture you know they want to be able to you know get enough discs into stores if it's a retail release and then of course you know have their server load ready on day one launch so I mean and a lot of times with pre-orders you get some cool bonus content and there are valid arguments against pre-orders as well you know I'm not trying to pretend like those don't exist but my stance has always been if you like a game and you want to pre-order it there's no harm in pre-ordering a game yeah if you've already seen that's always been my argument with it where I feel like it's the games that are under the radar that they don't put out early copies to and you don't see preview events and where it's like wait why is this so wrong and why why are we not seeing stuff I feel and granted we're incredibly privileged to go to E3 and go to PAX and talk to the developers and have them come by and blah blah blah blah by the time we get to a release date I usually am",
      "start": 1327.84
    },
    {
      "text": "I feel and granted we're incredibly privileged to go to E3 and go to PAX and talk to the developers and have them come by and blah blah blah blah by the time we get to a release date I usually am pretty sure I'm going to like this game I'm not going to like this game this game doesn't look right this game looks great I think one of the rare exceptions recently was Mass Effect Andromeda where I went and did the Mass Effect Andromeda preview and they ran it on PC obviously super high specs or whatever and I was like it was just the first 40 minutes or whatever you know what I mean like the whole opening playing through the first planet and I was like holy **** this is awesome and it was like you got on console you got deeper into the game you didn't have those specs it was like oh there's problems here in terms of like actual performance issues that you I wouldn't have caught based on a preview event oh absolutely and those things completely exist and I'm not here to to deny that",
      "start": 1366.48
    },
    {
      "text": "problems here in terms of like actual performance issues that you I wouldn't have caught based on a preview event oh absolutely and those things completely exist and I'm not here to to deny that and so you know my stance has always been if you are a conservative uh game purchaser and you have a limited budget and you don't want to risk buying a game that's potentially broken has launched problems or isn't as good as you thought it was then wait don't pre-order but you know if you have the ability to I mean and it's a franchise you love and it's bonuses that you're interested in then go for it continuing on with this GamesIndustry.biz article uh they the author continues it's a good thing that profit started coming in as Gun Media had to reinvest in QA to address the server problems and that's an investment that continues to this day as the problems are still not completely ironed out back to the Gun Media's Wes Keltner quote as the player count continued to rise a memory leak became",
      "start": 1399.12
    },
    {
      "text": "that's an investment that continues to this day as the problems are still not completely ironed out back to the Gun Media's Wes Keltner quote as the player count continued to rise a memory leak became apparent which was difficult to find until the build went out into the Wild and hundreds of thousands of players began playing this showed up primarily on the Xbox SKU and we shifted our efforts to finding where this leak was occurring we released a patch that we released a patch recently that helps but it's still not a 100% fix we've brought on two other teams to help us locate the source and our partners at Microsoft and Epic UE4 are helping us right now try to figure out what's going on with that then looking through here I feel like something went wrong yep I don't oh you dropped this in there that's what's happening okay hold on number five on the Roper Report here I'm Gonna Save it we're saving it right yes because then I want to jump into a question from Charles J. who wrote",
      "start": 1441.76
    },
    {
      "text": "in there that's what's happening okay hold on number five on the Roper Report here I'm Gonna Save it we're saving it right yes because then I want to jump into a question from Charles J. who wrote into KindaFunny.com/KFG and said greetings Greg and Andrea the top 10 bestselling games on the PS and were just released and of course Crash won't take a break but if we look past number two and number three which which were sale items we see once again Friday the 13th correct me if I'm wrong but Dead by Daylight hasn't ever been on these charts since it came out yet this keeps being so high on the list very similar games but to my knowledge Dead by Daylight doesn't have the reputation for being let's say a bit wonky why do you think Friday the 13th being so high even though it seemingly gets worse pressed than Dead by Daylight is it the name is it Greg Miller is it that any press is good press additionally Andrea is awesome great to have her on here and she brings perspectives and",
      "start": 1482.4
    },
    {
      "text": "gets worse pressed than Dead by Daylight is it the name is it Greg Miller is it that any press is good press additionally Andrea is awesome great to have her on here and she brings perspectives and energy to the table hard to believe she's only 31 years old with all that knowledge it's interesting you bring this up Charles because I think it's a number of things you just said but we'll get to that in a second not me by the way not but I think you jump back to the article here where they're talking to Gun Media guy he says quote I think that there are two reasons for this he's talking about why the game was so successful based on the in the reviews were so bad Early Access and Early Access in content creators YouTubers and streamers in my opinion these are the two biggest disruptions in our industry uh with Twitch probably being the biggest game changer five years ago Publishers would frantically five years ago Publishers would be frantically hiring mock reviewers to try to get a",
      "start": 1523.04
    },
    {
      "text": "our industry uh with Twitch probably being the biggest game changer five years ago Publishers would frantically five years ago Publishers would be frantically hiring mock reviewers to try to get a good estimate of what their Metacritic score would be today we have meetings and ask the entire team does our game stream well he adds as for reviews and feedback many of the low scores and negative impressions were based on performance and server issues and not Gameplay at the end of the day it's difficult to rate a game highly if it isn't functioning as intended so from a design perspective it's is great to know we succeeding looking at every single one of those reviews it becomes obvious that people like the game they enjoy playing it we can hold our head up high knowing we're created a fun game The Challenge now becomes a technical one once the technical issues get ironed out we feel like consumers will get to experience our full vision there's also a rise in community multiplayer",
      "start": 1559.96
    },
    {
      "text": "fun game The Challenge now becomes a technical one once the technical issues get ironed out we feel like consumers will get to experience our full vision there's also a rise in community multiplayer games which only a handful of games are focusing on right now and they are proving to be successful and a shift in the industry so back to your point here Charles it is I think the name has something to do with it why is it more popular than Dead by Daylight Dead by Daylight I think was a PC phenomenon and it was one of those that earned a lot of praise and stuff there and has its own community I think by the time it jumped to console it jumped after Friday the 13th and it's similar what we talk about with uh PUBG in the way that there's a race now can PUBG beat a Ubisoft mode for The Division that is PUBG to the consoles because when whatever people get there and they get their hands on they get to play they're going to be stoked about and I think the fact that it's the name it's",
      "start": 1595.72
    },
    {
      "text": "Division that is PUBG to the consoles because when whatever people get there and they get their hands on they get to play they're going to be stoked about and I think the fact that it's the name it's the fact that it was here first and it's the fact that yeah I think it is a fun game you know what I mean it's when you talk about is it Greg Miller I think it's back to Wes's point that it's early access it's streamers it's YouTube creators and the way that the amount of times I've played that game and talked about that game the number of tweets I get are exponential of I wasn't thinking about buying this game but I see how much fun you guys are have playing it or I watched your stream and now I bought it and here's a clip from me there is this thing of yeah the game's far from perfect it's not a 10 it's not you know going to it's going to crash it's going to do all this goofy **** but when you're out there running from Jason or he's **** killing everyone at the car it's awesome and",
      "start": 1636.44
    },
    {
      "text": "not a 10 it's not you know going to it's going to crash it's going to do all this goofy **** but when you're out there running from Jason or he's **** killing everyone at the car it's awesome and there's something to be said for that absolutely and this is why I don't review games and why I don't give game scores because it's such a difficult thing to pin down when you have a game in the situation where the gameplay itself is really fun and it's the I can see their vision and they're using this really incredible character who a lot of us know if you're a fan of horror movies like Jason and Friday the 13th has been around for decades and so that aspect of it is really great did they have technical problems of course there's no denying that but that doesn't mean that it's a bad game and sometimes when you you know get a game like this at launch and it gets a poor review score some people are never going to come back and give it another chance and you know this isn't the first game",
      "start": 1670.96
    },
    {
      "text": "sometimes when you you know get a game like this at launch and it gets a poor review score some people are never going to come back and give it another chance and you know this isn't the first game this has happened to nor will it be the last and it's it's challenging especially if from a developer standpoint you know them probably like you know trying to tear their hair out going oh my gosh you know we just weren't ready know please don't judge our game because we just had so many people want to play it I mean that's a good problem and a bad problem at the same time of course of course but I think it's it's been it's telling that what he says is true I think where most of the reviews were it's fun but buggy it's fun but broken something's wrong with it and so if they do iron that stuff out and people continue to play and keep it continue to share there's going to be legs for it the final bullet point on the story of course is that there's a physical release of uh Friday the 13th coming",
      "start": 1709.96
    },
    {
      "text": "out and people continue to play and keep it continue to share there's going to be legs for it the final bullet point on the story of course is that there's a physical release of uh Friday the 13th coming to PlayStation 4 and Xbox One on Friday the 13th of October it's $40 it comes with a bloody Jason skin variant for all playable Jason versions and a clothing pack for all playable Camp counselors uh I think that's another boost for them right in terms of the fact that when you get it out there you hope your servers are are in line for how many people are going to buy it and the fact that it would encourage that another wave of people wanting to talk about it wanting to play it and you know I was talking about it yesterday on Games Daily and the fact of like I was looking for a game to fill in these next couple nights before Cooking with Greggy and then before you know Batman's next week so I need something to do and I was like I'm going to try to knock out Night in the Woods and I went",
      "start": 1748.48
    },
    {
      "text": "in these next couple nights before Cooking with Greggy and then before you know Batman's next week so I need something to do and I was like I'm going to try to knock out Night in the Woods and I went home and played Night in the Woods for a little bit last night really funny really interested I'm down for where it's going but I was like falling asleep during it cuz I was so tired and it's just text you know what I mean there's no VO there's no nothing and I was like all right cool I didn't make enough progress in that now to beat that by the weekend to I'm like I'm just going to play Friday the 13th tonight cuz I **** love that game and I miss it and it's the it's the Everlasting Gobstopper of I'm going to jump in and I know what I'm going to do and I don't need to worry about learning the rules of the game or what the story is like I'm just ready to go this is why live service games are becoming so incredibly popular because they're the game that you can just boot up you can spend",
      "start": 1784.0
    },
    {
      "text": "the rules of the game or what the story is like I'm just ready to go this is why live service games are becoming so incredibly popular because they're the game that you can just boot up you can spend maybe 30 minutes playing and then can turn it off and go about your day go about your night go to bed whatever yeah exactly me then that's what players are are looking for we obviously love narrative experiences and big stories and open worlds but every once in a while you just want to have like a a little quick hit a little gaming fix yeah exactly and I think that's what it's interesting to see that start for me personally as somebody who's never been I guess with the exception of DC or whatever someone who is a live services guy but to have Friday the 13th and Marvel Heroes on the cross media bar right now it is that thing of like all right cool I'm looking forward to these games but I have a few hours to kill right now I have 30 minutes to kill what am I going to jump in and play and",
      "start": 1815.56
    },
    {
      "text": "bar right now it is that thing of like all right cool I'm looking forward to these games but I have a few hours to kill right now I have 30 minutes to kill what am I going to jump in and play and not start something and feel like I'm not giving it my full attention exactly very fascinating and then number five got added in here here it is For Honor is getting new content in Season 3 I think it launches today right no it launches on August 15th okay so it's called Grudge & Glory and it'll be coming to all platforms and it has two new Heroes two new maps ranked play new legendary gear and more the new Heroes The Proud Highlander and The Fearless Gladiator will be available for free for season pass holders while all other players will be able to unlock them in-game on August 22nd so a little bit later if you don't have the season pass for 15,000 steel which is in-game currency um it's the first step in the For Honor development schedule that includes another season in November",
      "start": 1853.44
    },
    {
      "text": "alongside plans to introduce dedicated servers at a later date it will also bring competitive play which a lot of people have been asking for to all platforms with the introduction of 1v1 dual tournaments and there will also be tournaments that will allow players to vie for higher rankings which will reset each season and win exclusive tournament rewards competitive play will continue to grow later this year with the introduction of 4v4 ranked modes another games of service continue to evolve exactly this is and this is back to what we were talking about like when we did the rundown of everything For Honor announced for their new season a couple weeks ago now last week it was that fact of like hey here's another way of doing a marketing beat where suddenly you're talk like it's not and",
      "start": 1892.96
    },
    {
      "text": "For Honor announced for their new season a couple weeks ago now last week it was that fact of like hey here's another way of doing a marketing beat where suddenly you're talk like it's not and I'm not knocking how Guild Wars I just talked about their expansion hey here is something we're putting out that's for people who aren't just our core audience For Honor saying hey everybody if you've walked away if if if you that was the thing when they announced their you know whole new season run what they're going to do at looking big picture for their next you know the next year For Honor them talking and going to Gaff and seeing all the Gaff threads like oh dedicated servers I'll come back like that was like such a big point for so many people who bought that game because we saw it sell so well and then walked away from it exactly and yeah they're coming soon August 15th yeah right around the corner but Andrea Rene yes I wanted to know what came to the mom and pop digital shops today",
      "start": 1932.72
    },
    {
      "text": "well and then walked away from it exactly and yeah they're coming soon August 15th yeah right around the corner but Andrea Rene yes I wanted to know what came to the mom and pop digital shops today where would I go you would go to the official list of upcoming games across each and every platform as read by the Kinda Funny Games Daily show hosts each and every weekday Kevin you're back it's it's stereo Kevin no it's fine don't run away a you're fine all right out today there's a whole bunch of stuff strap in This Merchant Life comes to PC ACA Neo Geo Aero Fighters 2 comes the Nintendo Switch EOP: Slimon comes to the Nintendo Switch Ehhop Gunbarich for Nintendo Switch comes to the Nintendo eShop Strikers 1945 for the Switch is on the eShop Puzzle Adventure Bloble that's right Bloble Nintendo eShop for Switch uh Use Your Words on Switch Nintendo eShop Infinite Mini Golf Nintendo Switch on eShop played some of that last night that Infinite Mini Golf because I'm like oh man I'm getting",
      "start": 1968.84
    },
    {
      "text": "eShop for Switch uh Use Your Words on Switch Nintendo eShop Infinite Mini Golf Nintendo Switch on eShop played some of that last night that Infinite Mini Golf because I'm like oh man I'm getting ready for Everybody's Golf can't wait pop that in no don't I mean I popped a lot of easy trophies and I did that thing where I'm like so many were popping I popped out I'm like how easy is this Platinum no Platinum I ain't got time for you you're not you're not Everybody's Golf and you're not an easy Platinum Voxel Maker for the 3DS comes the eShop fight oh sorry Flight of Light comes the Nintendo Wii U eShop uh Retro City Rampage DX makes its debut on the Switch Shovel Knight gets a DLC playable character for Blaster Master Zero Sky Knights is on Steam Final Fantasy XV Multiplayer Comrades beta begins today on Xbox One and PS4 and then Xbox backwards compatibility has added support for Epic Mickey 2 The Power of Two and ToeJam & Earl Plus Wildlands trial has been is out there too this",
      "start": 2020.44
    },
    {
      "text": "today on Xbox One and PS4 and then Xbox backward compatibility has added support for Epic Mickey: The Power of Two and ToeJam & Earl Plus. Wildlands trial has been is out there too. This could be a deal of the day too, but there's a free trial right now for Tom Clancy's Ghost Recon. Yeah, I kind of tagged this on the end of the For Honor stuff too, so it's 5 hours on either Xbox One or PS4. It includes the entire base game with um the open world map that can be played solo up to three friends. And then um after the trial, if you decide to purchase the full game, all of your progress will carry over. And I want to give a shout out to Ubisoft for respecting the show enough to send us press releases and flag them for, hey, this is good for Kinda Funny Games Daily, which I like a lot. Yeah, because I had added in the the For Honor stuff here under the new dates for your stuff, cuz like we already said, For Honor, August 15th, Grudge & Glory. Then you got new dates, uh Neon Drive is coming to PlayStation 4 on August 8th. Uh",
      "start": 2062.8
    },
    {
      "text": "added in the the For Honor stuff here under the new dates for your stuff, cuz like we already said, For Honor, August 15th, Grudge & Glory. Then you got new dates, uh Neon Drive is coming to PlayStation 4 on August 8th. Uh Gear.Club Unlimited is coming in Q4 2017 to Switch. They're claiming they're the first like real racing game for Switch and like, you know, it's got like nice graphics and looks like real cars in said all the crazy stuff before. Thumper is finally coming to Xbox One on August 18th. RiME on Switch is coming November 17th, 2017. Dynasty Warriors 9, not a release date, but they finally announced platforms for it is coming to, you guessed it, PlayStation 4, Xbox One, and PC. And then if you buy Yakuza Kiwami, you'll get DLC for free after launch. This is via GameSpot throughout the month of September. Yakuza Kiwami players will be able to download new outfits, consumables, and other helpful items at no cost. Sega says each batch of DLC will automatically be patched into the game following its release.",
      "start": 2106.76
    },
    {
      "text": "Yakuza Kiwami players will be able to download new outfits, consumables, and other helpful items at no cost. Sega says each batch of DLC will automatically be patched into the game following its release. Players will then be able to acquire the items from Bob Utsunomiya beneath the Tenkaichi Street Gate. You can find the contents and release date of each pack at the end of The GameSpot story, so go over there and check it out. In terms of the deals of the day, I Am Setsuna is marked down, usually 40 bucks on the Nintendo eShop for Switch, now $16.79. Andrea, yes Greg, are you ready to check in with the readers? I am so ready. We're going to start with Jared, who wrote in to kindafunny.com/kfgd. Again, another pat on the back, great questions uh for today. The whole week's been great. You guys have been killing it over there. Thank you very much. And I was also uh pleased to see so many Andrea questions today where I just get to ask you questions and lean back. Oh, well then Jared says, hello Greg and",
      "start": 2151.48
    },
    {
      "text": "killing it over there. Thank you very much. And I was also uh pleased to see so many Andrea questions today where I just get to ask you questions and lean back. Oh, well then Jared says, hello Greg and Andrea, although more specifically Andrea, because I have a Paragon question. Oh yes. I read through the Monolith Magazine and now barely contain my excitement for the new update. So I would love to hear what Paragon woman herself thinks about Paragon Update 4: The New Dawn and what features you're most excited about. So I had the very fantastic opportunity to play um the new update, The New Dawn, in um in a private, in a closed Alpha. What does it do? Like what's so I didn't even hear about that there was another update for it. But again, this is like Guild Wars, right? Of like this isn't us trying to talk to the world, this is us talking to player base. Well, and generally, you know, these games put out patch notes semi-frequently and they make tweaks and balances to the heroes and to to gameplay and things",
      "start": 2201.8
    },
    {
      "text": "to the world, this is us talking to player base. Well, and generally, you know, these games put out patch notes semi-frequently and they make tweaks and balances to the heroes and to to gameplay and things like that. But this is a really massive meta change and that's the thing that's pretty concerning for me as a legacy player. So basically every card in the game, there's a deck building system and the cards that you build into your decks affect how your character plays in the match. How you like if you have more power, if you have more attack speed, if you get Mana or health or whatever, you kind of build your deck to complement your hero's abilities to help your team and to ultimately win. They've completely just like thrown all of the old cards out the window. That can't sit well with you. So it's tough because I've spent hours of my life building decks for many different Heroes and I've spent a lot of reputation, which is part of the in-game currency, on buying deck slots and now the deck slots",
      "start": 2246.12
    },
    {
      "text": "tough because I've spent hours of my life building decks for many different Heroes and I've spent a lot of reputation, which is part of the in-game currency, on buying deck slots and now the deck slots are are different. The uh you used to have six cards in a deck and now you can bring in 1. But you can only equip three at a time. They've changed how you can level up the cards. Like so the cards have a base level and then you can spend reputation to level the cards up. But the leveled up cards only work in co-op mode. Okay, which I'm like, why would I want to spend my reputation leveling up cards when the people who have the most amount of reputation and who are going to be the deepest into the meta and the deck building system are going to be probably exclusively playing in PvP unless they're testing out a new hero. So I was like, I was like, that's kind of a a head scratcher for me. Like why would you do that? And having to relearn every single card in the game makes me really, really mad that I",
      "start": 2291.04
    },
    {
      "text": "out a new hero. So I was like, I was like, that's kind of a a head scratcher for me. Like why would you do that? And having to relearn every single card in the game makes me really, really mad that I have to like kind of throw these hundreds of hours that I've spent in this game and to relearn the meta. And so that's that's frustrating. So at any point, where did this these changes, the anger, did it make you think about stepping away? Like maybe my time with Paragon's done? No. Okay. Um because I no, because I really like this game. So I'm going to commit to learning it. I the things that I like about the update is that they've increased the speed of the game overall. You move faster, you attack faster. And hopefully it means that the pace of the game is going to go faster. When they originally introduced the Monolith update from Legacy, the idea was, hey, we we don't want every match to be 60 plus minutes. Turns out it didn't matter. If you're against a evenly matched team, the matches are usually going to go",
      "start": 2337.44
    },
    {
      "text": "Monolith update from Legacy, the idea was, hey, we we don't want every match to be 60 plus minutes. Turns out it didn't matter. If you're against a evenly matched team, the matches are usually going to go at least 50 to minutes. They're long matches if you're facing off against, you know, an equal opponent. Um and so I would like to see once this gets out into the wild, like how it changes the speed of the game now. Because I was in such a small test group in this closed Alpha playing and I was playing against a lot of like pro players, it's hard for me to know what the balance is actually going to be like. Some of these cards turn into one hit kill cards, which can completely break the balance if you can have a hero who's essentially just running around the map like one-shotting people. And because your respawn time is tied to your player level within the match, you could be 15 minutes into the match having like an 80 second respawn time and that's going to completely throw off the balance of the",
      "start": 2383.12
    },
    {
      "text": "respawn time is tied to your player level within the match, you could be 15 minutes into the match having like an 80 second respawn time and that's going to completely throw off the balance of the match. So I I don't want to get too in the weeds of like the specifics about the jargon related to this game. Um but you're you're not excited for this. You're you're you're tentative. I'm tentative. I'm like I said, the group that we were playing with was such a small group, it's hard to know how it's going to affect the player base at large of, you know, once, you know, thousands of players are finally playing this and testing the new deck system. So I I'm excited to see where they're going. They've revamped one of my favorite characters from Legacy, Iggy & Scorch, which is um like a Caster character that is all fire all the time. And so I'm really excited to play with uh with him again. But you know, I don't I don't know. I'm really on the fence about how this is going to go. Okay, I need to spend more time",
      "start": 2432.96
    },
    {
      "text": "all fire all the time. And so I'm really excited to play with uh with him again. But you know, I don't I don't know. I'm really on the fence about how this is going to go. Okay, I need to spend more time with it before I get before um August 8th. Oh wow, right around the corner. Yeah, so before I give a definitive, but I have stopped playing altogether because these are such dramatic changes to the meta that I'm like, why would I I I should not waste any more time cuz they're it's all going to go out the window. Oh my God, jeez. I can't wait for August 9th to see what you think all this. Yeah, right. Joko wrote into kindafunny.com/kfgd, just like you can, and says, hi Greg and Andrea. This one's for the busiest lady in in the business. I saw Andrea has got an awesome Hearthstone or yeah, Hearthstone card art picture of herself and was wondering, is she still playing and how excited she may be for Knights of the Frozen Throne expansion that's imminent on release? I haven't heard any Hearthstone love unless it",
      "start": 2476.52
    },
    {
      "text": "of herself and was wondering, is she still playing and how excited she may be for Knights of the Frozen Throne expansion that's imminent on release? I haven't heard any Hearthstone love unless it was last week. I was in Mexico. Thanks for all you do and keep up the excellent work. PS Greg, have you ever tried it? Keep ducking that chicken. You first. You're a big Hearthstone person too. I haven't played Hearthstone in quite some time. Okay, um that card that he found was created um a long time ago and I haven't revisited it quite frankly in a while. So I actually don't know what's coming in the Knights of the Frozen Throne expansion. Interesting. Yeah, I really enjoyed the time that I spent with Hearthstone, but I primarily played it on my iPad. Yeah, and then once I started paying for Wi-Fi on airplanes to play Hearthstone, I was like, what am I doing? I have a problem. I need to stop. Yeah, we've all been there. Uh I tried it. It it wasn't for me. I can't the card games just don't click for me. There too much",
      "start": 2517.44
    },
    {
      "text": "play Hearthstone. I was like, what am I doing? I have a problem. I need to stop. Yeah, we've all been there. Uh I tried it. It it wasn't for me. I can't the card games just don't click for me. There too much math on the fly for me to think it all through. And there's always these I'm not paying attention to this thing over here. There's this one variable I missed. And I'm just like, I don't I can't do this. I don't I don't enjoy him. Zack W. Carpenter wrote in, said, good day to you, GNA. We've all heard about how Metal Gear Solid was the game that had a huge impact on Greg and his gaming life. My question is for Andrea, what is the game that had the biggest impact for you and your gaming life/career? Thanks for all the daily game greatness. Zack W. Carpenter. I think without question that game would be Rock Band 2. Really? Yes. So I'm try going to try to keep this brief. Essentially, Rock Band 2, I was playing that game at a time in my life where I was just starting to get into video games media, transitioning from",
      "start": 2563.52
    },
    {
      "text": "really yes. So I'm try going to try to keep this brief. Essentially, Rock Band 2, I was playing that game at a time in my life where I was just starting to get into video games media, transitioning from Entertainment News, which is what I was originally doing after I graduated, um and moving into video games. I was on a Rock Band 2 reality show on VH1. Little known fact, you can still find it on the internet somewhere. I have the whole digital file, of course you do. Um because my husband, John Drake, was working for MTV Games and Harmonix at the time and he was a producer on the show. And that's where we originally met. We didn't actually start flirting and for like five years later. Didn't he forget you? Didn't he even remember? He forgot that that's how we met. Once we for once we finally started dating, somebody was like, oh, so how did you met? And he's like, oh, you know, we've just known each other from like conventions and I've been in PR and she was covering stuff. And I was like, um excuse me, that's not",
      "start": 2599.84
    },
    {
      "text": "was like, oh, so how did you met? And he's like, oh, you know, we've just known each other from like conventions and I've been in PR and she was covering stuff. And I was like, um excuse me, that's not actually at all how we. Do you not remember Pip, which was my avatar? Cuz in Rock Band, you had avatars that you could dress up. And um it was Pip after Pippi Longstocking and freckles, red hair. Yeah. Um so it was it really put him on the spot. It was funny. But um I still have my Rock Band 2 guitar that I used on the show because the show was Sebastian Bach and Alice Cooper having a battle of the bands. And the contestants were all vying for a chance to be in one of their bands. And I was selected to be the lead guitarist in Alice Cooper's band. Made it to the finals, got second place. Was a **** heartbreaker. Your career would have been on a fast track if you got first place. Really? Was the song selection that did well? It was fun listening to Alice Cooper sing Pinball Wizard on stage at The Viper Room. Yeah.",
      "start": 2649.0
    },
    {
      "text": "your career would have been on a fast track if you got first place. Really? Was the song selection that did well? It was fun listening to Alice Cooper sing Pinball Wizard on stage at The Viper Room. Yeah, in Los Angeles. It was excellent. But it was nothing compared to Sebastian Bach singing and hello ladies and gentlemen. So Cheap Trick. Yeah, it was good. It was a fun time. But um that game really kind of defines not only like something really personal for me and like that's where I met my husband, but but also like that was the time when I when Rock Band was coming out. That was the first year that I covered E3. That was like the start of my career in in video games media. And I forever look back on Rock Band 2 with nothing but love. Is your guitar like mounted in the house now? Some it is. It's in our studio in the What's Good Games Studio. Awesome. Yeah. Uh Halo 5.08 wrote into kindafunny.com/kfgd, just like you can. It says, hey Greg, I'm trying to decide whether or not upgrading to the PlayStation 4 Pro is worth it.",
      "start": 2692.16
    },
    {
      "text": "What's Good Games Studio. Awesome. Yeah. Uh Halo 5.08 wrote into kindafunny.com/kfgd, just like you can. It says, hey Greg, I'm trying to decide whether or not upgrading to the PlayStation 4 Pro is worth it. I don't have a 4K TV or that fancy HDR junk, but my current PS4 is slow dying as it sounds like a small jet engine attempting to take off from the corner of my room. The white PS4 Pro bundled with Destiny caught my eye, but carries a hefty price tag for a college student. Is it worth upgrading to the Pro or am I better off picking up the cheaper PS4 Slim? I say go Pro. My whole thing is like now that there's a better version out, if I am to buy a a PlayStation 4, I'm going to buy the Pro. It's 100 bucks extra. It future proofs you. It does run the menus quicker. It's got the better internet on it. Like I understand you're in college, so that might carry it. But if it's 100 bucks, right? Like you can you can not drink beer for a couple weekends and there you go. Yeah, at this point if you're going to buy",
      "start": 2739.88
    },
    {
      "text": "I understand you're in college, so that might carry it. But if it's 100 bucks, right? Like you can you can not drink beer for a couple weekends and there you go. Yeah, at this point if you're going to buy one or the other, save up the extra money however you can, you know, pick up a side hustle if you need to get the Pro. Future proof is is the best argument for that cuz you're going to have this another, you know, a few years, knock on wood. And so hopefully at least another five years. Exactly. Well, I'm thinking before like the next like you're talking about yes or two days ago when the next console generation really begins. And even then it'll be be playing cool stuff on it. Yeah, you need it. Uh Trey Omega wrote in and said, Kon'nichiwa Greg and Andrea. This question is more for Greg and the Trophy Hunters out there. I love trophy hunting and getting screenshots for each one can be fun. But have you ever set up or tried to set up a Platinum screenshot? I found some trophy screenshots can be complete",
      "start": 2783.36
    },
    {
      "text": "out there. I love trophy hunting and getting screenshots for each one can be fun. But have you ever set up or tried to set up a Platinum screenshot? I found some trophy screenshots can be complete garbage because this because of the slight delay some games have when unlocking trophies. So talking about yeah, when you pop a trophy and it automatically takes the shot. And the fact that so often it's a black loading screen because nobody thinks it through or whatever on when it is. 1,000% I've done that where I think it was even Horizon. Maybe when I knew that I was like, all right, cool. I had to knock down this last uh one of the test dummies or whatever. This hits me deep. That's the only Platinum I've ever gotten and never popped because I had three glitched trophies. You remember me telling D? Did I remember they reached on Twitter though? Was there just nothing they could do? No, I I never got the Platinum. I guess I could go try to resync and see see if it actually pops. Sure. No, yeah, yeah. But yeah, so",
      "start": 2821.28
    },
    {
      "text": "they reached on Twitter though. Was there just nothing they could do? No, I I never got the Platinum. I guess I could go try to resync and see see if it actually pops. Sure. No, yeah, yeah. But yeah, so black screens, huh? Yeah, because you know, because it does it automatically now, which is like kind of nice, but kind of garbage cuz it just takes whatever. What I did for Patapon, of course, is that when it popped, I hit the share button so that I had it. I had it. I wanted it my way. I didn't want it like on anything else. That's that's the way I get around it. But I did for that one when I knocked it down, immediately try to spin the camera around. I've done it for Uncharted 2 where you spin the camera and try to get a nice shot or frame it up so that when it pops. But then there's the other ones where you just have to do something super annoying or super cumbersome and then it just gets whatever the hell loading screen garbage. Really upsets me sometimes. Well, if it bothers you, I you know, just be ready for",
      "start": 2858.72
    },
    {
      "text": "have to do something super annoying or super cumbersome and then it just gets whatever the hell loading screen garbage. Really upsets me sometimes. Well, if it bothers you, I you know, just be ready for it. Yeah, exactly. Yeah. Trey says part two for both Greg and Andrea. I can't seem to complete Naughty Dog games. Why? I played through Uncharted: Drake's Fortune and that's as far as I got. I have the Uncharted: The Nathan Drake Collection and Uncharted 4 on PS4, as well as Only The Originals on PS3. Even with The Last of Us didn't absorb me the way I expected as a long time PlayStation fan. Why can't I get into these games? It's on you, man. You got to look. You got inside that they're all great games and so many of them have had such fantastic endings. Yeah, I mean, yeah, I mean, I don't want to like spoil any endings here, but like why would you not want to finish them? I guess if you are the type of gamer who likes a lot of non-stop action, perhaps that's why these games aren't grabbing you because there is action, but",
      "start": 2892.24
    },
    {
      "text": "but like why would you not want to finish them? I guess if you are the type of gamer who likes a lot of non-stop action, perhaps that's why these games aren't grabbing you because there is action, but it's really like the focus is more character building, relationships. Yeah, exactly. And that's the thing. I guess like I think you're saying in so many words, you don't like that kind of you don't like that kind of game experience. You do want action. You don't want I'm going to talk to Ellie about whatever triangle above her head she's talking about this movie poster. Yeah, you don't want to run through it, which is totally fine. You're wrong and you should play those. But I'm wrong and don't play a lot of things I should play. I know. I'm going to do two more. Why not? Pete's the next first one. The rest of the year is sacked with great games, which has me worry that there could be some games that struggle to sell in this competitive marketplace. Please ordering the F please order the following list of",
      "start": 2932.76
    },
    {
      "text": "of the year is sacked with great games, which has me worry that there could be some games that struggle to sell in this competitive marketplace. Please ordering the F please order the following list of games from most to least likely to flop commercially. The list goes because you can play at home: Mario + Rabbids Kingdom Battle, Agents of Mayhem, Knack 2, The Evil Within 2, Vampyr, with a Y, of course. So this is tough because all of these games have I've heard good things from at least one person about all of these games. Yeah, so the idea that we have to pick which one's going to flop commercially versus critically, is that is that? Well, he yeah, commercially. You're right, you're right, you're right, you're right. Okay, so we're least likely to flops. Mario + Rabbids. Oh yes, that's least likely. You know what I mean? We have five games here. So that's then. So I'm doing this actually the opposite. I'm just we're just building the list with you. All right, so Mario is least likely, so",
      "start": 2971.68
    },
    {
      "text": "least likely. You know what I mean? We have five games here. So that's then. So I'm doing this actually the opposite. I'm just we're just building the list with you. All right, so Mario is least likely, so I'm putting it down there. And I guess then I'll count that as one, right? That's not makes sense. Cuz one is least likely, five is most likely. Yeah, five gets interesting. Let's let's build our way there. Okay, I would say two is The Evil Within 2. Yeah, I agree with that. Cuz the first one did pretty well commercially. And it's one of those like it's got It's a sequel. It's got a good buzz around it. I didn't even play Evil Within 1, but like the fact that people did enjoy it and now they have another one, I'm like interested to see what that's all about. All right, all right. I would say next, here's the problem. And I'll be 100% honest with you, Andrea, I don't know a goddamn thing about Vampyr. Okay, so this is um from oh my gosh, I know the team that did this. Uh Brittany talked to me about this. She saw it",
      "start": 3023.48
    },
    {
      "text": "and I'll be 100% honest with you, Andrea, I don't know a goddamn thing about Vampyr. Okay, so this is um from oh my gosh, I know the team that did this. Uh Brittany talked to me about this. She saw it at E3. It is so it's a Focus Home Interactive, Dontnod. So the people who made Life Is Strange. So it's so there's a conversational narrative element to the game similar to what was in Life Is Strange. But um it's a little bit different. Obviously, it's vampires. From everything that she told me about the game, it sounded cool. The screenshots look good. I enjoyed what I play. Strange gameplay where I'm walking around talking to people. I think there's more action. Okay, okay. H so I would say I would maybe put that at number two. Re you mean I think I think Knack 2 is number three here. I think it's in the middle of the pile. So we're saying most to least now. Mario, Evil Within. I think Knack 2 is the next one. Yeah, okay. No, I think we agree that just making sure, just making sure. And then you think Vampyr and I think",
      "start": 3064.0
    },
    {
      "text": "pile. So we're saying most to least now. Mario, Evil Within. I think Knack 2 is the next one. Yeah, okay. No, I think we agree that just making sure, just making sure. And then you think Vampyr and I think Vampyr. Wow. Okay, because I think that concept is just a little hard to explain. And as awesome as Life Is Strange was, I don't know if this concept is going to resonate here's far and wide. So here's my thing. Obviously, I've I've been beating the drum against not even against Agents of Mayhem, just the fact that nobody's talking about it. It's a very confusing idea. We have only four people are interested in it. List of course, in case you don't You missed an episode of Games Daily. We we've covered this extensively. People who are excited in Agents of Mayhem, it's Angry Dad 808, who's written in twice about it. The guy from Twitter, the kindafunny.com/Kinda Funny Games Daily guy. And then RyDog5. This is all just cool Greg graffiti. Don't don't pay attention to that. But then I said after this that there",
      "start": 3126.92
    },
    {
      "text": "guy from Twitter the KindaFunny.com Kinda Funny Games Daily guy and then Rydog5 this is all just cool Greg graffiti don't don't pay attention to that but then I said after this that there was we wouldn't accept any more people for the list because now you're just writing in to get your name on the list and I understand that the the real Agents of Mayhem vibe isn't there but the problem is Vampyr is it just downloadable is it all platforms what are we looking at there okay let's cuz there's more Agents of Mayhem is going to be everywhere it's coming to PlayStation 4, Xbox One, and PC in November okay upcoming action role-playing video game developed by Dontnod published by Focus Home Interactive and Britney likes it Britney's excited about it she liked it she's a huge **** dork so she likes a lot of weird stuff though I know I know I know but that with the weird stuff she likes there's like she's in the you know the niche about it she's she's in the niche if you want to say",
      "start": 3179.48
    },
    {
      "text": "so she likes a lot of weird stuff though I know I know I know but that with the weird stuff she likes there's like she's in the you know the niche about it she's she's in the niche if you want to say like that I will say she doesn't like bad stuff she just likes weird stuff good point good point good point she's not see that's the thing knowing little to nothing about Vampyr I'm still I still believe more in Vampyr than I do Agents of Mayhem again not because Volition's bad not because anything like that I think I'm sure the game will be quality to it I'm just saying I don't think anybody knows what the **** it is and the fact that it's out in two weeks is pretty alarming that we don't know that people don't care do you want me to read a little blurb about it about Agents of Mayhem or Vampyr Vampyr please um Vampyr's main character Jonathan E. Reid is learning to deal with changes he's undergoing as a new vampire a high ranking military surgeon who was transformed into a",
      "start": 3227.8
    },
    {
      "text": "or Vampyr Vampyr please um Vampyr's main character Jonathan E. Reid is learning to deal with changes he's undergoing as a new vampire a high ranking military surgeon who was transformed into a vampire upon his return home from the front meets a couple of interesting characters who either want him to embrace his new found Darkness or help him run away from it uh they published a 10-minute gameplay segment that was noticeably absent from Sony's PlayStation conference you son of a **** focuses on the story that players will work their way through in the game and the difficult choices will have to make but there was a glimpse of combat as well released this November can see do you have a screenshot for me yeah you want to see a little bit of this I do want to see a little bit of that hold oh here here we go okay we're looking at the video for everyone who's listening there is a uh Greg is watching a little bit of gameplay do you know how to Skycam can you Skycam yeah hold on hold let me",
      "start": 3265.12
    },
    {
      "text": "oh here here we go okay we're looking at the video for everyone who's listening there is a uh Greg is watching a little bit of gameplay do you know how to Skycam can you Skycam yeah hold on hold let me let me full screen this this is your new computer huh this is my new computer do you like it so far so good yeah I was talking on Twitter yesterday about how useless that touch bar is but well yeah it looks I mean it's very pretty oh there you go and there comes the choices oh here comes some of the combat Jimmy the Spark Barlo yeah I'm going to say that this is going to do better than Agents of Mayhem it looks more interesting I'm more intrigued about it yeah I know you kids love vampires out there you're all Goth and doing your thing drinking each other's blood that's what the kids are about it comes out in November not too far there's time to build to it there's time to build excitement for it still exactly or do I feel like Agents of Mayhem the windows closed I think it is and it's it's",
      "start": 3305.64
    },
    {
      "text": "comes out in November not too far there's time to build to it there's time to build excitement for it still exactly or do I feel like Agents of Mayhem the windows closed I think it is and it's it's tough because I know the team making that game's awesome you know and they have such a great reputation making these wacky over-the-top world games remind me again of it's the beta like right now and then the release is the release it's coming up really quickly exactly I think it's the end of August right and it was like the first week of August there was a I don't care that much about the beta part of it just like when it's coming out out um I thought there was a date let me look thank you as always if you guys are wanting to correct us for something we got wrong but give us a chance to figure it out before you do cuz I know the corrections are going to be all over the NPD thing today as I was wrong and I'm sorry I felt off my game at the beginning of the show it just says later this month",
      "start": 3352.16
    },
    {
      "text": "it out before you do cuz I know the corrections are going to be all over the NPD thing today as I was wrong and I'm sorry I felt off my game at the beginning of the show it just says later this month for the game I'm surprised that they don't have a specific date no they do for the game for sure or is that the beta you're looking at no I don't I didn't hear anything about a beta I don't know why there'd be a beta at single player but there was something it doesn't matter with the re this all stems from oh maybe they went gold there was something we did a thing of like they this is happening on this date and then the game comes out this date yeah somebody um I think um Will Powers who works for Deep Silver who's publishing tweeted copies of the game I think like the physical copy to be like hey look it was new story that's where it all stemmed from but you whatever you keep looking okay but I think August 15th is when it's coming out yeah see that game's **** sorry straight up like I",
      "start": 3396.4
    },
    {
      "text": "hey look it was new story that's where it all stemmed from but you whatever you keep looking okay but I think August 15th is when it's coming out yeah see that game's **** sorry straight up like I so yeah least successful the most successful Agents of Mayhem Vampyr Knack The Evil Within 2 Mario yes that is our official prediction for you why not Pete keep track of it let us know what Kinda Funny Games KindaFunny.com Daily somebody already tweeted The Rock B to the Stars Vimeo oh yeah they did they're all over it what time is it it is 1:01 p.m. okay we had no clock I had no I had nothing I didn't know where I was at anymore I'm lost in a haze over here I'm going to this is the last question comes from Gundam Hayes and it'll be super short everybody stick with me he wrote into KindaFunny.com KFG Daily and he says Minecraft on PS4 or Vita PS4 he had a whole he had a whole long thing about it he's I'm a music teacher in Illinois his wife I have a 7-year-old never played Minecraft",
      "start": 3432.52
    },
    {
      "text": "of KindaFunny.com KFG Daily and he says Minecraft on PS4 or Vita PS4 he had a whole he had a whole long thing about it he's I'm a music teacher in Illinois his wife I have a 7-year-old never played Minecraft want to get into if you're if it's a real choice you do PlayStation 4 it's a much more fleshed out version of the game not the Vita version is wrong if you only can play on the go or something and you want to play it on Vita I did that for a long long time before the Switch version showed up get in there now time to Squad Up this is where one of you beautiful bastards writes in KindaFunny.com KFG Daily you give me your username on whatever platform you need friends for you tell me why you need those friends and I read it here then the best friends who watch and listen to this show find you on those platforms play the game with you and everybody's happy today Philip from Austria writes in with a PlayStation 4 username uh this is uh one that doesn't make sense in English so I'm inclined to say",
      "start": 3479.92
    },
    {
      "text": "platforms play the game with you and everybody's happy today Philip from Austria writes in with a PlayStation 4 username uh this is uh one that doesn't make sense in English so I'm inclined to say this is a bad PSN name maybe it means something in another language though g u e n z i c h a Goa sorry if I offended a culture I been playing all the Everybody's Golf game since the first one on PSP and I am still occasionally playing the Vita version which is the best one regardless of what Greg thinks you're wrong it's not the best one by not by a long shot Hot Shots Golf Open Tee PSP best one not even PSP not even the second one I'm just telling you straight up I have I also have the Platinum which is extremely rare and apparently too hard for Greg you can go **** yourself why am I even reading this anymore I've been looking forward to this game for years and unfortunat but unfortunately I will miss the launch due to being on holiday with my family some fan you are but I would like some",
      "start": 3521.72
    },
    {
      "text": "this anymore I've been looking forward to this game for years and unfortunat but unfortunately I will miss the launch due to being on holiday with my family some fan you are but I would like some best friends to play tournaments with and compare daily scores with when I return in early September thank you guys and gals for the fantastic work you're doing I was really heartbroken when PS I Love You XOXO ended since I've been listening to Beyond! for years but the Games Daily is a great substitute even though I missed the PlayStation focus a little bit you're right I'm all up in here telling you about all the Xbox stuff I'm Xbox expert greetings from Austria that's in Europe Philip thank you Philip I need to know where Austria is everybody I I should read the name again since it's gibberish unless it's something that means a lot to him g u e n z i c h a on PlayStation 4 get ready for Everybody's Golf I can't wait all day stream here when that pops it's going to be really great Andrea yes",
      "start": 3565.04
    },
    {
      "text": "unless it's something that means a lot to him g u e n z i c h a on PlayStation 4 get ready for Everybody's Golf I can't wait all day stream here when that pops it's going to be really great Andrea yes Greg you are now going to go to kindafunny.com/yourewrong and read all the stuff that the people who are watching live corrected us on you got it first thing wrong was Greg not complimenting Andrea's necklace on the restart shake my head I said I wasn't going to do that on the restart and we we were hiding from people what the restart did be a bro don't don't throw us under the bus telling us what the restart did Greg said the Crash Bandicoot N. Sane Trilogy was charted in the month of June after two days of sales it was actually released June 30th and that was the last day of the month so Crash Bandicoot charted after one day of sales you're wrong Miller it's true it's true um the NPD for the top 10 games of June which we uh looked",
      "start": 3601.96
    },
    {
      "text": "June 30th and that was the last day of the month so Crash Bandicoot charted after one day of sales you're wrong Miller it's true it's true um the NPD for the top 10 games of June which we uh looked up at number four um that's not are you're wrong um defamation suits can only be at most seven years so this is in reference to the Miss Cleo story after the first publication of the content in question though Connecticut may have changed their defamation suit since I last checked the statute of limitations on copyright infringement is three years in the US since first publication at the latest it's been four years since Vice City was released on Fire OS that's that's an interesting side note that I didn't think about Kindles and Fire TV so the Psychic Network has no case Network also sued General Mills a few years back for a similar issue when Miss Cleo was used in a cereal commercial huh all right cool interesting thank you very much legal expert um these are not your wrongs stop",
      "start": 3643.4
    },
    {
      "text": "Mills a few years back for a similar issue when Miss Cleo was used in a cereal commercial huh all right cool interesting thank you very much legal expert um these are not your wrongs stop editorializing Andrea said that the movement speed has been increased in Paragon only attack speed and ability cooldowns are being modified thank you for that clarification I apologize if I misrepresented myself it just feels faster because you're throwing your things faster exactly I hate throwing my things faster thank you for that correction um sorry Greg but I don't know if this is a correction sorry Greg I I want to help the broke college kid with the loud PS4 spend $10 on a T8 security screwdriver and watch a YouTube video and dust out your system it'll be it'll silence that fan and keep your system cooler that's true so not that you're wrong but a helpful tip but just like me he he wants to buy the PlayStation 4 Pro he just needs something to happen he needs it to die you know what I",
      "start": 3692.4
    },
    {
      "text": "system cooler that's true so not that you're wrong but a helpful tip but just like me he he wants to buy the PlayStation 4 Pro he just needs something to happen he needs it to die you know what I mean yeah it's like yesterday he needs an excuse the PlayStation 4 did something wonky and I was like is it time is it uh no not yet okay you work in video games you can buy new PS4 whenever you want I know but it's not I don't want to I'm not going to be wasteful and then what am I going to do I got a PlayStation 4 with my name engraved on it I'm not going to get rid of that thing I got a PlayStation 4 this 20th anniversary PlayStation 4 I'm not going to get rid of the I getting a new one just adds more **** to the walls in the cabinets in the house you're fine um Vampyr is going to get buried in November something that we didn't think about but it's not in comparison to the other games it's in comparison just to the games we list exactly and I think that Vampyr has a better chance of",
      "start": 3740.92
    },
    {
      "text": "in November something that we didn't think about but it's not in comparison to the other games it's in comparison just to the games we list exactly and I think that Vampyr has a better chance of finding an audience that's going to really dig it to buy copies of it to make it more successful than Agents of Mayhem yeah yeah that's it oh cool ladies and gentlemen this has been Kinda Funny Games Daily thank you so much for watching and/or listening remember you can catch us as we record it live on Twitch.tv/KindaFunnyGames but we don't interact with you that's where your wrong comes in you can of course watch it later on YouTube.com/KindaFunnyGames or listen on podcast services around the globe regardless of where you get it thank you very much for consuming it it would mean a lot if you subscribed to the other platforms and rated them there but hey I'm not going to twist your arm we are close to 1,000 reviews on iTunes it'd be cool if you did that but again you do your you do you",
      "start": 3777.4
    },
    {
      "text": "if you subscribed to the other platforms and rated them there but hey I'm not going to twist your arm we are close to 1,000 reviews on iTunes it'd be cool if you did that but again you do your you do you you got things to do you got places to be I understand um things to promote really I'm thinking I'm streaming today that's a good one Twitch.tv/WhatsGoodGames I was I was getting there I the kind was in the back of my throat so I had to cut it off real quick and get there I haven't decided what I'm streaming yet I'm going to make a decision on the fly what time is it happen 6:00 p.m. Pacific 6 p.m. okay okay okay play Friday the 13th I was thinking about it yeah hell yeah you were yeah I was like maybe I could play Fortnite but I was like that's probably real boring to watch so maybe not yeah I thinking about Iron Banner since it's like the last hurrah okay okay thinking about it if you guys have thoughts if you want to come watch the stream tweet to me let me know what you want me to play",
      "start": 3813.96
    },
    {
      "text": "I thinking about Iron Banner since it's like the last hurrah okay okay thinking about it if you guys have thoughts if you want to come watch the stream tweet to me let me know what you want me to play I would try to join you for Friday the 13th but I can't commit okay a soft commitment exactly it's an interest there's a there's a hard interest a soft commitment uh and then yeah right now you can watch the Gamescast with Andrea later today Patreon.com/KindaFunnyGamesLive it'll be up on Friday for everybody else I haven't done any graphics for this because I'm lazy and well not lazy actually really overworked but Monday we're going to stream all of Batman Season 1 episode one with Troy Baker and Anthony oh Troy's going to be here I might have to crash come on by please you know that anytime we'll do it right after Kinda Funny Games Daily on Monday so that's that for now we'll be back tomorrow us again so address the questions there and until next time no it's been our pleasure to serve you oh",
      "start": 3851.88
    }
  ]
}
