{
    "id": 2869,
    "video_id": "J_FKfkrZhAg",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Kevin Coello"
    ],
    "title": "Mario + Rabbids Kingdom Battle Let's Play - Kinda Funny Plays",
    "description": "Greg and Kevin kick the tires on Mario + Rabbids Kingdom Battle co-op!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1501603201,
    "duration": 3334,
    "transcript_chunks": [
        {
            "text": "what's up everybody, welcome to another Let's Play here on YouTube.com/KindaFunnyGames. I'm one of your hosts, Greg Miller, alongside the glue, Kevin Coelho. Now Kevin, you're also known as the GoPro. If you have a puzzle mind, you have a tactical mind, and that's why they, when they invited us to play Mario + Rabbids Kingdom Battle, I said, \"Do I want Tim? No, he's even a crash, he sucks. Do I want Nick? No, he sucks in general. But I want Andy? No, he's too attractive. Do I want Joey? No, she's too attractive. I want Cool Greg? No, he's too cool.\" I said, \"I want Kevin Coelho on my side doing the co-op for Mario.\" Sure, exactly, first choice, right? They're all so real, so dizzy, but we're jumping, we're doing some co-op here. Now I've played a lot of XCOM, that's where I feel like my, you know, my chops shine through. Okay, how much like, how much is like tactical stuff with people? Also perfect, that's what I want to do. All right, well, thicker teams, I'm team one, you're team two. Now, how do you feel about these Rabbid fellows?",
            "start": 0.0
        },
        {
            "text": "how much like, how much is like tactical stuff with people? Also perfect, that's what I want to do. All right, well, thicker teams, I'm team one, you're team two. Now, how do you feel about these Rabbid fellows? They've always disturbed me. I've never been a big fan of them existing. Yeah, they're here, here, what are we gonna do? Yeah, it's like when you have a kid, it's like, \"Well, it's here, I gotta love it now.\" Yeah, right, right. So now, are you gonna go, are you to go for some, you're just getting right up. Oh, you're looking, oh no, yeah, no, you're in it. Look inside. It's like what they were talking about, like, you know, like Luigi here, she's like a sniper, she's got the shot, you've got the rain ever their life. And then they were talking about the one here, you've chosen the Rabbid Mario, right? He's a tank. I already played with him. I already know I like what he brings to take, what it does, some solid this too. Okay, I want to be, I'm definitely gonna pick Mario. Yeah, I mean, you gotta have Mario in there, sure. Okay, so I'm told.",
            "start": 43.89
        },
        {
            "text": "him. I already know I like what he brings to take, what it does, some solid this too. Okay, I want to be, I'm definitely gonna pick Mario. Yeah, I mean, you gotta have Mario in there, sure. Okay, so I'm told that given a normal sound, but you know, you've not done. Yeah, I'm gonna get outta here, get them. All right, so I'm gonna be, I wanna be Rabbid Luigi. Oh yeah, two barrier at the rocket launcher at the Bworb. I think that's, it's got to be a type of the Bworb. No, that's, it's important, you know, the Bworb. That's a very honest thing. I know without typos. Joker, make fun of Rabbids, you know what I mean? Hit David, let's go jumping. I know I was making a joke, they were all making a wrong saying, \"Oh no, whatever.\" They know it's not a thing, but thank you. It's like, it's like a sword, but it's a Bworb bubble, a Bworb. I here we go. And I, we have to defeat four Pewits. What's he know? That's easy, that's it, cheesecake. Um, but remember, they're gonna kill the",
            "start": 84.0
        },
        {
            "text": "it's like, it's like a sword, but it's a Bworb bubble, a Bworb. I here we go. And I, we have to defeat four Pewits. What's he know? That's easy, that's it, cheesecake. Um, but remember, they're gonna kill the vampire ones. But now I'm gonna, the first thing we're doing, we're prepared for about late. There's vampires going to survey the field. Now what I'd like to point out to you, it's what a living hell this week. Oh my God, I'm trapped in. It's like honey, but a loop or anything else, you're gonna die there. Yeah, like these Goombas are going to starve to death and die. And I feel like I was thinking about when I was looking at it earlier, right? Yes, my first instinct would be sit there, maybe wait for help. But then I was, I think maybe the realistic would be, I got to fight while I still have all my faculties, while I have the most energy in my body. I know he's gonna rip off one of your legs, but I mean, that's better than the, I know by the time you're like, \"No one's gonna come save me,\" your starvation levels, you can't",
            "start": 130.38
        },
        {
            "text": "the most energy in my body. I know he's gonna rip off one of your legs, but I mean, that's better than the, I know by the time you're like, \"No one's gonna come save me,\" your starvation levels, you can't get out. But then my thing was, I was gonna do real fast and push off. But then my body, which is my hand, which is create the feel, this is a nightmare. This game should be rated M. Many people gonna cry. All right, here we go. So I'm gonna got these guys say, \"Oh guys, we got a Guardian Ziggy.\" Now if I've hated Ziggy comics as long as I'm alive, you know I hate Guardians, thank you. So don't trust them. Going to be a while. Anyone ever likes a Ziggy comic? Like Elaine didn't Seinfeld, \"Finishing, ah.\" But like she was made as an unlikable character. I always say, \"Oh yeah, exactly.\" As they were, is there a bunch of punks, Phil, Kayla, ready? I'm sure I want to fight this fight. We have an optional. I feel like no, no, let's, let's try to people's without this out, solve this peacefully. Here we go. So here you see what I",
            "start": 176.22
        },
        {
            "text": "punks, Phil, Kayla, ready? I'm sure I want to fight this fight. We have an optional. I feel like no, no, let's, let's try to people's without this out, solve this peacefully. Here we go. So here you see what I appreciate is that you can immediately understand. So by looking at it, right? So over here, I've been out half cover, right? Half the fun in a 50% chance that you have this guy over here, half cover, 100%. You know I'm taking that home. Yeah, coming over to artist's choice. Okay, we're going to hang in each glass, guys, drunks. I got what I got, the Fat Cat Gun. Okay, that guy, a Fat Cat Gun and attract attack, Michael, thank you. This guy's dead. Okay, it's not the 105, 115. No, you're right. It's got a spring rating up 144. What does that mean? No windows, no, nobody know. Shoot him in the way that amount that applies. Golden Shot. I have it. Get cold showers, Bobby. I totally imagine you'll be shocked about trying one. Yeah, well, you know, homie, but you know, it's all right. I'm gonna go to hear a sight. Now it's like the Overwatch.",
            "start": 217.87
        },
        {
            "text": "shot. I have it. Get cold showers, Bobby. I totally imagine you'll be shocked about trying one. Yeah, well, you know, homie, but you know, it's all right. I'm gonna go to hear a sight. Now it's like the Overwatch. They're from now, they're Apple. We got it. All right, thanks. This queue again. I'm gonna picture myself damages. You show everything, you know, just don't come back. I got a cover. So your might discern that we were recording. Your mic seems so sensitive. What appears to play like when you talk, I see all the night cream up. No, yeah, yeah. I mean, I got our message. All right, here we go. Did you, I moved him over there. See what was up. And now I got to decide what I want to do. Have this thing use it. Oh my God. Yeah, a big red. Can you woke up there, Stevie? Can aim higher? Oh, Jackie, 'cause if you can get him in the splash back, why not? Oh God, what I like, but are you getting him, Billy, still out of the circle? That's pathetic. If I, I can aspire one, you know, and Thomas, statement, not time to shoot that you anymore. Then now how",
            "start": 264.97
        },
        {
            "text": "why not? Oh God, what I like, but are you getting him, Billy, still out of the circle? That's pathetic. If I, I can aspire one, you know, and Thomas, statement, not time to shoot that you anymore. Then now how to keep sound static, not driving. If I lower this, let me come here for you, Atlanta, Marines. That guy was married. Shoot in Europe, Gala Theater. Why? Just wanna make sure that I understood exactly can happen. And then they're totally clear. What, what do you think is gonna be a first move here, Rabbid? I probably hit X. You want to look around, P-Monster? There you go. That, yeah, I like you going into the camp. It's some tactile feedback, you know what I mean? Right now you, you have to play that Wildlands, right? Like right now you're not your own, you're a drone up there. Yeah, looking around or scout now. And you look down and what do you see? Oh my God, these Rabbids have mutated into things called Rabbid. At some point, I believe a human mated with a rabbit and made a Rabbid. Now they've run about their",
            "start": 332.61
        },
        {
            "text": "and you look down and what do you see? Oh my God, these Rabbids have mutated into things called Rabbid. At some point, I believe a human mated with a rabbit and made a Rabbid. Now they've run about their backstory. This now, man, it is that how you be? So really, they have like Rabbid and you would talk holiday. Oh yeah, they have a out of under before. Can't be a B. It's Kinda Funny to put it out. Trevor's trap, I believe, because they stick. He didn't keep saying, \"I feel so confident.\" Yeah, well, unfortunately, I think I have a shotgun, right? Okay, I mean, I'm gonna, I'm gonna try. There's what is the first 50%? Is like the chance of aim. What is it? 0%? There a chance the pigeons? Maybe. I don't know. Maybe. Hey, that's what I thought. Yeah, and I'm not hitting any of you guys, right? Your guide, you clear my shotgun. Yeah, we look, we look in this. They would say, \"Do it.\" Always Tara. Okay, yeah, was carried. But you got it done. Yeah, gonna be. And he's still alive, right? He's alive. Yeah, he took, he took. You blew up all the",
            "start": 404.95
        },
        {
            "text": "Yeah, we look, we look in this. They would say, \"Do it.\" Always Tara. Okay, yeah, was carried. But you got it done. Yeah, gonna be. And he's still alive, right? He's alive. Yeah, he took, he took. You blew up all the cover around us. Maybe not the best tactile. I didn't have a good strategy. That's how much you think that move. Oh yeah, you and me are both in there. So when this guy moves, Mario and then Rabbid Mario taking up a big weed. He's over here making you remember the year. Luigi, not too long. Oh, you know what? Now Luigi, great sniper. Yeah, so I can from here take a shot. And what shot? I'm sure, sure. Get that to kill this guy here. I know I'm not killing into that. Oh, I thought that's how much is already laughing. Sorry. I think that's telling me how much. Oh, there you go. So you have 100% chance of hitting and then 50% chance of his blood splattering on his brother, his brother. And even Statham done. Oh yeah, yeah. And not only I ain't good to death, though he disappear. That's what happens, man. Trust me. I get it.",
            "start": 464.89
        },
        {
            "text": "50% chance of his blood splattering on his brother, his brother. And even Statham done. Oh yeah, yeah. And not only I ain't good to death, though he disappear. That's what happens, man. Trust me. I get it. Yeah, every, every time squad never broke. And I can attack him. Yeah, well, this is what, this is what I think they're telling us to do. Whenever was a chance, do that movement where you run into hit them and then get away from who, what? Let's go pick up this one. Coins are collectible benefit. You're single player. Love this. Ham pointless anything. I don't, I hate about coin club. Touch a bunch of pennies and nickels. Yes, I like coins. Now you're using that. We got a Gator. What? Yeah, I just want to go crazy out of it. Oh, I'm gonna, okay, yeah, Mario could do that. You're gonna knock off. Look at this, look at this, look at this. Clean in here, the expertise. Now this is pretty incredible. I'm very excited. I'm actually coming into the ball. I didn't know how is that. I'm a jerk. But we're gonna",
            "start": 512.69
        },
        {
            "text": "at this, look at this, look at this. Clean in here, the expertise. Now this is pretty incredible. I'm very excited. I'm actually coming into the ball. I didn't know how is that. I'm a jerk. But we're gonna know right here. Oh, I could see myself really enjoying. That's the thing. I will like the guys like women when they show the city thing. I like why they fall in a room ball. And then when they got it like, \"Oh, it's XCOM.\" I'll switch it. Look, still not a fantasy when we saw today. You're gonna get ice for this guy. All right, here we go. Here we go. Overwatch point-blank sniper rifle to the beat. Yeah, take that, Nancy. Carry in heavily cover that. Yeah, remember that? I mean, no, I don't remember. I think I was too young at the time. No, it was a national tragedy. Strong. Yeah, look at that. That was great. That was you. That is your great Overwatch right there. Was it? Yeah, you're up there, mighty Luigi, making sure all this happens. A great tactical position for a sniper to be 100 high above. Okay, go Rabbid. Will ever love me? Oh,",
            "start": 568.91
        },
        {
            "text": "your great Overwatch right there. Was it? Yeah, you're up there, mighty Luigi, making sure all this happens. A great tactical position for a sniper to be 100 high above. Okay, go Rabbid. Will ever love me? Oh, they give as good as they get. Yeah, I did. Oh, here we go. No, no, back to tactic. Third Red Bull of the day. What's the worst that can happen? Yeah, my heart. And the funny thing, yeah, double beats too fast. Yeah, maybe yours really excited for Mario. I would think you're a bit about as I was thinking, I want to advance up front. Okay, I'm doing black paper, having what they call perfect game. But number two, stand that, you know, just you got a call like you see it. You got a calling Big Mar, as they call it. Paco Del Mar. Here you go. Would he do next? A lengthening hook. I'm gonna run to cover here. Cover, cover. You could also, all right, yeah, you're good then. That's probably should kill him with this. No, to only warrior can jump on line three, five. You. Yes, so then how you get our shoot this guy? I could give switch.",
            "start": 612.5
        },
        {
            "text": "could also, all right, yeah, you're good then. That's probably should kill him with this. No, to only warrior can jump on line three, five. You. Yes, so then how you get our shoot this guy? I could give switch. My turn is usually kept on. Why? I have time for. We shine the call the with score of the melee again. You don't have to. I don't have good straight into it. Search you like, you know what I should do is move and cover your cover. Okay, you have a partial cover. Oh yeah, but I'd like, I think about standing here better. Remember those guys over there? That'll be a higher plus side. I think it's a canary on your honor. But I just so bad speed you. Someone put them out of their misery. I really want. It's upsetting that we're not allowed to just take the shot that we know it. Muirfield wall. The room, the walls are you'll really good. We had a silver dollar pancake. Uh, yeah, yeah. I don't know why you should be asking about your cousin. Yeah, it's a dumb place just be standing. And how do I switch? Or",
            "start": 722.36
        },
        {
            "text": "walls are you'll really good. We had a silver dollar pancake. Uh, yeah, yeah. I don't know why you should be asking about your cousin. Yeah, it's a dumb place just be standing. And how do I switch? Or better choices to be made static. Just jump right next to. Try to jump light does not cover them. 9mm channeling a free man. I won't have your death in my hands. Too many already. Should have really checked it like totally covered. And I love his shotgun. Yeah, yeah. Good again. They can feel it. Look at him. Do you see the fear in his eyes? Yeah, he no yellow one watching his friend get eviscerated in front of them. Scream for his mother while the Goombas below cries for their mothers. And all the mothers at home today in here. What they draw the brawl, the opponents. Yeah, why not? What's, what's the worst thing happen? Experiment. Oh, thanks a lot. And then what do I do? Mario, Rabbid Fly. And then put the enemies. Look, you guys got these clown shoes. Operation waiting. And it's me waiting to use",
            "start": 809.17
        },
        {
            "text": "worst thing happen? Experiment. Oh, thanks a lot. And then what do I do? Mario, Rabbid Fly. And then put the enemies. Look, you guys got these clown shoes. Operation waiting. And it's me waiting to use magic. Like some people trying to be sneaky, sneaks up there. I got it, Walker. I'm gonna attack the cable. Movement over here with it. Nicholas might order there. That's a great spot. That's what I'm thinking. We got this more from down there to see that. Oh, more, more than you guys are trapped inside where no one will hear them. Now there we go. Here we go. Garden Toppers for. We got, we got. Sorry. I think we got to move up in the Garden Toppers. So like what I say, at least what I'm gonna plan to do is get Luigi on one of those under guys to do damage. But definitely get Luigi up in the tower and the old library. I pull out. He's gonna polish it. You know what I mean? I mean, up until you said he's gonna polish it, I do. I'm gonna chill there, Mario. Not worry about anything. Okay, don't worry. One, you, we're",
            "start": 915.42
        },
        {
            "text": "the old library. I pull out. He's gonna polish it. You know what I mean? I mean, up until you said he's gonna polish it, I do. I'm gonna chill there, Mario. Not worry about anything. Okay, don't worry. One, you, we're bringing the fight. Made Blue Koopas would go. Well, be like that, you know, helicopter. That's right. What I mean, tactic. And then put a feels like, but I'm in Vietnam. If you want to use Italy, immunity for super attacks. No, I think we have anybody coming for exists. I'll pass it back to you, honey, governor's thing. More, you know, night. You actually some folks about movie, hardly. They made a whole shrimp restaurant based on that. Would be like a real in our world, not actor Forrest Gump world. In our world, he'll realize, man. So I'm trying to get up there. I guess right now the best thing I can do is get closer to that exactly reason. And filling queue, we have the Garden Toppers need to be born from the dirt to come after Jones. I still think we have time before they make it lose. Actually, you know,",
            "start": 973.88
        },
        {
            "text": "get closer to that exactly reason. And filling queue, we have the Garden Toppers need to be born from the dirt to come after Jones. I still think we have time before they make it lose. Actually, you know what I need to do? What I want to do in Italy. Sure. I want to put myself in position. I get there, Luigi. Okay, throw him over up in on high ground. There's a tunnel. That's static, Manish. Whatever, man. Oh, that did Jonah, Jonah, vehicle in closer door. We're making the moves. We know that the final battle with incoming. Okay, I'm gonna switch over. Okay, do it. Roger, Roger, do it. We go. Hoppers are here. Like the normal guys. And unimpressed at all. Now, huh? Now you'd say they know how to hop. They know how to get a little flying grace enough to get her bringing them right. Hopping on their own. My true. Sure, Wilma. We're using our human legs. Oh my God, we got to shut down the Dream Factory. My denim is messy. I might explain here, but I haven't. I crazy. I'm definitely bad guys do anything. Yeah, all",
            "start": 1066.86
        },
        {
            "text": "sure, Wilma. We're using our human legs. Oh my God, we got to shut down the Dream Factory. My denim is messy. I might explain here, but I haven't. I crazy. I'm definitely bad guys do anything. Yeah, all this time. Exactly. I'm making miss. Imagine with our Mario Switch. Our do you become doubt great? You get an air when I going to show what were made of. Now that Mario and please cross over with the Rabbids. Do you think those crossed over with Garfield? No, look, I don't even kind of see how that's a like a possibility. I'm just saying like the Nintendo's open the door to cool collaborations of Ubisoft. Why not open a cool door? Says Jim Davidson, swirl. Though Garfield's terrible. Steady on. Oh, I see, mate. Yeah, oh yeah. I didn't want to call it out. Let's try and attract every bug. Garfield stories. Hey, that's all any movement that gets word how to cite good. Jennifer Lopez already where George Clooney bodyguards are. They're breeding like Rabbids. Long nail them alive. We gotta go.",
            "start": 1161.7
        },
        {
            "text": "Garfield stories. Hey, that's all any movement that gets word how to cite good. Jennifer Lopez already where George Clooney bodyguards are. They're breeding like Rabbids. Long nail them alive. We gotta go. One knock it now to eviscerate. You can't have an open casket. I think I will recover it black to like what happens. Why do you wash off his fur, man? Yeah, another good card. Now they're bad. Your nice thing. Suppose another man. He's a little blessing me with that. Yeah, rocks, rattling, girl. Okay, I was so glad you're standing right in front of her. Unfortunately, I have the bodyguard on. So I could've been standing in front of you. I would have been helping late at all. That would really help. Oh, these guys are not. They're playing for keeping. Gonna be there where many of their where the trash we've been talking. And now they are gonna kill me. Oh my God. Oh no. Can I bring you back to life? I don't know. Come Mario. Do you got something? I think about it now. Friends dead. Yeah, he should run in there and just",
            "start": 1287.07
        },
        {
            "text": "talking. And now they are gonna kill me. Oh my God. Oh no. Can I bring you back to life? I don't know. Come Mario. Do you got something? I think about it now. Friends dead. Yeah, he should run in there and just start murdering them. Go. Why don't you put yourself a position where you're really exposed, but you're also get me out. Shock it to their face. You think you would do enough damage? We've let go there with you, with you. I know you found right there, but I want to see you. Oh, right. What I do? I do it like you like to tells you like this, Vanessa. So now you can right there. Yeah, now we're in an hour. Howard, people, brother. I am really like, I forgot about the kid up there. I mean, poor baby. Luigi, Rabbid. Now I think I need your. Okay, you and I go down to be on the ground. Or should I go over there? She try to like go over here and see how big my radius is with Johnson. You still got this guy up. Yeah, thought I'm kind of anyway stuff clothes silly. Or I go right over here. Exposure. Join up as my what if?",
            "start": 1384.92
        },
        {
            "text": "you don't play around. Then he did half cover. Hi. Lighting up this. Okay, can run it. You can run to hit him. Do it. Yeah, I'm like, you know, I, you don't own me. You did say that. Rios, really, queer, appetite of like, what do you mean feeling? I'm like, where's the Garfield crossover? I'll play right now. Garfield. I think it's your thermal right now. You mean an Overwatch. Watch this, Greg. Here we go. I thought I was all funny games when they murdered my boy, Rabbid Luigi. But now we're showing strong the opponent. No, no, nothing squad. Why is Luigi now sir on adulterated shot to him? God, you gotta take the shot with Luigi. You think some? Yeah, I think the shot first. Note up. Well, I guess stop. Because what's you may get here, loser, right? I can get closer. Jump on him. No, I can still move. Okay, let me see how close I can.",
            "start": 1481.36
        },
        {
            "text": "get with him. Get close enough to put the barrel the gun in his mouth. That's maybe like, \"I already ain't your friend. What do you think I'm gonna do to you?\" You go that are owned. You pull the trigger. Hey, I'm gonna jump on him. Okay. Wow, guys, shoot him with the sniper. Nice. Now have you left your left side open them? Yeah, it doesn't matter. I'm shooting him with the sniper rifle now actually. So it's hard. Well, there's two, you know, there's two of them. Yeah. Oh, you know what? No, I didn't. We seventy defeat 40. That all I owe. I didn't like it last. Does that make you something? No, that's just we should be moving. It goes off. Bounce them off. Good job, Eddie. I said the next is harder. You ready to try a heartful? I got this. I'm not never say that I was born to do the Alamo, but I think that's clear for everyone",
            "start": 1558.44
        },
        {
            "text": "watching. But I sure as heck was. I agree. I agree with everything you're saying. We kept dog. That's why I brought you. I knew you would know what to do. Scarpino would be here on duty. I am not a big fan of the new voice it has, by the way. We just be honest. We're alone. We're not a big fan in like Mulan. Oh, well, they were new in Sherbet Desert Revenge. Oh, Tutankhamun. I don't think any of those works so well. I think it's like Tutankhamun, but it's spelled like Rabbid. Now, were you happy with your team? It really was. Okay. In fact, the only thing I wasn't happy is that I wanted more Luigi. No way to do double cleansing jump sounds not cool. You're gonna be like nine elbow cutting jam. It's fine. It's just a weird way to describe it. Developers like you. What we're talking about in war. Oh yeah, no, no, no. Drop it.",
            "start": 1608.28
        },
        {
            "text": "and run. All right. Not a thing that we fact, weird. Silver dollar pancakes. Very good thing. They're very good. Billy, don't you feel like a giant? Number one, that's cool. Yeah. Number two, you eat a million. Us people like, \"Do you need help feeling like a giant?\" Like you're already there. Sure. But I want to eat as many pancakes. Here we go. Got this guy right here. Starting to hurt this guy, lurch. Are these weird ice things? I understand. Oh my God. Oh my God. That's a person. Two giants. I thought that was like a rock. Okay, here's what I'm gonna show you, my neighbor. Yeah, I'm gonna shoot one of them. Okay. The second movement I do is probably jump on one of these ass, yeah. Then slide. Maybe I can make it fly to jump on another one. Here's I'm gonna run you through what I'm thinking. I run over is Mario knocking the hip, right?",
            "start": 1665.52
        },
        {
            "text": "I do is probably jump on one of these, ask you, then slide. Maybe I can make it fly to jump on another one. Here's what I'm gonna run you through, what I'm thinking: I run over as Mario, knocking the hip, right? That brings down halfway. Then I shoot them with my little foe, but I won't be able to get back in cover. Oh yeah, I will. I'm gonna hit him. Well, watch this. They click, cut you, quick. And I'm gonna do this. Perfect. Thank you. And Mario, make me do it. Mario, he's like, \"What just happened? Who ate me?\" Oh my god, guys, that's good. That's good to live. And now, all right, I'm leaving here a sight, you think? Yeah, sure. Site covers all this. That's pretty cool. Yeah, Mr. Get Chest up there. It is really, really. Yeah, I like this little chair. I don't like, do not share cover. That is correct. So I have kind of taken your team and said, \"If you do, yeah.\" Now what you could do is just run and hide behind my Luigi Rabbid. You all come over again, a natural column. So you want to be, be crazy, moderately. Well, I'm taking away on you jump.",
            "start": 1713.66
        },
        {
            "text": "said, \"If you do, yeah.\" Now what you could do is just run and hide behind my Luigi Rabbid. You all come over again, a natural column. So you want to be, be crazy, moderately. Well, I'm taking away on you. Jump up close. How far would that get you? You can jump off Mario or meet you. Oh, that can put you into cover. That's why they put the jump. He's always talking about how he's got hops. I think this weekend, oh man. Yeah, I wanted to use it over this guy and mattress. Oh, that was silly. Now where are you going to get? We're gonna put this guy. Oh, you tell me this. You double jump. Are you trying to do now in the open? But dude, I don't think I have much. But you got bodies in front of you. You got King Luigi up there ready to shoot anything that moves. Yes. Oh no, that was so dumb. I wanted to use my shotgun and now I can't use it without murdering. Put on your little shield, this shield. Yeah, but again, I should have been in front of Luigi. I better utilize that shield. Well, I mean, this is why we, we know, is why we play our",
            "start": 1774.11
        },
        {
            "text": "use it without murdering. Put on your little shield, this shield. Yeah, but again, I should have been in front of Luigi. I better utilize that shield. Well, I mean, this is why we, we know, is why we play our enemy. Yeah, we play, learn, play to learn. All right, now switch the enemy. Yeah, let's do these. Look, do these cowards, come. They got two guys in like heavy weaponry and like a sure, I'm sure last. But we have a whole thing up. Okay, they're shooting in the back of head. Works really well right away. And well, any other side door. Oh no, they're bombs. Oh no, there it is, crinkling. Ah, English. Ooh, and here comes Big Mark. Yeah, that is why they are lovers. I don't know, I think they're brothers. And you just, you put that guy in the worst position. You know what I just saw myself in? I just play the game away. Zero plays. I thought it meant to be played. I'll play it all. A man, this all, this all happened in Kinda Funny, guys. You're the best situation we're gonna happen. Okay, bodyguard shields, or I wouldn't do it. Now keep check, you.",
            "start": 1847.36
        },
        {
            "text": "it meant to be played. I'll play it all. A man, this all, this all happened in Kinda Funny, guys. You're the best situation we're gonna happen. Okay, bodyguard shields, or I wouldn't do it. Now keep check, you can lose your. Well, I want to see if I want to own a jump, Mario, off this onto him. Thank you. Okay, do it. If I kill him, but I can shoot him. Yeah. Oh, you keep going. We're shy, hovered. Fall back to here, I would say. Right? I'm gonna fall there, shoot him. He'll, he'll turn around. No, no, no, he was okay. Got it. You'll shoot an enemy. Now you're finding coverage to the neck down. I am. What was that noise? And yeah, you're goddamn right. You hold your hands up. I pointed out him to get rations. He doesn't give him something to go. All right, I'm gonna do that up. Let me get you out of here. Wait, are always dying? No, no. Can you do damage to them over there? Once you're gone, we argue against to come watch. It'll look, you should shut up and go percent there. All right, your call. I probably would have had a better shot either way.",
            "start": 1910.06
        },
        {
            "text": "do damage to them over there. Once you're gone, we argue against to come watch. It'll look, you should shut up and go percent there. All right, your call. I probably would have had a better shot either way. That much weapons. That's what I was. How do we do it? Yeah, wait to see this bad boy hit it earlier. I think that's when I start. I said he'll say, \"Oh my.\" I said something very, very cool. Everybody helps like, \"Man, Greg, man.\" Yeah, here you go. Hold your Courtney. Get up. We showed you guys what you're made of. I can't move. I'm glued down. Journey go. No, you're not moving your yoga. Yeah, no, no, that's look good. Who use some drawing opponent? I can't use Augusta, Georgia. We should be giving. See what you get. Who you become with the goggles. We were so worried about the bodyguard. Yes, yes. I have to sit on it and they won't. So no, come on, do it anymore. I'm having trouble control. Why aren't you able to get it over there? Right? I want to get it there. Clearly there's, it's gonna pop out. Okay, yo, you see what I'm saying?",
            "start": 1982.86
        },
        {
            "text": "won't. So no, come on, do it anymore. I'm having trouble control. Why aren't you able to get it over there? Right? I want to get it there. Clearly there's, it's gonna pop out. Okay, yo, you see what I'm saying? Right, right over here. Oh yeah, I see your hand. But like, is that the way it's coming to do it? Just chill there, buddy. It's my turn. Look at Mario. Did Spider-Man pose. Oh, he'll kind of muted. No, great, great. Everybody go ask. I don't like this guy. What the hell was any of that? I was clearly his taunt where now he's like, \"Oh, he's in Overwatch here.\" Over what about just pay cluttering up your little Ghostbusters? Look at my ship night. Oh no, easy. There's so many of. Oh, what's 83? So they're back 100 percent. Oh no, not another one of these. Okay, why are they already taking on that? I love it. Did you? We're friends now. We got to be smart about where we. It's not like reefer. Okay, I was doing drugs outside event. Weird. This is a big video game event, right? And over saying it's interesting that at a video game event,",
            "start": 2061.21
        },
        {
            "text": "now we got to be smart about where we. It's not like reefer. Okay, I was doing drugs outside event. Weird. This is a big video game event, right? And over saying it's interesting that at a video game event decided, or there's so many different outlets. I saw not five minutes ago someone from IGN.com get up the room. And now I'm actually right there. And Tim's our friend, right? That's it. Well, we're, we're the games for girls. She's right there. Not on a who's doing the drugs. Do you want me to give you a boost? Your new weapon, to your weapon. Yeah, yeah, yeah. I was actually gonna, it's gonna help around the target others. I hate. Only you reduces. Our enemies want to move here, but everything Overwatch, right? Somebody get hit, but I got to move right there. You might be out of there, right? What about, what about you guys? Hey, don't worry about us. Well, okay, I'm moving up here. I'm big Mario. I could take it. Yeah, look at that. I knew was gonna happen. I said what's gonna happen. Mario's got to try though. Oh, I'm happy.",
            "start": 2154.15
        },
        {
            "text": "guys, hey, don't worry about us. Well, okay, I'm moving up here. I'm big Mario. I could take it. Yeah, look at that. I knew was gonna happen. I said what's gonna happen. Mario's got to try though. Oh, I'm happy. It was only well. This is it. Coward + Rabbid. You know, even shotgun. I don't have a shotgun for less time. Okay, I'm losing traction after a mystic garbage, you know. Oh no, sigh, so far they're fine. There isn't range yet. Now, man, come and do that flip. I'll call on you down, sweetie. A nation turns its lonely eyes when he's like that. Yes, I was hoping that it wasn't going to fully fine. I'm Ranger water my life movement. Another time where for myself or I can use my shotgun without murdering him. Nothing there downrange, my friend. All right, well, that's the end of my turn. At least I'm in coverage. Shut up. Either their duty has got six hours. Oh my god, they got Cactus Man, son of a bitch. My only hope. And Greg, I know. Come on. Yeah, we do the take character. They've had to shoot a B, so it's really their",
            "start": 2228.23
        },
        {
            "text": "up. Either their duty has got six hours. Oh my god, they got Cactus Man, son of a bitch. My only hope. And Greg, I know. Come on. Yeah, we do the take character. They've had to shoot a B, so it's really their animation for going in the gyro mode, whatever. They stop it. Oh, oh my god, oh my god. We got set on fire. Yeah, but like that makes me run all the way back. Yeah, terrible. Oh, how these strategy games work. Yes, leave them alone. Little Rabbid Luigi doesn't eat it. Oh my god. Oh guys, they said it. Yeah, if I say the same thing, it's almost. This is our 10-minute excellent explanation. And then one place you didn't prepare for this is level. Okay, all right, we get it. You're better than me. Oh, think about where he's gonna go. I feel like I got him here. He's gonna die. I could get in here though. It finally, you shot this thing. I don't have a shot. Yeah, do that. I guess he'll before. Yes, sir. Oh no, I don't think they'd actually jump on him so that you at least get one additional kill here. Jump on another one. Yeah, yeah.",
            "start": 2321.78
        },
        {
            "text": "thing. I don't have a shot. Yeah, do that. I guess he'll before. Yes, sir. Oh no, I don't think they'd actually jump on him so that you at least get one additional kill here. Jump on another one. Yeah, yeah. Then go there and the drop. And they drop the hammer on this barrel, baby. Here we go. Today Mario gives his life for the cause. If only all people in the Mushroom Kingdom fight for their cause in their country. Can you murder two of them? And the other. I know the care that his friends, Ernest, might tell me my best shot as I do this. Yeah, I need to get me fly. I love you, John. Your own fault. Okay, I killed the insurance. Make sure it reaches so much. I really appreciate. Now we're gonna make Mario. All right, a Cuban kept our stocks help. There's nothing I can do about the guys over there. They suck. And as far as I can tell, and they're under heavy covered. Smart. That's a good move. But how much shield like it here? 10. Yes, sir. Half cover, the. Yeah, I know. Still again, wrist roll is good. Is there gonna be a",
            "start": 2407.74
        },
        {
            "text": "as I can tell, and they're under heavy covered. Smart. That's a good move. But how much shield like it here? 10. Yes, sir. Half cover, the. Yeah, I know. Still again, wrist roll is good. Is there gonna be a bunch of jerks like you have? I've seen some people the YouTube comments on this Let's Play saying that we're going to bamboo. You know what I mean? Like that we're clearly really good. We're getting bad draws. Now, fuck this guy up, Luigi, sell. Oh my god, did he not see the fact that the gun was aimed down? Oh yeah, I hope they go to kill you. And that's it for me. You do this like hackers, tactics, Jack's over here. I wonder if we could help each other. My view. Hi everybody. Sorry. What's with you know me again? Gotta figure out you're out. Oh my god, I still wanna slap his ass to do more. You see how much like still purrs. Okay. Oh yeah, you're gonna get try to get closer than you can. Rocket launchers be damaging them. Where we go? We'll look how far, how much proper damages you up. Oh, nothing. I mean, I'm not wrong.",
            "start": 2486.59
        },
        {
            "text": "right. But I can't see them. It'll be, I'm like, huge nerds. I go, \"Oh yeah, I think you could get a lot more.\" Yet we still jump off of Mario. Go down, have a way. Don't even get any further. And rocket launch ready to go. Oh, shield guy, she won't get hurt. Guys around you. Oh, I don't have any maha-mantra, sir. I was here specially you to Suplex. Yeah, here I get to do that access to have to jump so far behind. You got to think about. You could do it. They draw them out. No, out of range also. All right, back. How do I go back, please? Yeah, sorry. I'm so paranoid. I gotta hit the right one on here. Yeah, here I respect our special move going in. Correct your big self. It's a kamikaze, but we're not gonna win this one. No, however, I mean, hear me out. All right, is that I need a weapon, an enemy they can hurt me. I need to be",
            "start": 2615.52
        },
        {
            "text": "able to attack, yeah, heavily. He can't do that. Mario, 'cause our Rabbid, Rabbid Mario. Okay, okay. But from here, this management. But they won't be eventually. That's the important thing. Tonight throws it on. Why that's bad. Anyway, guys, that's all goes badly now. Oh, we should sell my vine. They're just gonna. And I'm running back. Yeah, news broke. And they were not. Now they weren't. They weren't. They were, they were in a minute. If they say in it to win, well, now they're coming to our side. Turn it all around right here, right there. Yeah, starts that. Who jump on that guy? Slide out. Line coverage. I'm a vampire. Oh, wrong. Yeah, target selection getting less. Yeah, I need to think more about it because it's just natural. Mikado shoot right there. Yeah, there's a lot of guys in here. Same problem. Targets like Jeff, I",
            "start": 2735.54
        },
        {
            "text": "wanted it. The big guys in the back. We're his Mafia. We know we're feet. We know we're busted. We just want to get food for the people in the Mushroom Kingdom. Unlike the coward Toad who did not come to fight. You left us to fight on ourselves because he's off track and treasure apparently. Where were you when your people needed you, Toad, you draft dodger? Let's go to your mind. Take something historical appliances. Yeah, the game we're talking about. Make fun of Toad Treasure Tracker. Great. That's all I got for you. They already using. Be great. It doesn't matter. We're all fish in a barrel now. There's no even so many of them. World's ending. Give me anxiety. But it also makes me really want to play this. Sure. Yeah, I want to be better at it. I really like the game. I do. We're playing on Switch. They're thinking.",
            "start": 2876.74
        },
        {
            "text": "so many of them. World's ending. Give me anxiety. But it also makes me really want to play this. Sure. Yeah, I want to be better at it. I really like the game. I do. We're playing on Switch. They're thinking. They're plotting. I like it. You see their little eyes. They're late again. Phoebe Rabbid eyes hunkering cover. Way too much plotting on their burden. I feel like I got up in secretly Chinese. Got it. We're gonna thought like, I don't know. You hop on. It's going in there. Hey, no. Oh yeah, I mean, I'm gonna pop out to it. Death. Sure. But I mean, you hop on him after you pop out. You keep his good. Wow. No, in the back. He wants good. Now he's feeling Sir Hampshire. All right, you're dead. There's no, that's just a fact. Yeah, yes, there's that 100 percent sure. I am dead, guys. I became, damn it. You got, you did a little bit of damage. Would you? You vampire it up soon. Are the Rabbid vampires? Oh, I have no idea. I don't know. They're more much. And frankly, I don't want to know. Go for. I think we've covered a lot of things just",
            "start": 2946.85
        },
        {
            "text": "of damage. Would you? You vampire it up soon. Are the Rabbid vampires? Oh, I have no idea. I don't know. They're more much. And frankly, I don't want to know. Go for. I think we've covered a lot of things just with the whole Rabbid having sex with a human. I don't understand where the vampire, the vampirism. You know, the most like disturbing part of that about that is I can't argue that that's not true. Just as far as I know, there's no way to know whether that is in fact the case with. Sure, sure. Your hands on the face. Correct. Where is the best management for you? Pro sniper. We reach, think right here would have to be in there. We go. No shots of any of them. It's 50% shot. Okay, I'm gonna take a shot. Oh wow, this guy's not here. You change. Okay. Oh no, the Big Guy Sector Two. All right, all right, all right. Baby issues there. And we get two of them really good. There it is. Ah, shoot. You're one of the game single-handedly here. We don't do anything, editor. Yeah, okay, Kevin, it's all on you. I worry about",
            "start": 3089.44
        },
        {
            "text": "it. We got this. Where were you, Captain Toad? Your military needs you. Hey, he's got a fractured hand. Yeah. Oh boy. Got him at 30 percent there. Here we go. The take the Rabbid. And if knowing my last day at. No, I'm good. Okay. Now they were gonna throw into the bomb at me. And that was gonna be it. Sure. Coming over here, Janka, a shiny Johnny, afraid. Built up right in there. Oh God, called on the Thunder. Well, now you got it. Only got left. You know, you want to tell me? I mean, no more. He's already coming. I know you want to. If you want to repel him or if you want to attract. What I want? I want to go out like a man. Yeah, I'm going to go out like a man. Get it done. This is where the human Hanniger DNA really shining through. If you want to go like a man, you want to go Rabbid. What's good teamwork there? Duck down.",
            "start": 3174.84
        },
        {
            "text": "Yeah, I'm going to go out like a man. Get it done. This is where the human Hanniger DNA really shining through. If you want to go like a man, you want to go Rabbid. What's good teamwork there? Duck down. And didn't get shot. Big Boy Greg. Wait. All right, please. Mario, die together. Yeah, I do. I did like a lot. Ladies, gentlemen, that's Mario + Rabbids Kingdom Battle coming out August 29th on Switch. We're going to be playing it. Try to avenge ourselves here. Okay, I'm not even for sure. Sure you like that. Like the video. Share with your friends and all that jazz. And of course, subscribe. Keep coming back. We got some Patreon. So you know, we're so sure. There's also a car you can buy. It's Kevin's, even. We're selling your truck. Am I gonna get a new one? Nope. Yeah, I had a bike. It's fine. Until next time, I push to serve you silver dollar pancakes.",
            "start": 3265.85
        }
    ]
}