{
    "id": 2911,
    "video_id": "MHKwIUgp-II",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Danny O'Dwyer"
    ],
    "title": "Amazon Prime's Gaming Deal Changes - Kinda Funny Games Daily 08.16.17",
    "description": "Danny returns to the show and bring news of Amazon Prime shortening its 20 percent off offer.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1502918926,
    "duration": 3618,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to Kinda Funny Games Daily for Wednesday, August 16th, 2017. I'm one of your host, Greg Miller, alongside, oh my God, he lives, the Irish Cream. They don't know, ended you. I had to go back to Europe to check in on, hold, keep making sure everything's in the glory over there. Yeah, how long has it been since I was? I know, yeah. Geez, three me. I was a holy ****. We were filming for two weeks. Wow, wow. Longest God of War Philosophy puckered. Yeah, **** long two weeks, but it was, it was good stuff. You want everyone with your stuff, right? Yeah, I went to Warsaw, filmed The Witcher stuff. We did, we were filming for eight days there. Yeah, we did, we did one on GOG while we were there as well. Yeah, and then we also shot something in, actually, I hadn't actually said this public, I might as well, doing our Patreon source, if our Patrons know about it. Okay, we went to Knoxville, Tennessee, to record a special documentary on a, on a crew from Grand Theft Auto Online. That's off. I can't wait to. It was ridiculous. Now, so now",
            "start": 3.23
        },
        {
            "text": "if our Patrons know about it. Okay, we went to Knoxville, Tennessee, to record a special documentary on a, on a crew from Grand Theft Auto Online. That's off. I can't wait to. It was ridiculous. Now, so now is your life just editing hell for? I feel like for like three months. Yeah, like we've such a backlog. I've put up a NoClip session today. Like I'm just sitting on a bunch of like footage that we need to make cool stuff out of. Yeah, yeah. Apart from PAX West, I'm hosting, we're doing a big Witcher 3 panel of bang hosting partners, basically just at home editing, probably follow. I'm over here. Come here, court again with you guys. Irish Cream back in the business. What do you got to say? I've even know a gentleman. This is Kinda Funny Games Daily each and every weekday on a variety of platforms. We get nerdy with the video game news you need to know about. We go through the stories, give our opinions, answer your questions, read your bad PSN names, and so much more. Remember, you get the show live as we record it on",
            "start": 48.3
        },
        {
            "text": "the video game news you need to know about. We go through the stories, give our opinions, answer your questions, read your bad PSN names, and so much more. Remember, you get the show live as we record it on Twitch.tv/KindaFunnyGames. If you want to talk to us, though, too bad, we don't look at the chat. We want to polish podcasts. However, you can go to KindaFunny.com/You'reWrong. Tell us what we screwed up as we screw it up, so at the end of the show, we can read it all here, set the record straight. If you want to listen later, you can go to YouTube.com/KindaFunnyGames or podcast services around the globe. No matter where you get it, thank you for getting it. Remember, it'd be great if you could subscribe, like, share it with your friends too. It helps us out. And also remember, KindaFunny.com/store. Right now, there is a sale with a select only 40% off already, and the extremely limited Kevin Coello bachelor party shirt. I knock off public, sir. If you're a morning show",
            "start": 89.82
        },
        {
            "text": "KindaFunny.com/store. Right now, there is a sale with a select only 40% off already, and the extremely limited Kevin Coello bachelor party shirt. I knock off public, sir. If you're a morning show person who listened or watched it already there, you know that if the one review at the bottom that has something a 100, like it's got 300 thumbs up right now. Yeah, we get to 4,000, we're giving away Burnie Burns's Tesla. Now, my sister, I know, in an associated, yeah. Now, let's begin the show with what is and forever will be the Roper Report. Did I lose? There are six items on the Roper Report. A baker's dozen. Kevin's back at it. That's like you, it's a half dozen. Shut up. There's always a baker's dozen. That's a diamond cut of it. I mean, I 613, why aren't you still hungover from special day? Why is you still functioning? That we didn't party hard enough. Number one, Amazon Prime has changed its games deal. It now, because you remember this, you know what, y'all let BeachedWhale_1 describe it to you. A",
            "start": 125.82
        },
        {
            "text": "that we didn't party hard enough. Number one, Amazon Prime has changed its games deal. It now, because you remember this, you know what, y'all let BeachedWhale_1 describe it to you. A BeachedWhale, exactly. He or she wrote in the KindaFunny.com/KFG D, just like you came to be part of the show, and says, 'Greetings, Kinda Funny crew. Wario64 just tweeted and Gaff thread started regarding Amazon only applying the 20% discount on pre-ordered games, removing the two-week window after release from eligibility.' So if you hadn't been following before, you're an Amazon Prime person right now, or you're buying on Amazon, you go over there, you get to use Amazon Prime discount, 20% off the game pre-ordering it or two weeks after its release. Now, the phrasing is strictly, 'Offer valid on physical video games during pre-order when shipped and sold by Amazon,' meaning that no more this two week after the fact, right? I go back to BeachedWhale_1, who it turns out, name is Patrick. Now, here's the",
            "start": 179.22
        },
        {
            "text": "video games during pre-order when shipped and sold by Amazon, meaning that no more this two week after the fact, right? I go back to BeachedWhale_1, who it turns out, name is Patrick. Now, here's the funny thing, off, they're out there. I don't mind reading, you know, BeachedWhale_1, maybe that's your Twitter name, is your handle of some kind. When I ask your name, you could just put Patrick in that feed, right? You don't have to put your username. My an Irish name. But, oh my ****, baby, as Colin would always say, 'Don't pre-order.' I took advantage of this many times, but this change sucks for those on a tight budget or waiting for the review. How do you see this change playing out for the future of the gaming marketplace? And Amazon is a game retailer. Keep up the solid work, Patrick. Yeah, it's super unfortunate. Yeah, like the only reason I can see, so what are the big reasons pre-order existed in retail forever was because of fulfillment, chef, is because like trying to get in the right amount",
            "start": 230.37
        },
        {
            "text": "super unfortunate. Yeah, like the only reason I can see, so what are the big reasons pre-order existed in retail forever was because of fulfillment, chef, is because like trying to get in the right amount of stock, trying to gauge you, because the problem with retail is you, you end up ordering things in, you're sitting on dead stock, you've to send it back. And remember those days, I'm sure growing up, where we go to go get an N64 game and they'll be like, 'Oh, sorry, what, we only got two copies of it.' Missile the whole team. And there are some games are like that, they'll always try and top ash, but there's lots of stuff where that's not necessarily the case. Yeah, and so, so that was sort of the original idea of pre-order. Obviously, there's like lots of other reasons, mid-modern age. Yeah, now, yeah, I think most notably was some, something I gave Andrea credit for. I think while you were gone, I've, I had never thought it, and she brought it up on a show of like, 'Well, you know, pre-orders, you can say don't pre-order.'",
            "start": 269.98
        },
        {
            "text": "was some, something I gave Andrea credit for. I think while you were gone, I've, I had never thought it, and she brought it up on a show of like, 'Well, you know, pre-orders, you can say don't pre-order.' That's fine. But then you can't be as upset when, you know, on launch day servers fail, because the creators are used to an extent to gauge. And I was like, 'That's the interesting one. I never knew about that.' And then like a week later, 5:13 said like, 'This giant games business, like based on our pre-orders and our beta, we thought we had enough, and we clearly didn't.' But as people were there, I was like, 'Oh, that's really fascinating. Like that's a real thing that is.' And it's interesting for a company like Amazon, which is their livery of fulfillment company, like a logistics company. That's the, I always thought it was a really good idea that they had the two weeks on the other end of it, because it didn't really matter to them necessarily to have the pipelines they're supplying it. So actually lots of other people",
            "start": 307.51
        },
        {
            "text": "a really good idea that they had the two weeks on the other end of it, because it didn't really matter to them necessarily to have the pipelines they're supplying it. So actually lots of other people as well. Yeah, they supply to two different retails too. And so like, purely they're revoking this, like it comes across as like super shitty. Yes, it's because it was a really good pro-consumer and deal to allow people to, you know, buy games without the like the pre-order incentive stuff is always feels like a trick, like they're trying to trick people to, to buy a game. That's why we should portuguese. Yes, thank all the incentivize stuff. This is literally now turned into an incentive. I never thought of it before is a pre-order incentive. I thought it was like, 'Oh, some people just like to pre-order, so they also get to disc day one on the day,' right? So it makes sense, right? I pre-order. I don't pre-order many games data that often, but there are certain games that I'm free, I'm banked in, that I know I'm going",
            "start": 343.21
        },
        {
            "text": "get to disc day one on the day, right? So it makes sense, right? I pre-order. I don't pre-order many games data that often, but there are certain games that I'm free, I'm banked in, that I know I'm going to love. Christ, yeah. And that makes sense to be able to do that. Amazon, I pre-order books, I pre-order every pair of comics, no problem. Yeah, so it just felt like it was normal part of their marketplace. Now comes across as some like, it doesn't come across to the benefit anymore. Exactly. I'm trying benefit. Yeah, which I think is really unfortunate. The, you know, the big thing about what do I say and what do I think this is going to do to the future gaming marketplace in Amazon, all their gaming retailer. I think the big thing about this is this is Amazon. Amazon is a company of stats and spreadsheets and tables. Yeah, their paperwork is showing that either not enough people use the two weeks after the fact, or they're just outpacing Best Buy's Gamer Club at such a exciting clip, they don't need to worry about",
            "start": 384.91
        },
        {
            "text": "yeah, their paperwork is showing that either not enough people use the two weeks after the fact, or they're just outpacing Best Buy's Gamer Club at such a exciting clip, they don't need to worry about this, right? Because that was the overwhelming on gap when I was reading the thread on this. So many people were like, 'Well, I'm just keep going with Best Buy then, because they ended 20% off and they have these crazy discounts and I think you get points.' I'm not even familiar in the Best Buy thing, because the problem is I'm so in bed with Amazon, totally. Where it's like, 'Well, I, I get everything else from Amazon, it's so easy.' I mean, how is, especially now with like the Amazon Echo or whatever, not, I'm ordering video games for Amazon Echo. You know what I mean? In terms of like, Amazon such a part of my life that Best Buy's counter for, I'm not talking to me, Best Buy's counter has always had to be, 'We're going to be so much better than Amazon at this,' but clearly Amazon has the stats on there and that says we're",
            "start": 422.85
        },
        {
            "text": "Best Buy's counter for, I'm not talking to me, Best Buy's counter has always had to be, 'We're going to be so much better than Amazon at this,' but clearly Amazon has the stats on there and that says we're eating their lunch. We don't need to offer this. We need to give up that 20% two weeks after. So much of the online retailers, I mean, this actually exists with stuff like Patreon as well. It's getting people in the door. Yeah, once you're using a system, you're a lot more comfortable. Sure, once you're a Patron of one thing, you're probably gonna be a Patron for a couple of months. Yeah, and the same thing is true of online retailers. Once you've had an experience at one of them, then you feel a little bit more safe doing it. So I wonder if this maybe was always on the cards that they were just trying to like get people to start, you know, purchasing games through the system. I wonder if it's a lot to do with them also trying to fight back on the digital side, like me, because people using computers to buy",
            "start": 462.69
        },
        {
            "text": "get people to start, you know, purchasing games through the system. I wonder if it's a lot to do with them also trying to fight back on the digital side, like me, because people using computers to buy games digitally. Maybe, maybe that's a way of them getting it in that way and undercutting digital sales, which is an interesting thing for retail to try and do. So I wonder now that they've done that, that I just don't need to bother anymore. That's the thing. It's like, and that's why I'm like a little bit skeptical of all like the sort of Amazon Prime, Twitch Prime stuff, is that like, as much as I love, I love Twitch and I love the community on there. And but I was always a little bit like, when they got bored of Amazon, like, 'Okay, or eventually the wheels of commerce are going to turn this into something that maybe isn't as cool as it might have been stayed independent.' Yeah, and and this is just a reminder again today, Amazon is interested in Amazon first and gamer second. So yeah, it was funny, you know,",
            "start": 496.81
        },
        {
            "text": "that maybe isn't as cool as it might have been stayed independent. Yeah, and and this is just a reminder again today, Amazon is interested in Amazon first and gamer second. So yeah, it was funny, you know, Patrick and his thing called out at Colin would say, and I think is Colin and Kinda Funny and me and everybody else always said, right, 'Vote with your wallet.' It's kind of thing. Yeah, this is a huge turnoff to you, then start using Best Buy and let Amazon know you're using Best Buy because of this decision. And because that's what Best Buy wants and it's what Amazon clearly isn't afraid of, right? In terms of like, if that was even in the gap threat, so many people were like, 'Oh, this sucks.' Well, but I have that Amazon credit card and I'll do this and do that. And then people like, 'All the Best Buy's,' like, 'Yeah, but Best Buy doesn't sell toilet paper.' Like, 'I'm getting cash back based on my Amazon purchases already.' Oh, yeah, over no, those cards, I don't name it, but it's like that thing where I have, I have a",
            "start": 532.12
        },
        {
            "text": "yeah, but Best Buy doesn't sell toilet paper. Like, 'I'm getting cash back based on my Amazon purchases already.' Oh, yeah, over no, those cards, I don't name it, but it's like that thing where I have, I have a Virgin America card, right? And it's like, 'Well, with that going away, like, am I gonna switch over to Alaska?' And like, 'Do I want to switch our miles or do I want actually look if I'm coming?' It's all, yeah, of course, why are airline? They gotta happen. Nobody's explained it, right? I just got a renewed card to my foot. You're not a company after this year. Like, what does it mean? And I have the Amazon one on it. It's crazy. I looked at my bounce. I've like $100 for you or something. I bawled an oak NoClip equipment. Oh, no, all our lights and stuff come out of Amazon. Yeah, capture stuff. So yeah, totally. It's a, yeah, it's, it's like machine learning commerce is like terrified. I feel like a victim in the world of capitalism. Like we've kind of all our, yeah, and obviously they, yeah, they have the metrics just to tell them",
            "start": 568.78
        },
        {
            "text": "it's like machine learning commerce is like terrified. I feel like a victim in the world of capitalism. Like we've kind of all our, yeah, and obviously they, yeah, they have the metrics just to tell them that they don't really need to do that in the message that based on the fact that they expect people, and I'm including myself, but I'm to be lazy, right? I'm like, 'Well, I use Amazon for everything else to **** it, whatever.' And that's a shame, because like video games, you know, in relative terms, they are cheaper than they were before. I'm sure they're still really offensive, guys. It's expensive pastime. And that allowed people at least some sort of, you know, to be able to check reviews beforehand, because they know it. Like we have the, the, we have, we have friends who are in the industry. I feel like we have a better understanding of maybe where a game is more before comes out. Oh, yeah, as well. So it seems super unfair, you know, the people were probably a lot people who use this as a way of like getting an",
            "start": 602.35
        },
        {
            "text": "a better understanding of maybe where a game is more before comes out. Oh, yeah, as well. So it seems super unfair, you know, the people were probably a lot people who use this as a way of like getting an extra game every month. The never we won't be able to. Yeah, shame. Let us know, Kinda Funny on plus KFG D. Number two on the Roper Report, we talked about the Pokemon Go Fest being such a disaster. Sure, do I want to call this GameSpot story and read some of it? Japan's Pokemon Go, okay, works flawlessly. I guess I'll report the event, which took place over the course seven days last week in Yokohama, or Yokohama, attracted over two million attendees who would go on to catch over 10 million Pokemon. Niantic co-partner. I know that you went to this one sadly to remember the massive number of players. Niantic said it had, quote, 'All the major Japanese characters are carriers on notice,' and that the carrier is turned out in force to keep the data flowing. Similarly, the developer organized the event to",
            "start": 638.44
        },
        {
            "text": "Niantic said it had, quote, 'All the major Japanese characters are carriers on notice,' and that the carrier is turned out in force to keep the data flowing. Similarly, the developer organized the event to encourage players to continually explore. Niantic says it carefully distributed rare Pokemon such as Unown, you know, can see Larvitar and Shiny Pikachu throughout the entire area, giving attendees an incentive to move through the greater festival area rather than staying in a single location. The event culminated in a battle with the game's newest legendary Pokemon, Mewtwo. Niantic says this encounter was tightly scripted to ensure it ran smoothly. The developer undertook special worked in order to segment the servers for this finale raid to enable the best play experience. As a result, the developer was able to avoid the problems that mere me read, oh yeah, me or Pokemon Go Fest, Chicago. Thank you. And players successfully defeated the legendary Psychic Pokemon and unlocked him and",
            "start": 681.82
        },
        {
            "text": "the developer was able to avoid the problems that mere me read, oh yeah, me or Pokemon Go Fest, Chicago. Thank you. And players successfully defeated the legendary Psychic Pokemon and unlocked him and exclusive raid battles in the near future. Wow. So just a nice change of pace in terms of like, okay, right. I don't want it just me like we should on the events when they go wrong and then never talk about them going right. They nailed in Japan. It's fancy. They listen. It's good to see. They thought about it. And yeah, learn from their mistakes. Cool. Did a week long. I wonder if that helps spread it out. I love how we were talking about Pokemon and data in the same way we talked about like portaloos, like porta-potties. Yeah, and to have a certain amount keep that data flowing. Exactly. I mean, and yeah, it's funny like everyone was waiting to write up the second story about how much of a catastrophe was. Yeah, so it's really cool that they managed to figure that sometimes you need to have like that failure to",
            "start": 725.65
        },
        {
            "text": "try and convince business partners, 'Hey, they need to put the extra.' Exactly. Well, you can't just say, 'Doe carrier,' like, 'Hey, there's gonna be a strain on your service.' 'Okay, we don't that means or not how that looks.' Bryce, you show Chicago, you like, 'Okay, we know we get it.' Yeah, who do you call off at the company to be like, 'Yo, or this Pokemon thing's going on?' And what's interesting to me, I guess, is like in Japan, I would expect this. In Japan, Japan, I would expect them to be like, 'Oh, sure, we understand what Pokemon is. We understand how big of a do is lie to be.' I wonder the next they throw a big event in the States if it hard to make AT&T and Verizon really, 'Hey, like look at the numbers and look at this and look at this Pokemon Go thing,' or other smack. Well, I don't, I mean, I'm totally being biased and brought",
            "start": 765.13
        },
        {
            "text": "if it hard to make AT&T and Verizon really, 'Hey, like look at the numbers and look at this and look at this Pokemon Go thing,' or other smack. Well, I don't, I mean, I'm totally being biased and brought painting with a broad brush. I know they have stats to back it up, but they had the stats going into this and why they not have that ****. And Japan is like, Japan's mobile infrastructure from the brief amount of time I spent in Tokyo is like super solid. Like that kind of on top of that. I know in a way, no, sure, their culture built for gaming attack, which is amazing. And totally. So like, I wonder if they're predisposed to being good at that. It'll be interesting to see whenever they do a big one in Europe, what that'll look like, because I feel like the network infrastructure over there is kind of weird and edgy. And there's lots of like, does European companies, in English companies, in Irish companies, all these different ones that sort of, um, I would say that they probably have problems over there as",
            "start": 802.72
        },
        {
            "text": "and edgy. And there's lots of like, does European companies, in English companies, in Irish companies, all these different ones that sort of, um, I would say that they probably have problems over there as well. But yeah, I'd love to know if the amount of like the density of people there, because the Chicago thing was like one day, yeah, in a big part. Yeah, they're spreading this thing out both in terms of they said geography, they had actual people going to different parts, and also spreading it out in terms of time. I wonder if that also helped a lot. And you know, that maybe that's a lot more fun for people as well to have an event that's running over a longer period of time that they can come and go as they please. Yes, to get in there right now, get them right. There's an expectation when you have to like a bang. I mean, 4,000 people turn up in a field or wherever many it is. Yeah, like for them, Colonel Butterfield, but they look at their phones. Yeah, it doesn't have the pizzazz of like a concert or",
            "start": 842.53
        },
        {
            "text": "a bang. I mean, 4,000 people turn up in a field or wherever many it is. Yeah, like for them, Colonel Butterfield, but they look at their phones. Yeah, it doesn't have the pizzazz of like a concert or a sports event. So maybe having like an event that lasts that long works better for them as well. It's cool. I love that they're putting effort into this. Yes, I wanted to keep going with it. Yeah, number three, Danny, three. Are you excited for some Recore news? Am I? I don't know if anybody is, but Recore still a thing. Apparently, over on Twitter, Recore, the official Recore account said, 'Hey, Recore players, come back to our channels on August 20th. Here what's next. Recore. Thanks. I'm sorry. Thank you for waiting and see you then.' GameSpot points out that this, the time of the August 20th, times out with Microsoft Gamescom conference, and that there's been rumors of a definitive edition of Recore. Right. Okay, sure. I mean, did you play Recore, ladies and gentlemen? KindaFunny.com/KFG D. Let me know if you've been",
            "start": 879.37
        },
        {
            "text": "conference and that there's been rumors of a definitive edition of Recore. Right. Okay, sure. I mean, did you play Recore, ladies and gentlemen? KindaFunny.com/KFG D. Let me know if you've been waiting with bated breath for tomorrow's show for more Recore. It's, yeah, it's, it's a game that came and went like so many of those sort of like double-A games. Yeah, and that's that we're getting there. We've been sit for, oh man, where the middle go, right? I missed those middles. And there's been successful middle games, right? And then it's like, 'Oh, yeah, Recore did the thing.' And then like, Agents of Mayhem's either one of the worst games of the year on a Batcave the air, depending on who you look at it. The Metacritic Hellblade is similarly yet like Hellblade. No, Hellblade went **** super-positive, hasn't it? It's a, I maybe it's, maybe it's just an iconic. No, it's just an for sure. Yeah, I said a couple of hours not enjoyed as. Oh, yeah, yeah. It's, it's weird. I when I saw this originally, I thought, 'Oh, they're going to'",
            "start": 920.11
        },
        {
            "text": "a I maybe it's, maybe it's just an iconic. No, it's just an for sure. Yeah, I said a couple of hours not enjoyed as. Oh, yeah, yeah. It's, it's weird. I when I saw this originally, I thought, 'Oh, they're going to do a sequel or something.' And I actually kind of be interested in seeing concept take another swing at it. Yeah, because there's some really good ideas in there. Yeah, you know, the was interesting stuff. I think it felt Recore kind of felt like a game that was like the first third of it was designed really well. And then the last two thirds they sort of did you play other without being pasted it? No, I played like a decent amount. But then I will generally, I brought Schumaker. I talked to about a little bit about another stuff. Yeah, it seemed like they sort of them, yeah, filled in the rest of the games. There were so that often happens with games where the second time around they could sort of like take all worked in and maybe do more of that or maybe take a bit more time that they would have spent",
            "start": 958.32
        },
        {
            "text": "there were so that often happens with games where the second time around they could sort of like take all worked in and maybe do more of that or maybe take a bit more time that they would have spent originally on engine development and stuff like that actually do content yeah so I kind of interested in them doing a three core to a definitive edition I don't like what's the same wonderfully I don't know I don't I didn't feel like who do we leave that an open note was there a lot of recorded DLC I don't remember I mean I'm totally possible this is the first time I've heard anyone's already been to got a lot yes yes alright that's the yeah it's not like you know a lot of other games that are hankering for for Game of the Year share, sure Danny, the fourth story on the run of four stories, seemingly the daily update on PUBG. Um, there's gonna be you guys are in there right when I left you wait oh yeah though they were just playing SMD playing yeah anything I played yeah I enjoy you're saying",
            "start": 996.69
        },
        {
            "text": "the daily update on PUBG. Um, there's gonna be you guys are in there right when I left you wait oh yeah though they were just playing SMD playing yeah anything I played yeah I enjoy you're saying I'm a guest today yeah Meg was here for the show. I would love to come over. I should we do for free? I gotta get him you know you got to do you got a Chicken Dinner. Ah, there's going to be a Gamescom PUBG panel. The official description reads, it's a little title is my journey from modder to creative director of PlayerUnknown's Battlegrounds. Brendan Greene is creative director of one of the world's most popular PC games right now, PlayerUnknown's Battlegrounds, by an Irishman, a fighting Irishman, by Bluehole PUBG. While still in Early Access, has already sold nearly seven million copies. It is on its way to becoming a phenomenon on Twitch as well as Steam. Is among the top three most played games. This panel will happen in German time, Wednesday, August 23rd at 1 p.m. Interesting, another Gamescom thing I",
            "start": 1035.63
        },
        {
            "text": "way to becoming a phenomenon on Twitch as well as Steam. Is among the top three most played games. This panel will happen in German time, Wednesday, August 23rd at 1 p.m. Interesting, another Gamescom thing I caught. SteamSpy.com is pointing out that it's now more than 7 million copies now sold and yesterday's peak concurrent was more than six hundred and seventeen thousand players in **** saying it can't be stopped. Yeah, it's incredible. When did you take a gaming laptop with you or you jonesing the whole time? What did you jonesing the literally the first game I played? Okay, yeah, just was with PUBG and I played a bunch like I think every day since I got back up played some games. Yes, it's it's incredible. I'm they added a bunch of extra stuff. The mantling is coming soon. They added like weird eSports spray tags from like like of eSports team okay to the world which has kind of been a bit divisive. Should it's like crazy that like they add sprays to a game and people are talking about it like",
            "start": 1074.19
        },
        {
            "text": "as spray tags from like like of eSports team okay to the world which has kind of been a bit divisive. Should it's like crazy that like they add sprays to a game and people are talking about it like everything about this is you said sprays and Cool Greg, you're a speed freak, right, Greggy? Oh, I'd love to. I mean, my dream would be talk to Brendan once, twice about doing something with NoClip on PUBG. I'd love to do something on it. I think it's a fascinating story, the whole like him modding a previous game and coming over to PUBG. Is it I bet H1Z1, but it's not. It was there was it was a I'm King of the Kill. Yeah, right. That's what was here. Like it that stuff is amazing. It's it'll be interesting here where it goes from here. Like it feels to me like what I loved about Counter-Strike, a lot of love about this game is a like can I get like three maps? Yeah, like a that does just to something like Aztec, Office, obviously. And I was it this game just needs that. It needs like two or three really good",
            "start": 1118.68
        },
        {
            "text": "about this game is a like can I get like three maps? Yeah, like a that does just to something like Aztec, Office, obviously. And I was it this game just needs that. It needs like two or three really good maps and leave it at that. And they were working on the other sort of the it looks like the desert sort of I think it might be Mexico, okay, a map which looks super rad. I can't wait see that. But that's that's what I think this game is going to be is just like those small little incremental changes that make it an absolute classic. Hold for one second. It's a sale time. Still talk about PUBG, of course, man. And he's Irish. What can I say? Ciri Canola wrote in the Kinda Funny / KFGD, just like you can, and says recently Neil Druckmann tweeted out him watching PUBG and suddenly the clouds cleared from above me and I was showered and a light of thought, what if, bear with me, TLOU2 had a PUBG-style multiplayer game modes? I mean, it would kind of make sense with the with the TPS gameplay and scavenging for",
            "start": 1164.13
        },
        {
            "text": "me and I was showered and a light of thought, what if, bear with me, TLOU2 had a PUBG-style multiplayer game modes? I mean, it would kind of make sense with the with the TPS gameplay and scavenging for resources and surviving are already a big part of the first game's multiplayer. And he thought, I really I'd love it. I think that engine would struggle under the scale. Sure, map. Yeah, yeah, no, per se. But that's the thing is like I think even you could bring it down to a smaller group, a bigger map, like right if you open up the areas of it and you took one of the maps from the game or expand it out and had a giant area where you are scavenging and you are doing right and you're building out of you know a base of some kind or somewhere you want maybe you want to hole up with you for I mean arena shooters how it used to be just be called The Last Man Standing. Yeah, like you'd have 10 people and you had one life and then it was like Unreal Tournament had that. Yeah, so yeah, I like I'm totally",
            "start": 1205.41
        },
        {
            "text": "arena shooters how it used to be just be called The Last Man Standing. Yeah, like you'd have 10 people and you had one life and then it was like Unreal Tournament had that. Yeah, so yeah, I like I'm totally into this this like a do, are you? Yeah, we've talked about a get-well man weeks in weeks now. You know Ubisoft on it. Yes, are so honor you. I hope The Division's like **** now. Go make Rainbow Six Siege, not about make Rabbids. Okay, they can make a **** Rabbids XCOM game. It's fun. But we played it, we enjoyed it. Yes, but you missed a lot. You've missed a lot in games since then. Yeah, thankfully not much else in America, just game. Yeah, I know everything. I went to Europe, it was great. I came back and I was like, oh ****, can I go back now? Even how does it keep getting worse? I know. Here's what I'd like to point out, ladies and gentlemen, Kinda Funny as a whole has been phenomenal with Kinda Funny Games Daily. When I did the show, I said I wanted to do a very like serious one. I wanted to be more like PS I Love You XOXO.",
            "start": 1248.82
        },
        {
            "text": "out, ladies and gentlemen, Kinda Funny as a whole has been phenomenal with Kinda Funny Games Daily. When I did the show, I said I wanted to do a very like serious one. I wanted to be more like PS I Love You XOXO. I want to be there and I don't want not too much shouting. We're to have fun, we're gonna do dumb stuff. So this is not a knock at all on anything, Kevin. I am going to ask you to remove your feet from the frame because started in the last story there, you're in your foot bobbing around down there and in the lower corner. So I just wanted it is yeah, let's say I assure you, Joey, don't worry about your nearly fine. Everybody's cool, dropping out that we're not gonna derail the show. Just saying that's not an ottoman. You can't put if anything is an ottoman if you try hard enough. Oh, sure. Yeah, that's like I can't fight biological. Number five, that Final Fantasy XV VR shooter mode is dead. This is via GameSpot as well. You remember this, right? He was already dead 2016. Prompto, oh shoot.",
            "start": 1289.05
        },
        {
            "text": "yeah that's like I can't fight biological. Number five, that Final Fantasy XV VR shooter mode is dead. This is via GameSpot as well. You remember this, right? He was already dead 2016. Prompto. Oh, shoot. 70. I whoa. In a statement issued to GameSpot, Square Enix stated, Final Fantasy XV VR Experience at E3 2016 was a technology demo that we showcased. Since then, we have learned much from the technology and have leveraged our learnings from the Episode Prompto DLC. The result of that is our first PlayStation VR title, Monster of the Deep: Final Fantasy XV. This news follows a report from Siliconera which stated that Square Enix declared the project dead at a recent PlayStation Experience event in Malaysia. VR experience put players in the shoes of Prompto, one of the main party members in Final Fantasy XV. It was revealed at E3 2016 on the trailer above. We don't see a trailer. You're listening or watching us. Prompto was shown",
            "start": 1331.77
        },
        {
            "text": "in the shoes of Prompto, one of the main party members in Final Fantasy XV. It was revealed at E3 2016 on the trailer above. We don't see a trailer. You're listening or watching us. Prompto was shown wearing a PlayStation VR headset along with some brief glimpses at gameplay from the VR mode. It was essentially a light gun style game for providing players with a first-person perspective as they fire Prompto's guns at targets while standing in one spot, though he could freely warp around at different fixed locations. At the time, Square Enix said it had plans released the mode which would be provided to those who own Final Fantasy XV and on PS4 at some time after the main game's launch. What we aren't thinking about marketing as a separate project at all. Final Fantasy XV director, Tabata, told GameSpot at the time, it really is something extra to be enjoyed by the people who purchased the game. And now you're screwed, people who purchased the game. It's dead. I think people to purchase the game will",
            "start": 1378.18
        },
        {
            "text": "at the time it really is something extra to be enjoyed by the people who purchased the game. And now you're screwed, people who purchased the game. It's dead. I think people to purchase the game will not mind. Yeah, sure does. Like there is Alexa Ray Corriea. It was really hold on, ready to do it for sure. I think I do remember conversations Alexa Ray about this and she thought it was hot garbage. Yeah, I'm pretty I'm sure she's the one doing this interview with Tabata. That's I'm pretty sure the timeline still thinks up with her being yeah. And yeah, like there's surely someone somewhere who bought a PlayStation VR and you know you buy they're still getting Final Fantasy XV. Yeah, I guess. Yeah, you know, and you buy you've got one or two games you want to have it on there and then it's like this is sort of like this base you know undercoat coat of like I might play you games. Yeah, it was one of those and no one's really gonna you know it was interesting because it was part of that thing where they were",
            "start": 1419.88
        },
        {
            "text": "like this base you know undercoat coat of like I might play you games. Yeah, it was one of those and no one's really gonna you know it was interesting because it was part of that thing where they were showing like hey, PlayStation VR has big titles, right? It has AAA franchises. And so again, still has it. Yeah, she's not the way he thought it was, but it was always that qualified thing of like it has big titles, but they're like clearly weird spin-off. Sure, like this isn't like Fallout 4, Jeremy. Okay, with old how many people really want that? Yeah, that stuff start hitting. Kinda Final Fantasy XV was such like everyone was especially back then was so worried about how it was going to play. Yeah, but I feel like when they announced that even it did nothing for confidence for the main game. You're like no, just focus on the thing and make the thing good and make sure it doesn't slip again. So I don't feel that any stage there was any like big wave with because E3 was right. So yeah, it kind of",
            "start": 1462.48
        },
        {
            "text": "like no, just focus on the thing and make the thing good and make sure it doesn't slip again. So I don't feel that any stage there was any like big wave with because E3 was right. So yeah, it kind of makes sense. Let it die. Yeah, and the final story on the rope. IGN and WWE 2K18 have announced 47 people for the WWE 2K18 roster. We have them here. Cool Greg, okay, please join me on set. Not yet. Oh, I won't to have you stand here. I'm gonna read some of the big names. I want to see your reaction to it. Alright, have you looked at this yet? No, not haven't. I'm going to read a few. I want your faint, nod, a Cool Greg demand a few words. Okay, I'm going to read a few highlights. I want to see your facial reaction, Danny. You can describe your reaction. Okay, sure. Yeah. And then I want you just to give me your summation. All right. Bray Wyatt. Okay, he's on the roster. He was happy about that one. Ah, Kalisto. Kalisto, new Rey Mysterio, new Rey Mysterio. Basically says Cool Greg, okay, he isn't suspicious",
            "start": 1501.73
        },
        {
            "text": "me your summation. All right. Bray Wyatt. Okay, he's on the roster. He was happy about that one. Ah, Kalisto. Kalisto, new Rey Mysterio, new Rey Mysterio. Basically says Cool Greg, okay, he isn't suspicious about that one. On Eric Young. Eric Young, something he's just he's working in the front office. I don't know who that is or whatever. Yeah, Sheamus, of course, Irish Irish bloke. No, you're not. Oh, Greg. Wow. All right, that's harsh. Lita. Yeah, yeah. All right, everybody, this is wrestling. No, no, they got a whole bunch of people here. Diamond Dallas Page, DDP. Throw it up. Mark Henry. Now we know that Mark Henry in Vegas, but I cannot just to be another guy who must lift weights and just beat the **** different. The actual chocolate comes in many forms. Oh, yeah, it does. Yeah, it does. Not take her. There we go. Okay, cool. Happy with that. Diesel. And then Kevin Nash. I'll get the Diesel version of Kevin Nash and Kevin Nash. Yeah, that's cool. That is cool. Awesome, awesome, ah. And then did Kane",
            "start": 1545.5
        },
        {
            "text": "we go. Okay, cool. Happy with that. Diesel. And then Kevin Nash. I'll get the Diesel version of Kevin Nash and Kevin Nash. Yeah, that's cool. That is cool. Awesome, awesome, ah. And then did Kane win if he's mayor? Now, did he win? Is that over? He was running for mayor. Now, I don't know if he's still there. Can't you with your voted for Kane as mayor? Yeah, I don't vote personally, but I mean, I would have if I worked for that one way. I would go there too or something. But then those are the first 47 people. There's still more to be announced for this guy. I mean, I've read them all first. If you monster-sized, know this yet, you got Lita, man. Why? I'm loving everything else. Well, I mean, you look over the thing. I think the biggest problem, right? No Sasha Banks this or those Sasha Banks where? But she was in last year's. Sure, she's gonna be in it. I thought she's gonna be on the cover. So she's definitely gonna be in it. No guarantees, man. You don't know. They gotta make roster cuts here and there.",
            "start": 1597.32
        },
        {
            "text": "was in last year's. Sure, she's gonna be in it. I thought she's gonna be on the cover. So she's definitely gonna be in it. No guarantees, man. You don't know. They gotta make roster cuts here and there. No, man, she's The Boss. But she's definitely gonna be in it. This is just everyone they have announced to win. We all know a I want to say it personally, IGN video, and then went through an IV. No, not a more getting an a sedated. Say any dates for you. Almost ought to ask Sean about this. Sean, check Facebook. Okay, go to Sean, Fightful.com. I get you get on and go over to IGN and find out when the next one's coming where Sasha Banks is. Also, got anyone? He's still running for mayor. Kane still running for mayor. I'm sorry. Like I watch I've watched wrestling. What a ****. Braun Strowman. He's the new guy. New guy. Yeah, really. But so we just miss stuff when you don't watch everyday. You know, getting in Dane. Killing day. None like that. Hitting and day. I want the Gentleman. What's the Gentleman Jack? Somebody remember the guy from the",
            "start": 1636.02
        },
        {
            "text": "the guy who used the umbrella. Oh, yeah, he's funny. I'm from when we saw him at WrestleMania. I guess an underrated guy. Hell yeah, yeah. I assumed a Cool Greg final question and you up to shouters, give me nods, up, Greggy. Hasn't made up of Hulk Hogan, right? He's still persona non grata. Mmm, that sucks. I would love that Hogan back in the game. You know, he might, but I mean, he's been in a million games. I'm just being greedy. Who isn't in a ten for that reason? Hogan, obviously. Benoit. Is there anyone else who's like Hogan, Benoit? Anybody who's done any porn? So no X-Pac? No Chyna? No. Okay, okay. Those people are bad. Don't go to no arts. Be warned. DLC. Make it happen. WWE 2K18 comes out in October, I believe. But Danny, if I wanted to know what games are out right now, where would I go? You have to",
            "start": 1677.92
        },
        {
            "text": "those people are bad. Don't go to no arts. Be warned. DLC. Make it happen. WWE 2K18 comes out in October, I believe. But Danny, if I wanted to know what games are out right now, where would I go? You have to have it memorized anymore. You're allowed to read. I left I let everybody off the hook. God dammit. I ask too much of everyone here. I ask too much of you. It's the official list of upcoming software across each and every platform. Is this about a Kinda Funny Games Daily show host, each and every week for you, Andrea? Do do do do do do do. See? We added that in officially. Says week does. Yeah, perfect. Today, two Xbox One titles for you. Circuit Breakers, which reminds me I really want a Short Circuit. Lego Dimensions back. And Conan Exiles, which of course, censored here in America. Oh, really? Because of all over in the Europe, you got a genital bouncer. Oh, yeah, you have to worry about it. Is it dick physics over here? No dicks. Is I feel like a Conan game comes out every couple months. They're like homes. It's",
            "start": 1724.64
        },
        {
            "text": "the Europe, you got a genital bouncer. Oh, yeah, you have to worry about it. Is it dick physics over here? No dicks. Is I feel like a Conan game comes out every couple months. They're like homes. It's like pop up. We're going to get to I'm gonna give you new dates here. Okay, there's a game announcement in here. I want to talk about that caught me off guard and we'll talk about. I'm sure many of you astute listeners and readers and viewers know I'm saying. Here's an interesting thing. All right. I always say let's check in with the readers. Yeah, that's what I used to say at IGN. I'll be on. Okay, they were reading exactly. But no one calls me on it here. I always like comments and people being mad at otherwise. He calls readers when nobody does it. Viewers, everything get weird. Everybody just get. Well, then again, there's some guy driving right now. Yeah, one-year-old sleeping in the back of cars. Yeah, exactly. Well, it's just there's too many ways. I don't know. Anyway, new dates, consumers. We have content.",
            "start": 1771.39
        },
        {
            "text": "then again there's some guy driving right now. Yeah, one-year-old sleeping in the back of cars. Yeah, exactly. Well, it's just there's too many ways. I don't know. Anyway, new dates, consumers. We have content. Consumers, new. We Happy Few is officially coming to PlayStation 4 and they got out way in front of this. It's coming April 13, 2018. Wow. Okay. I can't get an Early Access is up for like a good year on Xbox One already, right? Or is it Early Access there to only tell now? I think it's on Xbox One. I think it's alright. If you want to give me a check or you can go to KindaFunny.com/you're wrong. Tell us what you screw up was. We screwed up. Arms. It's using a new character and a new candy-themed arena, but there's no data on that for you. Burly Men at Sea is coming to PlayStation 4 and the PlayStation Vita September 19th and I can't wait. Shooty Fruity is coming to PlayStation VR this year. It's fruits with a whole bunch of your on a shopping Mart. You got guns and stuff. It's a shooter. Will",
            "start": 1806.1
        },
        {
            "text": "recruit but the gun they have like faces on them kind of like Sausage Party. I'm like, don't shoot me a water, knowledge, Fruiter. They could have done that. Yeah. Uh, this is a patch announcement for you. Uncharted: The Lost Legacy's villain and survival mode are coming to Uncharted 4 multiplayer on August 22nd. If you play there, if you're playing the new survival mode or anything Uncharted 4 multiplayer stuff, you can cross play with the people who are using the Uncharted: The Lost Legacy multiplayer stuff as well. And then unless you find out what I was asking you to find out, we have it is officially out on all platforms on the day you said in 2018. Oh, it's it was a it's been an Early Access since July of last year and and there is I believe some sort of game preview version of Xbox or so it's okay. It's",
            "start": 1847.95
        },
        {
            "text": "on the day you said in 2018. Oh, it's it was a it's been an Early Access since July of last year and and there is I believe some sort of game preview version of Xbox or so it's okay. It's Early Access. Okay, interesting. Yeah, they've been added much. I've been playing it since then on and off. Haven't dated about six months. That's one. And then there's a little game that got announced today called Planet of the Apes: Last Frontier. This is ready for it. It is incredibly weird. I'm gonna read it. The question why I wanna I want to give credit to personally running the Kinda Funny Games Daily column / KFGD named Daniel. And then he says pronounced McCrory, McCrory, McCrory. Get that right. Give that right. Rolling. He says, I am McCrory. Yeah, yeah, yeah. Daniel McCrory. No, Danny's an Irish guy sitting right here. I can just tell you know. I'm answering, is there is only someone who is an expert at it? You don't know me. I just didn't expect this. Uh, you wrote in Daniel and your question pertains to it. It caught",
            "start": 1889.8
        },
        {
            "text": "here I can just tell you know. I'm answering, is there only someone who is an expert at it? You don't know me. I just didn't expect this. Uh, you wrote in Daniel and your question pertains to it. It caught me off guard because I totally missed this. Yeah, then I went to the research. IGN had the full super reveal. Basically, this is a game, Planet of the Apes: Last Frontier, coming Fall 2017 to PlayStation 4, Xbox One, PC. Come on in like two months, which and I want and Daniel's question, I'll read it in full, but it's basically like hey, like are we get past the point where movie tie-ins are going to be garbage or can we make good games for that, right? So, but sit, don't worry about that because this question framed it. Then I saw then I saw yeah, it's coming out in two months. I was like, all this thing's gonna be a piece of ****. And I watch the trailer and I was like, oh no, trailer's pretty **** good. And then IGN's article, I'm going to pull some quotes from it. Sounds awesome. Debut developer, Imaginati.",
            "start": 1941.1
        },
        {
            "text": "gonna be a piece of ****. And I watch the trailer and I was like, oh no, trailer's pretty **** good. And then IGN's article, I'm going to pull some quotes from it. Sounds awesome. Debut developer, Imaginati, saying Imaginati, not Imagine. It's like Imagine but then ATI at the end of it. Who are enough people who do CGI for the movie, exactly, right? Has revealed Planet of the Apes: Last Frontier, our Last Frontier, sorry, a standalone cinematic adventure game set between the events of 2014's Dawn of the Planet of the Apes in this year's War for the Planet of the Apes. It was released on a PS4, Xbox One, and PC this fall. Set around a year after Dawn, the game centers around a breakaway faction of apes who take refuge in the Rocky Mountains from the ongoing human-ape war, but are forced to descend into human-owned into a human-owned valley as winter draws in and food depletes. Players will take control of both humans and apes, whom because of the game standalone story and cast, can live or die based",
            "start": 1977.04
        },
        {
            "text": "human-owned into a human-owned valley as winter draws in and food depletes. Players will take control of both humans and apes, whom because of the game standalone story and cast, can live or die based on your decisions with multiple endings possible depending on their actions on both sides. Aiming for a movie length runtime, developers estimate between two and three hours, hoping for multiple replays. The players input into the game is entirely choice-based, with no exploration sections or puzzles, nor any direct control over the characters. I literally went from as we missed shitty times like, holy ****, this game sounds awesome. It's there's a slight amount of gameplay, games like games. I got it. It's such a weird way to explain this. I guess it is gameplay. We'd say Telltale Games a gameplay, but the Telltale Games you're walking around in or direct control is no track. You know, it sounds like Hidden Agenda without the Hidden Agenda, right? Whereas like Hidden Agenda, you're playing with",
            "start": 2017.82
        },
        {
            "text": "but the Telltale Games you're walking around in or direct control is Telltale, you know, it sounds like Hidden Agenda without the Hidden Agenda, right? Whereas like Hidden Agenda, you're playing with other people and we trying to manipulate the game. Yeah, this seems like yours can be like, you know what, today I'm going to be the Apes and I'm going to be a dick. I mean, I say, but I'm going to be you nice human. I want to be ever. I think the proof in this one's going to be is how different is the story well as you go through it because like Heavy Rain and all those games, they live and die in the fact that your choices are meaningful. Yeah, if they're not meaningful and it's like it's pretty rote and boring, right? It doesn't really matter and you've no agency. So this is basically like a choose your own adventure movie behind us is what they've made. The graphics on it look really good. Yeah, but it's gonna live or die on the story and how good the choices are, but it's really weird.",
            "start": 2059.25
        },
        {
            "text": "a choose your own adventure movie behind us is what they've made. The graphics on it look really good. Yeah, but it's gonna live or die on the story and how good the choices are, but it's really weird disgusting. Don't stay. Yeah, like after the movie came out. Well, it's so like now I think I'm gonna read Daniel's question. I was wondering that in the discussion, right? So Daniel wrote into KindaFunny.com/KFG D just like you can and says, \"Dear Greg,\" and then a long explanation, Danny, because I didn't say yesterday. I didn't even know Danny showed up today. I'm super excited today. Planet of the Apes: Last Frontier was announced and I think it looks fantastic. Lately, it feels like we are seeing less and less movie tie-in video games, which I feel like is due to two things. Number one, video games cost more to developed than they ever have, making a cash grab nature less appealing. And number two, the general bad rep that movie tie-ins games have. I think this is sad. Sure, most tying games were piles of garbage.",
            "start": 2088.41
        },
        {
            "text": "developed than they ever have, making a cash grab nature less appealing. And number two, the general bad rep that movie tie-ins games have. I think this is sad. Sure, most tying games were piles of garbage, parentheses, such as The Fight Club video game. Geez, I remember that. But occasionally there were great games such as Spider-Man or The Godfather. My question is, do you feel like we'll see a resurgence of tie-in games other than mobile games? And do you think this is a loss for the industry? With regards, Daniel. I don't think it's a loss. The fact that the movie tie-in has gone away, those always made me incredibly angry. My hope would be that more people are taking it like this where the movies come, the game is not ready for primetime, right? Don't rush it. Don't announce it. Don't force it. Planet of the Apes is big enough, it'll do its own thing. Let's treat it with respect. Let's get out in front of it. I love the idea that going through this. I like because I see the trailer and before.",
            "start": 2130.78
        },
        {
            "text": "it. Planet of the Apes is big enough, it'll do its own thing. Let's treat it with respect. Let's get out in front of it. I love the idea that going through this. I like because I see the trailer and before because I saw the trailer before reading about it and I was like, so clearly I'm playing both sides, you're setting up both sides, but is it third-person action-adventure game? I'm running or what? And you get here, it's like, no, it's just this thing. It this is a really fun and different way of like, hey, let's flush out our universe. We have cool stories we could tell here. Give it to these video game guys, have them be totally canon but not canon characters so they can do whatever the fuck they want with and have hopefully awesomely different ending, right? Yeah, I think it's a a lot of it has got through the finances. Making games has gotten more content, has gotten more expensive. The problem with movie tie-in games is the movie tying games have the the unfortunate watermark of having to look as good.",
            "start": 2173.74
        },
        {
            "text": "the finances. Making games has gotten more content, has gotten more expensive. The problem with movie tie-in games is the movie tying games have the the unfortunate watermark of having to look as good as their movie counterparts. Yeah, which inevitably makes them already very expensive. They also have the unfortunate problem of having to be released basically in a very strict time window around the release of the movie. So that you ended up getting was a lot of it works in the PS2 and PS3 area, less so because content wasn't as expensive. But as we get into like crazy high resolution and motive, you know, the amount of motion capture needs and performance capturing, all the shit, it just becomes completely edible. Not to mention like when you handle the property wrong, and I guess this is a really great example of it, right? Like I love Planet of the Apes, right? Oh, I haven't seen the new one either because I was like, it looks too much like the last one, so I'm not super excited seeing theaters, but.",
            "start": 2212.47
        },
        {
            "text": "great example of it, right? Like I love Planet of the Apes, right? Oh, I haven't seen the new one either because I was like, it looks too much like the last one, so I'm not super excited seeing theaters, but like the idea here of like, it's hard to make, hey, Spider-Man 2, we call that as a great movie game. It wasn't, right? Spider-Man 2 was fun, explore the city and have open-world crime and shit. But like this story sucked because they were trying to tie in the movie. You can't say, hey, here's this shit universe and you're not Spider-Man. We're in the Spider-Man universe for you, not Spider-Man. This is where it's like, hey, humans and apes and they're out there doing their own thing. Like, let's make a cool adventure and flesh out a world there and do something cool in the same vein is like what Telltale has done with The Walking Dead, right? So it's like, cool, you're not part of Rick's group, you're Clem and you're doing your own thing. And in the past there was this sort of like, I feel like.",
            "start": 2253.03
        },
        {
            "text": "Telltale has done with The Walking Dead, right? So it's like, cool, you're not part of Rick's group, you're Clem and you're doing your own thing. And in the past there was this sort of like, I feel like the way we consume media was very much like, okay, this is this is the media and then here are the spin-offs, right? Here. Yeah, books, here the games, but they all have this like sort of, you know, they all tie into the main thing quite a lot. Whereas the way that movies are sort of developed now is much more long form. So we have a lot of like memmer and The Lord of the Rings came out in a trilogy. Oh, well, why? The story continues. Yeah, that's basically every movie now. Everything is set up as a franchise, franchise, right? Which means that the life of those franchises exists longer, which means that they create big fan groups and then there isn't this pressure to release games around the individual movies. You can just release games based on that franchise kind of whenever because there are fans for like 10 years.",
            "start": 2289.63
        },
        {
            "text": "groups and then there isn't this pressure to release games around the individual movies. You can just release games based on that franchise kind of whenever because there are fans for like 10 years, right? So that Game of Thrones, Spider-Man's a good example. They're not trying to tie him into Homecoming, right? At the new game. Yeah, you know, Batman's another good example. And that's those games be the game. And that was the thing as a comic book fan born and raised. I played so many shitty movie tie-in game running stuff was like, ah, and when Batman dropped and it was like, holy shit, this is awesome. And it's not trying to tie into The Dark Knight or anything like that. I was like, everyone's going to see this and they're going to do this. And the fact that it took so many people, Marvel, so long to get the rights back. The fact that even DC, like, sure, Batman and Justice, but like, where the fuck are the rest of them? Like, I could have easily done this to them, bunch of different properties. Green Lantern.",
            "start": 2326.35
        },
        {
            "text": "the rights back. The fact that even DC, like, sure, Batman and Justice, but like, where the fuck are the rest of them? Like, I could have easily done this to them, bunch of different properties. Green Lantern. Yeah, and Green Lantern had a fucking shitty time. Maybe like, I thought it was, I thought Batman: The Arkham series, when Arkham Asylum hit out and it got reviews and people loved it, I thought, here we go. And then when Arkham City came, it was like, well, now they can't argue. And that Arkham Knight is like, what the fuck? This game. Where are the rest of the games? Where Weisman at Marvel? Now I talk about all the time. I blow them all the time. Marvel Games and how, wait, you know what they're doing right now? What Mike and Bill are up to? The way they're like, let's get talented studios. Let's make them make awesome things. Yeah, like, guess what? Spider-Man is going to be awesome and it's going to matter regardless of how close it is to Homecoming, right? It probably will benefit from actually having a bit of distance.",
            "start": 2363.46
        },
        {
            "text": "Yeah, like, guess what? Spider-Man is going to be awesome and it's going to matter regardless of how close it is to Homecoming, right? It probably will benefit from actually having a bit of distance. Yes, if you take another recent example of being the what actually pretty good. A Volition's... Mad Max was a Volition? It is not Mad Max. It was the people... there was no, it was Avalanche. It was a like, sorry, did it was a Just Cause? No, Yokes and not saying to our folks... uh, it'll be there. Yeah, like their Mad Max game. It perhaps even given a little bit more breathing room from the movie, I would have made more sense because thematically it was, there were similarities with with the War Boys, but like I was doing its own thing. It was a different version of Max and different lace and all that. So like, yeah, I think we're gone past today of like, tend to having to have like movie tie-ins that are that direct. Like people don't really care. Like in a weird way, it dates them. Yeah, it's like it actually makes it like.",
            "start": 2399.64
        },
        {
            "text": "we're gone past today of like, tend to having to have like movie tie-ins that are that direct. Like people don't really care. Like in a weird way, it dates them. Yeah, it's like it actually makes it like, oh yeah, I'm not in Robin game. You play those games to be like that you're playing the movie, but you're not. And so even before you saw to be the weirdest thing of like, how is this happening? Why is that happened? And there was that weird in between parks where we had games like Enter the Matrix that were like trying to be, okay, we're not really a movie tie-in, we're gonna have our own thing, but actually it's a whole other story that bleeds into the, yeah, do you want to see what Neo was doing before she got to the freeway? Play this video. Yeah, exactly, exactly. That that whole the with the weird complimentary media shift that went on for a while there. Yeah, is in the past. I mean, I always let him to Federal Force. Oh, 1,000% like best thing I think of like, you know, I was I was part of the group.",
            "start": 2437.32
        },
        {
            "text": "complimentary media shift that went on for a while there. Yeah, is in the past. I mean, I always let him to Federal Force. Oh, 1,000% like best thing I think of like, you know, I was I was part of the group here of like, man, Spider-Man 2, what a fun game. I bought it twice. Laughs. I really did love it. No, but it was like the story sucked and all that and it was in the you did the same crimes over and over again. So I mean, when Spider-Man 3 game's coming up, I was like, I was working at IGN. I was gonna review it. I was like, fuck, can't wait. Let's get. I'll never forget. We could I beat it before I went to see the movie. And it was um, the final like when they did a cutscene of how Venom was humiliating Sandman to work with him, right? To go take down Spider-Man. It was Sandman or Venom in front of a tree talking to Sandman. And Sandman is like, I'm not gonna help you. He's like, oh, really? And he made some tree, the Sandman's daughter fall all tangled in his webs. She's like, \"Daddy!\" It's Sandman crippled, drops to his.",
            "start": 2474.82
        },
        {
            "text": "to Sandman. And Sandman is like, \"I'm not gonna help you.\" He's like, \"Oh, really?\" And he made some tree, the Sandman's daughter fall all tangled in his webs. She's like, \"Daddy!\" It's Sandman crippled, drops to his knees. He's like, \"All right, I'll do it.\" And it's like, what? My daughter and I would get a cutscene. I'm like, what the fuck is he has a kid of a tree? And like, time to just say, what the hell are we talking about, right? Elaborate. And then it turned out Spider-Man 3 the movie, not much better. They didn't really have a better idea how to do it either. Danny, yes, sir. I got deals a day for you. Oh, there is an Attack of the Blockbuster Sale on the North American PSN Store right now. It's through August 22nd. You can get games like Guardians of the Galaxy, Saints Row, and XCOM to accept you blockbuster. Oh, yeah, I like XCOM. Ooh, yeah, I feel like plus, sir, what's interesting about a lot of them on there are the 2K games that are also included in the Humble Bundle we talked about yesterday. All right, so I think it was.",
            "start": 2516.67
        },
        {
            "text": "XCOM. Ooh, yeah, I feel like plus, sir, what's interesting about a lot of them on there are the 2K games that are also included in the Humble Bundle we talked about yesterday. All right, so I think it was like, okay, we gotta get that in there too. So yeah, I don't 100% know, but if you looking for some those or just want some of the games cheap, get on him, check him out. Now I want to jump right in here to Jacob Porter's question as part of Reader Mail. Jacob Porter wrote in the KindaFunny.com/KFG D and proves he knows this show better than me when he says, \"Hello, Greg and that Sweet Cream.\" Sure, he said, \"Wait, from the say hello.\" So, \"Hello, hey, what's up?\" On Tuesday's episode, Andrea mentioned that she surprised how much trophies matter to some people. But I looked at a recent popular game, Horizon Zero Dawn, which has 8.3% completion rate. So 8.3 of all the people who have played it and registered the trophies or whatever have gotten Platinum with the total sales of.",
            "start": 2558.77
        },
        {
            "text": "Dawn, which has 8.3% completion rate. So 8.3 of all the people who have played it and registered the trophies or whatever have gotten Platinum with the total sales of Horizon sitting around 3.7 million copies. That equates to about 270,000 people who have the Platinum. Some games only sell that many copies and are deemed a success. My question is this: when will companies take trophy lists seriously and realize that a good trophy list sells games? My name is Mayo taught us that a quote unquote good trophy list can sell the most garbage pile of games to people. So why not even a seven, six to seven out of 10 game? Thanks for all you do. Cheers. We won't beat a dead horse. We talked about this at length yesterday, right? I think, you know, I think for me, when Andrea was like, I understand how why you're so incensed about this Platinum. So I understand why you're so mad about this. And I'm like, for me, as a play, someone in the PlayStation community, it's that last.",
            "start": 2598.07
        },
        {
            "text": "like, I understand how why you're so incensed about this Platinum. So I understand why you're so mad about this. And I'm like, for me, as a play, someone in the PlayStation community, it's that last step of, man, you're just trying to sell us something. You don't know who we are, right? And that's all it is. And it's just like, it's that last cherry on top of the sundae. It's the last thing of like, like Undertale. I was I complimented so much. Have you seen there turbulence? No, it's hilarious. Danny, you got to go look at it because like the first trophy you'll get it for one item is like, I'm pretty, yeah, I'm pretty good at row felis. And then if I get another one, and then finally Sports ones like, I'm out ideas, help me. You know what I mean? Like a narrative. And then I'm like, that's a funny idea that you took seriously. And you didn't Amazon. Yeah, exactly. And so that's all it is. When will developers notice it? I don't think big developers necessarily ever will. I mean, it's the fact of people on their team.",
            "start": 2640.4
        },
        {
            "text": "seriously and you didn't Amazon. Yeah, exactly. And so that's all it is. When will developers notice it? I don't think big developers necessarily ever will. I mean, it's the fact of people on their team speaking on and saying something of that like the fact of having time. It's effective. I just I hate seeing little developers, not Sega obviously, but the people who worked on Sonic Mania. Here's your thing, send back, \"Here are our trophies.\" Okay. And nowhere in there this thing came back and said, \"You don't need a Platinum.\" And they said, \"Oh, I don't need a Platinum.\" They send it back and nobody said Sonic needs a Platinum. Like it's no surprise that Horizon, a like really big first party game for for our second party game, I guess, for so much forever. And it's like, you know, pretty hot stuff. Like I wonder if like there's something that like, you know, there's lots of developer layers on stuff at Sony. I wonder if that's something that they can like just like have maybe a team of one or two people that.",
            "start": 2674.36
        },
        {
            "text": "if like there's something that like, you know, there's lots of developer layers on stuff at Sony. I wonder if that's something that they can like just like have maybe a team of one or two people that help indie developers get this thing. You know, you're saying if not even help them, it's just in the sort of time on the person who passed that list back. Like you have fucking Ashford planning because need a Platinum right off the fucking Hedgehog. But your point of like, you know, Horizon nailing it with a great list. Like Uncharted list sucked up until Uncharted 4. Oh, really? They were just like, you shoot these winning people. These are sort of going, all right, you know what I mean? Play it on crushing. It's like Arkham Knight again. That lends itself to a Platinum really well as well because it's, oh yeah, all of the like go spore go to a toga. It's all super fun. Is all I can't wait for not DLC November. Mmm, yeah, God, I know, right? Yeah, every so often I think about it. MSU Hitman pointed something else out today.",
            "start": 2716.66
        },
        {
            "text": "the like go spore go to a toga. It's all super fun. Is all I can't wait for not DLC November. Mmm, yeah, God, I know, right? Yeah, every so often I think about it. MSU Hitman pointed something else out today. I missed when he wrote in the KindaFunny.com/KFG D and says, \"Hello, everyone. What is the crew's thoughts on Ubisoft making the digital gold editions of their next three big games, South Park, Assassin's Creed Origins, and Far Cry 5, $10 cheaper than their equivalent physical version? Could this be the beginning of an industry trend or is it just a test by Ubisoft?\" What he's saying is because I hadn't heard of this. No, so I went and tried to use the PSN Store on the web portal, which told me that Far Cry 5 didn't exist. And I'm like, why wrong? I put Far Cry 4. Far Cry 4 didn't exist. Then I put in another game and it crashed. And I was like, you go PSN, your shit nailing it on this web portal. Ah, Google around. The boxed edition of the gold one is a hundred bucks. If you were to get the the digital.",
            "start": 2746.66
        },
        {
            "text": "game and it crashed. And I was like, you go PSN, your shit nailing it on this web portal. Ah, Google around. The boxed edition of the gold one is a hundred bucks. If you were to get the the digital version of that, it's 89 bucks. Is well, what's how it's 99 to 89? Yeah, and so it is 10 bucks cheaper. And it is really fascinating that's happening and no one's calling it out, right? I would assume that, yeah, to test. I would assume that I think if you're the kind of player who wants to get a gold edition of one of these games, you probably want the physical media. You want on yourself. Yeah, I'd love to know what the difference is. If there is any difference, obviously the difference because there's no box. But if there's any sort of like, you know, steelbook physical packing, something going on it up, right? Go to Amazon. Tell me what's happening in Assassin's Creed Origins Gold Edition. Jesus. Or Far Cry 5. You want? Yeah, don't you stuff. You don't mind. I gotta take it because here's the thing about the South Park.",
            "start": 2791.04
        },
        {
            "text": "Amazon. Tell me what's happening in Assassin's Creed Origins Gold Edition. Jesus. Or Far Cry 5. You want? Yeah, don't you stuff. You don't mind. I gotta take it because here's the thing about the South Park never coming out. So exactly. I continue to hold the belief I've had since they move the release date, moved it again or ever. Like this game's getting delayed, but we keep getting closer and I refuse to let myself get excited. I write, well, I want this game so bad. And I'm like, I'm not I'm not going to buy in that I'm this year. I'm playing a South Park, a sequel to one of the funniest games I've ever played that's based on superheroes. I refuse to believe until I'm fucked until I have the collectors' steelbook. Steelbook. So again, I got a steelbook. Oh, gosh, old. So this is all DLC stuff. Yadda, yadda, yadda. And a little different weapons. Sorry, this is shitty Wi-Fi. Of course. Sure. Um, yeah, the only difference is that it has a steelbook, but it has a steelbook. Yeah, so I feel like that's probably why the price.",
            "start": 2834.54
        },
        {
            "text": "a little different weapons. Sorry, this is shitty Wi-Fi. Of course. Sure. Um, yeah, the only difference is that it has a steelbook, but it has a steelbook. Yeah, so I feel like that's probably why the price difference is really there, right? It is the fact of like, you can make a case to GameStop in that in that regard, right? Because it's what I always talk about in the way of, well, PlayStation has to store, Xbox has to store. Why not? Why aren't first party games 10 bucks cheaper? You know what I mean? And the reason you do that and you fuck that up, we'd fuck up that brick-and-mortar relationship where a lot of people do buy the systems. And so if you were to say, all right, cool, our digital games are going to be cheaper games. I would say, well, go fuck yourself and put it up here, right? Whereas here you can be like, listen, guys, it's a collector's edition. You know, people going to want that. People who want this gonna want the physical thing. If they in if they don't one, if they're just in it for the thing, we.",
            "start": 2872.79
        },
        {
            "text": "like, listen, guys, it's a collector's edition. You know, people going to want that. People who want this gonna want the physical thing. If they in if they don't one, if they're just in it for the thing, we got to say something because they're not giving the steelbook case. Interestingly, the Assassin's Creed one is actually marketed as Origins Steelbook Gold Edition Steelbook Edition, 10 quid more. I don't know why it's 110 for this two for the physical and a hundred for the the other one. I guess maybe it's more DLC. Wait, hold on. The Far Cry one was 99 and nine. Oh, okay. 1980, not 190. This is 110 and 11. Well, from England. Road to KindaFunny.com/KFG D. Deliver Dave. Yeah, welcome to what is what he says to my greetings, Greg. And I'm guessing Danny, if you never mentioned he was co-host. Hey, you wanted to meet you all had it. My question is for Greg and his love of Friday the 13th. My daughter's second birthday is coming up. So I'm wondering about their Friday the 13th about whether I should skip.",
            "start": 2914.16
        },
        {
            "text": "to meet you all had it. My question is for Greg and his love of Friday the 13th. My daughter's second birthday is coming up. So I'm wondering about their Friday the 13th about whether I should skip the present instead by myself Friday the 13th on PS4. She's two. She won't know and therefore won't hold it against me in the future. It's a I'm in a moral gray area and need help for my best friend's wife. Your partner, you buy it for you. What I mean? Like, here's, oh, the kid won't remember jack shit on the second birthday party. And that's actually the funniest way to do it, right? If you're going to do a little cake and you're gonna have like little given by Friday the 13th, wrap it up, give it to her. She'll tear it open and be excited. And then you stay with this guy. She plays with the box and everything loose. They look exactly enough steelbook. Come on now. You do get a comes out of October 13th. You get exclusive Jason bloody skins. Or no way, I'll get those. I think no, you get them. And it's a counselor for.",
            "start": 2962.73
        },
        {
            "text": "they look exactly enough steelbook. Come on now. You do get a comes out of October 13th. You get exclusive Jason bloody skins. Or no way, I'll get those. I think no, you get them. And it's a counselor for close to. I think doesn't matter. And then Stannis trapper into they're like your little table in front of the tension sofa. She'll love Jason. He's a cute little character. He's had a good one about then watch it is just like read it all there. Yes, teach her from an early age. Here's my thing. Do you think I'm going to try this with my kid? Okay, you think you can just over expose them to it and then have them not be fair at play that kind of crap? That's a dangerous litmus book. I feel. Ah, what's the worst that happens? I feel like I sit him down. I'm like, that's Tim Curry. Like, you know, I show them, right? And I show him another things. I'm like, it's just fake. I knock on the glass. You're gonna mean, are you scared about anything your childhood? Like anything's that? Oh, yeah, or Thriller terrified me. We used to.",
            "start": 3000.56
        },
        {
            "text": "I show him another things I'm like it's just fake I knock on the glass you're gonna mean are you scared about anything your childhood like anything's that oh yeah or Thriller terrified me we used to go to Aunt Bonnie a little Jerome's and bait head Thriller on VHS along with it behind it she's like dozens too good terrified of the zombies and Thriller and then I would be like I would I would like steel white-knuckle it right so really the thing to then get to them behind the scenes learning the dances and like they were there's this a thing that I thought was the craziest thing of like them at craft services all eating but in zombies and it was like just like me really because the eyes to freak me oh yeah oh yeah so we so my answer is no don't do it you don't think so no well if you have kids first you do it first okay well just learn the hi goes well figure I'm saying there it is it aside final question of the day goes to Amazing A Amazing A wrote in and said hey Greg and then he",
            "start": 3037.79
        },
        {
            "text": "kids first you do it first okay well just learn the hi goes well figure I'm saying there it is it aside final question of the day goes to Amazing A Amazing A wrote in and said hey Greg and then he said Kendriya I make again this is ami I did say tomorrow's Tim Friday is Danny forget that I the way my middle name to contemporary or dark uh really Quentin this news broke during the weekend so it's okay if you missed it but have you heard about Sony San Diego's canceled game Nomageddon? Liam Robertson of Unseen64 recently read a video detailing everything it was going to be it even shows lots of footage from gameplay it was supposed to be a free-to-play team-based shooter with gnomes in the style of a MOBA apparently the difficult development of Kill Strain was what ended up killing off Nomageddon ironically since Kill Strain was seen as a failure and had its server shut down earlier this year it was also mentioned that early game testers seem to enjoy Nomageddon more than Kill",
            "start": 3074.84
        },
        {
            "text": "Nomageddon ironically since Kill Strain was seen as a failure and had its server shut down earlier this year it was also mentioned that early game testers seem to enjoy Nomageddon more than Kill Strain. What are your thoughts on this? Do you think Nomageddon would have done better than Kill Strain? Thanks for all you do and keep up the good work, Amazing A. That's already good video, check it out. I only heard about it. I know that Beyond! guys talked about it this past week too. Um, it's interesting because it comes from Sony San Diego being that incubator for that right where it was let's try different things. We're gonna try Guns Up! We're gonna try Kill Strain. We're going to try free-to-play. We're Jaffe, you know, they were helping out. We've got Drawn to Death when Drawn to Death was just going to be a free to play thing and then the writing on the wall started popping up that that was not an initiative of working PlayStation's doing so well and you saw them start pulling back on that.",
            "start": 3119.06
        },
        {
            "text": "going to be a free to play thing and then the writing on the wall started popping up that that was not an initiative of working PlayStation's doing so well and you saw them start pulling back on that. Yeah, um, right off the bat based on the fact that I've already heard about Nomageddon like in our circles, there's everything else. I think a thousand percent that was done better than Kill Strain. Yeah, because who the **** can tell you anything about Kill Strain, right? Yeah, number one, we went down and did a stream with them and which means that I learned about the game and watched previews and played the game and I just up it was kind of a MOBA game like I and there was nothing unique about it. It just looks like another generic MOBA game. But like running around as gnomes, everybody loves gnomes. It sometimes like games like that that require you to sit down and and figure out what they are for ten minutes really needs some sort of hook like Fat Princess wonders like to me stands out like",
            "start": 3155.66
        },
        {
            "text": "it sometimes like games like that that require you to sit down and and figure out what they are for ten minutes really needs some sort of hook like Fat Princess wonders like to me stands out like that's an that's an elegant thematic hook or like a unique thematic hook. Yeah, that gets me in the door. Sharing away the kick, didn't it? It was Nomageddon. It's a similar thing. I look at the gameplay of it. It looked it looked interesting enough as gameplay that I would keep watching a video about it. Not sometimes that's all you need ya to get you in the door. It's one of those I think would have been more successful. I don't know you were to save the free to play initiative, right? MOBA initiative the PlayStation was looking at. I think I think that whole division isn't working on consoles, right? And I was like they, hey, try this for us, Sony San Diego. Okay, it's not working. We're like people, ha, **** that's video games. I'm it. But I love that digital game. We were able to put that thing together because",
            "start": 3191.68
        },
        {
            "text": "like they, hey, try this for us, Sony San Diego. Okay, it's not working. We're like people, ha, **** that's video games. I'm it. But I love that digital game. We were able to put that thing together because like something we never ever really hear about it. Yes, console games. Oh dude, Unseen64 is awesome. Alright, we've talked about them on the shows before, but their content's really really ****. They're top-notch. Check it out. Now it's time to Squad Up. This is where one of you writes into KindaFunny.com/KFG telling me what your name is, what you play, what your username is, and why you need help. Then I read it here. Friends from all over the internet, a friend you on the internet and become your friend in the internet. Internet friends, friends, friends, internet friends, internet from we internet friends, you mean? Yeah, we talked on the internet before we talked in real life. Yeah, that's true. That's true. I think so. Internet friend Kevin from Rockford, Illinois writes in on his Xbox One. His",
            "start": 3229.0
        },
        {
            "text": "friends, you mean? Yeah, we talked on the internet before we talked in real life. Yeah, that's true. That's true. I think so. Internet friend Kevin from Rockford, Illinois writes in on his Xbox One. His Xbox Live username is Quack Attack V. There are spaces between Quack and Attack and Attack and V. Quack Attack V. He says, greetings and salutations to the Kinda Funny Games Daily hosts. See if you say this, you never actually have to know who's hosting the day. Smart. Well, smart. I'd like to toss my name into the hat for a potential Squad Up. Myself and a buddy love to play Friday the 13th on Xbox One. It would love to have some big, beautiful Kinda Funny Best Friends to play with. My gamertag is Quack Attack V. My original my original gamertag from years ago was misspelled as Quack Attack, all one word. What did you mean? Smile. Go. He solid quack chuckle to W. This quack that hat. It's Q.U.A.C.K. Yeah, yeah, huh? Yeah, I would spell that on back. I mean, I know you follow the cues, but quack, I never thought sir.",
            "start": 3271.27
        },
        {
            "text": "what did you mean? Smile. Go. He solid quack chuckle to W. This quack that hat. It's Q.U.A.C.K. Yeah, yeah, huh? Yeah, I would spell that on back. I mean, I know you follow the cues, but quack, I never thought sir. Nobody cares about spelling and usernames. You're good. Looks like the Lord that Phil Spencer doesn't hate us Xbox gamers as much as Shuhei Yoshida hates the damn PlayStation gamers. If any Best Friends want to go to Camp Crystal Lake with us, send me a friend request and let me know you're a Best Friend. To have a fantastic day, Kinda Funny Crew, and remember, no means no. Looking at you, Nick. Nick does Pope Kevin against us well quite a bit. Oh yeah, you only all. But then here's the well, on an upcoming GameOverGreggy show, we all came in and touched Nick's chest because his pecs are out of this world. Oh really? Yeah, if I'm lying on behind twitching, yo, you can torture people. Table do that before they were in great shape, but now they're in awesome shape. Wow. No BJJ, man. Ding. Yes, sir. If people watch us",
            "start": 3319.73
        },
        {
            "text": "oh really? Yeah, if I'm lying on behind twitching, yo, you can torture people. Table do that before they were in great shape, but now they're in awesome shape. Wow. No BJJ, man. Ding. Yes, sir. If people watch us live and we screw things up, they go to KindaFunny.com/You'reWrong. What do we get wrong today? My favorite one so far is Dreamer A referring to something I said on my last show. Wow. Okay. I've been waiting for you to come back, Irish Cream, with this bullet in the chamber. Very chic and correctly saying that I apparently I said Half-Life 1 didn't come to consoles, which is exactly why a PlayStation version which did have a Half-Life 1 multiplayer and elements which sock them something is why you've been off the grid so long hoping you forget. I know. Yeah, The North Remembers calling me out. And we have some other ones which I'm not really sure if the corrections, I'm not sure if the editorializing. Okay, but let's go with them. Let's go or for real like it needs to be known as well some",
            "start": 3366.08
        },
        {
            "text": "out and we have some other ones which I'm not really sure if the corrections, I'm not sure if the editorializing. Okay, but let's go with them. Let's go or for real like it needs to be known as well some countries such as Canada, Amazon Prime discount on video games has changed from 20% to 10%. Ooh, thank you. That's helpful. That's a good one. And that was from Rancid Beast 1118. Jonathan says, you keep pronouncing PlayerUnknown's Battlegrounds as PUBG when it's actually pronounced Pav Bhaji. No, it hubba-hubba go PUBG. We don't call it that. That's not talking very quickly the G. What are you saying? As a me, my buddy call a PUBG. I don't like I'm say Pav Bhaji. I don't like that. Like we've nobody stated. We are all say any different ways, right? **** it shouldn't be. It kind of should just be Pub. The G is sobriety. I know there is no reason. Yeah, I agree. But PUBG seems to be the thing, right? That's the dominant form, right? Okay, I want Pav Bhaji. You're not getting brunch of heaven. No, let's go. Hasn't Pav Bhaji. I",
            "start": 3408.71
        },
        {
            "text": "I know there is no reason. Yeah, I agree. But PUBG seems to be the thing, right? That's the dominant form, right? Okay, I want Pav Bhaji. You're not getting brunch of heaven. No, let's go. Hasn't Pav Bhaji. I don't like what you're saying at all. PUBG. And the game that was a mod that came standalone was DayZ, not H1Z1. No, that's not true. No, just okay. Originally DayZ was an ARMA mod. ARMA 3 came out and DayZ was acquired by Bohemia Interactive, creator of ARMA. DayZ is now a nerdy access in the ARMA 3 engine. H1Z1 was a game called War Z, the coattails of the popular DayZ. Soon after we got clunking adayla and their PUBG as the undisputed winner of the survivor running shooter genre. I think that's accurate. But I think he worked on the H1. Yeah, no, no, this is where I just read something about a PlayerUnknown. And it was that he that's what we're talking. We're not talking about the mods overall amount. ARMA DayZ. Yeah, that was yeah, obviously the ARMA mod. We're talking about PlayerUnknown in particular.",
            "start": 3460.11
        },
        {
            "text": "and it was that he that's what we're talking. We're not talking about the mods overall amount. ARMA DayZ. Yeah, that was yeah, obviously the ARMA mod. We're talking about PlayerUnknown in particular. Yeah, I think we're so correct on that that yeah, thank you for clarification. But I'm about weird thing. I'm a little bit slow today. My my You're Wrong skills right now are a little bit weak. But you're coming off vacation. Oh, you've been drinking a lot of tea. I still drink a lot of beer in Warsaw. Okay. Ice 7 Don, you said Assassin's Creed Origins Gold Steelbook Edition was 10 quid more. It's dollars, Donnie. This is America. Damage. Oh really? I thought you I thought you're consumed your computer. Re, I thought you said it. I was like, oh, you must be looking at the European Brendan. I ran something quaint, man. Quids like a it's you can apply it to anything you want. She's got on a global currency. That's what I keep saying. Bitcoin, man. Yeah, there it is. That you know, you structuring again. There's not gonna be a third type of",
            "start": 3503.4
        },
        {
            "text": "you can apply it to anything you want. She's got on a global currency. That's what I keep saying. Bitcoin, man. Yeah, there it is. That you know, you structuring again. There's not gonna be a third type of Bitcoin. I don't understand you internet kids. I'm all about Kanye West, if you didn't know. I've even know if the gentleman. This has been Kinda Funny Games Daily each and every weekday on a variety of platforms. We jump into the nerdy video game news you need to know about getting dirty and in depth with it. And you all of you, you can be part of shell. Write in KindaFunny.com/KFG. Remember, you can watch it live on Twitch.tv/KindaFunnyGames. If you have Amazon Prime, you have Twitch Prime and you're getting **** over on the pre-order thing. Whatever matter anymore. Give us your free Twitch Prime sub. We'd love to have it. For us on Patreon, you can watch on YouTube.com/KindaFunnyGames along with a bunch of other awesome content. And you get it as a podcast around the globe until",
            "start": 3541.37
        },
        {
            "text": "Prime sub. We'd love to have it. For us on Patreon, you can watch on YouTube.com/KindaFunnyGames along with a bunch of other awesome content. And you get it as a podcast around the globe until next time. It's been our pleasure to serve you.",
            "start": 3578.13
        }
    ]
}