{
    "id": 2915,
    "video_id": "relj30lmbZY",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Joey Noelle"
    ],
    "title": "Should The Rock Be Shazam!? - Kinda Funny Morning Show 08.17.17",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/morning\n\nThanks to naturebox for sponsoring this episode. Go to http://www.naturebox.com/MORNING\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1503004683,
    "duration": 3385,
    "transcript_chunks": [
        {
            "text": "So, are you doing? What's up, everybody? Welcome to the Kinda Funny Morning Show for Thursday, August 17, 2017. I'm one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. Top of the morning to you. It's just a new heather gray shirt that I've had this for a while. I thought you trying to pull faster. I didn't first had a gray shirt I ever purchased. No, I am no, this is all under, this is not true at all. It's not a perception. How's it held up this way? How many years is it? Look at your shirt. No, look at it stitching here. I don't dry my T-shirt. That's clutch. You got hang dry. High, you hang dry and I'm drying rack or hanger writing rack. Thank you, hanger, to get you those giant collars. When I'm not sure if it those shirts, I'm fine with that. Like our shirts hold up a little bit. You mean a shirt that's on sale right now? KindaFunny.com/store Walters live lat. It is okay. Bitly/KF Summer Sales. Will you track those? Sorry, beautifully. And then it's the capital K and a",
            "start": 1.42
        },
        {
            "text": "bit. You mean a shirt that's on sale right now? KindaFunny.com/store Walters live lat. It is okay. Bitly/KF Summer Sales. Will you track those? Sorry, beautifully. And then it's the capital K and a capital S and a capital S. Q.N. Why don't we use that more? I am so easy because if that worked, if you lowercase it, now that's not how Bitly's work. That sucks. Yeah, I don't think it. We saw how they used in our lowercase R K in there to happen. Sugar, you put in, put a bottom of it. You put HTTP. You need to put the H. Let me try this again. How do you think I would just know by now? Yeah, sure. You things are weird. That's weird. That doesn't make any sense. Really? There's no website works like that, does it? Huh? Other websites don't work like. I don't know. I'm using the websites. The only thing, only one website work like that. Some apparently done if a capital K, capital S, capital S, capital S, capital S's, like your S's, many. No, no, no. I need to go out. You haven't got stop bringing up things throughout that fund.",
            "start": 53.07
        },
        {
            "text": "like that. Some apparently done if a capital K, capital S, capital S, capital S, capital S's, like your S's, many. No, no, no. I need to go out. You haven't got stop bringing up things throughout that fund asset. If you didn't know, ladies and gentlemen, it's the Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunny and YouTube.com/KindaFunny and podcast services around the globe. We come to you with the nerdy news. We want to talk about. We **** around. We have good time. We try to do a whole bunch of different things. Now, if you know, you win games each and every day. Be in the Twitch chat like so many of you are. Thank you. If you have Amazon Prime, you have Twitch. Probably, why don't you give it to us for free? Otherwise, the Amazon takes your money. That also enters you to win everything. Even if you're not here, you support us over our Patreon. They can see. I'll get into it later. What I want to know right now, Joey Noelle, yes, if we broke the first off, you're doing",
            "start": 102.06
        },
        {
            "text": "you to win everything. Even if you're not here, you support us over our Patreon. They can see. I'll get into it later. What I want to know right now, Joey Noelle, yes, if we broke the first off, you're doing a great job. Thank you. I'm rising. We're a skeleton crew. I would say let's cut during all, but I want to overwhelm our Cool Greg. She got that Cool Greg. Kevin still in San Francisco, but about to be on a plane to go to New York to do SummerSlam. That could I ask you to play as you help them organize this? 100%. This is, this is coming through you. Yeah, was a small part of your brain. It a small part of your brain do this just to see what kind of a calamity it might turn into? 100%. Plus, there's a reason I told Kevin and Cool Greg, I'm like, hey, we're sending you to SummerSlam. We want you to, you know, go this interview superstar through this blog, everything. Because yes, a thousand percent, yes. I can't wait to see what happens at 3:00 in the morning when they're, I would Xavier, would they get stuck somewhere? I",
            "start": 142.71
        },
        {
            "text": "superstar through this blog, everything. Because yes, a thousand percent, yes. I can't wait to see what happens at 3:00 in the morning when they're, I would Xavier, would they get stuck somewhere? I part of me thinks obviously they're, you know, Kevin and Cool Greg professional. I understand they're responsible adults. Yes, a part of me also thinks that they're going to wind up in a completely different state having got on the wrong plane and it's going to be basically like Trains, Planes & Automobiles. I can see you guys do like doing like those aren't pillows. You know, I remember that the classic Planes, Trains & Automobiles. I can't wait out a John Candy. I think Kevin does meet John Candy and Cool Greg or Steve Martin, right? Let's Steve Martin. Like neither of the more curmudgeons about anything. That's true. So maybe it would be more like the polka band in hobble up. No, now you're not come out marks. Now, yes, not too far. Sasha Banks is the mom trying to get back to Kevin. That's right. All right. Yes, right.",
            "start": 188.31
        },
        {
            "text": "so maybe it would be more like the polka band in hobble up. No, now you're not come out marks. Now, yes, not too far. Sasha Banks is the mom trying to get back to Kevin. That's right. All right. Yes, right now at Bitly/KFSummerSale, capital K, capital S, capital S, then another capital S. We're selling a whole bunch of stuff at discounted rates. Some select items. This is the brand new limited edition Kinda Funny Bachelor Party T. Yesterday in the morning showed to her, I'm sorry, Nick Scarpino, Tim was here, huh? We started a campaign. Yeah, that is. There is only one review on this and it was so good. We said if they got 4,000 thumbs up, we would give away Burnie's Tesla live on air. Oh, cool. So let's go down and see how many we have now. I'm super excited that Burnie's, oh yeah, of course. 843 thumbs it up again. Joey Noelle, I put it down all day to remembers every. We have to go to Magnum 90s review uploaded here and we'd give away Burnie Burns's Tesla live on the air. It's very simple. It's very easy.",
            "start": 228.18
        },
        {
            "text": "up again. Joey Noelle, I put it down all day to remembers every. We have to go to Magnum 90s review uploaded here and we'd give away Burnie Burns's Tesla live on the air. It's very simple. It's very easy. What do you owner? We had it. We have a whole other Twitter thing to share. So we had time to crank this one up. But I love that our people are reviewing our shirts. Yeah, this makes me so happy. I especially love the reviewing shirt. They've never worked before. Yeah, well, I trusted Magnum knows what he's getting you. Magnum P.I. knows what's up. If you go to the Bitly/KFS Sale, capital K, capital F, capital S, capital S, this is what you see. Not in the shot, Duncan. Tim's not the shot at all coming. It's critical. There you go. There you go. Goodness thing. Yeah, did you know there right now? I'm KindaFunny.com/store. You can get this Kinda Funny casual shirt for just 11.99. Yeah, there are a lot of relaxed. I think, I think some of the merchandise, sure, it's right there. It's on him. How can you be in two",
            "start": 271.87
        },
        {
            "text": "store. You can get this Kinda Funny casual shirt for just 11.99. Yeah, there are a lot of relaxed. I think, I think some of the merchandise, sure, it's right there. It's on him. How can you be in two places at once? Batman. Oh, Shannon, don't come and get them here and then go down to mine. How much is my shirt? Kinda Funny Turbo known as 18.99. That's just market. And here's the other thing I want to say that I'm very proud of. It like a point percent mark off on this shirt. Sure. Yeah, yeah, I agree. That is man. Also, they sent us an email saying, hey, some of the things were marked down forty percent. Let people know up to 40 people exit. It's not ready myself. What I want to do is give a shout out to the Canadian Kinda Funny Best Friends because over on Reddit.com/r/KindaFunny, which by the way, is coming up on 10,000 Best Friends using the subreddit. Wow. Over there, a bunch of these Maple Leaf love in Canadian **** are getting together. Be like, hey, I've noticed shipping is too expensive.",
            "start": 320.33
        },
        {
            "text": "way is coming up on 10,000 Best Friends using the subreddit. Wow. Over there, a bunch of these Maple Leaf love in Canadian **** are getting together. Be like, hey, I've noticed shipping is too expensive on the stuff, right? Yeah. So what if we put in one giant order, just break it up between each other and like in the college like ****. Yeah, that's a great idea. But they'll have to ship it to each other. That thing they're trying to be like if they're in the same city and then trying to organize that. I think so. If you're all in Montreal, if you're all in another city, right? But if you're in Vancouver and you're trying to ship over to Montreal, it's not going to really. But is it, is it like America where it's like, all right, cool, that's like, you know, state to state. I put the stamp on. Yeah. And once you get past the International, I'm sure sometimes use right on the thing, right? Like, hey, post me. I don't have any money. Can you send us from? Yeah, you go postman. Send us a great motor. Don't even give an",
            "start": 361.85
        },
        {
            "text": "get past the International. I'm sure sometimes use right on the thing, right? Like, hey, post me. I don't have any money. Can you send us from? Yeah, you go postman. Send us a great motor. Don't even give an address it out. What if you, Mirabella, on 8000 Mirabella Boulevard, San Francisco, Mirabella, California? Somehow it got the frame. Ah, uh, other piece of housekeeping before we just recycle, do whatever. Want to know again, Kevin and Cool Greg in New York. If you're there and and you don't even have to have care about wrestling. Kyle Stephenson and crew are throwing a Best Friend meet up there. It's at Union Hall in Brooklyn, August 19th. You can go over. Yeah, thank you, Joey. You can go over to WhoDatNinja73 and get this whole graphic. But we're showing to see right here. So that you know, now you go hang out with them. If they both just for trench coats, they would be Giants on above. Agree. That is the other thing too. I don't know when they talk about Halloween costumes, although they gotta go change that.",
            "start": 404.84
        },
        {
            "text": "with them. If they both just for trench coats, they would be Giants on above. Agree. That is the other thing too. I don't know when they talk about Halloween costumes, although they gotta go change that. Bob, yeah, I know we all want to go to sexy kittens or Whannell. We all know the professional wrestlers a lot. What about that? But that's what they're missing the obvious James on Bob like connection. Sure, you and I can go. That's executed. Okay, great. Just hear me tell nobody else. I don't tell anyone else. Up next on the things you need to know about Fiona over on Twitter as promoting right now the fact that the Kinda Funny Extra Life T-Shirt Contest is happening. You may remember from last year, Charlie Shower. You may remember from last year that this is the shirt that one. You all put in this team designs for the team Kinda Funny Extra Life. Kids, this is what you can go right now. You can go in or you got to go to that one. And this is another bit little roll right off your tongue. Super, super",
            "start": 443.78
        },
        {
            "text": "designs for the team Kinda Funny Extra Life. Kids, this is what you can go right now. You can go in or you got to go to that one. And this is another bit little roll right off your tongue. Super, super flowy TKF Shirt Contest. Capital T, K, F, S, to the C in there. And they want to make that were there you go where you just go to Twitter.com/VURANIX. I also on all the forums and the Reddit and stuff up. You kicked around there now. Where you get a C.E.O. does last names, you say? Key on a Mac, Canon? Yeah, cuz I do. You have to if ever someone has an inner case like a inner cap K in the middle their name, you got to go back in it like McDonald's. Yeah, well, after that, Kevin does that exact. Never does a guy make. Kevin is my cell without Mac. That's because I do it because it comes from Coming to America. Yeah, but that was again. Will they have the globe arches? We have the bullet arts. Yes, I know that is good. No, look, you should also sign up for Extra Life. Don't understand that the sign of Extra",
            "start": 480.47
        },
        {
            "text": "America. Yeah, but that was again. Will they have the globe arches? We have the bullet arts. Yes, I know that is good. No, look, you should also sign up for Extra Life. Don't understand that the sign of Extra Life. KindaFunny.com/XL. Do my best impression of a movie out. Probably no one has even Coming to America anymore. Yeah, now here is where we get interestingly. This is, gentlemen, today way is for a long time. #CookingWithGreggy been brewing. Sure, we make you and I, yes, single-handedly have filmed the entire season. Yeah, the furthest season of Cooking with Greggy. We're coming out to Patreon.com/KindaFunny. Yeah, I'm the editing them right now. We do. Um, they're coming along nice. Oh, yeah, guy have a look that I said it yesterday. The first one applaud. Yeah, very excited about the show. You through it after the show that you find. We're in the gods baggage probably yesterday. Do we have some progress? Yeah, but I was like on animate this little fig nervously. Yeah, a wasted it attired. I got this is",
            "start": 526.08
        },
        {
            "text": "it after the show that you find. We're in the gods baggage probably yesterday. Do we have some progress? Yeah, but I was like on animate this little fig nervously. Yeah, a wasted it attired. I got this is whatever I do, but it's fun. I want to like that fun. Here's where I get the interesting, ladies and gentlemen, is that for a long time, yeah, the Cooking with Greggy stuff's been fun. It's been great. What I'm going and people have told me I should go on the reality show cooking scene. Yeah, and I only want to do it if there's one Gordon Ramsay involved because I have a big Gordon Ramsay fan. Throw it up. Yeah, Gordon Ramsay's put out there doing open casting for MasterChef. Now, I've tweeted it. Obviously, I've yelled at both of them. Here's what I need you all to do. I need you to go to Twitter.com/GameOverGreggy. Retweet this, heart this, and leave a comment saying, @GordonRamsay in that MasterChef. You have to do this because here's the problem. There's a pack of lunch you make if you need to go pee. This",
            "start": 571.9
        },
        {
            "text": "over Greggy. Retweet this, heart this, and leave a comment saying, @GordonRamsay in that MasterChef. You have to do this because here's the problem. There's a pack of lunch you make if you need to go pee. This is your time. Okay, the thing about this one is, is that there's the open casting calls. Yeah, which I of course don't want to do. You don't have to look at me and three million people. They're a lot like American Idol. And you're right, if that was terrible. Damn, if they do that, I really do that. I'm they do. That's the show. But on September 9th, to do one in Chicago, right? But don't we have Saint bone love of my life right? Sisters come to visit that weekend. Cannot be there. So what? Okay, I'm either her other mom dentists are coming in tonight. How many times you met her sister? Not that many. Make that's what I'm saying there. And all the way in Montreal, wheeler here is on say you got you're married this girl probably conservatively for the rest of your lives. Yeah, literally at least 10 years. Sure, right?",
            "start": 615.1
        },
        {
            "text": "I'm saying there. And all the way in Montreal, wheeler here is on say you got you're married this girl probably conservatively for the rest of your lives. Yeah, literally at least 10 years. Sure, right? Yeah, yeah. Here in that time, you got ten other chances. Probably the meteor, the sister. You're going to spend at least one Christmas there every year. You're fine. Here's my thing. I'll stop you right there because I did think I could go. They would understand. They'd be behind it. But again, Cool Greg, not cool. There's one in LA in November on Extra Life Day. Okay, but you know, I don't want to do. I don't know how sex drives. And I don't want to move our Extra Life. Extra Life Day on that photos out of you. You just live stream from the line that you're standing in the entire time for Extra Life. Hey, guys, going in line and means corner exit. Will just cut back and forth two minutes last year. Okay, here's the next thing that gets interested. Oh, there's a third option. Are your second option? One option, go to",
            "start": 658.69
        },
        {
            "text": "in line and means corner exit. Will just cut back and forth two minutes last year. Okay, here's the next thing that gets interested. Oh, there's a third option. Are your second option? One option, go to casting calls. Third option, our second option, send in a video. But my images, you just send in a video. So out the application, send in the video. My problem with that, of course, is does the video get as much love at the open casting call? Because I hear they October 31st, the deadline for the video. Meaning that will already have, if nothing goes wrong, a month of Cooking with Greggy. Yup. Yeah, so we'll have cool things to show me cooking is right now. You know, I filled out the pre-application just to the health and said it anyway. You know what I mean? Sure. I put in like the chicken wing video for 2016. Yeah. Now as Paul show to put in there, show how my presentation skills have. I've upped how much better I am at it now. Yeah, but then the third option, I think is everybody retweet this instead. Let them on MasterChef.",
            "start": 697.45
        },
        {
            "text": "show to put in there, show how my presentation skills have. I've upped how much better I am at it now. Yeah, but then the third option, I think is everybody retweet this instead. Let them on MasterChef. Will see that. Oh, man, the I would be this guy has more Twitter followers than MasterChef. Yeah, we should probably just be mmm, work this out. Probably. So everybody go over there. Favorite this. Do this. I've been trying to get out of Kinda Funny for years. This is my way. This is it. We've only been people have been really open for to you. Here's what I promise. If I go there, it will be the funniest season of MasterChef ever. At least for the one episode on form kicked off. Cuz Gordon Ramsay will yell at me. No, yeah, I imagine the first episode goes. You do something he doesn't like. You cut back to hit. He start feeling cut back to you. You're either laughing hysterically or crying about the Gordon Ramsay. He yells even more because there's no get out of the kitchen. Cut back to you. You're shirtless. Yeah.",
            "start": 737.98
        },
        {
            "text": "start feeling cut back to you. You're either laughing hysterically or crying about the Gordon Ramsay. He yells even more because there's no get out of the kitchen. Cut back to you. You're shirtless. Yeah, hundred percent sure. Yeah, take it off. That's the thing. If it chefs mock and you're just nipples on wild card, Harry. Am I going to laugh? Am I going to cry? Am I going to yell back at Gordon Ramsay? Because I love then going to reign with you for sure. You are. You know what I mean? Also, your pipes bigger than hands. Sort of air strike. Yeah, but he's, yeah, definitely. I've seen a lot of these chefs on there before. They're big. They're big boys and big girls. Like, you know what I mean? He's not afraid. It's not that sides will disseminate them. But if I can come and punch vocally at him with if I yell at them. Here's what I think here. I want to take this idea is that further. Thank you. Get you on MasterChef. Yeah, I think that's a no-brainer. But then you got to do the trifecta. We got to get you on MasterChef. Get",
            "start": 780.78
        },
        {
            "text": "what I think here. I want to take this idea is that further. Thank you. Get you on MasterChef. Get each on Top Chef. And then we got a Kitchen Nightmares on American Idol. Okay. All right. All right. We can get out of ways. Cool. But that's the poor man's American Idol. I want any MasterChef. And then one day I want to do a cooking show. Guy Fieri and I know. And I like Grocery Games. It is not need to be Grocery Game. Okay. A knockoff shitty Supermarket Sweep. It's not a. Here's what I'm to say about it. What I'm the jury can put on the Joey can. Joey can I very much are you Supermarket Sweep? I love Supermarket Sweep too. You know, I'm not knocking the Supermarket Sweep. You know, this is not an insult when I compare Guy Fieri's Grocery Games to Supermarket Sweep. This is the evolution of Supermarket Sweep because it's not just buying the ****. Anybody can buy the ****, right? I'm Guy's Games. You got to buy the ****. Make",
            "start": 819.87
        },
        {
            "text": "Grocery Games to Supermarket Sweep. This is the evolution of Supermarket Sweep because it's not just buying the ****. Anybody can buy the ****, right? I'm Guy's Games. You got to buy the ****. Make the budget, then cook a meal that's impressive. That's different. It's like when y'all have Super Slide and then Crocodile Mile came out and put like a little ramp in the crocodile camber. Like, wait, there's been different, right? I don't know. Evolution. We can. You should know. You're another option though. What if we all go with you to be live casting in LA and we do Extra Life from the line in all of us? Yeah, my, oh, my only problem with that is the fact we barely make this stream run from this place with literally hundreds of thousands of dollars of equipment. But we do that. You stream that thing at the housewarming party on your phone. I know if we all have up that it's so bad here. It so easy everywhere else. Yeah, yes, it really is true. Um, go retweet. I don't think you're gonna need to stand in the",
            "start": 860.22
        },
        {
            "text": "the housewarming party on your phone. I know if we all have up that it's so bad here. It so easy everywhere else. Yeah, yes, it really is true. Um, go retweet. I don't think you're gonna need to stand in the cattle call to be considered. Well, that's why I gave you a really good video where I get the movement on this because there's the other thing too is they want like the video. I feel like you have a better opportunity in the video because you can explain who you are. And sure, it'll come from a channel like if we upload it to Kinda Funny. Like come from a channel that already has 100,000 subscribers. We can get everyone else to tweet at them and things like that versus you're just one person online and everyone that will look like you. My only be a Pacey, why do a glass? My other concern, what if I have too much experience already? They don't want something on camera all the time. I think, I mean, what they're more likely looking for. Here's the things that the suburban I.D. floor driven. I've lost a key",
            "start": 907.85
        },
        {
            "text": "too much experience already. They don't want something on camera all the time. I think, I mean, what they're more likely looking for. Here's the things that the suburban I.D. floor driven. I've lost a key part of a really good point. He was like, if you bought Wing Wings, you have a lot more prestige. Another, why are these people that go on these MasterChef? Should you either work in a restaurant or own their own assembly table? Chef Ryan, I'm not familiar with MasterChef, Top Chef. All of them are chefs and cooks in either restaurants or they're, they're like the sous-chef or they're the actual like a lead chef. Sure. What is your restaurant, right? Yeah, food trucks fail. Balthus cool things. They have always a fun angle on these things on like ham hipster got a food truck that goes around the country and I got a cooking show. Yes, you right. You, you're the init personnel that could be your thing. You're like, I like to cook. I'm not a professional cook, but I bring a different angle. I believe that there wasn't one",
            "start": 946.28
        },
        {
            "text": "cooking show. Yes, you right. You, you're the init personnel that could be your thing. You're like, I like to cook. I'm not a professional cook, but I bring a different angle. I believe that there wasn't one. Insurance is it people that what if it is a doctor? Yeah, you cannot currently work as a professional chef and you cannot have ever worked as a professional chef. So right there. Well, they're your main source of income cannot come from preparing a cooking fresh food in a professional environment. I think you're cold. Yeah, you're definitely. That's not doing. I don't see why not. Gordon Ramsay, don't **** me. Everybody between Adam Hartnett, say Burnett. Let me go. Got it. Let me skip the line so I don't have to wait in a line and miss Extra Life. Got it. That's the big thing that's happening here. We don't want to miss Extra Life. We do wanna mess. Actually, Nick, what are the stories? Uh, we have over a piece of housekeeping before we go on to the story. We don't on the document at Hialeah where the document",
            "start": 984.86
        },
        {
            "text": "want to miss Extra Life. We do wanna mess. Actually, Nick, what are the stories? Uh, we have over a piece of housekeeping before we go on to the story. We don't on the document at Hialeah where the document ended. Now, yours adding. I think if I'm not putting on adding on, I'm putting in space for because out of my peripheral vision, I want you to know something. I don't necessarily appreciate here. I got a question about this, sir. I'm gone for one Dalek. Oh, I see a white boy that says the problem the with the biggest car beating him. All right. So I thought I'd use a flip flopper. Two carbs, three. He's slowing down the comics show. Yeah. And then I get that Cool Greg, cool ribbon tags, everything enough. Yeah, Cool Greg's everything my office once we're done with it. Um, what would you like to know? Well, I just wanted to point that out. Yeah, yesterday in the Kinda Funny Morning Show, it was me and Tim hosting. And then at some point, we were arguing as we do. And I think it was we were brain. I was trying to make a",
            "start": 1022.57
        },
        {
            "text": "to point that out yeah yesterday in the Kinda Funny Morning Show it was me and Tim hosting and then at some point we were arguing as we do and I think it was we were brain I was trying to make a point that you were on my side or if you were on somebody side about something should members that's why I brought what I brought that up later as my example of Nutter Butter maybe it was I mean might have been the Red Lobster it doesn't matter but you were flat and Andy Fickle came in out of nowhere just came off the bench all by the way we now call Andy Fickle can act like spiteful he got it he came in off the bench out of nowhere and he was like the problem with Nick Scarpino let me tell you the problem and I'm like no no no stop whiteboard time yeah yeah there wasn't yeah I put the part of the problem with flip flopper yeah but you flip-flop too much and play on both sides you don't have a real opinion just a **** weak I'm weak person Joule you're weak little guy Joule so I got that on there invent",
            "start": 1067.44
        },
        {
            "text": "with flip flopper yeah but you flip-flop too much and play on both sides you don't have a real opinion just a **** weak I'm weak person Joule you're weak little guy Joule so I got that on there invent Andy or Tim shout out carbs as well right were you problems cuz you ruin every time we go out to eat yeah because we can't go to like Ike's and I said we should go to Ike's and we never did we got a whole time but you're going to get all mad because the salad cuz that makes out a great salad they don't make your notes the dicks right oh yeah I brought for shoot today I'm very excited for it next right and then I put he's slowing down the Comic Show right because we're trying to Comic Show yesterday and this was during us and right now I don't have a marker because Kevin just shove them up his ass and go to New York I'm just gonna I'm gonna raise comics and just say you slowed down the show oh we're not out of the news it's hi how are we in 0 min at that 0 minutes in we haven't done one",
            "start": 1105.36
        },
        {
            "text": "ass and go to New York I'm just gonna I'm gonna raise comics and just say you slowed down the show oh we're not out of the news it's hi how are we in 0 min at that 0 minutes in we haven't done one news story what the **** is this show anymore you know that's super true I don't have to worry about it though cos Andrea and Danny aren't here I only feel bad for them right over there waiting they're ready to go it's been quite Danny I have a clean but today we showed up yesterday today Danny wouldn't it said all week Danny's not here and the day Mia showed up to the Kinda Funny Holiday it is my plan my yeah final scared of the news I like that he didn't like call or touch baby to show he's like oh you said something in an email about next week so I just assumed you forgotten thought I'd come anima all right you're on the show let's go awesome Oh fantastic Kevin is a good guy Danny is a great guy today I wish the killer just kidding day yeah I'm checking the verified tab as soon",
            "start": 1140.01
        },
        {
            "text": "I'd come anima all right you're on the show let's go awesome Oh fantastic Kevin is a good guy Danny is a great guy today I wish the killer just kidding day yeah I'm checking the verified tab as soon as I see MasterChef on Fox follows me back you know the DM is incoming but like how can we work this out now the problem of course Gordon Ramsay already following your boy Greg Miller Vienna I've done that before would you like to say anything he follows like a million people - yeah one of those guys Gordon he's a great chef I don't understand Twitter being denounced probably not but do you Lea understands flavor profiles flavor profiles and how to scream at them X no right I'm mark good guy this is what I was thinking me funny too right it's my stick on this show it may I don't know it might not give me past episode one now yeah but which means like I here on the grill station or whatever right when it comes over I need it I need these at stake so I just pull out Buffalo in front me like",
            "start": 1179.06
        },
        {
            "text": "not give me past episode one now yeah but which means like I here on the grill station or whatever right when it comes over I need it I need these at stake so I just pull out Buffalo in front me like yeah and the first time I go delicious thing it's funny so it's not a big deal but what we're doing it it's like the real thing anatomy I think I got it feels like an idea for this year like an animated here's my pitch for you should we start yelling at you you go more and more Michael Caine on them like you just get really nervous you you you get into a British accent are you making fun of you I just I was like okay first news story bring it up comes from our friends over at IGN to Shazam you gotta say what the explanation is that is the next DC movie shoot as comes from Alex Gilyadov says the long end development of a movie is the next DCEU film to shoot in an interview with Film Riot via Heroic Hollywood director David F. Sandberg confirmed the script for the movie is complete",
            "start": 1224.39
        },
        {
            "text": "says the long end development of a movie is the next DCEU film to shoot in an interview with Film Riot via Heroic Hollywood director David F. Sandberg confirmed the script for the movie is complete indicating it won't be too long now until production starts according to earlier reports filming you should begin earlier sometime early next year for potential 2019 release Sandberg also revealed there was an older version of the script that featured Black Adam welcome trance what a show in the film for the director joined the project however samam had since you show in your movies with Johnson getting his own standalone Black Adam film can't wait for that also in the interview at Sandberg discussed which the character's origin stories might inspire the the movie the director has been reading old comics with Shazam when when where Shazam as well a more recent tales about DC superhero quote you know you have the most recent sort of Geoff Johns version and you have Orwell version and",
            "start": 1270.23
        },
        {
            "text": "comics with Shazam when when where Shazam as well a more recent tales about DC superhero quote you know you have the most recent sort of Geoff Johns version and you have Orwell version and then you have those really old versions at Sandberg that's it Felisa they make the heresies later which opens in theaters just like open figures from November 17 so a little bit of an update there this is a movie I think the real story here in the subtext here that Alex Gilyadov is really trying to say you know I can't believe it still making Shazam a movie yeah isn't that fantastic yeah and they're making it without The Rock yeah so I guess he's getting his own standalone movie which makes no sense will he really though I decide oh me me wrong I wish you well they're saying this this is the next movie to shoot it sounds like they have nothing planned for this right I mean sure that you should they should be further alone right now yes in the movement I think if this is the next one to",
            "start": 1309.55
        },
        {
            "text": "next movie to shoot it sounds like they have nothing planned for this right I mean sure that you should they should be further alone right now yes in the movement I think if this is the next one to go into production yeah Shazam I mean they should probably at least have a script ready yeah especially if it's coming out to say what's coming up next year I forgot know 2099 here what a find them filming should begin sometime early next year for a potential 2019 release yeah then I think it's okay I mean David okay so let's really do the whole article get the director confirm the script for the movie is complete indicating it won't be long too long the code now until production starts yeah it's complete they're good they have a leaky finally playing no they have not cached Shazam they haven't done that at all all they ever did was load The Rock's movie Black Adam whichever is like that's **** stupid make the rushes I went the rocky shore yeah yeah and they're like alright well now he's",
            "start": 1352.51
        },
        {
            "text": "done that at all all they ever did was load The Rock's movie Black Adam whichever is like that's **** stupid make the rushes I went the rocky shore yeah yeah and they're like alright well now he's not in the movies gonna have his own movie it's like what the **** are you doing what is going on right that doesn't make me sense is it weird to cast a not your primary character first not one it's The Rock The Rock is going to be like the problem with Shazam is that no one probably remembers and or gives a **** about that character and so you have to have something in there to to really know people and The Rock being Black Adam is actually very fascinating cool driving a bad guys awesome it's just it's gonna be interesting if they ever make it to it actually the Black Adam movie feels like the point people rank when they were doing the current cast emissions a it would be too much money when I'm throwing Black Adam movie well I wonder whether when I'm tired too but the problem",
            "start": 1391.63
        },
        {
            "text": "like the point people rank when they were doing the current cast emissions a it would be too much money when I'm throwing Black Adam movie well I wonder whether when I'm tired too but the problem is I guess should say like Black Adam could be a standalone movie where he dies or aunt or doesn't worry about Shazam has to be a major part of yeah yeah bored so you get a Rock in one movie and The Rock doesn't Rock ain't no **** chump he's not a child for sure I talk about The Rock tell me somewhat ironic if The Rock committed to being Batman The Rock would be **** back there's none of this **** of like his The Rock's brother wouldn't suddenly be like things would be bad yeah totally those I like luckily clearly drunk in this interview but he's probably not going to do it I maybe I'm being better I don't know **** Alex **** up the Batman and do something The Rock one is about a Rock as Batman and for now until they brought back monkeys are like cool I'll advocate the term advocate the",
            "start": 1425.76
        },
        {
            "text": "I don't know **** Alex **** up the Batman and do something The Rock one is about a Rock as Batman and for now until they brought back monkeys are like cool I'll advocate the term advocate the throat yeah you know I mean I don't know man what do you do this is one of those I just don't know about this strikes me in the same vein as the Cyborg stuff like I'll believe it when I see it I wish him well go get them all so it's one of those things where if it doesn't happen okay okay I carry because they **** the substituent yeah The Rock would've been awesome in the DC Universe I'll rock whatever made but they also announced that he's nothing to be Black Adam like another two years ago yeah and going on forever yeah **** off The Rock really running for president soon and then we'll never get many times true he is going to wreck his presidency and it'll be I mean if there's one person who could simultaneously run the country and be Batman or Shazam yeah I keep it Rock exactly yeah there",
            "start": 1463.14
        },
        {
            "text": "many times true he is going to wreck his presidency and it'll be I mean if there's one person who could simultaneously run the country and be Batman or Shazam yeah I keep it Rock exactly yeah there you go next news story comes from SlashFilm.com and exclusive individuals terrifying and awesome and amazing and God would and I love it let it have Gremlins 3 has a twisted and dark screen places writer Chris Columbus after Gremlins to turn the original film on a Ted with Leonard Maltin reviewing Gremlins 1 in the movie and Gremlins overtaking the projection booth until Hulk Hogan stopped them I like Gremlins to a gym a fantasy on a boat the story you're trying to move for one of their you wouldn't saw it in a kid by yourself yeah when I was a kid I was terrified of Gremlins but my parents were like that's cool you can go see films to buy your cell because we don't wanna watch it yeah I remember sitting there going wow it's not scary at all is just a silly Daffy yeah I remember",
            "start": 1500.43
        },
        {
            "text": "parents were like that's cool you can go see films to buy your cell because we don't wanna watch it yeah I remember liking a lot granite like a lot because it wasn't scary yeah Gremlins 1 still scares the **** out of me sure oh yeah girl was like he had turned into it is on at that attended everything if you have your Gremlins fan and you have not watched the Key & Peele skit about Gremlins 2 I have you have to go and watch the show he's so goddamn awesome as a Gremlin so it does sound fun it seemed a lot more of the franchise Gremlins 2 decade later talk of Gremlins 3 is final it's finally real an original screenwriter Chris Columbus has written a script speaking with SlashFilm about the festival hit Patti Cake$ which very excited to see it comes out this weekend yeah I heard that heard Tim talkin **** it looks stupid again if it's about rapping I don't I sign off on it cuz I know everything",
            "start": 1539.22
        },
        {
            "text": "Patti Cake$ which very excited to see it comes out this weekend yeah I heard that heard Tim talkin **** it looks stupid again if it's about rapping I don't I sign off on it cuz I know everything about please like you know email perfected on your shoes to go I didn't uh I brought up 8 Mile and he was like yeah exactly like wait 8 Mile good or bad I'm not sure where this it would you know yeah exactly I mean you're on the same page or not on the wiggle Columbus has said his script asked questions which may have been on fans might since the original if all the Gremlins come from getting Gizmo wet and feeding is Mogwai offspring after midnight should Gizmo be eliminated to take that **** yeah yeah I just I like it I like it I mean Emily honey don't you know you your new shoot no this thing that was my uncle told about it whatever you want to do you put them in a ziploc bag it's situated over you don't just shoot him but a bag over a ziploc that I mean do not even overhead",
            "start": 1578.75
        },
        {
            "text": "no this thing that was my uncle told about it whatever you want to do you put them in a ziploc bag it's situated over you don't just shoot him but a bag over a ziploc that I mean do not even overhead just him in the bag right right night I still shoot anything as I'm doing a John Wick to exciting scenes with you I'm like you is really so good quote very good elevation critic on the static one and it comes up in the movie that comes up in the movie certainly that raised a number of ethical issues Gizmo himself has done nothing wrong it's stupid negligence that allows him to get soaked unless the mischievious Mogwai transform skill even Columbus thinks cute the lovable Gizmo might not be worth the risk quote I think it's probably it's a good idea to goddess me third say Columbus too many people are dying blend up to the script returns to the macabre tone of the original film whose monster murderers were so intense that it along with Indiana Jones and the Temple of Doom we're pressure the MPAA",
            "start": 1622.43
        },
        {
            "text": "people are dying blend up to the script returns to the macabre tone of the original film whose monster murderers were so intense that it along with Indiana Jones and the Temple of Doom we're pressure the MPAA to create the PG-13 rating that's a fun little fact they're Gremlins 2 was rated PG-13 Columbus really proud of script Columbus said it had a big dark and twisted and dark at anything so we'll see always a budgetary verse a sure when we're going to shooting I want to go back the really twisted sensibility with the first movie I found that that was very easy place for me to fall back into and start writing again so hopefully we'll see that movie very soon did you think we'll see Gremlins 3 pacquiao seeker really decrypt close oh yeah cribbage a joke again what so let's just let's let's run down a line of Chris Columbus movie that off the top of my head Home Alone yeah all the Harry Potter's that he helped produce sure two of which he directed the rent the Bellini executive produced okay",
            "start": 1664.13
        },
        {
            "text": "a line of Chris Columbus movie that off the top of my head Home Alone yeah all the Harry Potter's that he helped produce sure two of which he directed the rent the Bellini executive produced okay that's pretty much enough juice right there to get whatever **** Gremlins boom baby you know if he's still in San Francisco Chris Columbus yeah I guess yesterday we read I Kill Giants okay I Kill Giants account proplica the opening letters from him like the forward oh and he's like I went into my local comic shop in San Francisco Comic Experience your shitty I really uh I was critical of like still around or we gonna take a lives in the neighborhood you met this one that's **** your thing if it was just like we open the window the Chris Columbus is just drinking tea out there and sports oh hey you guys I'm drinking tea and we're like okay like hey Chris Columbus like I watch you guys show it **** here's my favorite fair Chris Columbus my question for you is could you identify Chris",
            "start": 1705.87
        },
        {
            "text": "oh hey you guys I'm drinking tea and we're like okay like hey Chris Columbus like I watch you guys show it **** here's my favorite fair Chris Columbus my question for you is could you identify Chris Columbus if you was no I don't think I could I mean I've I saw a picture of him next to a bunch of other people I would like to ask Chris Columbus but I don't know if walk down the street now would know okay okay also do you think we'll get John Glover back for this movie John Glover which was shot he was Mr. Clamp he was the guy who was in Gremlins 2 ran the Clamp Corporation he then went into be Smallville's Lex Luthor's dad of course but I got my seminal role William this is how I knew him originally you know okay John Glover yeah **** yeah we get John Glover back to this god he was so good he was so good the Gremlins is fun, man. Gremlins, great movie. the Joe Donnelly mm right there yeah Oh done so now Titan Matrix has an interesting conspiracy theory on cat what if Chris Columbus was",
            "start": 1745.05
        },
        {
            "text": "the guy Greg smoked with everyone I had to go outside and smoke so we can get a fight do you think Chris Columbus was like I'm going to go into sky they're a drone over my house it would finally make sense as to why he was so offended there was a drone over because because maybe he was shooting scenes in his house for Gremlins 3 and one vegetable and I didn't want people going over scanning the pages yeah if we saw his script and it was like Gizmo and dies question we'd be like gee wheeze blue spot is that time it was like that time that someone leaked the script for The Hateful Eight Jen you know like I'm not gonna make this movie and then was like **** anomic movie or like I was mother's grip and I'm the other **** and 18 I was long known got food script anyway quickly if I'm",
            "start": 1783.51
        },
        {
            "text": "you know like I'm not gonna make this movie and then was like **** anomic movie or like I was mother's grip and I'm the other **** and 18 I was long known got food script anyway quickly if I'm wrong the checks I'm pretty sure with The Hateful Eight but that was basically a different here now remember is the Madsen thing where they thought it was Michael Madsen and Michael Madsen came on up at noon and talked about it we're like okay that's weird no Chris Columbus has been around for a long time I tell he didn't direct no he did direct Home Alone I think John Hughes wrote the script on it and he directed it if I'm a really long time he's really powerful so this is happening I only have shot into the chat so many of you threw up I'm seeing the first one I see Exdeath_ who said they look soft but they hard bro the cool Greg quote of course of Gremlins look soft but they hard bro that is still a shirt that needs to be made with the outline of a Gremlin head okay okay I like",
            "start": 1822.7
        },
        {
            "text": "they look soft but they hard bro the cool Greg quote of course of Gremlins look soft but they hard bro that is still a shirt that needs to be made with the outline of a Gremlin head okay okay I like that he had another Imogene use one yesterday I should you quoted him someone was quote someone called a serial thing yeah it was like I feel at my heart but I'm just not gonna get well I love cereal in my soul but sometimes I ain't ready for everything because we were reading we're leaving Vegas really you want some breakfast Greg's like no are we're talking material Walt right here is you like to eat Riley couger exam cool great is the man Joey the next to new stories we don't necessarily need to worry about if you can bring up Rotten Tomatoes for now though I just want to go over what's out this weekend oh I like to do it so what's out on Thursday just remind people and myself mostly what I'm going to try to take my wife to see this week is going to say we're not going to do it",
            "start": 1857.68
        },
        {
            "text": "it out this weekend oh I like to do it so what's out on Thursday just remind people and myself mostly what I'm going to try to take my wife to see this week is going to say we're not going to do it out this weekend The Hitman's Bodyguard which is and marine minder 730 m3 701 up and you saw it last it's a 35 on mine well do you got there yo if you open up the tab rock you open camera wrong Joey eyes are on Joey Logan Lucky which is a 9 % what's lucky look I know actually okay once you look better at home come on Lonnie Logan shawl collar which I'm not familiar with either a movie that I M I seen the trailer for and very excited for Patti Cake$ which is that looks cool it looks good and then a lemon of course coming out there's some other movies that are obviously Dunkirk, Crystal, Annabelle: Creation are you a fan of Annabelle series you like hormones no and I heard this Annabelle: Creation it had like the worst opening last week of and like all of any of the not James Wan no of the what's the",
            "start": 1896.95
        },
        {
            "text": "creation are you a fan of Annabelle series you like hormones no and I heard this Annabelle: Creation it had like the worst opening last week of and like all of any of the not James Wan no of the what's the work is not parallel universe yeah the Conjuring yes the Conjuring but I thought it when I read that headline if I did bad I don't know I've had a sixty eight and thirty five point one of us seems that looks pretty good I feel like people like that people like those world I like The Conjuring a lot of Conjuring that whole T and I'm just not into it Logan Lucky two brothers attempt to pull off a heist during a NASCAR race in North Carolina the Channing Tatum oh hello Lorenz yet Daniel Craig's in the to okay yeah second floor name is Bob that's right how did I not know that oh yeah that's a Soderbergh film so that's gonna be fun watch so hmm **** like want to see both those this weekend Patti Cake$ can probably wait what do you love I don't know if I was going to see the same we'll",
            "start": 1942.48
        },
        {
            "text": "a Soderbergh film so that's gonna be fun watch so hmm **** like want to see both those this weekend Patti Cake$ can probably wait what do you love I don't know if I was going to see the same we'll see what happens to happens minimal in a moment that's it for new stories we don't I think there's not too much more out as you know every time Nick and I are on the Kinda Funny Morning Show together we do required viewing three weeks ago we said for you to watch Casablanca yeah does your watch is your deeper we got it will be better for real for real let's look at the calendar right and see one around the show together again that was what happened is that I think at the final coming up to that show the show switched and we're like we'll get to it later if we want to have a required viewing segment like you wouldn't like me and Tim be with the require everything sure here's what I wanted them do you think no even I've MoviePass says no news about moving past being $10 a",
            "start": 1988.68
        },
        {
            "text": "segment like you wouldn't like me and Tim be with the require everything sure here's what I wanted them do you think no even I've MoviePass says no news about moving past being $10 a month question mark Falcon that was two days ago action what is MoviePass kids hit me about I know that's prior I don't I don't know this is the first I've heard of it apparently was $30 a month and you could just basically watch unlimited movies in the theaters and now they're dropping into ten dollars this is AMC's no it's a sentiment outside it's an outside company that was started by one of the original Netflix executives has started this and now they're dropping it to $10 a month basically for 10 bucks a month evidently you can just go walk into any theater like you can book tickets for any theater and see it's like an unlimited subscription but great alright I don't know if I did yeah I mean I'm definite I gotta look more into it cuz that's the case I definitely see more than three",
            "start": 2032.63
        },
        {
            "text": "any theater and see it's like an unlimited subscription but great alright I don't know if I did yeah I mean I'm definite I gotta look more into it cuz that's the case I definitely see more than three movies a month so with my wife we had we both had that we was that would save us like 40 bucks my shirt last month why not here we go everyone you're required viewing for next week if Catch and Release starring Kevin Smith and Jennifer Garner sure it we will talk about it on August 5th that is Friday the 5th Joey yeah I don't even tell you out there tiger somebody make a graphic for it okay I would say hey Annie do it but Annie doesn't come to work anymore apparently yeah I'm Annie and our boss is E-Links up when did we do that I really think you just decided and then we just could go with it God, call leaving was so confusing evidence anywhere you draw a tag because I just think it's like you know I can't I was like okay man cool hey all right so everybody Friday the 5th we are talking about",
            "start": 2072.32
        },
        {
            "text": "call leaving was so confusing evidence anywhere you draw a tag because I just think it's like you know I can't I was like okay man cool hey all right so everybody Friday the 5th we are talking about Catch and Release watch it I let make me a dumb graphic anybody who wants to hit me up and we'll do it there you Catch and Release what's that next Friday yes okay seems not tomorrow no we're not talking about it tomorrow everybody can be very clear not too much more about a lot it's night I know in the show tomorrow your family I'm sure tomorrow I don't know am I having it yeah I mean you're honest right Aman oh now I'll watch it really I need a week I don't know yeah that's actually I working Gen's Photo Unit down there you go let's read some tips, Nick remember your money is the lifeblood that keeps Kinda Funny running around punching things getting on Gordon Ramsay shows Scott, Joey doesn't go is Shaker, has she doesn't seem to buy anything I just said no - well the punching thing no",
            "start": 2116.83
        },
        {
            "text": "that keeps Kinda Funny running around punching things getting on Gordon Ramsay shows Scott, Joey doesn't go is Shaker, has she doesn't seem to buy anything I just said no - well the punching thing no Joey, compositor view well I guess proverbial punching okay like right now Kevin and Cool Greg are punching the anus of New York **** you punching some pizza joint how go hell yeah okay we can't stay away from street food here in the tips are you going Justin Ryan Bear says this basically sums up how I feel about your content love may give us a link there Joey you want me to copy that in why don't you take a look at this link and if it's good great great if not throw it out the window throw out the window son the next bit comes to mix with Champ **** Cheese not a big deal but I still am I forgot about that so now that I forget about it and I realized I did do that I did accomplish that I did beat everyone and I accomplished that Nick can you humble down Greg Summa by room book you",
            "start": 2164.74
        },
        {
            "text": "I forgot about that so now that I forget about it and I realized I did do that I did accomplish that I did beat everyone and I accomplished that Nick can you humble down Greg Summa by room book you minding him who the Champion he gets real prey when you're not around P.S. is there a Patreon amount to engrave a champ boat with Nick's name no but there should be and Greg knows he feels in the back of his brain every time I'm around that he is the inferior of the two white guys sitting at this table right now so there it is the Flannel Desk is giving us tips a making you all can you just tell Greg again that you are Champ you know what he said how he says well Vesel just saying thank you for getting me through a rough week my dad was hospitalized Sunday with COPD and sleep apnea complications he's doing well now though also this is my birthday attacks turning 7 happy birthday glad your dad's back on his feet or doing better there you go oh I love and well wishes to him Joey what do you",
            "start": 2206.83
        },
        {
            "text": "he's doing well now though also this is my birthday attacks turning 7 happy birthday glad your dad's back on his feet or doing better there you go oh I love and well wishes to him Joey what do you got for me from this uh funny clip that was in it I don't know if it just based on the title in fact it seems like we're gonna like it yeah unmute the YouTube video okay well here you go there we go good job Justin running better than one just run down I like that quite a bit good job big job but dog Nick96 wrote in and said hi Dragon, Nick, Greg and the new Game Informer there's an article listing games that needs another chance and one is NCAA Football question do you think we'll ever see XFL in football video game no I don't think you will even though you know that a XFL documentary at the end there ends on a cliffhanger with themselves a Vince McMahon then we see you guys talking about it what if we didn't begin get out of it again and be awesome did it not happen it was",
            "start": 2251.46
        },
        {
            "text": "at the end there ends on a cliffhanger with themselves a Vince McMahon then we see you guys talking about it what if we didn't begin get out of it again and be awesome did it not happen it was underrating it was awesome watch the ESPN 30 for 30 on XFL felt amazing okay yeah but I think they were put in the game the awesomes they did I'm gonna have Madden thoughts on Gamescast today so get excited for that remember yeah Patreon.com/KindaFunnyGames people yeah a level can watch live yeah we had we put up that link it that seems like something I would've slipped through the cracks alright that again can we put up a link for the have you put of a live stream viewing link on Patreon for the Gamescast today yes it was scheduled look at you look at how good you guys are run the show over there I have to worry about nothing and also yes I miss Nioh with all my hearts all of them all two of them the one of my chest on my dick MarioNowBros gave a tip and said hey hey hey man",
            "start": 2303.22
        },
        {
            "text": "there I have to worry about nothing and also yes I miss Nioh with all my hearts all of them all two of them the one of my chest on my dick MarioNowBros gave a tip and said hey hey hey man fielding it's been 37 years since I last tip what's up guys what's new anybody get any stupid tattoos recently heard this Luigi, yes, Bros fella got a really dumb one he's talking about himself MarioNotBros he got a big ass tattoo I love Eddie, Big Annie taught and he put up a text conversation with a girlfriend about how he's gonna eat her ass one day why would he do that I don't know he Mario has no filter Mario he's don't you do he thinks he can but you don't understand how much energy it takes to be this awesome you gotta tone it down a little you got to tone it out a little bit right now you're 19 or is this just going to follow you forever okay one day you're going to be like I'm going to dress in a suit and go be a corporate lawyer in your boss you like this no cuz you're trying to",
            "start": 2340.63
        },
        {
            "text": "you're 19 or is this just going to follow you forever okay one day you're going to be like I'm going to dress in a suit and go be a corporate lawyer in your boss you like this no cuz you're trying to eat ass that might work through his advantage no I don't think so okay the only kind of eating asked ever works into a never mind when I couldn't go into that oh really did you see the tweet that was getting passed on yesterday it was **** awesome which one it was a it was a quote we need a tweet had like 300 thousand retweets or whatever heart forever but it was a quote treatment the initial one was Playboy and it's like the 2017 generation isn't as obsessed with breasts those previous generations were and was linked this article Playboy did and then the guy coach we just got because because of 2017 grandpa we either that is pretty amazed were all the tipster right now if you tip worse well he subscribed Joey or even between this show in Kinda Funny Games Daily if you tip from here",
            "start": 2386.29
        },
        {
            "text": "of 2017 grandpa we either that is pretty amazed were all the tipster right now if you tip worse well he subscribed Joey or even between this show in Kinda Funny Games Daily if you tip from here on out I'll read after Kinda Funny Games Daily a show no one tips during and always makes his head but I understand where's making content out there for you there you go however piers I love this those critics always oh don't cry don't cry you want to take it I love this Best Friend XOXO is your opportunity to shout out someone you feel in our community is doing a great job or is being an awesome person or has just done something noteworthy you can go to KindaFunny.com/BestFriend to nominate someone out there that you love just like Tenny did today Willie Mejia Willie was the first person who welcomed me into the Facebook group after waiting a year to get accepted he's finally the Facebook group I'm thinking that we thought that they were like a bot or like their profiles super private",
            "start": 2424.84
        },
        {
            "text": "welcomed me into the Facebook group after waiting a year to get accepted he's finally the Facebook group I'm thinking that we thought that they were like a bot or like their profiles super private so we didn't want them in I tell you what it's unofficial Facebook page it's hard to get you men know about what's happening over there like an L.A. club so you know I hear they got things going on I got to send it over on this tour I got to worry about right I got a winner your wait list over the Senate steady all right okay I would either do a vampire now I that's a Star Wars reference oh did it he's friendly helpful and understands the shoot King that knack is he also teaches kids base which is dope okay cool you guys Olivia you're off and thank you so much for being a great value right now John, Greg yeah if giveaway time no ladies and gentlemen each and every week to here on Twitch, stop me, Clutch Kinda Funny Games we wedding run you through and it's really hot new just come on the Nerdy",
            "start": 2471.1
        },
        {
            "text": "John, Greg yeah if giveaway time no ladies and gentlemen each and every week to here on Twitch, stop me, Clutch Kinda Funny Games we wedding run you through and it's really hot new just come on the Nerdy News we want to talk about we **** around we have a good time it's the mornings you you enjoy it then we jump in the chat to answer your questions comments and concerns but in between those two segments I reaching the internet grab a video game and toss it to one of you how do you win it's simple being the chat like so many of you are right now or you have three other ways to amplify your chances or win if you're not here because maybe you're listening on YouTube.com/KindaFunny or podcast services around the globe number one you can subscribe to us here on Twitch if you subscribe to us you get automatically entered to win everything we give away plus get the cool urban extra name cool emotes private chat time with us you get to play multiplayer games with me everybody",
            "start": 2511.66
        },
        {
            "text": "to us you get automatically entered to win everything we give away plus get the cool urban extra name cool emotes private chat time with us you get to play multiplayer games with me everybody Everybody's Golf is the next big one I have planned and the show ad-free unless we bake them in we're about to bake in two which means we're gonna give away two video games so chill all right well if also if you have Amazon Prime you have Twitch Prime show want to give us that money every 30 days you have to give to somebody otherwise Amazon just sits on it and laughs at you they have big meetings where they laugh at all you people wasting fire all the last meeting the last anyone loves money laughing they all get to a big holiday go look at those chuckling how it goes so many are you go to Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames there the two dollar level you're entered to win everything we give away you don't need to be in the chat ever yada-yada-yada Boy George is",
            "start": 2551.35
        },
        {
            "text": "no funny or Patreon.com/KindaFunnyGames there the two dollar level you're entered to win everything we give away you don't need to be in the chat ever yada-yada-yada Boy George is still alive Boy George is still alive print not alive but someone in the chat was like hey did you know they give Prince his own colour purple like he has his own shade oh really my poor cousin that's pretty cool also someone was saying hey Greg best way to reach Gordon Ramsay's by tweeting a picture really poorly fair food I think what I'm going to is I'm going to the MasterChef Twitter account that's why I want to get here you want to you want to Ramsay's not going to pull any strings from Gordon Ramsay does not have pull on his own show you talking **** about where Ramsay already I mean I don't even know media person does but I'm just saying that's what I'm doing you had to read I give that really Ned and then we give away the two games okay oh that's then I'm good alright go the first dad",
            "start": 2593.02
        },
        {
            "text": "even know media person does but I'm just saying that's what I'm doing you had to read I give that really Ned and then we give away the two games okay oh that's then I'm good alright go the first dad the first people who are bringing you this gay this giveaway is Dollar Shave Club dollar dollar y'all Timmy's Dollar Shave Club love it right I love that hugs butter he does I've asked him if he can eat the shave butter multiple times and he says no but in his eyes I know he's tried yeah or at least thinking about it's like all the butter for a great shave a great price join Dollar Shave Club new members get their first month of the executive razor and two of that sweet nasty Dr. Carver's shea butter for only five dollars with free shipping after that razors are just a few bucks stop wasting time going to store to buy a gimmicky razors you don't need and or making your wife go to the store by giving don't do that I need because she hates that **** they're way too expensive but she goes",
            "start": 2631.66
        },
        {
            "text": "time going to store to buy a gimmicky razors you don't need and or making your wife go to the store by giving don't do that I need because she hates that **** they're way too expensive but she goes you know what you have a beard you're even shedding I'm like an identity gonna clean this stuff up for you talking brand new coons you know I thought not purpose I just wanna do this move I'm good with it look at the clothes the clothes it's a really good bright random because uh Tim loves this stuff it changed his life Tim Tim light setting that makes life easier yeah Tim and I believe the house if Tim could he would sit at an LED desk with his giant computer and his underwear and just had a delivered to him all day long okay Josh in with the cream the butter and sure it's gonna look right you know what I mean yeah oh my god it'll change you that's $15 value for only five bucks get yours at DollarShaveClub.com more than that DollarShaveClub.com/Morning for that good value this show",
            "start": 2673.78
        },
        {
            "text": "know what I mean yeah oh my god it'll change you that's $15 value for only five bucks get yours at DollarShaveClub.com more than that DollarShaveClub.com/Morning for that good value this show and second giveaway is also brought to you by NatureBox we all need better bow when it comes this next sometimes it feels like the whole world is trying to tempt Kevin into a caloric oblivion which is what New York is doing today but Kevin it doesn't have to end up that way up your snack game with NatureBox NatureBox has over 100 snacks that taste good and are actually better for you all snacks are made from high-quality simple ingredients which means no artificial colors flavors or sweeteners so you can feel good about what you're eating here's the thing that all sounded really healthy that's what they're trying to sell you who cares I've eaten it it's real good remember they used to send it to the household yeah **** I get the jelly meat at the yogurt Creta led them you got the",
            "start": 2716.43
        },
        {
            "text": "that's what they're trying to sell you who cares I've eaten it it's real good remember they used to send it to the household yeah **** I get the jelly meat at the yogurt Creta led them you got the little balls little almond balls delicious in the notes here say Gia's favorites are white cheddar caramel popcorn and the spicy Sriracha popcorn I have not had the Sriracha popcorn that sounds phenomenal they add new snacks it's next every month inspired by real customer feedback the latest food trends and professional chefs just go to NatureBox.com/Morning deliver them right to your door if you don't like it don't eat it in a shoe box we replace it for free right now you can save even more NatureBox is often Kinda Funny Best Friend three free snacks with your first order when you go to NatureBox.com/Morning for three free snacks with your first order NatureBox.com away Anti-Hero on PC love it's going to Twitch user SourSkittles skittles spelled weird sky dolls is how they",
            "start": 2760.32
        },
        {
            "text": "NatureBox.com/Morning for three free snacks with your first order NatureBox.com away Anti-Hero on PC love it's going to Twitch user SourSkittles skittles spelled weird sky dolls is how they spelled it technically then since there were two ads to games Patreon user Peanut0423 is getting Rime on PC enjoy that congratulations Nick yes sir it's time for the Moriarty three and four Miami talent questions I believe I've cued up a couple thank you people have been asking me things one did I see that the sparring is footage that's going around with Conor McGregor with a sparring partner we actually looks like you can box I have not seen it yet I've heard a lot about it sounds exciting as you know Conor McGregor's to the fight Floyd Mayweather the week were in Vegas four Gamescast Topics but are we blowing off Gamescom Expo and going to a fight no when I think what I heard is that this might just be hearsay is that they're going to actually do the fight at our",
            "start": 2801.27
        },
        {
            "text": "Gamescast Topics but are we blowing off Gamescom Expo and going to a fight no when I think what I heard is that this might just be hearsay is that they're going to actually do the fight at our streaming booth that's what we're Street that's what I like to hear so I that might be that might be a completely hearsay a rumor but it's possible there's a 1% chance they might just move the five name Jim to our little tiny streaming stage yeah and we'll just be there and hang out with them that's what that's good to people are asking if I saw the new George Lopez comedy special on HBO wall I saw my when I was watching them Ballers now here's what I need everyone to do tonight you're sitting down you got a moment to yourself you guys per hour and you're like what should I watch today should I watch the last two episodes of Frasier like Nick did last night no right a little bit don't do them no don't do that if you have HBO go to HBO and watch George Lopez of the wall it is one of the",
            "start": 2848.64
        },
        {
            "text": "I watch the last two episodes of Frasier like Nick did last night no right a little bit don't do them no don't do that if you have HBO go to HBO and watch George Lopez of the wall it is one of the best if not the best comedy specials I've seen all year just an adapter is **** hilarious **** hilarious okay done well that's it okay watch The Defiant Ones it's fantastic - Defiant Ones yes fine it's about Dr. Dre and Jimmy Iovine and how they came together to form Beats well Interscope Records Aftermath all that stuff The Chronic, Gotti idea I helped produce all that stuff and then Beats by Dre sold 3. million dollars Apple **** fascinating story fascinating okay today first hip hop billionaire really didn't know that suck it you didn't know that JV right now start my ball says Nick what's your take on the **** gum controversy if you do if you date if your date pooped let me call anybody explain I don't know he's going through in English price I'm Troy Baker's God right and he did it",
            "start": 2887.04
        },
        {
            "text": "your take on the **** gum controversy if you do if you date if your date pooped let me call anybody explain I don't know he's going through in English price I'm Troy Baker's God right and he did it normal oh god no maybe I don't talk much I will try to change but we in now and of course Troy Baker being a normal human being doesn't understand this is a bit that Fifi thinks is funny so Troy just was like I got one for you I'll take up a notch what if you run a date and a girl brought out some flavored gum and took it him and then we were off to the races there it is there it is um I don't know how to feel about that what I argued was this is that if Trident slash whoever is making come this is on the course up on YouTube.com/KindaFunny you go watch this Troy Baker episode a good one joint is a good one it's something it's something you should go watch it ever I've seen a lot of praise for I thank you for that when I argued with this that because like Amy was like oh I think",
            "start": 2931.41
        },
        {
            "text": "one joint is a good one it's something it's something you should go watch it ever I've seen a lot of praise for I thank you for that when I argued with this that because like Amy was like oh I think I mean for a good night irreverent choice like see you're making a leap that because she had come flavored gum that that means you're gonna get a **** around a year and Mike I stopped the art and I was like in this world we're Trident or Bubblicious or who have you Juicy Fruit is making come flavored gum block, I mean leading away clearly we've gone we've gone through the looking-glass where come is just a flavor I don't think it's not like when I see when Jen takes out a piece of strawberry gum and has it I'm not like aw man we're getting strawberry shortcakes tonight that's not as it's worth like a flavor in the world eyes if anything it might be a substitute for that ever happen but I'm just going to point out the reason why strawberry gum is a flavor in the world is because",
            "start": 2975.94
        },
        {
            "text": "worth like a flavor in the world eyes if anything it might be a substitute for that ever happen but I'm just going to point out the reason why strawberry gum is a flavor in the world is because strawberries which used to be very controversial right and shameful are now destigmatized anyone can eat a strawberry that's what I'm saying telling you right now is in a world where conflated over yeah that means that **** are just being handed out like **** tissues at a porn parlor that was one of the best I haven't had in a while yeah that if I won this if you already seen it going and see the wheels start spinning of the mud get kicks on the attraction that shouldn't man I did not sleep well last night goddamn upstairs neighbors back and she just walks around to one o'clock in the morning in her stilettos and ah damn it that's justice oh oh it's the next one we got here thought on Tarantino stopping in ten movies it's not happening you can keep directing he loves directing. I'm taking",
            "start": 3018.03
        },
        {
            "text": "in her stilettos and ah damn it that's justice oh oh it's the next one we got here thought on Tarantino stopping in ten movies it's not happening you can keep directing he loves directing. I'm taking us into subscriber only mode this is the second part of three and three one of the benefits of subscribing your chair at Twitch there ya go Nick and Greg, and Nick spot on the Leonardo DiCaprio cast to play Leonardo da Vinci in a biopic film Leonardo DiCaprio is awesome yeah I think for a while people like to hate on them now there I'll come around he's one of the greatest actors of our generation yes he can do anything he wants yes he wants go be big Leo da Vinci good for him my take on it is they I don't think they need to make Leonardo da Vinci may be because they knocked out of the park with Hudson Hawk forgotten Hawk I didn't I remember the poster of the trailer and seemed at one point it's about Leonardo da Vinci they show them at the very beginning a movie and upon it no they may imply",
            "start": 3060.3
        },
        {
            "text": "Hawk Hudson Hawk I didn't I remember the poster of the trailer and seemed at one point it's about Leonardo da Vinci they show them at the very beginning a movie and upon it no they may imply much, yeah and then Bruce was so British wasn't really great it's not okay Sean from Detroit says Greg this is very interesting Greg can John Cena be Shazam uh-huh oh he could he could be contingent my problem there is the fact that uh-huh see I think The Rock is accepted as a real actor right The Rock scene something that's not just a wrestler in a movie Rob in Trainwreck John Cena was in it and ever he's like oh man he was a lot better than I expected him to be but was really known from The Marine and the shitty **** movie uh The Marine was a great movie ok I probably my apologies man I always kept them alive okay how dare you I just don't know that John Cena could totally do what I've always said The Rock need to do Shazam is because his name is I'm Billy Batson I'm a little kid BAM now in",
            "start": 3103.14
        },
        {
            "text": "them alive, okay? How dare you? I just don't know that John Cena could totally do what I've always said The Rock needed to do Shazam is because his name is, \"I'm Billy Batson, I'm a little kid. BAM! Now in this ****, Superman!\" And so The Rock, it would be so great, his eyes wide, \"Oh, me and my, oh, I'm hanging up Batman! This is so cool!\" Cena could do it to them. I don't think he'd do it as well as The Rock. We can do it. He could do it. Cena could do it. At the end, I've watched it just arrive. Barry says, \"Greg, will you guys have a panel at PSX again?\" Don't know yet. The effects, of course, we're talked about in Games Daily. That's they, they've announced these dates before, but they maybe didn't put early bird tickets on sale. We're going to ask for one, and I think that's what will really determine if we go, period. Because I mean, it's up to them if they want to give us an ID license, just you Kinda Funny Games Daily thing there, where either we talk about the news of it or Greg Miller interview Kaczmarek.",
            "start": 3151.8
        },
        {
            "text": "because I mean, it's up to them if they want to give us an ID license, just you Kinda Funny Games Daily thing there, where either we talk about the news of it or Greg Miller interview Kaczmarek, interview different developer, and that's our **** it call piece. I love you, XOXO One. I don't very much. You would like, why not a one-night stay? But you see, W does. There is no, there it is no SmackDown vs. Raw here. No, even if you went too far on what I was in WrestleMania of PSX, let's call SummerSlam. Are you impressed that I knew that many replicator connects pretty? I mean, there was show, but I couldn't happening where I would, you know, K. Well, we see Green Lantern cameo on the Justice League movie. No, that's why has never lead. No, I mean, you are, I mean, what is your definition of a cameo? The trailer already has a verbal cameo worked like no, no Kryptonians, no Lanterns. So no, you, but they're not gonna, it's the same thing as always, where they have cast anybody, not just kind of show up, maybe Robin.",
            "start": 3193.68
        },
        {
            "text": "already has a verbal cameo worked like no, no Kryptonians, no Lanterns. So no, you, but they're not gonna, it's the same thing as always, where they have cast anybody, not just kind of show up, maybe Robin or something, Sinestro. But I mean, even that, I don't think you do, because that movie, they're going to be Batman a few minutes. We're stuff having. But well, maybe at the very end there, you know, Easter, you know, maybe this is the time DC learns that people like **** Easter eggs in their **** trailers or their credits. So put them in there. They do a suicide. So I don't know, should I? But during the credits, one of them is just a green streak coming toward the Earth or whatever, and it's a ring looking for a new owner. Yeah, let it go, Uncle. I can be in. Let Young Top says, \"Nick lifts progress. How much strength have you gained?\" A fair amount. I feel like I'm in a fairly good shape. I've noticed some, some gains, not crazy. I'm not like hulking out yet, but I've progressively lifted more and more weight for the",
            "start": 3243.6
        },
        {
            "text": "of you gain a fair amount. I feel like I'm in a fairly good shape. I've noticed some, some gains, not crazy. I'm not like hulking out yet, but I've progressively lifted more and more weight for the last three weeks. I'm excited about that. And then final question, Mystery As Man 300, \"Greg, will you play or stream Injustice 2?\" I don't want to stream it. I will play it eventually. When? Who knows? I know it's socially awesome. I like the comic book. Can do much more than that, man. There we go, ladies and gentlemen. This has been the Kinda Funny Morning Show for Thursday, August 17, 2017. Thank you so much for watching, whether it be on Twitch.tv/KindaFunnyGames, YouTube.com/KindaFunny, or podcast services around the globe. No matter where you get it, we appreciate it and love you for it. Please, if you have the means, subscribe. Go to Patreon, support us there. Do whatever you can. Your son, you put the subscribe button. It don't cost you nothing. Makes us feel good. Tell your friends, share, do",
            "start": 3286.71
        },
        {
            "text": "please, if you have the means, subscribe. Go to Patreon, support us there. Do whatever you can. Your son, you put the subscribe button. It don't cost you nothing. Makes us feel good. Tell your friends, share, do all that stuff. Have a good times. T-shirt sale, Bit.ly/KFSUMMERSLAM. That's happening. Kevin and Cool Greg are at SummerSlam. Look for them there. Meet up Saturday for them. Come to Kinda Funny Games Daily in the next. It's chock full of news. You move Crackdown ****. So stay tuned for that. Joey is going to read subs. And until next time, I'll probably it says, \"What do we have Kyle set up?\" All Joey reads subs. You're smart. You're smart kid. I like your head. That I'm sorry, blip your spot. I'll stop talking now. No, Crackdown ****. You finish. You're tough. Done. Have a conversation with that. Ah, you know that snotty.",
            "start": 3326.28
        }
    ]
}