{
    "id": 2874,
    "video_id": "tmYmHu3VL7k",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Persona and Vita Live! - Kinda Funny Games Daily 08.02.17",
    "description": "Three new Persona games have been announced, and Greg and Tim are ready to run you through all of the day's news.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1501709150,
    "duration": 4020,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to Kinda Funny Games Daily for Wednesday August 2nd, 2017. I'm one of your hosts, Greg Miller, alongside the pure one at Tim Gettys. Let Tim host. How are you? I'm great. How are you, Greg? I'm good. We have a dynamite show lined up for you. I'm so excited. I'm excited for a lot of things right now, Greg. Let me let me tell you something. Right now, please lay it all on me. Right now, it is it is August 2nd. You just said that. You didn't need to check your phone. Which which means we are 13 days away from Sonic Mania. And let me tell you, I am damn excited for that because well, just because it's been a long time since we've we've had classic 2D Sonic. And man, Sonic Mania, I just feel like they're really going to knock it out of the park. Every they just every like week I think they've been releasing another song from the game, right? And they're just nailing it, nailing it, nailing it, nailing it. I've watched the pre-order trailer probably a",
            "start": 1.53
        },
        {
            "text": "just every like week I think they've been releasing another song from the game, right? And they're just nailing it, nailing it, nailing it, nailing it. I've watched the pre-order trailer probably a hundred times and I am just all about it. Love it so much. And every single thing from the new stages to the old stages to the music to the uh the characters you get to play as. I'm just like, man, this this is going to be the best Sonic game of all time. You're saying that now? I'm saying it now. Best of all. I really think it's going to be I think and it's not even going to be close. Do you think that it's going to rate well with critics as well? Do you think it's going to be one I mean is it going to be that game where people are like finally Sonic's good again all this **** and that's what they're saying and yeah I mean I think I honestly this this is the type of game that it's like I don't care what IGN has to say about it or GameSpot or whatever for years I don't care what you say",
            "start": 47.76
        },
        {
            "text": "they're saying and yeah I mean I think I honestly this this is the type of game that it's like I don't care what IGN has to say about it or GameSpot or whatever for years I don't care what you say pair this is the type of game that I want to hear what people that give a **** about people that have an argument of is Sonic better than three is Sonic CD's past stages better than its future like those are the people that I want to want to hear from you know and I all so far all those people have nothing but good things to say. Of course, the Kinda Funny Games Cast that's up right now for everybody cuz we no longer put it top by topic. It goes up every Monday 9:00 a.m. or you can get it early on patreon.com/kindafunnygames. Uh goes into all the things we're excited about playing this from here on out or whatever. I you said the 15th of course I open up my list here. I have Sonic Mania on there. I'm more excited for Cities: Skylines just because of where I come down. Just a big city fan. I",
            "start": 84.4
        },
        {
            "text": "on out or whatever. I you said the 15th of course I open up my list here. I have Sonic Mania on there. I'm more excited for Cities: Skylines just because of where I come down. Just a big city fan. I want to see what's happening there. I'm a lap Sonic fan. I want to love Sonic again. I like Sonic Mania from what I've played. I am excited to do it. But it's a huge month. Huge month. Mhm. We got to get Greg. I need it. Okay. If you didn't know, ladies and gentlemen, this is Kinda Funny Games Daily each and every weekday here on twitch.tv/kindafunnygames. We record a podcast for you live. Then it goes up on YouTube. YouTube.com/kindafunnygames. Podcast services around the globe. We get nerdy with the news. Get in there deep. Talk about it. Digest it. Find all the video game news stories for you. Show them to you. Talk about them with you. You be part of the show at kindafunny.com/kfgd. If you're watching live, we don't look at the chat because we're trying to make a polished podcast. But you",
            "start": 121.44
        },
        {
            "text": "Show them to you. Talk about them with you. You be part of the show at kindafunny.com/kfgd. If you're watching live, we don't look at the chat because we're trying to make a polished podcast. But you can keep us honest by going to kindafunny.com/youwrong. While we're live, tell us what we're **** up. At the end of the show, we check in on that thread and we correct any of the mistakes we made based on what you said. Remember, Party Mode is up right now for everybody for free at youtube.com/kindafunnygames. It would mean a lot if you went over there, watched it, enjoyed it. You don't have to enjoy it, but just watch it, subscribe to the channel, all that jazz. You will enjoy it, though. It's a good one. Clustertruck. Clustertruck. Nick Scarpino said it wouldn't be good. We said \"Fuck you, Nick.\" And it was good. You know what I mean? Nick's wrong as usual. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. There are four items, a",
            "start": 160.72
        },
        {
            "text": "you, Nick.\" And it was good. You know what I mean? Nick's wrong as usual. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. There are four items, a baker's dozen on the Roper Report today. Number one, there are three new Persona games, Tim. Three new Persona games. Uh, news from Japan has broken that we are getting Persona 3: Dancing Moonlight on PlayStation 4 and the PS Vita in Japan in the spring of 2018. Persona 5: Dancing Star Night on the PlayStation 4 and the PS Vita Japan spring 2018 as well. And then Persona Q, for the 3DS. No release window or any real information on that other than the teaser sites up and it says it has the, you know, steal your heart like Persona 5 graphic. Uh, I was reading NeoGAF a couple days ago and I saw someone talking about uh a website that they saw or a trademark that went up that said Persona R and people were thinking about maybe it was a Persona 5 new version. Sure. Coming out maybe on a",
            "start": 196.32
        },
        {
            "text": "I saw someone talking about uh a website that they saw or a trademark that went up that said Persona R and people were thinking about maybe it was a Persona 5 new version. Sure. Coming out maybe on a different system. Yeah, maybe if they they might be switching things up or something or other. It's interesting. Not here. We're getting some Q's. Yeah. You know what happens after Q, R. There you go. There you go. How do you feel about this? Good. I mean, I'm excited on multiple fronts. Number one, of course, I'm f*** yeah, Vita games. All right, great. Persona Dancing. Persona 4: Dancing All Night. Played. I thought I was going to I love I love rhythm games. I love, you know, the goofy stuff like that. I love Persona. I thought I would be head over heels in love with it. By the end of it, I was like, I'm I'm ready to be done with this. Like, it was just didn't it wasn't inspired in the way I I was hoping it would be. Uh Persona Q on 3DS originally, the you know, the first one jumped in",
            "start": 245.6
        },
        {
            "text": "was like, I'm I'm ready to be done with this. Like, it was just didn't it wasn't inspired in the way I I was hoping it would be. Uh Persona Q on 3DS originally, the you know, the first one jumped in there and played it and I was blown away. I thought and it's it's on me for not at the time paying enough attention when I jumped in I was like oh holy **** this is like a real Persona game like and I'm choosing which you know if I'm running with the Persona 3 cast or Persona 4 cast two a cast that I both love and stuff and the voice acting going through wasn't a fan of first person dungeon crawling and the way they did it but enjoyed the game didn't get super far not and don't go far about it at all so I'm excited about all three of them of course as the internet now knows I'm a fake Persona fan still haven't finished Persona 5 I'm we're going to get to that we have a question about Shame List and all that Uh, but I'm stoked to get more of it, you know what I mean? Like I do",
            "start": 287.76
        },
        {
            "text": "fan still haven't finished Persona 5 I'm we're going to get to that we have a question about Shame List and all that Uh, but I'm stoked to get more of it, you know what I mean? Like I do love Persona, you know what I mean? And I need to get back to five. I know. But Persona 3 I thought was a great one back in the day. Persona 5 I've enjoyed what I've played so far. Persona Q I'm glad they're doing more. I'm pissed, of course, like everyone else, I'm sure in the world as Persona Q, on 3DS. Like, **** put it on the Switch. You know what I mean? Like, and I know maybe kind of sort of they will one day it'll come around. Who knows? Hopefully, they won't. People are getting too hopeful about 3DS ports on the Switch. I I really think so. People thinking that Metroid: Samus Returns is coming to the Switch. I I highly doubt it. I doubt it, man. Like I think that there's certain games that are more platform games. Smash Bros. and Mario Maker. And when it's in the title, Mario",
            "start": 322.24
        },
        {
            "text": "is coming to the Switch. I I highly doubt it. I doubt it, man. Like I think that there's certain games that are more platform games. Smash Bros. and Mario Maker. And when it's in the title, Mario Maker for 3DS, Smash Bros. for 3DS for Wii U. I think those games are going to come over eventually, but it's there's a bunch of 3DS games that I don't think are going to get the port. Pokémon Sun and Moon or Ultra Sun and Ultra Moon. That sucks. Yeah. I mean, my hope here would be like because you're talking about Nintendo core games. Persona Q, not not a Nintendo game. Nintendo's not publishing that. This is Atlus/Sega depending on, you know. Yeah. I mean, that's a valid point, but I still think that if we're going to get a Persona game on the Switch, I think it's either going to be a Switch version of Q, like a new like spin-off, but it is kind of a real game, but it's not a numbered core tile. uh either that for the Switch or it will be a Persona 5 remastered whatever I don't know",
            "start": 361.12
        },
        {
            "text": "version of Q, like a new like spin-off, but it is kind of a real game, but it's not a numbered core tile. uh either that for the Switch or it will be a Persona 5 remastered whatever I don't know that not remastered definitive edition or Switch edition whatever. Well, Chris Leon writes in and says, \"Hey guys, with the announcement of the dancing all night games for Persona 3 and Persona 5, do you think this could give hope to some type of re-release of Persona 3? I never got to play it since I only hopped on the train hype train with Persona 4 Golden. I would even settle for a PS2 to PS4 version with trophies. Just wanted to hear your thoughts. loving the new show. Keep up the great work, Chris. Thank you, Chris. Uh, I want to say yes, I love Persona 3. I, you know, reviewed the PSP version, loved the PS2 version. Um, but I don't know. I I feel like the Persona Train, like as you see, three new games is rolling so far ahead that do they want to go back if they were going to go back and",
            "start": 399.6
        },
        {
            "text": "loved the PS2 version. Um, but I don't know. I I feel like the Persona Train, like as you see, three new games is rolling so far ahead that do they want to go back if they were going to go back and do it, would they go back and do a Persona 4 Golden kind of thing? But I mean, here's the thing. And you look at this and it's like they obviously are still looking back at three because coming out with the when there's the dancing games they did four. The fact that they're doing five and three. Yeah. Three is still in their mind. Three is still valuable to them and something they want to invest time into. Will we get a golden type of PS? But I don't think so because wasn't Persona 3 also on PSP? Yeah. But it was and it was but it was like you know it was another definitive edition, FES edition, but like it was one of those that was criminally underplayed cuz it added in a feature you could be a female protagonist if you wanted. You could do these different things. It was a different game in a",
            "start": 448.0
        },
        {
            "text": "but like it was one of those that was criminally underplayed cuz it added in a feature you could be a female protagonist if you wanted. You could do these different things. It was a different game in a way. And so I would love to see them rematch that. Put that out. Now you point out the fact that they're still doing Persona 3: Dancing All Night. This is where it gets a little murky in terms of like America versus Japan. In Japan, Persona's been a big deal forever. And so for me, like, you know, I love the cast of Persona 3. Some some people do. I don't think enough people in America or the West know about it. Right. In Japan, that's not a problem. The fact that Persona Q had the Persona 3 cast in it, there's an audience that knows them that way. Do they think they need to look back that far? Or is it just the name Persona is so big now that nobody really cares if they Oh, I don't have any experience with Persona 3 cast, so I'm not going to play the dancing game. No, you might know them for",
            "start": 482.96
        },
        {
            "text": "is it just the name Persona is so big now that nobody really cares if they Oh, I don't have any experience with Persona 3 cast, so I'm not going to play the dancing game. No, you might know them for Persona Q. You might know them just from people talking about it. Yeah, I would **** That would be awesome. I would lose my mind if they were like, \"Hey, we're doing a Persona 3 Golden and we're putting it out on PlayStation 4 and Switch and everything else mobile.\" But I mean, isn't the Persona 3 Golden just Persona 3 FES or whatever you said? Like what what is the difference between I'm talking like you know well like HD graphics and this that what they did with Persona 4 Golden where they they brought everything up and they you know they re-up it's not just a straight port if they're going to straight port it. Yeah. You can get the PS2 Classic anytime. Do you think that that's a option when it comes to the PS2 Classics? Aren't they usually first party or No, not necessarily. I mean",
            "start": 521.04
        },
        {
            "text": "to straight port it. Yeah. You can get the PS2 Classic anytime. Do you think that that's a option when it comes to the PS2 Classics? Aren't they usually first party or No, not necessarily. I mean there I mean I think probably the majority Well no Rockstar does all theirs, right? So I mean there's that stuff. Yeah. So, I mean, it's out there, but it's just the thing of like, again, this is another thing we talk about all the time with like what is success to a company like Atlus? Atlus is not EA. It isn't a juggernaut. If you have a limited, you know, number of teams, how many teams do you want out there doing stuff and how much are you going to drum up? Whereas, I'm sure they've got to be they hear the demand. They know their audience. They know their audience f*** loves the Switch. They what I don't know what they're going to do with that and what they're going to do with the Persona series or any series on the Switch, but I'm sure they're looking at that in some I'm sure someone",
            "start": 558.64
        },
        {
            "text": "what I don't know what they're going to do with that and what they're going to do with the Persona series or any series on the Switch, but I'm sure they're looking at that in some I'm sure someone in the You're Wrong section can know this, but is what is the deal with Persona 5? Is there any exclusive deals because I know it's on PS3 and PS4, but could it go to other systems? I don't know. And again, yeah, kindafunny.com/youwrong. I'm not sure if it's ever been publicized that like this is a what the exclusivity rights are and whatever it is, blah blah blah. I'm not sure if it is just like Persona 3 that was on PlayStation, you know what I mean? I don't know what the real breakdown is and I don't know if it's ever actually been stated but you assume it could I don't think I don't think PlayStation gave them any money for like in terms of like we're publish they didn't publish it right so it's it is a independent publisher is an independent developer that put it on there and so",
            "start": 595.76
        },
        {
            "text": "PlayStation gave them any money for like in terms of like we're publish they didn't publish it right so it's it is a independent publisher is an independent developer that put it on there and so what does that mean but then it's like can the Switch run it would it look as great how do you do that I I'd **** that that would be the one for me that would be I mean the Switch has to be able to run it you think so right if the PS4 it's a beautiful game yeah it's a beautiful game but it's like that far pushing the, you know, the envelope on what like 4K visuals or some s*** like that. That would be the one that would be the hardest for me to swallow would be the fact that if it came to Switch then I feel like I would just have to cut and run on the trophies on PS4. Yeah, but I feel like it's not going to come to Switch for a while. Oh, no. It'd be for f*** forever. But again, as I looked down my giant list of games I'm super excited to play that I know I'm going to be able to knock",
            "start": 634.4
        },
        {
            "text": "not going to come to Switch for a while. Oh, no. It'd be for f*** forever. But again, as I looked down my giant list of games I'm super excited to play that I know I'm going to be able to knock out. when am I gonna I I you know I still have being like conservative 60 hours in front of me in terms of my Persona 5 play and it's like when am I gonna sit down and do that? Right? Because now I have these we just talking about on Kinda Funny Morning Show right I have these uh few nights ahead of me of like okay cool and then Cooking with Greggy's filming this weekend so this weekend will be non-stop work no games it's like well I have you know three nights now to play games I don't want to I could put it into Persona or I could play Night in the Woods and get Night in the Woods done. I'm like I want to do that because that's on my List of Shame that I want to get out of. Yeah, that's coming up later, too. Number two, a very interesting story, Tim. Super Mario Odyssey is rated E10+",
            "start": 669.92
        },
        {
            "text": "I'm like I want to do that because that's on my List of Shame that I want to get out of. Yeah, that's coming up later, too. Number two, a very interesting story, Tim. Super Mario Odyssey is rated E10+. This is all this broke via GoNintendo. As they point out, as far as we can tell, this is the first mainline Mario entry to get an E10+ rating from the ESRB. There are some other titles starring Mario that have gotten the rating before, like some of the Mario & Sonic games. I'm thinking that New Donk City portion might play into the game's rating since it features human lifelike humans you can jump on. IGN chimes in. According to the ESRB's rating guide, then E10+ is likely to contain quote more cartoon fantasy or mild violence, mild language, and/or minimal suggestive themes than your garden variety. E. I think it's Daisy. You think it's Daisy? She's suggestive. She's getting suggestive. Well, no, it's that other one in New Donk City, right? Who's the woman? The mayor. Oh,",
            "start": 705.04
        },
        {
            "text": "than your garden variety. E. I think it's Daisy. You think it's Daisy? She's suggestive. She's getting suggestive. Well, no, it's that other one in New Donk City, right? Who's the woman? The mayor. Oh, Pauline. That's That's what I meant. Yeah, Pauline suggested. She's She's wearing Pauline. Uh, I think it's just Pauline. I'm just f***ing with you. I don't know. Yeah. What What do you think of this one? You're the Nintendo. It's It's interesting, but these ratings are so weirdly arbitrary and it's like more more is that what does that word mean? It contains more cartoon fantasy or violence. The difference between an E and an E10+ is the word more. So, I don't know what does that mean for Mario. I think it's a really good um idea that it's because of the New Donk City portion. Like the fact that it is humanlike people makes it less cartoony even though it's cartoon people, right? Ah, they look pretty real. The New Donk City residents look pretty real walking around. Um, I don't know. I",
            "start": 747.44
        },
        {
            "text": "that it is humanlike people makes it less cartoony even though it's cartoon people, right? Ah, they look pretty real. The New Donk City residents look pretty real walking around. Um, I don't know. I mean, this isn't going to affect anything at all. You sure? You don't think this is Nintendo turning its back on its family values? I don't. This is the kind of **** that PlayStation was talking about when they're like, \"We don't want crossplay because we're protecting the kids.\" Nintendo's no longer protecting the kids. I feel like any parent that actually cares about the ESRB, of which there are many. Sure. Uh it's why it exists. Uh I think that they're not going to look at this and and have any pause in being like, \"Well, my kid's not 10.\" Yeah. You know, um it's Mario. How bad is it? And it's Mario. Yeah. You don't You don't think much of it? No, I don't think much of it at all. Do you is I mean, that's the thing is like, is there any Is there a hot take on this that No, I think it's",
            "start": 789.44
        },
        {
            "text": "it's Mario. Yeah. You don't You don't think much of it? No, I don't think much of it at all. Do you is I mean, that's the thing is like, is there any Is there a hot take on this that No, I think it's just an I I agree. It's probably the New Donk City stuff. I mean, I just was my first thought when I saw the headline and it's just like that's fine. It's interesting. It's weird. I is Nintendo is so careful with their IP and their characters. I wonder I'd love to know what their thought is. Did they know that was going to happen? Did they have conversations about it? Was their worry concern about an E10+? I doubt it, but someone there must have. I mean, what are the ESRB ratings nowadays? I didn't know that this was one E, E10+, Teen, Mature, AO. So this because that's the thing is like I would have thought it went E to Teen because the um when I saw the headline earlier for this and it's like Mario Odyssey doesn't get an E rating. The first Mario game to ever not get an E rating. I",
            "start": 832.72
        },
        {
            "text": "would have thought it went E to Teen because the um when I saw the headline earlier for this and it's like Mario Odyssey doesn't get an E rating. The first Mario game to ever not get an E rating. I was like what? It's mature. Cuz if Mario Odyssey got a T, that'd be weird. Like that would change things I think. Not drastically, but it would have an effect. Whereas the E10+, I'm like, \"Did you make that up just for this game?\" No, no, no. It's been around for a while. Remember before there there was that the K-A was the kids to adults. Yeah. Like a long long time ago. I nailed it, but I left out early childhood. There's an EC that you never see on any game. Don't bother to go, \"No, you're wrong.\" I know some games got it before, but Yeah. Yeah. No. So, that makes sense. I wonder how many games get this. E10+. Yeah. I wonder if it's like a common thing. I think Wolfenstein got kidding. Okay. Number three. Last week we talked about Dragon Quest X finally coming to the West",
            "start": 876.64
        },
        {
            "text": "many games get this. E10+. Yeah. I wonder if it's like a common thing. I think Wolfenstein got kidding. Okay. Number three. Last week we talked about Dragon Quest X finally coming to the West in 2018 and then mentioned that it was going to come out in Japan uh that very week. Well, here are the numbers. It debuted last week in Japan and it kicked the **** Did I do it again? You said 10 this time. God, how can I not? I see the X in the eye and I just like my brain doesn't compute. I'm going to start. You know what? F*** it. It's Roman numerals are dead. There it is. Two ones. 11. We're done. Thus be the fate of all Romans. I debuted in Japan last week and it kicked the **** out of everything. Famitsu reports that the RPG sold over two million copies in its first two days of availability. PlayStation 4 and 3DS versions com sold the combined uh million but million 80 000 pretty much uh from July 9th to the 30th. Of that uh a little more than 950 000 were on PlayStation 4 and",
            "start": 917.84
        },
        {
            "text": "then 1.1 million were on 3DS. That's awesome. God is that crazy that the 3DS version came out in a That's right. Why is Persona Q coming to 3DS? That's why. Right. Exactly. Exactly. Well, that's the thing of like, well, first off, shout out to Dragon Quest XI. Like I said, I when it comes around, I want to try and play it. I've heard so much about this franchise and just never have given it a shot. But it's one of those of like, god, 1.1 million for 3DS. I hope that like people see that and like understand that people still want portable systems. And I know in Japan, f*** people love portable s*** cuz they're on the road. They're on the train so much. I hope that like that people see that and understand they need to start putting their games on Switch like this or like Persona Q. I mean",
            "start": 959.68
        },
        {
            "text": "cuz they're on the road. They're on the train so much. I hope that like that people see that and understand they need to start putting their games on Switch like this or like Persona Q. I mean honestly, it's it's just a matter of time when it comes to games like this. Like when people talk about the third parties, they like \"Oh, Switch doesn't have third party games.\" They're talking about EA, they're talking about Activision and those guys, right? Like it's inevitable that Sega and Atlus and um Square Japan are going to start putting their games NIS uh on Yeah, exactly. on the Switch because they've always done that, but I'm just ready for them to start. And again, I understand I know that I just talked about this and to bring it up again like what's the success? I understand that they need to wait for an install base to be there. So, they're not releasing games or putting money behind game, but it's just like got to be exciting if they were like \"We have a Persona coming to",
            "start": 1006.08
        },
        {
            "text": "they need to wait for an install base to be there. So, they're not releasing games or putting money behind game, but it's just like got to be exciting if they were like \"We have a Persona coming to Switch. Here it is.\" It would, man. I think next year is going to be that time, right? I imagine around August next year, we're going to be in a place where a lot of these games are going to start being announced and then it's just going to be an endless stream of Well, then we'll jump left and right and left and right. Exactly. Yeah. Uh why not? Pete wrote in about this story to KindaFunny.com/KFGd just like you can to be part of the show and says Dragon Quest XI just released in Japan and in days it sold already more than million copies. Interesting enough, 3DS version actually outsold the PS4 version. Additionally, it was announced that Japanese PS4 sales just passed 5 million, which means almost 4 years after the launch of the PS4, there are still more Vitas in Japan, parenthesis",
            "start": 1043.84
        },
        {
            "text": "the PS4 version. Additionally, it was announced that Japanese PS4 sales just passed 5 million, which means almost 4 years after the launch of the PS4, there are still more Vitas in Japan, parenthesis Vita crossed the 5 million threshold of in the fall of last year. To say nothing of the million 3DSs and Switch, I'm sorry, of the million 3DSs and the Switch fever sweeping the country. Do you think more developers should be doing releases like Dragon Quest XI? Building two versions of the same game, one for mobile and one for consoles, regardless of how large the gap in graphical fidelity is. Thank you for your time. Why not Pete? Quick question. Yeah. How many Vitas are in the world in the whole wide world? Like sold? Let me I'll have to look that up. I don't I'm not calling. Because so Vitas crossed the 5 million sold threshold in fall of last year. Yeah. Is that to date? Yeah. Uh 5 million last year cuz that sounds wrong. No, it's 5 million forever. Wow. I think let me check how",
            "start": 1080.32
        },
        {
            "text": "so Vitas crossed the 5 million sold threshold in fall of last year. Yeah. Is that to date? Yeah. Uh 5 million last year cuz that sounds wrong. No, it's 5 million forever. Wow. I think let me check how many I mean I'm not up on the the Vita stuff like that, but that that's way lower than I thought there was. I know it didn't sell great, but I even the Wii U was at 13. I'm looking into it. He Okay, answer his question while I look into it. Do you think more developers should be doing releases like I don't know. It it's hard because you see things like uh the Digimon World Cyber Sleuth or the the other Digimon World game that that came out after that and to see the difference between the Vita version and the PS4 version. It's like oh man like it the game is there but it's ugly and it's so empty. And to me, I kind of feel like it's better to just focus on one version and make sure that it is working to the best of its ability on the platform it's on. Like playing through the the Vita game, I feel",
            "start": 1123.84
        },
        {
            "text": "to me, I kind of feel like it's better to just focus on one version and make sure that it is working to the best of its ability on the platform it's on. Like playing through the the Vita game, I feel like would just feel weird and empty just because graphically it is. And even though the gameplay is the same, I just don't like that that experience could be tailored to the Vita and look so much better if there was just a Vita version, whereas instead they're making the PS4 version and they're just like \"All right, what what can we dumb down as as much as possible?\" And I just I personally am not down for that experience. I don't think that that's a good thing. However, it does sell a lot of copies easily. Let me read you a long thing from Wikipedia cuz as with everything, when something doesn't sell well, nobody's really talking about the numbers. Like Sony's not putting on a special thing. So they talk about Sony hasn't, you know, done it. But here, while not giving specific figures, Sony",
            "start": 1175.04
        },
        {
            "text": "sell well, nobody's really talking about the numbers. Like Sony's not putting on a special thing. So they talk about Sony hasn't, you know, done it. But here, while not giving specific figures, Sony stated the Vita sales beat projections in North America in 2014, which it was happy and surprised with, some some even selling falling out of stock. Similar responses have been found in the UK as well. The platform has been has been considered to have sold well in Japan, where it outsold the PS4 in 2015 and reached 5 million units sold in 2016, according to sales tracker Media Create. It also obtained million selling software the same year the Japanese release of Minecraft. By the end of 2015, research firm EDR estimated sales of the Vita worldwide to be around 10 million. Despite the smaller user base, the platform continues to be viable for game releases in 2017 due to the high attach rate of limit software per household. Limited Run Games blah blah blah. In mid 2017, Glickel estimated",
            "start": 1218.16
        },
        {
            "text": "user base, the platform continues to be viable for game releases in 2017 due to the high attach rate of limit software per household. Limited Run Games blah blah blah. In mid 2017, Glickel estimated that approximately 15 million units of the system have been sold so far. So 10 to 15 million sold so far is what the estimates are right now. That sounds right. More than 5 million in Japan in 2016, but it still continues to sell there. Whereas here it doesn't as much cuz you can't find it anywhere. We have to do all these different things. Yep. My thing to this to why not Pete's question here then? Like more I don't think so. No, I don't like it. I'd much rather it be that Yeah, you commit like don't get me wrong, their successes. Dragon Quest Builders did the same thing, right? Where it came to PlayStation 4 and it came to Vita and ran well, did different things, did fine. Uh I don't like seeing I thought it was really interesting. I thought this is one where we talk about not to be keep",
            "start": 1255.28
        },
        {
            "text": "to PlayStation 4 and it came to Vita and ran well, did different things, did fine. Uh I don't like seeing I thought it was really interesting. I thought this is one where we talk about not to be keep beating the dead horse of Shovel Knight, which I've talked about a lot on this show, right, of like be good to your fans. And I think you're on the show, right, where the person pointed out that the reason Shovel Knight keeps releasing the DLC the way it does is because it was all promised through Kickstarter backers. Great idea. Whatever. Fallen Legion, most recent action RPG that just came out, right? They have a PlayStation 4 version and a Vita version and the games are different and they have different bosses and they have different stories and it's like that's cool but it's also really confusing and I don't think there's no way for you I mean we say it on the show and you read it in the PlayStation Blog but the average person who might get interested in that game are they going to go",
            "start": 1292.56
        },
        {
            "text": "and I don't think there's no way for you I mean we say it on the show and you read it in the PlayStation Blog but the average person who might get interested in that game are they going to go to that level like they're going to look at it be like oh it's not crossbuy that's weird and bounce I would think. Yeah. Yeah. No, I mean that that's I feel like whenever it's a different game, you should call it something different. And I I can't think of the example. Fallen Legion I think for the just for the record you're wrong. It has a different colon. Yeah. Fallen Legion colon whatever. Final. Yeah. It's interesting. Uh I mean I think back to like Smash Bros., right? As an example of a game that did it well. Yeah. Uh where Smash Bros. for 3DS versus Wii U where they it was optimized for the system. But it still goes with my argument where Ice Climbers couldn't be supposedly with what Sakurai is saying. Ice Climbers couldn't be in the Wii U version because they couldn't get them to run on",
            "start": 1328.32
        },
        {
            "text": "But it still goes with my argument where Ice Climbers couldn't be supposedly with what Sakurai is saying. Ice Climbers couldn't be in the Wii U version because they couldn't get them to run on the 3DS version. It's like, well, that's an example of this affecting holding one of the versions back. But I mean, Smash ran great on the 3DS and it was a great game on that platform. Uh, but then that's another weird thing where it's like then that version came out first, which they only did to cuz they know more people wanted the Wii U one. Yeah. So, it's like, but when it's day and date and it is a very similar game, I think that Dragon Quest Builders is an example of Yeah, this could totally work. Yeah. But that's not really a um an example of Do you think more graphics being lowered, right? No. Yeah, they look similar. I think it ran better obviously on PlayStation 4 due to processing power. Um, it's a loaded question because I mean it is that thing we can sit here and I don't like it",
            "start": 1365.04
        },
        {
            "text": "No. Yeah, they look similar. I think it ran better obviously on PlayStation 4 due to processing power. Um, it's a loaded question because I mean it is that thing we can sit here and I don't like it, maybe we do, blah blah. I mean, like the numbers don't rely, you know, more than million copies got sold to this game and that granted if you put it on one platform, arguably the people from the other platform would come get it, some of them, but you wouldn't I don't think you'd hit million necessarily. So, it worked for them. They know their audience and that's the different and I guess that's the other big thing about it, right? Is speak to your audience. You have to know who's the most important thing and I think that Smash Bros. is an example of that. Those Nintendo fans are going to buy both versions. release them at different significantly less people buying both versions whereas like when you put them the month and a half apart that they were 3DS came first too when they when",
            "start": 1409.84
        },
        {
            "text": "buy both versions. release them at different significantly less people buying both versions whereas like when you put them the month and a half apart that they were 3DS came first too when they when are we getting a Smash on this **** I don't know it's I I don't know Greg I I'm about this can you ask for it cuz I'd love it this yeah I would have thought that we' we'd have it announced already but I think that that might be one of the franchises they're waiting for a bigger install base cuz they know it's going to sell. So, do you think are you have you given up hope at this point that you're going to get a Smash Bros. Definitive Edition? No, I mean I feel like we're rapidly losing out on the opportunity for that to be announced and for that to come out. Um, the longer we wait, I feel like the more likely it's going to be like, hey, here's Smash Bros., the new Smash Bros., the new Smash Bros.. And I I still don't necessarily think that's a good idea because I think that",
            "start": 1444.16
        },
        {
            "text": "like the more likely it's going to be like, hey, here's Smash Bros., the new Smash Bros., the new Smash Bros.. And I I still don't necessarily think that's a good idea because I think that that is way far out. And just knowing the director of the game and his input on the the franchise and how long he had to work on this latest installment, especially with all the DLC, there's just so much there that I feel like there's still some life left in this version. And I don't know how much better you can get. I know. I know. I just like to be able without having to turn on that goddamn Wii U, play it on the road, enjoy myself. You know what I mean? instead of be tortured. Don't want to be tortured anymore. I got it, Greg. I got it. Give up on the GameCube controllers. Never. Final story on the Roper Report, and this is a short one. Two new Marvel vs. Capcom characters have been revealed for the new game. It's Dormammu from Doctor Strange and Gargoyle's Quest's Firebrand, the Red Blaze.",
            "start": 1493.84
        },
        {
            "text": "the Roper Report and this is a short one. Two new Marvel vs. Capcom characters have been revealed for the new game. It's Dormammu from Doctor Strange and Gargoyle's Quest's Firebrand, the Red Blaze. Let's go. All right. Who the **** this guy? You actually care about him? No, but it's a Capcom thing. I I like in the Marvel vs. Capcom games when they do just get **** out there weird and just get weird and just like like Phoenix Wright being in But Phoenix Wright is cool. He's got a fan base. Yeah. Does **** Gargoyle's Quest's Firebrand, the Red Blaze have a fan base in a fighting game that I just enjoy when they like take characters and they're like \"You know what? Let's make this a thing or when they did the Ghosts 'n Goblins guy and uh stuff like that. I I just enjoy it. I feel like it's fun.\" So yeah, **** yeah. Firebrand. I just feel like it's wasting a slot on something that people would really want. I don't think that's how that works though. Okay, you would say this to all",
            "start": 1534.4
        },
        {
            "text": "fun.\" So yeah, **** yeah. Firebrand. I just feel like it's wasting a slot on something that people would really want. I don't think that's how that works though. Okay, you would say this to all your **** Smash characters, your shirtless Shulks, all your Fire Emblem people, they're all **** great. Not all of them. They're like, \"Hey, you know, for Mario Kart, let's put all Bowser's **** kids in there. Let them all be around the Koopalings. Don't be **** hating on the Koopalings. Get out.\" Guess we did. We didn't need them. We didn't We didn't need them, but it was great that they had them. I would have rather seen other people in there. No, maybe they should have had a little guy named Dry Bones in there at launch. They do. I know. Now they do. Yeah. That's why this is the best version is the defined version. That carrot for you, Tim. Yes. If I want to know what came to the Mogul Shops, where would it go? The official list of upcoming software across each and every",
            "start": 1574.56
        },
        {
            "text": "best version is the defined version. That carrot for you, Tim. Yes. If I want to know what came to the Mogul Shops, where would it go? The official list of upcoming software across each and every platform is listed by the Kinda Funny Games Daily show host each and every weekday. Out today, even though it kind of came out tomorrow, yesterday was is Tacoma out today, but it came out yesterday. Tacoma, cuz Tacoma's official release date was today, but then the Steam version came out yesterday, which is fine. And then Xbox One started publishing last night though, so whatever. Tacoma's out. Uh the final question for the show at the very end after we say all the other stuff. Similar the the book club idea that uh we had about The Last of Us a while back is going to be about Tacoma. So we'll talk about spoilers there. You can save it for when you beat it or come back later. I'm going to talk about on the Gamescast in a less spoilery fashion. Also, we have new dates. Uh GameSpot reports the",
            "start": 1609.2
        },
        {
            "text": "about spoilers there. You can save it for when you beat it or come back later. I'm going to talk about on the Gamescast in a less spoilery fashion. Also, we have new dates. Uh GameSpot reports the Switch version of Monster Hunter XX. Just going to say whatever. I'm going to cover my base. It's not 0 though. Monster Hunter XX. It's I I'm It's Yeah, it's just XX 1010 Double Cross 0 0. It is releasing in Japan later this month on August 25th. Before then, players will have an opportunity to try out the title with a free demo that is coming to the eShop on August 10th. While the demo is strictly limited to the Japanese digital store, the console itself is region free, meaning all Switch owners will still be able to download it. To access another region's eShop, all you have to do is create a new Nintendo account and select the appropriate region. Once the account is created, link it to your console and you'll be able to access that region's digital store using your new",
            "start": 1653.04
        },
        {
            "text": "to do is create a new Nintendo account and select the appropriate region. Once the account is created, link it to your console and you'll be able to access that region's digital store using your new account. The demo will be entirely Japanese, but it will still give players a chance to sample several quests. Good job, GameSpot. I I never thought about that. You know what I mean? I knew how to do it on the PlayStation. Jumping in there for this one. Now, again, me jumping around just saying things talking out of my ass. I'm pretty sure this is correct. And again, you can correct me. I like this show. I kind of wrong. This Monster Hunter game. Yeah. 3DS game. Now come to Switch. Mhm. Completely invalidates that I was making earlier, but also validates the point of other uh publishers can do whatever the **** they want and might do more 3DS stuff. So, so we're saying that Atlus needs to be more like Capcom. Exactly. So, Persona Q, perhaps it will come. Hell yeah, boy. Let's check in",
            "start": 1690.8
        },
        {
            "text": "whatever the **** they want and might do more 3DS stuff. So, so we're saying that Atlus needs to be more like Capcom. Exactly. So, Persona Q, perhaps it will come. Hell yeah, boy. Let's check in with you, the readers. You can be part of the show. KindaFunny.com/KFGd. And again, I complimented you all yesterday. I will comment you again today. Exquisite questions. They are killing it over on this forum. Really good discussion points. I enjoy what's going on. Where do I want to start today though? I wonder where do you want to start? I want to start here. Let me know. Yeah, this is we've talked about the beginning and I reference to the Gamescast. We'll go there. Eric from Texas writes in and says, \"How long is your game's backlog and how you decide what to play next when you finish a game? Mine is now over 100 games from the last and current gen due to sales and free games and I'm not quite sure what how to pick what to play next.\" You're full of **** Eric. And when you have a",
            "start": 1732.64
        },
        {
            "text": "game? Mine is now over 100 games deep backlog, you just No, you got to let some of that **** go. You got to give up on it. My backlog I put on the the list we did for Gamescast, right, that I was talking about today with the stuff I want to play this month. Over here, I have the list of shame. It's Persona 5, it's Nier. It's Wolfenstein. And then I'd forgotten about Night in the Woods. A Night in the Woods there. It's four games that I know I need to play and get my **** together on. That's a good list. That's a That's a real list I could beat. Will I pro? I Who knows? Who knows? Nier I won't beat. I I need to play Nier though. I mean, I'm the type of gamer that I play what I want to play. Y and I don't necessarily feel the need to play other things unless it's highly recommended by people that I",
            "start": 1772.64
        },
        {
            "text": "I need to play Nier though. I mean, I'm the type of gamer that I play what I want to play. Y and I don't necessarily feel the need to play other things unless it's highly recommended by people that I respect or if I want to play with my friends, something that I'm not necessarily into. Battlegrounds is a perfect example. Would have never picked that up. It was talked about so much in my friends groups that I'm like, you know what? Let's give it a shot now. I **** love it. Yeah. Um, when it comes to backlogs, I feel like I have a lot of games and then they just slowly leave where I'm like, \"All right, I'm never actually.\" Um, so I I feel like my backlog's been refreshed recently. Sure. Where a lot of the things that were there are gone. Okay. But, uh, Nier Automata is the one that came out this year that I'm like I'm pissed that I haven't had time to go back and and actually play through. So, I would say it's that just that. Yeah. I mean, I I feel like you you know, you hit the nail on",
            "start": 1809.36
        },
        {
            "text": "this year that I'm like I'm pissed that I haven't had time to go back and and actually play through. So, I would say it's that just that. Yeah. I mean, I I feel like you you know, you hit the nail on the head. I got to be in the mood to play stuff, which is what hurt me with that Persona when I was like, I'm just going to play Persona until August starts. And it was just like I sat down. I'm like, I'm not in the mood to play Persona. I want to play Friday the 13th. I want to play Marvel Heroes and talk to Jen. Like, yeah, I can't force things like that. And that's what **** everything up where it's like then I get into this situation where **** this shit's just sitting around. Yeah. And I mean, just especially looking forward to all the games that we have coming. There's there's so many. It's all about prioritization and like tight kind of ranking how much I want to play things. Uncharted: Lost Legacy coming out is going to make everything else obsolete. I'm not gonna even want to",
            "start": 1850.88
        },
        {
            "text": "It's all about prioritization and like tight kind of ranking how much I want to play things. Uncharted: Lost Legacy coming out is going to make everything else obsolete. I'm not gonna even want to think about it when it gets there. That's that's a showstopper. Everything that's I was in the process of has to be stopped because I want to play through that cuz and also cuz you know what you're getting into. It's a 10-hour experience, right? Okay, cool. I can get that out. It's got a that's there's a finish to that and it's a reasonable finish, you know, where I can sit down and do that over a couple nights. It doesn't feel like it. Everybody's sleeping on it. I keep telling you, nobody's listening. The fantastic Ian writes into KindaFunny.com/KFGd just like you can and says, \"Is now a good time to buy a new Vita?\" See, I'm very excited to play Danganronpa V3 on the Vita in September, but I want to play it fresh. My Vita is now My Vita now is worn and sometimes refuses to charge, but it does",
            "start": 1882.96
        },
        {
            "text": "to buy a new Vita?\" See, I'm very excited to play Danganronpa V3 on the Vita in September, but I want to play it fresh. My Vita is now My Vita now is worn and sometimes refuses to charge, but it does have the OLED screen and I love it to death. I've been eyeing the orange Vita for so long, but I don't know whether to bite the bullet. It is costly and I hate to admit it, but the Vita trickling of games has become a trickling of games. That and my Switch has officially become my Vita 2. So, I don't know how much more Vita I'll play after Danganronpa V3, help. It pains me to say it. I would say do not buy a Vita. Yeah. If there's only one game left and still have a Vita that's kicking, even if it's kicking, sure, you know, on its dying legs. Yeah. Uh I'd say just, you know, just rock with it. However, if you do love your Vita, you should get that orange Vita now because you've been eyeing it and you're going to go back to these games at some point in the future and you're going to want you're",
            "start": 1922.24
        },
        {
            "text": "if you do love your Vita, you should get that orange Vita now because you've been eyeing it and you're going to go back to these games at some point in the future and you're going to want you're going to want a Vita that's that's really nice and really, you know, beautiful and orange. I don't know if you're going to necessarily go back to it, though. I don't know. It's like for me the for as much as I don't like the hinge on the 3DS, like I'm excited that Nintendo sent us one because now I have uh new 3DS family system for when I want to go back and play my 3DS games. I hear you. For me, the Vita isn't about going back. It's about that, oh, here's this new thing that dropped and I want to play that, you know? I mean, like the ones are announcing these Persona games today. It's like, okay, cool. I'm thinking about the future, though. I'm thinking about 10 years. You're talking you're future proofing. I see what you're doing. I see what you're doing. Uh the big thing too is like you're",
            "start": 1965.04
        },
        {
            "text": "cool. I'm thinking about the future though. I'm thinking about 10 years. You're talking you're future proofing. I see what you're doing. I see what you're doing. Uh the big thing too is like you're excited to play Danganronpa V3 which is coming to PlayStation 4. So you don't need to buy a Vita for that. If your Vita like you said it doesn't hold a charge. I it refuses to charge and you love your OLED cuz you're a weirdo. Can't even tell the difference. Look at the OLED or the the orange one. They look great. My pink one looks great. Well the colors are richer. Whatever. Get over yourself everybody. You're playing on a plane. Somebody's farting next to you. Just enjoy your life. Do anything on the Virgin America. I do watch him and I enjoy him and I know and I watch on a small screen. I think it's great. I think he's having a good time. Zombie Lazarus writes in and says \"Hey Nick and Andy.\" Just kidding. Love you Greg and Tim. This is a bit of a crossover question. I recently read",
            "start": 2002.88
        },
        {
            "text": "it's great. I think he's having a good time. Zombie Lazarus writes in and says \"Hey Nick and Andy.\" Just kidding. Love you Greg and Tim. This is a bit of a crossover question. I recently read Spider-Man Blue as it was the required reading for The Kinda Funny Morning Show and who I the story told is basically the most emotionally impactful Spider-Man story there is to tell and there is such a great execution. We've talked a lot about the gameplay of Insomniac Spider-Man but what I want to know is this. What do you guys want out of the story of the game? I'd love to see some good storytelling that I that I feel like the Arkham games never really tried to do. They were definitely more concerned about the gameplay and just having a cool Batman story. Do you think it's too much to ask for actual character development? Thank you guys and keep eating that ass Zombie Lazarus. What do you want? You're you're the biggest Spider-Man fan I know. I un I want to give a shout out to Spidey",
            "start": 2034.72
        },
        {
            "text": "for actual character development? Thank you guys and keep eating that ass Zombie Lazarus. What do you want? You're you're the biggest Spider-Man fan I know. I un I want to give a shout out to Spidey Jay in the chat of Kinda Funny Show. He's the biggest Spidey fan. But uh this Zombie Lazarus thing he he's making some good points here. I I'm going to be honest. I don't expect a great Spider-Man story out of the the game. Um I think what he's talking about about the Arkham games being a cool Batman game I think this is going to be a cool Spider-Man game. Um I think this the story it it'll be fine. It could even be great but it's not going to be one of the best Spider-Man stories ever. Um I feel like video games that are narrative based that have the stories that we'll remember forever there's that balance of the gameplay needs to match that perfectly. I think with Spider-Man there's an idea of exactly what that gameplay needs to be. Yeah. And I feel that gets in the way of a good",
            "start": 2072.24
        },
        {
            "text": "there's that balance of the gameplay needs to match that perfectly. I think with Spider-Man there's an idea of exactly what that gameplay needs to be. Yeah. And I feel that gets in the way of a good story. Spider-Man's stories are quick. When it when he's fighting there's the fight happens a specific way. When he's getting around the city it happens a specific way. Us as players being able to have a more open world and do whatever we want slows the pace down. So I think that emotional story is going to be a lot harder to get across which is why I think they're going to do a really good job of every time we've heer focused. Yeah. And so there will be character development but I don't think it's going to be taking the characters anywhere we haven't seen them go before. Uh where Spider-Man Blue is things where it's like I feel a really rich world of characters that you see different sides to that you might not have seen before. I think this is going to be this is the Peter you",
            "start": 2114.4
        },
        {
            "text": "blue is things where it's like I feel a really rich world of characters that you see different sides to that you might not have seen before. I think this is going to be this is the Peter you know and he's going through the same crisises he normally does. Sure that's a good point. Yeah I think it's gonna be interesting because I feel like we've not been burned but the way Activision handled Spider-Man for so long makes us feel like we know what a Spider-Man game is going to be in some respect. I think this Insomniac Spider-Man obviously looks amazing and can't wait to play it all this different stuff. I feel like it could be though a Horizon Zero Dawn situation where they do tell a narrative and you know it is spaced out in the miss there is the main story path but you still have to travel to them and get those quests and do that stuff where sure I'm swinging to the next uh main story quest but then something happens on the side and I get that and then I go and then eventually",
            "start": 2158.0
        },
        {
            "text": "travel to them and get those quests and do that stuff where sure I'm swinging to the next uh main story quest but then something happens on the side and I get that and then I go and then eventually maybe we turn that corner I'm like **** this story is so good I just want to play through and see it and when you talk to Bryan or Bill or Mike about this game they talk about you know the best Spider-Man stories are ones where it's Spider-Man and Peter like every threat is somehow related to Spider-Man and Peter and that you know the Mr. Negative is all we've seen and they've talked about the fact that Mr. Negative right Spider-Man doesn't call him Mr. Negative and he calls him by his name because he knows him because Aunt May works at his soup kitchens like Peter already has a relationship with him and seeing them and and they talk about the way they handle the Marvel Games stuff is that they want to have it where it's familiar but different. You feel you know you're getting into",
            "start": 2199.36
        },
        {
            "text": "with him and seeing them and and they talk about the way they handle the Marvel Games stuff is that they want to have it where it's familiar but different. You feel you know you're getting into something but they're telling their own story with it. So with that idea of them jumping in and being able to take different villains you know who knows going to who's going to be in this game but they jump in and they take the Vulture, Doctor Octopus or whoever, Scorpion, Green Goblin and it's a little bit different and we think we know what's happening. You know may you know uh Norman Osborn's running for mayor I think in this one. There's enough interesting things there where I'm like I hope and I really do like I I find it interesting you know at the Marvel Games' panel I think or maybe it was when we were talking to them at E3 when we had Bill and Mike on there was a question whether we asked or somebody else did about like who's writing the story and they were like they had",
            "start": 2232.4
        },
        {
            "text": "maybe it was when we were talking to them at E3 when we had Bill and Mike on there was a question whether we asked or somebody else did about like who's writing the story and they were like they had nothing to announce at this time. So they're working I I assume with comic book writers like they know what they want to do and tell. Now granted that happens all the time with every game but for a game they're putting so much into a game they're making an exclusive on PlayStation. A game they don't have a release date for cuz they want to get it **** right. And when Bryan talks about it like I feel like it's more than lip service this time around that maybe they could come out and actually deliver the best Spider-Man story we've ever played in a game. Oh I mean I think it goes without saying we're going to get that. Uh I I just I don't think it's going to be the best Spider-Man story we ever got. I got you. Get in the game. Definitely. No this is going to be good. It is going to be",
            "start": 2266.32
        },
        {
            "text": "we're going to get that. Uh I I just I don't think it's going to be the best Spider-Man story we ever got. I got you. Get in the game. Definitely. No this is going to be good. It is going to be I think at least Horizon levels. Okay. Uh in terms of the quality of the story uh I think it was really good. Remember? I I mean it was it was it was I mean that's my problem with when we talk about stories in games and we've talked about this on Gamescast like two or three months ago. Like I it's really hard to say that these stories are amazing because I feel like there's so many times there's an asterisk or there's like so many things I had picked up for a video game and and Yeah exactly. And it's just like I feel like we should hold them to higher standards than that. And I I feel like when I talk about Spider-Man stories when I talk about Homecoming I don't want to think of it as oh it's good for a Spider-Man movie. I want to think of like how does it compare to Spider-Man comics?",
            "start": 2303.6
        },
        {
            "text": "I talk about Spider-Man stories when I talk about Homecoming I don't want to think of it as oh it's good for a Spider-Man movie. I want to think of like how does it compare to Spider-Man comics? Like what are the pros and cons of it? Like what didn't I like? And video games I think are the same way. Especially when we're talking just about the story elements. Them talking about the cool Batman or like Arkham just trying to have a cool story reminds me of the Neversoft Spider-Man game. Hell yeah. On uh PlayStation 1. And I remember that was the coolest Spider-Man experience I had at that point in my life. Going through and playing and it's like every loading screen being a custom comic book cover that was the level that you were playing. That was so cool. And playing all the different villains just back to back to back and having all the Spider-Man things that you know and love in one game. It happened so fast and then oh and then Venom's there and then Carnage is there and the",
            "start": 2344.0
        },
        {
            "text": "villains just back to back to back and having all the Spider-Man things that you know and love in one game. It happened so fast and then oh and then Venom's there and then Carnage is there and the final boss is Doctor Octopus but he's with like the the Venom or the symbiote **** So it's Monster-Ock like there's nothing cooler about Spider-Man than that game you know? Yeah. Uh so it's like I don't think we're going to get that with this. But I I wonder how many we should do a let's play series like a full long play the whole goddamn thing. Um but yeah man. It's I'm I'm very interested and I do think that it's going to be at worst a great Spider-Man story. Um but I don't think it's going to be anything super crazy mind-blowing. Okay I'm interested. We'll find out. Alex De Bushwhacker Bushabber writes in to KindaFunny.com/KFGGD just like you can and continues the theme of superheroes and says \"Hey Greg and the pure one. It seems like every movie studio is trying to make a cinematic",
            "start": 2378.32
        },
        {
            "text": "writes in to KindaFunny.com/KFGGD just like you can and continues the theme of superheroes and says \"Hey Greg and the pure one. It seems like every movie studio is trying to make a cinematic universe. Could this concept make it to a game franchise? The closest to this in games that I can think of is the Legacy of Kain series and the Darksiders stories of having interconnected stories in the same universe with different protagonists but neither have led up to a massive team up like we've seen in Marvel or the DCU. Would you want to see a game franchise take on this concept? What would be the ideal series for you in your mind? Best regards Alex De Bushwhacker. Very interesting. and him bringing up Legacy of Kain is like \"Oh well that was close to that.\" I think the difference between movies and games is the fact that the like games have different gameplay right? Yeah. So having a teamup game after six different games with different gameplay could be very difficult because",
            "start": 2426.08
        },
        {
            "text": "movies and games is the fact that the like games have different gameplay right? Yeah. So having a teamup game after six different games with different gameplay could be very difficult because what makes those characters special and how they play and why we care about them. I don't know unless they're all very similar style games that that idea would work. Um there's certain genres that it would work in. Fighting games come to mind and that's why things like that work at any point. Uh Mortal Kombat and Street Fighter can finally happen and there can be a game there that makes sense. Street Fighter and Tekken not everyone's favorite fighting game but it would it's easier to wrap your head around that making sense because from a gameplay perspective it does. Thinking about like Nathan Drake hanging out with Tomb Raider. Yeah that could make sense but that's because the gameplay is similar right? Yeah. So I feel like you would need a bunch of that. And I think that we'll never",
            "start": 2469.92
        },
        {
            "text": "Drake hanging out with Tomb Raider. Yeah that could make sense but that's because the gameplay is similar right? Yeah. So I feel like you would need a bunch of that. And I think that we'll never really see that in video games because there's just too many games that are sy. I Yeah I don't think I never say never. I don't think it's a viable thing that you'll see a lot of in video games. I'm sure somebody will do something to this extent one day. It's more the how cumbersome game development is in the way that okay we're doing this right. for you to really do this. It's different studios working on different games. So they're going on this plan on this strategy to release on this day. They've been pushed. Do you push the other game out? What if that game a concept just doesn't work and they scrap that game altogether? What at what point does Studio One finish their game? Studio **** everything up. Is studio one still working on game two in their series but three in the",
            "start": 2512.72
        },
        {
            "text": "and they scrap that game altogether? What at what point does Studio One finish their game? Studio **** everything up. Is studio one still working on game two in their series but three in the world? And then I'm not saying movies are easier to make but you can turn around a movie quicker. It seems for the not much quicker but quicker. You understand? And it's just like I don't and I'm not you know we're not business people. We're not on the inside. I feel like it's just too complicated. Not to mention that it totally hog ties the developer creative team on what they want to do. You know what I mean? I like the nods to other games. I like that in you know Uncharted 3 there's a newspaper referencing The Last of Us. Not that that's in the same universe obviously but in The Last of Us there are Jack and Daxter and Nathan Drake plushes. That's cool. No spoilers at all. And not that it would it doesn't matter. You know Steve Gaynor I asked him on stream once you know is",
            "start": 2558.32
        },
        {
            "text": "of Us there are Jack and Daxter and Nathan Drake plushes. That's cool. No spoilers at all. And not that it would it doesn't matter. You know Steve Gaynor I asked him on stream once you know is Tacoma in the Gone Home universe? Yes it is. But it's not that that's directly tied and there's this giant **** thing that's happening or whatever that revolves around it. That's fine for me. Easter eggs like that knowing that I'm in the universe is good. And those are from same developers which makes it different right? When you know what's happening they're in control of everything. Whereas like when they you know Marvel Games did get announced what they're doing with Marvel Games and Spider-Man and here's the Avengers game and there's rumors of this game and the people are like \"Is that all happening in the universe?\" And they're like \"No we want we don't want to **** around with this and make it that complicated. We want to say hey cool developer here's our cool",
            "start": 2596.96
        },
        {
            "text": "\"Is that all happening in the universe?\" And they're like \"No we want we don't want to **** around with this and make it that complicated. We want to say hey cool developer here's our cool universe and two cool characters. You go play with them. Do what you want to do and we'll come back and worry about it later.\" Yeah. I mean I feel like the it would need to be the same developer. Like the Naughty Dog universe could be a thing. I mean I feel like with what the games that they have now that wouldn't make sense because of just how it works. And I don't again it's just it's once you get to the Avengers part once you get to the team up part that I just don't know if video games are the right medium for that uh in any way that's canon to the series and to the franchise is at that point because it'll be easy to be like yeah and then uh they all just team up and they all just go on this adventure because of time travel and because of the different dimensions and **** but it's",
            "start": 2631.52
        },
        {
            "text": "point because it'll be easy to be like yeah and then uh they all just team up and they all just go on this adventure because of time travel and because of the different dimensions and **** but it's like then it's obviously not a real thing. Then it's just a crossover event. Well I mean and that's one of the things that's so interesting and exciting about Lost Legacy right is the fact that hey two side characters that I personally really **** dug in all the games they were in. They're together and they're going to do this. I'm like \"Oh that's really interesting.\" And I can't wait to see their dynamic and I don't know how well they know each other and are they meeting? It's going to be fun to play. Like I'm interested in that. Whereas like Uncharted through 4 it was like \"Oh I can't I can't wait to catch up with Nate and see what Sully's been doing and is he with Elena or not?\" Like I knew all the questions I was going to ask and what moments I was waiting for.",
            "start": 2667.36
        },
        {
            "text": "\"Oh I can't I can't wait to catch up with Nate and see what Sully's been doing and is he with Elena or not?\" Like I knew all the questions I was going to ask and what moments I was waiting for. Whereas this is like great and I can't wait to see what nod to Nathan Drake and the guys and stuff there are and who actually does show up. Does Sully show up in this? Is there going to be a Cutter moment? Like let's **** get in there and find out. It'll be fun. Ela wrote in and said \"Hey Greg and Tim.\" Yesterday you mentioned that if you found a Switch in the wild you should flip that **** on eBay and make a couple bucks. This is not a nice thing to do and encourages the flipper/reseller mentality that made the NES Classic such a pain in the dick. Presses and of course will apply to the SNES Classic. Don't you think we as gamers should be encourage Don't you think we as gamers should not be encouraging this kind of behavior? Counterpoint. I'm a huge goddamn hypocrite. I waited in line",
            "start": 2702.56
        },
        {
            "text": "Classic. Don't you think we as gamers should be encourage Don't you think we as gamers should not be encouraging this kind of behavior? Counterpoint. I'm a huge goddamn hypocrite. I waited in line at Target at 5:00 a.m. to get a Majora's Mask limited edition 3DS and promptly sold that **** on eBay for more than double the price. Did I feel bad about it? Yes. Am I a terrible person? Probably. Did I make $ 00? Get money get paid. That said what is the most questionable thing you've done regarding buying and selling video games? Ela is taking the ball and running with it which I appreciate. RightInto.com/KFGGD. What I'm saying about putting them on eBay is a supply and demand issue more than I'm not saying put them up for $400 $600 as your starting bid. I'm saying the fact of the matter is there are people here in San Francisco are like I'd love to buy a Switch if I can find one and then I have you guys tweeting at me all the time be like I'm in **** here's the here they all",
            "start": 2737.36
        },
        {
            "text": "is there are people here in San Francisco are like I'd love to buy a Switch if I can find one and then I have you guys tweeting at me all the time be like I'm in **** here's the here they all are my thing. Get those put them out and try to get them out here. Like let the market decide how much you actually make off of them. I remember for my you were talking about my personal experiences with this. I had pre-ordered a PlayStation at the Funko Land in Bloomingdale, Illinois. And what happened is they got their how many they were going to get in and I was in second wave shipment. So I went and camped out at Amayer for 9 hours and bought my PlayStation on launch day. Then a few weeks later like \"Oh your PlayStation 's here at the Funko Land.\" Went and bought it put it on eBay and sold it. And I I sold it for like 0 bucks more. like I didn't make a mint off of this thing but I got it to a gamer who then wanted it. That that that's the way it works. And I think that yeah",
            "start": 2781.12
        },
        {
            "text": "and sold it. And I I sold it for like 0 bucks more. like I didn't make a mint off of this thing but I got it to a gamer who then wanted it. That that that's the way it works. And I think that yeah it sucks that if I if somebody in San Francisco is buying it from somebody in Nebraska there there's going to be a markup on it but that's how this works and that person wants it that badly. I'm not saying necessarily go out there. There's another kid who wrote in he's like \"I'm a poor college student but I see these in Walmart. Should I buy them all and try to flip them?\" I'm like I it's not like flipping a house. I don't think you're going to walk away and pay for your tuition or something but maybe you can buy a case of beer with it. I mean I don't think it's going to be any surprise that I say this if you know me and my history but I this is life man. Like this is the type of **** where it is supply and demand and if you are a schemer that wants to make money there's a",
            "start": 2816.88
        },
        {
            "text": "that I say this if you know me and my history but I this is life man. Like this is the type of **** where it is supply and demand and if you are a schemer that wants to make money there's a great way to make money there. Uh does that make you a good person? Not necessarily. But there's I don't think it makes you a bad person. What Who is Who is the Switch sitting in Nebraska right now on a Walmart shelf along with seven other ones benefiting when there are people out there who like I really want one but can't get one. But it's the the the bringing up the NES Classic. It is the people that just buy them all out immediately as soon as they can just with the sole intention of But I feel like and that's the thing is like I'm talking about this from a level and maybe it's a naive of what I'm suggesting isn't the same as that. This is literally like there are people who can't get these things but they're sitting they're sitting there. No it's not like people in Nebraska are like",
            "start": 2852.16
        },
        {
            "text": "what I'm suggesting isn't the same as that. This is literally like there are people who can't get these things but they're sitting they're sitting there. No it's not like people in Nebraska are like I can't **** find it. Like no there's 17 at the store right now. Like the people who go like it's similar to like when I was you know in into my toys or whatever and you go there and the people who waited in line at Toys R Us and ran in and bought all the toys and ran out. Like that **** sucks. If you're you know waiting in line to get all the NESs that **** sucks. But to you're not waiting in line to get into the Walmart right now to buy it and put it up on eBay. Does this make sense to an extent? It makes sense. I just feel like it's there's that's a weird argument to me just because I feel like that's imagining that people are good people like trying to help out people that can't get them personal personal game but even if it's like again it all comes down to is it worth",
            "start": 2891.28
        },
        {
            "text": "because I feel like that's imagining that people are good people like trying to help out people that can't get them personal personal game but even if it's like again it all comes down to is it worth the trouble like I'm out of the the flipping game like I you made your money and got you made your millions Disney figures or whatever the hell but really though like I did that **** all the time and it's like but that was great because to me that was more uh valuable for my time to make money to do the things I wanted to do uh than doing like working in a **** coffee shop or whatever. U but then it reached a point where it's like I now do what I want to do and I don't need to do that and that happened a long time ago right? Um but it's also as somebody that is a fan of things and collecting things and buying things um going to concerts. I have to deal with scalpers all the time from a negative way of it affects me in a horrible way. However I just make sure that I plan accordingly.",
            "start": 2925.44
        },
        {
            "text": "things and buying things um going to concerts. I have to deal with scalpers all the time from a negative way of it affects me in a horrible way. However I just make sure that I plan accordingly. If pre-orders go up at a certain time I know when that time is. I'm refreshing. I have multiple computers ready and refreshing. Does that suck that I have to do that? Yeah. Do I not get it sometimes? Is it really upsetting that I waited and was there to get the PlayStation 4 10th anniversary thing and I didn't get one? Yeah that sucks. But that's also life and that's how limited quantities of things work. It's supply and demand. And if you really want one you can go on eBay and spend more money to get it. Yeah I hear you. I'm just saying popular opinions. Usually what I would do in this if I saw tomorrow if I go to store today and I see a Switch I'm gonna buy the Switch I eBay would be the last stop. It would literally be like on Twitter, hey friends, I have a who needs this. You know",
            "start": 2967.6
        },
        {
            "text": "I saw tomorrow if I go to store today and I see a Switch I'm gonna buy the Switch I eBay would be the last stop. It would literally be like on Twitter, hey friends, I have a who needs this. You know what I mean? That that's more of where I go. Yeah. But see and that's that's different though. That is just the good person side of it. That's the not scalpy side. That is you're literally buying it for somebody like and you're going to give it to them for retail. Maybe unless Scarp I'll **** him over as hard as I can. You know what I'm saying? Uh Javvisios writes in and says, \"Greg and Tim, nope, that's the wrong one. Sorry. Yesterday the second expansion for Guild Wars 2 was announced. As an active player, I'm excited, but in the general gaming news, it's not a big deal. Do you think games like this still need attention in the mainstream gaming news, or should they just focus on their current player base?\" It's complicated. Sadly, sad to say, is the fact that it's all about how you",
            "start": 3008.32
        },
        {
            "text": "like this still need attention in the mainstream gaming news, or should they just focus on their current player base?\" It's complicated. Sadly, sad to say, is the fact that it's all about how you market it and how you sell it. I'll go back to the example of Marvel Heroes where when Marvel Heroes came out and it wasn't that great of a game. Everybody kind of wrote it off and then they came back and like hey everybody it's Marvel Heroes 2015 and they got a push and they were up at noon and they did all these different things and it was just like yep we **** up initial thing but this is a live service and we're changing and here's everything is different this year. They did it again for 2016 now they have Marvel Heroes Omega. They want to do it that way. That gets them press that gets them news. That gets them clicks. That gets them promotion. if you want to be Guild Wars and hey, we have another expansion, you're just speaking to your player base, which isn't bad, which isn't wrong",
            "start": 3048.88
        },
        {
            "text": "news. That gets them clicks. That gets them promotion. if you want to be Guild Wars and hey, we have another expansion, you're just speaking to your player base, which isn't bad, which isn't wrong, but those are definitely different tactics. It's the same argument we've been making, I feel like, timelessly so many countless times on this show, Shovel Knight. Yeah. Had they called that DLC something else, it would have been picked up by mainstream, it would have been reviewed by IGN uh the day the Switch came out, not a month after. Right. Right. Right. Yeah. And so that's the thing is like I don't know it's another thing of what success these companies. I'm sure Guild Wars which is was a huge undertaking and has a giant audience you know in terms of an MMO. I'm sure it's totally happy with what it has. Obviously it wants more but I don't when you're like when expansions are like we have a new expansion and it's that the dragon of the north has come back like nobody knows what the",
            "start": 3083.92
        },
        {
            "text": "with what it has. Obviously it wants more but I don't when you're like when expansions are like we have a new expansion and it's that the dragon of the north has come back like nobody knows what the **** you're talking about. That's not like going to sell new people to get into it necessarily. I'm sure a few new people be like oh that sounds cool or whatever but it's you got to market a game a very specific way to get people where you want it to go. I mean even with with games that are more contemporary and more in the- moment, like The Division, for example, last year, when they would come out with their they their DLC packs and you'd see articles on GameSpot or wherever Kotaku, like I'd read that and someone that doesn't play the games, I'm like, \"Okay, is this a big one?\" Yeah. Yeah. Or is the next one the big one? Is this just some random how Destiny did their big one, right? And it's escaping me right now. the but you know the big one where it what the wolf one was it I don't",
            "start": 3124.16
        },
        {
            "text": "Or is the next one the big one? Is this just some random how Destiny did their big one, right? And it's escaping me right now. the but you know the big one where it what the wolf one was it I don't know whatever yeah it's I I played it I but anyways where it was like hey you've fallen behind you want to play with your friends we this this is a big deal because it gives you this thing that you can trade in to immediately level up to that point and get into the new content where we've made a story and there are interesting quests d like they sold that as like hey this is a new game this is a new way of the game but if you're just expanding the current game might not be as interesting Tim yes it's time to Squad Up Oh, let's Squad Up. Great. This is where Tim goes over to the one that you're wrong and loads up that. But you wrote in to kindafunny.com/kfgd with your PSN name, Xbox name, Steam name, player name, whatever the hell it needs to be, and told us the game you need friends at.",
            "start": 3160.48
        },
        {
            "text": "wrong and loads up that. But you wrote in to kindafunny.com/kfgd with your PSN name, Xbox name, Steam name, player name, whatever the hell it needs to be, and told us the game you need friends at. I read it here. Other best friends who play that game. Friend you, message you. You all play together and everyone has a hunky dory time. This is Matthew Anderson. He's on Xbox where his name is Trademark Man. All one word. Uh Trademark Man says, \"I have a few achievements I want to unlock that can go **** themselves because they are very meticulous and require multiple people to be in a party to unlock them. I would love some best friends to help me unlock these achievements and help my gamerscore grow to be the highest it can be. Thanks Kinda Funny Games Daily. I never miss a show and it's great. Keep up the great work.\" Trademark Man, if you're playing on Xbox, hit up Trademark Man. Say, \"Hey brother, what games you need help with?\" And then you all party up and you go do",
            "start": 3201.36
        },
        {
            "text": "and it's great. Keep up the great work.\" Trademark Man, if you're playing on Xbox, hit up Trademark Man. Say, \"Hey brother, what games you need help with?\" And then you all party up and you go do it. Squad Up. Never roll. Amigo Forever. Tim is my friend forever. What did we get wrong? This is where you go to kindafunny.com/youwrong while we record the show if you're watching live on Twitch. This is Kinda Funny Games and tell us what we **** up. No editorializing. Vic Darkbomb says Persona 5 and Yakuza 0 are PlayStation exclusives and won't come to Switch or PC. He cites this from dualshockers.com. Cool. Alice confirms that their their exclusive won't come. Uh this is a Twitter conversation with John Harden. Oh, boy. Uh Persona 5 platforms, PS3 and PS4, Yakuza 0 Platforms, PS4. That's it. No Switch, no PC. I don't know about the box label. That's a Sony thing. Thank you very much. Mark says, \"So, is Persona 5 coming with Xbox One? It's amazing how dumb some people are",
            "start": 3243.36
        },
        {
            "text": "PS4. That's it. No Switch, no PC. I don't know about the box label. That's a Sony thing. Thank you very much. Mark says, \"So, is Persona 5 coming with Xbox One? It's amazing how dumb some people are about this stuff.\" And John says, \"I get it. People want to hold out hope that it comes to their platform of choice, but it's just a box label.\" So, I don't know. That doesn't necessarily tell me anything. I said I had never seen or heard anything that he's saying what he's heard. I appreciate that. Looking over the things it see all editorialize too much. You should say here's what you got wrong. Here it is. The right thing. According to GameStop, 158 results for Xbox One at a E10+ rating. Okay. 04 for PlayStation 4 and 38 for Switch. All right. Crash Trilogy has an E10+. I guess it's common for games that you'd assume are just E. Sure. Nobody wants that Bandicoot getting hurt. He gets crates dropped on his head. A counterpoint to the Yakuza and Persona thing Soul is uh Yakuza",
            "start": 3289.28
        },
        {
            "text": "common for games that you'd assume are just E. Sure. Nobody wants that Bandicoot getting hurt. He gets crates dropped on his head. A counterpoint to the Yakuza and Persona thing Soul is uh Yakuza and Persona are on the list of games Sega wants to bring to PC. Okay. So that that list that came out a couple months ago about Sega talking about I vaguely remember and there was they brought Vanquish and Bayonetta. Oh, okay. Yeah. Now I'm with you. Now I'm with you. editorializing just the **** fact. Just right here's the I want it to be fact colon you got it wrong colon tells us you know that's all you got to be that's all you got to be from here on out I'm going to move on okay you interrupt me if you figure something else out that we got wrong deep breath inhale n okay ladies and gentlemen this trophy can go **** itself this is from Vred Greg and Tim I have a submission for this trophy can go **** itself the culprit Patapon Remastered no no it's not the craft nine divine",
            "start": 3337.04
        },
        {
            "text": "this trophy can go **** itself this is from Vred Greg and Tim I have a submission for this trophy can go **** itself the culprit Patapon Remastered no no it's not the craft nine divine items. It's Pata-Almost, which is to lose to a boss when they have less than 5% of health remaining. There are a few problems with this. First, I am a Patapon veteran, so losing a boss battle isn't easy. When I'm in the zone, I feel like I am on the battlefield alongside my eyeball compatriots wildly banging on drums, and they are asking me to break the immersion by throwing them my beats. Second, the bosses have no health bar, so how can I know if it's under 5%. That is a small window to hit. I must have tried this trophy five times and wasted at least 5 minutes and and all right. All right. I can't keep this ruse up any longer. This trophy doesn't need to go **** itself. It's probably pretty easy to get and the platinum is pretty easy in general, but there's just no trophy guys up yet.",
            "start": 3387.76
        },
        {
            "text": "can't keep this ruse up any longer. This trophy doesn't need to go **** itself. It's probably pretty easy to get and the platinum is pretty easy in general, but there's just no trophy guys up yet. So, I've decided why not why waste another 0 minutes experimenting when I can ask the Patapon god Greg Miller for advice on this trophy. Thanks, Volfred. I'll tell you what, as I confirmed yesterday, I consulted on the trophies for Patapon where and all I didn't see him ahead of time. I didn't play the game ahead of time. and they just had a phone call with me for like 30 minutes and tal picked my brain about what I love about trophies. What I love about Patapon, I had said that I like trophies that you get for failing once in a while. There's one for **** up the beat a bunch. There's one for this. You did this Greg kind of uh and when I was playing through the game on my platinum pace cuz I'm the first person in the world to platinum this game even though it almost broke me. Uh this is",
            "start": 3433.44
        },
        {
            "text": "this. You did this Greg kind of uh and when I was playing through the game on my platinum pace cuz I'm the first person in the world to platinum this game even though it almost broke me. Uh this is one that I was concerned about Tim and now you claim to be a Patapon veteran. So, Volfred, you know, on most of the first and even second boss battles, there's just three waves. They run away. You follow them. You run away again. And usually on that third wave, you start to feel it. They're looking weird. Their eyes are all crossed. They feel like they're **** up. They sometimes they drop something right before they're about to die or whatever. You I rolled the dice maybe four or five times on it where I was like, \"This guy seems like he's about to die. Let him kill me. Didn't get the trophy. Didn't get the trophy. Didn't get the trophy.\" Then I was like, \"You know what? I'll figure this out later. I You can replay all the boss battles.\" I was also thinking I could always start a new save",
            "start": 3466.24
        },
        {
            "text": "Didn't get the trophy. Didn't get the trophy.\" Then I was like, \"You know what? I'll figure this out later. I You can replay all the boss battles.\" I was also thinking I could always start a new save and then when I start the game over like three or four fights in or whatever the first boss battle is easy figured out that way. Instead I just kept playing got it naturally. Whereas I got into harder bosses at one point. Yeah. I was **** this guy and I were going toe to toe. It was an epic battle and he beat me and then a trophy popped. I was like that's great. That's fun. See that's what I'm talking about. That's the experience. That's what I'm talking about. Unlike the **** divine nine items. God damn it. God damn the blacksmith mini game. As I mentioned earlier, we're going to spoil Tacoma here in a second. So, I'll sign off now. Ladies and gentlemen, this has been Kinda Funny Games Daily each and every weekday here on a number of platforms. We dive into the video game news, get",
            "start": 3506.24
        },
        {
            "text": "here in a second. So, I'll sign off now. Ladies and gentlemen, this has been Kinda Funny Games Daily each and every weekday here on a number of platforms. We dive into the video game news, get nerdy with it, answer your questions, have a good old time. If you like that, please subscribe to youtube.com/kindafunnygames where a new party mode is up. Or get us on, you know, your podcast services of choice or watch it live. Twitch.tv/kindafunnygames is recorded each and every weekday. Um no matter where you watch it, it would mean a lot if you went subscribe to the other platforms and left a review. coming up on a 000 reviews on iTunes, which is a big number for us. We're 900 and something last time I checked. So, we're right there. If you could go over to iTunes pop and give us one, that'd be great. So, now Tim, thank you for coming on the show. All that jazz. Now, we're going to jump. Greg, don't you touch anything. I'm not really signing off. Now, we're going to talk about this.",
            "start": 3539.36
        },
        {
            "text": "be great. So, now Tim, thank you for coming on the show. All that jazz. Now, we're going to jump. Greg, don't you touch anything. I'm not really signing off. Now, we're going to talk about this. We're going to spoil Tacoma. If you haven't play and not really spoil it, but kind of spoil it. So, go play Tacoma if you haven't already cuz we're I'll give you the full review. If you haven't signed off yet, the Tacoma thing is it's good. I I had fun. I enjoy I enjoyed myself. I don't think it's amazing, but all right, we'll get to it. So, let's spoil Tacoma. Pablo L writes in and says, \"Good day to you, Greg and Andrea.\" People keep they refused to listen to the entire show to see. Now, I didn't say he was going to be on next week. It's it's Andrea tomorrow. So, there you go. Last night, I started Tacoma and I have to say it's incredible. I mean, what a wonderful what a wonderful pool and dart simulator. But, let's get down to brass tax. The story I say the story, man. When it comes to a",
            "start": 3574.0
        },
        {
            "text": "Tacoma and I have to say it's incredible. I mean, what a wonderful what a wonderful pool and dart simulator. But, let's get down to brass tax. The story I say the story, man. When it comes to a good story, you need good writing. That I understand, but also it's about execution. With Fullbright, with Fullbright being a small team, how is it that they and also other independent game studios managed to always get it right, but huge AAA studios seem to get it wrong or come across clumsy in their story in their story stroking more often than not. When studios like Fullbright, Campo Santo, Supergiant Games, and Giant Sparrow, to name a few, announce a game, I automatically make the assumption that I'm in for a great story. So, what is it? Passion, talent, both. Wishcraft. How do these smaller studios narratively narratively always get it so right while AAA doesn't deliver? Great job on the show. Keep it up. And I'll keep living as the Kinda Funny crew does. Eating ass. Good lord.",
            "start": 3608.4
        },
        {
            "text": "studios narratively narratively always get it so right while AAA doesn't deliver? Great job on the show. Keep it up. And I'll keep living as the Kinda Funny crew does. Eating ass. Good lord. Pablo, we mentioned this yesterday on the show. So, a lot of people have now been turned on to the motto Kinda Funny. We eat ass. We eat ass. Yeah. So, I would I mean the why why do independent stories seem to be better than AAA studios? They're smaller. I think it's not even that. I think it's because that's the point. This goes back to what I was saying earlier about Spider-Man. It's just there's the point of Spider-Man gets diluted by the fact that you want to play as Spider-Man and fight and swing around and do that stuff. That takes away from the point of it being the story. All of these games, you mentioned the point is the story. The point isn't the gameplay necessarily. I think you're right. It's that they have a they have a laser focused vision. AAA games, let's I'm going to",
            "start": 3649.36
        },
        {
            "text": "games, you mentioned the point is the story. The point isn't the gameplay necessarily. I think you're right. It's that they have a they have a laser focused vision. AAA games, let's I'm going to throw it. I have no idea if the story will be good or bad, but you can assume it'll be what it is. Assassin's Creed Origins. Assassin's Creed Origins isn't just this guy's story of him in Egypt. It is exploring all of Egypt. It's having cool kills. It's having cool missions. It's having nice things. It's having a good upgrade tree. It's having collectibles. It's having this. Tacoma was, \"Hey, we're going to tell you a story through augmented reality of these people on a ship and then kind of the subversive corporation that's doing some **** in the background.\" My problem with it is that I, and this is a weird one to say cuz I haven't fully fleshed out my thoughts on Tacoma, right? this is the first time I can do it and not worry about spoilers and you're not going to play it. You just don't",
            "start": 3688.08
        },
        {
            "text": "is a weird one to say cuz I haven't fully fleshed out my thoughts on Tacoma, right? this is the first time I can do it and not worry about spoilers and you're not going to play it. You just don't care, right? My thing about it is the fact that I enjoy Tacoma. Uh I like today I opened up GameSpot to gather the news and they had given it a seven. I saw and I read some of Callie's uh thing. I pronounced that right. Callie. Callie. Why do I It's just a weird It's just I'm going to call her K from now on. KP. My girl KP over there had written the review and I read through it and I agreed with what she's saying. Got it to seven. I'm like this is I think where I would be around as well for this. I think it's a good game. It's the problem that at no point did I feel like there was I had skin in the game that there was a threat that there was any like I was just going through and being told the story which is fine cuz it's going through and like the biggest you know comment I think I can give",
            "start": 3725.04
        },
        {
            "text": "game that there was a threat that there was any like I was just going through and being told the story which is fine cuz it's going through and like the biggest you know comment I think I can give that game is that you know halfway through I paused it and Jen had she had been watching but then she got caught up in Instagram or whatever and then she's asked me and I was able to recap it and tell her and I had I had memorized everybody's names. It wasn't just like, \"Oh, this guy is doing that.\" No, I was like, \"Well, you know, Bert's over here doing this, but Nat's doing that, but we know this about Sarah's saying this about N's like, \"Oh, ****.\" Like, I know this and I'm really interested in their threads, but there was no driving force to it because you come on that ship and it's like, \"All right, cool.\" You look at your P. It's like, you know, the crew's been evacuated. It's like, okay, so now I just got to figure out what's going on here, but I know they're all alive or I assumed",
            "start": 3766.52
        },
        {
            "text": "\"All right, cool.\" You look at your P. It's like, you know, the crew's been evacuated. It's like, okay, so now I just got to figure out what's going on here, but I know they're all alive or I assumed they're all alive and spoilers when I get to the end, they're all alive. And it was just like, well, what what was like there was no driving force here. There was no fear in Gone Home, it was what the **** going on? Is this house haunted? Did they kill each other? What's going on in the attic? Why can't I get in the attic? This is creepy. Blah blah blah. There was none of that here where this one was like by the time I got to the end and like you get into the ship and you put Odin back in. And then it's like the reveal was like I was uh you know, I'd taken this mission acting like I was going to be this corporate lackey and clean up their mess. But I get back in, I'm actually like part of the AI Liberation Front where I put him in and I'm like, \"We're going to take you off and be\" and I",
            "start": 3804.08
        },
        {
            "text": "to be this corporate lackey and clean up their mess. But I get back in, I'm actually like part of the AI Liberation Front where I put him in and I'm like, \"We're going to take you off and be\" and I was like, \"Oh, I didn't really I didn't care, I guess, enough about Odin to really be like, \"Oh, thank God they're saving him.\" I was like, \"Oh, man. How's this going to wrap up? What are they going to do?\" But I cared way more about the people, but I was never worried about the people because of the way the game was set up. Yeah. So, it was this interesting of like it succeeds on a story front, I think, because I cared about all the characters, but it fails in a story because I guess I I missed that the over the real point of the game was going to be this corporation's trying to **** you guys and we're trying to save the AI and I didn't get that away from it. I was more interested in all the people like when there's this explosion and Nat and Bert get knocked down and they I was like",
            "start": 3839.2
        },
        {
            "text": "and we're trying to save the AI and I didn't get that away from it. I was more interested in all the people like when there's this explosion and Nat and Bert get knocked down and they I was like, \"Oh **** is one of them about to die?\" No, they're fine. Oh, well, if we put Nat in cryo, she might die. No, we're not going to do that. She's fine. Like, all right, whatever. whiny ass dude over here with his kid or whatever. I'm like, I don't care about you. You suck. You didn't want to get get into cryo faster. You know what I mean? But again, to the point, I'm way more invested in the story that I have problems with than I am in most AAA stories with the exception of like the entire Uncharted series or something to that effect where I find characters and things I love about. But even that, I'm like, well, Lazar Lazarovich is a dumb boss. That's the thing is, I mean, man, it's so hard to talk about this stuff because plot and story are different things, right? M like when story brings",
            "start": 3875.92
        },
        {
            "text": "I'm like, well, Lazar Lazarovich is a dumb boss. That's the thing is, I mean, man, it's so hard to talk about this stuff because plot and story are different things, right? M like when story brings into consideration all like character development and characters and liking the characters. So it's like it sounds like Tacoma did have a good story. It didn't have a good plot because at the end of the day it's like the narrative of what's happening this then this then this then this then this that wasn't satisfying because of the end having well having the ending spoiled. The game I feel like spoils it end cuz like I'm there to figure out what went wrong on the ship and why it's happening and you get to the end like all right well that wasn't like the most crazy thing or whatever. Great whatever. Yeah. I don't know. So yeah, I think it's that well you nailed it in a much more concise fashion of just the fact that the point of these games you're talking about from an independent level is",
            "start": 3908.88
        },
        {
            "text": "Yeah. I don't know. So yeah, I think it's that well you nailed it in a much more concise fashion of just the fact that the point of these games you're talking about from an independent level is the story. The point of Assassin's Creed, Spider-Man, whatever is a million other things and mainly that you're having fun playing the game and doing a million different things. Yeah, the story just helps to push those elements to be even more fun, right? Yeah. Ladies and gentlemen, I've already done the outro. This has been the Kinda Funny Gamescast. Thank you for watching. Uh, we're going to pop over. Or if you're watching live right now, pop it. We're going to end it, of course, for the YouTube podcast folks. Thanks for listening or watching, and then I'll do the subs and tips we missed during it. But until next time, I'm all choked up over Tacoma and B. No, but it's been our pleasure to serve you.",
            "start": 3944.8
        }
    ]
}