{
    "id": 2932,
    "video_id": "Tz40Va7bCvE",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Andrea Rene"
    ],
    "title": "Xbox One X Pre-Order Success - Kinda Funny Games Daily 08.24.17",
    "description": "Andrea and Greg talk about Xbox One X being ahead on Amazon and one fan's letter about why he's always on Xbox.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1503608688,
    "duration": 3510,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to Kinda Funny Games Daily for Thursday, August 24th, 2017. I'm one of your hosts, Greg Miller, alongside the busiest lady in the business, Andrea Rene. What's up, Greg? Wow, there it is. How you doing? I'm good. I've missed you. It's been a week since we've done this show together. I don't know what's happening in your life anymore. I know you, I like, I liked your comment or voice Tuesday. I always enjoy getting to watch it as from the cheap seats, get to see what happens, happened over there. Yeah, it was fun. We had a good time. I got a little heated in the middle, but it was alright. That's what's supposed to happen. Yeah, you're allowed to differ opinions, indeed. Yeah, yeah. I sometimes I forget that he's just like such a Nintendo fanboy. Sure, of course. And then he reminds me instantly and I'm like, oh yeah, that's right, right. You're such a corporate apologist at my station. And Ryan McCaffrey's come into the Gamescast today. He's an Xbox, and that's how it all shakes out.",
            "start": 0.28
        },
        {
            "text": "me instantly and I'm like, oh yeah, that's right, right. You're such a corporate apologist at my station. And Ryan McCaffrey's come into the Gamescast today. He's an Xbox, and that's how it all shakes out the video game industry. If you then, yeah, we all have our biases, I guess. Are you good? You've been good? What's been happening? Yeah, I'm great. Just a lot of busy work prepping for PAX. We had our big announcement this morning. We are partnering with Square Enix and Life is Strange: Before the Storm, that developer Deck Nine Games, to put on a really fun launch party for Episode 1. When is that? It is Friday, September 1st, from 6:00 to 9:00 p.m. Okay, that this fun little bar in Seattle called Unicorn. Nice. We're going to have mini corndogs. Yes, you will. That's what Unicorns would do. That's what they hold drinks. It's going to watch a PAX stuff happening. So your party's on Friday, September 1st. Saturday at 5:00, the What's Good Games panel. That's correction over there. Saturday at 8:30. Now I'll be actually in town. I'm",
            "start": 50.79
        },
        {
            "text": "gonna watch a PAX stuff happening. So your party's on Friday, September 1st. Saturday at 5:00, the What's Good Games panel. That's correction over there. Saturday at 8:30. Now I'll be actually in town. I'm coming in early now and doing a Batman Telltale Crowd Play. So you can come see that, play Batman with me. Sunday at noon is Danny's Witcher panel. Sunday at 5:00 is my Cancer panel. So, uh, all the Kinda Funny Games. And Friday at 1:00 p.m. I'm hosting the Life is Strange: Before the Storm panel in the afternoon. We're going to be doing a playthrough of a section of the game and there will be some new game information revealed, episode release date. And they actually haven't told me what the information is. Fix the trophy that's willing to attack with a new fixture. Coolest there, Greg. It asked the question on Friday, everybody. I need the plants. If you're going to PAX, I have a list of questions. I will send one of you that you can go there on Friday and ask Andrea during this panel. Other housekeeping of",
            "start": 93.06
        },
        {
            "text": "on Friday, everybody. I need the plants. If you're going to PAX, I have a list of questions. I will send one of you that you can go there on Friday and ask Andrea during this panel. Other housekeeping, of course, there's a new Kinda Funny Doodle up on Patreon.com/KindaFunny. It's pretty amazing. I think it'll be up for everybody tomorrow on YouTube.com/KindaFunny. Kinda Funny will be at GameStop Expo this Sunday. We will be live-streaming developers and their games from the show floor. If you're there at the Expo, come hang out in the booth, watch us do it. If you're at home, feel free to watch Twitch.tv/GameStop or you can go to Kinda Funny Games where we'll be hosting it. But you know, sometimes if it's mobile, it doesn't display properly, whatever. It'll be out there all day Sunday. You can watch us play games and do stuff like that. And then as I mentioned, Ryan McCaffrey on the Gamescast today. If you want to watch live, Patreon.com/KindaFunnyGames or wait till it's",
            "start": 139.38
        },
        {
            "text": "Sunday, you can watch us play games and do stuff like that. And then as I mentioned, Ryan McCaffrey on the Gamescast today. If you want to watch live, Patreon.com/KindaFunnyGames or wait till it's free on YouTube on Monday. Cause just like this show, there's a lot of ways to watch it. If you didn't know, this is Kinda Funny Games Daily each and every weekday here on a variety of platforms. We run you through the nerdy video game news you need to know about before jumping into your questions, comments, and concerns. Remember, you can catch it live as we record it on Twitch.tv/KindaFunnyGames. But the only way to talk to us is to keep us honest, go to KindaFunny.com/You'reWrong. Let us know what facts we screwed up, no editorializing. So at the end of the show, we can set the record straight, get it all out there. Here's what's happening. If you want to watch it later, YouTube.com/KindaFunnyGames or podcast services around the globe.",
            "start": 176.7
        },
        {
            "text": "at the end of the show, we can set the record straight, get it all out there. Here's what's happening. If you want to watch it later, YouTube.com/KindaFunnyGames or podcast services around the globe. No matter where you watch it or listen to it, thank you so much for your support. We couldn't do without you. For now, let's begin the show with what is and forever will be the Roper Report. News. There are four items on the Roper Report. A big curse doesn't thank you, Kevin. No bigger. He's, yeah, yesterday he did a very pondering one. Yeah, I heard he's switching up. He's a wild card over there. Like number one, Assassin's Creed Origins is crossing over with Final Fantasy XV. This is via the Ubisoft blog. Quote, in what started almost three years ago at an informal meeting during Tokyo Game Show to express admiration for each other's work, the Assassin's Creed and Final Fantasy XV development teams have announced a collaboration that will result in the two franchises paying homage to each other's gaming",
            "start": 215.22
        },
        {
            "text": "for each other's work. The Assassin's Creed and Final Fantasy XV development teams have announced a collaboration that will result in the two franchises paying homage to each other's gaming universes. The collaboration kicks off on August 30th's Final Fantasy XV. Players who have obtained the Dream Egg from the Moogle Chocobo Carnival, you dorks, will be gifted a very familiar Assassin outfit for Noctis. The very next day, August 31st, will be the release of the free Assassin's Festival DLC for Final Fantasy XV. The town of Lascaux A Wall will transform for the event with signs and banners signaling the arrival of the festival and new activities will be available for players to participate in. It doesn't end there. The Assassin's Festival will have some additional themed items and features, including another outfit from Assassin's Creed, along with abilities that enable Noctis to explore more like an Assassin and even use some of the Assassin's well-known abilities. How's that",
            "start": 261.93
        },
        {
            "text": "and features, including another outfit from Assassin's Creed, along with abilities that enable Noctis to explore more like an Assassin and even use some of the Assassin's well-known abilities. How's that strike you? Enjoy your name. Cool story, bro. Did you ever, did you connect with Final Fantasy XV though? No, but I'm not a Final Fantasy player. I've said that far and wide. If you guys listen to, you know, the What's Good Games podcast, you know that I am and not the Final Fantasy person on that show. Me, Alexa, having a breakdown on Twitter about all the Final Fantasy stuff happening to me. We talked a lot about the Final Fantasy mobile game on the show that goes live tomorrow morning. So it's, um, which we're obviously going to talk about, I think, in the next news item. But, um, you know, this is fine. They've done crossovers before. Assassin's Creed has done stuff. And I mean, it wasn't there like N7 outfit and Final Fantasy at one point? I'm thinking either N7 and Dragon Age. Remember there was all the",
            "start": 309.63
        },
        {
            "text": "done crossovers before. Assassin's Creed has done stuff. And I mean, it wasn't there like N7 outfit and Final Fantasy at one point? I'm thinking either N7 and Dragon Age. Remember there was all the Dragon Age. It was different. It was a different publisher. Somebody please go to KindaFunny.com/You'reWrong and tell me which other publisher was in. But like, there's been, there's been lots of crossover stuff before. So I like it. It's, it, first time, I think it's a cool nod. I like the idea that it is just, hey, these developers met at a conference. We're like, oh, this is cool. And then they started think, catching an idea to do it. I like that it's like, it's free DLC to jump into if you're still playing Final Fantasy or you want to know the reason to play Final Fantasy. And then it's just cool to see the walls like that fall down and not be all about competition or Ubisoft Foursquare, something to that effect. Yeah, absolutely. And I saw some people in the comments on some of these news stories saying that",
            "start": 357.54
        },
        {
            "text": "like that fall down and not be all about competition or Ubisoft Foursquare, something to that effect. Yeah, absolutely. And I saw some people in the comments on some of these news stories saying that they actually are, you know, motivated now to pick the game back up after, you know, maybe putting it down and I'm playing since other DLC has come out or maybe not if somebody, something cool to jump into to use and get into if they are a big Assassin's Creed fan. Alex wrote into KindaFunny.com/KFGD, just like you can, and says, hey guys, with today's announcement of Assassin's Creed crossing over with Final Fantasy XV, what is your favorite crossover of series and what is a crossover you'd love to see? Mine, of course, my favorite game of all time, Metal Gear Solid: Peace Walker. And then it crossed over with Monster Hunter. And that was just fun. That was just awesome. The fact that there was alt and weird content for you to go through and have Snake fighting these giant monsters and doing all",
            "start": 397.46
        },
        {
            "text": "over with Monster Hunter. And that was just fun. That was just awesome. The fact that there was alt and weird content for you to go through and have Snake fighting these giant monsters and doing all these different things. Well, Big Boss technically, be no same. I don't think I have a favorite crossover. Your monster, I know. Well, major, maybe Mario + Rabbids Kingdom Battle might be it. But I haven't gotten hands-on time with it outside of E3 yet. You think of anything when he says like, what would you love to see for a crossovers or something that springs to mind? Most of my dreams came true with PlayStation All-Stars Battle Royale. You know, there were the Patapons just live in a, you know, come on now. I mean, I would love to see some kind of Mass Effect tower defense game. Did you, did you ever play Monsters on Monsters on PlayStation? Yeah, yeah. So like, imagine that, but like with like little Reapers. That'd be awesome. That'd be really cool. That would be awesome. Yeah, okay, that's a good one. I mean,",
            "start": 441.53
        },
        {
            "text": "Monsters on Monsters on PlayStation. Yeah, yeah. So like, imagine that, but like with like little Reapers. That'd be awesome. That'd be really cool. That would be awesome. Yeah, okay, that's a good one. I mean, that's not a crossover that will ever happen. Yeah, but you know, if we're making like a, just like, well, Mass Effect, Mass Effect, now we can do whatever we want with it. Yeah, sad. And this is what it's become. No, hey, it's true. No, I read the statement earlier. I find them always move on. Number two on the Roper Report. There's a chance. So Final Fantasy XV coming to Switch. This is via IGN where the Dark Knight of News, Andrew Goldfarb, filed this report. Square Enix has hinted at a potential future for Final Fantasy XV Pocket Edition, a Nintendo Switch. Speaking to IGN at Gamescom, Final Fantasy XV director Tabata didn't rule out the possibility of the recently announced mobile version coming to the Nintendo console. Quote, there is certainly a chance. It's certainly not zero, Tabata told IGN when asked about a Switch",
            "start": 484.6
        },
        {
            "text": "rule out the possibility of the recently announced mobile version coming to the Nintendo console. Quote, there is certainly a chance. It's certainly not zero, Tabata told IGN when asked about a Switch version. Obviously, we'd have to think about what the meaning and what the significance of bringing this to the Switch would be. You know, whether people would want to play it and whether it would be the right thing to do for our team. Tabata added that as it stands on mobile, Final Fantasy XV Pocket Edition doesn't actually have controller support. As such, it, I'm sorry, as such, if it did, if it does eventually come to Switch, Final Fantasy XV Pocket Edition may potentially have to be one of Switch's handheld only titles, rather than alternating between docked and handheld mode like other Switch games. This isn't the only time this week the Tabata hinted at a version of Final Fantasy XV coming to Switch. Speaking on Twitch's Gamescom live show, Tabata said, quote, we very much do want to move out and do as",
            "start": 530.85
        },
        {
            "text": "isn't the only time this week the Tabata hinted at a version of Final Fantasy XV coming to Switch. Speaking on Twitch's Gamescom live show, Tabata said, quote, we very much do want to move out and do as much as we can with the game, with the franchise. There's another certain console out there people may be thinking of. It sounds a little bit like you guys, your name Twitch. I think I'll just leave it there. Everyone of the Final Fantasy XV, they love this specific console that sounds a lot like Twitch. Maybe about something about that in the future. Just say Switch, Tabata. I mean, he can't say, cause then it's an announcement. He said about IGN. I mean, but I mean, like, he can't outright say we'd like to bring it to Switch. Sure, this is fine. So we, I was talking about this with, with Alexa Ray about like, okay, let's talk about this game. It's ten episodes. The first episode is free. How much are each of these episodes gonna cost? And specifically for mobile, like, what does that price have to be? But if we're",
            "start": 573.96
        },
        {
            "text": "let's talk about this game. It's ten episodes. The first episode is free. How much are each of these episodes gonna cost? And specifically for mobile, like, what does that price have to be? But if we're talking about bringing it to Switch, it's, it's kind of a different conversation. I don't know how I feel about it. I kind of think that it's, it's disappointing because I'm sure that's not what fans want, right? They want Final Fantasy XV, not Pocket Edition. They want a real game. We don't know what these episodes are gonna look like, how much other story they're cutting out. Clearly, they're scaling way back on gameplay mechanics. If you can, if you seem to know a little bit more me, I'm not even familiar with Final Fantasy XV Pocket Edition. Is, have you seen any of the screen? You, so you haven't seen any of the screenshot? Totally missed be passing by. Okay, so it basically is like a chibi version of Final from what I've seen from the road style. But we haven't gotten any like hands-on impressions or gameplay, you know,",
            "start": 623.4
        },
        {
            "text": "totally missed be passing by. Okay, so it basically is like a chibi version of Final from what I've seen from the road style. But we haven't gotten any like hands-on impressions or gameplay, you know, sure. Gamescom. Yes. So revealed like Gamescom by Square Enix, Final Fantasy XV Pocket Edition retells the story of the original game over 10 downloadable episodes with all episodes launching simultaneously. And as a bonus, the first episode will be free of charge. So I haven't been able to find anywhere how much these episodes are going to be per, sure, per episode or if there's gonna be a season pass. You gotta be, well, you buy them all and what that price is going to be. And so there's a trailer here and it seems from the game plan to combat, it will remain roughly the same. Obviously, it's tweaked and simplified for mobile. Yeah, of course. Oh, I don't know what that means though, roughly the same. Because the game play in Final Fantasy was pretty extensive. It was awesome. That was my favorite part of it was",
            "start": 666.92
        },
        {
            "text": "for mobile. Yeah, of course. Oh, I don't know what that means though, roughly the same. Because the game play in Final Fantasy was pretty extensive. It was awesome. That was my favorite part of it was getting into the battles and actually using the system and shooting around the map and killing. There's just so much more to do than just that, right? I mean, there's like the fishing and a driving, the photo day. Yeah, on the photo taking. Oh my God, you're right. But like, so it's gonna be interesting to see exactly how much they're leaping in. I mean, when they say retells the story, yeah, with quotation marks, like, what does that mean? Sure, sure. How much of a story are you leaving out? Yeah, yeah. So interesting. Is this what Switch players want? Is what I would like to know. I mean, I feel like Switch players, being one of them, are just happy to see people trying to bring things over and supporting the system. Exactly. I mean, I'm sure that I know that there is a contingent of Switch players who want it to be, yeah, why",
            "start": 714.91
        },
        {
            "text": "of them are just happy to see people trying to bring things over and supporting the system. Exactly. I mean, I'm sure that I know that there is a contingent of Switch players who want it to be, yeah, why is it Final Fantasy XV while looking? The system is way too big for exactly to run. This is what we've gotten. This is why you're not gonna get Mass Effect and all these other games poured it over to with this. That's going to be. But okay, at least they're trying here. They're doing something. And I'm sure people like Alex are ready to eat it up. There were chibi versions. Anything she'll be buying it. Impossible. And on new play coming up. Number three, GameStop Australia is trying a physical game subscription service. This comes via GameSpot. Swap & Play is a new service. We're trip, we're trialing in South Australia that allows customers to grab any pre-owned game they want and swap it over as much as they like in store. And EB Games spokesperson told GameSpot for basically zero bucks Australian a month.",
            "start": 757.82
        },
        {
            "text": "Australia that allows customers to grab any pre-owned game they want and swap it over as much as they like in store. And EB Games spokesperson told GameSpot for basically zero bucks Australian a month. The service allows players to borrow one game at a time. And EB Games states that the Swap & Play program gives, I'm sorry, will give customers access to the entire library of pre-owned games. As long as we have the game, they can play it. Quote, whether they finish it in a day or decide they don't like it, they can grab something new whenever they want. There's no limit to how many times they can swap. We've created Swap & Play to add value to our regular customers, especially parents over school holidays. It's an, it's not unusual for families to be in our doors finding new games to play. Swap & Play allows for a hassle-free and more affordable shop. Fascinating. It's like GameFly, but in person or over the mail. Exactly. Well, I mean, when I was growing up, I remember either I could drive, so it was either",
            "start": 801.07
        },
        {
            "text": "allows for a hassle-free and more affordable shop. Fascinating. It's like GameFly, but in person or over the mail. Exactly. Well, I mean, when I was growing up, I remember either I could drive, so it was either a summer in high school. It was PS2, Britney's Dance Beat. So no, it would have been summer in college where Blockbuster Video, this, where you could go in and swap what have won out of it for zero bucks or whatever it was. I could go in there and get it. And I went down. My goal was to go down the line of PS2 releases. And I just went A to Z. And I forget how deep I got, but I got through Britney's Dance Beat for sure. But I bring home the B. I think this is great. They have, you know, giant bins of pre-owned games at these stores. And why not let people test them out and play them? Well, it's such a, you have to live close to a store in order for this to really make sense for you. Sure. Well, I mean, yeah, cars or whatever, you know, 10 or 15 minutes. I'm saying that, yeah, you're still in the same. But that's close. It's",
            "start": 844.36
        },
        {
            "text": "close to a store in order for this to really make sense for you. Sure. Well, I mean, yeah, cars or whatever, you know, 10 or 15 minutes. I'm saying that, yeah, you're still in the same. But that's close. It's such a cool aggressive move by, you know, EB Games. But it's GameStop. Or spot, nope, stop, stop, GameStop in there. You know, war to stay relevant. I don't mean that as an insulting way. I mean, in the fact of with digital games and GameFly and all these things, how do you get people to come in the store for a while for zero bucks? Now you get to walk in. And when you walk in to get in the next game, you, the newest release, you're probably asked if you want to pre-order this. You probably worry about that. Or you're buying a T-shirt or custom games or Pops. Now are your exactly versions of chibi. You know, all the crap you got in there. When you're gonna house any of this here. Yeah, but no, it's actually a really fascinating idea. Chris Brown writes in to KindaFunny.com/KFGD and says to the foremost gaming",
            "start": 895.18
        },
        {
            "text": "you got in there when you're gonna house any of this here. Yeah, but no, it's actually a really fascinating idea. Chris Brown writes in to KindaFunny.com/KFGD and says to the foremost gaming hosts, what are your thoughts about Swap & Play? We've already covered that. Would you like to see a similar service introduced in North America or around the globe? Do you think that a subscription service is the way to go as opposed to a per game rental fee? Much-loved, Chris. I would be, I, I know for sure, obviously, there's, they're gonna have to figure this out. And it's clearly they're testing this program in a smaller market to see how it all works. I really don't see a downside right now, having no facts, figures, or how it's gone for us and information that they wouldn't do this in America. Because it is that thing of like, what a brilliant idea to get people to actually go into a GameStop and come back to a GameStop. And once a week, we'll say, if not more, right? I think it's good on the sense that",
            "start": 933.94
        },
        {
            "text": "is that thing of like, what a brilliant idea to get people to actually go into a GameStop and come back to a GameStop. And once a week, we'll say, if not more, right? I think it's good on the sense that, you know, GameStop would be able to get more life out of these used games that are sitting on the shelf. And also people that maybe don't want to pay full price can try something out. I think the problem is ultimately going to arise from availability of stock of popular games, right? How many used copies of like the brand-new game are they going to have within, you know, like a month of launch? Yeah, so that's gonna be an ongoing issue for them to kind of figure out how to manage. But and they figure the other big problem I would see is the fact that let's say you have three pre-owned versions of game X. If those are all out in this program, what happens when somebody comes in and wants to buy premium pre-owned version of game X? Yes, that's a also a good point. I have to imagine this program is going",
            "start": 977.14
        },
        {
            "text": "to have something similar like GameFly did as, hey, did you like playing this? Well, you can pay this much at, run it. Don't, I'm sure it'll be an online thing. Don't even bother bring it back to the store. Just put your credit card in right now and you keep it. Hang on to it. Exactly. It's a really cool idea. It's a very interesting idea. And that's the one thing, you know, we've talked about it before with the show and at Kinda Funny of like, I think GameStop gets a bad rap most of the time in terms of it. I like the employees that I've met so many times at the Expo. We're going, we're going to Expo this Sunday. So obviously, we're partnered with them and take over the grain of salt. But for me, going to that first Expo in 2015, it was like, oh wow, this isn't, you know, you, you see, I don't even think about",
            "start": 1019.26
        },
        {
            "text": "GameStop. I don't go to GameStops. I'm not on the malls anymore. And it's like that. I was like, wow, there's a lot of cool people who work here. And it does seem to be a company that cares about their people and who he works there and flying all the managers to one place to learn everything involve a lot. But then take that aside from it. Even if you hate GameStop, it's interesting to see them trying to pivot and trying different things. Whether it be GameTrust, we're going to publish games and we're going to try to make that relevant. We're gonna do this program. We're gonna do all these different things that we are aware. We are fighting a battle that we can really only hold off for so long before, you know, digital does take over everything. Absolutely. I mean, they have not only there are thousands of",
            "start": 1056.47
        },
        {
            "text": "that we are aware we are fighting a battle that we can really only hold off for so long before you know digital does take over everything absolutely I mean they have not only there are thousands of employees but you know the all the people who work in corporate to look after and say like hey we don't want this company to die or go away so you either iterate or you you know go by the wayside exactly interesting let me see we all be fascinated to see how it pans out and what goes on from here number four and I think to say about it already but I'll read the thing Xbox One X sells better than the PlayStation 4 Pro according to Windows Central now this is an article I of things to say about in a matter of days the Xbox One X has already overtaken its closest competition the PlayStation 4 Pro on Amazon's U.S. 2017 bestsellers list first noticed by Niko Partners analyst Daniel Ahmad the Xbox One S is all ex I'm sorry it's already on pace to be the PlayStation 4 Pro on Amazon for 2017 despite",
            "start": 1089.56
        },
        {
            "text": "Amazon's U.S. 2017 bestsellers list first noticed by Niko Partners analyst Daniel Ahmad the Xbox One S is all ex I'm sorry it's already on pace to be the PlayStation 4 Pro on Amazon for 2017 despite the PS4 Pro being on sale for the entirety of the year versus the first few days of the Xbox One X pre-orders that got announced so to summarise since you can't look at the visual the idea is on Amazon you go to see what are the best sellers in video games in 2017 on this and the Xbox One X is ahead of the PlayStation 4 Pro by a wide margin now from what I understand based on first off iTunes and then also what I've heard about Amazon in the past is the fact this isn't apples-to-apples it is there's a whole bunch of information it isn't just like hey let's look at the total number sold verse that verse that but then I've also heard that for sure let's knock out what's going on overall for 2017 it's been reported on places and I've definitely heard it through the grapevine idea that right now in",
            "start": 1133.42
        },
        {
            "text": "that but then I've also heard that for sure let's knock out what's going on overall for 2017 it's been reported on places and I've definitely heard it through the grapevine idea that right now in terms of where Xbox One X pre-orders are and where PS4 Pro pre-orders were like to take the same time period Xbox One X is ahead it is being pre-ordered more than at PlayStation 4 Pro was so it's a convoluted story those numbers come from oh it's just what I've heard through the grapevine wink nudge nudge things to that effect yeah yeah yeah you know Xbox hasn't publicly said how many Xbox Ones they've sold recently mm-hmm people just have to speculate that they've sold something exactly maybe Aaron Greenberg or Phil Spencer could tweet how many Xbox Ones they've sold that would be very interesting now do you mean Xbox One X's or Xbox Ones total well they're not gonna reveal the Xbox One X numbers yet okay no way well I mean it's been it seems like it's been going really well right I mean they're",
            "start": 1179.35
        },
        {
            "text": "do you mean Xbox One X's or Xbox Ones total well they're not gonna reveal the Xbox One X numbers yet okay no way well I mean it's been it seems like it's been going really well right I mean they're the retailers have been selling out of this this is great yeah you know it's interesting when you I saw them on the show notes the first thing I thought was of course you know it's important to remind people that we don't have the numbers the exact numbers of how many PS4 Pros were sold at launch which was again in what November of last year right you're wrong fall of last year yes yes so it was that Q4 yeah and how many they sold through holiday which is always a big push versus this year where they haven't really had I mean Horizon I guess would be like their biggest push for selling new hardware so far yeah this is great this is a great news for Xbox I think they kind of had a little bit of mixed messaging coming out of Gamescom this week yeah we Tim and I discuss it on the show",
            "start": 1229.45
        },
        {
            "text": "hardware so far yeah this is great this is a great news for Xbox I think they kind of had a little bit of mixed messaging coming out of Gamescom this week yeah we Tim and I discuss it on the show earlier and earlier this weekend how is kind of like I I want them to do well yeah this is good this is good news I think it also is indicative of people that potentially when the announcement of Project Scorpio happened right before they launched the Xbox One S I'm sure many many gamers out there were saying well cool this is a small little Xbox but if you're gonna bring Scorpio next year I'm just gonna wait right and buy the Xbox One X instead so I think that's what would that trend is the word absolutely seen coming to fruition here it's very interesting I feel in the fact that you know we've been talking about it on Kinda Funny Games do you and Tim have Danny and I have Tim and I have in before it all happened before P.S. we'd I mention it here and there is the fact that I",
            "start": 1273.7
        },
        {
            "text": "we've been talking about it on Kinda Funny Games do you and Tim have Danny and I have Tim and I have in before it all happened before P.S. we'd I mention it here and there is the fact that I definitely feel there is more goodwill behind Xbox One X at this stage in them launching a pre-orders and everything else then there was behind PlayStation 4 Pro where I feel like after PlayStation 4 Pro press conference there was a lot of scuttlebutt you know Imran I'm talking about from my own echo chamber the people I'm talking to just like what the **** was this why did they do it this way that's thought I thought I thought oh ya know they they kind of botched the the launch of that from a messaging perspective that marred the launch the PlayStation 4 Pro where I remember like the the people I remember being excited and quotes to buy the PlayStation 4 Pro we're just like I'm gonna do a Nomad like Mike Drucker like I just caved and got one and people were buying them but",
            "start": 1324.67
        },
        {
            "text": "the the people I remember being excited and quotes to buy the PlayStation 4 Pro we're just like I'm gonna do a Nomad like Mike Drucker like I just caved and got one and people were buying them but not in spite of themselves but buying them being like I know it's not that great but I'm buying it whereas with Xbox One X I feel a year removed from that people are still like well I know what I'm getting into it is true 4K it is these apps it is all these different things because yes dot dot dot another Xbox advocate rotating the Kinda Funny Games Daily and give us a long letter here about why he or she is still supporting the Xbox One because of course we had asked me and Tim when we were on last time I think talking about all this just like the fact of we are aware that we are PlayStation, Nintendo that's where our camp is right that's what our ecosystem so when I turn on my Xbox and I'm like I found the system settings can feel something like if you use Xbox every day you don't you think",
            "start": 1363.52
        },
        {
            "text": "that's where our camp is right that's what our ecosystem so when I turn on my Xbox and I'm like I found the system settings can feel something like if you use Xbox every day you don't you think I'm gonna do it I get that so we wanted to know why people like you yourself Xbox fans were buying this and getting into it so another Xbox advocate writes in and says no the Xbox vision discussion has been reoccurring has been a reoccurring theme lately but with Jez Corden from Windows Central tweeting about the comparative strength of Xbox One X pre-orders on Amazon parentheses not the best comparison since PS4 Pro launched in 2016 and this is a 2017 year-to-date comparison see this is a good I see this is good news for the console the main tagline or vision for Microsoft has been pushing the Xbox as I'm sorry pushing the Xbox is the best platform to play games 99% of the time it feels when this is brought up we jump straight to the discussion of exclusive where Sony has the upper hand even",
            "start": 1406.72
        },
        {
            "text": "as I'm sorry pushing the Xbox is the best platform to play games 99% of the time it feels when this is brought up we jump straight to the discussion of exclusive where Sony has the upper hand even though exclusives represent a very small percentage of the overall game or releases on consoles as a day one PS4 and Xbox One purchaser I started playing all my third-party games on PS4 thanks to the daily graphical comparison videos which gave PS4 an edge eventually though the service / choice offerings of the Xbox were enough to exceed the small graphical advantage of the PS4 making the PS4 my exclusives machine today these services include EA Access Xbox Game Pass 360 and original Xbox backwards compatibility more mature online infrastructure Xbox Design Labs for custom controllers Xbox Elite Controller game streaming to Windows 10 devices ability not to be handcuffed to my Gamertag for middle school or high school and more and more open to being cross-play question questions I think he",
            "start": 1446.02
        },
        {
            "text": "controller game streaming to Windows 10 devices ability not to be handcuffed to my Gamertag for middle school or high school and more and more open to being cross-play question questions I think he means have been asked as to why the Xbox One X is important to Microsoft while the graphical enhancements may not be a game changer for everyone if Microsoft wants to stand behind their statement that Xbox is the best platform to play games they also need to have the hardware option available to play the best versions of third-party games enclosing shocked if you read this far it's a good letter you should have put your name and so you could make all about it if a friend said they wanted to join the current console generation it could only buy one console my first response to them would be to check out the Sony exclusives first past current and future if those excite you most purchase a PS4 if you're more interested in playing third-party games or have the means of owning both",
            "start": 1494.69
        },
        {
            "text": "would be to check out the Sony exclusives first past current and future if those excite you most purchase a PS4 if you're more interested in playing third-party games or have the means of owning both consoles my recommendation would be to buy an Xbox One S or X for the majority of your gaming there are some big advantages for using Xbox is a primary system and PS4 is an exclusive machine that people might be missing out on love The Daily Show puts me over the edge from a casual fan to a Patreon supporter this show has truly improved how I consume gaming news discussions more than any way other website podcast app etc well thank you thank you never be afraid to put your name on a thing though there's no claim another advocate it's a good letter it's interesting taken I like that I like to know why people are on that side of the equation all very valid points yeah if you have the funds to buy more than one machine yeah and you know people like us have the privilege of having all the",
            "start": 1534.02
        },
        {
            "text": "to know why people are on that side of the equation all very valid points yeah if you have the funds to buy more than one machine yeah and you know people like us have the privilege of having all the consoles that are on the market and it's something that ask myself on a semi-regular basis because I've said before that I spent so much time on my 360 that I never played the third-party games on my PS3 ever it was my exclusives machine just like for this person that their Xbox One is they're all around machines on the PS4 is their exclusives machine and so I look at why I play games like Call of Duty or Assassin's Creed or Destiny or Overwatch on PS4 instead of on the Xbox One and I it just comes back to that I have that ecosystem set up now on PS4 that I just don't think about splitting my time between them and I really should maybe yeah you have to you I know I don't have to but I feel like you you make you do that thing where I think about it too of like man maybe I should use my",
            "start": 1573.95
        },
        {
            "text": "my time between them and I really should maybe yeah you have to you I know I don't have to but I feel like you you make you do that thing where I think about it too of like man maybe I should use my Xbox more but it's that fact of really what it at the end of the day like people have been having this discussion over on our subreddit the Kinda Funny subreddit about like wow I haven't checked comments and forever on anything and they after if it's IGN our blog thing and it was they went in a console war still raging yeah the console war with all due respect only matters when you are in junior high in like high school and this is something you have the time to worry about I of course I mean like I think we can all Xbox, Switch, or PlayStation we can all unite Ian and Claire we hate PC gaming thank you Kevin that's the only joke I ever really make right I don't care where anybody plays Assassin's Creed original Destiny or anything else sometimes it sucks when it's I see somebody out there",
            "start": 1631.04
        },
        {
            "text": "thank you Kevin that's the only joke I ever really make right I don't care where anybody plays Assassin's Creed original Destiny or anything else sometimes it sucks when it's I see somebody out there and like oh man I love Friday the 13th them like let's play together and they're like what's your Gamertag my **** all right well no that's number that's the only there's small little things like that but in the grand scheme of things it doesn't matter nobody cares it is that it so that's the thing of like I'm like maybe I should jump over and do more Xbox stuff there is a game that got it oh here we go The Coma: Recut launches on Xbox One on September 2nd that's a tease from new dates coming up and I watched that trailer I was like **** now I'm gonna turn on Xbox One for this that granted I did no research it seems like it's an Xbox One exclusive maybe it's not I read about it on the Xbox One blog that's I was like wow this looks really cool I'd like to try this out but it's I've worried",
            "start": 1674.87
        },
        {
            "text": "no research it seems like it's an Xbox One exclusive maybe it's not I read about it on the Xbox One blog that's I was like wow this looks really cool I'd like to try this out but it's I've worried and think about that too of I should I be trying to descend like who the **** cares I'm gonna talk about the game there's the little I get my e-penis a little bit bigger when I get my trophy or whatever like a night you know I mean not have that ecosystem I like it but like I don't play multiplayer games so it really doesn't matter it's just you know one of the other comments I saw in I think Games Daily I might have read it but I met it maybe just made the cut was somebody talking about you know the fact they play on Xbox because they think the controllers just the best controller ever that's ever existed it's a fantastic control and I'm like you know what that's a great point too that I never thought about the fact that I've had a DualShock in my hand forever that it's just a second",
            "start": 1717.71
        },
        {
            "text": "ever existed it's a fantastic control and I'm like you know what that's a great point too that I never thought about the fact that I've had a DualShock in my hand forever that it's just a second nature and it's so normal for me that I I love playing games with it and do it but I totally get the fact that like oh no on the other hand that'd be over there for you but play games wherever you want to now thinking about this now makes me want to go home and play my Xbox yeah go on stroking my car well I booted it up to download Tacoma and I went to my catalog of games cuz they'll like show you what you're having backwards compatibility and I and I saw Beyond Good and Evil there and I was like oh yeah I should replay that yeah if I downloaded it okay there you go you're all set I got a stream something today yeah is that I have to buy that game again that's my PlayStation yeah don't worry about I don't want to buy it again okay Andrea yes Greg if I wanted to know what games were coming out",
            "start": 1752.72
        },
        {
            "text": "today yeah is that I have to buy that game again that's my PlayStation yeah don't worry about I don't want to buy it again okay Andrea yes Greg if I wanted to know what games were coming out to these beautiful machines with the exception of PC where would I go you would go to the official list of upcoming software across each and every platform as listed by the Kinda Funny Games Daily show hosts each and every weekday you were doing a voice there yeah yeah cool gig and I both like that I let's do that cool great I'm stopped doing what he was doing to look at me like day out today Rivals of Aether is launching on Xbox One now it's already been on Xbox One but it's leaving the Xbox Game Preview program so congrats to them on a full release from--It.dot.8 comes in the Nintendo eShop for a Nintendo Switch Pix-Cell Lines DX comes to this Nintendo eShop and Nintendo Switch and then of course a Neo Geo game called Puzzled comes to the Nintendo Switch via the shop meanwhile on new dates",
            "start": 1795.32
        },
        {
            "text": "a Nintendo Switch Pix-Cell Lines DX comes to this Nintendo eShop and Nintendo Switch and then of course a Neo Geo game called Puzzled comes to the Nintendo Switch via the shop meanwhile on new dates Dissidia Final Fantasy NT got announced it's launching January 30th on 2018 for the PlayStation 4 it's coming with a bunch of different versions but the ultimate collector's edition will set you back 190 bucks it's got its exclusive from the Square Enix online store it's got a Warrior of Light bust figure official soundtrack artbook season pass steelbook collector's box featuring legendary Final Fantasy characters I woke up this morning I did all my chores whatever God had gotten the car to work looked at my phone and it was Alexa it was something like just kill me now and I was like oh my god Alexa is having a bad day and I went wait is she Final Fantasy stuff she's freaking out about I'm like I ain't good for you I mentioned earlier The Coma: Recut is launching on Xbox One September 2nd",
            "start": 1844.01
        },
        {
            "text": "Alexa is having a bad day and I went wait is she Final Fantasy stuff she's freaking out about I'm like I ain't good for you I mentioned earlier The Coma: Recut is launching on Xbox One September 2nd Tekken 7's DLC number one will be out on August 31st then this one got me excited when I saw it in the in the old email INBOX Smuggler's Run it's coming to GTA Online August 29th it's just a it's it's a mode it's not like you're actually getting Smuggler's Run one of the best PS2 launch games of all time Smuggler's Run opens the air corridors above Los Santos and Blaine County providing new business opportunities while reducing a range of planes choppers and even ultra lights is highly viable options for transporting criminal cargo across the state simultaneously opening up some creative new methods for dispatching any rival gangs along the way then finally Nintendo confirmed that Switch versions of the first seasons of Telltale's Batman and Guardians of the Galaxy series are on the way no",
            "start": 1888.29
        },
        {
            "text": "for dispatching any rival gangs along the way then finally Nintendo confirmed that Switch versions of the first seasons of Telltale's Batman and Guardians of the Galaxy series are on the way no dates for you but they put out a tweet that meant that Zane wrote in the KindaFunny.com/KFGd just like you can and says hello with the announcement of Telltale's Batman and Guardians of the Galaxy coming to the Switch do you think more companies will think about bringing their games the Switch as well if they sell well I think it's less about that and more about the type of game and if it fits on the platform yet Telltale's is a perfect series of games to go on the Switch they are fantastic to play on the go they are relatively simple from a technical perspective and they could probably bring our entire back catalogue to Switch it on so yeah and that's the interesting thing is I think that's such an interesting point for them to be able to just you know the the city I mean the engines got",
            "start": 1935.03
        },
        {
            "text": "our entire back catalogue to Switch it on so yeah and that's the interesting thing is I think that's such an interesting point for them to be able to just you know the the city I mean the engines got tons of **** problems and crash that's the thing how are they gonna run on Switch I'll be interested to see seeing is how the Vita versions were always so bad the mobile versions are good though I went back and played Tales from the Borderlands on iOS on my iPad and it went fine good ok well that's a helpful and that's a you know you what you want to see I think but I think you're nailing it right it's not so much about sales is it can the platform support this game and also then is there an audience that would want it I think right you see all the Indies and the downloadable games that are like not full releases or Triple-A or even Double-A those are the ones I think you'll see people think more and more about bringing stuff over but for your bigger stuff don't hold your breath but I",
            "start": 1982.4
        },
        {
            "text": "like not full releases or Triple-A or even Double-A those are the ones I think you'll see people think more and more about bringing stuff over but for your bigger stuff don't hold your breath but I think people are you know publishers and developers are taking notice of every really **** loves the Switch and whenever you not a gaming you don't mention the Switch that's pretty much what people ask right away well if everyone stopped making every game open-world yeah that maybe more games could come to the Switch deals of the day September's Games with Gold for Xbox have been announced Forza Motorsport 5 Racing Game of the Year Edition will be available September 1st through the 30th on Xbox One Oxenfree will be available September 16th through October 15th on Xbox One Hydro Thunder Hurricane will be available September 1st through the 15th on Xbox One and Xbox 360 and then Battlefield 3 will be available September 16th to the 30th on Xbox One and Xbox 360 meanwhile Capcom is",
            "start": 2016.87
        },
        {
            "text": "Hurricane will be available September 1st through the 15th on Xbox One and Xbox 360 and then Battlefield 3 will be available September 16th to the 30th on Xbox One and Xbox 360 meanwhile Capcom is having an eShop sale over on the 3DS and Wii U there's a bunch of games but heads up that Mega Man Legacy Collection 3DS is marked down to $6 from $15 Ace Attorney Trilogy on 3DS is it only running you 15 bucks Wii U has Monster Hunter 3 Ultimate for eight bucks Resident Evil Revelations for ten so there's a whole bunch of stuff check out but there's some highlights some titles I saw and I was like alright I'll talk about them and I'm moving my head like this time for reader mainly Andrea okay let's start with a DrummerDuck09 DrummerDuck09 says greetings Greg and I hope Andrea my question is simple with the download of Destiny 2 information we got this morning I couldn't be more hyped for September 6th that said what are you trying to finish before Destiny takes over our lives games",
            "start": 2058.56
        },
        {
            "text": "is simple with the download of Destiny 2 information we got this morning I couldn't be more hyped for September 6th that said what are you trying to finish before Destiny takes over our lives games TV books comics loved ones existential questions about life thank you for your time you're still pumped about Destiny 2 - yes how much of this information did you read today or look at our videos or any stuff I've read a couple different previews I've looked at some footage um you know at first I was like a little miffed that I didn't get a go and myself sure and try it but after reading some previews I'm actually kind of glad because I know that I'm going to play this stuff quite a bit yeah I don't need to play if the game is out in a couple of weeks that's what I did as I clicked on the links today I'm like oh yeah let's read no no stop I want to watch this yeah I don't I'm glad they didn't send us up there to play three hours of it probably not have any of my progress carryover and I'll",
            "start": 2107.95
        },
        {
            "text": "today I'm like oh yeah let's read no no stop I want to watch this yeah I don't I'm glad they didn't send us up there to play three hours of it probably not have any of my progress carryover and I'll **** that like yeah I'm excited to sit here with Andi and stream it on Tuesday the 6th yeah I I still think that it's not going to be like I saw haven't seen something that defines it as a full-fledged sequel yes but people and their previews are saying that they have seen something they just can't talk about it yet so I'm like ok that far yeah I'm wholly not hope that I'm going to be pleasantly surprised are you trying to crank through stuff and get time there you did you not worry or think that way you know yes and no I haven't there's a couple games that I just need to get back to I've recently started playing more Zelda I'm really like trying to finish well not necessarily finished like all all the side quest and everything but trying to get as far as I can through yeah Breath of",
            "start": 2151.4
        },
        {
            "text": "recently started playing more Zelda I'm really like trying to finish well not necessarily finished like all all the side quest and everything but trying to get as far as I can through yeah Breath of the Wild before the fall release season comes because then I was here yeah but um there's lots of cool stuff coming really quickly like Assassin's Creed and Wolfenstein and it's just everybody's off Tuesday come on man yeah ready get hype get hyped off coming right up yeah I won't have any problems finishing Uncharted: The Lost Legacy yeah that's well short whatever it's 8 hours 7 8 hours short I mean compared you got for a standalone game ok so you're sure you are sure you're firing shots yeah I know Uncharted I got into it I can leave tomorrow morning so um yeah I mean we don't we don't need to like go down a rabbit hole here but I heard your discussion yesterday and I was like it I felt like you backpedaled on your opinion a little bit when you were like critical and then you're like wait I",
            "start": 2193.82
        },
        {
            "text": "go down a rabbit hole here but I heard your discussion yesterday and I was like it I felt like you backpedaled on your opinion a little bit when you were like critical and then you're like wait I love it it's great go buy it but it has problems and I was like well how does he actually feel about it there's a review up on the youtube.com/KindaFunnyGames you can go read yes um but so I'm gonna play a little bit more of that Zelda I have you do not like what you play no I think listen it looks beautiful yeah it plays exactly like Uncharted 4 yep my the crux of the discussion that I was having on and on our podcast was I was disappointed by the dynamic between Chloe and Nadine and firstly in it to me kind of broke the Uncharted vibe that Nathan Drake and Sully had gotcha ok ok like the the pairing of those two together just didn't quite feel fun hmm in the same way that you have this deep sense of camaraderie between I can see that for sure between you Drake and Sully and so we go into",
            "start": 2248.75
        },
        {
            "text": "pairing of those two together just didn't quite feel fun hmm in the same way that you have this deep sense of camaraderie between I can see that for sure between you Drake and Sully and so we go into that into detail if you guys want to hear it tomorrow What's Good Games what's games yeah my thing is I was like why are you thinking I'm a backpedal here I'm not a backpedal in our flip-flopping fingers I think the game I wasn't saying you were flip-flopping yeah don't don't call me an ex carpi no I know and I haven't read your your review so videos don't you don't wanna read them so I haven't listened to your review yet and it's just like in the comment that you were talking about with Danny yesterday it just made it seem like you had issues and reservations but you still were applauding them for doing a good job and I'm like okay I'm not saying that that's wrong I just got confused as to how you felt about my issues are there's the fact that it's not a step forward what you're talking",
            "start": 2299.66
        },
        {
            "text": "for doing a good job and I'm like okay I'm not saying that that's wrong I just got confused as to how you felt about my issues are there's the fact that it's not a step forward what you're talking about where you're a $40 standalone game it's like an extension, isn't it? And they went above and beyond to say this is a standalone game and that was wrong like so many times we've seen games whether it be from the developers or the publishers message it incorrectly and set up the wrong expectation and they fail because they've set the wrong expectation I agree with you there's been so many instances of this and so I look at it and go like you were saying on the podcast yesterday Naughty Dog has set the bar at a specific level and now we all think the bar is always going to be there and they didn't hit that bar with this game I don't think and doesn't mean that it's a bad piece of software it just means it wasn't up to the standard that we think a Naughty Dog game should be it was exactly no it",
            "start": 2340.55
        },
        {
            "text": "hit that bar with this game I don't think and doesn't mean that it's a bad piece of software it just means it wasn't up to the standard that we think a Naughty Dog game should be it was exactly no it were a same page here I think in terms of it and I think that that would I argue in the review and I maybe glossed over yesterday is the same thing where I think Left Behind for The Last of Us was so powerful but we knew what we were getting into it's gonna be a smaller experience gonna be this thing okay cool and I got in there and granted its its low The Last of Us but it's not The Last of Us I played before right whereas I got into this and it was this is a full-fledged forty dollar standalone you can buy it download it however you want to get it you're gonna get in it's going to be an Uncharted we got it and it wasn't Uncharted but it was very much Uncharted 4 and is very much Uncharted 4 region even the way the characters run is identical sure like you can tell that they just",
            "start": 2385.01
        },
        {
            "text": "an Uncharted we got it and it wasn't Uncharted but it was very much Uncharted 4 and is very much Uncharted 4 region even the way the characters run is identical sure like you can tell that they just picked up the skeleton of that world and just built on top of it which is which is fine yeah exactly I'm not saying that's bad I'm just saying that it just wasn't what I was expecting yeah exactly manage expectations exactly exactly do it I'm a things speaking of DLC Greg way Matthew wrote into KindaFunny.com/KFG and says hey Greg and insert co-host that's Andrea why do people keep talking about what the next Legend of Zelda game will look like why are people asking for more DLC from Breath of the Wild I love Breath of the Wild but after having put in about 130 hours and explored almost everything there is to see I can say that some of the game the game does have issues mainly a lack of variety and content the game desperately needed more areas like Hyrule Castle which were ordered",
            "start": 2421.88
        },
        {
            "text": "everything there is to see I can say that some of the game the game does have issues mainly a lack of variety and content the game desperately needed more areas like Hyrule Castle which were ordered exploration with cool items secret bosses and tidbits of lore I'm really excited for to see what the DLC for the Champions' Ballad adds to the game but I want to go further now that Nintendo seems to be somewhat hasn't hasn't hesitantly still embracing DLC I would love for them to continue supporting Breath of the Wild with more content over the next year or a couple years am I alone everybody else seems to have moved on into speculation about the next game and I feel left behind wanting more out of the one we currently have what do you guys think Matthew I think this is an expectation game Nintendo telegraphed here's what we're doing for Legend of Zelda DLC this is what it's going to be we're all on the same page as gamers with you put 130 hours into it I put less but I put a ton into it",
            "start": 2467.66
        },
        {
            "text": "telegraphed here's what we're doing for Legend of Zelda DLC this is what it's going to be we're all on the same page as gamers with you put 130 hours into it I put less but I put a ton into it and enjoyed it beat the story if I wanted to go back for more shrines it's there great than the other I I agree that like Hyrule Castle was cool but I don't like where you're the first thing you say is it rewarded exploration with cool items like I thought exploring Breath of the Wild in general was amazing and what was over that next Ridge and tagging something and walking off to above finding three shrines along the way like that was the game exploration was the game for me I didn't have as much fun exploring as you did I felt like I walked a lot and saw a lot of nothing in many parts of that world but I think he's right that we shouldn't be talking about what the next Zelda is going to look like it took a long time for this one to get made and they did a you know a great job with what they put",
            "start": 2510.28
        },
        {
            "text": "but I think he's right that we shouldn't be talking about what the next Zelda is going to look like it took a long time for this one to get made and they did a you know a great job with what they put out what does DLC look like I don't know I don't know that releasing DLC would make me want to go back to that world let me know clearly I just talked about how I'm still playing yeah yeah but you know if I spend like another 50 hours in the game or more walking around I don't know if I'm gonna want to play DLC well I think and I think you speak for a lot of gamers in that respect as well at least for people in our Twitter feeds and echo chambers and web sites and the fact that that first wave of DLC came on it's a Master Trials and this the button I was looked at I was like wake me when the story is expanded like that I'm more excited for that than going back and replaying it or upgrading I know that there's tons of you who did jump back in but I think if you look at the way when the release of Zelda was talked about and then the seemingly small groups of people talking about the DLC you see that that's not exactly what people wanted it's just it's a tough it's a tough sell because from my perspective when I played Zelda I don't find any of the story things to be particularly rewarding I didn't think the story was that engaging it seems very much like this is just the same Zelda story that we've gotten every time before the side quests don't feel rewarding and like I don't want to go do this thing because I'm getting such a crappy reward for all of this work so if you're just gonna give me more of these stupid errands to run I don't know if I'm really that interested you know the girl wants the shop yeah you know it's I don't know this is I want a reason to jump back",
            "start": 2554.5
        },
        {
            "text": "story is expanded like that I'm more excited for that than going back and replaying it or upgrading I know that there's tons of you who did jump back in but I think if you look at the way when the release of Zelda was talked about and then the seemingly small groups of people talking about the DLC you see that that's not exactly what people wanted it's just it's a tough it's a tough sell because from my perspective when I played Zelda I don't find any of the story things to be particularly rewarding I didn't think the story was that engaging it seems very much like this is just the same Zelda story that we've gotten every time before the side quests don't feel rewarding and like I don't want to go do this thing because I'm getting such a crappy reward for all of this work so if you're just gonna give me more of these stupid errands to run I don't know if I'm really that interested you know the girl wants the shop yeah you know it's I don't know this is I want a reason to jump back",
            "start": 2600.92
        },
        {
            "text": "just gonna give me more of these stupid errands to run I don't know if I'm really that interested you know the girl wants the shop yeah you know it's I don't know this is I want a reason to jump back in and play more so I'm excited for the to be more story more whatever that Hyrule, you know, the Ballad is going to be but I'm not aching just a plain general I still have plenty of shrines to go get but this is not what I want to do did you get all those Korok Seeds hell no you **** kidding me sorry you going I got here annoying and they're like people who did it I mean more power to you but it was just like I'm fine not doing that now if there would've been a platinum trophy who knows Jared good day to you what advice would you have for a first-time flyer when it comes to bringing my portable system on a flight I'm traveling from Baltimore to Sacramento for a friend's wedding in October and wanted to know how to keep my Switch from dying on me partway through the flight do most",
            "start": 2641.78
        },
        {
            "text": "portable system on a flight I'm traveling from Baltimore to Sacramento for a friend's wedding in October and wanted to know how to keep my Switch from dying on me partway through the flight do most planes have outlets now or just chart or to just do most planes have outlets now to just charge it can I bring rechargeable what can I bring rechargeable batteries and if so are there any kinds or restrictions on the amount to bring blah blah blah my airline is American Airlines if that helps any of you a plane layout it's my first time flying in over ten years and by myself so any advice for traveling gamer would be appreciated love and respect to the Kinda Funny team and community Andrea we fly all the time we fly all the time and I actually fly American Airlines quite a bit so a good thing about them is they have an app you download the app you log in you look up your flight information they'll tell you exactly what kind of plane you're going to be flying on now there is a small",
            "start": 2688.37
        },
        {
            "text": "thing about them is they have an app you download the app you log in you look up your flight information they'll tell you exactly what kind of plane you're going to be flying on now there is a small outside chance that sometimes they swap equipment but it's rare that they'll swap out the plane so you can check and see it's a plane that you're going to be flying it has power at the seats most planes do now I do however recommend bringing a battery there aren't really restrictions to the standard cellphone batteries lithium batteries you can't bring but those batteries are the cell phone chargers and batteries are not with him right so bring that the great news about the Switch is that it's a USB-C and so you can plug it into anything however you have the plane you just flew with her Switch the power draw from a battery or even from the outlet is not the same as using the actual dock or using a cable plug directly into a wall right so it's not enough because I tried to bring my",
            "start": 2726.11
        },
        {
            "text": "Switch the power draw from a battery or even from the outlet is not the same as using the actual dock or using a cable plug directly into a wall right so it's not enough because I tried to bring my Surface on a plane once and you can't even boot it up because the power draw from the seat is not enough to turn it on mmm that's interesting so yes a fried charged it up make sure it's fully 100% charge going in turn the screen brightness down a lot of people forget about that plane mode yeah Wi-Fi exactly yeah Virgin America seats with the actual plug that'll be fine I've done that with my Switch USB ones I've tried on planes before never give me enough power to get it going I have an Anker battery pack that I use that's huge and that can maintain but I believe the deal is with it that it can maintain but it can't charge it while I play and that I think since I bought that one they put out a new version of one that does do that if you google you can find the exact",
            "start": 2774.19
        },
        {
            "text": "is with it that it can maintain but it can't charge it while I play and that I think since I bought that one they put out a new version of one that does do that if you google you can find the exact model numbers that keep you going but I'd say yeah buy a battery pack for worst-case scenarios and then bring your USB cable for that and then have your plug with you just for powering but for the most part you to be ok yeah 2017 is pretty awesome for being a gamer on the go final question for the day comes from Chuck he likes not enough do you like cliffhangers in games I get that they can build to potentially to a potentially sequel and that's not right grammar but with games like The Order: 1886 Half-Life Legacy of Kain and other and of course Sphinx and of course and the curse of them plummy never having conclusive ending I feel like they're misused I'd much prefer an Uncharted style sequel with standalone adventures that make it richer for the context as opposed to you hopefully getting",
            "start": 2828.2
        },
        {
            "text": "never having conclusive ending I feel like they're misused I'd much prefer an Uncharted style sequel with standalone adventures that make it richer for the context as opposed to you hopefully getting the real ending when you get the new game thanks I don't I'm not a cliff hanger fan know who is a cliff hanger fan it's nuts it takes you takes you three to four years to make this game and it's gonna end like The Order and be like are there's more **** werewolves and vampires and dicks out there for you oh my god she's the only people that can get away with cliffhangers are people that have episodic games and you know when the next episode is going to come out or you know that another episode is coming out right that's a great point wait that's a great point right like so Telltale can get away with it because you're like if there's a cliffhanger in episode 3 you're like okay I know episode 4 is on the way and for the most part when you look at Walking Dead or even Batman Season 1 when",
            "start": 2872.06
        },
        {
            "text": "away with it because you're like if there's a cliffhanger in episode 3 you're like okay I know episode 4 is on the way and for the most part when you look at Walking Dead or even Batman Season 1 when it ends with an easter egg or a teaser for what might happen in the next season it's not will this person live or die I will find out an X a Y ear no it's it's the episodes sure do that but the actual season just gives you a reason that hey life goes on on this universe and let's see what goes on from there right I'm sorry Uncharted I always selected it really well even Infamous 1 and I thought did a really nice job of it where you know Infamous 1 ended and it was very much that spoilers we had beaten Kessler and the Beast was coming and it was great in people it was still a good end point of like we finished a giant chapter here I'm not on the edge of my seat to know what happened with this person or that person yeah I just yeah who are you out there that likes a good cliffhanger vicious",
            "start": 2908.42
        },
        {
            "text": "like we finished a giant chapter here I'm not on the edge of my seat to know what happened with this person or that person yeah I just yeah who are you out there that likes a good cliffhanger vicious I want to know what what is wrong tweet Andrea no time to Squad Up this is where one of you writes in the KindaFunny.com/KFG you give me your username your real name the platform you're playing on a why do you need friends I read here and the best friends gather around you on the Internet via video games and supports you today Oku writes in he plays on PlayStation 4 and then it gets interesting alright Greg here's a weird one for you I'm riding in the Squad Up even though I don't want anyone to add me on PSN because let's face it big friendless are just a hassle so why am I writing in to Squad Up you ask well Greg because I need people to buy the Brawlhalla founders pack on PlayStation 4 Brawlhalla launched its closed beta on August 1st but hasn't been mentioned in any of the",
            "start": 2951.83
        },
        {
            "text": "in to Squad Up you ask well Greg because I need people to buy the Brawlhalla founders pack on PlayStation 4 Brawlhalla launched its closed beta on August 1st but hasn't been mentioned in any of the gaming podcasts I listened to it will become free-to-play when it releases at a later date but you can get immediate access to the closed beta by buying this pack for $20 and let me tell you Greg, more best friends need to do this ever since I bought it I can't stop playing especially since it scratches that Super Smash Bros. itch I've had ever since the GameCube days there must be more best friends out there who are itching for a bout of smash light fun on the PS4 right so please Greg get them to buy this game shoutout to you Brawlhalla thanks for all you do and kudos to everyone Kinda Funny Oku well that was a weird Squad Up but I appreciate it that he just wants more people to play Brawlhalla with Brawlhalla I think doesn't get mentioned because it does that thing so many games do",
            "start": 3002.53
        },
        {
            "text": "Oku well that was a weird Squad Up but I appreciate it that he just wants more people to play Brawlhalla with Brawlhalla I think doesn't get mentioned because it does that thing so many games do now where it **** is everywhere but never anywhere it was been at every PAX and trade show and that I've I played that game I feel like three years ago and I remember playing you back oh this is really cool and now it's to the point that I got a somebody tries to talk to me about how I'm like I don't know what's going on I didn't even know it's in early access not whatever like **** get your game outs don't review your game too early otherwise this happens where it's so impossible to get people behind something that they've heard about for years yeah you can't continue to talk about something when it doesn't have an official release date right yeah and that's the thing I think so many of these games early access you talk about it Guns Up! we talk about I mean Marvel Heroes is",
            "start": 3049.27
        },
        {
            "text": "something when it doesn't have an official release date right yeah and that's the thing I think so many of these games early access you talk about it Guns Up! we talk about I mean Marvel Heroes is actually the one I think that did it right where they launched and then came back and they were started to call themselves by the year right of Marvel Heroes 2015-2016 whatever and they do these things like here's what's different this year we the game sucked when it launched and now it's better and we're doing this and they have a narrative to it where Brawlhalla and all these other early access games like okay cool what's still going I don't know I've missed the train and now I'm not on it and I feel like it's away gone and whatever if you want spend twenty bucks and go play apparently in Smash Bros. on PS4 go ahead does it have trophies out yet that's my big question cuz Paragon doesn't have trophies right nope stop **** limping along guys sure what do we get wrong today because of",
            "start": 3087.29
        },
        {
            "text": "Brothers on PS4 go ahead does it have trophies out yet that's my big question cuz Paragon doesn't have trophies right nope stop **** limping along guys sure what do we get wrong today because of course if you're watching live you can go to KindaFunny.com/You'reWrong tell us what we screw up as we screw it up keep the record straight at the end of the show so I had asked people to tell me where that N7 costume was and they did Final Fantasy XIII-2 mm 13 - that's how you say that right I always say this fan of fantasy names wrong I'm sorry they say that it had an N7 costume and also an Assassin's Creed Revelations costume ok ok all out all right and this is an interesting one I bought the swap program for Australia I'm currently doing it at my local GameStop in Philadelphia oh really $60 in the program is scheduled to end September 30th of this year I heard about it through my email so I quickly looked this up GameStop's Summer Swap it says here that the summer swap is",
            "start": 3122.48
        },
        {
            "text": "really $60 in the program is scheduled to end September 30th of this year I heard about it through my email so I quickly looked this up GameStop's Summer Swap it says here that the summer swap is 50 dollars so I guess with tax probably is closer to 60 or he's getting ripped off maybe the manager was like no at 60 here you're gonna pocket 10 bucks it says pick any pre-owned game plate for as long as you want from June 1st to September 30th so just over three months and swap the game for another pre-owned game and repeat as many times as you like so 50 bucks for 90 days of unlimited swapping that's pretty cool so there clearly testing it but it just says here it's in participating Philadelphia stores so maybe that's their small money and very interesting yeah cuz I checked it out and they're like there's nothing within a hundred miles of where you live available no swap shirts so that was interesting so thank you for writing in letting us know about that oh not a correction but a",
            "start": 3169.28
        },
        {
            "text": "they're like there's nothing within a hundred miles of where you live available no swap shirts so that was interesting so thank you for writing in letting us know about that oh not a correction but a statement with the current return policy at GameStop you can just buy a pre-owned game and return it within seven days so essentially you could keep doing this every time you beat a game yeah I mean you can't really because what happens is when you return things they take your driver's license and they take your information down and it goes into a network because when I used to work in retail they had this service that you can use to check people who are fraudulently buying and returning items interesting and so if you start to return too many things that you get flagged and then they won't let you return stuff anymore Josh it's like Vegas kind of but not for returns but yeah you know does not let you make casino kind of thing right they're watching your big brothers on you so I mean you",
            "start": 3214.67
        },
        {
            "text": "you return stuff anymore Josh it's like Vegas kind of but not for returns but yeah you know does not let you make casino kind of thing right they're watching your big brothers on you so I mean you could do that but I wouldn't I wouldn't recommend it yeah don't be that person yeah okay somebody else also commented on that another GameStop comment um yes so this person said there are no GameStops in Australia the retailers replaced completely by EB Games you said that in the story yeah that we were just talking about what it would be like if GameStop did it here in the U.S. yeah you so remember that here EB is owned and operated by GameStop so um more about the Summer Swap Oh a pretty big piece of news you guys left out Paragon is a new character announcement an Australian Ranger, Drongo, and he's coming out on August 9th. We call Drongo from Game of Thrones, isn't he? Khal Drogo? Um that's not a big piece of news as as like the resident Paragon person on this show it's okay news but",
            "start": 3256.49
        },
        {
            "text": "Drongo and he's coming out on August 9th. We call Drago from Game of Thrones, isn't John Bello? Um, that's not a big piece of news. As as like the resident Paragon person on this show, it's okay news, but they've released a hero every three weeks. You can't be big news every three weeks. I'm sorry. Good point. September 6th is a Wednesday, not a Tuesday for Destiny 2's launch. **** really? No. Yeah, yes, yes, it is, because I'm flying back that day from PAX. Wednesday, September 6th. That sucks. I was looking forward to playing on Tuesday. I think I blocked out that afternoon for a stream. I'm sure you're probably gonna be able to play on Tuesday. Okay, when's the embargo? Look, we'll have to check when the servers are going live worldwide. Okay, that's more important. Okay, okay. It says you in fact cannot read the Uncharted: The Lost Legacy review on Kinda Funny.com. You can however watch it. I'm just busting balls here, Andrea. I love you. Thanks. I think that's it. Okay, good. Oh, somebody said, \"Hey guys, I got this one.\"",
            "start": 3302.33
        },
        {
            "text": "Lost Legacy review on Kinda Funny.com. You can however watch it. I'm just busting balls here, Andrea. I love you. Thanks. I think that's it. Okay, good. Oh, somebody said, \"Hey guys, I got this one for my trip down in New York,\" and it does charge while playing Zelda at max brightness. So he links here to the Anker PowerCore. So if you want to see that, is it an Anker? Anker? No, I said Anker. Oh, I say Anker. A-N-K-E-R. You can go to Kinda Funny.com site. You're wrong right now. See it in the forum. If you get there late and our beautiful mods have already cleared that, they store everything on the forums. So you can find it there. And ladies and gentlemen, that is Kinda Funny Games Daily. Tomorrow, Tim is hosting. I've officially updated the template to always say who tomorrow's host is. A fault. I don't have to do this because people then can ask their questions. So it's Tim and myself. I remember Kinda Funny Games Daily is your stop each and every weekday for all the nerdy video game news you",
            "start": 3351.5
        },
        {
            "text": "don't have to do this because people then can ask their questions. So it's Tim and myself. I remember Kinda Funny Games Daily is your stop each and every weekday for all the nerdy video game news you need to know about. We run you through it, give you some perspective, answer your questions, and have a good time learning with you. You can go to KindaFunny.com/KFGED to be part of the show, and I encourage you to do so. Remember, PAX is right around the corner. Friday, Andrea's hosting Life Is Strange panel. Friday, Andrea, What's Good Games are doing the Life Is Strange party. Saturday, there's the What's Good Games PAX Off at 5:00 p.m. Saturday at 8:30, there's the Batman Crowd Play with me. Sunday at noon is Danny's Witcher panel. Sunday at 5:00 is my Kancor panel. I'm probably gonna do a signing at the Rooster Teeth booth sometime on Saturday. Hopefully, I'll details tomorrow on that. I assume after the Telltale thing, I'll go get drunk with you somewhere. So just, you know, be on Twitter, look around",
            "start": 3398.81
        },
        {
            "text": "the Rooster Teeth booth sometime on Saturday. Hopefully, I'll details tomorrow on that. I assume after the Telltale thing, I'll go get drunk with you somewhere. So just, you know, be on Twitter, look around what's happening. We'll figure it all out. Until next time, it's been our pleasure to serve you. You.",
            "start": 3439.99
        }
    ]
}