{
    "id": 2900,
    "video_id": "V6yw9pxRYcc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Troy Baker (Special Guest) - The GameOverGreggy Show Ep. 193 (Pt. 4)",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/greggy\n\nThe Kinda Funny store is having an End of Summer sale! Shop through August 20th for up to 40% off select items-  https://goo.gl/E3TpJN\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502953624,
    "duration": 1545,
    "transcript_chunks": [
        {
            "text": "Hey, you, you know what you need? Razors. You know what the Dollar Shave Club has? Razors. So stop paying so much for razors and join the Dollar Shave Club, you hairy person. They let me write this ad and I know you like being insulted a little bit, don't you, you hairy degenerate? Dollar Shave Club is the smarter choice. Get a great shave at a great price, conveniently delivered right to your door. Think of it as a life hack that keeps you near your video game console and not out at some store being eyeballed by that cashier. Yeah, I know you're looking at me, Tony, what are you going to do about it? Tim uses Dollar Shave Club's Executive Razor with that Dr. Carver Shave Butter and you know what he's always telling me? He says, \"Oh, I'm a smooth boy, Greggy, am.\" And then he takes a bath. For a limited time, new members get their first month of the Executive Razor with a tube of Dr. Carver Shave Butter for only $5 with free shipping. After that, razors are just a few bucks a month. That's a $15 value for only",
            "start": 0.0
        },
        {
            "text": "members get their first month of the Executive Razor with a tube of Dr. Carver Shave Butter for only $5 with free shipping. After that, razors are just a few bucks a month. That's a $15 value for only five bucks. There are no hidden fees, no commitments, cancel anytime you like. You can only get this offer exclusively at DollarShaveClub.com/greggy. That's DollarShaveClub.com/greggy. Kevin made me read this ad multiple times against my will so I didn't laugh. I've been prepping you all for my topic, topic number four, okay? And I'm going to read it verbatim 'cause when I wrote it down, I was like, \"This is a work of art.\" You do this, that this episode is going to be Troy Baker part one, part two, part three, and then a topic, Greg's topic. Am I going to miss my flight? What time is your flight? 8:45. No, you're good. No, you should leave here at 6:45 at the latest, so you're fine, right? What time is it? It's 6:00. Oh yeah, this won't go for forever minutes. It's fine. What, what movie monster are you supremely confident",
            "start": 50.68
        },
        {
            "text": "no, you should leave here at 6:45 at the latest, so you're fine, right? What time is it? It's 6:00. Oh yeah, this won't go for forever minutes. It's fine. What, what movie monster are you supremely confident you could beat the shit out of? Chucky. The Mummy. Fuck Chucky. I could dropkick a child. But Chucky's always making the moves you don't expect. Always, dude. Chucky, dude, I went to college. That's a close-range, that's a close-range weapon. You could dropkick. I went to college. I could beat up Chucky, dude. Like, college education doesn't mean you could fight. He's constant. No, no, no, but, but no, but Greg, think, think. Yeah, Greg made a like, oh, but Chucky always, are you supremely confident you could beat the show? I'm supremely confident I could beat the shit out of Chucky, dude. He seems easy, right? Kick the knife out of his hand, grab him, put him in a safe, lock the safe, the safe, the rest of your life. Wood chipper. Just jump. No, no, then is a fucking rat and breathes them in and that's Chucky. You can't do that. Oh,",
            "start": 115.96
        },
        {
            "text": "out of his hand, grab him, put him in a safe, lock the safe, the safe, the rest of your life. Wood chipper. Just jump. No, no, then is a fucking rat and breathes them in and that's Chucky. You can't do that. Oh yeah, you can't kill him. That'll bring him back. I can't fuck up a rat. I could fuck up a dog. I could like, I could just fuck but he always has knives, remember? Always just fuck him. He's going to have knives. I'm just saying, fuck him. And then real talk though, like I feel like I'd be more scared of a doll. Oh no, of a rat than a doll. I feel like there's a list that's coming. Is that Clear and Present Danger? Is that the whole Jack Ryan collection? That is the Jack Ryan collection up there. But then there's the weird Ben Affleck one that just doesn't make sense. Well, that was great. The bomb is in the building. The bomb is in play. Uh, you said The Mummy. Yeah, I'm going to grab this, this, this loose hair. Can't do The Sum of All Fears. Which Mummy are we talking about? Boris Karloff? All right, yeah, The Sum of All Fears.",
            "start": 161.92
        },
        {
            "text": "building, the bomb is in play. Uh, you said The Mummy. Yeah, I'm going to grab this, this, this loose hair. Can't do The Sum of All Fears. Which Mummy are we talking about? Boris Karloff? All right, yeah, The Sum of All Fears. Here is the one. Russians. Not the Arnold Vosloo, not and not the uh, not the Brendan Fraser one. No, Nosferatu. Oh, my apologies. That's that's the the didn't Brendan Fraser direct, right, and star in The Mummy? He did not direct it. Uh, it was it was directed by he didn't write it either. No, he did not direct it. He didn't do much anything. First of all, that is a that is a I love that movie. Watch. He was great in BAS. No, that was the end of his career. The drink. Elizabeth, let me tell you. Um, Elizabeth Hurley as like, I'm still sexy. Like, you're not Kelly LeBrock part two is like what call childhood dreams. Ha. But see, Kelly LeBrock for me, Kelly LeBrock and Elizabeth Hurley are literally the same person. Oh, I tell her that Brock is neither. Yeah, you do weird. You actually don't know weird signs. Nick makes a bunch of",
            "start": 200.8
        },
        {
            "text": "Kelly LeBrock for me, Kelly LeBrock and Elizabeth Hurley are literally the same person. Oh, I tell her that Brock is neither. Yeah, you do weird. You actually don't know Weird Science. Nick makes a bunch of Weird Science jokes. Nick used to say that me and Alfred, Weird Science, and I don't know what that means. The Weird Science girl. Yes, I know it's not the TV show, the movie. Oh, never mind. Oh my God, these young fucks. Give me the keys. They talking that shit. Kick me in the nuts, dude. Come on. It's so weird to see him now, by the way. Anthony Michael Hall. Jack. It's like weird. He's like, I'm a serious actor. No, you're not, dude. He did The Dead Zone. It was a great show, great show. He died or something, came back and could see ghosts. I forget. Seen show? No, you've never seen The Dead Zone. Walken. That's the movie. Christopher Walken. It's his first movie. Wow. After he did. I love this. This is like the Troy Baker GameOverGreggy Show Universe coming all. There's a movie that he did, The Deer Hunter. That's crazy.",
            "start": 253.04
        },
        {
            "text": "Christopher Walken, it's his first movie. Wow. After he did. I love this. This is like the Troy Baker GameOverGreggy Show Universe coming all. There's a movie that he did, The Deer Hunter. That's crazy. Fantastic. Yours is awful. Don't disrespect Troy Baker by doing your front of him. You're not invited. The Walken. Oh, he did that. That's as bad as my mic. Wow. I don't like it. He do he did uh, he did he did The Deer Hunter. Yeah. And then they looked it was like that look that you give the very end when when they're doing the whole uh, Russian Roulette thing. He did The Dead Zone. It's it's freaking awesome. It's so good. And then you start seeing like it's like proto-Walken. Like you're seeing the early version of what he's going to become. Yeah, it's fantastic. Uh, but Kelly LeBrock, bro, made a lot of happy dreams come true for nerdy boys like me because that's what the whole movie is about is in the face. You get a man. The late great uh, um, what, Chad? Uh, um, oh, I can picture him. Chad's the dad. Yeah, hold on. It's almost there. Bill.",
            "start": 297.76
        },
        {
            "text": "nerdy boys like me because that's what the whole movie is about is in the face. You get a man. The late great uh, um, what, Chad? Uh, um, oh, I can picture him. Chad's the dad. Yeah, hold on. It's almost there. Bill Paxton. Bill Paxton. Um, boy, what a fucking surprise that was. Uh, Bill Paxton plays his brother. You cigarette. Poor you. Well, that's way to pull, man. Um, that Titanic. I feel like you're going off the list. Titanic, right? He isn't Titanic. No, Bill. Yeah, dude. Bill Paxton's the dude. He was the fucking documentarian. Like, fuck. Hey, real. I want to do a whole top about Titanic years. There it is. It is. Try to remember. And no, you didn't let me finish. It's been 84 years and I can still see the silverware. Oh man. Al. Oh, movie. Um, so what are uh, what were you? I feel like you're like going on a list like this. No, no, I mean, I just want to know. You said The Mummy. You think Boris Karloff The Mummy? Boris Karloff Mummy. So give me a list though, Greg. Like, who are Dracula? I'm thinking monster. Fuck up Dracula. Nosferatu. Yeah, well, I mean, like,",
            "start": 347.16
        },
        {
            "text": "want to know. You said The Mummy. You think Boris Karloff The Mummy? Boris Karloff Mummy. So give me a list though, Greg. Like, who are Dracula? I'm thinking monster. Fuck up Dracula. Nosferatu. Yeah, well, I mean, like Nosferatu or or like like G. Anyone. I'm I'm picturing Monster Squad, but it's open new interpretation. I'm picturing smaller beings that I could overpower. Like, I do more push-ups than you. You're so small. Like, like could you fuck up with Gremlin? Andy. I watch Andy fuck punt a Gremlin, dude. The problem is there's always going to be more. Come here. Come here. Lips off. But they come here. Come here. Come here. What did you just say about Gremlins? What did you say about? They look soft, but they're hard, man. Gremlins are crazy. I don't got else anything else to say. Oh, they look soft. Gremlin. Gremlins got claws. They'll fuck you up. Gremlins look soft, but they hard, bro. If that's not a T-shirt by tomorrow morning, I want just with the outline of a Gremlin head around it. Andy makes T-shirt, but the quote, \"Hard, bro.\" Every quote",
            "start": 408.92
        },
        {
            "text": "you up. Gremlins look soft, but they hard, bro. If that's not a T-shirt by tomorrow morning, I want just with the outline of a Gremlin head around it. Andy makes T-shirt, but the quote, \"Hard, bro.\" Every quote that Greg says on his shirt every day would have some fucking new, man. Holy shit. Fuck. See what I jump to is I get your place now. I get you now. Mine is actually a very double-sided blade. It could go either way. Troy Blade. No, no, is a double-sided blade. Every stick with me. I know we all been drinking. Tax evaders. That's what I'm going to get him on. No. Creature from the Black Lagoon on land. You ever see Monster Squad when this shit walks out of the water? Like, no one saw. You're a fucking idiot. I you seen Monster Squad, right? Thank you. Nobody saw Monster Squad. Fuck you. Fuck you. You seen Monster Squad? Yeah. Scott Butterworth seen it. Yeah. Hell yeah. Cool. Greg, hat you have? Yeah, I don't remember, but I have. Oh, we're going to see it again then 'cause my brother's all about the monsters. You know what that phrase",
            "start": 459.48
        },
        {
            "text": "Scott Butterworth seen it. Yeah. Hell yeah. Cool. Greg, hat you have? Yeah, I don't remember, but I have. Oh, we're going to see it again then 'cause my brother's all about the monsters. You know what that phrase means, by the way? Either. Okay, there's there's one of two meanings when I don't remember, but I have seen it. Either A, fuck, you're lying and you're trying to be cool. Or C, or B. Wow. Or two. Oh yeah, but you're the adult. We're not you. Or you were so high when you watched it that it's the literal truth. You're like, \"Yo, I know that somebody put that DVD in. I don't remember. I don't remember. I don't remember.\" I have many of those movies where it's like, I actually I I have uh, I I I would probably confess that I've done that before to was like, \"You've seen this movie?\" Like, \"Absolutely, man. Yeah, I don't remember it, but yeah, I've seen it.\" I don't know what movie you're talking about, but I don't want to incriminate right myself. I I want to get into that sociological conversation, but more than likely it's I know",
            "start": 515.36
        },
        {
            "text": "it, but yeah, I've seen it. I don't know what movie you're talking about, but I don't want to incriminate right myself. I I want to get into that sociological conversation, but more than likely it's I know that we started that movie and I got really high. October. Yeah, that's your your one ping only one. Leave a message, please. Never seen it, but I just know that quote 'cause a long time ago on a GameOverGreggy Show, we told story. Seen Kevin? You remember this? You remember this from whatever went from one ping over? Yes, cold and hard. Remember that? I remember that show. Then I gave the bridge talk. You should try to get some sleep. Sir, I can't sleep on planes. Why? Turbulence. Excuse me. Turbulence. Uh, sun and don't call me Shirley, right? What wrong movie? Radiation from the Sun. He's to Earth's crust causing a warm air to rise up. Turbulence. Sorry, it's the dude, Alec. It's a submarine who we were having the Alec Baldwin conversation earlier, right? Okay, right here. You on this show 'cause you've been back so many times. Well, no, no.",
            "start": 557.28
        },
        {
            "text": "rise up. Turbulence. Sorry, it's the dude, Alec. It's a submarine who we were having the Alec Baldwin conversation earlier, right? Okay, right here. You on this show 'cause you've been back so many times. Well, no, no, no, you said this. I'm just bringing. There's there's there's three things that okay. I I I was in New York and I was uh, in the lobby of a hotel and about the distance from me and Kevin was Alec Baldwin. Nice. And I went, \"Oh, I really just want to go over there and say these three things.\" Um, Hunt for Red October. Um, don't laugh. The Shadow. No, what? And this thing that he did, he narrated for I wouldn't even bring up Final Fantasy, but that'd be probably be bad memories. No, Spirits Within. Yeah, it's great. He's fantastic in it. It was a thing. Um, and then this thing that he did like Nat Geo called Metreon. Huh? No, I saw it in Illinois. Oh, I saw in Metreon like a fucking adult. Oh, sorry that the show finally off the rails. And third, there's three things I would bring up to Alec Baldwin is number one would",
            "start": 608.04
        },
        {
            "text": "huh? No, I saw it in Illinois. Oh, I saw in Metreon like a fucking adult. Oh, sorry that the show finally off the rails. And third, there's three things I would bring up to Alec Baldwin is number one would be Hunt for Red October. Number two would be what the fuck? Second thing that I said was uh uh The Shadow. The Shadow. 'Cause he was has a brilliant thing was like uh, he's great in it. The movie is terrible. It's not what I do that defines me. No, that's that's Batman. And number three would be this thing that he did for Nat Geo where it's a single camera shot from Earth to as far as we can see to the beginning of the universe. Saturn over an. No, we can see further than that. Hour and a half. Neptune. Narrated by Alec Baldwin. Like, this is our world. It's brilliant. And I couldn't muster up the strength to go up to because I didn't want him to go over 'cause he was having a really intense conversation with like a business associate. I didn't want him to go, \"Go fuck yourself.\" And would been like, \"Ah, you've been on the",
            "start": 659.4
        },
        {
            "text": "I didn't want him to go over 'cause he was having a really intense conversation with like a business associate. I didn't want him to go, \"Go fuck yourself.\" And would been like, \"Ah, you've been on the other side of that.\" Not that you would ever tell anybody to go fuck yourself, but where you're in the middle of something and someone comes and you're going to get a car and blah and like that's always what it is for me where it's like, I don't know what that person's rules are and somebody talking to them. I lost my shit at some people at an airport really just recently. I and I had to I went back through the airport and I and I found them. I I was at a con and I you have a human moment. Yeah. And you know we have Wi-Fi on the plane and stuff, so it's not like I get on a plane and I'm cut off. I'm still doing shit. And just some really gnarly shit went down over this plane. And so I get off and I wait like, what? Turbulence? No, no, no, no, like like like work-wise. Like I was I was juggling shit and look,",
            "start": 712.8
        },
        {
            "text": "shit and just some really gnarly shit went down over this plane. And so I get off and I wait like, what? Turbulence? No, no, no, no, like like like work-wise. Like I was I was juggling shit and look, it sounds super privileged and I get that. I travel a lot and there's a few things that I that I care about. It's like, uh, I want to I'll travel well, but if I go to a city that I'm not familiar with, just let F1. Um, let me know how I'm getting out of there. Like, I I want I want someone to to to get me through that situation. Sure. Um, and there was nobody there to greet me or let me know where I'm going or anything. So I'm lost. I'm looking for somebody. And when you go to a town that's having like a big convention, um, there are people there waiting at the airport for you to sign stuff. And sometimes that's cool. Other times it's like, \"Hey, man, not now.\" And they just kind of keep coming after you. And the these guys came up to to me and I I I said, you know, \"Hey, man, guys, not not right now.\" I was like, \"Come",
            "start": 746.08
        },
        {
            "text": "cool. Other times it's like, \"Hey, man, not now.\" And they just kind of keep coming after you. And the these guys came up to to me and I I I said, you know, \"Hey, man, guys, not not right now.\" I was like, \"Come on, Troy, don't be a dick.\" And so I grabbed stuff and I said was like, \"Fuck, there you go.\" And I like yelled was like, \"You have no idea what happens to somebody. Just fuck off.\" And I like I lost my shit on it. And they like were taken back. And I walked outside and I found out where the the guy with the car was, whatever. And I I walked back through the airport and I found him. I was like, \"Hey, guys, I'm so sorry. Um, just understand that, you know, you have no idea what what's happened from the time that we took off in time we land. Yeah. Um, you're doing your thing. I I get that. And I'm really, really sorry. Uh, you caught me in a human moment. I hope you're going to forgive me, but just just if somebody says no, take the no, you know?\" Sure. So this was really cool moment. They were like, really sorry, totally apologized. And they",
            "start": 799.8
        },
        {
            "text": "me in a human moment. I hope you're going to forgive me, but just just if somebody says no, take the no, you know?\" Sure. So this was really cool moment. They were like, really sorry, totally apologized. And they were cool. Um, but I wonder how many people Russell Crowe is different. You don't beat somebody up with a phone. Um, but there's those human moments that you catch people in that you don't. Like, I I had the the sight, I guess, or whatever to not look at Alec Baldwin because I had no idea. And the guy's not necessarily the most even-tempered dude. He's not measured necessarily. But I I I've got a friend of mine who has had several opportunities to meet Bob Dylan. And the the phrase, \"Never meet your heroes,\" really applies to him because he loves Bob Dylan so much that if he met him and Bob Dylan just if that meeting wasn't the thing that he wants it to be, it would ruin all of it. Like Nick and Bruce Willis. What? Nick's a huge Bruce Willis fan. And then on on on an on a on one of the IGN lines, it it wasn't even it",
            "start": 844.44
        },
        {
            "text": "wasn't the thing that he wants it to be, it would ruin all of it. Like Nick and Bruce Willis. What? Nick's a huge Bruce Willis fan. And then on on on an on a on one of the IGN lines, it it wasn't even it wasn't even Nick's pro Nick didn't even transgress, but it was the guy Bruce Willis did the interview. It was fine and went next. And then somebody took a photo of Bruce Willis, right, while he's doing an interview. And Bruce Willis like stopped the interview like and he's like, \"I'm sorry, what the fuck did you just do? You just take a photo of me?\" Like, \"Well, I'm in the middle of blah.\" And the guy's like, \"I'm sorry, I didn't.\" Like, it was that thing where it ruined it for Nick. Nick's on the show before a million times. And but that's my thing too where it's like, I'm always so forthright with our viewers, our best friends, right, of like, if you see me, come up and say hi, talk to me, give me a hug. Like, I'm not that guy. But then like the other side of the coin is like, you know, uh, I was like, it was a weird thing of like,",
            "start": 890.04
        },
        {
            "text": "right, of like, if you see me, come up and say hi, talk to me, give me a hug. Like, I'm not that guy. But then like the other side of the coin is like, you know, uh, I was like, it was a weird thing of like, when Silicon Valley Comic Con was happening, uh, Jen and I went out to breakfast and I thought I saw Steve Wozniak on the street. And I Googled like the most recent photo I can find. It wasn't him. I was like, \"Oh, that's one.\" And the next day, I was in the airport after that con had ended. And I literally passed Steve Wozniak and walked next to him for a second. And I wanted to say thank you and this thing there. And it's was just like, I don't know his rules. I don't know how he feels 'cause I, you know, I have this old story of CM Punk where I saw CM Punk and I tapped him on the shoulder and I said, \"Excuse me, sir.\" And he blew the fuck up. And now I still to this day think he overstepped it, but those were the rules for him. And it's made me gunshot to a point of like, \"Well, I'm not going to fuck.\" He always been super cool",
            "start": 933.92
        },
        {
            "text": "the fuck up. And now I still to this day think he overstepped it, but those were the rules for him. And it's made me gunshot to a point of like, \"Well, I'm not going to fuck.\" He always been super cool whenever I see him. But I I understand like that that's not the guy that you just like test those waters. I going to poke, you know, poke this Rottweiler. Um, it's so weird because I mean, I've I've had I've had stories that go both ways. I've had stories where it's it's really, really cool. I was walking through the grocery store that's right by our house. And Malcolm X. Malcolm X. You know the story. I'm walking through and I look and I'm like, \"Holy fuck, that's Dave Grohl.\" Oh, wow. And so Dave Grohl's kind of looking and I walk past him. I go, \"Hey, man, I think you're brilliant.\" Yeah. And I just kept walking. And he goes, and to this day, I have a tendency to speak a little bit lower and a little bit fast. Yeah. So I don't know what he heard. He could have been like, \"Hey, I think you're fuck.\" Yeah. Like, all I know is",
            "start": 971.16
        },
        {
            "text": "goes. And to this day, I have a tendency to speak a little bit lower and a little bit fast. Yeah. So I don't know what he heard. He could have been like, \"Hey, I think you're fuck.\" Yeah. Like, all I know is that I imagine this is Dave Grohl's perspective of that situation. Wife tells me to go to the grocery store. And I think he's looking at like tampons. Like he was looking at it. He was clearly like trying to discern between brands or something. He's like, \"I I don't know what she said. Heavy flow. I I don't I don't know what this thing.\" \"Hey, man, I think you're brilliant.\" This is my life. Yeah. You know, some guy happens to catch me in in this human moment. Um, but I've had a couple of those where it's just, \"Hey, I want to take a second to let you know that what you've done has meant something to me.\" Yeah. And there's sometimes when we don't need to have a 10-minute conversation or even a picture. I just I don't know what your day looks like, but I like what I love about what you guys have done is that you've",
            "start": 1021.48
        },
        {
            "text": "sometimes when we don't need to have a 10-minute conversation or even a picture. I just I don't know what your day looks like, but I like what I love about what you guys have done is that you've created a community. M. And it's something that I think at at the beginning was about you and then it became about all of you. And now it's about so much more than just you guys. Sure. And when we're in Belfast, Ireland, and people are walking up with that, that shit gets me, man. When you go when you 'cause you get to go to so many more International cons. We do. And when they go to you and they wear a Kinda Funny shirt and they're like, \"Troy noticed the shirt and said that B and Best Friends.\" And I'm like, that's how I mean, like, I've known for years that you're you're the man, dude. Mario, man. Shout out to Mario. He fuck did it. That's that's impact. And again, that's not about you. That's not about even this. It's about that. It's about all of that to where there's a and I got a taste of it when we were doing the album.",
            "start": 1072.16
        },
        {
            "text": "did it. That's that's impact. And again, that's not about you. That's not about even this. It's about that. It's about all of that to where there's a and I got a taste of it when we were doing the album and we we did the Twitch live streams and stuff. And the guy from Twitch was like, \"You guys have been off the air for an hour and there's still people hanging out.\" Is the the people that are just there talking. They just want to be there. And I know this because I am a part of those communities. I talk about this so much, but the tone-deaf stuff. Like those communities I was a part of. I would be there. I would be in the communities. I still am in these communities. When things happen, I'm there. I'm talking. I am part of this conversation. And it's the off-air stuff matters. That means that these people did something so important to someone's life that the chat is still going when they're off. And I love that. I love it. So you're just willing to talk to like-minded people about and that's the beauty or even not",
            "start": 1122.96
        },
        {
            "text": "so important to someone's life that the chat is still going when they're off. And I love that. I love it. So you're just willing to talk to like-minded people about and that's the beauty or even not necessarily like-minded people, but people that the the interest. Yeah, we we're here. We don't necessarily agree on this, but we agree on this. So it's not necessarily about being like, you could have Republicans and Democrats, you know, in the same room together. You could have people that are are from all walks of life. But that's when you know, like that time when I quit Twitter or whatever and you look and you go, there is some magic. There is some beauty to be found in this. Sometimes you have to dig a little bit deeper, but God damn it, guys, there's there's people like you that are the the bastions of that that are to me are holding the front line of being able to go, \"It's really ugly in here, but we'll at least be here to give you shelter from that storm.\" Um, and I I really I I say this every time that",
            "start": 1172.76
        },
        {
            "text": "that are to me are holding the front line of being able to go it's really ugly and here but will at least be here to give you shelter from that storm um and I I really I I say this every time that I'm here um I really commend you guys because there were no heavier nor more brass balls that it took to walk away from the gig and to just literally do the Indiana Jones leap of faith from the lion's head and and to step out and to be in in this and to see not only you guys surviving but thriving is is is just amazing and I I call you friends and I call you family and I'm damn proud of you guys that's true you were the first host of Kinda Funny Live and you always will be and it's so funny cuz like we've now done three of them Kinda Funny Live One was a moment in time and it was more than we ever deserved but we had it right and you were there and you **** rocked it thank you man and you've seen from the internet Kinda Funny Live Two and Three like stupid it's what is stupid right what",
            "start": 1221.84
        },
        {
            "text": "we ever deserved but we had it right and you were there and you **** rocked it thank you man and you've seen from the internet Kinda Funny Live Two and Three like stupid it's what is stupid right what you've seen the jump right you know exponential how much bigger like at Kinda Funny Live One we had one projector showing videos not even on the set it was on the right like it was just **** me and Nick had a conversation about should we get two and it was like oh it's not in the budget like we just can't do that and now brother man just like stage man that **** was just amazing this day he still does I believe we perfected it Kinda Funny Live was amazing Kinda Funny Live Three I didn't think it could be two and it did it really **** did now that it's out and everyone can see it I'm so proud of it and I just like it makes me proud to think that you can see parts of it and be proud of where we're going I think honestly that's what this community is based on is that people have",
            "start": 1277.08
        },
        {
            "text": "so proud of it and I just like it makes me proud to think that you can see parts of it and be proud of where we're going I think honestly that's what this community is based on is that people have agency in this yeah and so it's just like me I get to see you guys twice a year maybe three times a year if that if I'm lucky and but I still feel like I have agency and I I get to share in the pride and celebrate and like **** yeah they hit that level or you know watching from afar and and being able to really be upset that I wasn't able to just be in the crowd at Kinda Funny Three and then going what the **** are they going to do for kind of by the way if you don't even have a Rocky theme or a Superman theme for four you guys are wrong because that's a poster like Kinda Funny Live Four the Quest for Peace the it's just like it's just the everybody's like you know what yeah this should end this is probably the best point for an end but no I mean that's you know every time you come on I",
            "start": 1322.64
        },
        {
            "text": "Quest for Peace the it's just like it's just the everybody's like you know what yeah this should end this is probably the best point for an end but no I mean that's you know every time you come on I hope we tell you enough how much we love you how much we love your support I mean you were my last Up at Noon guest for a reason and you immediately came over to do Kinda Funny stuff the next day cuz you're family yeah man we love you thanks dud love you too if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bringing a random topic discussion for your amusement sometimes if you like that head over to Patreon.com/KindaFunny where you can get each and every episode early how early Troy Baker how early so early you can watch it while we're doing right now and nothing can get cut out so whatever the **** happens happens you got no bucks to toss our way no big deal head over to",
            "start": 1367.72
        },
        {
            "text": "Troy Baker how early so early you can watch it while we're doing right now and nothing can get cut out so whatever the **** happens happens you got no bucks to toss our way no big deal head over to YouTube.com/KindaFunny where we put it up topic by topic day by day until it goes up his one big video and MP3 Troy thank you as always my pleasure dude my pleasure thank you guys for having me as always I'm so impressed that you could say all that right now I know dude that that's autopilot Greg Miller is so good at this whole host anything no one gives him enough credit for it cuz it's like we have to do on the Morning Show and I'm sure you guys have noticed but whenever it's me or Nick having to do it we kind of half as it we're just like we're here we're we're doing this thing it is what it is whatever or Gamescast there's a lot there's a lot of that but uh for me it's just like I when I'm a Gamescast I just kind of do the whole SC thing Greg Miller's actually talented at what he",
            "start": 1404.32
        },
        {
            "text": "it is whatever or Gamescast there's a lot there's a lot of that but uh for me it's just like I when I'm a Gamescast I just kind of do the whole SC thing Greg Miller's actually talented at what he does here this is the bourbon talking about there used to be an old show called Tough Enough where they would go and train people who want to Superstars uh-huh uh-huh uh-huh and Taz God Rest his soul Taz isn't dead Taz isn't dead but he did it there was they were talking about taking bumps and these kids were complaining about how hard no no taking bumps where you fall down you hit the mat you spread your body weight out you know what I mean how you fall on the mat and not get hurt and uh something that always stuck with me is these kids were bitching on it and Taz is like you're all idiots like I could slip on a block of Ice tomorrow and I would take I would take a bump like because it's just second nature and it's that I can be blackout **** drunk I can intro and outro this show",
            "start": 1443.16
        },
        {
            "text": "like I could slip on a block of Ice tomorrow and I would take I would take a bump like because it's just second nature and it's that I can be blackout **** drunk I can intro and outro this show nobody's business don't worry about that you can bring p shoot him right there I'd be like well this table you know what I mean like I would roll on this is all the stuff that normally the credits are rolling over AIO is dead that's and you just described all of Kinda Funny sport content until next time ladies and gentlemen it's been our pleasure to serve you hey party people guess what there is a sale over at KindaFunny.com store up to 40% off select items Monday through Sunday go check it out have a good time and of course click here here to go check out our Patreon click here to subscribe to Kinda Funny click here to go to Kinda Funny Games and click down here to go to the Mystery Spot guess what it's just a playlist of fun videos we enjoy that's what I like to put there oo I'm a",
            "start": 1484.96
        },
        {
            "text": "to Kinda Funny click here to go to Kinda Funny Games and click down here to go to the Mystery Spot guess what it's just a playlist of fun videos we enjoy that's what I like to put there oo I'm a smooth boy gregy m",
            "start": 1530.08
        }
    ]
}