{
    "id": 2896,
    "video_id": "W-MA6kpcttc",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Anthony Ingruber",
        "Troy Baker"
    ],
    "title": "Batman Let's Play with Troy Baker, Anthony Ingruber - Kinda Funny Plays",
    "description": "Batman and the Joker sit down with Greg for a full playthrough of Batman: The Enemy Within Episode 1!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1502380805,
    "duration": 8725,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to your Let's Play, it's a Twitch cross YouTube Let's Play but both are Kinda Funny Games. I'm one of your hosts, Greg Miller, alongside Troy Baker. Who are you talking to, the people out there and all these people right there? I'm talking right now to ex-predecessor people are watching this. Yeah, that's right. I'm sorry I lied to you about that. That's Anthony Ingruber. Hi, hey. And they they made a game called uh Batman: The Enemy Within, just us, nobody else credit. How did you get the Batman license, Anthony? Surprised out there's some very angry emails that I'm just not answering. Hit the publish button, walked away. No, Troy, you're Batman. I am. Anthony, you're John Doe/Joker. We know it now, we know proto-Joker. Episode one here, Season Two, just out. We're going to do an entire play, we're going to play the entire thing right here for your amusement. Uh, cheers gentlemen, congratulations. You little bit of the uh the bourbon. M, it's just chocolate syrup with honey and the BBS the B.",
            "start": 0.1
        },
        {
            "text": "we're going to play the entire thing right here for your amusement. Uh, cheers gentlemen, congratulations. You little bit of the uh the bourbon. M, it's just chocolate syrup with honey and the BBS the B. It's a thing like like can't come on the show and not I think I've done it 9:00 a.m. before and I I still have uh I still have had the the creature a bit. You got to you got it, you can't not have it when you come in here, right? I've tried not, it's not that I have a problem with, you can't be around me and not drink. That's what it is. Yeah, exactly. Only way I tolerate it's how you keep your voice so sultry. Christmas is weird. Yeah, just because how you guys doing? I'm freaking great. This is the first time that he we've met via the Skype. Hold on one second. No, via the Twitter, Andy. Hey, come here. You're a PC dork, make it work. It's connected, it says it's on. I f*** hate PC gaming with every goddamn fiber in my body, but I'm about to break. I'm about to break. There's just two I want to play, there's a lot.",
            "start": 46.0
        },
        {
            "text": "PC dork, make it work. It's connected, it says it's on. I f*** hate PC gaming with every goddamn fiber in my body, but I'm about to break. I'm about to break. There's just two I want to play, there's a lot of there's a lot of games. You're going to break and go PC. I think so. Don't do it. I'm going to do both. So like I'll always I'll do like real world stuff, yeah, on on my Mac and my and I still play my consoles, but there some stuff. No, we're going we're going to create it, we're going to create it. But you it should know from the beginning though, right? In in test runs it knew that I had a controller on. Use default. Oh, oh, I see what you're saying. This is live TV, it's fine. Anthony's cool, or Anthony, you're cool with it, right? I'm this close to walking. Do I have to restart it? You Scott, you made this game. Do I have to restart it to uh you shouldn't have to, but it could try. God, it's not cooperating. Game, do you want me to take the screen off the game off? No, I don't care. High f*** is blue. They hello, oh.",
            "start": 94.52
        },
        {
            "text": "do I have to restart it to uh you shouldn't have to, but it could try. God, it's not cooperating. Game, do you want me to take the screen off the game off? No, I don't care. High f*** is blue. They hello, oh. Good good job. You see name is Nick, he's a good guy. Nick, guys, why don't you use probably hardware, not software? I regret nothing. Thing, I'm going to restart the game, but I mean as far as menu screens go, it's a you can't fault no expense on the menu screen. Sure, look at that handsome. That's you. All right, look who that. Now it's on and it's connected. I'm going to hit play. Don't tell tell games, don't shrug at me when I say. Stop. Hold on everybody. I blame Windows. Yeah, I blame PlayStation for not giving your code ahead of time. You got top billing on um on the Tweet there. That's pretty cool. Did I really? Yeah, we'll talk about that later. Okay, we can delete it there. Why you looking at me? I didn't. What tweet? Kinda Funny tweet. Who sent it? Joey did. Who the f*** was it? Oh, there we go. Now we're going.",
            "start": 136.36
        },
        {
            "text": "yeah, we'll talk about that later. Okay, we can delete it there. Why you looking at me? I didn't. What tweet? Kinda Funny tweet. Who sent it? Joey did. Who the f*** was it? Oh, there we go. Now we're going. Connectivity issue solved. You didn't bring me this. You got to switch off. If you didn't bring me this full opportunity here, you're something. All right, you a great employee and a good friend. I am a little far away, aren't I? Scooch on in. Don't be friend. Wait a minute. Uh, there we go. You move. We you can do whatever you want. Yeah, you can touch it. You you can pick it up. This thing it isn't look it weighs nothing. Wait a minute. This isn't a this is a TV. No, this is this is one of them eye devices I've heard of. Are we going to play a game? All right, we're jumping in now. Woo. Uh, continue your story, right? Well, I I played on PC like a real man. I playing this PC, you know. Oh, did you see what you just said? Yeah, I did. I know. I'm starting s***. Oh, no, you said I played on a PC like a real man. All right, so here we.",
            "start": 192.2
        },
        {
            "text": "I played on PC like a real man. I playing this PC, you know. Oh, did you see what you just said? Yeah, I did. I know. I'm starting s***. Oh, no, you said I played on a PC like a real man. All right, so here we go. Here we go. So what we're going to do here is so that I play on PlayStation 4 with my canonical Batman, my my cannon. I'm going to make all the opposite choices here so I get to see the game from all sides. All right. Okay, you're you're you're doing the you're doing the I'm going to break the game. Yeah, exactly. I had people, I had Children of Arkham attack Selina in Season One. So I'm I'm I'm going to choose Harvey here. Wait, wa wait. You okay, so you say this opposite day. So I'm ask about your because this is a big choice. Brain's beaten out by that uh lamp or whatever. Yeah, you chose to save Harvey. Yes, so did I. Reason Catwoman can take care of herself. That was my thing too. Harvey at the time, I was like, he's an innocent, he can't do this. I mean, he's built like a linebacker, they can't take that.",
            "start": 237.8
        },
        {
            "text": "yes, so did I. Reason Catwoman can take care of herself. That was my thing too. Harvey at the time, I was like, he's an innocent, he can't do this. I mean, he's built like a linebacker, they can't take that. Voiced by complete joke of a human being, but total was other than that, he's fine. So now we're we're going to say then seriously, Travis Willingham, he's garbage. P. Oh, see, this was a scene, dude. Yeah, it was. This is some of your f. It took us forever. Well, this because I didn't say anything. Yes. Um, there was so many bad jokes about there being a cat in the room and playing with it, but I didn't. Um, it took us forever to get that thing right. It's super hard to pull off like romantic interludes and whatnot in this thing. All right, it well done. I of course spent the night with her. So now I'm gonna say no here. What I have to I have this is hurting so bad. Was it Bruce? Either way, I mean, like there's so many ways that you could spend the night. There's there's the one you like pick her up and take her to bed and.",
            "start": 285.24
        },
        {
            "text": "I have to I have this is hurting so bad. Was it Bruce? Either way, I mean, like there's so many ways that you could spend the night. There's there's the one you like pick her up and take her to bed and you like kick the door with your foot, which is baller. Um, there was a scene where I swear to God it looked like, can I say this? It looked like Bruce. We had to cut it. It looked like Bruce went down on her. I saw and we were like, that wasn't necessarily the intention. A philanthropist that he's a giver. Uh, but it just it just looked it looked like that. So we're like, ah, we got to get rid of this. Um, however, it would have been like a bold statement. It's like, cuz you know, like patriarchy would have been the reverse and sure, sure, sure, sure. I take care of my. I'm not staying with her in this one, cuz this is my throwaway save. Now I don't use the save anymore. I just want to see it. So we're not spending the night with her. All right. I job Sil just had a heart attack on vacation when I said that too. Now I went after.",
            "start": 331.76
        },
        {
            "text": "save now I don't use the save anymore. I just want to see it. So we're not spending the night with her. All right. I job Sil just had a heart attack on vacation when I said that too. Now I went after the Penguin, cuz I I'm of the, you know, f*** the Bruce Wayne Legacy. I'm I went for Two-Face, cuz I wanted to see Alfred with that gat. Sure, sure. Okay, okay. I well, yeah, I'm going. I went after Two-Face, so I because I I wanted to turn Harvey around. Did it work? Well, du no. Yeah, if you played the game, no. Okay, so oh, um, I intervened in real life, cuz I'm Batman. I'm a good person. You too. I ran for the phone. Those guys are in prison. They knew what they were doing. Get out of the way. Get out of prison. I can't do anything in Arkham. You knew. Get out with that. It you didn't have to do. Well, I mean, you played the character. So so you're talking about, you know, canonical. Sure. Okay, so I'm going to be a coward here and ran for the phone like a coward, like a coward. It's a pragmatist. That was the whole reason I started.",
            "start": 376.32
        },
        {
            "text": "so so you're talking about, you know, canonical. Sure. Okay, so I'm going to be a coward here and ran for the phone like a coward, like a coward. It's a pragmatist. That was the whole reason I started the ride. Did you owe John a favor? I did, but I'm not going to own him here. I did in my in my real save. I will in my real save. I'm a good Batman. Yeah, let's turn it down. Well, you were just we parted as friends. Friends. Yeah, so I'm going to be enemies here. Oh, what? Cuz this is my this is my see the other is messing with my head. What do you think? Tell Troy said he is a boss. Thank you, Stigmatic. Not. I'm actually just MB. Obviously, I revealed my identity and my real saves. Yes, I'm going to not do it here. Oh, oh, oh, oh, yeah, she likes that. Uh, after Lady Arkham was defeated, did you Gordon's press conference as Batman or Bruce Wayne? I'm trying you as Batman. I did. I must have, right? Yeah, you would have gone as Batman. Yeah, okay, okay. You and your pure sense would never in that moment, in that this moment, would never go as Bruce Way. I.",
            "start": 421.4
        },
        {
            "text": "I'm trying you as Batman. I did. I must have, right? Yeah, you would have gone as Batman. Yeah, okay, okay. You and your pure sense would never in that moment, in that this moment, would never go as Bruce Way. I I just I don't see you going as Bruce. You're going as Bruce here. All right. Um, ah, I think I invested. Yeah, you're going to Arkham. Well, yeah, a little bit. Welcome to America. Wow. Here we go. Re this and we're off. Here we go. Let's do Anthony is a boss. Actually, technically, he has. Oh, thanks, guy. I'm the new kid. So so we're starting here. Episode one. Wait, wait. No, I'm not going to bring that up, cuz it's f*** Bourbon Con in New Orleans. I'm starting it. So does Troy still really wear cool socks? Yeah, of course he does. Justin Ryan Bear. Okay, come on. You want me to grab it? Yeah, dude. And it matches the occasion. So I got some blue and black there for some Batman. Sure. I'm wearing blue and black for the Batman. Okay, here we go. What's the bat thing? Oh, here we go. What did you do? What's your color in the past? I.",
            "start": 473.32
        },
        {
            "text": "I got some blue and black there for some Batman. Sure. I'm wearing blue and black for the Batman. Okay, here we go. What's the bat thing? Oh, here we go. What did you do? What's your color in the past? I believe I did blue last. That would be like again, canonical. Let's do red. Let's because we're gonna be mean. We're gonna break people and hurt people like we last time as we did that. I went for purple, cuz and everything lights up and it looks like a Blade Runner. So I was like, okay. I did purple just because uh that's my favorite color, but it also it feels like like Prince took over like halfway through. Um, who was actually in the Jack Nicholson soundtrack. Let's broaden her mind. Fateful night, my parents gave their lives for me. They became my heroes. Their legacy untouchable until I learned the truth. This is you. My father, Thomas Wayne, was a criminal. He ruled over Gotham from the shadows and everything I thought I knew about myself changed forever. The Children of Arkham exposed the truth about my.",
            "start": 524.44
        },
        {
            "text": "this is you. My father, Thomas Wayne, was a criminal. He ruled over Gotham from the shadows and everything I thought I knew about myself changed forever. The Children of Arkham exposed the truth about my father, deepened their attack, turned friends into enemies and threw the city into chaos. I was committed to Arkham Asylum where I escaped with the help of a mental patient named John Doe. After a bloody battle, I put an end to it all in the catacombs beneath the city. The Penguin, Two-Face, the first real challenge I faced is the battle be last. It's just Kevin. It's just Kevin doing Kevin things. Don't. Oh, he really takes care of the guests here. And with it comes City Hall's quarterly Clotworthy. Crime is way down since the fall of the Children of Arkham of Ancient Aliens for newly minted Police Commissioner James Gordon. Gordon credited his success to the public partnership between the police and the I'm always worried, can I pause this? Or vigilante for his sacrifice. Did he just say vigilante? Vigil.",
            "start": 580.52
        },
        {
            "text": "James Gordon. Gordon credited his success to the public partnership between the police and the I'm always worried, can I pause this? Or vigilante for his sacrifice. Did he just say vigilante? Vigil, vigilante, vigilante. The Vigilante. You're not excited about that. Is that what you said, Kevin? No, I upset. Oh, you were upset. I like it better. They were vigilante. Yeah, vigil. See, I hate get distracted by it. Uh, was that youga? Can we say who the Riddler is? Game's out, credits are out. Yeah, Robin Atkin Downes. Oh, okay. Yeah, I thought the man who has died in every Uncharted game. Hell yeah. Every knock there it is. And he sounds like import export magnet, one time PEX CEO, famed arms dealer, a philanthropist gives. I also love how active Alfred is in our performance. He's always listening in. If a man hides in. Oh, see. Oh, it looks like Slade. What do you think? Andel must be hard. True to yourself. It's not. Um, Michael Caine. It's hard not to become the mask. I'm doing my I'm going against Greg's choices. So when I play real Batman, true.",
            "start": 636.8
        },
        {
            "text": "like Slade. What do you think? Andel must be hard. True to yourself. It's not. Um, Michael Caine. It's hard not to become the mask. I'm doing my I'm going against Greg's choices. So when I play real Batman, true to form, always starts off with drink his hands season. He always likes him shaking, not stirred. I hear masks are hard to maintain. If there are cracks in Mori's, we'll find them. Uh oh. I love the graphic um art style. I love it. It feels more like a comic. They've been on the casino floor. I need to find a way to hear what Mori. They've made everyone a lot sexier in this season. I noticed there was a bug watch. I don't know if that's true. He certainly enjoys the good life, doesn't he? Made a fortune running guns during the Arab Spring. Diversified into biotech shortly after. From what I understand, he's not one for pinching pennies. Do you have a tendency to read other people's lines when you're not recording? But I I I read I read it as other. So I like so do voices. Yeah, so I was like, yes, encrypting your signal last.",
            "start": 714.12
        },
        {
            "text": "pennies. Do you have a tendency to read other people's lines when you're not recording? But I I I read I read it as other. So I like so do voices. Yeah, so I was like, yes, encrypting your signal. Last thing we need is you. You should be able to pick up audio from Mori's phone. When you do Batman, do you have like don't do you approach it from like your own interpretation or do you it's it's it's almost impossible for me not. I think Kevin Conroy, what he did was so freaking perfect as both Bruce and as Batman. I I'm not trying to do an impression of him, but I just love. Yeah, you want to do a I want do the only thing, cuz we're making our own Batman through this. But I think that it's also really important the distinction that he did was he was so suave and so cool. That's what I try to make Bruce be. And then Batman is just yeah, there's a disconnect between Bruce and f***head, punct. Don't worry, I can keep a sec. No, you can't. You I don't trust you. I was say, did that guy look obviously horri this one before I.",
            "start": 772.68
        },
        {
            "text": "Batman is just yeah, there's a disconnect between Bruce and f***head, punct. Don't worry, I can keep a sec. No, you can't. You I don't trust you. I was say, did that guy look obviously horri this one before I begin. No point of order. 35 would be black, not red. That's the number that I always bet on. I heard I took a point off the review score because there we go. That's how you get an 84. That's how you get an 84. Death Mori. I am death. I honestly that was you and Downes, the man in the hood for a little bit. Man in the Red Hood. Riddler. What is this? I love how they got the bat-claw and then the mask on top. Yes, just just to accentuate. Yeah, f*** move, Bruce. Get out of the way. Gibberish intimidates me. Please get away from me now. Holy s***. What? Just turn around and start walking. That's what Troy says to me every time I try to get a drink with him. I got things to do. Me in my own casino security, sir, it's time to leave for you. An easy one. What question can you never answer yes to? I don't give a crap. Let's go. Mm-m.",
            "start": 822.04
        },
        {
            "text": "I try to get a drink with him. I got things to do. Me in my own casino security, sir, it's time to leave for you. An easy one. What question can you never answer yes to? I don't give a crap. Let's go. Mm-m. Wrong. Nope. The correct answer is, are you dead? Uh oh. Holy glch gch. You better run, Mori. Let's get started. Different kind of Riddler. Yeah, different kind of carry. No tights, weird like package. I miss that. Well, there's a weird package there. Look, but you don't see it. No, that was my favorite thing about Season One and why I try to get people to play it all the time is that it starts off with such traditional Batman story and then deviates. It does its own thing by the end of Episode One. I see really like a Multiverse sort of and punch. Oh, uh oh. TIE f***. Smack My s***. Take it apart. It's a Zegna tie. Oh, okay. You just keep naming all these brands trying to get the free product. Yes, you know, Rolex really did a fantastic job on that watch. Batman, what's the status? Bring it to me. Stop multiple gunmen.",
            "start": 892.4
        },
        {
            "text": "you just keep naming all these brands trying to get the free product. Yes, you know, Rolex really did a fantastic job on that watch. Batman, what's the status? Bring it to me. Stop multiple gunmen, hostages at the casino. We a mad man in a mask like me back. Gotham, Riddler. He hasn't been seen in years. Well, he's putting on quite a show. H. Where does he get those wonderful toys? There's a squad on the way. They'll be there shortly. There's a key the alley just watching. Holy s***. Bruce Wayne is Batman live streaming like um that Batman. Okay, that's Batman. Uh, Bruce Wayne is Batman. Please, please, we can make the deal. Yeah, a little bit of different cane than like the issues can't be solved with handshakes. La-a. It's one of those money things. What happens when deal with me? Oh, no. Uh oh. There's only one way you're getting out of kind of the same thing. Similar, similar. Uh, but instead of money, we uh chop off your appendages. Listen closely. No, please don't do this. Without fingers, I point. Without arms, I strike.",
            "start": 976.12
        },
        {
            "text": "getting out of kind of the same thing. Similar, similar. Uh, but instead of money, we uh chop off your appendages. Listen closely. No, please don't do this. Without fingers, I point. Without arms, I strike. Without feet, I run. Who I am? I I don't know. Who are you? I've got visual. You're the Riddler. That drone fully functional. What if that was his answer? It would be like, what? No. What? I'm you can't be. You're not doing it right. But you are. I don't understand the question. Everyone's at the end. This s*** stresses me out because you can't just pummel this guy. You have to actually use your brain and that's where I fall short. He's not to be taken lightly. See, I fail in the pummel drives you to do I both, but clearly worse. The or death chamber as what comes up on the Hamber. This Riddler certainly has imagination. Believe me, I know. Remember, choose your save from before. Perhaps you should have turned on the charm. Batman was safer along with everyone else. But don't think you can just stall. I will get bored. You won't mind. Here's.",
            "start": 1057.64
        },
        {
            "text": "know, remember, choose your save from before. Perhaps you should have turned on the charm. Batman was safer along with everyone else. But don't think you can just stall. I will get bored. You won't mind. Here's Booth. That'll do. Just need to take out the guard first. Are people invested? It's John C. Audio playback fully functional. TIE your distraction. Sly Cooper, cane for the Riddler. Sly Cooper never cut anybody's face open. Oh, s***. Do I have anything in my nose? I'm losing patience. Mori, are you expecting? Well, I thought you lost your patience when you slit the guy's throat with your little Sharpie cane there. There's just a cashier. Batman, we take it in the covered like G. You know what? Gordon, better bar, T. Jesus, that ain't my problem. Inside. I'm relying on your ear. What's the best? I say frontal assault. I wouldn't do it. And that's what I'm going to say. You know, as make a frontal assault. Try and I'm doing the opposite. I'm not doing the smart things. Try another fire away from me. So basically, do me a.",
            "start": 1122.44
        },
        {
            "text": "I wouldn't do it. And that's what I'm going to say. You know, as make a frontal assault. Try and I'm doing the opposite. I'm not doing the smart things. Try another fire away from me. So basically, do me a favor. Completely insane. No, I don't believe that's it. Oh, oh, s***. Oh, clear a path now. So the Minecraft crowd probably wouldn't dig this, but to his credit, that's a very sterile blade. So oh, that's true. Oh, we're in a bash bash and and he might be in the Yakuza. So he's probably like bash. Now you're a man like, oh, slam. Definitely. I went with the roulette wheel. Sorry. All right, cool. I I assume I'll just keep it to myself then. No, Anthony, I don't do that. You pick the next one. I'm busy right now, but I'll see if I can fit you in. Not him. The hostage. Shoot the hostage. Smart dick move. Smart. What you want? What do you want? Uh, B, anchor the hostage and then I f*** it up real bad. Who what was it? Hell. Targets in the order. Right trigger. Okay. Oh, my cyst. Pretty dope. Oh, yeah. Hi, you Bats. The Batman clearly.",
            "start": 1199.92
        },
        {
            "text": "do you want uh B, anchor the hostage and then I f*** it up real bad. Who what was it? Hell. Targets in the order. Right trigger. Okay. Oh, my cyst. Pretty dope. Oh, yeah. Hi, you Bats. The Batman clearly isn't using his hand. You know, you would think that throughout the if there's any sort of communication that they understand if you call him Bats, it typically doesn't go well for you, cuz he's always like, hey, you Bats. I don't appreciate that kind of talk. Yeah, I mean, I would do a different. That's it's not my interpretation. Again, I get it. You get to be Batman. That's the of this game and finishing. What do you want? You got a shotgun. Brutal, brutal, brutal. Or you Wonder Woman him. What do you want, Anthony? I said, I'm sorry. That's on you. That is on you, Ingruber. Oh, Joker foiling Batman's plan again. Yeah, it's all intentional. Yeah, just uh f*** it up. Shock. Shocking. All right. Yeah, sure. Oo, shocking. I've heard stories in the streets about you, Batman. You're the biggest name in Gotham since well, since I left town.",
            "start": 1255.8
        },
        {
            "text": "intentional. Yeah, just uh f*** it up. Shock. Shocking. All right. Yeah, sure. Oo, shocking. I've heard stories in the streets about you, Batman. You're the biggest name in Gotham since well, since I left town. Uh oh. Everyone's very impressed with here. Expositional dialogue. F*** me, f*** me, side. Gotham's criminals have become salads and thugs in cheap suits. And you, I've come home to find a wannabe in my chair eating my goddamn porridge. This is my city. All you scum are the same. Uh oh. Only thing that changes is the mask. Spoken like a man who sees the world in black and white. Allow me to broaden your spectrum. It's called Chrono D. You're supposedly the world's greatest detective. You damn. Was that assault? You have to be kidding. And Bash. Clever, but not smart enough. Let me show you how it was done back in the day. Oh, D. God, this is what I love is that it's a normal fight. It's not like a superhero, right? Yeah, yeah, like that's those two guys hitting each other like a common street hood. It just doesn't do it.",
            "start": 1329.56
        },
        {
            "text": "for Me. O. So he's basically Jigsaw. Yes, I want to play a game. Oh, no. Follow the power lines. There must be a weak point. Close. Shap. You broke the cage. That's cheating. Think I care about your rules? Nope. I heard you were a man who followed a code. Why would you save that dirt bag's life? Mori made his money running guns. All right, trading off the suffering. Slowly circle each other. I believe in justice. Mori deserves a trial and a court of law. If he's guilty, his cell will be right next. So do you do that or is that modulated? Modulated. Thank God. Way want to put me there. One of the only good things about uh the Batman v Superman movie was the fact that they decided to put a modulator on Bruce. You know, Batman's voice. Otherwise, someone would look at him. Who knows? Who knows?",
            "start": 1422.46
        },
        {
            "text": "one of the only good things about uh the Batman v Superman movie was the fact that they decided to put a modulator on Bruce, you know, Batman's voice otherwise someone would look at him who knows who knows him really well go Bruce Wayne oh hey so the fact that they do the 10 minutes ago said exactly like my buddy um so I love it that we we did that yeah yeah it makes to me makes more sense because he's also got a very Tech uh technologically advanced suit as well it's not just a jumpsuit Oh Holy Blood Rous oh now I want a body SL all right I'm sorry Kevin maybe you'll buy the goddamn game and play it yourself I wanted the um enough of this the Road House, Road House, Road House, Road House you know how to scrap I'll give you that but it's not enough let's see how you do with something you facial reconstruction surgery I broke your nose detective solve my puzzle soon oh no I was afraid of puzzles but people are going to get hurt I hate puzzles we know you can't let that happen you'd be surprised",
            "start": 1514.52
        },
        {
            "text": "surgery I broke your nose detective solve my puzzle soon oh no I was afraid of puzzles but people are going to get hurt I hate puzzles we know you can't let that happen you'd be surprised that's me we just have like all these really like f*** comments the tension is oh f*** I mean come on that's cool the three-point land that's pretty cool hey head up damn damn oh is that Toya yeah I think it is but everyone looks a lot older than and that's uh Christian Bale that's Christian you should have called us before going in Gordon God damn it Waller what after all we're here to help oh God who yeah are we going to play through all the way all the game the whole game well that was great guys see you L see you later no I know if we were going to like spoil it for people cuz this will encourage them to go buy it and/or pick up Season One and then watch more Kinda Funny content cuz I like Season One so much and I like where this is too that I want people to buy this game so",
            "start": 1571.6
        },
        {
            "text": "will encourage them to go buy it and/or pick up Season One and then watch more Kinda Funny content cuz I like Season One so much and I like where this is too that I want people to buy this game so you have to keep making them you know what I mean I really agree with that notion you like work I well not just that but to me this is the first time that we've been able to you really have such agency in your own Batman and even though we're playing through this making your own choices and I can make completely choices which gives you totally different well that's the other thing you're like worried about playing through Episode One right somebody I'm playing through away I'm not going to play my real save so like people watching at home don't have to play it this way either true story because I'm going to keep not doing what Anthony wants right cuz he says it too late and I get it's like three hour I send you an email was at home done for this that's what happens man people die you",
            "start": 1649.72
        },
        {
            "text": "I'm going to keep not doing what Anthony wants right cuz he says it too late and I get it's like three hour I send you an email was at home done for this that's what happens man people die you hesitate no but if you want you want you want my take a hot take from Greg Miller I do we did that Batman: Unmasked show yes tell it was over on Telltale's YouTube channel criminally underviewed because the discussions we had would always be like I did this why did that why would you why would you do that like it was actually there was a discussion over how you did stuff here Riddler's right hand in custody not a bad result off still smoking I see Riddler used to leave Clues at all his crime scenes always thought he was smarter than the people trying to catch him you're just not he could use help dragging him down it's that helpful piece of information that will be his undoing he keeps showing off he's bound to make a mistake how long you lay down these lines maybe but we can underestimate it takes us a",
            "start": 1690.28
        },
        {
            "text": "him down it's that helpful piece of information that will be his undoing he keeps showing off he's bound to make a mistake how long you lay down these lines maybe but we can underestimate it takes us a while Riddler we'll go I think we've moved faster this season than we did last season for sure well I came in very late I came in um when the season was already started I was in cast came in very late so and this is also like my first voiceover job so I'm not shut up your first voice over job know that it was your first one out of the gate it is and it's like f*** I'm playing opposite Troy playing The Joker so it's very um intimidating but amazing I do love him though feel about fantastic so much so I don't know if I should believe that I don't like your attitude think you are but I don't like I got well I know I'm your new boss but yeah like like for the trailer I recorded four lines and it took 3 hours damn cuz they just want me to do everything like there's some takes like hey Bruce and then",
            "start": 1737.4
        },
        {
            "text": "well I know I'm your new boss but yeah like like for the trailer I recorded four lines and it took 3 hours damn cuz they just want me to do everything like there's some takes like hey Bruce and then some that like Bruce I'm good for now I want to answer your questions go ahead do um I I love Gordon I love the ACT this playing uh Gordon You Records up in New York and to me it's so close to um Batman: The Animated Series it was I always get this wrong it's not Bob Hoskins but it's somebody that I can't remember his name someone's going to correct me instantly on this but no no no no Bob the the actor who played Jim Gordon in Batman series was like the perfect Gordon and I feel like um why am I drawing a blank on his name right now um apologies it's me being stupid not that your performance is forgettable cuz you're great um the guy that plays Jim Gordon uh we recorded him in New York and there's a lot of scenes especially last season that we did where I was in LA he was in New York and we",
            "start": 1795.0
        },
        {
            "text": "forgettable cuz you're great um the guy that plays Jim Gordon uh we recorded him in New York and there's a lot of scenes especially last season that we did where I was in LA he was in New York and we were over Skype having these great conversations awesome I believe him is Gordon not to mention the city's corrupt mayor and I work with Gordon no one else bingo I appreciate loyalty thank you that's why you're hung and it wasn't Bob Hoskins he was from he was the British actor wasn't he that's B he passed away he was also Mario true story we don't really like to talk okay sorry it's just the definitive role I feel for his career a lot of other things that man did because you want to know the most interesting Bob Hoskins pitch I've ever heard yes you know Comic Book Girl 19 she was talking to us about the the movie she wants to make or would have made if she had a time machine and she would go back and get Bob Hoskins from his Prime and make him Wolverine like it actually what's oh sorry I",
            "start": 1852.96
        },
        {
            "text": "about the the movie she wants to make or would have made if she had a time machine and she would go back and get Bob Hoskins from his Prime and make him Wolverine like it actually what's oh sorry I miss it guys silence was a valid option we're that's that there you go turn the game off man that would have been good right she's smart she's smart run yeah I'm here to help I think Tom Hardy would make a really good Wolverine no he's too pretty but he's big you kid have you seen him in the um reest yeah and the r yeah but he's still that's that's B Frost what's up scale yeah but imagine him with that f*** and then he's like the right stature as well no Tom is tall no he's not he's five really no he's not tall all right when he did Bane he was uh I ruin the I love him as Bane are you kid Tom Hardy didn't love it as Bane for the record Troy is on Game Over Greggy show right after this you can catch it live on Patreon we'll put it up later obviously on YouTube Anthony was supposed to be on GoG",
            "start": 1902.16
        },
        {
            "text": "didn't love it as Bane for the record Troy is on Game Over Greggy show right after this you can catch it live on Patreon we'll put it up later obviously on YouTube Anthony was supposed to be on GoG tomorrow but because of his love of this Bane you are banished that a good plug I'm going to go like we have the mask in the closet in the other Tim Allen is Wolverine you would never see me just be like doing coke Jesus hey let's not throw poison at other another act oh hey this Anthony Lad is pretty cute hey Satisfactory you have a contender in The Beauty Department I don't know about that Satisfactory you back off I don't know you stand down you haven't seen Troy in person I mean he's much taller and much handsomer Satisfactory is incredible I started following her her journey to like uh wellness and like she she oh really yeah she's like this really cool she's a mom and she uh she's in the she's in the Kinda Funny crew I ask and uh she like she's she's a nerd she's a gamer she live streams",
            "start": 1959.04
        },
        {
            "text": "and like she she oh really yeah she's like this really cool she's a mom and she uh she's in the she's in the Kinda Funny crew I ask and uh she like she's she's a nerd she's a gamer she live streams yeah she's really cool is she single there's something she's not she is married loves her husband all the best ones are energy of course I am sorry just like anyone who threat was going Bob Hoskins like screaming scream I'm not most people I'm not most people blah blah blah look at me I'm Batman I think I know you a little better now cool I've got a file and I really want to go oh Agent Avesta I should start investing in that relationship put all put some my skill points over you go I think you should okay I'm not here to step on yes you are Treat Me and My People Partners promise you will share anything on the river you and me aren't going to have are you saying you're asking for my loyalty that's all now see this is the big problem cuz this is what they did in Season One a lot where it was",
            "start": 2010.04
        },
        {
            "text": "anything on the river you and me aren't going to have are you saying you're asking for my loyalty that's all now see this is the big problem cuz this is what they did in Season One a lot where it was like oh I know that character X is good or bad so I should be the normal relationship so is there Amanda Waller a complete trash bag or is there Amanda Waller nice I don't know yet able to so I think this is about identity is based on I don't want to know I don't want your your truest identity is based on the relationships that you have right like who you truck with who you invest in what's in your garden sure so I don't think it's so much about figuring out who's good who's bad I think it's more about who are you what usually I would tell her to f*** right off know just grapple away I'm just grapple away wait I thought you were a mom that's very sorry I thought you were a mom my bad Episode One: The Enigma here's what I want you guys you guys to tell Telltale and then you guys when you go",
            "start": 2074.84
        },
        {
            "text": "just grapple away wait I thought you were a mom that's very sorry I thought you were a mom my bad Episode One: The Enigma here's what I want you guys you guys to tell Telltale and then you guys when you go home to tell the rest of them you guys I would say since Tales from the Borderlands have stepped up your title screen so much or or because of Tales from the Borderlands you know again Tales from the Borderlands was one that had a really bad cast so I think they had to try to get around that one as much as they could every day about Rex about oh Rex every day we get a message that Rex sucks DN she's right here uh greatest opening titles in my opinion W Tales from the Borderlands yeah that song was really awesome I think we have to owe somebody some money I know right you're going too far oh it's a cover though you can't get enough I like he's going to put it on now all the all the money in the world I will I will but all the money in the world this is his setup for playing he wants it's a mic",
            "start": 2127.68
        },
        {
            "text": "a cover though you can't get enough I like he's going to put it on now all the all the money in the world I will I will but all the money in the world this is his setup for playing he wants it's a mic man he's like the world's richest was his parents oh that's true get over it get over your parent issues all right like 40 the computer is finished scanning the Riddler's puzzle box it's a theme from Prometheus you are never saw it work it's pretty good I don't know what music they chose Michael Fassbender is fantastic the movie is awful I love Fassbender well yeah but here we go I'm David, AKA Lady Arkham, The One That Got Away we could have been something special who are you talking to sir no one just just don't worry about it Alfred just Tone It Up for once in a while do you have anything on John in this Old Farm is Wolverine he way emo for hey why don't you go out and join the X-Men I don't know man I'd like to but there's a new Persona out I got a platinum I care about it I can do it if I want to Andrew",
            "start": 2184.2
        },
        {
            "text": "Farm is Wolverine he way emo for hey why don't you go out and join the X-Men I don't know man I'd like to but there's a new Persona out I got a platinum I care about it I can do it if I want to Andrew Goar, the Andrew Goar nothing dangerous at all so far computer run another scan I want to be absolutely sure this thing is safe also I took the liberty of digging up everything I could find on the agency okay you know what Suicide Squad just stick within your lane you know what I mean I didn't ask for that oh taking too he's got bit of the tremors it it comes and goes since the kidnapping and all the other business with Lady Arkham I like that Alfred don't you worry about me come on brilliant performance in right is very good where at my first Tour of Duty your family Alfred we worri about family so this Alfred is very similar to the New 52 how he was like a military um well that was yeah Year One, Year One, right, yeah, Year One had him it's like he was former like British and he was also like an",
            "start": 2247.2
        },
        {
            "text": "so this Alfred is very similar to the New 52 how he was like a military um well that was yeah Year One, Year One, right, yeah, Year One had him it's like he was former like British and he was also like an actor as well like he was very good with I didn't know that yeah there was ones where he was yeah the Year One then Earth One the agency oh you're Earth One is what I'm trying to say is Geoff Johns' the collected editions that come out flipped the script on Batman and he beats the crap out of Bruce awesome was information it's all before Waller took over the director position perhap she's given them a new Direction maybe it's like we're watching the game but I look over and Scott's watching us I'm just looking at Scott what's what's the game he's super we the game comp looks like we're like in hanging out a table when goes to the back computer yeah about losing our un you guys have a weird view I me things won't be easy with a bunch of spies nearby they never are equip spies too it's my",
            "start": 2310.56
        },
        {
            "text": "in hanging out a table when goes to the back computer yeah about losing our un you guys have a weird view I me things won't be easy with a bunch of spies nearby they never are equip spies too it's my dad maybe it wouldn't hurt to talk to Lucius who upgrades try and level the playing field Tim G is Robin people are still casting what the the rest of the show yeah and they want him as Robin terrorized this city long before you were back man it's hella important we get down there get the new Nikes we get the new Nikes hella important oh dear I I always say he claps like a gorilla I come back to Gotham I seen prior relationship with don't even call it a comeback he's been here for years let me upload the rest of his configs m H.I.T. system update say you let yourself get C to did you ever have to say this why willingly turn yourself in cuz we did Paduro, Paduro. Else, Kevin, how do you pronounce it? Obvious wow it's there's just an empty chair there Kevin's not there well yeah after that comment",
            "start": 2362.96
        },
        {
            "text": "say this why willingly turn yourself in cuz we did Paduro, Paduro. Else, Kevin, how do you pronounce it? Obvious wow it's there's just an empty chair there Kevin's not there well yeah after that comment well I would get audacity report on that be fine the man is in Urgent Kevin how do I pronounce that he's got a grid there it looks like I going to pop it back up it's going on the screen really quick it's going to say Paduro you say you pronounce it the way you pronounce it okay we got to do it so the mics can hear you get your mic ready here it comes it's going to be on like pressure like dead center screen all right okay that or restraint jacket not enough keep watching it'll pop back up I didn't even know what you were keep popping it's going to pop there it is right there you should see stop right there go to Paduro but there's no way that Batman's going to go we have to go to Paduro there's this weird Alfred's pseudo for it's always like when that you hear like the the uh uh like a Spanish announcer and he",
            "start": 2438.36
        },
        {
            "text": "there go to Paduro but there's no way that Batman's going to go we have to go to Paduro there's this weird Alfred's pseudo for it's always like when that you hear like the the uh uh like a Spanish announcer and he and he hits that like English word it's just like a stumbling it's the speed bump it's awesome Coca-Cola Riddler's M.O. hasn't changed in all these years here we go people catching on Santa Prisca is where Bane is from yes that's true woo oh puzzle seems pretty easy if I'm being honest so Telltale acquired the room and was able to put there you can see who am I it's one of the nerdiest jokes I've ever done that sounds familiar I've heard it before not remember the answer to you sadly know old man well getting old Bruce oh these are all I have an eye but cannot see who am I it's eye of the hurricane I would think eye of a hurricane or eye the eye of a needle those are both correct those are both correct answers or eye of the needle yeah I hav an Blind Justice makes you think like what it would be",
            "start": 2494.84
        },
        {
            "text": "would think eye of a hurricane or eye the eye of a needle those are both correct those are both correct answers or eye of the needle yeah I hav an Blind Justice makes you think like what it would be like in in in with like the Batman world yeah one-eyed Jack what is what is that one ey that's that's that's like on Who Wants To Be A Millionaire they're like which one of these is a state and like one of just say is one-eyed Jack a thing I've never heard of that no oh okay Travis, go Blind Justice a hurricane I go with hurricane H he comes a hurricane I don't think I have the needle's right Bob Dylan's 'Hurricane' then all right but then but if I'm if I'm disqualifying needle I should disqualify hurricane as well right well I of course know the has two eyes great Point hurricane, hurricane it fixed the description in the middle but I'm not sure how it happens even if I have a needle a record he's holding a record helping us did you guys not know that really look like a record to me that's a good",
            "start": 2577.68
        },
        {
            "text": "description in the middle but I'm not sure how it happens even if I have a needle a record he's holding a record helping us did you guys not know that really look like a record to me that's a good call oh my God yeah that's a record Jes thanks Kevin trying to give the people trying to have fun yeah of course I knew it was a record I let it go a little longer so easy for people I just know that that's not how you make records so I thought maybe that was a bit weird thank you I thought it was a great joke Strange Groove, Strange Groove, Strange Groove this is goodness I have a record, Prince and the new the collected works of the pgs how great would it be if it was Prince, Peace Raspberry oh we're going like 84 Prince we got Batman means you got half a chance of stopping a whole lot of pain to be honest you're already doing better than I thought good thing for hipster Bruce that they can yeah he's got a record player City Art, this is a Victrola it's like Alfred go to Urban Outfitters give me a record an open",
            "start": 2626.4
        },
        {
            "text": "already doing better than I thought good thing for hipster Bruce that they can yeah he's got a record player City Art, this is a Victrola it's like Alfred go to Urban Outfitters give me a record an open invitation from The Riddler of course huh looks like a manipulating Radio band a Tracker it's broadcasting our location it's just filming him sir there's a red dot on your forehead that sound what oh uh I'm not really sure about any of it get Lucius' on the line with you callin Deo hey Alfred just do a Hulu commercial.com everybody breakfast my youngest is probably stealing all I L for the Ashley Johnson those are at home those are those are precious like the Good China side that needs your expertise I uh yeah okay I can meet you at Wayne Tower in a little bit we uh the wouldn't it been great if they had given Lucius like dreads like Dave between he's the one liveaction part of the entire game hey wow wow this connection is super clear you look great all right Lucius just can't wait to see Tiffany",
            "start": 2689.8
        },
        {
            "text": "had given Lucius like dreads like Dave between he's the one liveaction part of the entire game hey wow wow this connection is super clear you look great all right Lucius just can't wait to see Tiffany okay give me the cool car Bugatti be way wow only person in Gotham that drives a car like that there's nobody else has like a Bugatti sure nobody else $1 million Wayne it's funny we're staying at the W and it looks either like the the Wayne Tower or Wonder Woman f***, f*** so if you want to hang out with Anthony go to the oh boy here we go Regina what I come to expect with you as Wayne Enterprises chairperson yeah I just talked to the board and they couldn't be more pleased with the progress of the Arkham like you made right call decided to take that contract she looks like the Crypt Keeper yeah time hasn't been kind to her more rice ice oh you want more I'm not trying to pressure you not trying to lick you up can I switch to Coffee you want a coffee do you want iced coffee well no that's too",
            "start": 2766.08
        },
        {
            "text": "time hasn't been kind to her more rice ice oh you want more I'm not trying to pressure you not trying to lick you up can I switch to Coffee you want a coffee do you want iced coffee well no that's too crazy want you hold on why tax you want Batman well I do but I also have Game Over Greggy after this sure you just keep drinking through that though and then I can't board a plane hi Kevin hey man you want coffee we'll save this we'll save it for you not going anywhere just coffee straight just coffee straight all right it does give it to him straight I how you doing bud you want anything his name is Anthony by the way I know his name I know his last name can I have a little bit of ice or I got ice yeah yeah going to get his hands on my hands are super clean they spare no expense here a lot of everything yeah there it is now we're all dressed in black both black shirts all both black shirts you wonder why I always dress in Black I never see red colors here we go balls deep that's I just I",
            "start": 2849.92
        },
        {
            "text": "everything yeah there it is now we're all dressed in black both black shirts all both black shirts you wonder why I always dress in Black I never see red colors here we go balls deep that's I just I look at the iPad and my oh I see balls straight to straight to balls deep anything to go by he left us a psychological profile of Riddler uh-oh knowing how as mine works this should come in handy shouldn't it no sign of explosives or poison already scanned for that in the Batcave mhm mhm be impressed Lucius this is cool stuff he kind ofed it so easily remember like in Treasure Planet where the kid opens the thing no Treasure Planet really it's fantastic man anybody else anybody got love for Treasure Planet that movie was amazing open that thank you someone in the chat will in a second there's a delay so it has to catch watch out it's not what I'm mind than that what hi Tiffany oh Tiffany and her toys T my God Tiffany. Tit. Oh my tits. Look at that. Tits on. I mean, what? Sorry",
            "start": 2901.4
        },
        {
            "text": "Lucius just decked a micro drone prototype I developed in my spare time high-end a stealth black shell programmable for autonomous observation well I have a butler and you have the same haircut as the chicks from Fits and the Tantrums that was a great joke I I literally shot on my own joke that coffee coming Kevin what but she does she looks like the lead singer Fits and the Tantrums see I was thinking she looks like the um Frankie in Batgirl right now who is like uh Babs' second in command and so maybe that's what we're bringing we're bringing the universes together Carrie Kelley's hair great first impression huh Kelly Clarkson no the um Carrie Kelley wasn't that the Robin and oh Dark Knight something different about you um I Heard is oh he doesn't have the missing ear I can't quite put my",
            "start": 2971.12
        },
        {
            "text": "great first impression huh Kelly Clarkson no the um Carrie Kelly wasn't that the Robin and oh dark something different about you um I Heard is oh he doesn't have the missing ear I can't quite put my finger cuz then some of them but you look he got a chunk of his look well please just don't say old well now that you mention it hey play nice Bruce has had a rough year look at this really too late already touching I mean that's those are bold words especially to this man but really bring some no my hands are gross circuitry I know I've grabbed everybody's eyes no I just want to get my hands grosser to touch Kevin looks like he's auditioning for the Manson movie or something like like the Manson or The Doors no he used he sometimes wears this flannel and he looks like M little hiccup in our WWE sure is this the time to talk about it though Halloween sure piece of tech that found its way into my cutting my hair beforehand but you can't do that no dude you want your long hair for it Paul hates",
            "start": 3044.04
        },
        {
            "text": "sure is this the time to talk about it though Halloween sure piece of tech that found its way into my cutting my hair beforehand but you can't do that no dude you want your long hair for it Paul hates it can't you have to she loves you she loves the hair package deal I'll try yeah tell her I said you get to keep the hair you want to grow it out for Locks of Love You have to go six more or three more inches that's what you tell her or some kid with cancer doesn't get hairs right yeah pretty genius I solve problems nothing like gutting your fiance start off with a lie that's how every marriage works treasure plan is the worst thank you Switchbone 36 you get it here we go she's up something mhm have fun scratching your heads had to be jerk to her you know you notice he gave you Batman mug are you aware that he's that on because he's I'd bury him I never kids but told her what I really do at Wayne Enterprises what we do there's so many screens from you right now I love it you're in your own",
            "start": 3106.04
        },
        {
            "text": "aware that he's that on because he's I'd bury him I never kids but told her what I really do at Wayne Enterprises what we do there's so many screens from you right now I love it you're in your own Batcave a little bit like there's four you should consider bringing Tiffany into the fold into the mission so if not now I asked I asked David about this and he changed my mind I I really wrestled with this scene I was like how in the world old it feels like Bruce should be the one going hey she's really smart why don't we bring her why don't we bring her into this yes it is I was like as a dad I can't imagine you going yeah bring my that's the right choice my daughter into this horribly dangerous occupation this clandestine Adventure that we're doing and he turned it around to me this way he's like it's the same matter of Pride when a father who served in the military and their child wants to serve in the military is like that would be the greatest accomplishment if I could encourage and",
            "start": 3171.28
        },
        {
            "text": "like it's the same matter of Pride when a father who served in the military and their child wants to serve in the military is like that would be the greatest accomplishment if I could encourage and Inspire I was like wow so D turn changed my mind Deo.com uh well I guess I'll see you in a bit I'll be down at my office Nolan's in a coma get down here Nolan North Nolan North's in a coma oh my God that's breaking news right here I put him in a coma oh Troy Baker punched Nolan North so hard didn't punch him didn't punch him just little oh cuz he's so old he's so old and frail he's like you know just came by to ask a few questions he's just he's just a terrible person he the worst in some amount of trouble it's my job to find out just what you like Huey Lewis in the news what's the tar for oh that's for the blood if anybody needs something from the kitchen next like 30 minutes tell me really represents you what happened Take a meeting and they don't want open H okay by God well we're making TV yeah",
            "start": 3228.88
        },
        {
            "text": "the blood if anybody needs something from the kitchen next like 30 minutes tell me really represents you what happened Take a meeting and they don't want open H okay by God well we're making TV yeah I know right God forbid we give them some money in their pockets anyone can be on the Internet it's not special it's true I think I'm okay I've got coffee I've got bourbon we have ice I mean I wouldn't punch you the dick for a Cliff Bar but everything I don't know how to still do it oh thank you yes can you bring him a blueberry Cliff Bar yeah do we have those yeah now here's this is going to I'm going to preface with this is going to sound like an insult fascinating compelling television you're going to need to climb up on the countertop to get them yeah no I Make make do we have a roaming camera for this like a little to his for wait wait this is important to help Gotham uh because would be so charitable after that how's it going I'm Wayne I'm a I uh left that file on your desk think he",
            "start": 3288.16
        },
        {
            "text": "for this like a little to his for wait wait this is important to help Gotham uh because would be so charitable after that how's it going I'm Wayne I'm a I uh left that file on your desk think he can bring it down yeah yeah I noticed you **** up I'll be down in just a second got the agency here I don't know who these people what were you saying you were saying I was saying a bit of a mystery what time what is it you want the agency recently brought me in to draft a psychological portrait of the Riddler we've been tracking him for months good you couldn't prevent him from being a casino that's good work yeah if you're track you suck well there's a delay I like to he's on the cover of magazine right like that's a pretty easy get you would think and all of more in you want GCPD buddy look at this body he doesn't eat Pizza children are it's great it's great content right there so thanks Troy let's get some aluminum foil for you to rub over the microphone first at first I was seriously",
            "start": 3335.88
        },
        {
            "text": "at this body he doesn't eat Pizza children are it's great it's great content right there so thanks Troy let's get some aluminum foil for you to rub over the microphone first at first I was seriously wrestling with opening this thing and then it became a bit yeah it was funny so I'm not sure I like where this conversation is going oh this probably isn't going to help I have G what who's that handsome devil it's Arkham you and John met and became friends more than friends if I'm going to be completely honest I like how they ch I've got my own theme song which I yeah it's nice it's my ringtone that's why you came here to ask me about that guy according to hospital records you and John that guy they captured the whole incident of video oh yes we did after John cut another inmate a man named Victor Zsasz uhoh several people were hurt uh I got out of there as fast as I could I don't blame you you must you want you want to pick one you want to pick one oh John was discharged from Arkham now you",
            "start": 3398.2
        },
        {
            "text": "Zsasz uhoh several people were hurt uh I got out of there as fast as I could I don't blame you you must you want you want to pick one you want to pick one oh John was discharged from Arkham now you want to contribute no one has seen or heard from him I'm now the arc is leaning toward you hey guys give me the controller before you didn't care if I got pummeled by a freaking the guy on the first day on his job he's like hey how's your day Phil well I got to beat up Batman cuz some jackass didn't answer fast enough whoopsy why would you write down my name because I love you you're important to him very important it's funny the John Doe um Bruce Wayne relationship perfectly mirrors me and Troy's relationship nice Premier two Penguin Gotham's most notorious these are good Cliff are awesome and blueberry are the best two more another one the blueberry crisp really good that's the jam Cliff Bar if you're looking for a sponsor I guess you're the sponsor you sent I'm not going to pay you to",
            "start": 3462.8
        },
        {
            "text": "blueberry are the best two more another one the blueberry crisp really good that's the jam Cliff Bar if you're looking for a sponsor I guess you're the sponsor you sent I'm not going to pay you to promote the any think this such a stand up guy and your point is what exactly yeah what's your point some kind of criminal master or just really unlucky you know I'm really unlucky yeah Troy looks like the evolution of an Anthony Pokémon all right like your father maybe you're not the hero people think you areh I am calling my Lord uhoh what the **** that's an evacuation warning it's time for you to leave we'll pick this up another time who's this who's the voice act on this one I don't know who that is anybody tell doesn't know anything valid option Greg good that's a great option what did you figure out i' I've solved the real puzzle Bruce Riddler really pulled a good one over on us oh my God you're going to kill DeVoe again please tell me what's wrong I is he on the Roof then I'm sorry I wasn't",
            "start": 3522.32
        },
        {
            "text": "out i' I've solved the real puzzle Bruce Riddler really pulled a good one over on us oh my God you're going to kill DeVoe again please tell me what's wrong I is he on the Roof then I'm sorry I wasn't around more oh my God we really made a difference didn't we Batman this no oh **** Dave just can't catch a break in these games **** you Telltale has a house to pay for I'm falling into a deep depression Enterprises' Chief Technology Officer Lucius Fox died last Tuesday in the violent blast a small service is being held for the tech giant and father of three at Divinity Church this Sunday right **** depressing huh why would he just take a box this a bad guy to he's got to solve it yeah the solution was boom you know I'm going to take care of your family I doubt there's anything in the coffin though thank you Anthony sorry thanks no I mean I'm sure they got it's a positive spin Lucius help raise you Bruce yeah Riddler's attack on the casino was one thing but this this is personal",
            "start": 3592.36
        },
        {
            "text": "coffin though thank you Anthony sorry thanks no I mean I'm sure they got it's a positive spin Lucius help raise you Bruce yeah Riddler's attack on the casino was one thing but this this is personal oh yeah we can't let him get away with it oh **** Riddler struck at the heart of our operations Riddler will pay for what he's done for sure I swear to you swear to me I will make him suffer maybe it's what's called for given the circumstances of course it won't bring poor Lucius back I can't imagine how devastated she must be her father in such a violent way I mean we going to spin that one what why spinning it you kind of yes she could use all the support she could get what you uh man here's my number uh just I know it's a rough time right now you need somebody anyways your dad died doing this thing for me I'm Batman would you want to do the exact same thing so a position just opened up hey I know this is weird but I have an opening Tiffany I I know what you're going through this is a really I",
            "start": 3680.68
        },
        {
            "text": "for me I'm Batman would you want to do the exact same thing so a position just opened up hey I know this is weird but I have an opening Tiffany I I know what you're going through this is a really I remember what it was like when I lost my parents that uh sudden emptiness they record this together great she's really good I don't think it'll ever go away it certainly didn't for me he loved working for you you know they hardly saw him at home because of it mom used to complain my little brother was growing up without a dad now I guess it's true he was so busy I can't remember the last time I got to hang out with him just father and daughter just thought there'd be more time I asked a lot of him now I'm playing as myself may I can't in this scene I can't be a dick you can't be a dick and he gave it all didn't he a real company man well I hope it was worth it all right well now I'm going to be mean to you she's grieving Greg Tiffany I'm sorry yeah for her elbow I'm Batman my God I'm at",
            "start": 3751.44
        },
        {
            "text": "he gave it all didn't he a real company man well I hope it was worth it all right well now I'm going to be mean to you she's grieving Greg Tiffany I'm sorry yeah for her elbow I'm Batman my God I'm at brutal he it's okay it's okay just let it out I'm just trying to wrap my head around it all I saw his remains Bruce there was hardly anything left yeah the bomb kind of blew him up didn't yeah the bomb blew him up that was my fault shouldn't have given that were you guys on the wall scrape it off with a spatula it doesn't a good bomb Tiffany I will tell you soon just not here what do you mean why not it's not it was devil worshiper stuff what are you mixed up in fine just tell me one thing great camera work by the way that weird depth of field yeah just like the way it's they shot this thing really well like I love their was that did you put my father's life at risk for that I'm begging you just tell me that one thing I thought it was safe Tiffany I I really did I had no idea Lucius can get",
            "start": 3828.76
        },
        {
            "text": "well like I love their was that did you put my father's life at risk for that I'm begging you just tell me that one thing I thought it was safe Tiffany I I really did I had no idea Lucius can get hurt please forgive me forgive you mm-mm I hope you can forgive yourself I'm building a super villain here I'm building a super villain my father into a I can I can forgive myself and I should I've already have honey yeah Bruce I forgive you thank you Bruce there can we move on well up to her throw money in her face there you go I'm Bruce Wayne have a 0 so sorry really such and one black guy at the funeral Right out with a bang right oh no for that we can all be grateful you you knew my father oh who what the heck seriously Bruce this guy's this is my friend I'm so sorry I will handle this William Defoe will the Jeez Bruce that's quite a grip don't leave a bruise for sure what are you doing here I told you I'd see you again didn't I you and me we're two threats in the same Stitch look I I I got you",
            "start": 3916.48
        },
        {
            "text": "will the Jeez Bruce that's quite a grip don't leave a bruise for sure what are you doing here I told you I'd see you again didn't I you and me we're two threats in the same Stitch look I I I got you a little something just just to not the it's a minor injury brilliant I knew you'd be hurting see in might make you feel better you do realize you don't give these at funerals right course it's okay it's okay just keep it down got to be quiet as Church place right it hasn't um it hasn't been easy for me out here you know I'm the new guy now it's the freedom that gets to you there's so damn much you hardly know what to do with it it's not like G sometimes I miss those padded walls got to get busy living or get busy D which one's not to cross it's the best place for you I'm sure they take you back oh no Bruce didn't you know I'm cured Dr. Lan said so herself Cross My Heart the meds and everything no that's good just what I want to hear everyone could please take their seats I mention I",
            "start": 3992.24
        },
        {
            "text": "you back oh no Bruce didn't you know I'm cured Dr. Lan said so herself Cross My Heart the meds and everything no that's good just what I want to hear everyone could please take their seats I mention I was a vet and uh the VA just decided to just sit down today We Gather to honor the memory of Lucius Fox he was a friend a father a husband hey it's the same guy who a leader you were crashing my friend's funeral John you better have a good reason oh I do I need that uh favor you owe me you know you you might have been a little reluctant at the time but if it wasn't for me you'd still be in Arkham sleeping off your meds in the rec room with Zsasz you're going to do right by me aren't you I know you're a man of your word I never made that promise I got into a lot of trouble for what we did Bruce you saw that place saw those doctors has left us Matthew tells us you see I met some inspiring people out here made some new friends made a kind of pack they're amazing Bruce that special breed who live",
            "start": 4092.0
        },
        {
            "text": "saw that place saw those doctors has left us Matthew tells us you see I met some inspiring people out here made some new friends made a kind of pack they're amazing Bruce that special breed who live by their own rules they remind me of you of your father so who are they you'll find out when you meet them they're looking to bringing someone like you into the fold sure I you you will meet them for me I'm sure please I've got a lot of writing on this I already told them you would please don't let me down not a chance I'm meeting them in my game I'll tell you that right now well yeah see you're you're you're going back I'm still doing the opposite still the opposite no cuz you broke it up when you were in the office me you know boy you are so fickle you know I spoke so hard capricious I told them you the right in makes me for Sni all right yeah I get it Troy get it go ahead and keep texting over there yeah could so was right see I'm a bit of a Wordsmith I detected that we're here to more please",
            "start": 4164.04
        },
        {
            "text": "the right in makes me for Sni all right yeah I get it Troy get it go ahead and keep texting over there yeah could so was right see I'm a bit of a Wordsmith I detected that we're here to more please use us me again you'll be running a lot of I'm getting angry see I'm getting I want to do this either you calm down or will personally drag you outside and teach you respect that's it that's right there that's what I came for **** that guy though but sorry Bruce that Outburst this is how I grieve beat a crap this is how I grieve have a hard time handling rejection I think it's the stress you see I've got this this enemy to break into a 311 song or something it like calls himself the how do you know the Riddler know him oh those those eyes I want to rip his eyeballs out he's a thief and a killer and worst of all he's he's rude a I tried to let the authority low life they're dealing with but wait a minute you know him too of course a man of Bruce Wayne's caliber knows everyone uh just from the",
            "start": 4233.36
        },
        {
            "text": "worst of all he's he's rude a I tried to let the authority low life they're dealing with but wait a minute you know him too of course a man of Bruce Wayne's caliber knows everyone uh just from the news the guy's clearly a murderer sick in the head don't know the half of it if I had my way that smarmy know it all would never leave his hole watch the language his hole you know where he is his hole not exactly no maybe I said too much that's me in the corner tell me where he is tell me where see I was going to do what he wants kiss him not missing kiss him I missed your fire yeah I really did that's called chlamydia I really don't it burns on the outside your Maniac always made people go to him for meetings somewhere in the East End where in the East End honestly that's all I know and even that might be out of date if you're so eager to find him why I I went that route for a while I'll find out where he is get back see if I can't find out where that jerk puts his head down listen to me carefully",
            "start": 4303.56
        },
        {
            "text": "be out of date if you're so eager to find him why I I went that route for a while I'll find out where he is get back see if I can't find out where that jerk puts his head down listen to me carefully John make sure this happens or you'll be sorry no need for a tantrum Bruce I'm on your side just remember when the time comes I want you to meet my friends mhm look I think I overstay my welcome here I'm I'm just going to slip away excuse me sorry it's uh it's been so nice catching up Bruce I miss this this trust between us H yeah me too John be in touch goodbye Bruce until next time intriguing fellow certainly with the green hair and the white skin and all yeah yeah intriguing I don't think that Outburst went unnoticed what have you say about John he gave me a lead on Riddler's location inform Gordon tell him to drag really good Anthony yeah this guy is good right so many voice actors just phone it in like do their regular voice when they play characters but you like did a character",
            "start": 4378.68
        },
        {
            "text": "well the thing is that like the weird thing is that Telltale always tells me the do things back really like I I usually take him into a very creepy uh you know like hey you know like just make it less cuz right now they want him to be very likable and John Doe yeah Doe um and so they're like just just almost do your regular voice but make it got enjoy the view hard to do I think it's always easier one thing for the bad to get ugly so you always want to go too far to far back than it is to you can't inject you can't inject that into can you go a little bit further can you be a little bit bigger can you you want to be too big back seems like the world's got it out for that guy spend some time in Arkham and I think the beauty of a performance is in the well I'm hoping that uh come the end of the",
            "start": 4461.32
        },
        {
            "text": "season go crazy wah 1547 I agree with you what' he say Anthony I was going to keep it on the doar Anthony is greater than Leto o I agree with that and that is a perfect example to me of pushing rather than pulling he was just trying to go too far oh I'm seeing a lot of nice comments thank you everybody very nice a construction site at the center of 46 Harley's boys demolish that area yep sure did you are just boring the **** out of people just they they can't they don't know what you're responding to you got to read the question too I was referring to what you're looking at the P talking over there you're drinking coffee you're drinking bourbon nobody can keep up Baker feels fishy a little bit well we're also off of this now too right or can they still see us no we're still on Kevin keeps",
            "start": 4510.68
        },
        {
            "text": "there you're drinking coffee you're drinking bourbon nobody can keep up Baker feels fishy a little bit well we're also off of this now too right or can they still see us no we're still on Kevin keeps moving us around now we're over the other we're down there see there's a laptop in front of me sure and I was like it's right here there's notifications I cover your notifications you know what I did is I asked Andy Cortez Andy Cortez when we hired him he said oh I know PC gaming like nobody's business I'm like can you turn off all my notifications on Steam and he came in **** around for 15 minutes and I got a virus and there's still notifications what the **** is a Leto that that was a assassin AK-47 well your screen name peace man or a girl I don't know assassin AK-47 he's a good dude he's a dude he came he came to Kinda Funny Live 3 VIP room we met him he didn't assassinate anybody did he have an AK-47 he did not have to use not to mention we talk about that all the time like an",
            "start": 4579.24
        },
        {
            "text": "he's a dude he came he came to Kinda Funny Live 3 VIP room we met him he didn't assassinate anybody did he have an AK-47 he did not have to use not to mention we talk about that all the time like an assassin with an AK-47 is that just a bad weapon a bad weapon choice that's a spray and pray you want like a you know Barrett like a 50 cal sure you know a lot about guns and assassinating people true like AK is just not to see on the same page it's got a fantastic chin oh she moved her people into my downtown Precinct without so much a thank you I tell you she keeps on chipping away at my authority I'm going to crack then let's find Riddler before he comes to that yeah grab a car and be meet you at Riddler's Hideout Riddler won't feel so clever after we come out oh by the way one last thing uh Nick's Gone go away Gordon look over there so you don't see me Let it's yeah everyone always turns around and then this one is just like **** it it's new kind of Batman yeah so we wanted to redo the kitchen",
            "start": 4631.28
        },
        {
            "text": "go away Gordon look over there so you don't see me Let it's yeah everyone always turns around and then this one is just like **** it it's new kind of Batman yeah so we wanted to redo the kitchen and then hello it became this really big thing and then here is the master bath no one's home I kept Waller and her agency people out of the loop on this Greg Jen needs you to hug her just the two of us we can handle this with yeah I know it's like it's like that's like something a super villain would say you know what I mean that's your wife yeah no not that part the hey your wife needs you to hug her like what the **** happening I'm on the middle of a stream do I need to stop everything is Pory dead no don't say that someone's keeping a scrapbook F isn't he See No Evil Hear no evil speak no evil we had to get special clearance from PETA by the way to use this the monkeys yeah a trap uh-oh damn it it's it's a bottle episode Jim and Batman learned a lot about each other in this episode ah",
            "start": 4684.32
        },
        {
            "text": "evil we had to get special clearance from PETA by the way to use this the monkeys yeah a trap uh-oh damn it it's it's a bottle episode Jim and Batman learned a lot about each other in this episode ah we're supposed to be out of this 0 it turned out I was a liver so close to retirement can you please not smoke in here ah Batman come on why don't you light up with me all right you only live once Batman all should have never gotten married hell the what they're getting drunk in the bottom Gotham is just going to hell give me a good honest crack house any day Jesus well okay so g into some we give me a good oldfashioned be at the CRA I'll be at the crack house Batman call me if you need me this twisted stuff uhoh God his eyes gone run on his crotch let's have a look at his crotch Alfred special agent Mario Fernandez holy crap people in the GCPD with ethnic last names do not do well Montoya Fernandez I love that they're diversity higher but um fully they're dropping like f yeah O'Shea and",
            "start": 4755.84
        },
        {
            "text": "agent Mario Fernandez holy crap people in the GCPD with ethnic last names do not do well Montoya Fernandez I love that they're diversity higher but um fully they're dropping like f yeah O'Shea and Johnson you know officer white those guys are just no no no we're going to hang back here at the office got some paperwork to do you guys go and check out that creepy place out by the Old Mill must have suffered a shock or a sudden jolt candal Hing from the ears I don't even know if I can I don't know I've never done a Gandalf never done a Gandalf um let me think he was trying to call for help the phone isn't getting a signal toku which joke which delivery and which joke was amazing damn it me either hey Jar45 thank you for staying sitting in fire as a masterpiece I appreciate that wait wait till the next one we'll talk about that later was missing the soul of the other one's almost completely melted he got electrocuted everybody his hand is p look at that good see great camera work that's",
            "start": 4825.2
        },
        {
            "text": "the next one we'll talk about that later was missing the soul of the other one's almost completely melted he got electrocuted everybody his hand is p look at that good see great camera work that's that new engine that new Telltale engine oh no uh-oh it's another death chamber that's a hell of an invitation Riddler's playing games bet he tried to play along oh we can learn from his mistakes let's find out what he did wrong I just see a a note in his pocket says it was consensual and the other side is the safe word that they wrote down oh God SC is on the the polarizing filter been tampered with like in sunglasses monitors yes Jim like yeah like thanks Jim Dynamite dropping Beacon of intellect commissioner obvious look at it for polarized legs not commission we all know that's where it's going or is it anything Series yeah this is this is outside of Canon we can do whatever we want masks each one missing a different why does he have pictures of Richard Nixon all over his no it's",
            "start": 4889.4
        },
        {
            "text": "it's going or is it anything Series yeah this is this is outside of Canon we can do whatever we want masks each one missing a different why does he have pictures of Richard Nixon all over his no it's it's the uh it's the new top adviser Ste Miller Ste Miller I'm making it relevant I'm making you're killing it right now the kids are wear the three black t-shirts and what it should be though is that Anthony should be where I'm sitting and it's like the devolving neckl holy crap it really is it looks a lot lower than no it's actually really low saves with electronic blcks I sweat from here oh keep that so we can all enjoy it's a lot of boob sweat now that would be under here wouldn't it yeah that's right I didn't look to you for that it's okay this is a Jazzy Beat too prototype of the Trap he used on L the armor extremely sturdy ensuring there's no possible way to open them other than solving his rules unless you're be this is an insane way to commit crimes even for this city",
            "start": 4955.96
        },
        {
            "text": "he used on L the armor extremely sturdy ensuring there's no possible way to open them other than solving his rules unless you're be this is an insane way to commit crimes even for this city Riddler has converted this entire Batman an enclosure designed to block electromagnetic having a big expositional conversation to explain stuff to guess it explains why our phones aren't getting signals that's right **** he's CL more monkey statues he loves these monkeys starting to sense a theme here this says Made in Thailand that must be a clue we're going to Thailand we didn't have the budget to go to Thailand in this episode it was impressive so there's a there's a tie people have great just a Tie Restaurant take a look at this well a tie person works at a r it's a Chick-fil-A but a tie person works there the GCPD issues its officers maybe there's a clue on the recording can't have to look I mean it said the guy that's lying dead on the floor me I'm giving you a chance your",
            "start": 5026.12
        },
        {
            "text": "a tie person works there the GCPD issues its officers maybe there's a clue on the recording can't have to look I mean it said the guy that's lying dead on the floor me I'm giving you a chance your other comrades won't get a chance at getting out of this alive will catch you the agency they'll fire shouldn't have to remind you that you've been chasing me for years and I've always been two steps ahead if you win the game I'll let you go free and you'll get a consolation prize an exclusive sneak peek into how I'm going to kill all of your colleagues that's a great all right a brand let everybody look under your chair B he had the age in Bound while he beat him all right things are getting real sad on Batman got the shoe this is very important clip W he's going to look at his shoe watch it's John and Murphy's must belonged to poor Cinderella over there okay are we calling him names already He's dead Jim s glass slipper here Jim These Are Bruno Magli's what you like O.J. war ah I don't",
            "start": 5104.8
        },
        {
            "text": "it's John and Murphy's must belonged to poor Cinderella over there okay are we calling him names already He's dead Jim s glass slipper here Jim These Are Bruno Magli's what you like O.J. war ah I don't want to link to the missing fers all right I don't have enough information yet another one of Riddler's sick Contraptions some kind of murder box I guess he was always a wacko but this takes it to a new level death chamber murder box whatever it's still warm there must be some kind of heating element underneath this thing is built like a OV you could be cooked alive in there I'm new shoe guys turn me around but not the right way and you might live to see another day what does it mean well it's he's a beat poet so it's really more about interpretation so it is clear anti-establishment you know themes but the wheel represents Society in place the floor of the Box heated up assassin I did not do anything in Wolf Among Us but I did play the series one foot to save the other",
            "start": 5177.88
        },
        {
            "text": "you know themes but the wheel represents Society in place the floor of the Box heated up assassin I did not do anything in Wolf Among Us but I did play the series one foot to save the other causing that shoe to catch on fire when he exited the box he tried to put the fire out but couldn't so he threw off his shoe if this door were closed the portal would be looking right at those monitors since the monitors have been tampered with it's likely there's a message on it one that can only be seen with the polarized legs you won't know to your inside the Box though he just says you're going to die hey I got a hunch come here oh a hunch no matter how careful Riddler is chances are good he hasn't scrubbed his own computer really would that be the first thing the porn you're going to find buddy my God Riddler just is some sick **** there's not a man in the world that doesn't get up from his computer and go delete the history from just the last hour I recognize some of the names on",
            "start": 5244.44
        },
        {
            "text": "buddy my God Riddler just is some sick **** there's not a man in the world that doesn't get up from his computer and go delete the history from just the last hour I recognize some of the names on this list they're all Waller's people names addresses phone numbers we have to warn her okay first we have to get out of here Mory he's sold technology Riddler I talk about strange bed fellows you know Waller's been keeping pretty tight tabs on can you imagine what Gordon looks like without the mustache like he's got to have a huge upper lip yeah it's bit like when Tom Selleck shared his must yeah like I don't care what's in Vogue right now bring it back just wonderful psychos to worry about OBS stoping I'm going to stop the stream on OBS and start again it reconnected on it okay that's you just had to threaten we get lucky Kevin's really good he came over and threaten the computer earlier to get the controller working God I will thrt you it's coming back oh is there a bathroom break you",
            "start": 5317.12
        },
        {
            "text": "had to threaten we get lucky Kevin's really good he came over and threaten the computer earlier to get the controller working God I will thrt you it's coming back oh is there a bathroom break you can go anytime you want we're laidback stream can yeah go you're fine just go we can talk about you if you go there it is no don't don't go in your seat go I'll uh got to unic myself somehow the agent must have been looking for the answer of one of these s be back in an hour all right see you sir he chose theong great scream who is that him his fingers will help clever you got a VR in that cow or something don't you got VR there no Jim I don't have a VR my da Barber always talking about them vrs God what you got to you got one of them Nintendos show talk about that Switch she's switching it up over there Batman no Jim I have stateoftheart God augmented reality son of a **** would you rather sit on the other side who no connection there why is it freaking you out you just looked at",
            "start": 5375.04
        },
        {
            "text": "it up over there Batman no Jim I have stateoftheart God augmented reality son of a **** would you rather sit on the other side who no connection there why is it freaking you out you just looked at it weird is it imbalan no I was just I was trying to see what it looks like is it easier for you to see on the other side no Okay Kevin I'm happy I think we should leave this here until they decide to give you guys a sponsorship I ate a lot of them blueberry off once he fell call for help oh no didn't didn't do it accurately put inside the murder box okay so we're going with murder box hell yeah shoot lit up there it is the agent's shoe caught fire inside the m so he opened it in there it is do as soon as he was out of the box he ripped off the burning shoe somewhere in the confusion he must have missed something crucial you can see that all from the Nintendo in your head you got that old Game Boy up there from where he lost his shoe the agent be L for the wall of saves he opened one but",
            "start": 5436.28
        },
        {
            "text": "have missed something crucial you can see that all from the Nintendo in your head you got that old Game Boy up there from where he lost his shoe the agent be L for the wall of saves he opened one but chose poorly the blades sashed off his fingers **** and hurts right yeah though it's still unclear how and when hiss what's great is that he had to think about this like you know he got that wrong the first like dozen times like he's a really smart guy he's like a **** I didn't fig this out what okay guys guys guys what if I put fire underneath fire underneath uh was it gas or electric guys I don't know matter **** it's this is what you're here for getting inside the box and starting the game is the only way we're getting out of here this is insane you know that right the last man who went in there is dead there's a good chance it'll kill you too maybe You'd like to goe solve yourself no go ahead I wouldn't want to steal you thunder here we go you're the GoPro I'm looking at you in",
            "start": 5497.28
        },
        {
            "text": "went in there is dead there's a good chance it'll kill you too maybe You'd like to goe solve yourself no go ahead I wouldn't want to steal you thunder here we go you're the GoPro I'm looking at you in this one oh boy no am I okay am I you're you're good I me is it okay and I'll I'll place it love give me a second turn the wheel turn the wheel Greg hurry the hell up already my microphone was also kind of plunging my that's what that agent did keep turning you got a Cris up real good you don't get a move on can you look message one won't one won't and one will ask the thing one won't see trouble and one tells no lies ask the third if he hides the prize the monkeys See No Evil Hear no evil speak no evil thanks Gordon which one is he referring to whichever one it is the correct s will have a face with those is removed yeah I'll check God damn it they're still lock shut they should unlock when I open this door they should one won't see trouble ah no let me out let me out let me out uhoh",
            "start": 5552.12
        },
        {
            "text": "a face with those is removed yeah I'll check God damn it they're still lock shut they should unlock when I open this door they should one won't see trouble ah no let me out let me out let me out uhoh he's got a suit it's fine oh okay he de he dead he dead I got to get out right away that's the only response that Gordon gave you like's next clue getting ins inside the box and starting the game is the only so it's the here one we got to look for the here one one this is insane you know that right tell the last man in there is dead don't worry CH I'm not going to lose this game I'm not so sure yeah **** you if you say a thing you usually do it oops he Rising B then oh running on huh running late on God yep were you told them before right that we'll often be late hurry the hell up already one won't see trouble and one tells no lies the third if he the prize the monkeys See No Evil Hear no evil speak no evil but which one is he referring to come on whichever one it is the correct",
            "start": 5631.08
        },
        {
            "text": "one won't see trouble and one tells no lies the third if he the prize the monkeys See No Evil Hear no evil speak no evil but which one is he referring to come on whichever one it is the correct SA have a face with those that that's I'll check God damn it there's still lck shut wait is that the one he tried though lost his fingers you sure yes the one that he lost his fingers on it'll open upstairs okay see it's going to make loud noises go Batman just move congratulations you're almost done go that is if you can withstand my short range ultrasonic device Let's test it out shall we the riddle use it to open the saf I'll put a stop to this damn it's loud why God go just go Batman no stop that's the end of the concert God whatever is not safe that'll be worth all this pain another bomb it's a torpedo a missile oh is that what it is it's a homing missile no it's a vibrator yes looking at it schematics now my neck massage how embarrassing Jesus bad Riddler just like yes sorry",
            "start": 5706.68
        },
        {
            "text": "bomb it's a torpedo a missile oh is that what it is it's a homing missile no it's a vibrator yes looking at it schematics now my neck massage how embarrassing Jesus bad Riddler just like yes sorry the wrong guys I'm sorry just going to sneak in real quick sorry I'm going to do little Switcheroo here Riddler, Mory sold me missiles for all of my enemies everyone on my list gets one this a Fleshlight don't even know what's coming Jesus for a brief second their dull existences will light up turn yourself in while you still have J don't say stupid things okay love it not when you just started earning my respect I'm trying to get a handle on you Batman partnering with Gordon is one thing from what I remember of the old days he's harmless enough we'll see about that when you're in cuffs but the agency they're a natural enemy to people like you and me you must be desperate if you're making friends for them you must be really up against the ropes to want that government scum in your corner they're no",
            "start": 5823.08
        },
        {
            "text": "a natural enemy to people like you and me you must be desperate if you're making friends for them you must be really up against the ropes to want that government scum in your corner they're no friends of mine no they're not they'll smile to your face to get what they want I've seen this already but I'll still watch it Agency people Batman corrupts their Wars wasn't always like this freaking yeah we like to spoil the wor we put on the internet about 14 hours in the future no problems bringing it up there go ahead and watch it way really strange accent though don't forget sounds so strange that's the thing about having a mind like mine if you're coin it's not working I'm not trying to get in your head I'm already there I just wanted to see if the man who claims he fights for justice is really as good as he believes but then you already answered that for me didn't you when you offloaded my puzzle on your friend damn why don't you tell Gordon here what happened to Lucius Fox don't watch out",
            "start": 5891.88
        },
        {
            "text": "as good as he believes but then you already answered that for me didn't you when you offloaded my puzzle on your friend damn why don't you tell Gordon here what happened to Lucius Fox don't watch out commissioner for all his preaching Batman knows when to sacrifice a pawn to win the game it was Gordon's face getting out of the way of the blast who is on my lip only a pragmatis would do you shouldn't have said his name Riddler I'll make you pay for what happened to Lucius that must be the guilt of talking after all the poor man's death is on you look at Gordon he doesn't know what to make of any of it cuz Gordon's hard ear yet easily lost isn't it come on now don't get your tights in a Twist I knew you weren't sharp enough to do it on purpose there's no room at the top for school boys who are too squeamish to fight in the gutter you don't have what it takes to be a player in this town not without giving up those values you hold so dear game on well this is awkward commissioner Gordon's",
            "start": 5952.88
        },
        {
            "text": "too squeamish to fight in the gutter you don't have what it takes to be a player in this town not without giving up those values you hold so dear game on well this is awkward commissioner Gordon's questioning every life choice he's ever made what have I done with myself I'll wait for Waller and pass on what we found I she won't be happy when she know about every agency operative in Gotham I don't blame her if they were my cops no one will be sleeping till we found this Riddler guy just keep your eyes this Riddler guy has a name in the mean I'll stay on Riddler's. American hey hey hold up a sec what Riddler said in there about the agency smoking mirrors you asked me but the thing about Lucius Fox and the blast at Wayne Tower don't dig you got a level Gordon you got some connection with that Wayne Tech Guy you didn't tell me about yeah yeah put it together bud what do you want me to do I can't tell you I'd tell you if I could Jim it's like that huh a **** you man as I said if I could I",
            "start": 6012.84
        },
        {
            "text": "Wayne Tech Guy you didn't tell me about yeah yeah put it together bud what do you want me to do I can't tell you I'd tell you if I could Jim it's like that huh a **** you man as I said if I could I got to say the fact I had to learn about it from Riddler instead of you you think John lives there sit right with me at all we had some trust you and I hey guys you me to do keeping it down I am trying to my hands um whatever you do this has to stay between us oh does it because I what just happened to stumble into it that is B you no no I mean I wasn't born yesterday I know you probably have a network of civilians working for you just you no there's not you can't do the kinds of things you do without a gigantic support system if you really think it's you're my support system Jim it's always been you yeah dude come on this is when it like gets real Gordon you know how much you mean to me are you saying you want to see other people I'll be waiting to hear from you oh my God oh we just broke",
            "start": 6076.04
        },
        {
            "text": "you yeah dude come on this is when it like gets real Gordon you know how much you mean to me are you saying you want to see other people I'll be waiting to hear from you oh my God oh we just broke up I shouldn't have said that in your eyes he's out there with the boom okay pull together rock paper scissors I just haven't been the same since it happened I heard your discussion with Commissioner Gordon now he knows the Lucius Fox and the Batman are were allies Gordon's dangerously close to figuring out who you are if he does find out I have no idea how he react it's not a chance you could afford to take couldn't lie worrying about it won't help anything come on buddy will be in Cavalier you were radio silent for so long tell me did you find out how Lucius died this is a missile I found in Riddler's Workshop the explosion at Wayne Tower they were thinking about it all wrong conveniently he can get D work on there too it was an emitter when it was solved it emitted a signal you",
            "start": 6140.92
        },
        {
            "text": "found in Riddler's Workshop the explosion at Wayne Tower they were thinking about it all wrong conveniently he can get D work on there too it was an emitter when it was solved it emitted a signal you heard it earlier it emitted a signal is a terrible sentence to say by the way a signal it admitted a signal it admitted a signal especially after like 4 hours solve the X. A sign didn't know it the B-Scrambler blocked the signal that and defibrillator. Defibrillator. It's def not def has gotten smaller because of it's terrible the three of us looking out doesn't sound like a real word with Lucius gone we need to find someone to take over his role no one could ever fill his shoes but but you're right between the Lady Arkham Affair that was a quick turn no no make a point a new class of a criminal this war our about it the list of agency operatives from Riddler's Workshop built in Apple TV Plus to do the same thing to them it's a hint list it's only useful if he has a way to target the agents though",
            "start": 6216.2
        },
        {
            "text": "war our about it the list of agency operatives from Riddler's Workshop built in Apple TV Plus to do the same thing to them it's a hint list it's only useful if he has a way to target the agents though and I doubt he's sending them all puzzle boxes well it is just walk through it he's hacked their cell phones he could pinpoint the location of any one of these operatives and he can broadcast his signal through their phone to make them a target of a missile strike missile Wi-Fi missile block it smart missile I can get a clean copy of the signal yes it's the only way I can get a clean version of the signal it's pretty Grim Alfred you don't have to watch I can handle it good for you I've never been one to shy away from Duty however unpleasant it may be you said Duty you are a rock Alfred I'm always able to count on you you are an times the last thing I want to do is let you down Bruce get my daughter out of the building get yourself out what are you talking what did you",
            "start": 6281.44
        },
        {
            "text": "a rock Alfred I'm always able to count on you you are an times the last thing I want to do is let you down Bruce get my daughter out of the building get yourself out what are you talking what did you figure out I've I've solved the Riddler puzzle Bruce he knew he was going to die get it from your desk can you switch to Audio Only please can't do it in hand in hands tell Tiffany that I love her that I'm sorry that's like the Cthulhu Factor Anything is worse than what you're seeing you know we really made a difference didn't we Batman I I I shouldn't have watched this I'll some rock I'll go get that tea master Bruce all right I just need to create a filter to get a clean version of the signal and then match up the points found in both sound files wa Batman no well the two cells have to be the same Batman he going to autotune it R Bruce Enterprises Tower I need to keep looking now the sounds have to match for this to work well like the Daft Punk signal like soundtrack",
            "start": 6376.8
        },
        {
            "text": "cells have to be the same Batman he going to autotune it R Bruce Enterprises Tower I need to keep looking now the sounds have to match for this to work well like the Daft Punk signal like soundtrack happened Tiffany Tower. Tower T. Tiffany Tower. T. Tiffany Tower. yeah you can just remix this **** Tiffany Tower got to keep trying oh that got be the same word yeah I tode the same sounding Bruce. Bruce. all right don't I'm kick on my feet come the feast Tiffany. Tiffany. Tiffany. Tiffany. there you go Tiffany that's a match Bruce. Bruce. Bruce. Point fours match there I've piggybacked on Riddler's cell phone hack they'll recognize any incoming signal match and shut down negating a lodge makes sense for for me to have a signal on me as well what for Riddler still has functioning missiles once he finds out I blocked his targets he may decide to launch indiscriminately but with a signal I might be able to divert them Tiffany gave me this the day Lucius died it's still got blood work she's been",
            "start": 6460.4
        },
        {
            "text": "out I blocked his targets he may decide to launch indiscriminately but with a signal I might be able to divert them Tiffany gave me this the day Lucius died it's still got blood work she's been watching us this whole time it's not a theory I really want to test so we had better find Riddler first there is always Riddler's second in command Eli Nabal arrested after his attack on the casino none of the authorities have gotten anything out of him yet unknown contact what is it that from Arkham who actually sounds like he's keeping his word I always do stop it Mory thinks that Mory can get us Riddler's location it's a really fast response like attacks fast maybe we should go back to the beginning bring Mory up on the back computer uh can't you just your hands are broken you just walk over and type either of them can potentially lead me to him the question is which is more likely to help you Mory's a businessman given the right incentive he could be persuaded to talk he sure",
            "start": 6570.16
        },
        {
            "text": "walk over and type either of them can potentially lead me to him the question is which is more likely to help you Mory's a businessman given the right incentive he could be persuaded to talk he sure can't have any love for Riddler after his attempted murder at the casino I'd say he respond better to a more Gentile approach peer-to-peer as Bruce Wayne however the agency is watching him if Waller finds out that Bruce Wayne sought a parley with Mory she'll not be best pleased on the other hand Riddler's Lieutenant at least John doesn't send nudes you don't know well there are those there are a few up quite a fight cracking him will me tougher more physical certainly a job for Batman he's currently in Waller's custody in a GCPD that's we're going we're going to go beat this guy up right call dude going go you're going to be an enabler like it Gordon doesn't like it man he doesn't like anything true he's all pissy about me having other friends he's hardboiled let's go I'll talk to Eli it'll",
            "start": 6660.92
        },
        {
            "text": "going go you're going to be an enabler like it Gordon doesn't like it man he doesn't like anything true he's all pissy about me having other friends he's hardboiled let's go I'll talk to Eli it'll be nice to catch up tell Waller I'm on my way to brutalize them to break some stuff try yeah dude it's been a while time to let the dogs off the leash you know what I'm saying sir perhap you still consider a high so Alfred isn't doing so well no he's struggling huh he makes it out of the Season PTSD I have no idea guy was like viciously kidnapped and beaten and he's not young he's not a young man yeah lost an eye he's got headphones in he's got Beats by Dre oh Batman Gordon's in briefing the deputy office that's a cool thing about you know sure know you were here you know that famous scene where he's like looking for me and he does that he was listening to like his own stuff in that head on when he doing they give you any trouble I'll straighten them out running around like they own the place you",
            "start": 6721.48
        },
        {
            "text": "like looking for me and he does that he was listening to like his own stuff in that head on when he doing they give you any trouble I'll straighten them out running around like they own the place you have Eli Nabal in custody take me to him Nabal's my prisoner not hers says who four of my agents went missing nobody knows who she is everyone keeps going who are you says who my she hasn't said her name yet I don't believe either random woman like wanders in she works at Best Buy she had a badge we thought that she isn't she supposed to be she seems she just kind of threw away she was with the tour and just didn't leave Not much got glasses on but you'd be wrong to assume I don't care about Beats by Dre wow that's Riddler's Lieutenant hasn't given us a damn thing I'm hoping you'll have better luck making him talk that's why I'm here that and the donuts come on then just don't actually haveing the don't you yeah but there's there's no sprinkles left that's okay Gordon told me you talked to",
            "start": 6793.68
        },
        {
            "text": "luck making him talk that's why I'm here that and the donuts come on then just don't actually haveing the don't you yeah but there's there's no sprinkles left that's okay Gordon told me you talked to Riddler in the workshop weirdest walk ever it's like he's doing a slow walk and she's not nothing worth mentioning you speed it up we're trying to go somewhere anything that helps us get this guy I got you already know all there is guess I'm going to have to have a longer conversation with Gordon yeah buddy after we put the screws on Nabal what you know I saw what you did Carmine Falcone last year dangling a 60-year-old man off a highrise was certainly effective and fun you asked me you could have gone further I didn't what's your point you're a crazy **** aren't you slam her use any me yeah choke me what what not going the right way she puts her own ball gag in her mouth oh my God whatever it takes you and me we're doers Batman wink we know how to get you want to do me Batman what what",
            "start": 6848.64
        },
        {
            "text": "choke me what what not going the right way she puts her own ball gag in her mouth oh my God whatever it takes you and me we're doers Batman wink we know how to get you want to do me Batman what what I didn't think I like you but I like you I love she's wearing she's wearing a tight pant suit too sure like the crotch is no joke on those your new interrogator Eli I believe you two have met before hi Eli damn get up and get in that goddamn chair oh **** oh big probably best to keep this off the record I love that there's always like a switch on the camera me to those guys are going keep it off take it off huh you said no that's not what I said what's the safe word need anything else uh oh the password is you might hear some Screaming in a minute pretend you can't pretend you don't I'm going to file a report be a man she's up there just like smoking a cigarette I'm buttoning her pants Miss to get to it no please you you you don't have to do that Batman I'm so so glad you're here",
            "start": 6906.88
        },
        {
            "text": "to file a report be a man she's up there just like smoking a cigarette I'm buttoning her pants Miss to get to it no please you you you don't have to do that Batman I'm so so glad you're here these people it looks like uh they ran the cops off oh man what's his name you you're you keep them and keep her from killing me said to had rules against that against killing I mean more like so don't test it guideline and all what's going with who we don't have only thing moving this mule is a he's talking he's responding to the game yeah I was trying to find a u dang it I'm getting there I can't think his name the actor who's uh good reminds me of your job what's going on over there he's jumped up for no reason try having a stroke help string up you said I can't tell you and I said it a million times to the guys before the only thing I'm more scared of to dying is pissing him off you've seen his machines he can hurt you in ways they don't got names for don't have names for oh **** the",
            "start": 6978.32
        },
        {
            "text": "times to the guys before the only thing I'm more scared of to dying is pissing him off you've seen his machines he can hurt you in ways they don't got names for don't have names for oh **** the only one get tonight is you tell me where Riddler is Scott Melville that's what he looks like looks like Scott Melville him he can kill any one of us anytime he wants uh Stretch Armstrong he's a guys are dead he's talking about the signal he has no idea you protected the agent phones there's no one that can save me if I cross this isn't good byebye byebye Riddler hey I said I'm doing the thing that I won't do in my real game we start hurting me does nothing there's no getting away from him he could be anywhere with his signal Bruce his fear of Riddler is too great you have to get in head somehow shut up Alfred done this before I'm going to hurt him Alfred don't worry there's nothing you can do Batman what do you want Kev beat him until he talks beat him until he talks says Kevin I would have done the signal I",
            "start": 7056.52
        },
        {
            "text": "this before I'm going to hurt him Alfred don't worry there's nothing you can do Batman what do you want Kev beat him until he talks beat him until he talks says Kevin I would have done the signal I will do the signal as well but look at that left-handed oh yeah he's left handed that's a concussion Jesus the sound cringed my goddamn please there you go there you go see that's you hit him again that's special reconstructive surgery he didn't tell me what I want to know keep going can you kill him and where's he hiding he's on his ship he Gotham Bay what ship the Lady of Dublin he's launching the missiles there too what the hell Batman what have you done Justice what that isn't really scar I don't know that's just his answer to everything Justice what do you want for breakfast justice justice how could you how could you hurt him like that honestly I can't see him recovering from head trauma like that I was in a hurry he was slowing me down but we're we're supposed to be the good guys",
            "start": 7133.64
        },
        {
            "text": "how could you how could you hurt him like that honestly I can't see him recovering from head trauma like that I was in a hurry he was slowing me down but we're we're supposed to be the good guys sometimes good is just another word for ineffective detective it's all about a means to an end you you're a monster yeah but he's my monster Waller she's a total freak man she like a freaky Dicky the Lady of Dublin sorry D, right, boat to the Emerald Isle armed men on board oh that thing's way smaller than I thought it was be careful Bruce it's like this big adorable it's adorable I'm on Port Authority do you see Riddler you won't get away with this what do you think's going to happen noise again are we agent what's your name Blake a hero need to get a better angle you'll see what's going to happen my friends well I'll be here soon then you'll see what this is all in made of you agency imbeciles really thought you couldn't stand me you and your boss what we found him your interrogation of Riddler's",
            "start": 7212.8
        },
        {
            "text": "well I'll be here soon then you'll see what this is all in made of you agency imbeciles really thought you couldn't stand me you and your boss what we found him your interrogation of Riddler's man produced solid intelligence no sight of the missiles yet though they must be here somewhere institutional incompetence hostages they appear to be more of Waller's agents agents of Avesta and are likely among them based on what Waller told us you you're relentless I'll admit it's going to feel satisfying to get my revenge on your process a good spot for cover even if you're really just a small part of my plan boy he can monologue right we'll see what I mean soon of course so in closing I would say when they understand yeah actually you can go and shoot me man whatever you I'm tired yeah going to die anyway please big picture don't want him raising an alarm struggle people see that you think I'm sure you can understand sometimes my method can appear a little unorthodox jeez dead swear to me that didn't scan",
            "start": 7309.8
        },
        {
            "text": "please big picture don't want him raising an alarm struggle people see that you think I'm sure you can understand sometimes my method can appear a little unorthodox jeez dead swear to me that didn't scan either 5150 is really one of those be awesome you brought this on yourselves all of you you government clowns really thought you were smarter than it's clear you're in desperate need of some schooling click Goddamn my friends will be here soon I'd keep your mouths shut until then hostages first with their safe I can find the missiles targeting online ready Bruce is that the Luminar playing with Greg that's awesome Guests are getting good buddy you're stepping it up I don't know let the hostages go yeah you can't possibly is enough to make me roll over oversized vermin well that's hey come on rude no name calling buddy that would kill anybody Agent Avesta more it's heating up yeah that's not going to be good for you honey people them I like how he goes in watch the hand placement are you all",
            "start": 7371.12
        },
        {
            "text": "no name calling buddy that would kill anybody Agent Avesta more it's heating up yeah that's not going to be good for you honey people them I like how he goes in watch the hand placement are you all right I'm really **** up right now I'm better than oh God not more he's wearing something that neutralizes the shock device son of a **** he would would I memorized your playbook Batman I know all your shallow tricks poor Eli held out longer than I expected but I knew he'd give me up eventually all part of the plan that's all part of the plan bait just like the hostages were bait I knew you couldn't bear to let these agents die you care too much about the little people that makes you weak a I saw how you oh that's actually I'll do for angry you got about what happened to Fox I heard a lot of people doing what I do my code is how I stay human it's why I'm out here and you're in there well about to meet your maker my partners were supposed to be here to see this I guess",
            "start": 7455.64
        },
        {
            "text": "I could just show them the bodies I'm going to ask you three questions get them wrong one of these agents gets torn apart goddamn get them right and this happens I designed this for you Batman Gotham's champion of Justice will die in an unfair puzzle let's get started we have a lot to get through it's me you want not Agent Avesta let her go oh no she needs to be in there with you you can handle the sonic blasts but her I estimate three blasts at most before her insights rupture this one should be easy Batman close to the heart I solved a puzzle box for the bat now I'm dead and I mean dismembered closed casket for sure kind of dead who am I if you know the Riddler please say it you're the Riddler my colleagues will die otherwise up Batman which one of your dead friends am I need a hint starts",
            "start": 7567.2
        },
        {
            "text": "closed casket for sure kind of dead who am I if you know the Riddler please say it you're the Riddler my colleagues will die otherwise up Batman which one of your dead friends am I need a hint starts with the letters L I want to do it and on my play through I'll take it but in this play through I'm going to kill the as suffer for their soul I'm not going to play this game somebody dies either way Kevin dead wrong no please that wasn't his answer please please oh Blake oh my God Blake that was her boyfriend number two also completely self-evident I am black and blue and bleeding from the ears who am I I think I think he means me I'm aware of who he means say it I need an answer just say it or click click you're too clever for me Riddler I don't know how to answer finally some humility from you it's a shame it's not what I'm looking for so you're think she single Patrick no didn't really care Blake that was her man Patrick horribly racist by the way he owed me 0 bucks oh no not I'll",
            "start": 7652.92
        },
        {
            "text": "you it's a shame it's not what I'm looking for so you're think she single Patrick no didn't really care Blake that was her man Patrick horribly racist by the way he owed me 0 bucks oh no not I'll distract him just get us out of here I'm the sharpest mind you'll ever meet the original genius with Gotham at my feet who am I I'm the OGC busted out well done Agent Avesta you answered so quickly you almost deserve not to get the blast yeah why didn't you do this sooner Bud oh the distraction of course swe swe swe sweep ohoh I'll fire with missile use the Bat-Cam to make it target the cage okay well that's a pretty it's a very close target there Batman I don't know and use Riddler's trap to protect Avesta and myself from the explosion I like what you're saying Agent Avesta but you're not the one I need to hear it from missile armed ready to fire who's the genius Batman who's on top of Gotham now I am yeah what are you doing this I think is just Reed",
            "start": 7729.84
        },
        {
            "text": "but you're not the one I need to hear it from missile armed ready to fire who's the genius Batman who's on top of Gotham now I am yeah what are you doing this I think is just Reed Richards here too yeah no no no no no he's pulling an Indiana Jones oh nuke the fridge oh no Batman impossible be you think you're clever don't you you you oh yeah damn oh who who's the man who's got no time left you Riddler yeah don't you get such an easy one right those missiles are aimed right at the city the answer is Batman hi dronie come here see this is when the Star Wars program would have been great yeah you're welcome for that 8s reference by the way Jack I'm the king of the world this can't be happening field kicking you know right up the ass it's good right up the ass that's what I thought he was going to do too I thought so right down Main Street and then into the water do the Goofy sorry about your your friends they were both super",
            "start": 7816.0
        },
        {
            "text": "ass it's good right up the ass that's what I thought he was going to do too I thought so right down Main Street and then into the water do the Goofy sorry about your your friends they were both super awkward so you're and I tracked Riddler's ship through the Port Authority logs we thought we could bring him in ourselves yeah snatched us straight off the docks I should have said no urged caution and now and now my colleagues are she's like a cat all we did was Riddler more hostages Catwoman who do you think Riddler without back it's you isn't it you knew how dangerous he was I know yeah that's what I just said I I'm already admitting wanted to catch him so badly mean yeah after everything he' done wait sucks to me you that's my Uber I have to go still kick yeah he's pretty scrappy for a little guy right you know you can take him down look forward to a padded is this really a victory for you Batman I mean kind of you're the one in cuffs yeah but you're the one that broke your precious",
            "start": 7984.04
        },
        {
            "text": "guy right you know you can take him down look forward to a padded is this really a victory for you Batman I mean kind of you're the one in cuffs yeah but you're the one that broke your precious rules I guess you let one agent die to save another two actually but I didn't kill him I can't sit right with you can it this entire twisted situation is your doing Riddler all blame is on you and so the consequences is it you came with me remember not the other way around well yeah but you're see the way you already kidnapped all guys you started it yeah good for you you pushed me through tested his precious code so look I got a thing I got to get too but you have yourself enjoy say hi to Commissioner Gordon um things have been bad between us show them I thought they'd back me up even if they didn't agree they left me here he looks like he just drank a bunch of punch and is like not like he got punched but that he just punch you need better friends the first group with bad snacks friends they're all so",
            "start": 8055.96
        },
        {
            "text": "they left me here he looks like he just drank a bunch of punch and is like not like he got punched but that he just punch you need better friends the first group with bad snacks friends they're all so small-minded none of them had Vision those helicopters are taking a long they're like hovering like hey are you guys done patching they're having a moment let's just circle around they they look at their tou give a second uh oh oh what's that they broke the pad, the P.E. Buddy hey are you are you okay H uh maybe it's connected to the dark in his neck this smells like Cosby Pudding Pops uh that's evidence lock the ship down and radio for more Medics just once I would love to see him just like do the Bat-Grapple and like comes right back down Ting I hope it was and then Uber comes up Batman yeah we got call here for Batman Waller's agents are dead we're not getting a shred of usable testimony out of Eli Nabal that after you beat him half to death in my custody you went behind my back with Waller",
            "start": 8123.28
        },
        {
            "text": "got call here for Batman Waller's agents are dead we're not getting a shred of usable testimony out of Eli Nabal that after you beat him half to death in my custody you went behind my back with Waller and buried the investigation in the process this this is beyond the goddamn pale what were you thinking stopping Riddler's everything I did was a means to are you remember that and a P.R. I've heard it but uh the trust between us it's gone it's gone oh boy that's fast oh that's fast partnership was over no more sharing beyond the back the GCPD can't support you anymore but Gordon so much for Gotham, Jim that sounds like this I I can't work with someone who goes behind my back and that's all there is to it break his arm too no I just want to know how such a messed up place you're supposed to be the one with the answers commissioner that sounds like a the way I see it Batman took initiative getting a confession from me you on the other oh Commissioner Gordon that is not this mess here that's on you",
            "start": 8229.8
        },
        {
            "text": "with the answers commissioner that sounds like a the way I see it Batman's had his priorities straight but you my thoughts exactly if you spend less time complaining maybe you'd get more done oh man son of a I mean going doubling down that's enough commissioner consider it a kindness I don't just straight up get you demoted you're tearing me apart now leave us alone we have sensitive guile oh hi Mark you're my favorite customer so tell me how's your sex life oh hi oh hi it's not true it's not H this city is about to find itself in a crisis the likes of which it's never know Riddler had a clue not uh we noticed in the script there's like eight seas from all over the world here in Gotham I think we can get this across with just the one no the one but we repeat it I'm assuming you heard them by now yeah also watching the DA you're creepy camera the roses that",
            "start": 8297.92
        },
        {
            "text": "the world here in Gotham I think we can get this across with just the one no the one but we repeat it I'm assuming you heard them by now yeah also watching the DA you're creepy camera the roses that fits a theory have a thousand Riddler's roses evidence from his Workshop suggests he was involved in a feud with another member the group oh who could it be now I'm going to have to actually insert myself into you for this Harley uhoh oh my God uhoh very elusive keeps her head down much more so than that show off Riddler he was going to be my way in once we captured him alive but now I have you to lean on I'm going a man who lives on both sides of and knows exactly I thought he was going to yeah right yes you and I will be working together very closely are you h on me bro extremely CL what what a cliffhanger what a cliffhanger who saw that no there's four more chapters meanwhile back at the Batcave yeah see people know they don't trust her so uh by the way as is a credits roll congratulations to",
            "start": 8361.24
        },
        {
            "text": "what a cliffhanger who saw that no there's four more chapters meanwhile back at the Batcave yeah see people know they don't trust her so uh by the way as is a credits roll congratulations to everybody there for such a great game Telltale working their asses off to bring us season two that was kind of like Warrior line but I felt like I would you nailed it you nailed it good oh man everybody made Tiffany pissed off let Tiffany furious I'm just upset I feel like it was a little pigeonholed to do that like you need to do that in order to spurn that relationship on so feels like you want to be honest get out Will Beckman, William Beckman as he credit there he is there he is you in 44.4 % oh I was frustrated when you didn't like the goddamn card there's some great stuff uh coming up in episode okay um I'm I'm really really excited about this was this is been cool for me there's our cast yay our illustrious cast Emily O'Brien that's who that is she's great Anthony Ingruber that's you buddy he is um",
            "start": 8432.92
        },
        {
            "text": "I'm I'm really really excited about this was this is been cool for me there's our cast yay our illustrious cast Emily O'Brien that's who that is she's great Anthony Ingruber that's you buddy he is um this was the first time that I got a chance uh this season actually go up to Telltale and if you get a chance to do it too man it's amazing to go up to Telltale and actually sit in on the table read and their process is really cool everybody all the department heads get together and we go through the entire script and we play through the game um and so everybody gets a chance to kind of sound off and and talk from their perspective uh not only a what their challenges were what they're still wrestling with and kind of troubleshoot and and crowdsource the solutions to the some of the problems because when we first start off it's close even season but there's still so many obstacles that we have to overcome and it's really great and at least from the top down so Leo the the uh uh lead",
            "start": 8489.88
        },
        {
            "text": "because when we first start off it's close even season but there's still so many obstacles that we have to overcome and it's really great and at least from the top down so Leo the the uh uh lead creative at Telltale to actually sit down and play through the game and I really commend her honesty she sits down with everybody goes here's where I'm confused I don't feel like me as the player I get to have this and so everybody gets a chance to to really kind of talk about the process and it was really informative for me as an actor to find out how much hard work went into making this game and writing this game and just delivering the pages that we as actors step into the booth and actually read so uh a huge hats off to our writers um and everybody who's who's been a part of this franchise cuz it's it's there's a lot of hard work and there's a lot of Batman love that's going into it and we're breaking a lot of people's brains because awesome yeah we're doing a lot of stuff that's",
            "start": 8543.28
        },
        {
            "text": "cuz it's there's a lot of hard work and there's a lot of Batman love that's going into it and we're breaking a lot of people's brains because awesome yeah we're doing a lot of stuff that's different than Batman so it seems it seems really like Telltale is just taking every thing that we expect from the Mythos of 70 years of Batman and just changing everything so it's I mean the writers have some serious balls on Big Balls to go against again that's another example too I think of also pulling it not pushing because there's a lot of people within Telltale who are we're having to pull him back like Geoff Johns just got to go back going well we can't do that like we would love to be able to do something but let's let's bring it back a little bit um that's fantastic in memory of Adam West thank you I love that they got to do that there he is well done team uh that was awesome yeah it's fun yeah I'm really looking forward to see it breaks your brain a little bit too cuz you're you're",
            "start": 8585.12
        },
        {
            "text": "thank you I love that they got to do that there he is well done team uh that was awesome yeah it's fun yeah I'm really looking forward to see it breaks your brain a little bit too cuz you're you're pretty hardcore if this was Superman there's no way I don't think you could do this no yeah I couldn't go against the grain I'd have to play you have to play that's why I like this one I I can just do whatever I want with it you know what I mean not my true save I have my canon save I got this PC thing I do whatever I want to would you say more iterations of Batman than Superman for sure right although yeah I I think the Elseworlds um Superman was amazing as well cuz I mean they've done that a lot with Batman where they put him in you know Gotham by Gaslight and Red Rain and stuff but um the best one was Superman: Red Son yeah it's brilliant and I think that's kind of what Telltale wants to do they don't want to tell the same story they're in their own Universe which is make a comment",
            "start": 8634.28
        },
        {
            "text": "um the best one was Superman: Red Son yeah it's brilliant and I think that's kind of what Telltale wants to do they don't want to tell the same story they're in their own Universe which is make a comment Batman what let's do it awesome thank you guys for coming by our pleasure Troy sticking around right now we're going to switch over do a Game Over Greggy Show with him you can get that if you give us a dollar over on Patreon.com/KindaFunny if you don't want to give it to us no big deal tomorrow Anthony's doing the same thing and then these roll out of course for free later on well they they're window on Patreon and then you know free later on the next week so yeah but thanks for coming by guys our pleasure you did great work thank you I love you I love you very much buddy all right good Telltale like I said good job on this one too I'm excited uh regardless of where you're watching this whether it's Twitch or YouTube please like subscribe share do all that jazz and no until next time it's",
            "start": 8675.6
        },
        {
            "text": "like I said good job on this one too I'm excited uh regardless of where you're watching this whether it's Twitch or YouTube please like subscribe share do all that jazz and no until next time it's been our pleasure to serve you",
            "start": 8712.8
        }
    ]
}