{
    "id": 2891,
    "video_id": "WeMA3pVG774",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Zacq Wenzel"
    ],
    "title": "Greg's Gazette - Kinda Funny Doodles",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502208003,
    "duration": 92,
    "transcript_chunks": [
        {
            "text": "I want to say I did the newspaper in fourth grade fifth grade and then I think they closed it and so I thought that was **** and so I decided I was going to start Greg's Gazette and it was going to be a student newspaper and uh of course there's it's not a real thing there's no moderator or anything so I'm just letting kids write about whatever they want to write about so I'm remember we're this Catholic school where we go to Mass every so kids are writing about man I hate uniforms we should wear these and like why do they make us go to church and it's just all opinion pieces of this stuff right of like this now was a weekly paper it was going to be um so we there was a fist fight in our class you know what I mean of these two guys gotten in a thing we ran an editorial basically that was like from this one kid of like you ran an editorial it was not one of the guys involved with the fight but it was somebody basically being like why does the one guy get a two-day suspension and the",
            "start": 0.32
        },
        {
            "text": "like from this one kid of like you ran an editorial it was not one of the guys involved with the fight but it was somebody basically being like why does the one guy get a two-day suspension and the other kid get nothing I was like I don't know if I agree with your point but I'll run this column or whatever and that's what got me brought to the principal's office and that's when they were like what are you doing you can't you can't PR you can't do this and so they closed Greg's Gazette uh so uh then the you know the end cap to that was uh on the final day of school when we had our final Mass and they were like school's over and like you know y I started selling him outside the school and I was like and like we ran an editorial about the principal who was leaving I'm like **** this lady",
            "start": 43.92
        }
    ]
}