{
    "id": 905,
    "video_id": "mzbEZj0WQfQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Let's Play Not a Hero - Kinda Funny Plays",
    "description": "Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1433444401,
    "duration": 1065,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another let's play here on youtube.com/ kindafunnygames I'm Greg that's Colin and this is not a hero col what the hell is this game not a hero is a a game on PC right now by roll7 who you might know from uh a couple of uh excellent skateboarding games the AL the Alienation games they're on Playstation well they're on Playstation 4 other other consoles as well uh these are our friends from the UK though devolver digital uh published this game and um it's basically a sidescrolling kind of shooter um you're trying to get into a rhythm uh it's very basic but uh in terms of premise but kind of hard to master we play to learn tough to M we played just a little bit uh we're using an Xbox One controller as you can see here to play the game we're also jamming these Tunes but you can use the Xbox 360 controller or custom controller or of course you can just use your mouse and keyboard if you're a huge nerd I'm sure Portell loves that he loves",
            "start": 0.08
        },
        {
            "text": "also jamming these Tunes but you can use the Xbox 360 controller or custom controller or of course you can just use your mouse and keyboard if you're a huge nerd I'm sure Tim Gettys loves that he loves a good Jam so we're we're very early in the game I'm not very good at the game the tutorial is the tutorial of course so now we're just going to go into the game here and play and just kind of take a look at it and this Bunny Lord he tweeted us the other day did he yeah cuz somebody said that we should play the game in a let's play he tweeted into something crazy cuz he's a crazy little bunny I thought that was cute he's a real piece of **** this guy he's a real piece of garbage if you're watching this Bunny Lord **** you damn that's **** up hey I'm just saying he's clearly a bad guy right or is he the good guy too much story I don't care he's not a hero exactly so I'm going to play as Steve Steve has fast reloads he's accurate good range and then eventually you get",
            "start": 42.44
        },
        {
            "text": "a bad guy right or is he the good guy too much story I don't care he's not a hero exactly so I'm going to play as Steve. Steve has fast reloads, he's accurate, good range, and then eventually you get approval ratings that will allow you to unlock St. Eventually I want Jesus, I don't know, you overrated Stanley is where it's at, look at that afro. So day two, I'm dropped off, and we're going to go, and you're right into it, you're shooting, you're stunts, you're running, you're doing stuff. Now of course you skip the story so I have no idea what's happened right, you're just murdering people yeah why not I guess not this looks like a a few different games combined you know what I mean it's got the the murder I'm not very good at that I got I got a SL basically what you have to do is you have to slide in the cover see like when I'm dark here I'm I'm sliding in the cover and then I'm out so I you have to kind of use the on the Xbox one or Xbox 360 controller it's the A button there you go see now",
            "start": 73.2
        },
        {
            "text": "the cover seems like when i'm dark here i'm i'm sliding in the cover and then i'm out so i you have to kind of use the on the xbox uh one or xbox 360 controller it's the a button there you go see now you're getting it now you're getting the hang of a champ yeah no doubt about it all right so remember that one spy game that's what this reminds me of i can't remember the name of it that's driving me crazy look like you're out of ammo i can hear the clicks we don't have the headset on but i hear the clicks there you go you remember the spy game i'm thinking of the spy game we had to like hack cameras and you came in you slink things jump yeah the **** was that game called yeah okay um yeah what was it called was on ps3 is that the game you're thinking of no maybe i don't know maybe there was there too hold on i'm i'm going to google around for a little bit so first impressions first blush what do you think it's fine it's it's it's a fun game i i'm not playing it quite right because i",
            "start": 114.2
        },
        {
            "text": "Was there too hold on I'm I'm going to Google around for a little bit. So, first impressions, first blush: what do you think? It's fine; it's it's it's a fun game. I I'm not playing it quite right because I don't have a you know I've just I really just started playing the game so like I don't have the rhythm. Like I said, it's a game that's easy to understand but very difficult to master, you know? So it's uh you know on the bottom of the screen here you'll see um three different things: kill all the Mobsters obviously, but you know Critical Hits, slide tackles, executions. Is that your mission objective or is that just like addition? I think it's probably just additional stuff that you can do if you want to do. You have like regenerating Health it looks like. Do you feel like you're not a hero? I don't feel like say Not a Hero; no, I mean I'm not a hero. It's being very obvious in what it's trying to tell me so I'm going to jump out this window here. I mean that's a heroic thing that",
            "start": 158.0
        },
        {
            "text": "I don't feel like say Not a Hero, no, I mean I'm not a hero. It's being very obvious in what it's trying to tell me, so I'm going to jump out this window here. I mean, that's a heroic thing that I just did there, jumping out of that window getting into that van. I mean, that's what bad guys do too; terrorists would do that, they blow a bunch of people away, they jump on their and they do their thing. So now I'm going to try to play it a little cleanly because you know I have about 2 minutes of experience with the game, so let's see if we can do it a little better. Uh, we'll continue on Bunny Lord is fun Club, bunny Lord is bad. Colin, I don't think you that's why you're not a hero. I'm sick of hearing from bunny, so I'm going back in here GNA to pick Steve again day two, day three, I'm sorry, day three. So what I need to do come out of the door I **** dare you, I got to finish within 100 seconds call time take 90 seconds call call 87 seconds get him all right well he he used the cover see you're not the only",
            "start": 197.92
        },
        {
            "text": "need to come out of the door I dare you I've got to finish within 100 seconds call time takes 90 seconds call call 87 seconds get him all right well he used the cover see you're not the only one who understands cover apparently I'm the only one that doesn't understand it I think try not to sneeze now what are these what are these what do these guys do to you I don't know oh God I like the use of cover you like it yeah oh nice look at that you don't shoot him you can just CQ see him as Solid Snake would say remember Solid Snake oh I died so what I was trying to do here was I was trying to see if I could cuz you can slide and then kill them by standing over them sure uh but it doesn't seem like it's very practical then how you reload yeah I don't know I don't know how I feel about this game it's interesting it's an interesting idea it's again just very it's very basic but there's a lot of depth to it deceiving amount of depth right right right there you go so you stand",
            "start": 233.76
        },
        {
            "text": "about this game it's interesting it's an interesting idea it's again just very it's very basic but there's a lot of depth to it deceiving amount of depth right right right there you go so you stand in front of these automatons and they just kind of open I like the guys the guys yelling fire at will they're laughing a lot yeah they are they don't give a **** it's just weird that they all their uniform is like they're bandits from a cowboy movie running around shooting their guns being Cowboys being free eating baked beans out of a can over a little fire that's what I always wanted looking up at the I have a drill shot it looks like here is that going to drill through somebody's head I don't know we're going to find out he drills through the wall holy **** Lou yeah you got your kill streak 28 seconds to finish level K not going to I'm not trying to push you just let you know activate that billboard 20 seconds call get to the bunny copter call you didn't kill everybody call you're",
            "start": 297.28
        },
        {
            "text": "28 seconds to finish level K, not going to I'm not trying to push you, just let you know, activate that billboard. 20 seconds call, get to the bunny copter. Call, you didn't kill everybody. Call, you're almost there. Call. 9 seconds call, kill everybody. Call, kill him. Call, looks like you got four guys left to kill. Call, got a NIN box over there. Call, looks like it's now about eight guys to kill. Call, kill everyone. Call, finish it in 100. Didn't finish in 100 seconds. Oh God, I'm out. I'm out of ammo. There's a lot of things to keep an eye on here. Yeah, are you feeling the intensity ratchet up? I, I am. I'm feeling like I feel like I'm not great at the game, so I have a lot of work to do, a lot of practice to be had here. Now let's see, I'm going back up here. Okay, and then I'm done. I'm good. I'm... I didn't kill everyone though. No, this wasn't your... I'm a benevolent oh okay bunny billboard brand prime minister. I, I like this bunny guy. I think he's a bad guy. He well he's definitely a bad guy. There's no doubt about",
            "start": 354.2
        },
        {
            "text": "though no this wasn't your i'm a benevolent oh okay bunny billboard brand prime minister i i like this bunny guy i think he's a bad guy he well he's definitely a bad guy there's no doubt about that a rubies you're at today we shall put oh look at this guy he's a little squirrel creature creature today we shall put an end to bogdan's illegal creature business by blowing okay i've seen enough you're just done you know you don't need to know steve doesn't need to know anything i want to get the cletus so we i think if we do this stage we'll unlock another character cletus this like j some folks will never read a with again some folks will never read a word again some folks will never read a word again i died you're dead dude i was a little too brash you're you're in it to win it as i like to say yeah i don't think i'm i don't think i'm playing the game quite the way it was intended to be played well you're learning this is your third level of the game what do you want what do you want from him america what is this molotovs grenades nades",
            "start": 410.76
        },
        {
            "text": "quite the way it was intended to be played well you're learning this is your third level of the game what do you want what do you want from him America what is this molotovs grenades grenades nades some call them some people do call them nades yeah that's true the guy who invented it Nadeau now do you heal over time yeah okay regenerating Health here in the in the bottom right corner sorry bottom left corner don't know my directions haveit o man you got no fear Steve's just jumping out windows not giving it **** look ature look at this gentleman oh I think I got him grab that's one you you grabbed one creature call need to grab another need four kills and five 4 seconds oh I see it's counting down you're close now you didn't get it use all the special weapons call out of bullets grenades you got that guy that c me I had a little rushing guy hat on little son of a **** what's he doing cares is this a where is you're not ready to go yet that's that's going want get that's going",
            "start": 461.88
        },
        {
            "text": "you got that guy that came with me, I had a little running guy hat on, little son of a gun, what's he doing? Is this a where is you're not ready to go yet, that's that's going want get that's going to be your exit, I want to get out of here, someone's at the door. Noel. You don't have opposable thumbs if you could answer the door I'd let you man but you can't cuz you're just a little dog oh I know it's tough being a dog oh I know buddy now what's over here if I can go out here I like who he just runs through the window Reckless abandon, it's got to do it man. All right this guy's coming up I'm going to do this open fire, open fire is how you said it sound like Gundam style, open Gundam style remember that one that was a hit, Hug was a huge hit. Do you think Billy Joel will ever have a song that big? No I don't think so that song's bigger than any Billy Joel song unfortunately man I remember Billy Joel whatever happened to him he's banging around seen him this Summer who's opening for him no one",
            "start": 516.56
        },
        {
            "text": "big no I don't think so that song's bigger than any Billy Joel song unfortunately man I remember Billy Joel whatever happened to him he's banging around seen him this Summer who's opening for him no one I don't think oh that was a smooth exit you like that I like that just fall right through the roof of the I did nothing right I didn't grab the creatures I didn't I didn't even see the second creature four kills in 5 seconds use all the special weapons now you're the mayor of England though so you got that going or he is I think I'm going down though in stature here a little bit what was that Kevin was that a package who's it for S and one for you godamn one for me yeah on Prime my PyC I order my do you do that because of Larry the Cable Guy uh no I do it because I have really bad acid reflux everyone tweet at Larry the Cable Guy and let him know that the Prime SE got delivered because of him just give it to him just let him have let him let him think he's changing Gods stuff I God my my",
            "start": 563.6
        },
        {
            "text": "everyone tweet at Dana Carvey and let him know that the Pride Lands got delivered because of him just give it to him just let him have let him let him think he's changing God's stuff I God my my approval rating is at eight I still have to do I want to do one more I got to do one more level I'm not doing well enough I'm not doing good enough yeah mhm now I got to kill the investigator don't get punched you you got to do less than 10 hits and then finish it in 40 seconds this shouldn't be that hard according to this no definitely not I got Fat Boy rounds I wonder if that's a nuclear bomb reference yep roll s got the jams man music's good I can't hear it I believe the music's good though I believe it we put on the thing that lets us control the volume so you should do that check out this move ready oh man I got knocked right the **** out oh **** oh damn look at my look at I landed on my head oh **** son holy jeez he dead py holy jeez he dead",
            "start": 607.04
        },
        {
            "text": "do that check out this move ready oh man I got knocked right the **** out oh **** oh damn look at my look at I landed on my head oh **** son holy jeez he dead py holy jeez he dead py holy jeez all right let try holy geez I wanted to lick him so just just stopping next to anything puts you into cover like on the side of anything yeah as long as you have to roll into it though you can't just stop so you can't okay like right there you which is like why I'm getting a little confused gotcha like you have to roll here's here's my question have you thought of only rolling I have do you think they did this cuz they're roll seven probably do you think Indie developers ever get tired of being the cleverest **** in the room no I don't think they get tired of that now be perfectly honest with you Mike Biffle smug face I feel like I'm getting a little bit better you're starting to understand the mechanics a bit more I think my you want to know what I think's happening what's that it's",
            "start": 648.08
        },
        {
            "text": "you Mike Biffle smug face I feel like I'm getting a little bit better you're starting to understand the mechanics a bit more I think my you want to know what I think's happening what's that it's a lot like Spider-Man in Civil War well that's when he stopped but you're you're holding back I think you you just got to embrace how crazy it is you're playing it like I would you'd play a regular game I I think you should only move with the roll that's my advice well I'm doing it and you're **** me well you're out of guns you're out of bullets you see what you just did to me let me stupid son of a **** let me sh I never played this game either go roll around that's good why you rolling around Spider-Man hey how do I reload uh B got it now look out America you have a new Bob Saget you definitely do and he's not here right now now how am I oh **** okay I came I brought it back C why is that guy taking so many bullets grab the suitcase there you go get to the bunny wagon and shut",
            "start": 699.88
        },
        {
            "text": "definitely do and he's not here right now, now how am I oh **** okay I came I brought it back C why is that guy taking so many bullets grab the suitcase there you go get to the bunny wagon and shut up already why you going back up I want to kill people I'm getting the hang of it man I'm lost in the moment it was the heat of the oh **** I'm off that's my heart head why you shoo that way oh **** I felt good I felt like I had something going there for my first time definitely didn't for my first time that's the thing is that you definitely didn't have anything going there **** you I did better than you did I got the briefe I got the briefcase at the very beginning were you nuts you didn't get nothing go back to the video and tell me I didn't get that brief I can't right now I didn't miss mate I maybe that's my guy that's Steve talking oh does Steve have an accent like Steve Irwin that's cute remember Steve Irwin, the crocodile hunter call oh I remember him yeah he's not with us",
            "start": 754.28
        },
        {
            "text": "\"Miss mate, I maybe that's my guy, that's Steve talking. Oh, does Steve have an accent like Steve Irwin? That's cute. Remember Steve Irwin, the Crocodile Hunter? Call... oh, I remember him. Yeah, he's not with us anymore. No, oh doctor, let's go. I'm going to investigate the broken window. You're **** dead, you're a brutal man. Huh, I didn't ask for this world. You didn't, but you're doing this guy. Kind of looks like Joel, doesn't he? Last us, this is like an alternate universe where good things happened, and he instead of being like a shitty carpenter or whatever the hell he was, he went... he was got a little special. I wonder what this gun, this weapon is. N speed load, I need that. I've been told I have a speed load for a long time. See what did there? I've also heard I've also heard a thing or two about you having a ropey load, that's in my next game, that's Ryū's next game, Ryū Load from the makers of Knob Switch come Ryo... oh ****, oh ****, oh ****, you're going to die, you're done. That's what they said about the\"",
            "start": 808.12
        },
        {
            "text": "in my next game that's that's Roll7's next game Ryū from the makers of No Man's Sky come on oh **** oh **** oh **** you're going to die you're done that's what they said about the bad guys in the movie Robotech in a movie Robotech mhm that hasn't been made yet I don't know much about Robotech I'm not going to lie to you all right I did it I felt pretty good about that how do you like it yeah I'd play more of that when it comes to V prime minister hey is that good that's better than mayor of England I think so I did I think so all right good think so good yeah this game I'd play it when it comes to console Cletus blows enemies backwards shoots open doors shoot doors open shoots to interrupt loads slow reloads pretends to be Scottish that's one of his things pretends to be Scot oh should you know that K McDonald don't I Governor is that fake Scottish I think that's just my accent but she gets mad cuz she's Scottish and I I give her the British a right",
            "start": 861.64
        },
        {
            "text": "Scot Mhoi should you know that K McDonald doesn't, I'm Governor, is that fake Scottish? I think that's just my accent, but she gets mad 'cause she's Scottish and I give her the British a right, of course. Rel oh God, do I have like why aren't you? I don't understand what's happening here; it's a shotgun so you take a while to reload, see? Yeah, I don't, is a real son of a... like Cletus, like now what happens if I if I skate in their legs like that all right cool then you can go over them like stab them oh with the same button I think so yeah try it on the next guy yeah you're right you're right right right when you're right you're right Colin he's tougher he's tougher Cletus is an expert class character I'm not feeling it you're not feeling it no I'm not feel turning the lights down someone's got to do something Cletus 'cause I don't I don't like the way he plays Jez up closer scarecrow oh yeah Cletus is not a speed character no no no you got to be oh my God you got",
            "start": 908.36
        },
        {
            "text": "the lights down someone's got to do something Clutch cuz I don't I don't like the way he plays Jez up closer Scarecrow o yeah Clutch is not a speed character no no no you got to be oh my God you got it said shoot I thought it was pretty obvious what I think it was I thought maybe it was going to give me like a smoke cloud you know what I mean no okay oh yeah now Cus is feeling it making sure that guy was dead you know how to do it oh I understand completely you lost your kill streak but I found a best friend you did find a best friend and who is the best friend oh thank you I wasn't sure if I liked you till this this let's play took us about eight years to figure it out oh come on **** come on **** all right all right we're done with this game I don't like Clutch clus I can't I can't I like the game I don't enjoy Clutch putting that out there nice work to our friends at Roll7 it's an interesting game bring this to Vita won't you I know you want BR V please Vita made you Roll7",
            "start": 973.84
        },
        {
            "text": "I like the game I don't enjoy Greg putting that out there nice work to our friends at Roll7. It's an interesting game bring this to Vita won't you, I know you want BR V please Vita made you Roll7, whoever his name is come come to Vita you piece of **** yeah you little you little son of a **** ladies and gentlemen what do you think not a Hero let us know in the comments then make sure you keep coming back to youtube.com/ kindafunnygames each and every day for a new lets play We love you it's been our pleasure to serve you",
            "start": 1037.44
        }
    ]
}