{
    "id": 902,
    "video_id": "Tw8EEIM1e-0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "We Sing the Star Spangled Banner - The GameOverGreggy Show (Live at Momocon 2015)",
    "description": "Live at Momocon 2015! The boys unite for their first ever adventure to Atlanta! (Released 06.03.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1433358001,
    "duration": 3787,
    "transcript_chunks": [
        {
            "text": "what was your name again you're in a musical you're in Rent I am you are did you say he's in a musical he's in what's your name though I forgot Patrick to the mic tell your he's awesome Patrick can we get the crowd mic up for Patrick to tell us about his musical no you are not getting on this stage Patrick yeah I'll just get through hello damn it Nick is it off of the Switch like can you see this is the Switch on Greg yeah I have to go to the bathroom you have to go to the bathroom already I have to pee already guys I'm sorry try now hello here we go go pee Patrick's going to tell us all about it I'm peeing or Nick Nick's peeing Nick's peeing you don't have to pee um so of course it wouldn't be The GameOverGreggy Show if Nick didn't have to pee all of a sudden there's no that way good luck it took me about 10 minutes earlier there's got to be a dark corner back there that you could pee in though Nick so yeah so my name is Patrick Hello friends hi Patrick uh I live",
            "start": 2.82
        },
        {
            "text": "No, that way good luck. It took me about 10 minutes earlier. There's got to be a dark corner back there that you could pee in though Nick. So yeah, so my name is Patrick. Hello friends, hi Patrick. Uh, I live about 10 minutes north. Uh, but yeah this summer uh which I guess is now I'm in a show at Actor's Express if anybody knows where that is. Round of applause if we know Actor's Express. Thank you. Patrick's friend some people like theater support professional local theater. Um, but yeah so the music is called Rent and I'm I'm in it. I'm playing Mark if anybody knows what that means. Rent is awesome. Aome I love rent. Say again I love rent. Oh awesome. Yeah guys back it opens July 10th. Fantastic. I'll lead you and you pick it up right. 52:100 minutes that's not how my voice really sound. I I actually have an okay voice. Give us some we're waiting on Nick to finish peeing get us a copyright strike. Copyright strike uh uh let's see how about what give me give me a song or do you want me to 52 got to warm up my",
            "start": 85.84
        },
        {
            "text": "\"Voice, give us some. We're waiting on Nick to finish peeing. Get us a copyright strike. Copyright strike. Uh, uh, let's see. How about what? Give me, give me a song or do you want me to sing 52? Got to warm up my voice. I understand. Okay. Uh, what's your Twitter before you go so people can tweet at you pictures of this accomplishment? What's your Twitter? My Twitter is @PatrickSchwag. So the name Patrick is spelled with a CK, uh, S-C-H-W-A-G. My last name is Schweigert; it's a shortened form of that. Uh, it's also drugs. Did you know it's yeah, that was my next... shitty weed? That was my next point. Uh, it is my name is not after shitty weed; it's after my last name. Um, so yeah. Uh, I'm I'm singing now. Yep. Uh, and then everybody go see him this summer and rent uh 525,000. See this is awkward isn't it? No, it's good. It's really good. I think it's fantastic. Well, thank you. Um, this is weird. What can I do to make you comfortable? Uncomfortable? Okay. It's weird isn't... isn't uncomfortable for me. It's just weird how do\"",
            "start": 135.76
        },
        {
            "text": "it's really good I think it's fantastic well thank you um this is weird what can I do to make you comfortable uncomfortable okay it's weird isn't isn't uncomfortable for me it's just weird how do you measure measure a year in springtime dream drops rain drops and GameOverGreggy yeah that yeah it's there it must be a year is a weird song it's a weird song how do you measure a year you measure a year in in in days in days 365 not not minutes someone should just come on like 20 seconds in this be like guys stop just stop we handled this a while ago in my opinion it's like the weakest number of the of the show too because I don't know it's the one I remember though the my my my one of my sisters claims the fame that she likes to tell everyone she saw the original Rent Broadway and in like the early 90s and I used to listen to that soundtrack all the time in in your car I mean it's good music that's the music it is good music but it it's like resonates through time and space into my",
            "start": 191.24
        },
        {
            "text": "early 90s and I used to listen to that soundtrack all the time in my car, I mean it's good music, that's the music it is, good music, but it it's like resonates through time and space into my head still so many years later, Jesus, that's the song I remember most, I like that song a lot, it's a good song. Now sing something from Catwoman, sing it from... oh, I don't know, Cats is shitty, Cats is really shitty, it's like like people who don't watch or that like aren't around theater a lot think that it's great, I'm sorry, it's like one of the worst shows ever written. I love you to death but that's like one of the worst show what is it about? Sing something from Spider-Man: Turn Off the Dark if you... what was that? Spider-Man: Turn Off the Dark, see that. I don't know any music okay or just the 90s Spider-Man theme song uh... how does that go? See X-Men, I can do all day there aren't any words though no he said he could do X-Men all day he knows it's X-Men yeah I can do yeah sorry Spiderman",
            "start": 240.76
        },
        {
            "text": "Spider-Man theme song uh **** how does that go see X-Men I can do all day there aren't any words though no he said he could do X-Men all day he knows it's X-Men yeah I can do yeah sorry Spiderman Spiderman radioactive hey Nick how was your pee it was good what the hell's going on impromptu musical all right we're yeah we're talking about my life all right now we're going to settle in for the show okay thank you Fork you so much everybody round of applause for Patrick go see and R we open July 10th actors Express add me on Twitter Patrick schwag not the drug named after shitty weed after shitty weed thank you and I will be back to the mic soon oh Taste of what's to come yeah look up a cat song and sing it when you get here that's the other side starts for you all right we're all ready now we're all set we're all setled I thought you wait I thought you were being like a priest at church no I was trying I'm trying to trying to see if I can like telescope it out you know what I'm",
            "start": 282.28
        },
        {
            "text": "Now we're all set. We're all settled. I thought you wait, I thought you were being like a priest at church. No, I was trying, I'm trying to try and telescope it out. You know what I'm talking? We grew up Catholic, and they like, they do it. You're like Jesus, like God, why is it got my eye great? It always gets the Eucharist in your mouth. You just go like this and look the priest right in his eye. He liked all right. Go to the video feed. We're going to start the show like we normally do. Just go to the black screen for right now. There we go. Bring up the audio here we go. You're supposed to say amen, yeah. Thank you. What's up everybody? Welcome to the GameOverGreggy Show. I'm one of the hosts, Greg Miller, alongside the producer SL Seducer Nick Scarpino. Hi Greg, it's weird that we're not around the table so now it's all it's all messed up. You guys let everyone vote and so they voted me here, yeah. Which is actually great because now Tim can get all of your IR no, Tim's not no me and I'm",
            "start": 344.68
        },
        {
            "text": "the table so now it's all it's all messed up you guys let everyone vote and so they voted me here yeah which is actually great because now Tim can get all of your input no Tim's not no me and I'm excited for it no you don't understand see he you think you're excited for it now but then you slowly get sucked into his anger like he's a black hole M like a singularity over there and you can't escape from its gravity is obsessed talking about space lat you got you finally watched Interstellar and I'm like oh I have someone smart to talk to about this no I mean I had other people smart to talk to about it but I was stoked on him your and then Greg and then Greg watched not helping you Nick no I know this it doesn't matter here's out is Nick Scarpino was once dirt and I brought him up to be a fine dude tree and he's going to yell at me now turn on me that's not that's revisionist history right there TR true story I remember meeting a young Greg Miller he's very loud but all he would",
            "start": 394.76
        },
        {
            "text": "be a fine dude tree and he's going to yell at me now turn on me that's not that's revisionist history right there TR true story I remember meeting a young Greg Miller he's very loud but all he would do is write for a website and and I remember him expressly saying I'll never not write for the PlayStation Channel and review games I love this this is what I want to do for the rest of my life I'm still doing it and then we put you on a video and you found your true calling it's true I assume my final form you're like a dragon Zord or A Shard zard or a dragon Zord or A Shard it starts with a which one's the which one's it starts Needle Zard and then it goes to Mega Nard Needle hardcore needle hard wow over there The Pride along Colin Moriarty hello good to see you all be here in the South with you uh Greg yeah um trying I was thinking about uh the southern accent that we've oh we have a new character to debut everybody yeah the Pardon Our Progress lady yeah Pardon Our Progress oh sugar don't",
            "start": 434.48
        },
        {
            "text": "uh Greg yeah um trying I was thinking about uh the southern accent that we've oh we have a new character to debut everybody yeah the Pardon Our Progress lady yeah pardon our progress oh sugar don't worry about that now them Atlanta Falcons going to have a fine Stadium soon enough them Falcons they migratory birds don't worry about it baby them Falcons will Land We spiffy up a few things by walking by the new stadium the other day and we just we pretended like the old southern lady was was building it and it was fun I think they need a little bit more context than that it's cuz the and over here the pure one Tim Gettys hello so I have an important question does anyone have a bottle opener cuz I don't does anyone have a lighter can you come up here if you didn't know ladies and gentlemen we are if you're listening to MP3 and we sound eoy we are recording live at MomoCon 2015 in Atlanta Georgia give yourself a round of applause remember",
            "start": 482.68
        },
        {
            "text": "We're recording live at MomoCon 2015 in Atlanta, Georgia. Give yourself a round of applause. Remember, audience, you are our best friends; you're a critical part of this show. You need to cheer, you need to boo, you need to clap. Don't raise your hands at some point in the show, Nick's going to tell you that hands down. That don't fall for Nick – you're all falling for Nick. Great, you're all falling for Nick. Sean Pitts is falling for Nick hard. It's easy to fall for him. You have a Coke; he's a beautiful man. I do have a Coke; it's a little bottle, it's a very little bottle. That's quaint. It's from the World of Coca-Cola. You're pretty stoked when you found out our hotel is right by the World of C – yeah. So, you know my entire life I've been a big fan of Coca-Cola, and um, it is one of the most divine substances known to men, and I heard that in this beautiful state there was the World of Coke, and when I",
            "start": 523.68
        },
        {
            "text": "so you know my entire life I've been a big fan of Coca-Cola and um it is one of the most divine substances known to men and I heard that in this beautiful state there was the World of Coke and when I heard we were coming here I was like guys we got to go I'm going to look into it I Google mapped it from our hotel and I'm like it's 2 minutes away and I started freaking yeah the hell out so I was really excited about it we had this whole plan and me and Nick yesterday was he yesterday was yesterday everything's blend we're finally going to go we're going to do this did it live up to expectations well you should you should take a step back real quick cuz we we went with the venerable Sean Pitts and Carson over there and both those guys were so fun Carson can't uh one cl for Carson one uh uh Carson I asked him very nicely to map us to the World of Coke and it took us 45 minutes to walk there and 3 minutes to walk back yeah okay to be fair though he mapped it when we had already left",
            "start": 564.68
        },
        {
            "text": "Carson, I asked him very nicely to map us to the World of Coca-Cola and it took us 45 minutes to walk there and 3 minutes to walk back. Yeah, okay, to be fair though he mapped it when we had already led him astray that's true around the thing that looked like a park that was not a park on we were just heading toward the Chick-fil-A which there is one on every corner it's like Starbucks in this amazing was is wasn't an issue at all also Chick-fil-A being closed today that's their thing when the airports open I don't like their thing they need to change their thing anyways World of Coca-Cola I was really excited for it it was cool it was an experience it was like Disneyland but for The Coca-Cola Company which obviously I was really into everyone told me there's this Tasting Room at the end and I'm like this sounds like the best thing I've ever wanted to do yeah then I get in there and I'm like wait a minute I'm not drinking different flavors of Coke, different flavors of Fanta, and all this stuff that no one",
            "start": 608.56
        },
        {
            "text": "like the best thing I've ever wanted to do yeah then I get in there and I'm like wait a minute I'm not drinking different flavors of Coke different flavors of Fanta and all this **** that no one wants it's like Coke this isn't the World of Coca-Cola products Coke I ingested something from Peru that I'm not sure has gone out of my system yet what was his name Inca Kola it's actually one of Kevin's Favorite Things Greg I think I'm rubbing off on you a little bit too much do you like that one yeah I like that one all right but that was an NARUTO special right there Colin you didn't go to World of Coke what did you do I played The Witcher all day in the hotel room yesterday now here's now here's the thing I traveled with my PS4 and then we got here Wednesday night I hooked it up Thursday morning and then I realized these **** TVs in the hotel have the the Logitech remote controls that make it like totally ridiculous and you can't plug in your HDMI cables and stuff so then I went online",
            "start": 646.16
        },
        {
            "text": "and then I realized these **** TVs in the hotel have the the Logitech remote controls that make it like totally ridiculous and you can't plug in your HDMI cables and stuff so then I went online and there's all these like conspiracy theories of what's going on all these **** up things you can do to get it to work and then you just figured it out like it's just buried deep in the like I sat down with the real remote the remote control that came with the TV, the Logitech TV remote, and hit the function button and found it but you had to like hit the function button four times and then hit the okay button and then go over to this thing or whatever like it wasn't it wasn't clear there's no it was it's very unclear we called the front desk they didn't know how to do it but I just sat there they said it was impossible at one point and I was like the **** it is hung up and I'm playing The Witcher goddamn it and I played The Witcher for two hours and now it's like it was one of our you",
            "start": 689.32
        },
        {
            "text": "they said it was impossible at one point and I was like \"the **** it is hung up\" and I'm playing The Witcher goddamn it and I played The Witcher for two hours and now it's like it was one of our \"you played it a lot, you made a use of it\" but I've been lugging my goddamn PlayStation 4 around like an idiot I played for two hours it makes me it's like it's like having cable TV I never really watch it I just like to know it's there sure you know what I mean like we would have felt like idiots if like yesterday we had all this time like we could have been playing the Witch yeah in San Francisco we pay like $200 for our cable and I never even watch it but I'm like it's there and it makes me feel good yeah and uh cuz at least I know that I can you know watch HD TV if I want to or something like that but I don't know I don't know what the hell we're talking about to be perfectly honest with you it's good to see you though it's good to see you I love you very much I love you too ladies and",
            "start": 722.36
        },
        {
            "text": "that but I don't know I don't know what the hell we're talking about to be perfectly honest with you it's good to see you though it's good to see you I love you very much I love you to ladies and gentlemen if you didn't know this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bringing a random topic of discussion you guys can't get it either it's cuz he changes the timing every time on it what do you mean this table it's very simple that's the timing Tim's over here doing dad I don't know what he's doing I nailed it though I've never missed it except for that one time when you were completely off when you're on Rhythm I'm on point I can't dance I can't play basketball but I can hit tables when you give me the rhythm I'm looking for a high five this is a compliment I thought you were going to hit me no uh we bring random topics to conversation talk it out for your amusement da da da D youtube.com/ kind of funny or patreon.com",
            "start": 756.0
        },
        {
            "text": "a high five this is a compliment I thought you were going to hit me no uh we bring random topics to conversation talk it out for your amusement da da da D youtube.com/ kind of funny or patreon.com kind of funny here's what we're going to start with talking about cuz obviously the best friends are in the room they'll come to the microphone we'll talk to you and that's how the live shows usually work but I want to talk about the fact that I think if we were ever to be sold in two packs if we make action figures the two pack would be obviously Colin and Greg Nick and Tim but what I liked about this trip is that we shattered that and so we had to get two rooms so it was Greg and Tim who have roomed together on multiple thousands of trips and then Colin and Nick yes the thing about it is I'm old Colin is old Nick is really old um but Nick on these trips he throws cautions when he acts like a young man so like I would come home and go to bed Tim would stay out till 4:30 in the morning go",
            "start": 793.04
        },
        {
            "text": "old Colin is old Nick is really old um but Nick on these trips he throws cautions when he acts like a young man so like I would come home and go to bed Tim would stay out till 4:30 in the morning go doing God only knows what getting nasty your girlfriend watches the show doesn't she I was on the phone with her getting nasty but Colin and Nick would go into their room their cocoon their hibernation chamber and then they would just talk like they were having a sleepover till 4:30 in the morning that is like my favorite part about this trip I think is that you Tim would just hear them giggling through the wall bunch of school girls yeah Nick and I have only roomed one other time in an Anaheim last year when we really figured out that we probably wanted to do this actually and uh this being this company this monstrosity that we've built and uh yeah we we I I feel I was thinking about it I feel like we actually stayed up probably a combined literally seven or eight hours over the over",
            "start": 831.16
        },
        {
            "text": "this company this monstrosity that we've built and uh yeah we we I I feel I was thinking about it I feel like we actually stayed up probably a combined literally seven or eight hours over the over this trip and just talked and I I learned I've known I've actually the funny thing is I've known Nick Scarpino longer than like any permutation of the four of us has actually gone the longest yet I there's all these things that I don't know about Nick that I know now mhm are they dirty are they disturbing oh yeah we had some interesting conversations but yeah but it was nice and I I didn't realize like we were just we were so deliriously tired I think that we were just making each other laugh and then we went to bed at like 4 in the morning last night you know it was I don't know it was just fun that's awesome he came in a couple nights ago and I just I laid in his bed on as a joke so that he thought I was in his bed waiting for him yeah and then",
            "start": 876.0
        },
        {
            "text": "you know it was I don't know it was just fun that's awesome he came in a couple nights ago and I just I laid in his bed on as a joke so that he thought I was in his bed waiting for him yeah and then he he didn't the crazy thing was he didn't get out so we got real close that night real close real close we were talking about all sorts of stuff though you know about the business about you know ex-girlfriends about family about well all sorts of interesting things mostly ex-girlfriends yeah there was some Facebook stalking isn't that the best there's a lot of Facebook stocking Man actually I love ex-girlfriends have you ever slipped up when you're when you're doing the Facebook stocking and you like a photo or something you you screwed up with now a trace that you were there you know when I when I do that I I go in I just like everything by default so there's no slipping up I know exactly what I'm doing I want them to know that I was there okay I like that one of our one of our",
            "start": 918.12
        },
        {
            "text": "when I do that, I go in; I just like everything by default, so there's no slipping up. I know exactly what I'm doing. I want them to know that I was there, okay. I like that someone - one of our fans from the San Francisco area - I don't know if she wants to be named, whatever. She tweeted at you and I - I don't know if you saw it where you were on her Instagram, and you just liked a bunch of her photos, and she just took a picture and said like, \"You know, you're a creeper or something.\" Like that. I was like, \"Yeah, I know. I've never liked anything on Facebook ever.\" No, I know. I read comments a bunch of comments, but you know, I feel like it's just drive-by liking is what I call it, and I just feel like there's nothing wrong with the drive-by liking. I want to - I want to let them know that I'm really thinking about yeah, that's the thing for you; you are not a person that likes to just do things haphazardly. Like you don't just randomly kind of uh throw something out there and then leave. You like to",
            "start": 961.8
        },
        {
            "text": "thinking about yeah that's the thing for you you are not a person that likes to just do things haphazardly like you don't just randomly kind of uh throw something out there and then leave you like to just dig in you're like a tick like a beautiful Italian tick and you like to get under people's skin and figure out what makes them tick yeah definitely just like the tick does it's a lot of ticking is that what the tick does it under people's skin thinks about what they they want to know complex animal remember that time Rob Paulsen was like yeah I was in the Animaniacs I was Arthur and I was like what I'm out about that that was a fun episode you guys should watch so after this episode go home and watch the GameOverGreggy show um everybody you can start lining up here to grab the mic and talk to us and say some different um while we do that I want to show of hands who likes the movie The Boondock Saints All right you in the Pokémon man shirt who is in who is in The Boondock Saints uh",
            "start": 999.2
        },
        {
            "text": "talk to us and say some different um while we do that I want to show of hands who likes the movie The Boondock Saints All right you in the Pokémon man shirt who is in who is in The Boondock Saints uh Norman Reus Norman Reus was in The Boondock Saints he's underneath this table the entire time something very important this is an autograph Boondock Saints poster now thank you thank you it is not autographed by Norman Reedus instead it is autographed by a quartet of girls who were dressed as Sailor Moon the Sailor Scouts is what they are and who offered to give us this poster cuz they were just going to leave it at Chick-fil-A so Colin and I procured this for you made them sign it you will see as you get to it I don't they said somebody randomly walked by and dropped posters on them yeah that was my question that was my major question I think they were confused because they were they were really young I'm like this movie came out 12 years ago this is actually the sequel though this poster",
            "start": 1037.72
        },
        {
            "text": "We Sing the Star Spangled Banner - The GameOverGreggy Show (Live at Momocon 2015) \n\nwas my question that was my major question I think they were confused because they were they were really young I'm like this movie came out 12 years ago this is actually the sequel though this poster but oh is it well it says Boondock Saints II in the copyright but this picture actually looks like from the original one I'm a fan of the original one yeah just the text says the Bo yeah but on the bottom it has like the 2009 well I mean that's the thing anyway I was asking I was asking him like why is someone giving you a Boondock Saints poster like this movie is irrelevant now you know like no one even cares I I personally love it but are they is that why it's there and you'll see that this is like the wor like the it's like a photocopy of a photocopy what you're going to see is that someone took this off Google images and blew it up to a poster size and it was not meant for this it's very it's deteriorating down here it also was not meant to be signed by the Scouts and to be clear the the Sailor Moon",
            "start": 1091.96
        },
        {
            "text": "off Google images and blew it up to a poster size and it was not meant for this it's very it's deteriorating down here it also was not meant to be signed by the Scouts and to be clear the the Sailor Scouts did not sign their real names it is Sailor Venus yes they did Sailor Chibi Moon Sailor Jupiter Sailor Mercury Sailor Moon Greg this morning when you were helping me carry gear all the way from where we the convention hall to here and you were sweating and complaining about how heavy everything was and that poster was like teetering on top of the camera case the entire time causing you just untold amounts of anger and pain yeah you did not tell me it was for this this was the payoff and you've been carrying that around with you for like 3 days yeah I just for this moment it got the laugh I wanted too so it worked out come get this poster sir big hand for Glenn everyone Glenn thank you thank you I'm glad you're honored all right now here comes here comes some goddamn cats",
            "start": 1129.96
        },
        {
            "text": "the laugh I wanted too so it worked out come get this poster sir big hand for Glenn everyone Glenn thank you thank you I'm glad you're honored all right now here comes here comes some goddamn cats musicals what up Patrick Jelani songs for Jelani cats see it's like it's shitty music right wait can you sing anything from A Chorus Line from A Chorus Line uh God I hope I get it not really reallyl stop put him on the spot jeez hey I I'm an actor I can be put on the spot I was going to I don't know what that look was it was like you thought you had a pun right I'm an actor I can be put **** on the spot too much of that swag there you go uh okay so I I ran This by Tim I have his Blessing okay good um so here's the situation there's a Gladiator Arena now in this Gladiator Arena uh the rules are simple two animals enter one animal leaves now you guys choose which animal you are oh other rule you can't be a bird and fly away okay you can't be an ant and hide like any of that kind of **** can\n\nCorrected names:\n- \"Glenn\" (no change, likely referring to Glenn Rane, but not explicitly stated)\n- \"Patrick Jelani\" (corrected from \"Jelal\")\n- \"Tim\" (corrected from \"This\")",
            "start": 1177.64
        },
        {
            "text": "Two animals enter, one animal leaves. Now you guys choose which animal you are. Oh, other rule: you can't be a bird and fly away. Okay, you can't be an ant and hide like any of that kind of stuff. Can the animal have been real but no longer on this planet? Uh, I will allow it. Um, that's fantastic. So wait, wait. So you're putting dinosaurs in this. Dinosaurs... uh, well see that does that make it unfair though? Yeah, cuz going to be a beast they they have to be alive now. **** so what animal would you be and why? Black bear. Why? They stand up and they're real tall and they **** they're bears all right. Right like that's that's a good enough reason. I should have said Grizzly, be damn it. So I've known this question for a couple days and I've just been thinking about a bunch of different dinosaurs okay um so now I'm let's see give me your best dinosaur and then while they go through that you go with the T-Rex he's the king of the jungle not anymore have you seen Jurassic World they made something bigger oh",
            "start": 1233.92
        },
        {
            "text": "I'm let's see give me your best dinosaur and then while they go through that you go with the T-Rex he's the king of the jungle not anymore have you seen Jurassic World they made something bigger oh is it it's got actual arms it's it's Chris Pratt like Chris Pratt it's just Chris Pratt can I go with Chris Pratt Final Answer hum are animal humans are animals in bed aren't we see that's how you do it I'm going to go with my favorite animal in the plan of the honey badger because the honey badger will **** anything up it will not win but it **** anything up I accept that final answer but what is I have a question yes you say two animals enter and one animal leaves this this Roman type Coliseum that correct so what are the what who's matching up against who because you don't know yet it's around it's just it's a random Dr not that's not Roman that is from Beyond Thunderdome oh I'm sorry well that's the Thunderdome you you pick whatever animal you think could beat every other animal",
            "start": 1281.96
        },
        {
            "text": "around it's just it's a random Dr not that's not Roman, that is from Beyond Thunderdome. Oh, I'm sorry, well that's The Thunderdome. You you pick whatever animal you think could beat every other animal that you could go up against the animal yeah I mean cuz I'm I'm wondering about the Battle of Nations in other words I'm wondering like could you just evade the other animal until the other animal is exhausted that that's an option and dies you're going to choose ants aren't you yeah like something like an ant or a mosquito or a moth you know something that's like hard to see you can't even find it they probably they're stupid they have no idea what's going on but will would exhaustion cause death CU you don't leave until the other one dies uh good point yeah I mean like with the black like with the black bear it would just starve eventually but the mosquito dies now three days yeah that's true I was going to say yeah the bug the bugs don't have a long life, and are insects counted as",
            "start": 1335.36
        },
        {
            "text": "the black bear it would just starve eventually but the mosquito dies now three days yeah that's true I was going to say yeah the bug the bugs don't have a long life St seen and are insects counted as animals we count that they are animals I mean okay so you know if video games have taught me anything is that the right answer is armadillo because then they can defend by rolling up they can also attack by spinning my honey badger no that that part is not real my honey badger is going right through your armadillo it is going to go right through I don't know man have you seen an armadillo I've seen armadillos in real life on the side of the road dead you must have seen a honey badger then yeah I've seen him group of animals it would it's easy I mean it's not even that hard you can just pick like a a huge you know Bengal tiger or something it would knock all those animals out so um the bear would be tough but the bear is slow the bear is cumbersome the bear is going to get tired you know",
            "start": 1374.04
        },
        {
            "text": "like a huge, you know, Bengal tiger or something it would knock all those animals out so um the bear would be tough but the bear is slow, the bear is cumbersome, the bear is going to get tired, you know um or you could be like an elephant just stop them all yeah like a King Silverback gorilla fast strong that's my answer nearly smart enough to take us on yeah and he has thumbs and he has thumbs if my girlfriend taught me anything a thumb's important there you go nailed it nailed **** yeah Patrick all right sing me off shout out to thumbs sing you off yeah or sing yourself off rather is what I think he me oh say can you see by the dawn's early light so proud to do by the twilight last only The Ghostbusters are going to stand in Alabama have some pride and The Rock, it's red glare the bombs bursting in air gave proof through the night that a flag was still there oh say does that star spangled banner wave for the land of the free and the home of the brave USA USA USA USA if you're out there and not in here you're a",
            "start": 1416.32
        },
        {
            "text": "in air gave proof through the night that a flag was still there oh say does that star spangled banner wave o'er the land of the free and the home of the brave USA USA USA USA if you're out there and not in here you're a communist I'm looking at you lady in the doorway maybe a man with long hair I can't tell I apologize yes thanks Patrick thank you gentlemen thank thank you thank you that was really ridiculous I love that it took Colin all the way to like the third phrase to be like oh we're doing this okay and then he stood up the most patriotic of all of us Colin we'll see about that well because I'm not going to stand up and we're just going to do it a little bit you got to do the whole thing yeah once you start you can't stop it's like a Pringles can yeah you skipped like the whole middle of it but other than that it was a good it's fine it's very long I like how our I was about I like how our our you know anthem is a it's from the War of 1812 and I like how it's it's it's all like our even our anthem is about",
            "start": 1471.08
        },
        {
            "text": "it was a good it's fine it's very long I like how our I was about I like how our our you know Anthem is a it's from the War of 1812 and I like how it's it's it's all like our even our Anthem is about war yeah like well didn't he this the story he he wrote it as he was watching like on a she was standing on a ship watching all the battle Yeah Fort McHenry yeah um but the funny thing is that that was an existing British song that he just replaced the lyrics to yeah we steal everything in America you sir step up to the mic what's your name introduce yourself to your best friends why is your pocket colorful Knoxville Tennessee hi Josh Davis from Knoxville Tennessee beyond beyond okay I'm going to be a little more serious okay uhoh this is this is more for uh Tim and Nick obviously serious question must be for us to Serious yeah okay so I know you're all's new show starts tomorrow right mhm 9:00 a.m. love and Pacific stuff right love and sex stuff I have I have a I have I need some advice",
            "start": 1553.68
        },
        {
            "text": "must be for us to Serious yeah okay so I know you're all's new show starts tomorrow right mhm 9:00 a.m. love and Pacific stuff right love and sex stuff I have I have a I have I need some advice okay uh oh get that mic nice and close to your mouth yeah make love to it now you're doing it that's good advice Greg always get close I can't talk if it's in my mouth mhm okay you can make syllables like help so yeah uh about a month ago I found out my girlfriend who I lived with for about a year and a half had cheated on me and was she was just being you know she's not being nice okay right so I kicked her out of my house okay actually I packed all her stuff and sent her a Snapchat of all of her stuff and it said come get your stuff and I never talked to her again damn Snapchat breakup so what I need to know is what do I do now oh dude you all Tinder are I've been on Tinder okay well talk to right now bring it over here and Tim will start your profile yeah you should definitely do that um Tinder",
            "start": 1600.04
        },
        {
            "text": "need to know is what do I do now oh dude you all Tinder are I've Tinder okay well talk to right now bring it over here and Tim will start your profile yeah you should definitely do that um Tinder is a fun way to to get over things and under other things but what's important is the same thing that we'll say in every episode of love and sex stuff confidence just be confident don't worry about what happened in the past because whatever happened wasn't meant to be you got to go out there you got to put yourself out there keep trying you're going to find something you're going to find something real damn good that you're just going to want to spend your time with and just freaking get right up in there you know yeah just about the honest truth just like an armadillo yes I'll I'll I'll second Tim's emotion as well as add my own enjoy the freedom of it because one day you're going to meet someone that you fall desperately in love with and you're going to marry that person you're going to",
            "start": 1649.76
        },
        {
            "text": "Tim's emotion as well as add my own enjoy the freedom of it because one day you're going to meet someone that you fall desperately in love with and you're going to marry that person, you're going to put a big fat ring on her finger, and you're going to whisk away to a honeymoon and then every day after that you're going to have something to do, someone or something. No, something okay it's either going to be Trader Joe's uh Bed Bath and Beyond has a lot to do with it um sometimes Costco sometimes you just have to go to the mall you don't know what for but you know you're going to spend 8 hours going up escalators okay so right now how old are you, 24, 24 great Year enjoy your 20s date get out there experience the world. But every Saturday you wake up at noon and don't have anything to do think of me and cherish that moment absolutely thank you I'll think of you thank you thank you thank you hello what's your name how many people know this gentleman right here yes than yes this is Mr",
            "start": 1688.88
        },
        {
            "text": "think of me and cherish that moment absolutely thank you I'll think of you thank you thank you thank you hello what's your name how many people know this gentleman right here yes than yes this is Mr Shawn Pitts what's up Sean twisty is it twist twisties Twisters Twisters on on Sean twisties Sean twist twist they call him the twisty tie cuz he does Jiu-Jitsu and also likes to keep his bread fresh I don't even know what to say to that that's fine what's going on man so did you get in trouble with your girlfriend after Kinda Funny Live because I kept making references to you being bad no so she didn't know that that was part of no yeah so uh episode too so on no big deal just remember the whole Wayne Gretzky girl thing and then we had to have that whole cover story yeah yeah here's what happened yesterday at the World of Coke Sean was kind enough Sean was kind enough to escort us there and we're waiting in line for the polar bear and I'm about to give up because I'm like I'm I'm a",
            "start": 1733.96
        },
        {
            "text": "yesterday at The World of Coke Sean was kind enough Sean was kind enough to escort us there and we're waiting in line for the polar bear and I'm about to give up because I'm like I don't I'm I'm a grown ass man and I'm waiting in line for probably the most terrifying polar bear I've ever seen in my entire life it was like blinking but I think it was Morse coat yeah had red eyes it was blinking Morse code like I'm going to **** eat your soul and I was like and then I'm like I'm going to leave and these two very good-looking southern girls I think they call them Southern Belles out here um blonde very tan got into the line behind me I'm like I could stay a couple more minutes and I'm like Sean Carson you guys should go talk to those girls and Carson's like hell yeah I'm going to go talk to those go right now and Sean goes no I have someone waiting for me at home who respects me and I have to respect her that is exactly how that happened and then I proceeded to say the worst **** to",
            "start": 1788.56
        },
        {
            "text": "those go right now and Sean goes no I have someone waiting for me at home who respects me and I have to respect her that is exactly how that happened and then I proceeded to say the worst **** to him imaginable just to see if he' crumble and he did not so he is a man among men that Happ man men um all right I got a a question I've been talking to Nick about so yeah I want you guys to describe your sex lives using movie titles clear and present danger going to be Tom Clancy titles Fast and Furious I knew you were going to say that Tokyo Drift I thought it was going to be Big Trouble in Little China for you holy **** that's good wow no I was going to say Predator Idle Hands that's I was to say Idle Hands Idle Hands would it be the combination of Predator Idle Hands or for some reason The Hunt for Red October that was disgusting yeah that's just once a month though oh come on come on we're all young people filling in that blank we didn't need you to spell it out I'm talking about",
            "start": 1827.6
        },
        {
            "text": "the hunt for October that was disgusting yeah that's just once a month though oh come on come on we're all young people filling in that blank we didn't need you to spell it out I'm talking about Peri Blood great Jesus so disgusting okay bye Colin Little Big League mine's always going to be a Lethal Weapon yeah wow because they had to register me as a Lethal Weapon no because by the fourth one I'm saying I'm too old for this **** wow it's not what you were talking to me about yesterday just put it out that way I don't know what he's talking about you were like this no I'm not going to say you know what I'm not going to get you in trouble you were a good guy yesterday I'm not going to say **** thanks guys hope SI seeing me around we love you cson cson it's fine what's up nothing that's beautiful what's your question all right what is your favorite adapted movie so like it was it was something before and then it got turned into a movie every movie that comes out now like every",
            "start": 1882.32
        },
        {
            "text": "beautiful what's your question all right what is your favorite adapted movie so like it was it was something before and then it got turned into a movie every movie that comes out now like every every movie that comes out now based on a book to some degree so I can't think of a favorite but I think the best that's come out in in the last year is probably Gone Girl that was that was a book to begin with that everyone read and thought was amazing and I was like I don't know about this movie then I watched I was like holy **** I'm never trusting a woman ever again not that I ever trusted women to begin with cuz they steal your soul and your life and they take all your youth from you but in you know enjoy being married everyone Scott Pilgrim vs the World yeah it's a good one I like it a lot this one's so obvious it's it's Willy Wonka I think is is yeah that's good and it's one of the it's one of the rare examples where the the the movie is way better than the",
            "start": 1933.4
        },
        {
            "text": "a good one I like it a lot this one's so obvious it's it's Willy Wonka I think is is yeah that's good and it's one of the it's one of the rare examples where the the the movie is way better than the book I think too so was that Roald Dahl Roald Dahl yeah yeah all his books are so messed up they're all about how he hates kids and how kids suck like I think it's like an interesting like how kids are terrible that's like basically what his books are all about you didn't get that from the movie where all the kids like almost die a horrible death and like get tortured and then the one kid that like survives gets like the Golden Ticket I got that yeah I got it his name was Charlie Bucket like he was messed up that was a messed up movie when you go back and think every actually every movie from my childhood was pretty messed up like every kid movie I watched there was Willy Wonka and then there was RoboCop like like there were there were like not so much",
            "start": 1978.0
        },
        {
            "text": "every movie from my childhood was pretty messed up like every kid movie I watched there was Charlie and the Chocolate Factory and then there was Rango, like, not so much maybe there were I mean it's unclear what happened to Veruca oh she died it's unclear what like if they were able to save Violet the one that like blew up to the size of a gigantic like bouncy ball I always wanted that little whistle so bad like Willy Wonka comes out he's like yes master and you're like don't look at me in the eye I'll **** crush the life out of you, roll doll or messed up, Jee Wilder was awesome you have a Gene Wilder shirt on so yeah we were talking about Mel Brooks movies on the way over here I feel like Superman's a cop out to say so I won't but I would in Saints Row: The Third my favorite is stand by me no you want me to go stand by me that's a great one thank you thanks thank you bye what up what's up guys hey hello name is Kyle I have a word service question how do",
            "start": 2018.32
        },
        {
            "text": "my favorite US stands by you, no, you want me to go stand by you, that's a great one, thank you, thanks, thank you, bye, what up, what's up guys, hey, hello, my name is Kyle, I have a question about services - how do you guys pay your taxes? Do you guys get W-2s from Patreon? I know it's weird, we, we... I'm not asking a weird question at all. I asked a stripper once at a strip club, \"like, do you get how do you get W-2s from the strip club?\" This is what you asked while she's giving you a lap dance - no, she was trying to give me a lap dance but I was like, no, cuz you know I just want to talk about taxes. Like, I got to diffuse this situation right now because something's coming up so I'm going to talk about taxes, the least sexy thing on the planet that's what that was - that's what went through your brain all right, uh, we are set up as a business so we pay ourselves and then we just get yeah we get a W-2 at the end of the year okay that's all you ask, we I know it's weird question no great question that's",
            "start": 2065.24
        },
        {
            "text": "We are set up as a business, so we pay ourselves, and then we just get a W2 at the end of the year. Okay, that's all you ask. We know it's a weird question; no, great question. That's one of the fun things or actually challenging things about the business was like we didn't know any of this stuff, and so we're all still learning all of it as we go. Uh, cuz you know when you work at a company, you just they the HR person just gives you the forms, you sign all the forms; you're not even sure what you're signing, and then you get paid that's it. So it's pretty fun; it's crazy. Yeah, sorry I like money; I'm Asian; I like money too. Thank you, thank you. Bye, thank you. Here's what I want to point out, Nick: that I'm really thirsty, yeah, and like to pour a cup of water but I think back to at PAX when you went into these with your bare hands and then put ice into your own drink and then left them for the next group; so I really don't want to do that in case that's something.",
            "start": 2117.8
        },
        {
            "text": "back to at P East when you went into these with your bare hands and then put ice into your own drink and then left them for the next group so I really don't want to do that in case that's something similar I'm going to go on a limb and say that no one's done that go ahead go ahead and pour me a glass to Dean here still Dean's my only friend no I I can only trust it if it comes from the M of Dean hi sir sir step to the mic what do you mean hello oh hey Dean hold on one second Dean during any of these panels has anybody reached their meaty paw in here and jimble around all right good thank you love you Dean Round of Applause for Dean everybody thanks de made all the twitch streams work this week great guy they call him Mean Dean hello he's very nice what's going on what up man hash let Tim host hey I don't know if you guys noticed this or not but Tim's been hosting a lot lately the hashtag will never die cuz I want to host more Nick God you just want you just you know you're",
            "start": 2158.76
        },
        {
            "text": "let Tim host hey I don't know if you guys noticed this or not but Tim's been hosting a lot lately the hashtag will never die cuz I want to host more Nick God you just want you just you know you're just greedy yeah that's the problem I have let him be greedy come on that's fair enough what is your question sir what's your name you didn't you didn't give my name is Jeff everybody say hi to Jeff hi Jeff hey random carow my question is is am I the only person in the world that wants a remake or a sequel to Drill Dozer and The Legend of Dr. Loco? and the legend of Dron drill the back now Legend of Draon would be yeah I'd be interesting to see a legend of draon like what they would do with it I feel like I I wasn't that big of a fan of that game um and I feel like they could improve on it a bit I don't think they would I think if they if it came out it wouldn't be good but I would hope Dr. Loco is underrated just under the flood of good PS1 games but it's a really good game yeah I mean there's there's so many good RPGs on the PS1",
            "start": 2202.24
        },
        {
            "text": "if they if it came out it wouldn't be good but I would hope Dr. under-rated just under the flood of good PS1 games, but it's a really good game yeah I mean there's there's so many good RPGs on the PS1 so that one does kind of fall into the radar yeah that was a first-party one too I remember I like the character designs and stuff Shu Oda worked on that game I think actually Shu I think he I think he produced that game, YP is Twitter is his Twitter handle I'll look it up yeah I would be surprised if they revived it I mean they in PlayStation All Stars there was the next character they were going to add before they canceled it was Dart from Legend of Drakan I mean that was the art that leaked so that was definitely within their you know they were thinking about it thinking about the game whether or not they were going to go back to it because then there was that medieval leak um and they had Siren in that too so",
            "start": 2251.68
        },
        {
            "text": "their you know they were thinking about it thinking about the game whether or not they were going to go back to it because then there was that medieval leak um and they had s Daniel in that too so I don't know it would be nice a first party like exclusive jrpg would be interesting I know a few years ago they said they **were** going to make a sequel and it got cancelled and a lot of people got mad that way after the fact that they even said they **were** going to have one and they just canceled it because a lot of people do want it I was wondering if y'all ever played it or wanted to play it or would be interested yeah I think people I mean it's a good game I feel like people remember it a little too fondly because there was such a glut of great role playing games on on PS1 I mean I think that was the best console for jrpgs like **Final Fantasy** so um I think people like it because it's exclusive and and uh yep Shu Yoshida produced it it's interesting um so yeah I I I I suspect Joel D'oherty is probably dead",
            "start": 2296.8
        },
        {
            "text": "the best console for jrpgs like Final Fantasy Versus XIII so um I think people like it because it's exclusive and and uh yep Shinji Hashimoto produced it it's interesting um so yeah I I I I suspect Joel Schumacher is probably dead but I suspect we'll see Jon at some point yeah thank thank you thank you be well Nick could you do me a favor stop chewing ice into the thing no that I don't care about that also this water does taste a little like hands it yeah it doesn't it's it's that Georgia tap water I guess I don't know do you have good tap water in Georgia or bad tap water yeah well we were in San Francisco we turn it on just dirt comes out doesn't there's there's nothing there it's a puff of smoke Nick what I'm going to ask you to do is move your little microphone or just stand up and and uh do the old Peck dance for everybody you you no I will not be doing it come on you want to see me PEX there they go boom boom boom boom boom yeah my dad can do that that's pretty awesome there you go can you do twirl tickle",
            "start": 2333.08
        },
        {
            "text": "for everybody, you know, I will not be doing it. come on, you want to see me mix PEX there they go boom boom boom boom boom yeah my dad can do that, that's pretty awesome. there you go. can you do the little star with the chess? I can try. oh boy, that's another video I'm guessing later. you know I'll make that just for you. I feel you, I feel you. I will watch that. all right uh salutations everybody what's up my name is EMT uh see you guys around thank you time Spin and everything uh so here's a question I wanted to ask real quick um this is my first con like I said at the twitch stream this is my first con I've been making a lot of friends here uh by the way shout out to Alex and Andy they're two best friends who couldn't make it here tonight so they let them be well we're thinking about we're thinking about you so too bad they couldn't be here um yeah I'm making a lot of friends those are two guys that I just met at this Con and so I'm realizing that when I make new",
            "start": 2380.56
        },
        {
            "text": "thinking about we're thinking about you so too bad they couldn't be here um yeah I'm making a lot of friends those are two guys that I just met at this Con and so I'm realizing that when I make new friends I have this Quirk that I just do what I don't know if it's bad or good but like growing up in the South as a black guy you got to have a sense of humor about race and I make a lot of black jokes yeah I mean I think they're funny yeah just making sure it was another black guy that was cheering that on it's really awkward someone like me like yeah and I mean I make them all the time but it's like if people laugh at him I don't want them to feel guilty for laughing cuz it's just a joke at the end of the day so you know I'm just trying to be friendly and all that give me your most awkward black joke from this weekend okay well we were none of us react we all have to be snow face all right so we were waiting the Rave was in here last night and so we were waiting in line for the Rave",
            "start": 2427.76
        },
        {
            "text": "joke from this weekend okay well we were none of us react we all have to be snow face all right so we were waiting the rave was in here last night and so we were waiting in line for the Rave and there's this chick rocking around with glow sticks and everything and she's like anybody want glow sticks any want glow sticks there's no black light so it's going to be real dark in there and I was like well I can't help but be dark that was about that's not bad that's not bad yeah but that doesn't sound like a joke that sounds like you were hitting on her a little bit like I can't help it be dark and then you look at her and then just smooth like go up in there like up into her space is what I meant not like you like respect her respect her for who she is and ask her questions about like you know maybe take her out a couple dates meet her parents before you do anything right at least probably true but yeah I my question was uh what like like kind of weird Quirk do you guys have when people",
            "start": 2470.76
        },
        {
            "text": "maybe take her out a couple dates meet her parents before you do anything right at least probably true but yeah I my question was uh what like kind of weird Quirk do you guys have when people meet you cuz I'm sure you guys have been around each other more than enough so you know everyone's little quirks and all that so what do you think is like the weird thing that you have to like get over the hump of God damn it you you phrased the question in an interesting way yeah what's the weird Quirk we that we all notice about each other I think we should answer for each other what something else do I mean do it I mean it's your panel thank you good point cuz I don't know what my weird I don't I don't know if I have a I guess I'm at looking to you guys do I have a weird Quirk when I first meet people you a lot of weird weird quirks yeah what's that a lot of them um let me I actually I'm want to start with Colin on this one okay I'll be honest with you Colin gets very very very eloquent",
            "start": 2507.16
        },
        {
            "text": "people you a lot of weird quirks yeah what's that a lot of them um let me I actually I'm want to start with Colin on this one okay I'll be honest with you Colin gets very very very eloquent with his speech when he meets people for the first time now I I I've noticed this because last night when we were giggling like school girls in our respective beds um we we had a little bit more of a you know back and forth that was a little more natural but when Colin first meets someone out of respect he will be like very prim and proper and Stern and like shake their hand very well like a politician almost then he will lock eye contact with him and he will actually do this weird thing that he very seldom does he will smile it's true weird it's weird Nick Nick does this thing where he turns into an 8-year-old and any movement will distract him who man us who me us at the autograph lines thank you for thanks everybody for raising your hands you all know exactly what I'm talking about exactly",
            "start": 2548.72
        },
        {
            "text": "an 8-year-old and any movement will distract him who mans us who me us at the autograph lines thank you for thanks everybody for raising your hands you all know exactly what I'm talking about exactly we're all over here talking to you and then all the girl with a vampire teeth right there you have to go Nick and he comes back over he comes running over though poses for a picture but then he gets distracted while taking the picture so if you guys look at your pictures there's a chance that Nick is caught mid changing pose because it's never that drastic of a pose change but he'll just be like this dude you totally did that to one of my friends you totally did that to one of my friends you're like behind them you were like ducking behind him the picture and then the next picture you're like looking up at his head from behind his shoulder it's I like to give people options you know here's the thing let's let's start this now if it's not already a thing if you were taking a picture of",
            "start": 2597.32
        },
        {
            "text": "looking up at his head from behind his shoulder it's I like to give people options you know here's the thing let's let's start this now if it's not already a thing if you were taking a picture of someone else if they have handed you their camera and said can you take a picture take as many as you can in that moment that is just what happens and give a little direction too be like \"emit\" em it you turn a little to the side yeah now be a little sexy give me a little little sexy now think of me maybe without my shirt on that's good that's good that's good I'm feeling this nice your advice would make sense if everybody would just get on board and have an iPhone but we get these people come up with these crazy ass hostels I don't know what the hell this thing is and you give it to you and everybody's like what do I tap the screen do I hit the button and it's never what it should be like oh no don't tap the button of course not draw a Z backwards that takes photos someone had a BlackBerry",
            "start": 2638.52
        },
        {
            "text": "like what do I tap the screen do I hit the button and it's never what it should be like oh no don't tap the button of course not draw a Z backwards that takes photos someone had a BlackBerry yeah like when that came up and they were like oh it's a BlackBerry you ever heard of those and I'm like yeah I lived through the '90s I black was it wasn't a BlackBerry like you think it's a new BlackBerry they're trying again I they're bringing it back are they back Berry I'm excited um I think with Greg you become super Greg Miller when you meet new people for the first time yeah where like you I think people come to you with this perception and you try to immediately dispel that and like get people like like just take people's guard down which is good I'm I'm not saying well like people will come to you and they'll be like oh my God you're Greg Miller and you'll immediately hug them or something okay like you'll go out of your way to to be like sort of more you need to be we were all 12",
            "start": 2679.0
        },
        {
            "text": "to you and they'll be like oh my God you're Greg Miller and you'll immediately hug them or something okay like you'll go out of your way to to be like sort of more you need to be we we're all 12% ourselves when we meet these people like you're saying Colin smiles yeah that's why I think that's the interesting thing really good smile about Cal War AR a great smile I think that when people see him on camera and they meet him in real life they're always like he just doesn't seem that depressed he doesn't seem that oh they're all giving him a hard time and then the cameras are off and he's just I hate everything we we get that and then we express that to you and you don't believe us he's like a parent that beats his children wow and then we try to tell child services but he's in there making a pie like everything's fine don't worry about it why do you keep knocking your chair stop knocking the chair you know here's here's here's the hidden secret about Colin though is that he's not",
            "start": 2722.08
        },
        {
            "text": "a pie like everything's fine don't worry about it J why do you keep knocking your chair stop knocking the chair you know here's here's here's the hidden secret about Colin though is that he's not depressed he plays the Kerbal Space Program very well on camera but literally he will try to make things that are positive sound negative like this water is cold I like it and you're like what that's a positive statement what you know anyway I don't know I was going to say I think that like Greg's character like his Persona is not quite the way he actually really is I think in in person I mean I know Greg I've lived with Greg for a long time so you know you're quiet I think you're quiet and kind of kept keep yourself and something you're nice person you're a great person your personality I think like you turn it on really well yeah I mean I think that that's what we all do and I I don't know but I don't think anyone would expect that you're like I think you're like totally quiet I can go days without",
            "start": 2768.92
        },
        {
            "text": "turn it on really well yeah I mean I think that that's what we all do and I I don't know but I don't think anyone would expect that you're like I think you're like totally quiet I can go days without talking to you yeah you know what I mean so it's like and we live together yeah but that's cuz you're quiet I am but like for all like that's what I'm saying is like I have a lot of alone time to catch up on now you know for every five minutes I spend you know signing autographs and I have to sit you know lay in my bed and you know in the field position I mean the reason I think I'm I'm more I'm I'm definitely the Greg I wish I was all the time when I'm hanging out with you guys or meeting you guys at these kind of things right because all of a sudden I can focus I have one thing to worry about I can ignore emails ignore all the problems ignore all the to-do lists doesn't matter you know like when we're doing the lead up to this show like and I mean like this show and then like Colin McGregor",
            "start": 2812.08
        },
        {
            "text": "I can ignore emails, ignore all the problems, ignore all the to-do lists doesn't matter you know like when we're doing the lead up to this show like and I mean like this show and then like Conor Greg live these two past two days right that's been the part where it's like a crushing weight of like something's not working this isn't going to go is the Twitch going to work is it not going to work and so like when it finally gets to go and you just get to focus and forget about all that that's great and that's who I wish I was all the time cuz he's a happier person yeah I don't know I feel like you know the one thing that and I can I know people that listen to the show and just a lot of people looking like I have a lot of social anxiety and I always have and I don't think I'm like socially awkward at all I think like once I'm like going like it's like I always say like I never want to go out but once I'm out I'm good or whatever but these kinds of things like force me for days at a",
            "start": 2846.48
        },
        {
            "text": "We Sing the Star Spangled Banner - The GameOverGreggy Show (Live at Momocon 2015) awkward at all I think like once I'm like going like it's like I always say like I never want to go out but once I'm out I'm good or whatever but these kinds of things like force me for days at a time to like not Retreat back into my shell because that's kind of like what I want to do and it has it's not a reflection on anyone but me you know so you know this is this whole experience has kind of taught me to be a little bit you know like like yesterday when we were you know Tim Gettys took a picture of me we were at like a little VIP get together and there was a a copy of Bram Stoker's Dracula sitting there and so I just sat on a couch and read it for like 3 hours during the party at a party he's sitting there reading this book Colin Moriarty had an old-fashioned is reading Bram Stoker's Dracula and uh cuz I haven't read it's a great book um and uh I haven't read it in a long time so I was just kind of cruising through it and I'm like I like I'm like it was almost like that was like my breaking point",
            "start": 2881.04
        },
        {
            "text": "uh cuz I haven't read it's a great book um and uh I haven't read it in a long time so I was just kind of cruising through it and I'm like I like I'm like it was almost like that was like my breaking point where I'm like I can't be on anymore you know just candidly I'm like I got to just sit here and just read this book and like kind of collect my thoughts and be with myself because I can't I can't right now yeah the rest of us had a really good time that was thing he had a fine time and he didn't like turn you know I've been there where just like I got to chill out but like I was like do you want to go home you're like no I'm fine like all right great just reading about this man's journey into Romania whatever the **** he is yeah vampire Dickman we know him well we went to a very cool place last night and if you guys have ever been to it's called battle and brawl oh yeah Brew battle and Brew battle and Brew excuse me um and we walked in actually Brian is Brian here there he is right",
            "start": 2912.68
        },
        {
            "text": "last night and if you guys have ever been to it's called Battle & Brew, oh yeah, Battle & Brew, and Battle & Brew, excuse me, um, and we walked in actually Brian is here, there he is right there, stand up Brian, stand up Brian, sorry I messed up the name of...Battle & Brew, and Battle & Brew, excuse me, he runs our social, we have 10 minutes remaining, holy can uh I'll make this story very fast then so the reason I said brawl was because we walked in of course Super Smash Bros. was there it wasn't brawl it was um the new one, new one, um, and we're like what is this game we've never seen this before and proceeded to get really drunk and make asses of ourselves trying to beat people and I kept losing over and over again we were kicking the **** out of people I won one round and then kept but then I started winning which means that everybody's really drunk, yeah really drunk anyway it was a great time when just killed each other that's when me and the other guys can come in for the",
            "start": 2947.84
        },
        {
            "text": "but then I started winning which means that everybody's really drunk, yeah really drunk. Anyway it was a great time when just killed each other, that's when me and the other guys can come in for the scraps. Thank you EMT, thanks EMT, thanks guys. Uh also uh can I get pictures with uh Nick and Colin later because should come to the autograph in photo shouldn't you huh big fan yard huh huge fan yard The Raven till 4:00 a.m. so oh okay it's hard to wake up at 10: a.m. when you were partying till 4:00 a.m. at the R so yeah yeah Nick and I were up till 4:00 a.m. snuggling so I can do it after the panel though so yeah all right all right cool thank you thank you byebye thank you H he looks so comfortable I know right he has a neck pillow on cuz he's just been sleeping to the Q&A section he's like ah time to go it's been a long day all right I'm Daryl hey Daryl darl okay so I heard you guys are leaving right after after this going back to California yeah so I was wondering how you plan on bringing",
            "start": 2984.76
        },
        {
            "text": "to go it's been a long day all right I'm Daryl hey Daryl darl okay so I heard you guys are leaving right after after this going back to California yeah so I was wondering how you plan on bringing me along with y'all oh I haven't put much thought into it yet I was actually going to plan on just leaving Tim here and bringing you in his stead are you okay with that that works cool perfect you don't want to come to California stay here it's better down here you have water here and Chick-fil-A it's much better here yeah true and Battle & Brew and Battle & Brew of course yeah and it's like I want to say Sydney at it's something weird Sandy Springs Sandy Springs Hurricane Sandy what what are we talking about but uh my serious question um I've changed path my career path I'm thinking about uh doing game journalism and I just wanted to hear like a tip from each of you like how would I get my foot in the door and I'm going to start college and I was thinking of uh starting with",
            "start": 3020.28
        },
        {
            "text": "uh doing game journalism and I just wanted to hear like a tip from each of you like how would I get my foot in the door and I'm going to start college and I was thinking of uh starting with English or probably Journalism so I just want to hear like from each one of you right every day make YouTube videos do both of those every day yeah be consistent but understand that luck plays a huge role in it too I would never in a million years pretend I'm the best writer or the best personality I got really lucky too so I mean there's there's definitely an element we don't talk about all which is like you have to be in the right place at the right time know the right people I mean that that kind of stuff helps too so I always like to try to throw that out there because it wasn't an entirely skill-based no that's I would disagree with you though because you you put yourself in that position so that when that opportunity came about you had everything you needed like sure there was",
            "start": 3071.68
        },
        {
            "text": "skill-based no that's I would disagree with you though because you you put yourself in that position so that when that opportunity came about you had everything you needed like sure there was amount of luck that that there always is in every situation but you put the work in and you like spent years kind of writing and making sure that that writing got in front of the right person and really being an outspoken member of the community and then got noticed right yeah I mean it worked it worked to the sense that you know I just did things to mathematically increase my chances basically you know cuz I started writing for Game Informer when I was 14 and I'm you know 30 now so it was a long time ago um and uh and then I was an internet IGN and I did all these things for free and was like a community manager and a moderator and all those kinds of things and every one of those things just increased the likelihood that someone would notice me and then when I graduated college they offered me a job so",
            "start": 3112.36
        },
        {
            "text": "and a moderator and all those kinds of things and every one of those things just increased the likelihood that someone would notice me and then when I graduated college they offered me a job so it worked but and did you find it uh find yourself ever like comparing yourself to like other writers and you're kind of putting like a downer on yourself yeah sometime I mean like I I felt like yeah early on I felt like you know I had a lot to learn and I still had a lot to learn and I think Greg feels the same way but I think that I I think frankly I I got pretty good and I I I developed the voice and people liked what I was writing and I appreciated that and I still think there are amazing games writers out there that people should try to read and emulate I mean you know we always talk about Jason Schreier is really really really good at what he does uh Matt Leone writes a really great long form article so there's a lot of people out there you can learn from to Jeremy Parish probably the best",
            "start": 3148.76
        },
        {
            "text": "shrier is really really really good at what he does uh Matt Leone writes a really great long form article so there's a lot of people out there you can learn from to Jeremy Parish probably the best games writer there is um so um yeah like it's important to like kind of stay humble understand that the process kind of works itself out and just do those little things like chip damage kind of to ultimately you know get noticed or whatever but I I like throw that out there because I don't want to make it seem like it's you know you do all those things and it necessarily works out because I knew so many talented people that some of them better than me that you know unfortunately weren't able to to make it into a career so sure you know what I mean I just like to keep that that in mind as well okay thank you you're welcome good luck one real quick thing I want to say you saw the 10-minute sign right now you're going to the third part of this question say I'm afraid of Nick after this photo",
            "start": 3184.8
        },
        {
            "text": "thank you you're welcome good luck one real quick thing I want to say you saw the 10-minute sign right now you're going to the third part of this question say I'm afraid of Nick after this photo I took after this photo I took with him okay okay you come over here Jurassic Park I'm trying to do the Greg Miller on that where I go like this thank you that's awesome he's terrifying please sir than you step up yes what's up guys my name is Ryan hey Ryan Ry my question is what is the seediest or sketchiest place you've ever been in your entire life I mean the sketchies for me was when I was coming back or trying to move to San Francisco first time and I got stuck in a blizzard in Nebraska and it was a guy who took me in and saved my life literally but his trailer was like down on its luck um there's this place San Francisco called Civic Center and there a BART station which is like a Subway thing and it's just a scary place to be at any time Canada no uh probably a probably a strip club",
            "start": 3220.64
        },
        {
            "text": "this place San Francisco called Civic Center and there a BART station which is like a subway thing and it's just a scary place to be at any time Canada no uh probably a probably a strip club in Vegas if I'm being 100% honest probably the the uh the Olympic Gardens that place is you walk in and you're like I thought I was who I was I'm not that this is this place is way too crazy for me you got to walk out yeah I don't know we were I was just talking about I think with the guys because it's funny that Tim brought up a Civic Center like people are like oh there's these really bad parts of San Francisco and I'm like you don't know you don't know what you're talking about like go you know there's Parts in New York that are like awful so just um probably just multiple places in New York uh pretty seedy Shady kind of places but there are Civic Center is like an amazing really an amazing place in and the Tenderloin is a part of San Francisco that's actually",
            "start": 3264.32
        },
        {
            "text": "We Sing the Star Spangled Banner - The GameOverGreggy Show (Live at Momocon 2015) is actually taking place in Atlanta, not San Francisco. However, I'll correct the text accordingly:\n\nUh pretty seedy Shady kind of places but there are Civic Center is like an amazing really an amazing place and the Tenderloin is a part of San Francisco that's actually gentrifying a lot but um it's pretty seedy too but in terms of an establishment yeah probably any number of strip clubs you would have to imagine yeah yeah and of course there's Shady McDonald's, Shady McDonald's oh yeah Shady yeah at Haight and you guys know what the Haight is it's a part of San Francisco um like where hippie culture was born basically and there's a at the corner of Haight and Stanyan is a McDonald's and we call it Shady McDonald's and it's like a weird thing because you cannot walk by that McDonald's without people being trying to like sell you anything you want so they'll like you'll they'll walk by like and it's always like a guy just like walking with you for a second and he'll be like shrooms, shroom, shrooms, shrooms and you just like keep walking he's only got he's like",
            "start": 3308.56
        },
        {
            "text": "you'll they'll walk by like and it's always like a guy just like walking with you for a second and he'll be like \"shrooms\" shroom shrooms shrooms and you just like keep walking he's only got he's like weed weed weed you know like this like he's only got five like a second to make an impact on you so he's got to sell it you know can't be like hi how's your day you know it's got to be like c c c c it could be like 2 o'clock on a Tuesday and people going to work like you want some mushrooms anyone want \"mushrooms\" no mushrooms like I'm just trying to walk by like make like I'm not even maybe he's trying to give you an ingredient for your next Pizza Pie maybe but I've lived there for I've lived in I've lived in San Francisco for eight years and that is like it never ever fails someone's buying \"mushrooms\" off that guy he wouldn't keep he wouldn't keep doing have you been to San Francisco a lot of people are buying mushrooms off that guy lot people just give mushrooms that's a crazy thing too one",
            "start": 3352.56
        },
        {
            "text": "off that guy he wouldn't keep he wouldn't keep doing have you been to San Francisco a lot of people are buying mushrooms off that guy, a lot of people just give mushrooms, that's a crazy thing too. One of the other things when we did Beta Breakers, the first couple years, people were like \"this is edible\", they were just handing out drug-infused food. We should do you guys any of you heard of Beta Breakers by chance? Yeah, Beta Breakers is like a heinous San Francisco event that happens in my area. It's an actual race, so like serious people get up and run from the bay to the ocean, and then everyone else dresses up in costumes or gets naked or does any kind of like gets wasted and walks through, and it's at like 9 or 10 in the morning. Everyone just gets **** wasted and there's trash and they just follow behind the racers, so like it's a group of just...it's not uncommon to see a lot of naked people in San Francisco, but that is probably one of the",
            "start": 3386.32
        },
        {
            "text": "just gets totally wasted and trash, and they just follow behind the racers, so like it's a group of just it's not uncommon to see a lot of naked people in San Francisco, but that is probably one of the biggest collection of them plus people are just dressed up in random costumes. We used to do a thing where our friend David Clayman, who uh works at Bethesda now - actually he just quit, I think - but he worked at Bethesda for a long time, uh he would be the President of the United States and we had a like a podium for him that we would wheel him around on, and then everyone would dress up in suits and be his bodyguards, we'd be Secret Service. Um so that was like our little thing. It's like San Francisco is really it was genius because if you wanted to take a picture of the President, we had to make sure you didn't have any weapons on you, so we had to pat you down. I have lots of photos of Nick patting people - there's a lot of I mean they're all on Facebook, there's a lot of damning photos where I'm",
            "start": 3427.48
        },
        {
            "text": "Didn't have any weapons on you, so we had to pat you down. I have lots of photos of Nick patting people; I got them all on Facebook - there's a lot of damning photos where I'm just staring directly into different parts of people. All right, thank you, thank you for your question. Thank you, all right. What's up, Dr. Tuna can? How's it going, guys? Good. Well, I'm John, by the way - hi, John. All right, um, my question for you guys is: if someone were to make a video game with you guys in it, what type of game would you want? You can say just the name of a game or genre and how you see yourself in that game. I'd want to beat him up - like a brawler. I think it would be fun. You want like a brawler, like uh, like Double Dragon or something. Sure. I want a hardcore JRPG about us; an 80-hour person, yeah. Persona about us. I would like it to be like Diablo because then all four of us could play - you have four characters out there, different classes running around getting a bunch of loot. I would like it to be like",
            "start": 3459.12
        },
        {
            "text": "We Sing the Star Spangled Banner - The GameOverGreggy Show (Live at Momocon 2015) \nus I would like it to be like Diablo because then all four of us could play you have four characters out there different classes running around getting a bunch of loot I would like it to be like um like a Batman Arkham game where I'm Batman and they're just like random side quests that I'm just like I'm not going on to like like Zatanna where I'm like I'm not answering that goddamn phone I'm not doing it sorry just keep going just keep running just keep going cool thank you thank you all right the Ghostbusters what do you want Hello Hello thank you again for uh for talking to me uh in the autograph section awesome thank you for coming out oh it's our pleasure what's your name uh my name is Mitchell and and you're dressed as a Ghostbuster absolutely uh Georgia Ghostbusters we're ready to believe you all right so um just to keep it rolling along um quick question uh me and my cousin was talking about uh um The Avengers I saw the Avengers uh me and him both saw it um he didn't like",
            "start": 3510.08
        },
        {
            "text": "\"Believe you all right, so um, just to keep it rolling along. Um, quick question: me and my cousin were talking about uh, um, The Avengers. I saw The Avengers; uh, me and him both saw it. Um, he didn't like The Avengers; uh, he liked Fury Road better. I haven't seen Fury Road, but you're going to like it better, there you go. Uh, but I said well, why didn't you like it? He goes, well, it's the same old same old. I mean, it's been done before, right? And I said, well, I mean generally speaking when it comes down to movies like that, you have that beginning, middle, and end; you introduce the hero, the hero goes to fight something, he falls on his face, comes back becomes victorious at the end. And I don't know if Fury Road was like that, but I asked him, he said yeah. My question to you is: uh, what makes uh, in your opinion, uh, is everything when it comes down to action movies the same formula? Or I mean, is there such a difference? What makes something like The Avengers worse or better than something like Fury Road if\"",
            "start": 3553.6
        },
        {
            "text": "uh, is everything the same when it comes down to action movies or I mean is there such a difference what makes something like The Avengers worse or better than something like Mad Max: Fury Road if it has the same beats and it's something that you love well I mean you figure for this and I haven't seen Mad Max: Fury Road but I don't think I need to like the same when Greg and I were going to our screening of The Avengers in the car I was like I don't know about this movie man I keep hearing mixed things and he said the only thing I keep hearing about it is that it's more The Avengers and it's like you'll never have that Hulk moment again right you're where he first turned green and you know like that is my secret CU those are awesome moments right and so like when we saw The Avengers it was like ah cool it's more The Avengers but it's not those high points because he can't have those again yeah I mean when you liken it back",
            "start": 3602.12
        },
        {
            "text": "We Sing the Star Spangled Banner - The GameOverGreggy Show (Live at Momocon 2015) moments right and so like when we saw Avengers it was like ah cool it's more Avengers but it's not those high points because he can't have those again yeah I mean when you like to liken it back to an old adage they when they when you study writing in college they said there are there there are no original stories anymore right they're just original ways to tell stories um and that's what Fury Road does Fury Road you watch that and it's perfect in its Simplicity it really is not a very complex movie but in that Simplicity there is complex character development there's a lot of subtext which a lot of movies just don't have these days and there's also just a lot of really brutal **** that they throw at you and it is an experience and it takes a part of you with it and it's awesome yeah just to real quick because I I have no intention of seeing the Avengers as all of you know but it's it would be unfathomable it's unfathomable to me that that that movie could possibly be any",
            "start": 3638.04
        },
        {
            "text": "yeah just to be real quick because I I have no intention of seeing The Avengers as all of you know but it's it would be unfathomable it's unfathomable to me that that that movie could possibly be any anywhere near as good as Fury Road was for like Fury Road was that's a film you know like that's a that's an amazing movie you got to go see that movie oh my God so good oh I plan to yeah awesome thank you thank you I I hope you come back soon thank you we had a great time thank you year ladies and gentlemen that's The GameOverGreggy Show each and every week for sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that please go support us on patreon.com kindof funny it allows us to live our Dream you can get the shows early or go to youtube.com/ kindof funny where we put it up topic by topic day by day until we post the entire thing for your amusement YouTube I already said that what it's good enough close enough you leave me",
            "start": 3677.56
        },
        {
            "text": "to youtube.com/kindafunny where we put it up topic by topic day by day until we post the entire thing for your amusement YouTube I already said that what's good enough close enough you leave me hanging with the goddamn hit in the table and **** we're finally having it out huh St it oh my God stop dropping ladies and gentlemen thank you so much enjoy momocon thank you",
            "start": 3714.92
        }
    ]
}