{
    "id": 4594,
    "video_id": "ev44Hmrj4iY",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Bruce Greene"
    ],
    "title": "Ms. Marvel Joins Marvel's Avengers - Kinda Funny Games Daily 10.07.19",
    "description": "Get started today with the Hims complete hair kit for just $5 today by going to http://forhims.com/gamesdaily\n\nQuip starts at just $25 and you’ll get your first refill FREE at http://getquip.com/games.\n\nBruce Greene joins Greg to talk about Kamala Khan coming to Crystal Dynamics' Avengers video game, Destiny 2's raid, and more!\n\nTime Stamps - \n00:01:00 - Housekeeping\nThank you to our Patreon Producers: Black Jack & Mohammed Mohammed\nThe Roper Report   -\n00:03:44 - Ms. Marvel joins Marvel’s Avengers\n00:11:08 Best Friend Q. - I am wondering if this trailer for the inclusion of Ms. Marvel is because there is a good chunk of people who are not feeling the game and they are trying to get more pre-orders. Did this move the needle for you guys on getting the game or do you feel this would of been a better to have her in the game and people find out when they play the game? - Borzen00\n00:14:12 Best Friend Q. - Do you think, in modern games criticism, that length is something that should even factor into reviews anymore? Or is it perhaps something of a \"when it feels right\" situation? - Chad Betteridge\n00:21:50 - World’s First for the Destiny Raid, Samuel Horti @ PC Gamer\n00:24:15 Best Friend Q. - The raid race in Destiny 2 began Saturday and after a surprisingly short 7 hours it was cleared! It's surprising that such a large expansion dropped a raid that could be cleared so quickly, although black armory was cleared in roughly that amount of time as well. Do you think perhaps the shorter clear time was to entice the massive flow of new players joining up with New Light? - Alex Russ (Zero Syndicate)\n00:32:06 - Former Nintendo lawyer and Kirby namesake John Kirby dies, James Batchelor GIB\n00:33:40 - Pokemon Stream all but confirms Galarian Ponyta, Kevin Knezevic @ GameSpot\n00:44:22 - Out today\n00:45:16 -  HIMS\n00:46:58 -  QUIP\nReader mail   -\n00:48:00 - Iron Man VR got the push to February 2020 which is releasing near a bunch of indie titles such as The Last of Us Part 2, Final Fantasy 7 Remake and Watchdogs Legion. Is this title doomed? Should Sony have waited? - Frankfurtter\n00:50:50 - One Night Stand just released on Nintendo Switch, which is a game I first saw during the Kinda Funny Games Showcase. I was just wondering if anyone at KF have played it and if so, what you thought of it. It seems like a Greg Miller game for sure, and I’d love to hear some spoiler-free impressions before I take the dive. - Mitchell\n00:54:00 - I have two questions regarding Google Stadia. Bruce, what do you think of Google Stadia and the potential of games as a medium moving towards a streaming future? Greg, when is your best guess as to when we will find out the official launch date for Stadia, or at the very least when will the Founders be able to claim their names?  - The Five Star Man\n00:58:12 - Squad Up: Anthony(PS4) - timmy_darco (please shu, let me change my name without potentially screwing up a bunch of stuff)\n00:59:42 - You‘re Wrong\nTomorrow’s Hosts:Greg and Bruce Greene\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1570476934,
    "duration": 3772,
    "transcript_chunks": [
        {
            "text": "[Music] what's up everybody welcome to kind of funny games daily for Monday October 7th 2019 I'm one of your host Greg Miller alongside a free man Bruce Creed felt like I was the slave TV screen Bruce how are you I'm doing very well how are you doing I'm good how are you enjoying we brought a little bit of la weather with you oh it's beautiful and like honestly it's usually really cold here and it is beautiful up here and we'll see you by the end of the day how I feel about being in the studio I'll tell you what the jacket Halloween jagat already coming off already why I start every show you're gonna regret that Bruce is gonna wear your shorts too so that's helpful C Pro maneuver I packed basketball shorts today just in case because I'm not sure how hot it's gonna get Kevin open that drape over there close that change during the show no no no not during the show but it's you you and me of course doing kind of funny games daily today you and me doing we have cool friends after this",
            "start": 1.6
        },
        {
            "text": "over there close that change during the show no no no not during the show but it's you you and me of course doing kind of funny games daily today you and me doing we have cool friends after this that's right then you finally get a break we do the kind of funny podcast then you're streaming on your channel my channel I gotta figure out we're gonna stream and who we're gonna stream is everybody everybody you probably get that Nitro rifle kid Andy Cortes you know what I mean who Andy Cortes he's this guy he really wants to work at fun house and I hear there's an opening I mean yeah there is an opening but I don't know for somebody of with no experience in ill repute exactly great point Bruce today we're gonna talk about Marvel joining the Avengers Destiny's raid finally being bested and more because this is kind of funny games daily each and every week to end a variety of platforms we run you through the nerdy video game news need to know about if you like that be part of the show",
            "start": 52.92
        },
        {
            "text": "more because this is kind of funny games daily each and every week to end a variety of platforms we run you through the nerdy video game news need to know about if you like that be part of the show patreon.com slash kind of funny games with your questions comments concerns in everything under the video game son then tune in to our show live on twitch.tv slash kind of funny games if you're watching live you have a special job go to kind of funny comm slash you're wrong tell us what we grew up as we screw it up record straight for everybody watching later on well kevin is running in to try to do things but he does that thing where he's like I'm gonna bend down and you still see his light a little humpback whales going for so no why I would say why even bother you know what I mean just walk on in youtube.com slash kind of funny games roosterteeth calm and podcast services around the globe the jacket looks good on you I mean it feels powerful yeah Imran came in and he host on a Friday",
            "start": 93.48
        },
        {
            "text": "on in youtube.com slash kind of funny games roosterteeth calm and podcast services around the globe the jacket looks good on you I mean it feels powerful yeah Imran came in and he host on a Friday without me cuz I was in LA and sure enough you were too and yeah it was very much like Tom Hanks at the end of big little kids like walking up where'd you get it I got that of course it's period Halloween and I was I paid for it so there you go $20 way more well it was a full suit because the jacket the pants and a top just energized no no uh housekeeping thank you to our patreon producers blackjack and Muhammad Muhammad today we're brought to you by hymns and quip but we'll talk about all that later for now let's begin the show with what is and forever will be the Roper report time for some new four items on the rope report thank you very much Kevin number one comes from New York colonies a baker's dozen baker's dozen yeah yeah yeah it's an old reference don't worry it's all right really",
            "start": 137.52
        },
        {
            "text": "four items on the rope report thank you very much Kevin number one comes from New York colonies a baker's dozen baker's dozen yeah yeah yeah it's an old reference don't worry it's all right really really inside joke it's a podcast beyond thing we stole that we keep going here oh no trust me if they wanted to sue us I mean I call it the Roper report which is what I invented on beyond parish Snyder's got a laundry list of things okay report ms marvel herself Kamala Kahn is joining Marvel's Avengers game from Square Enix this is the official press release today at New York Comic Con 2019 Square Enix and Crystal Dynamics revealed that fan favorite Kamala Khan is the latest playable superhero to be featured in Marvel's Avengers Crowe created by G will wit G willow Wilson Adrienne Alf onna sana Amanat LT whacker on I have such a problem period in the comics Kamala is an enthusiastic teenager who defends her hometown Jersey City as the costume ms marvel first appearing Captain Marvel number",
            "start": 185.73
        },
        {
            "text": "Amanat LT whacker on I have such a problem period in the comics Kamala is an enthusiastic teenager who defends her hometown Jersey City as the costume ms marvel first appearing Captain Marvel number 14 in August 2013 Kamala quickly captured the attention air in the imagination of generations of true believers leading to her own monthly comic series in February 2014 a self-avowed Avengers fan the game's original story Kamala Khan must apply her intellect optimism and unique abilities to the task of unraveling a global conspiracy and reassembling her personal heroes in time to stop a new secretive organization advanced idea mechanics aim before they unleash one of the greatest threats earth has ever faced players first encounter a young Kamala during a day where Captain America Iron Man Hulk Black Widow and Thor are unveiling a high-tech Avengers headquarters in San Francisco including the reveal of their own Helicarrier powered by an experimental energy source which is never good why",
            "start": 241.47
        },
        {
            "text": "Black Widow and Thor are unveiling a high-tech Avengers headquarters in San Francisco including the reveal of their own Helicarrier powered by an experimental energy source which is never good why would they call it the experimental engine Flying Fortress we got the celebration turns deadly when a catastrophic accident results in a massive digest devastation Kamala is exposed to the mysterious Terrigen mists and finds herself developing extraordinary polymorphic powers which she subsequently hides for years blamed for the tragedy the Avengers dis man five years later with all superheroes outlawed and the world in peril Kamala uncovers a shocking conspiracy and embarks on a quest to reassemble the hero she believes in and to become the hero she was destined to be players begin the journey as Kamala Kahn and learned the origins of her extraordinary powers as the story expands Kamala plays an essential role in bringing the disbanded Avengers back together as the superhero is added to the",
            "start": 288.91
        },
        {
            "text": "Kamala Kahn and learned the origins of her extraordinary powers as the story expands Kamala plays an essential role in bringing the disbanded Avengers back together as the superhero is added to the roster players must master all of their unique abilities rebuild and customize the Avengers team to face increasingly growing threats only the Avengers together can defeat I have never heard of Kamala Khan until someone suggested in the trailer was a few months ago when it came out on the great that's Kamala Khan and I went who so where do you come down on your marvelous then so all my marvelous lies in the MCU all of it okay the comics I actually chose to avoid once I started realizing I like the movies yeah surprises yeah cuz a lot of people are like oh my gosh it's like this one thing in the comics on my shop I don't want to know I'd actually rather see the movies and be surprised what was that like that for you watching Winter Soldier did you see that coming um no no not at all I mean",
            "start": 333.67
        },
        {
            "text": "comics on my shop I don't want to know I'd actually rather see the movies and be surprised what was that like that for you watching Winter Soldier did you see that coming um no no not at all I mean like it was great and also like when Captain America grabbed a hammer sure I had no idea that was gonna happen yeah and I was so excited about it so yes I'm so I have no idea I don't know what miss Marvel does or is or you know what he's a great what parts she plays she and Biggins means she gets large yeah that she can enlarge her hands or feet she's a shape-shifter kind of thing going on her you can enlarge anything she wants yeah she can look like yeah she can do whatever she wants about her toes Greg big ol toes big toes big ol fingers yeah like sucking toes man she'll put these fingers anywhere you need her to you to stop crying and say any of that alright I'm saying maybe why do people like to suck toes that mean even less because people like to suck toes sure people like to put",
            "start": 374.5
        },
        {
            "text": "anywhere you need her to you to stop crying and say any of that alright I'm saying maybe why do people like to suck toes that mean even less because people like to suck toes sure people like to put fingers into things it's true obviously Kevin sucks toes what website people appreciate toes for Nick oh yeah they did yeah like I think they put they put Nick on it with Nick suck toes - I bet he does Nicholas anything dolly back where do you come down in the Avengers game then since you're a big movies guy Wow I mean I was really worried I mean I watch that I watch that trailer and I was like who are these people first of all because it's like it looks like Captain American an umpire right which is the worst probably the worst offender but like the RO or no actually is it Robert Downey jr. or not I'm sorry Iron Man yeah that has long hair some of them when they use a five-year jump Tony Stark has long hair I think Kevin's talking about that cuz he grew his hair out to be one it doesn't",
            "start": 412.47
        },
        {
            "text": "or not I'm sorry Iron Man yeah that has long hair some of them when they use a five-year jump Tony Stark has long hair I think Kevin's talking about that cuz he grew his hair out to be one it doesn't look cool it doesn't look more I'm sorry I'm sorry I'm not being honest Kevin either way I don't know I mean like they just this doesn't feel like the Avengers that I know and love yeah are you gonna give it a shot though because we're give it a shot yeah yeah I played the demo at PAX right and so I got to go through this initial set the introduction thing and I think all the criticisms you've heard leveled at it and people have talked about in terms of gameplay staying true that's like we talked about it for a while on games cast where it's like it's fun I didn't feel like I was having the but it wasn't you know Thor Catchings hammer doesn't feel like kratos cash in the leviathan acts however it is that hey here's a sampling of what's happening in the gameplay sure and so for them to do",
            "start": 466.44
        },
        {
            "text": "it wasn't you know Thor Catchings hammer doesn't feel like kratos cash in the leviathan acts however it is that hey here's a sampling of what's happening in the gameplay sure and so for them to do this I mean for me as a comic book fan as a you know comp fan video game fan an MCU fan as well yeah uh I like Kamala Kahn I know a lot about her I did read a lot of MS marvel for it to be now centered around her she's the protagonist of the five years later that's a cool thing we haven't seen and I feel like that's what the Avengers game is struggled with on introduction okay is that it is hey we're coming off this twenty two three movie thing that has been like ever since you've all grown up you've all grown to love these characters now we're giving you them in a video game but not them and they don't look right compare it's like that is such a monumental task of give us an introduction to all these characters just show us the Avengers but then take them somewhere interesting hold on let",
            "start": 511.53
        },
        {
            "text": "don't look right compare it's like that is such a monumental task of give us an introduction to all these characters just show us the Avengers but then take them somewhere interesting hold on let me ask this I didn't why didn't Marvel just go hey Square Enix make a game but with the movie characters is because the the likenesses were too hard to get the boys were too hard to get is that what sure I'm sure it's all of that and I'm sure I'm also sure that like Kevin over at MCU right is like like it was like stay away yeah of course not like that he didn't work with the TV people right like I don't think the video games and not to mention how fast video games change I like them while having their own world I just feel like they were put behind the eight-ball in terms of network because they were they can't show you the cool [ __ ] yet right I think the fact that we get five-year like again I've played through the entire introduction for what they say or like gameplay of all the Avengers",
            "start": 555.65
        },
        {
            "text": "were they can't show you the cool [ __ ] yet right I think the fact that we get five-year like again I've played through the entire introduction for what they say or like gameplay of all the Avengers I think and I want to be surprised if we play as Kamala before that to set that up but anyways yeah I think then jumping at five years in us getting a broken Tony Stark right with long hair who again we saw in the trailer they put out at comic-con of this you know a Bruce who Bruce Banner who's not in with the Avengers anymore and like apparently there was a giant rift between them as what it seems like caps dead Thor gave it up like it it should be interesting to jump into that world and actually get going with that I hope so I mean I really I really do it this to me feels like I'm picking up a game of The Avengers that I've never heard of before yeah so it's like hey you know like Iron Man and I'm like I have a cursory knowledge of them before the MCU that's what it feels like if in",
            "start": 591.38
        },
        {
            "text": "up a game of The Avengers that I've never heard of before yeah so it's like hey you know like Iron Man and I'm like I have a cursory knowledge of them before the MCU that's what it feels like if in 2008 here play this game and I'm like okay yeah I'll give it a shot see what happens yeah I think you know the we have a lot of questions about I guess we should get into those but yeah people talking more and more about it being like destiny I think he's gonna be an interesting grab how will that bring people in this game is gonna be like destiny in terms of like yeah you know ever gone Berzin zero zero says good morning Greg and Bruce kamal khan is joining the Avengers game and I could not be happier however this still is not me can you get this game on day one and I am wondering if this trailer for the inclusion of MS marvel is because there is a good chunk of people who are not feeling the game and they are trying to get more pre-orders did this move the needle for you guys on getting",
            "start": 627.65
        },
        {
            "text": "for the inclusion of MS marvel is because there is a good chunk of people who are not feeling the game and they are trying to get more pre-orders did this move the needle for you guys on getting the game or do you feel this would have been better to have her in the game and people find out when they play the game this doesn't move the needle at all yeah literally not at all I don't care and so when a lot of people were excited about Kamala Khan I was like who it doesn't matter to me I don't know if you've heard my theory on venom if Andy gets here on time he can do it so venom I think the only reason venom is excessed because it wasn't a good movie was that everyone thought it was part of the MCU sure cuz they saw marble on it oh cool alright I'll go see I know what venom is it from marble right that's gonna fit in yeah and everyone saw it and went like oh okay a lot of people probably left not knowing it didn't fit it I think you're probably right you're very ambiguous for a reason",
            "start": 667.82
        },
        {
            "text": "right that's gonna fit in yeah and everyone saw it and went like oh okay a lot of people probably left not knowing it didn't fit it I think you're probably right you're very ambiguous for a reason and so that's what this feels like to me this is more of like I don't think miss marble plays into it at all I think this is more of like hey it's the Avengers you know the ones you know and love go buy the game and then they buy the game I'm like what is this yeah I understand so no for me it doesn't change anything at all for me it does move the needle it makes it way more interested in the story because I was actually if it's especially coming off of endgame where it's like five years later okay great like and then the game does it pretty much the exact same thing so if it was just gonna pick up and I am playing the same character to give us a character that is us basically Kamala Khan who is a fan of the Avengers is they've talked about in the press release uh it is a fan of the comics",
            "start": 713.87
        },
        {
            "text": "up and I am playing the same character to give us a character that is us basically Kamala Khan who is a fan of the Avengers is they've talked about in the press release uh it is a fan of the comics as well she's a big into superheroes to have her be our lens that we're gonna go through an experience this thing try to get these guys together if you watch the trailer of like you know they're very much not the Avengers we expect where it's like she pitches to Bruce and Tony what's happening and they both like no we're not gonna [ __ ] help like we know it's a setup why would we do this and I want to walk away yeah it'll be interesting to see her good we'll win it over one of the things you know bores and you say you know if this trailer is because there's a good chunk of people who are not feeling the game and will they get more pre-orders of course every trailer so you get more pre-orders together however this is definitely a scheduled marketing beat it happened in New York comic-con",
            "start": 746.78
        },
        {
            "text": "feeling the game and will they get more pre-orders of course every trailer so you get more pre-orders together however this is definitely a scheduled marketing beat it happened in New York comic-con this was their point this is how I'm sure they wanted to do it of hopefully uh hopefully when they announced it get people super stoked to have vengers core I don't think it went the way they wanted to since e3 they've double-backed a few times like I said my pax demo and I talked about a games cast was very much like answering our questions trying to explain without revealing everything what's happening in this game and what it's going to be and so chopper in there I think that's a really interesting story for me which I'm all about I'm still gonna play it of course you're gonna play it course you better I mean I play with me PlayStation 4 you know I'm saying we play together oh this PC out the window look out the window I have a real problem the fact that all of you guys are so many",
            "start": 781.52
        },
        {
            "text": "you better I mean I play with me PlayStation 4 you know I'm saying we play together oh this PC out the window look out the window I have a real problem the fact that all of you guys are so many fanboys over here too sweet I I don't know I don't get it I don't get it Xbox is better obviously yeah I go through old time literally every night every single ayah giant pain in the ass Sony's UI is garbage no it's good look I'm there's no way I'm gonna change any mind search chad wrote in to patreon.com/scishow and said this good morning greg in Big Daddy Bruce the length of Square Enix's Avengers campaign has been disclosed and a lot of people think it's too short is length of a campaign an object an objective point of criticism or is it something more subjective if you missed it chad is referring to rich Briggs being interviewed on comicbook.com over there rich from Chris Lamech says this I think it'll depend and when I asked how long the game is I think it'll depend on exactly how deep you",
            "start": 816.32
        },
        {
            "text": "to rich Briggs being interviewed on comicbook.com over there rich from Chris Lamech says this I think it'll depend and when I asked how long the game is I think it'll depend on exactly how deep you want to go into it so if you think about previous crystal games you know that if you want to be playing your way through the core story it's going to be in that area 10 to 12 hours but if you want to see everything there is and do all the side missions and everything else you're generally looking at 30 output 30 plus hours in Tomb Raider games so we're not putting exact numbers on it just yet but you can expect something comparable to what we've done in the past with that regard and then of course you have the extended narrative and the extended game plan More Heroes post-launch we're now going back to chat forgive me if I'm wrong but you've mentioned that open-world games are simply too daunting and vast for your lifestyle nowadays everyone seems to have their own preference when it comes",
            "start": 863.99
        },
        {
            "text": "back to chat forgive me if I'm wrong but you've mentioned that open-world games are simply too daunting and vast for your lifestyle nowadays everyone seems to have their own preference when it comes to these campaign lengths do you think in modern games criticism that length is something that should even factor in to reviews anymore or is it perhaps something more of a when it feels right situation ie a campaign is too short it's short but satisfying slasher campaign is long but bloated and five to seven hours could have been cut out ska came before Reagan yeah there's an inside joke for me okay guys for me Chad thanks you know what I mean sometimes I'm afraid the inside jokes are bringing up we're gonna be like salt in the wound um where do you think I would why I want to hear your your thoughts on this first because I've got a very like to find answer on okay but you I want to hear your thoughts on whether or not you think a campaign length matters in review I think it matters in",
            "start": 902.15
        },
        {
            "text": "thoughts on this first because I've got a very like to find answer on okay but you I want to hear your thoughts on whether or not you think a campaign length matters in review I think it matters in review in the way it should probably it should be brought up as reviews reviews are hard nowadays right because there is there opinion pieces that's how I wanna I want to know what your experience was with the game but layered into that I still also need some of the back of the box details and I always want to know how long a game is that I think that is interesting I don't know necessarily if it should be a pro or a column that's a different thing I want that fact in there more than I want it to be mailing somebody of a wall vice versa like you know Legend of Zelda the new one that just came out oh yeah exactly oh my it's you know six dollars but it's an old game it's only twelve hours or whatever it's like it's pretty good I mean exactly and I mean that's how I came out in it too but it's",
            "start": 941.96
        },
        {
            "text": "oh yeah exactly oh my it's you know six dollars but it's an old game it's only twelve hours or whatever it's like it's pretty good I mean exactly and I mean that's how I came out in it too but it's you know you know when journey launched right and was a one sitting experience for what $15 kind of funny comm slash you're wrong $20 I thought that was well worth it and even like you know with Apple arcade stuff now where that's harder because of a subscription but yeah I don't mind that I actually really appreciate that you know assemble with care is a flight that's all it was Florence I paid full price for right and that was 45 minutes on a flight and it's one of those games that I still think about and resonated with me well I don't think it needs to be I'm paying it I need you know just gargantuan numbers in game play out of it I don't I'm not every game needs to be the Everlasting Gobstopper no not at all well I think that's kind of what this game it seems if this is gonna go to",
            "start": 982.91
        },
        {
            "text": "gargantuan numbers in game play out of it I don't I'm not every game needs to be the Everlasting Gobstopper no not at all well I think that's kind of what this game it seems if this is gonna go to destiny way of content which means it's gonna go for years then I feel like 60 bucks is probably pretty good to start yeah if you're getting a 10 to 12 hour campaign up to 30 hours with side quests and things like that just in terms of length sounds good to me yeah that was the thing and if you haven't keeping up like when I went and got the demo at PAX and was getting shown all the bells and whistles and stuff it is very much like you're you know rheic whipping stuff do you like their their loadout screen which I frantically tried to find on games cast and I turns out I've only seen it in person uh looks like destiny oh wow it's got a banner up top it's got the purser over here grab things you drop new goals I'm not using it it's not cosmetic you drop it on and it's like doing your stacks",
            "start": 1022.06
        },
        {
            "text": "uh looks like destiny oh wow it's got a banner up top it's got the purser over here grab things you drop new goals I'm not using it it's not cosmetic you drop it on and it's like doing your stacks not changing what Iron Man looks like yeah no there's different suits 400 Manor whoever it is I feel with that and the way they described how it is played all right cool there are the solo missions that are the story missions that you go into with whatever character is being forced for the story then there are the multiplayer warzone missions I believe they're called where you jump in with whoever you want and you're leveling your characters and so it's like yeah 30-hour it's how much do you love this game on how much it's playing so if it is that it really clicks for you and you have a max level cap but I want to roll with Bruce and you're just starting I'll bring in my new Hulk or wherever I go that way yeah yeah for me this is again this is only like I would say 10 hours is probably about",
            "start": 1060.31
        },
        {
            "text": "cap but I want to roll with Bruce and you're just starting I'll bring in my new Hulk or wherever I go that way yeah yeah for me this is again this is only like I would say 10 hours is probably about I'm gonna all I'm gonna put into this if it's an open-world game it's 30 hours I'm probably not gonna do all that stuff yeah that's just not me but that said if it's set at 12 hours and then you get multiplayer and all other stuff that it's starting out with for $60 that's pretty a pretty fantastic deal especially as it's Avengers it's all these like license properties they had to pay a lot of money for obviously yeah I think my best example is destiny right now I just bought shadow keep over the weekend I know I know I'm using it as a segue I bought shadow keep and it's pay like 55 bucks for shadow keep plus all the other content that you get now but I've already bought destiny - yeah yeah a couple of times about the season pass I bought the actual original game etc etc etc and when I",
            "start": 1095.86
        },
        {
            "text": "shadow keep plus all the other content that you get now but I've already bought destiny - yeah yeah a couple of times about the season pass I bought the actual original game etc etc etc and when I when I beat shadow keep it was three maybe four hours possibly for that campaign way too short yeah it didn't wasn't satisfying way too short and I was like what if I paid $55 for this [ __ ] you gotta be kidding me and the more that I thought about the more I was like all right well I'm gonna grind it out I'm gonna end up playing a lot and there's also the raid and all this other stuff I was like I guess like I guess like they kind of got me on that one I felt a little bit like I wasn't getting my money's worth just a little bit yeah but with this game I think they're gonna give you I think they're gonna give you a lot more and they've talked about it to like you know all the heroes and the maps or whatever maybe missions or whatever I forget is for the first years free it's like they're",
            "start": 1133.57
        },
        {
            "text": "gonna give you a lot more and they've talked about it to like you know all the heroes and the maps or whatever maybe missions or whatever I forget is for the first years free it's like they're giving there is going to be additional content to it that will keep you coming back and going sure I really do they are trying to make it their games as a service from for all intense that's cool yes that's cool it'll be interesting hope it's good me too man I hope it's good yeah that's the the interesting question again I've liked it's interesting question I have like how good does it need to be you know I obviously want it to be a ten out of ten yeah I love I love Marvel I love superheroes I love the cast I love crystal on Amex games from what I played I didn't get that vibe again hard to say because sample platter let's jump between all the different characters let's do all these different things if it's a seven five if I enjoy it that much am I gonna keep coming back to it like to when they",
            "start": 1176.32
        },
        {
            "text": "sample platter let's jump between all the different characters let's do all these different things if it's a seven five if I enjoy it that much am I gonna keep coming back to it like to when they drop new content or am I going to be that invested to go and level of other characters and unlock different suits they keep showing the reason you come back to destiny every single times because the shooting mechanics because Bungie knows how to make a shooter yeah like and they know how to do it for twenty thirty years now at this point so every time you come back to destiny you can all like that if the campaign sucks or whatever you're just like you know what at least the games fun to play so fun to share things yeah it's still fun to shoot things still fun to shoot at their heads you know like that's that's great that may be and that never changes its mechanics in this game are a little rough which they seem like they may be from what I've heard and what I've seen that it might be a little",
            "start": 1216.7
        },
        {
            "text": "that's that's great that may be and that never changes its mechanics in this game are a little rough which they seem like they may be from what I've heard and what I've seen that it might be a little tougher interesting yep you played it but I'm there with you where it was it was a mixed bag well I thought cap was awesome it was super fun to play I can easily see me like when I'm going through and okay cool story movements are forcing me born if somebody wants to play with me I'll jump in with my cat I would think but like Hulk felt like the whole car I could one runner on smash and stuff you know Thor was fun but again it didn't feel as good but that's the thing where it's like does it need to it's so fun to call on funder and throw Millner Ironman didn't feel good in terms of like hovering and fighting but like I'm hoping that when it's a more open environment not just me being funneled on the bridge right Black Widow is interesting like it's one of those games I want more time with",
            "start": 1250.24
        },
        {
            "text": "and fighting but like I'm hoping that when it's a more open environment not just me being funneled on the bridge right Black Widow is interesting like it's one of those games I want more time with I want you know I really want I do want to sit down and play for a while let it alone now I can in bigan pretty cool the first thing I'm doing is in bigan to my toes Kevin now he means get larger get large oh I'm in big inning right now this number two the world's first has been hit on the new destiny raid this is Samuel Hardy over a PC gamer destiny to speedrun clan ascend have become the first players to finish garden of salvation the raid from the shooters new shadow keep expansion the ascend team made up of ante vist cyber x black monks noir hosel and pop I completed the complex a multi-part raid in 6 hours and 13 minutes which is roughly in line with the first time records for other destiny 2 raids it was a nail-biting finish they completed the garden of salvation just 2 minutes and 33",
            "start": 1288.4
        },
        {
            "text": "raid in 6 hours and 13 minutes which is roughly in line with the first time records for other destiny 2 raids it was a nail-biting finish they completed the garden of salvation just 2 minutes and 33 seconds ahead of the second place team according to the official games official Twitter that's crazy how does that feel for you like your your that's and you haven't even started right oh no no absolutely my friend Jacob he was raid ready and he went in and it was like alright 10 a.m. we're gonna do it day 1 with a bunch of like other you know destiny prep not pros but like close to pros and they rated for 12 hours on Saturday and got about halfway through and they eventually just gave up because they're just like we just can't do it anymore these guys beat it in half the time and they did it like that was a speed run there speedrun Clan yeah I know they knew how to do it so like they'd never seen this before yeah they went in blind and raids are difficult they're difficult even when you",
            "start": 1334.67
        },
        {
            "text": "like that was a speed run there speedrun Clan yeah I know they knew how to do it so like they'd never seen this before yeah they went in blind and raids are difficult they're difficult even when you know what's happening yeah yeah so I that's that is quite a feat it's really cool it's like there aren't there are many things in video games we can all rally around and be like that's really hard to do and we can all watch all at once and this is one of them yeah of course that's a Bungie we'll send them a championship belt which is pretty cool that's so cool and also they have the right to buy jackets now to buy a red jacket that says you beat it but you have to prove that you beat it ok and then eventually they sell those jackets later but she would never buy the jacket if you hadn't beaten the raid why would you ever do that Greg I want to look cool don't know that no you can't you can't do that I beat the one raid with the guy with the chalice that's cool yeah so diag where's my",
            "start": 1376.33
        },
        {
            "text": "the raid why would you ever do that Greg I want to look cool don't know that no you can't you can't do that I beat the one raid with the guy with the chalice that's cool yeah so diag where's my jacket you could buy the jackets like hundred fifty bucks but I'd look cool is the fat guy with the chalice I don't know that it's cool and I don't think the back of the chalice is if there was if he was the back logo his face all [ __ ] look I'm just saying I don't know that it's cool ok you seemed like you liked it you seemed like well I think you're wearing a brief I'm not wearing a cool jacket ok first off that's insulting right seem to patreon.com slash kind of funny games it says the raid race and destiny 2 has begun or began Saturday and after a surprisingly short 7 hours it was cleared it's surprising but such a large expansion dropped a raid that could be cleared so quickly although black armory was cleared in roughly the same amount of time as well do you think perhaps the shorter",
            "start": 1416.0
        },
        {
            "text": "surprising but such a large expansion dropped a raid that could be cleared so quickly although black armory was cleared in roughly the same amount of time as well do you think perhaps the shorter clear time was to entice the massive flow of new players joining up new light I'm personally a fan of the shorter experiences but I also missed the larger experience of Bulova 'then raid i absolutely agree with Alex I do think it was a reason to get new players in because did you install it yeah so I have installed I'm sorry playing it son steam free-to-play they put you up to the max level before I guess before shadow keeping it was 750 so they got all your players to 750 you just start and it only takes about I want to say like let's say 6 hours to get to 900 ok yeah I seem like that was way quicker than people were expected it was really really quick yeah um there's a grind after that to get yourself ready to push probably another pull into three hours or so but that's pretty fast together",
            "start": 1452.69
        },
        {
            "text": "than people were expected it was really really quick yeah um there's a grind after that to get yourself ready to push probably another pull into three hours or so but that's pretty fast together right ready in 15 hours I having played one work off classic recently and trying to get my character raid ready I was just like this is gonna take hundreds I had to give up yeah um the time with this school because you can you can do a ride with your friends in 15 hours right and the raids are the reason I mean people will disagree with me with pro destiny but the raids are the reason people play destiny okay like it's cool that's this story is really cool shooting mechanics are great yeah again but you get to combine all those things with the raids and have a great time with your friends it's really cool to all coordinate and do something with your friends in a video game that's very very rare again and I think that that's what these are for I agree with you right and I think it's interesting",
            "start": 1494.69
        },
        {
            "text": "cool to all coordinate and do something with your friends in a video game that's very very rare again and I think that that's what these are for I agree with you right and I think it's interesting because they walk a fine line where I think destiny to it launch right and you you're you're obviously a destiny superfan you can correct me if I'm not super fan but I mean I mean I know super yeah well I know that's always the thing when you say and then like yeah Fran or Andrea bust through the wall but it's that idea that like when destiny launched some the hardcore thought it might be too casual right and that was it I love that though I did - oh man I had a destiny - like I came in and played the [ __ ] out of it you know what I mean I had a great time with it but once I put it down I was done with it and I never picked it back up whereas like they're the hardcore audience wants to grind and want something to consistently work for ya putting this one in and making I mean six hours",
            "start": 1537.38
        },
        {
            "text": "was done with it and I never picked it back up whereas like they're the hardcore audience wants to grind and want something to consistently work for ya putting this one in and making I mean six hours obviously seven hours for a speedrun group yeah nothing to scoff at for like 10 to 12 exactly you talk about your friends out there and how long it took them to do right like that's it is enticing because it does make I can do that right and it was a when I did Leviathan raid which was the child stood right yeah when I did Leviathan raid like that I didn't rain it all in destiny one when I came and did it in destiny - it was that cool thing of like I set aside an entire Saturday we didn't even do it you know I remember coming to bed that night and Jen's like how was it like we played eight hours and we still didn't win and it was awesome you know I mean it is fun to sit there be like [ __ ] next time I can do better what weapon are you using okay hold on let me switch the loadout let me",
            "start": 1573.8
        },
        {
            "text": "and we still didn't win and it was awesome you know I mean it is fun to sit there be like [ __ ] next time I can do better what weapon are you using okay hold on let me switch the loadout let me change your loadout change your class like the it's really really cool I don't think that that's I don't know what that's the thing that exists in most video games right now where'd you get somebody you get six people together other than raids again and we're in Warcraft that's the only thing I can any MMO like lads rates already 250 people and they do it for eight hours that's neat yeah that's really that's what humans do best they get together and work on things right I so I'm really glad that they made it more casual destiny to that's what got me in yeah and this most recent time since I have been streaming more like obviously full time now it gave me a reason to play destiny before I couldn't I couldn't leverage the time of you know having a normal day job and other stuff and like",
            "start": 1613.79
        },
        {
            "text": "I have been streaming more like obviously full time now it gave me a reason to play destiny before I couldn't I couldn't leverage the time of you know having a normal day job and other stuff and like obviously having a girlfriend and I couldn't be like all right well I'm gonna sit down and do 12 hours of destiny to get myself to the raid now I can and it's super exciting it's your job now it's my job now which made it really really cool is that all you've been streaming them this week no no I streaming other stuff too but I kept wanting to go back yeah I could only go back to destiny and I felt bad because I had played so much of it already yeah it's like I can't keep playing doesn't yeah so I eventually just played a little bit on my own like off stream but I don't know it just it's exciting it's exciting to get your friends together and do this yeah so now wait wait see earlier on we were talking about shadow keep you seemed you you started off sour on it the shadow keep story sucks",
            "start": 1649.37
        },
        {
            "text": "it's exciting to get your friends together and do this yeah so now wait wait see earlier on we were talking about shadow keep you seemed you you started off sour on it the shadow keep story sucks sorry it's out how you feel the shadow give them the one capital III already what do I get oh there we go where am I look look at that one the shadow keep story is not good I'm sorry forsaken did you play for a second and I know for a second was awesome forsaken was a like beginning to end story took like six hours maybe a little more it was rad it had Kade it was like they had a bunch of different bosses you knew her you were going you knew what the point of the whole story was shadow keep ends with a just a like a wet fart it's nothing and well all the Destiny's superfans right now and Chad I'm sure saying there's more Lulu there's more coming loose people time how's that what they're saying Kevin oh you're not even watching check if I was watching Chatham's for the Polish podcast here we",
            "start": 1688.28
        },
        {
            "text": "sure saying there's more Lulu there's more coming loose people time how's that what they're saying Kevin oh you're not even watching check if I was watching Chatham's for the Polish podcast here we don't look at chat oh don't worry well either way that's what they're saying and said it to me a couple times already in my chat and and I understand what they're saying however there is no story right now so if Greg got on I want to play shadow key let's say Greg casual Greg that's me didn't wanted to get on dusty too and he was like hey you know what I'm gonna play shadow keep just because I wanna check out the story and he plays through it and then it ends and nothing happens he goes what was that for yeah you never come back to it well they're doing it in a weird frame was trying to blame this on the game's cast and as usual just framed it up and it took 30 minutes and no one understood anything they're doing it in like four parts right like you paid for it and you get it in the",
            "start": 1733.68
        },
        {
            "text": "blame this on the game's cast and as usual just framed it up and it took 30 minutes and no one understood anything they're doing it in like four parts right like you paid for it and you get it in the different chunks no yeah and the reason they're doing that is because of development cycle which is totally fine with me Bungie you know take your time obviously but again if you're like Greg who just wants to go in and play it for a few hours and then finish the story if it ends and your girl that was stupid you're not gonna come back in a month right and be like alright fire up the shadow keep thing because I remember the story like you don't really remember any of it yeah but I remember the guns you don't remember the guns and the yeah you remember the shooting but you won't remember shadow key I'm excited to play the rest of the story but that's apparently months away I don't know that that's exactly the right way to do it I get it from my development cycle standpoint I understand",
            "start": 1776.31
        },
        {
            "text": "key I'm excited to play the rest of the story but that's apparently months away I don't know that that's exactly the right way to do it I get it from my development cycle standpoint I understand however I don't know that that's the right way to get the casual people in like Greg why don't you see that's the thing is I just don't think it's interesting again we're talking about like the six hours and acting like that's casual because it isn't it's not speedrunners it's not understand it's gonna be longer it's also the fact that I think they've moved away from trying to cater to me because they found I think with the launch of it that they understand a player like me will play the game roll the credits platinum the game and put it down and not feel enticed to pick it back up yeah they understand I think of the you know now that they're away from Activision and the partners did this with Activision we couldn't say it they're calling it an MMO right they're calling they're leaning into",
            "start": 1811.38
        },
        {
            "text": "I think of the you know now that they're away from Activision and the partners did this with Activision we couldn't say it they're calling it an MMO right they're calling they're leaning into the grind they're leaning into keeping you around day after day whereas with me it's like and granted I'm a special case to some extent but I actually think I probably represent a lot of the listeners out there of I'm playing the latest and greatest next best thing right I want to finish a game so that I can get to the next game right there's so many games to play right now it's hard to sit there and invest you know your life into a game like that I'm not gonna come back to destiny for four months like until they update the story or they until I give us another raid or whatever so like I'll play I'll beat the raid and then it'll be just like it was before with me which is I would come back every three or four months or so yeah I don't think they want that I think they want you there every other",
            "start": 1847.32
        },
        {
            "text": "beat the raid and then it'll be just like it was before with me which is I would come back every three or four months or so yeah I don't think they want that I think they want you there every other day totally or maybe even once a week like yeah well no yeah I'm like doing the things over and over and then they're for spending money in the game right that's that's how you that's how they get people to spend money in their game is that they come back over and over well if I'm doing that in the months category not the weeks category of the days that I'm spending less money and that's not good for Bungie exactly I'm just trying to help them I know they need a lot of help I'm trying to help them when you're in this weird pumpkin suit it's just number three a sad one former Nintendo lawyer and Kirby namesake John Kirby has died this is James Bachelor games industry top is John Kirby former lawyer for Nintendo has died the New York Times reports he passed away last Wednesday following",
            "start": 1881.41
        },
        {
            "text": "and Kirby namesake John Kirby has died this is James Bachelor games industry top is John Kirby former lawyer for Nintendo has died the New York Times reports he passed away last Wednesday following complications with a form of blood cancer he was 79 years old Kirby was best known to the games industry for his work with Nintendo most notably defending the platform holder against a trademark and copyright infringement suit from Universal City Studios Universal claim Nintendo's Donkey Kong character infringed on its trademark for King Kong the judge ruled that there was no possibility for confusion and that Universal had no right to King Kong its characters or its story since the studio itself had argued these were public domain when it first made the movie Mario creator Shigeru Miyamoto named a new character Kirby and John Kirby's honor while the company was gifted while the company gifted him a sailboat named the Donkey Kong Kirby continued represent Nintendo for several years as well",
            "start": 1920.77
        },
        {
            "text": "a new character Kirby and John Kirby's honor while the company was gifted while the company gifted him a sailboat named the Donkey Kong Kirby continued represent Nintendo for several years as well as other high-profile clients such as Pepsi and America online during the 1960's he worked at the Department of Justice assisting at the head of the Civil Rights Division he is survived by his wife Susan Coleman two sons two daughters three grandchildren two brothers two sisters and many nieces and nephews Oh so of course it's one of those like obviously anytime we talk about a death in the industry sad right but what a life that's all really I hope that 79 I have that many people and I've this cool of an impact and I had a boat called the Donkey Kong yeah he was survived by his huge family sounds so nice exactly so it sounds like a great guy exactly I didn't know him but he sounds like you know I'm sure somebody out there is like John Kirby oh yeah Universal number for a Pokemon stream all",
            "start": 1959.1
        },
        {
            "text": "so nice exactly so it sounds like a great guy exactly I didn't know him but he sounds like you know I'm sure somebody out there is like John Kirby oh yeah Universal number for a Pokemon stream all but confirms gallery' and ponyta ponytail yeah Kevin over at GameSpot has this report Pokemon sort of shields animal cam style 24 hour live stream turned out to be a largely uneventful thing but it did give us our first glimpse at another new gen 8 Pokemon a mysterious monster was teased throughout the entire broadcast but only toward the end do we get a clear look at the new pokemon and it appears to be a gallery inform of Ponyta as you can most of Ponyta however its Mane appears to be made out of purple clouds rather than fire and it has a small horn atop its head much like a unicorn which seems to suggest its fairy type while the Pokemon company has yet to outright confirm the new Pokemon is indeed a galore exclusive variants of ponyta bonitas cry could be heard during the stream lending",
            "start": 2001.2
        },
        {
            "text": "to suggest its fairy type while the Pokemon company has yet to outright confirm the new Pokemon is indeed a galore exclusive variants of ponyta bonitas cry could be heard during the stream lending credence to the theory after the stream ended Sonia Professor this is all Pokemon lore Greg read it read it out loud it said she'll quote collect everyone's reports and create a summary for her grant suit for her grand soon so we'll likely get official confirmation sometime this week this was a this was the thing that I think autumn I saw it on an autumn Stein line she was browsing through Twitter or whatever was and I saw what looked like a Pokemon on her screen and I was like what's that she was like that's a glaring and Ponyta oh and I went what because I know what Ponyta is and I was like what's gallery' and I didn't know what that was because I'm again not bullying it's a region of Pokemon I'm not fully into Pokemon but I I like is it there you go I was just a funny Kevin thing that's",
            "start": 2057.06
        },
        {
            "text": "gallery' and I didn't know what that was because I'm again not bullying it's a region of Pokemon I'm not fully into Pokemon but I I like is it there you go I was just a funny Kevin thing that's real America and and then she was like yeah at least somebody's driving on the other side of the road there yeah a Pokemon on the other side of it and she said she was like yeah they saw it on this bike 24-hour Pokemon livestream animal camp yeah I was like all these things I had no idea she was really excited about it yeah so and it sounds like it's very tight which is pretty cool yeah it's pretty cool okay I'll take it yeah ah Bruce I'm excited to see what else is gonna happen with these Pokemon and where they're gonna go I mean but it's just stick with me it's just that's so sad I know it's a segue but I don't know that's so far away okay if I wanted something more immediate say what came to the mom and grop shops where would I go you would go to kind of funny games it's the official list of",
            "start": 2101.79
        },
        {
            "text": "but I don't know that's so far away okay if I wanted something more immediate say what came to the mom and grop shops where would I go you would go to kind of funny games it's the official list of everything you go to the official list of upcoming software across each and every platform as listed by the kind of funny games daily show hosts each and every weekday today junior league sports on switch crazy mini golf arcade on switch legendary gun on PC infect us on PC the void of desires on PC spirit abyss on PC hexa trains on PC nightmares trip PC and Mac Space Robinson hardcore roguelike action PC Night Lights PC and then apple arcade still dropped for games last night this is Zack over katana who writes surprise last night Apple added four new games to the Apple arcade service including the new game pilgrims from the matchin areum developer Amanda to design and the early release of the Brad well conspiracy it seems pilgrim was a complete surprise being announced and released all at",
            "start": 2145.5
        },
        {
            "text": "the new game pilgrims from the matchin areum developer Amanda to design and the early release of the Brad well conspiracy it seems pilgrim was a complete surprise being announced and released all at once it it it's described as a playful adventure game where players will have to explore and meet new characters helping them and learning about their stories the art style looks lovely Pilgrim's is also available now in PC the Brad Wall conspiracy is a first-person puzzle game with a big focus on telling a story following a large explosion at the Stonehenge Museum you are trapped underground in a secret complex you have to unravel the secrets of this complex and escape with the help of another survivor this game was planned a release on October 8th but was released a little early on Apple arcade it will still be released in a few days on ps4 Xbox one PC and switch readout space of salt is a dog fighting game featuring cool-looking spaceships the game has a full career mode and ship",
            "start": 2203.22
        },
        {
            "text": "arcade it will still be released in a few days on ps4 Xbox one PC and switch readout space of salt is a dog fighting game featuring cool-looking spaceships the game has a full career mode and ship upgrades and various ways to control your Starfighter you can kill the engines to slow your speed making the easier to navigate a small opening readout space salt is also coming to PC though no release date has been listed on Steam finally nightmare farm is a new game from the developers behind Neko at Sumi Kitty collector nightmare farm is described as the story of a painful nightmare spinning in a bright world not entirely sure what that means but players will have to grow and harvest crops while also preparing meals for visitors to keep them happy is that like farmville but nightmare it's not yeah I don't it sounds I don't understand where the nightmares are going right because I'm just making if I'm harvesting crops and preparing meals that doesn't sound horrific but eventually something",
            "start": 2241.62
        },
        {
            "text": "yeah I don't it sounds I don't understand where the nightmares are going right because I'm just making if I'm harvesting crops and preparing meals that doesn't sound horrific but eventually something bad like that at all that's this is all Apple arcade all Apple arcade okay you don't have an idea of iOS how do you feel how do you feel about that I don't care at all you're missing on good games man no I'm not yeah I don't give a grindstone you can be playing grindstone right now whoo Cappy Cappy game bro what are you talking about you're a monster I don't care at all what what yeah blues been out for a while does he have an iPhone no he sucks no he's got an iPad though right yeah you put Apple arcade on and I it's a good point yeah I don't need any games on my phone I just play on the PC or an Xbox see like the Xbox I have no quarrel with it's the PC that's where I go that's where you get me what's wrong with oh my god my extensions update this [ __ ] why the framerate bad well maybe",
            "start": 2283.88
        },
        {
            "text": "or an Xbox see like the Xbox I have no quarrel with it's the PC that's where I go that's where you get me what's wrong with oh my god my extensions update this [ __ ] why the framerate bad well maybe it's your video oh man the hard drives are getting they're getting corrupted it sucks exactly this going to you guys hey what's your discord username BOTS game over Greggy hashtag 912 7000 teach you how to use discord all you cool you mean now there's a bunch of [ __ ] different using groups you guys are Jeavons discord a powerful program you don't know what you're doing yeah I love the game store new date Korea new dates for you GameSpot's oscar deus reports bethesda has announced a fallout leg has announced fallout legacy a bundle compiling the definitive editions of all the mainline fallout games the only catch is that it's coming to the UK in Germany only legacy contains fallout Fallout 2 Fallout Tactics fallout 3 Game of the Year Edition Fallout New Vegas Ultimate Edition and fallout",
            "start": 2334.04
        },
        {
            "text": "games the only catch is that it's coming to the UK in Germany only legacy contains fallout Fallout 2 Fallout Tactics fallout 3 Game of the Year Edition Fallout New Vegas Ultimate Edition and fallout 4 game of the year edition one notable exclusion however is the most recent game of the series fall at somebody's sake there's a reason the pc only collection launches on october 25th but bethesda did not offer any explanation as to why it's only coming to UK in germany up next PlayStation 4 system update 7 is coming out this week world 8 you can now have up to you you're going from 8 to 16 max users in a party it's but why because more people need to they you don't understand discord right you want it easy on your system they're doing it for you cab that'll also include accessibility support with the chat transcription has been added in the US only there's more for a party but that's the big stuff then remote play is getting an update to this will mainly how about Android people like",
            "start": 2383.21
        },
        {
            "text": "with the chat transcription has been added in the US only there's more for a party but that's the big stuff then remote play is getting an update to this will mainly how about Android people like Bruce for those who want to stream select ps4 games on mobile devices remote play can now be used on smartphones and tablets running Android 5.0 or higher remote play is actually really great I usually yeah yeah now that it they remember again being an iOS person yeah they released it for the phone and for the iPad but they didn't have controller support now they do I use it in the hotel and I was playing a game and I was actually shocked no it all crashed it was like oh it's this thing no it's actually my internet just [ __ ] the bed at home I can't blame remote play for that I'm excited to do more tests on shitty old hotel Internet where it was running well oh all right cool I was very surprised um Trevor saves the universe is getting important cosmic jobs DLC I think it might be cosmic",
            "start": 2424.94
        },
        {
            "text": "more tests on shitty old hotel Internet where it was running well oh all right cool I was very surprised um Trevor saves the universe is getting important cosmic jobs DLC I think it might be cosmic jobs but I don't you know is shortened it up Trevor saves universe is getting freedom our dune see is launching October 10th on Steam IGN's Tom Marx reports Monster Hunter World ice-born crossover will address evil two characters next month similar previous events it appears like players will able to make their hunters look like Leon Kennedy or Claire Redfield and even dress like the handler up oh no even dressed the handler up as the imposing tyrant then if you're a Harry Potter wizards unite fans oh oh man I used to be did you I played it a ton that was the only mobile game I played well dark art dark arts month is a back to get you it's throughout October players all around the world will have to work together to protect the Wizarding World from the most sinister forces and ancient evils",
            "start": 2464.24
        },
        {
            "text": "art dark arts month is a back to get you it's throughout October players all around the world will have to work together to protect the Wizarding World from the most sinister forces and ancient evils slithering in the dark you can do the fighting forces brilliant event part 1 October 8th through the 14th October community at community day is October 19th there's another part to the event is October 22nd to 28th and then there's an exclusive Halloween quest I have so many thoughts about the museum just it's it's so it's such a bummer because I love do you look do you love Harry Potter yeah I enjoy her you enjoy it yeah alright I like when they they just did Harry Potter in review where they watched all the movies and ranked yeah and they're like do want to be on a Greg and I was like no oh I really like you really don't know I like my Potter I don't feel like watching three hours of Harry Potter every Sunday what do you say Kevin well I don't think he's a phony just say it sounds like",
            "start": 2506.03
        },
        {
            "text": "I really like you really don't know I like my Potter I don't feel like watching three hours of Harry Potter every Sunday what do you say Kevin well I don't think he's a phony just say it sounds like he just likes it I do it exactly I love it I've read all the books seen all the movies obviously tons of time seem to play it no but I read it okay I read the play well I'm gonna see in December you shouldn't you should come I would love to come I mean we already bought tickets months ago so hopefully somebody like you [ __ ] invite somebody will break up before then and then they won't we won't go it'll be I'll dice roll fine so two couples have to break up though cuz I need to take it for autumn too okay either way I was really excited about this game cuz I was like oh my gosh Pokemon go I loved Pokemon go and it's the same developers right and it's the same concept exactly the same can't wait got into it I played probably hundreds of hours of this slap wizard a night it's not good it's",
            "start": 2542.93
        },
        {
            "text": "Pokemon go and it's the same developers right and it's the same concept exactly the same can't wait got into it I played probably hundreds of hours of this slap wizard a night it's not good it's not it's not it's not a good game you don't like a disenchanting a wardrobe or whatever the [ __ ] they call the entire thing is you're basically doing magic like garbage Cleanup is what that's really all it is you're just going around like cleaning up garbage then it's like oh whoops there's a troll over there yeah you gotta you got to get rid of them so you get rid of them and it unfortunately you have to cast a hundred times and you lose your energy and the unit like the DLC in the currency instead on the currency and the micro transactions are offensive I didn't spend any money on it but I've again played hundreds of hours of it and the only reason I like the game is cuz I got to see new it well not new I guess old Harry Potter characters in a different format and I got to walk around",
            "start": 2583.13
        },
        {
            "text": "again played hundreds of hours of it and the only reason I like the game is cuz I got to see new it well not new I guess old Harry Potter characters in a different format and I got to walk around which is nice you get to know you walk you get some exercise yeah but these community days are just worthless excuse Pokemon go community days are awesome yeah no they didn't they've improved well Pokemon go took years to get good of course so I'm hoping this game will we'll get we'll get good and I wanted to be in on the ground floor because I wanted to get good at as the game got better yeah but it's just not good and I just can't bring myself to play it like even today I was like gonna like I was like I'll fire up and played in a few weeks and I'm just like yeah just look at the news stare at the window this car think about my life or something other than this it's a real bummer though because I love Harry Potter so much and I just didn't want them to do its do it so bad do it dirty and",
            "start": 2625.85
        },
        {
            "text": "the window this car think about my life or something other than this it's a real bummer though because I love Harry Potter so much and I just didn't want them to do its do it so bad do it dirty and they did that sucks it'll get there it'll get there final new day for you Ironman psvr has been delayed it's now February 28th 2020 Josh Keaton is voicing Ironman himself there oh and I call it a delay I know people it's like they said 20 20 20 19 when they announced it the fact that it's not as an official delay getting to a very crowded month which we'll get to in a second because it is our first reader mail question of course you can submit your reader mail patreon.com slash kind of funny games where you get the show ad free and speaking of ads Gregg way this episode kind of funny games daily is brought to you by hims have you noticed a me and Knicks hair looking better of course you had happy yeah and that's because they use hymns that's cool yeah real know they they notice their hair",
            "start": 2665.44
        },
        {
            "text": "is brought to you by hims have you noticed a me and Knicks hair looking better of course you had happy yeah and that's because they use hymns that's cool yeah real know they they notice their hair was thinning and they went to four hymns calm like I'm gonna tell you to go in a second and they got there and they did all the things and they clicked all the boxes and the doctor talked to him and they were like this is what you should use and then he started getting the gummies and then Nick started stealing Andy's gummies and then it became a joke on the shows and then Andy was like I am not joking stop stealing my gum why do you guys turn to weird solutions or do nothing when they can turn to medicine and science for hams calm is a one-stop shop for hair loss skin care sexual wellness for men thanks to science baldness can be optional Hamzah's helping guys be the best version of themselves with licensed physicians and fda-approved products to help treat hair loss these aren't snake oil",
            "start": 2710.32
        },
        {
            "text": "thanks to science baldness can be optional Hamzah's helping guys be the best version of themselves with licensed physicians and fda-approved products to help treat hair loss these aren't snake oil pills or gas station counter supplements these are prescription solutions backed by science Heyman's was created by a guy who knows there's some men's health conversations that are easier online than in person so no more awkward in-person doctor visits or long pharmacy lines for hims connects you with real doctors online which could save you hours it's completely confidential and discreet you answer a few questions a doctor will review it and if they determine it's right for you they can prescribe you medication to treat hair loss that is shipped directly to your door order now my listeners can get started with the hims complete hair kit for just $5 today right now while supplies last and subject to a doctor's approval see the website for full details and safety information this could cost",
            "start": 2747.13
        },
        {
            "text": "get started with the hims complete hair kit for just $5 today right now while supplies last and subject to a doctor's approval see the website for full details and safety information this could cost hundreds if you went to a doctor or pharmacy somewhere else go to for hems comm slash games daily that's fo r hims com games daily for hims calm slash games daily up next is quit you already know it ladies and gentlemen everyone it kind of funny is using quip it's because it's the best toothbrush out there right Kevin yeah but what actually makes a better toothbrush industrial strength power claims of miraculous trendy ingredients multiple modes if you ask a dentist they'll say it's less about the brush and more about how you use it that's why I quit was created by dentists and product designers to focus on what actually matters to your oral health healthier habits quips sensitive vibrations with the built-in timer guy gentle brushing for the dentist recommended two minutes with thirty",
            "start": 2782.02
        },
        {
            "text": "to focus on what actually matters to your oral health healthier habits quips sensitive vibrations with the built-in timer guy gentle brushing for the dentist recommended two minutes with thirty second pulses ensuring and even clean quip automatically delivers brush heads every three months for clean new bristles right on schedule the sleek intuitive design is simple to use and comes with a travel cap that doubles as a mirror mount these thoughtful features make brushing something you actually want to do twice a day good habits matter to a healthier lifestyle so help with the form of fresh oral health habits with clip equip starts are just twenty-five dollars and you'll get your first refill pack free and get quip comm slash games this is a simple way to support the show and start brushing better but you have to go to get qu IP comm slash games to get your first refill pack for free right now get quick comm games that's a great URL it is clip comm slash games how can you forget me you",
            "start": 2821.38
        },
        {
            "text": "better but you have to go to get qu IP comm slash games to get your first refill pack for free right now get quick comm games that's a great URL it is clip comm slash games how can you forget me you nailed it thank you very much that means a lot coming from you frankfurter wrote in to patreon.com slash kinda funny games just like you Canon says good morning Greg and Bruce Iron Man VR got pushed to February 2020 which is releasing near a bunch of indie titles such as The Last of Us part two Final Fantasy 7 remake and watchdog legions is this title doomed should Sony have waited the PS 5 or whatever they will call it should be out next year and alongside it a new version of the VR headset if Sony was gonna push a game why not make it a launch title and make sure it's polished I'm confused as to why they did this but there has to be a reason right uh I mean I think I can tell you why it's not gonna be a launch title for the PS 5 why is it because I don't know if they have that much",
            "start": 2859.18
        },
        {
            "text": "as to why they did this but there has to be a reason right uh I mean I think I can tell you why it's not gonna be a launch title for the PS 5 why is it because I don't know if they have that much confidence in it maybe are they good plenty here's my thing about it or I I do think you'll get a PlayStation VR - obviously I do not think you're gonna get it side by side the PlayStation 5 because everybody everything everybody wants the sticker price down oh you're so right no you're right I don't want to launch a console and they be like hey give us $500 600 ollars for this console and then also 400 ollars for a new VR headset like that's that sticker shock nobody'll do it I think they're confident in this I think the timing doesn't matter because the PlayStation VR audience is rabid and has a great attachment and I think for something like Ironman VR from camouflage to I don't know if you're familiar with the studio the friends of the show but like they did république was great Ryan",
            "start": 2903.46
        },
        {
            "text": "has a great attachment and I think for something like Ironman VR from camouflage to I don't know if you're familiar with the studio the friends of the show but like they did république was great Ryan Payton's been all over this game and from what I've played of it it's [ __ ] awesome oh great so I think of it when it drops in February even though it's gonna stiff competition around it I think it's such a different experience then Last of Us then a Final Fantasy and then a watchdogs that you'll be like I'll get one of those and the other one or wait for it to be on sale or whatever like that but I think they're confident enough in the PlayStation VR audience that they're gonna buy it because they're not desperate for content but hungry for it especially really great triple-a content which from my one demo of this game is what it seems to be how well do these psvr titles sell better than they expect I think and that's the other thing to worry I don't think you have to wait for you know",
            "start": 2944.35
        },
        {
            "text": "from my one demo of this game is what it seems to be how well do these psvr titles sell better than they expect I think and that's the other thing to worry I don't think you have to wait for you know it's easy to sit here and granted PlayStation 5 has already been confirmed to work with PlayStation VR Gen 1 right now even if you were to say oh let's wait and make a big impact and put it out with the PlayStation 5 and if they were launching a PlayStation VR 2 at that time you don't need to because there's already a great install base you know I mean there's already there they already sold more VR headsets and they thought they were going to sell the fact that they continue to support it the fact that this deal you know offer this exclusive came around so late in the lifecycle of PlayStation VR along with you know no man's sky VR on all these different things I think they still believe in and they still see a lot in it so I don't think you have to worry about the success of it well Greg",
            "start": 2981.13
        },
        {
            "text": "VR along with you know no man's sky VR on all these different things I think they still believe in and they still see a lot in it so I don't think you have to worry about the success of it well Greg I can safely say you know more about this than I do thank you so I'm going to say Greg has refuted what I said earlier way to go turns out you know they're not getting more VR over on that xbox or pc quest is Austin - uh one-night-stand just released uh Nintendo switch which is a game I first saw during the kind of funny game showcase I was just wondering if any one kind of funniest played it yet and if so what you thought of it it seems like a Greg Miller ass game for sure and I'd love to hear some spoiler-free impressions before I take the dive Mitchell you are 100% correct you saw one night staying at kind of games showcase second edition and I'll tell you what I did not get anything about a code nor did I see it on any list oh so that's bad right Greg Miller didn't get a code no I'm",
            "start": 3017.58
        },
        {
            "text": "staying at kind of games showcase second edition and I'll tell you what I did not get anything about a code nor did I see it on any list oh so that's bad right Greg Miller didn't get a code no I'm this isn't me saying like Oh what was me this is me saying that's bad marketing right there oh god this is as you know everybody who's on the showcase usually is an indie dev they're usually learning as they go I thought one night stain looked awesome when it got the trailer during the showcase I will definitely be picking it up and I will get you impression translation this quick smile send this man a code no don't I'm sayin I stand I will by myself you don't worry I don't say no send him a code he'll buy it tonight you got to wait and see if it's actually good because I don't know I can't tell you that part you know I mean I don't wanna get out there now we've been talking about the PCs the VR is the future text what gets Bruce green and bigand the five star man right Santa patreon.com",
            "start": 3064.59
        },
        {
            "text": "you that part you know I mean I don't wanna get out there now we've been talking about the PCs the VR is the future text what gets Bruce green and bigand the five star man right Santa patreon.com slash kind of funny games that says hey Greg Ambrose I have two questions regarding Google Stadium Bruce what do you think of Google Stadium and the potential of games is a medium moving forward in the streaming future Greg when is your best guess as to when we will find out the official launch date for stadia or at the very least when the founders will be available to claim their names I'm so excited for Bruce to be here kind of funny and best of luck in striking out on your own the five star me that's so nice of the five star man it's a very nice man that's why you got five stars that's that's that's very nice um but the potential games as a medium moving towards the streaming future for Google stadia I think Google stadia is where games are going I do I really think it's this to me it it",
            "start": 3104.61
        },
        {
            "text": "that's very nice um but the potential games as a medium moving towards the streaming future for Google stadia I think Google stadia is where games are going I do I really think it's this to me it it smacks of what happened with Netflix when Netflix first came out streaming eruption three movies yeah everyone's like this is stupid they're only streaming three movies dumb no one will buy it and then all of a sudden it became that's all anybody ever does now yeah so I think we're far away from it I think we're probably 10 to 15 years away from games being streaming all the time yeah and Google's just trying to get out of it so I don't know if it'll pick up any steam until two or three years from now grateful but but I think it will and I think eventually we'll be playing all of our single player game campaigns this way I think we'll just be streaming them it'll be way easier that way multiplayer games a little different yeah although I talked to Phil Harrison at YouTube and we talked",
            "start": 3142.68
        },
        {
            "text": "player game campaigns this way I think we'll just be streaming them it'll be way easier that way multiplayer games a little different yeah although I talked to Phil Harrison at YouTube and we talked about Google stadia directly and I was like multiplayer games and he said he said theoretically multiplayer games should be better because all the servers should be closer so your ping should actually be better than if you were just sitting at home like in the middle of Ohio or whatever yeah and you're having to ping somewhere in San Frisco instead you're now just streaming to a server that's right next to the other multiplayer server everybody's right there on it right yeah proposed ibly the ping will be better that's what he told me he said we had Jack be sure and we've cool friends two weeks ago yeah and he said the same thing yeah yeah like theoretically this is how it's supposed to work now I don't necessarily believe the theoretically part of it when they say theoretically I'm like I",
            "start": 3185.88
        },
        {
            "text": "ago yeah and he said the same thing yeah yeah like theoretically this is how it's supposed to work now I don't necessarily believe the theoretically part of it when they say theoretically I'm like I don't know what they practice this a lot yeah um or maybe they have but only from you know major cities yeah yeah yeah how's this gonna work in it in Ohio right so I'm kind of waiting for that money for the actual use case but once we get through all the speed bumps so like waited with Netflix yeah I think we're gonna be doing this a lot yeah here's my question for you do you think Google you said you know two or three years we're gonna be a different spot do you think Google is committed enough to get there in two or three years are they gonna bounce out of it eventually gosh that's a really good question like Xbox and a project X cloud I'm so on board they can't wait and I'm doing wrong I'm a founder on stadia as well I can't wait as well I have no doubt that in two three years Microsoft",
            "start": 3226.8
        },
        {
            "text": "question like Xbox and a project X cloud I'm so on board they can't wait and I'm doing wrong I'm a founder on stadia as well I can't wait as well I have no doubt that in two three years Microsoft will still be doing this and Google it's always that thing of and I you know I asked Jack and he's like I wouldn't I wouldn't have left PlayStation I wouldn't be here right now if I didn't believe in them and their commitment to it so I believe in Jack so I believe in it that way but it's also if I was betting man right who's gonna fall out of it it would be Google it would be Google right because they just started yeah but I think well yeah you know what I kind of agree I agree with you um I think if anybody's gonna fall out what's gonna be Google Microsoft's gonna stick around obviously cuz they made the partnership with Sony yeah Microsoft and Sony are getting together on this basically versus Amazon on Google cuz Amazon you know Amazon Web Services and Google's got they own the Internet",
            "start": 3263.64
        },
        {
            "text": "made the partnership with Sony yeah Microsoft and Sony are getting together on this basically versus Amazon on Google cuz Amazon you know Amazon Web Services and Google's got they own the Internet at this point so I think it's gonna be a three-way competition and the first people will drop that are gonna be Google I think and Amazon's gonna pick up probably where Google left off if they leave yeah yeah I hope they don't like I'm with you no I don't think that I mean like I the thing is if anybody does it'll be Google but we'll know we'll know how it sells yeah after it's you know for a year if they if they want to keep backing it up they may just put it on the back burner and like let it let it live there for a while and then eventually once game streaming becomes a big deal Google will get back into it yeah they've got the backbone yeah totally they've gotten all that stuff already so all I need to do is turn it on and then your question five star man of a window I think we'll find",
            "start": 3296.49
        },
        {
            "text": "get back into it yeah they've got the backbone yeah totally they've gotten all that stuff already so all I need to do is turn it on and then your question five star man of a window I think we'll find out the release say that is a great question cuz yeah we still know November is what they said Jacqueline and budge on we have cool friends and October is a running clock right now I think you have to know before the end of October I don't think we get to November we saw so I would predict that we get another state i I don't I think you get one more stadia direct and I would think probably that last week of October the week of the 28th early probably like the twenty nine thirty if I would do a Google direct they're saying that guess what it's gonna come I'm pretty clear release date I'm gonna say I probably the release date thing I'm gonna say you're gonna 29 through 30th is when you get to direct and then I would think you get the is the actual launch of stadia the week of the 11th of",
            "start": 3337.38
        },
        {
            "text": "say I probably the release date thing I'm gonna say you're gonna 29 through 30th is when you get to direct and then I would think you get the is the actual launch of stadia the week of the 11th of November do you think they're actually gonna get it out November I do all right yeah I think they can't have that egg on their face especially for like their first like thing they've done yeah their first like big like money's invested in it now right yeah like xbox of course you know this month is doing the beta for X cloud yeah yeah you could get into and it's like they they're they're beating them to market technically right and it will be hey this is how it's running and it's either gonna be really good or really bad or you know people gonna have impressions based on that if they really said Oh November it's going to be not featureless but it'll be like very oh it's gonna be bare bones it's super and everyone's dough and again it's gonna be like the Netflix thing where everyone's like",
            "start": 3377.16
        },
        {
            "text": "Oh November it's going to be not featureless but it'll be like very oh it's gonna be bare bones it's super and everyone's dough and again it's gonna be like the Netflix thing where everyone's like this is so stupid they only have three games you can play yeah it'll eventually get there my thought on that and it's you know tired comparison but I wonder in that if that moves dumb is just gonna be the people on Twitter and then who's it gonna be the people who bought it I'm I gave them my money for I want the controllers sure whatever and then I want my name more than anything and I believe in the technology I like this I want this to happen yeah I'm I'm totally expecting to get it plug in my Chrome cast in the TV for the first time screw around hit one night and then put it down until 2020 win right something I want drops day and data there that's cuz it like I've talked about already like I don't I can't imagine platinum a cyberpunk so if cyberpunk was to be day and date which I do not",
            "start": 3413.58
        },
        {
            "text": "right something I want drops day and data there that's cuz it like I've talked about already like I don't I can't imagine platinum a cyberpunk so if cyberpunk was to be day and date which I do not believe it is a with stadia I would play it on stadia if stadia works and is great and everything's awesome have you played it cyberpunk no no no stadia oh yeah yeah yeah yeah I was at that Google the YouTube lofting you were at that one and it worked fine yeah it worked fine I was like cool yeah exactly it wasn't it actually wasn't bad the lag wasn't bad but again I was playing for Los Angeles yeah I don't know who knows yeah we'll see a lot of questions ladies and gentlemen but we'll get them answered as we get closer and closer November Bruce it's time to squad up this is where one of the people right into patreon.com slash kind of funny games give me their name username platform of choice and why they need help in a video game I read here the best friends come and find you and everybody",
            "start": 3456.09
        },
        {
            "text": "right into patreon.com slash kind of funny games give me their name username platform of choice and why they need help in a video game I read here the best friends come and find you and everybody plays games together today Anthony means help on PlayStation 4 Anthony's username is Timmy underscore Darko dar ko he says please shoo let me change my name without potentially screwing up a bunch of stuff Anthony just do it what are you still playing from the ps3 era nothing who cares let's let it go change it Timmy underscore Darko get the [ __ ] out it by with the launch of destiny shadow keep I'm finally looking to platinum destiny to once and for all I've never done the original raid and I would really love to be carried through the raid and the prestige raid so I can get those two trophies that have eluded me I know five other players is a lot to ask but I really would appreciate getting help with this I'm in the UK but would love to or would play whatever time I could to get the squad",
            "start": 3495.09
        },
        {
            "text": "that have eluded me I know five other players is a lot to ask but I really would appreciate getting help with this I'm in the UK but would love to or would play whatever time I could to get the squad together thanks anything on the PlayStation 4 Timmy underscore Darko remember you it's the prestige prestige rate and I've done this in a while prestige raid or a nightfall mission III I did a prestige nightfall to get that the night falls a lot easier a lot easier fewer people you have to worry as much about him time to check in on you were wrong Bruce we asked people watching live on twitch.tv slash kind of funny games to go to kind of funny calm slash you're wrong alright and tell us what we screw up as we screw whatever that's great I loves what we do here you know anyway when we started a Polish podcast so it's all gonna be a kebab says Bruce you're wrong PlayStation 4 is UI is great if Bruce wants bad UI you should pick up a Vita 100% sure let me guess Jane are you there you listed",
            "start": 3532.38
        },
        {
            "text": "a Polish podcast so it's all gonna be a kebab says Bruce you're wrong PlayStation 4 is UI is great if Bruce wants bad UI you should pick up a Vita 100% sure let me guess Jane are you there you listed the kind of funny all the time and you watch all their stuff because they all they do is talk about PlayStation let me guess that good taste kebab is also chimes and it's a journey did cost $14.99 at launch Greg was right um Alex Ross points out to eventually raid runs become so optimized you can easily clear the content within an hour for destiny right I mean that that's really hard to do it like I I cleared a few raids in like let's say three hours yeah but even then I still had only done it a couple of times so it was like why not when hours really that's fast no that's really fast [ __ ] you Alex well I'm gonna say [ __ ] you I'm pretty sure Bruce Green just said [ __ ] you and say go to twitch.tv slash Bruce Green to yellow if you want the Nano biologist gots got to here he says wow",
            "start": 3574.95
        },
        {
            "text": "you Alex well I'm gonna say [ __ ] you I'm pretty sure Bruce Green just said [ __ ] you and say go to twitch.tv slash Bruce Green to yellow if you want the Nano biologist gots got to here he says wow raids max out at forty people like classic next rymus oh yeah they now flexible can range from ten to thirty people with mythic raids requiring twenty people which is suit like a really really cool I love the Wow raids the only reason I would play Wow ever so I never got to him man about just also said yeah the trover DLC is important cosmic jobs so it wasn't a typo right yeah nailed it as I do Lord of fun points at Greg they remove the prestige and nightfall activity from destiny - so you can't do that anymore oh so that's no good interesting rush rush 37 says Greg nada you are wrong but more info there's a Google pixel limit October 15th I was gonna mention that interest I'm gonna buy the new pixel okay I do it every year because they do a buyback program with the old pixel so this",
            "start": 3614.31
        },
        {
            "text": "more info there's a Google pixel limit October 15th I was gonna mention that interest I'm gonna buy the new pixel okay I do it every year because they do a buyback program with the old pixel so this phone's going away yeah but they'll give me like 300 bucks for it awesome yeah and I was wondering if they're gonna do something stadia related interesting on the launch next Tuesday next Tuesday yeah but they're doing a big event where they're like introducing all they're like oh really I believe so oh well I mean it's a pixel event but I wasn't sure they're gonna do that - okay cool see ladies and gentlemen that's kind of funny games daily that's brew screen twitch.tv slash brew screen of course he's about to do we have cool friends if you're listening this later you can catch we have cool friends on podcast services around the globe youtube.com slash kind of funny roosterteeth calm let's run you through the hosts for the rest of the week on this show Tuesday it's Bruce Green and me",
            "start": 3657.81
        },
        {
            "text": "friends on podcast services around the globe youtube.com slash kind of funny roosterteeth calm let's run you through the hosts for the rest of the week on this show Tuesday it's Bruce Green and me Wednesday it's me and Gary Oh Thursday give me a name Ron Friday it's me and Tim remember the game's cast is Thursday 2:00 p.m. patreon.com slash kind of funny games it's me Tim Fran and Imran you have All Stars All Stars in a single day right I I feel I feel privileged hallowed halls you know here you are to be gracing us with your presence that's great thank you so much Bruce for coming up in doing this well of course are you kidding yeah any time we have a lot of cool stuff planned with you the other thing we've talked about on a patreon stream but we didn't do too much about it I'm happy to announce that the kind of funny pay-per-view yeah the world championship pay-per-view that's happening okay why are we doing it here we're it's being recorded here tomorrow yeah yeah you'll see I have",
            "start": 3705.12
        },
        {
            "text": "that the kind of funny pay-per-view yeah the world championship pay-per-view that's happening okay why are we doing it here we're it's being recorded here tomorrow yeah yeah you'll see I have it and Bruce is one half of your commentary team that's right so he'll be there is a voice in your ear the entire time and you'll have more details on that soon but until next time know ladies and gentlemen it's been our pleasure to serve you",
            "start": 3742.42
        }
    ]
}