{
    "id": 98,
    "video_id": "cpWGPLwOqUE",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Deadpool Was a POW Comedian: YouTube Geek Week",
    "description": "Turns out Wade Wilson isn't Deadpool -- Daniel Grimwald is, and he's a vet turned comedian. See, Colin doesn't like comics, but he loves driving Greg crazy. For YouTube Geek Week, Colin's butchering one classic comic book origin in each video and watching Greg cringe.\n\nSUBSCRIBE/LIKE/SHARE\n\nWatch the other Horribly Wrong Comic Book Origins: http://www.youtube.com/playlist?list=PLOlEpGVXWUVtoTPsBvu65SG52bZzPVn41\n\nWatch more YouTube Geek Week videos at http://youtube.com/geekweek\n\nAnimations by the AMAZING PandaMusk -- follow his antics at http://www.youtube.com/pandamusk and http://www.twitter.com/pandamusk.\n\nShot on location at Isotope Comics in San Francisco. Go there, and tell James \"Horribly Wrong Comic Book Origins sent me!\" - http://www.isotopecomics.com/ \n\nFollow us on Twitter:\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nickscarpino",
    "published_at": 1375852014,
    "duration": 308,
    "transcript_chunks": [
        {
            "text": "Welcome to Horribly Wrong Comic Book Origins. Where a nonic fan takes a crack at a classic comic tale today's origin is Deadpool, all right? So the story of Deadpool is really two different stories that happen about two decades apart. Greg, I don't know, you two different stories, two decades apart. Let's get all right, so uh Deadpool's name is uh Daniel Grimwald. Dan was born in the late 1920s during the Great Depression and he ends up joining you know when he turns 17 he obviously lied like a lot of people did and joins the Army in order to fight the Nazis right in Europe and uh much to his dismay, he doesn't get sent to the European theater; he gets sent to the Pacific. And the Pacific, of course, Greg, if you know your history as I do, and you know I do, that you know that the Pacific was a much more dangerous theater fighting a much more dangerous foe in the Japanese. So so Grimwald rises to the rank of lieutenant, he's kind of island-hopping, he ends up on an island, B... You know what happens there, Greg? Comic book origin.",
            "start": 3.12
        },
        {
            "text": "Theater fighting a much more dangerous foe in the Japanese um, so, so Grimwald rises to the rank of lien. He's kind of island-hopping; he ends up on an island, and you know what happens there? Greg Comic is telling jokes In the Pacific theater, more on that later. I'm sorry, I don't jump ahead. GMW is, you know, Japanese, kind of taking whatever, and they end up trusting him. Now, of course, Gre as you know, uh, officers in the Japanese Army would carry around katanas right; they really didn't use them but at this point in World War I, but they carried them around with them, and they ended up kind of teaching them how to use a katana. Now he kind of takes skill, uh, and learns whatever, and basically in 1945 the Allies when they liberate this camp, so that's that's one part Part of ST. Now we're another decade later GM is from CCTI; oh, and so he goes back to CCTI and gets a job, you know, normal office job actually, this is important ST, but the Gi B to go back",
            "start": 49.72
        },
        {
            "text": "One part Part of ST Now We're another decade later GM is from CCI (Comic-Con International) oh and so he Goes back to CCI and gets a job you know normal Office Job actually this is important ST but the Gi B to go Back to College I like that all of your Origin Stories involve people going to College Stay 50 Daniel comes from he wants to be a stand-up Comic really funny right he's funny, he tells you on Stage really great it laury They make a good Buck Who's on first All These Things the thing about that is he has an ni he has a nice Way about him he's not a very good standup Comic and this makes him Angry why was he so successful in the Japanese Camp because he had a Nice Way about him, he wasn't funny in the Japanese had no idea what he was having were vibes Cincinnati Job he's A stand-up Comic he 's fail stand Comic he washes out this Point that he Gets really upset but he doesn't have an Evil Way about as you know Deadpool not like a bad Person so he kind of combines the things that he loves and Knows One That he's",
            "start": 122.8
        },
        {
            "text": "Out this point, that he gets really upset, but he doesn't have an evil way about it. As you know, Deadpool isn't like a bad person, so he kind of combines the things that he loves and knows one that he's really good at, one that he's not so good at. And this kind of plays out, of course, in the new Deadpool video game that we saw constantly making wise cracks all the time. So he's the master of working the Deadpool video game. Now, this is what's really important about the story: it's that when he leaves the Japanese camp, the prison camp 1945, he takes out Kat from one of the officers and he goes his way, seen it while he goes his ccti - oh, and he grabs Kat and he starts off. You know, long story short, Greg basically he starts running around Cincinnati, Cincinnati goes around more places telling jokes, kind of wielding a sword, kind of fighting, cri - he's kind of your typical kind of kind of superhero with a little bit of a comedic slant, but he's really not that funny, and that's kind of the story about how he uses a katana and why.",
            "start": 183.12
        },
        {
            "text": "kind of fighting crime, he's your typical kind of superhero with a little bit of a comedic spin, but he's really not that funny. That's kind of the story about how he uses a katana and why he stands out. You got to the big parts, you got the big part Little off on, of course, Deadpool, the Merc With A Mouth. He's this assassin-trained killer who started off as Guy Wade Wilson then got involved with that Weapon X program which gave him the ability to regenerate just like Wolverine but the problem was that Wade Wilson had cancer; he had some cancer tumors on him right so when he got this power, the body kind of fought back in cancer scarred his entire body so he looks like he's been like a burn victim underneath the outfit and so then he goes out and he drives himself crazy too. It screwed with his brain so he's got all these voices in his head and he's kind of insane. He knows he's in a comic, breaks the fourth wall, talks to them often, so Sil and he actually is really funny.",
            "start": 226.76
        },
        {
            "text": "too it screwed with his brain so he's got all these voices in his head and he's kind of insane he knows he's in a comic break theth talks to them often so SS Sil and he actually is really funny as proven in The Masterwork Deadpool video game that doesn't sound all thanks for watching Click here to watch Spider-Man's Origin Click here to watch Colin and Greg discuss mustard Click here to see the boys rank The Top 25 PlayStation 3 Games",
            "start": 264.4
        }
    ]
}