{
    "id": 97,
    "video_id": "laa50X3zOFY",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Should I Go to College? - A Conversation with Colin",
    "description": "Is a college degree relevant in 2013? Northeastern grad Colin Moriarty responds.\n\nToday's topic was submitted by Snoogans2You. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1375794012,
    "duration": 413,
    "transcript_chunks": [
        {
            "text": "So like there's always this argument that like maybe we're sending too many people to college and that maybe that argument is fine, that like you need a blue collar worker or you know low skill worker who wants going to take a job that nobody else wants. Shut up Portillo! Portillo, you **** I'mma kill you. What's up everybody? Welcome to A Conversation with Colin. I'm Greg and this is my roommate Colin. Now sometimes Colin here says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull it out, toss it at him, and we talk about it for your amusement if you like that. Like the video, subscribe to your channel, share with your friends so everyone can see how crazy Colin is. Colin, are you ready? Today's topic of conversation is: Is a college degree really relevant in 2013? This is from Snoogans2You. Yeah, absolutely. Why is that? Now you don't think... we work at a website IGN; we write about video games. Oh, for a long time, talked about how people come to work for IGN and don't have",
            "start": 0.04
        },
        {
            "text": "To you, yeah, absolutely. Why is that? Now you don't think you know we work at a website IGN. We write about video games. Oh, we for a long time talked about how people come to work for IGN and don't have a degree in journalism or writing or English, whatever they may be. Even finish college sometimes. They get to work with us, yeah. Uh, so there's an emotional sense like, like a kind of an emotional plea for college education, but there's also a really practical data-driven reason for this. The unemployment rate of college graduates in the United States is very low, like 4%. The overall, uh, especially during the recession, the overall unemployment rate was like three times higher than that. So, uh, you can just do the math - someone without a college degree, um, just mathematically is less likely to get a job. Um, so does it matter what your degree's in? Clearly not, I don't think so. Like I think my mom always put it really well, my mom's an English major.",
            "start": 39.24
        },
        {
            "text": "mathematically is less likely to get a job um so does it matter what your degree's in clearly not I don't think so like I I think think I think I think uh my my mom always put it really my mom's an academic and she like always um she works at a university um and she always put it she worked at Northeastern when I went there and she's a Northeastern alum too and she goes Huskies go Huskies that's right uh she used to say that like a college degree a bachelor's degree is a way to prove that you can do something that like you can start and finish something and that's like really important it really doesn't matter of course there's practical applications if you if you study Communications you're probably pretty liable to go into something like PR if you study business you might go into marketing or Administration like um if you study education you're going to teach like there's like obviously very practical applications for all these things but studying at KU you probably **** your sister",
            "start": 82.4
        },
        {
            "text": "or Administration, like, if you study education, you're going to teach. Like, there's obviously very practical applications for all these things, but studying at KU probably isn't as useful as other options. Yeah, that's good, that's good little rival, I never understand uh it's how I feel about BU - so BU is easy to make fun of, that's all you have to do, that's it, dude. Yeah, be you there, you go everybody north that's what you do, make like one of those cardboard signs but then have the hand animated, you just move the hand back and you know somebody does this and makes a YouTube video, you'll see what I mean. So like, I think that like a college degree is not obviously there's plenty of people out there that are successful and do their thing without a college degree it's just like you're at an inherent disadvantage to that one, like always I don't care like how successful or how much money you made or what you do, you're at an inherent disadvantage to a college degree and um",
            "start": 123.56
        },
        {
            "text": "you are at an inherent disadvantage to that one, like always I don't care, like how successful or how much money you made or what you do, you are at an inherent disadvantage to a college degree and um because like you just can't talk like you can't say like I went to school for this at this place like having a name like Northeastern or having a name like you know Missoula or something like you went there that that's significant that means something like obviously like you could float through undergrad pretty easily and like I know a lot of people have done that, sure Sport Science Majors college is what you make of it and it's proof that you are able to accomplish something um and I in my experience I've always like frankly heard of a lot of people that disparage a college degree are the people that are like in insecure that they don't have one um and like that's fine if you like didn't have the means to go to college or didn't have the drive or the ability to go to college but like",
            "start": 162.8
        },
        {
            "text": "people that are like in insecure that they don't have one um and like that's fine if you didn't have the means to go to college or didn't have the drive or the ability to go to college but like that kind of question always comes off to me as like I didn't go to college and I'm justifying why I didn't go to college you know the fact of the matter is like I paid my way through college and I owe a ton of money to do that like so I made it happen um and you could leave and go get a job and do all these kinds of different things but like at the end of the day like you want to have a college education because it just gives you an edge and the edge isn't necessarily super sharp like you it's not going to get you your dream job right off the maybe ever but it's just going to mathematically secure your your future a little bit better you make more money that's the other statistic people always say College grads make more money yeah like like it's just there's",
            "start": 205.08
        },
        {
            "text": "Secure your future a little bit better, you make more money. That's the other statistic people always say: College grads make more money. Yeah, like it's just there's something about a college degree, you know? Obviously if you get higher and higher in grad school and get a PhD, that speaks for itself. But like just having a bachelor's degree might not be as significant as it was in the past. And uh, there are too many people probably going to college today because there aren't enough jobs that require a college degree. So like there's always this argument that maybe we're sending too many people to college and maybe that argument is fine - you need a blue-collar worker or low-skill worker who'll take a job nobody else wants. Shut up, Portillo! I'm gonna kill you! What were we talking about? College... so I got a pill after I graduated college. Look what my degree got me: a dog I couldn't train.",
            "start": 241.0
        },
        {
            "text": "else want shut up Portillo Portillo you **** I'mma kill you what were we talking about college so I got I got pill after I graduated college look what my degree got me a dog I couldn't train I just feel like I just feel like P come here I just feel like there's a lot of negativity these days college that it's too expensive that well it is too expensive we it is it is it it's just like you can't disparage like what a a just even a liberal arts education provides for you like it's an experience at a time in your life that you cannot replicate right that makes sense P till bark again and I'll break you no we're bringing him over here it'll be good now he just wants to be part of the conversation with you he didn't go to college he didn't go to dog school so I don't know that's basically that it's basically that about college degrees uh the one pin in it you know we're talking about that we've worked with people who don't have degrees we we're trying to hire people when we get resumés",
            "start": 278.56
        },
        {
            "text": "it's basically that about college degrees uh the one pin in it you know we're talking about that we've worked with people who don't have degrees we we're trying to hire people when we get resumés in the mail and you look at and they don't have education on them they don't have a college degree it's not so much a big red mark but it's immediately the question of what happened here I notice it I mean like I like I I noticed that like if you didn't go to college and don't have experience in the field I'm not really interested you know like experience is usually more beneficial than an education over time right like you can say like it could go the other way it's like I went to Long Island University for this and uh I don't have any experience in the field I haven't worked in 5 years or you say like I never went to college but I have 5 years experience in this field that's actually the latter is actually like more important but like it's about segueing from one to the other parlaying them",
            "start": 317.6
        },
        {
            "text": "I never went to college, but I have 5 years of experience in this field. That's actually more important, but it's about segueing from one to the other, parlaying them and connecting them together - that I think is really important. And I noticed that like an education is super important; I'm not saying you can't teach yourself or be intelligent without a college degree or high school degree for that matter. I want proof that you know something, and that's proof that you committed to something, trained for something, did something. So, like, that's kind of my take on it. Let's go to... put it this way. Thank you so much for your question, Snoogans2You. That wraps up this conversation, but ladies and gentlemen, what do you want to see K H talk about? Let us know in the comments below. Then make sure you like the video, share it with your friends, subscribe to us here on YouTube.",
            "start": 359.28
        },
        {
            "text": "but ladies and gentlemen what do you want to see KH and talk about it let us know in the comments below then make sure you like the video share it with your friends subscribe to us here on YouTube until next time have a conversational day so like most cats are very you know they figure it out very early they're cats but like she just shits right on top of the litter and then just bounces",
            "start": 390.32
        }
    ]
}