{
    "id": 13,
    "video_id": "N-0c5DeuMMU",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller"
    ],
    "title": "What Is Chemotherapy Like?",
    "description": "The Internet's Greg Miller walks you through what his biweekly chemo session is like. It's actually boring.",
    "published_at": 1347662531,
    "duration": 77,
    "transcript_chunks": [
        {
            "text": "give me five minutes what's oh hi didn't see you come in there I'm the Internet's Greg Miller and it's a pleasure to see you uh I was playing PlayStation Vita as I often do um a lot of questions lately about cancer because I got cancer if the head didn't clue you and I have the Hod gkin lymphoma and one of the big questions I get is what is chemotherapy like people think either number one it's like I'm getting irradiated in a tube like you'd expect the Incredible Hulk or number two it's like 50/50 and in a room with other people eating pot brownies and the fact of the matter is this is what chemotherapy is like look around give give a good pan you there's some hand sanitizer on the wall yeah there's a bunch of stuffs in here they use to plug him but anyways I mean the basics is that uh I come in here every two weeks for my kind of chemotherapy I guess and I sit in this chair which is very comfortable and I get something shoved into my arm and for four hours I sit here and play PlayStation",
            "start": 0.04
        },
        {
            "text": "in here every two weeks for my kind of chemotherapy I guess and I sit in this chair which is very comfortable and I get something shoved into my arm and for four hours I sit here and play PlayStation Vita and earn trophies in my constant quest to beat Cool Morati at trophies but that's it that's chemotherapy that's the that's the thing this is if something bad happens I ring the bell but we don't want to ring the bell we hope we never have to ring the bell one so thanks for your support now you know what chemotherapy looks like not something to be frightened of go have a conversational day",
            "start": 45.84
        }
    ]
}