{
    "id": 258,
    "video_id": "pLHXSv0wRlI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Fast Food and Scary Movies - The GameOverGreggy Show Ep. 17",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1396594801,
    "duration": 6237,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to the Game Over Greggy Show. I am one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. Hi everyone. That's it? That's what you got for me? That's all I got. Mm-hmm. Okay. Then, the pride of Long Island, Colin Moriarty. Hello. And the pure one, Tim Gettys. What's it most? Ladies and gentlemen, we discovered before the show it's episode 17 of the Game Over Greggy Show, and I'll tell you right now, strap your fucking balls on, because this one's going to be a good one, Tim. Yeah, it's going to kick you right in the D. It's going to kick you in the D, and then kick you in the P. You screwed it up. Oh, wait, no, no. I screwed it up already. You suck a D and you kick a P. That's the Care Bears slogan we decided before this show. Sometimes we eat burritos before the show and come up with better topics than we ever could on this show. Can I give a little context to that statement? Sure, go ahead. We're talking about the Care Bears.",
            "start": 0.0
        },
        {
            "text": "we eat burritos before the show and come up with better topics than we ever could on this show. Can I give a little context to that statement? Sure, go ahead. We're talking about the Care Bears. Yeah. And what was their slogan? And that's what I shouted out. What was their slogan? And Greg Miller shouts out, suck a D and kick a P. Care Bears. And I had to- Care Bears. See, in my version, there's an explosion behind them, and then it's just their black silhouettes walking, and then it just says, suck a D, kick a P. Like the Justice League intro? Yeah. Where they're like, dun, dun, dun, dun, and they're walking hilariously slow with gigantic shoulders. And the really weird CG they did that the show was just awesome. The show was awesome, but that's a sequence. Yeah. It was like, what? Really bad. Not good. Really bad. Okay. Ladies and gentlemen, the idea of a Game Over, Greg, Show is simple. Every week, four best friends come to this table, each with a random topic of discussion, and",
            "start": 36.92
        },
        {
            "text": "bad. Not good. Really bad. Okay. Ladies and gentlemen, the idea of a Game Over, Greg, Show is simple. Every week, four best friends come to this table, each with a random topic of discussion, and talk it out for your amusement. If you like that, like the video, share it with your friends, go buy the MP3. What's that? Yeah, you can buy an MP3. Every Friday, we post the brand new full episode, all the topics in one giant hour and a half long MP3, over on gameovergrega.bandcamp.com. Link's in the description. No big deal. Then, if you go to YouTube, Monday through Thursday, we post the topics one by one. Before Friday, we give you the whole episode for free as a video. So there you go. You want to give us a dollar? Great. You don't? Cool. Spend it on cocaine, as Nick Scarpino would say. That's not what I would say. You would like that. You talk about cocaine every episode. I think cocaine is, it's scary. Cocaine's a scary, exciting thing. How many times have you done cocaine? Never. When",
            "start": 76.32
        },
        {
            "text": "not what I would say. You would like that. You talk about cocaine every episode. I think cocaine is, it's scary. Cocaine's a scary, exciting thing. How many times have you done cocaine? Never. When are you going to do cocaine? Never. Here's my question. What if we kickstarted you doing cocaine? How would that happen? We go to Kickstarter and we're like, what's up everybody? We're the Game Over, Greg, Show, and Nick Scarpino's been talking a lot of talk about cocaine. Now it's time for him to walk the line, as they say. What would you set that price at? What's that price tag for a first time cocaine offense? Because I need it for legal fee. We need that? We need the bail, too? Well, I'm going to need to get bailed out, yeah. I mean, I can't afford that much money. They call them rails, lines, rails. Yeah, you're going to do some lines. The snow trail. That's what they call them in the movies. I don't think they call it the snow trail. Can we start that? We can. I put snow trail. Tim,",
            "start": 109.98
        },
        {
            "text": "rails. Yeah, you're going to do some lines. The snow trail. That's what they call them in the movies. I don't think they call it the snow trail. Can we start that? We can. I put snow trail. Tim, let's ride the snow trail. Have you? Yeah. It doesn't make sense. Riding the snow trail. Tim, let's go cross country skiing on that snow trail today. There's nothing more exciting sounding than cross country skiing. That just makes me really excited. Like, whoa, let's expend a lot of energy. It's a good workout. You remember, I remember that. It's really exciting. My aunt and uncle took me cross country skiing once just like, what? Oh my God. Right? You're like, why am I not going down a hill? I was a dumb kid. I couldn't imagine you cross country skiing. It was not a good show. I couldn't imagine you cross country. I mean, imagine, I've always had this body type, but I was much smaller. So this little potato, just fucking cross country skiing. It reminds me of Manny from Modern Family. Oh",
            "start": 144.52
        },
        {
            "text": "you cross country. I mean, imagine, I've always had this body type, but I was much smaller. So this little potato, just fucking cross country skiing. It reminds me of Manny from Modern Family. Oh yeah, that's the fat kid at Modern Family. He's Ed O'Neill's son in that show. Yes. Yes. I've seen enough Modern Family. Here's the question I have about Modern Family. They show it when I go to the dentist. This is just backstory. This isn't the question. They show it when I go to the dentist. So it's on, it's all captions, right? And that's how I know it. And that's also how I've watched most of 30 Rock in my life. What I don't understand is does the family know they're being followed by cameras? No, that's, I mean, yes they do, but like they never even bring attention to it. But they do like monologue interviews. Yeah. It's kind of like the office, except I don't watch the office. So I'm not sure if it's like the office. I mean like the office acknowledged that there was a camera. I mean",
            "start": 177.0
        },
        {
            "text": "monologue interviews. Yeah. It's kind of like the office, except I don't watch the office. So I'm not sure if it's like the office. I mean like the office acknowledged that there was a camera. I mean they do the monologue things, but otherwise they don't. I mean, everyone says they'll look at the camera, you know, so they know they're being filmed, but there's never like a backstory of like, oh, there's a documentary. The pilot isn't at all explaining this of what's happening. That's fucked up. It's stupid. I mean, that's why I can't respect it. It's really funny though. Modern Family is excellent. Everyone loves it. From what I've read in the caption boxes, it seems funny. It seems, and reading it makes it a lot less funny because you mean like a foursome and orgy is this quartet. It sounds like a barbershop quartet. Like they're singing and shit for you. Who's got, I didn't know the word for threesome plus one. I think at that point, yeah, it doesn't need to be sexual. We can just,",
            "start": 214.76
        },
        {
            "text": "like a barbershop quartet. Like they're singing and shit for you. Who's got, I didn't know the word for threesome plus one. I think at that point, yeah, it doesn't need to be sexual. We can just, you know, drink Coke or something, but I just want to be there. Just watch your one. Yeah. Well, like I said, ladies and gentlemen, we all bring topics to the table. Modern Family was not any of our real topic. Tim, the pure one. Would you like to start us off tonight? I got a good one. I got a good one for tonight. Okay guys, would you rather have sex with a goat and no one know you did it or not have sex with a goat, but everyone thinks you did it. We call this the devil threesome, but everyone thinks you did it. Yes. What's the evidence that that I had to think about this. It's one of those things where like credible people like imagine Bill Nye. Imagine Bill Nye was like, I saw Colin fuck this goat. Bill Nye is fucking being libelous. Bill Nye the pornographic guy. He does good things.",
            "start": 311.48
        },
        {
            "text": "things where like credible people like imagine Bill Nye. Imagine Bill Nye was like, I saw Colin fuck this goat. Bill Nye is fucking being libelous. Bill Nye the pornographic guy. He does good things. He's kicking some D. You see that picture of Bill Nye with the next to the Jay Z picture. Jay Z. There's like a poster of Jay Z and he's just like throwing up the peace sign and Bill Nye's just standing next to it doing the pose too. And it is baller. That's pretty baller. But yeah, so Bill Nye puts it out there that you guys did some things with some goat. Yeah. That's a good one. That's a really good one. Off the cuff. I mean, I'll be honest. I'd probably have to do, I got to go option one, which is you got to do it right. Cause I don't want everyone knowing that they did it. Here's what I'm going to propose. Greg Miller publicity whore loves to be talking on the Twitter and whatnot, right? I'm sure I would see a bump in followers and I'm on the Facebook. This show itself would do one",
            "start": 358.16
        },
        {
            "text": "going to propose. Greg Miller publicity whore loves to be talking on the Twitter and whatnot, right? I'm sure I would see a bump in followers and I'm on the Facebook. This show itself would do one of those kinds of followers. Any publicity is good publicity. That's what they say. A lot of people would stick by me. They want to hear the story. Oh yeah. So then always airlines. It's true. That's very true. Yeah. I mean there's talk. It'd be the buzz. So one of these, one of these, you know, when you have conversations with your parents, like pointing conversations when you're about fucking goats and no, like, you know, like everyone's telling you, learn a lesson right for your parents and you remember what, like what it was or what was said. At least I have like those instances in my life. And one of the things that I remember my dad very vividly talking to me about when I was like 10 or 11 years old was, and I don't remember like what we were taught, why we were talking about this, but",
            "start": 408.8
        },
        {
            "text": "one of the things that I remember my dad very vividly talking to me about when I was like 10 or 11 years old was, and I don't remember like what we were taught, why we were talking about this, but I remember what he said to me. I was like, you know, what if someone, you know, what if someone's lying about you or like they don't know the truth about you or what you did. I don't remember exactly like what this was. Someone was probably picking on me or something at school. And my dad was always like, what? The only thing that matters is if you know the truth about yourself, you know, like if you know what's real and like what's true, then that's really what ultimately matters. Doesn't matter what other people think. That comes into my mind when I think about this kind of thing because you fuck a goat, you can't take that back. Can't take it back. Like you can't take it back. I mean, it's not like I would be like straight up. It just that you go, you meet the goat and that would be it.",
            "start": 452.76
        },
        {
            "text": "fuck a goat, you can't take that back. Can't take it back. Like you can't take it back. I mean, it's not like I would be like straight up. It just that you go, you meet the goat and that would be it. What is that? I mean, I don't know the goat. I'm not going to just, what am I like Greg Miller from five years ago? I don't know. I mean, you don't know how clean you go. You can choose the goat. It's a goat. Yeah. You know, I guess what I'm saying is like I would forgo the fucking of the goat because I know in my heart that I never fucked the goat. Then everyone else can say that I fucked the goat, but it's not true. Nothing they can say can make it true if I never fucked the goat, you know? So they can think that, but I didn't fuck the goat. But if everyone in the world thinks that you did and you're the only one that thinks that you didn't, maybe they're right. But they think that I didn't. I know that I didn't. So going back to what your dad told you, is that the most important thing",
            "start": 486.0
        },
        {
            "text": "and you're the only one that thinks that you didn't, maybe they're right. But they think that I didn't. I know that I didn't. So going back to what your dad told you, is that the most important thing though? Or is it what everyone thinks is the most important thing? I don't know because if everyone, if I always was beholden to what everyone thought, I wouldn't be who I am now doing what I do now. You know, like I would have been something different, something else. You got to say it for yourself is what you're saying. Yeah. Colin, I think your mic's going like in and out. Yeah, but what if yourself is someone that doesn't want to be thought that you're banging goats? Sorry guys. It's okay. Fine. I'm glad you catch it now. We fix it now like we always do. Yeah. Watch yours. Oh. You know, like I feel like that's some, that's someone I want to be. Sorry everyone. Someone that doesn't bang goats. Yeah, that's better. Okay. Like at least people don't think that. Was anything I said come",
            "start": 527.92
        },
        {
            "text": "like I feel like that's some, that's someone I want to be. Sorry everyone. Someone that doesn't bang goats. Yeah, that's better. Okay. Like at least people don't think that. Was anything I said come through at all? Yeah. Now we can hear you. It's just kind of cutting in and out. It's just like in the beginning of the triangle. Cause I was trying to say something really important and essential about goat fucking. All I picked up was yes, I would have sex with the goat. I don't know how that, and that's what you said, right? Essentially. So many words. Yeah. Yeah. But I mean the thing about the ramifications too, like you fuck the goat. The ram? No. No. The ramifications? No. They're different animals. Would it be, would it be bad? That's better. I think it'd be the goat. Greatest of all time. Let's just say the goat wouldn't be the only one eating a can that night if I were right. I got to go goat sex. But I mean like they, it'd be, it'd be hard pressed to find a job. You'd always be",
            "start": 562.32
        },
        {
            "text": "Let's just say the goat wouldn't be the only one eating a can that night if I were right. I got to go goat sex. But I mean like they, it'd be, it'd be hard pressed to find a job. You'd always be the, it'd be like Bartman. Remember like, you know, you're going to get away from being Bartman anymore. Yeah. That was a good documentary. It was really good. I think it would ruin your life if everyone thought that about you. Yeah. But then you have to fuck, see this is what I'm saying. Like, so maybe you like it. I'm sure you probably would. You throw it in there. Like this is, it's fluffy. It's well, I hope it's not fluffy. I don't want fluff. It's gross is what it is. Is it? It's sloppy. Have you guys seen a goat? Like have you actually seen a goat? I have not sexually looked at a goat. Have you looked at a goat? I haven't. Like that's what I'm saying. I don't know. Is it fluffy? No, it's a, it's like we're talking about the vagina of this goat, right? Yeah. No, it's not going to be",
            "start": 602.84
        },
        {
            "text": "Have you looked at a goat? I haven't. Like that's what I'm saying. I don't know. Is it fluffy? No, it's a, it's like we're talking about the vagina of this goat, right? Yeah. No, it's not going to be fluffy. Is it called goat-gina? No, they don't. What do you call women vag-men? I don't know. I guess you mean vaman, right? I'm just saying that like this arbitrary, this arbitrary thing that people think about you, you're, you're basically trying to get out of it by doing what they think you already did. Right. So you're succumbing to it. I'd probably succumb to it. I wouldn't, I wouldn't fuck the goat because here's the other thing. You can fuck the goat, but what if there's no guarantee no one's going to find out about that? So you're damned if you do the damn part of it. Well, no, that's the, it's the devil's. How do you, how can you guarantee that though? Cause that's what the devil said. Well, I mean it'd be the same thing as like. What's stopping me from telling someone I fucked",
            "start": 644.78
        },
        {
            "text": "the, it's the devil's. How do you, how can you guarantee that though? Cause that's what the devil said. Well, I mean it'd be the same thing as like. What's stopping me from telling someone I fucked the goat. Not going to believe you. Is this some sort of Calvinist destination kind of thing where I have like it is written and I can't undo anything. You know, like my, my path is written. So if I don't fuck the goat, then my path is written and therefore I fucked the goat. But if I fuck the goat, then no one will ever know. And that can not be unwritten. Yeah. I still don't think it's worth it. I feel like you're not being true to yourself. I'm not a goat fucker. Here's what I'm gonna do. You always talk about you watch every movie ever. I watched a lot of movies. Have you seen a movie called sleeping dogs lie. No, this is a Bobcat Goldthwaite directorial. It might've been a directorial debut in the feature film realm, but what it basically is is there's this girl in one day she gets",
            "start": 683.62
        },
        {
            "text": "sleeping dogs lie. No, this is a Bobcat Goldthwaite directorial. It might've been a directorial debut in the feature film realm, but what it basically is is there's this girl in one day she gets bored and blows her dog. Then she goes on to live a completely normal life. Get falls in love with this guy who she confesses this to like an idiot. I don't know why you'd ever tell anybody this and totally blows up the relationship. And like I'm rusty on this cause it was terrible and I was drunk. But her brother or his brother was in the rafters of the barn where they were talking and so he overheard it and then he blurted it like ruins her life by ever doing this number one. But then by spoiling the secret everywhere else. Pretty terrible. I have to take this phone call. What do you say? Who is it? I can't tell you. Okay. So Tim, would you? Yeah. I feel like I have to. You'd go in right? Yeah. Because I get what Colin's saying about you gotta be true to yourself. But I think being true to",
            "start": 718.34
        },
        {
            "text": "it? I can't tell you. Okay. So Tim, would you? Yeah. I feel like I have to. You'd go in right? Yeah. Because I get what Colin's saying about you gotta be true to yourself. But I think being true to me is wanting people to like me. That's a big part of who I am. And so you couldn't, you wouldn't be able to live the stigma. Yeah. Like I feel like being true to myself would be like, you really like what other people think about you. So bang that goat. Yeah. Just get in there where you fit in. And then I would try my best. You know, I'd want the goat to be happy. Like you would be all, you'd be very sensitive to its needs. You would take your time. Yeah. Little Billy is what they call them. It's a male goat. I guess a goat is, is it go to mail? Are there only male goats? I mean, there's probably a different name, but a goat is not just a male. I don't think that kind of changes things. Yeah. I just thought about that. What does it matter? What does it fucking matter if the goats, a boy or",
            "start": 761.0
        },
        {
            "text": "a different name, but a goat is not just a male. I don't think that kind of changes things. Yeah. I just thought about that. What does it matter? What does it fucking matter if the goats, a boy or a girl doesn't matter? You're fucking a goat mate. Where am I? No, it does matter. Cause there's not the part. It matters. So go inherently a male. Is it a goat? I'll call it something else. If it's not a male, what would it be? If it's not a goat? A lamb or a sheep? No different animals. Lambie. Who gives a shit? I just maybe a Billy goats, the dude. And then are you looking this up? Something else? Not are you just typing numbers in your phone? You don't even know your passcode. You're sexting your wife. I'm sexting my wife right now. Honey, we're talking about good sex for me to work in. My balls are horny. Now we're talking about that thing again. That's sex and it's making my balls wet. Oh God. Oh God. Yeah. Oh my God. My balls are wet. Are you looking up the goats? No, I'm texting",
            "start": 810.96
        },
        {
            "text": "My balls are horny. Now we're talking about that thing again. That's sex and it's making my balls wet. Oh God. Oh God. Yeah. Oh my God. My balls are wet. Are you looking up the goats? No, I'm texting something else to do now. What do you do? Life doesn't stop. It's an up and noon thing for tomorrow. So yeah, I would bang the goat. All right, so let's just fucking figure this out. You fuck the goat. Nicholas are all goats male. Just goat Wiki. By the way, would you fuck the goat? I mean, I got to say, yeah, I don't want the stigma following me. I wouldn't be happy about it. I'm not saying I enjoy it. I'm not saying that's a thing I do in my normal everyday life, but if that was going to fall and you never get another job, enjoy it. Then maybe that's a part of me that I explored at San Francisco. We're all open about these things. We could talk about this. It's probably illegal. BCLD is pretty sure it's illegal. Female goats are referred to as does or nannies and tag males as bucks or",
            "start": 852.6
        },
        {
            "text": "We're all open about these things. We could talk about this. It's probably illegal. BCLD is pretty sure it's illegal. Female goats are referred to as does or nannies and tag males as bucks or Billy's. There you go. Billy goes to the dude. Female. No, because you call all of them. One of you ever called a nanny. I mean, no, it's Billy. Go to the goat. I've known nannies, but they've never been goats. They've always been like older women that take care of kids and they have like socks that are like they alternate between green and white. Yeah. Anybody know? Um, yeah. A great, a great segue real quick for the show and goats in general. Did you guys see the launch trailer for goat simulator today? Yeah. The recreation of dead Island. One. Yes. That is amazing. Did you see IGN's game of the year 2014 video? Yes. Where we named also amazing. I'm calling the, yeah, we call that one early. No, we nailed winning. Yeah. Go home. Pack up. Sorry. So, all right. So you'd fuck the goat. I'd fuck",
            "start": 897.34
        },
        {
            "text": "year 2014 video? Yes. Where we named also amazing. I'm calling the, yeah, we call that one early. No, we nailed winning. Yeah. Go home. Pack up. Sorry. So, all right. So you'd fuck the goat. I'd fuck the goat. Nick, you'd fuck the goat. And now we're saying, is it a male or a female goat? Does it matter? Uh, I'd you prefer it to be a female goat? I'd probably prefer it to be a female. Nick and you'd prefer it to be a female goat. Yeah, I guess it would change. It would change the game for you. What was the male goat? I think it would probably change the game. Really? Change the game for you. What's your problem? No, it's just go to fold. It's never part. It might hurt to go. You don't care about that. No, I wouldn't hurt to go. I guess that's a good call. How do you know what the goal is? Well, that's the whole problem. We have to take that risk. We don't know what they go likes. What do you buy you? Would you fuck the goat? No, I'm going to take the, well, hold on. No, no, no. Like I",
            "start": 939.18
        },
        {
            "text": "Well, that's the whole problem. We have to take that risk. We don't know what they go likes. What do you buy you? Would you fuck the goat? No, I'm going to take the, well, hold on. No, no, no. Like I want to make this clear. This is not, this is a consensual thing. Okay. Oh, the goats into it. The goats doing that cat and heat thing where like puts its head down. Yeah. The goats, the goats, the goats go with it. Or else I wouldn't do it. Or else I wouldn't do it. Does it bring you a six pack? How do you know it's into it? Don't know. But like, yeah, it gives you the nod and the wink. Oh, that's what goats normally do. How do you know? They stare at you. Goats just stare at you. I think you've been propositioned by a goat. That's all my life. I didn't know this about me. All of my life. So you and I are then on the page of taking the publicity. I don't care about publicity. I'm just not going to fuck the goat. Okay. So you go the way of just being everybody's going to, I'm not going to",
            "start": 976.9
        },
        {
            "text": "you and I are then on the page of taking the publicity. I don't care about publicity. I'm just not going to fuck the goat. Okay. So you go the way of just being everybody's going to, I'm not going to let what everyone thinks is true. Dictate what is true. Don't you understand? Don't you get it? So do you, how do you deal with the life post? Everyone knows you're a goat fucker now. The pride of Long Island is now goat fucker. Exactly. What's everybody welcome to podcast beyond. I'm Greg Miller. This is the goat fucker column one. I already, and then I'd be like, well, I didn't fuck the goat, but you can make it. You want? Yeah, see, that's awesome. Meanwhile, one of us, the table would smell like goat. Two of you. Now here's the thing. What if you bookended by goat smell? What if you could throw away the goat? Would you throw away the goat? That way you're not alone. Yeah. You're not alone. You guys have something to bond over. They'd probably rather not three way to go. I don't ever",
            "start": 1006.92
        },
        {
            "text": "throw away the goat? Would you throw away the goat? That way you're not alone. Yeah. You're not alone. You guys have something to bond over. They'd probably rather not three way to go. I don't ever really want to see Tim in that. How would you go every way, man? We've already confirmed the goat is into it. Yeah. So we're not to worry about it. Eaten the can as they speak. That's because that goat parlance for a getting the bite in your dick off. Okay. That's not going to bite your dick off is what I'm saying. It's into it. This is what it wanted. I just don't understand how you're going to have two people having sex with a goat at the same time. I mean, how do you, how do you three way normal person? I don't take turns. You got a mouth. Yeah, but the, I don't know if we can really talk about this. Oh, this is where we call Ross the line earlier arguing about if it's a fluffy vagina. That was, that was crazy. I didn't mean for this to get this disturbingly graphic. Where did you think",
            "start": 1044.5
        },
        {
            "text": "this. Oh, this is where we call Ross the line earlier arguing about if it's a fluffy vagina. That was, that was crazy. I didn't mean for this to get this disturbingly graphic. Where did you think this was a moral question? I see. Colin took it morally. Yeah, I did. Oh, we're supposed to think about moral. What's the moral here? I'm not on the story. Are you true to yourself or are you not true to yourself or what does that even mean? Okay. And you'd fuck a goat. No, I'm, I'm on your side. You and I are the ones who are taking the publicity. You'd fuck it. But I'd be like, they'd be like, you can fuck that goat. And I'd be like, you didn't run. I did. She should be like, can I get the public kit? Can I just fuck the goat and everyone knows about it. That's what you would say. But what if? That's option three. I'm going to go for the radical option three. Everyone knows what it is. The sex tape option. Yeah. Yeah. Let me get it. Jesus Christ. All right. So that's the one in that bag, I",
            "start": 1087.22
        },
        {
            "text": "That's option three. I'm going to go for the radical option three. Everyone knows what it is. The sex tape option. Yeah. Yeah. Let me get it. Jesus Christ. All right. So that's the one in that bag, I guess. I got nothing more for that discussion. That was a good one. I'm happy with it. Nick. Yes. What's your topic? I think about this topic a lot. I'm sure you do go fucking. You know how I have like a weird diet, right? Yes. I'll go on these weird kicks where all I do is eat protein and like think I'm losing weight, but in reality I'm probably not. You are, you look good. Sometimes I break and when I break, I break hard and I go directly to one place. There's one fast food establishment that I, that I love more than anything in this planet. And that is Taco Bell. The T-Bao. Yep. And what I like about Taco Bell is that they only have really like three ingredients, but the menu is vast. Yeah. I mean they just can make billions of different menu items with those combinations of those",
            "start": 1128.88
        },
        {
            "text": "I like about Taco Bell is that they only have really like three ingredients, but the menu is vast. Yeah. I mean they just can make billions of different menu items with those combinations of those three elements. So I, this is the question I have for you guys today. If you could only live on one fast food and I live on it, like you wouldn't gain weight, you wouldn't die, wouldn't get anything, but you can only have one fast food for the rest of your life. What would it be? And I'm not talking a type of food. I'm talking one restaurant. One restaurant. Alright, so now you've got to immediately start breaking it down for me in the census. Does Buffalo Wild Wings count as fast food? It's a sit down restaurant, no drive through. I say no. No. Okay. Does In-N-Out count as fast food? Yes. In-N-Out counts as fast food. Does Portillo's count as fast food? No. You've been to Portillo's, Nick. Does not count. You've been to, you've both been to Portillo's. Yeah, that's not fast food. It's good",
            "start": 1181.5
        },
        {
            "text": "counts as fast food. Does Portillo's count as fast food? No. You've been to Portillo's, Nick. Does not count. You've been to, you've both been to Portillo's. Yeah, that's not fast food. It's good food quickly I would say. But there's a drive through. Do they serve you? I think if there's a drive through it counts as fast food. No, you go in, if you're going to go inside, Colin, you walk over to the counter, you place your order, you walk down to the other end of the assembly line, you have a number, they call your number, you go and get your food in a sack. That's fast food. That's definitely fast food. It's local, you know, it's family owned chain. How is it any different than In-N-Out? You know, like at NASA's. It's better quality food, I mean I'm not arguing that. I think now there's something to be said about cost. Just about the price range of how much a meal is and like the combo variety and I feel like Portillo's is of a higher standard. I agree with that 100%. And I think that",
            "start": 1226.42
        },
        {
            "text": "to be said about cost. Just about the price range of how much a meal is and like the combo variety and I feel like Portillo's is of a higher standard. I agree with that 100%. And I think that that makes it a little less fast. But In-N-Out is of a higher standard too. Should we call Portillo's right now and see if they count as fast food? It's cheap though. Yeah, it's cheap and it's good. It's good quality food. So price seems arbitrary. I think price has a lot to do with it. I don't know. Let's, Greg's going to call Portillo's right now and see if they count themselves amongst the fast food chains. Okay. But, you know, this is a big debate on what counts as fast food and what doesn't. Because obviously you have the classic burger places. Those are all fast food. Yeah, I mean you got McDonald's, you got Hardee's if you're back east, Carl's Jr. here, Sonic Burger. Sonic's good. We're calling the Bloomingdale, Illinois. Hey Linda, my name is Greg Miller from the Game Over Gregie show. I",
            "start": 1260.48
        },
        {
            "text": "you got Hardee's if you're back east, Carl's Jr. here, Sonic Burger. Sonic's good. We're calling the Bloomingdale, Illinois. Hey Linda, my name is Greg Miller from the Game Over Gregie show. I was wondering, does Portillo's count as fast food? Yes. Thank you very much. There you go. From the horse's mouth. You just called Becky a horse. That was Linda. Linda? You called Linda a horse? Linda, I didn't mean it like that. I thought her name was Wendy. I hate everybody. I didn't even hear that. Well then there it's a slam dunk. It's Portillo's for me. You go Portillo's. That's what I grew up on. Portillo's is good. You got Italian beef, you got hot dogs, you got a Polish, you got salads, you got chicken sandwich. What is with you and the salad? I'm saying for a variety of purposes. In and outs in there, but the problem is if I was eating that every day, give me a double double, a double double. You're talking about the range of a Taco Bell menu. Portillo's got chocolate shakes, it's got",
            "start": 1303.68
        },
        {
            "text": "in there, but the problem is if I was eating that every day, give me a double double, a double double. You're talking about the range of a Taco Bell menu. Portillo's got chocolate shakes, it's got tamales. Yeah. It's a lot of stuff going on there. Can you explain to everyone real quick what an Italian beef is? Do you not know what an Italian beef is? I do. Maybe our audience doesn't know. Okay, sure everybody. We'll first off. I'm eating Italian beef. You need to go everybody to Portillo's dot com. You can see images of the goat when you fuck the goat. I think they call that our goat jerky. Sorry, go ahead. I just love this so out of context. Like someone's like Googling Portillo's or whatever and they're going to find this video and then they go, oh, and then all of a sudden when you fucked a goat and that's now Nick Scarpino is cocaine and fucking goats. By the way, just I'm sorry, Greg, before you go, I liked how someone tweeted at us this week saying I Googled Nick Scarpino loves",
            "start": 1352.1
        },
        {
            "text": "a goat and that's now Nick Scarpino is cocaine and fucking goats. By the way, just I'm sorry, Greg, before you go, I liked how someone tweeted at us this week saying I Googled Nick Scarpino loves cocaine a hundred times. Hope that helps. Hope that helps. Thanks. Okay, so we're talking about Italian beef. Portillo's dot com. Go there. There's obviously if you're in Chicagoland, you know all about it. There's one in Indiana. There's two in the LA area. Then there's one now in Arizona. So they're making their way, but they also ship nationwide. So when I describe, you can get the hot dogs there. They come with the whole kit. Colin can see how good they are. That's how he's had his experience. They're better in real life though. Don't judge them off that. Italian beef, of course, you get the Italian bread. It's like the hoagie roll you want there. That nice, almost French bread. You cut that in half and then you take this finely sliced Italian beef right off it. It's cooking in its juice.",
            "start": 1390.78
        },
        {
            "text": "bread. It's like the hoagie roll you want there. That nice, almost French bread. You cut that in half and then you take this finely sliced Italian beef right off it. It's cooking in its juice. You know what I mean? You take it out of the juice, you put it on the bread, then you put some mozzarella cheese on there. You put some gardenia peppers on there. Then you want to do the sandwich. You can get it all different kinds. You have it dry where it would just come that way. You can get a side of au jus. You can get it taken back and dunked inside of the whole juice container, pulled back out, sopping wet bread and disgusting. See what I like is getting a little side of the cheese. Yes. Dipping it in the cheese. They have the nacho cheese there you want to get there for sure. Oh my God, it's so good. Some cheese fries. We're hitting this up at VidCon in E3. Oh yeah, that's happening. Can't wait. I forgot what we're talking about. That's what Italian beef is. That's why I grew up with",
            "start": 1430.78
        },
        {
            "text": "so good. Some cheese fries. We're hitting this up at VidCon in E3. Oh yeah, that's happening. Can't wait. I forgot what we're talking about. That's what Italian beef is. That's why I grew up with Portillo's. Portillo's home. That's the one thing I always talk about. When I left Chicago, my parents split up and they moved to different places. There's no childhood home anymore. When you go to Portillo's, that's where I feel like this is home. I remember you go there on half days and my grandma would pick me up there and take me out. I'd always get two hot dogs, catch up mustard pickle only. Catch up of course a no-no on a Chicago hot dog, but nobody would do it for me. Grandma gets that filet of fish, a cup of coffee. Grandma, it's $1.15. Why are you drinking a cup of coffee? She says, don't fucking talk to me. You're like, all right, grandma. Let me ask you this because mustard's the devil's condiment, first of all. Mustard belongs on nothing. Mustard doesn't belong in this world. If I",
            "start": 1472.82
        },
        {
            "text": "fucking talk to me. You're like, all right, grandma. Let me ask you this because mustard's the devil's condiment, first of all. Mustard belongs on nothing. Mustard doesn't belong in this world. If I went to Portillo's, I like to put ketchup on everything because I'm from New York and that's what we do there. You put the mayonnaise on there too. I was going to say, I like my hot dogs with mayonnaise and ketchup. Now, would that be acceptable there? Am I able to do that? No, they give options there. Here's the thing about Portillo's, is that they don't judge you for anything. Literally, my mother in the car judges me for putting ketchup on my hot dogs. Portillo's doesn't care. They want your money. They're good people. Linda? Is that why your mom bought you a master system? She's like, you don't fucking... She's like, you're already fucking behind everybody else. Here you go. And then she shut the cage door, had a cup of coffee with my grandma at 9.30 at night. My favorite thing, by the",
            "start": 1510.74
        },
        {
            "text": "fucking... She's like, you're already fucking behind everybody else. Here you go. And then she shut the cage door, had a cup of coffee with my grandma at 9.30 at night. My favorite thing, by the way, just you talk about old people at fast food restaurants, Ramon and I made this observation in college, which is like, what is with the old people at McDonald's that have a small fry, a hamburger, not a cheeseburger, but a hamburger and a cup of coffee. That's good. They have a little cup of coffee, a small fry and a hamburger. That seems to be the meal. It's powerful. Yeah. Old people at fast food restaurants are always interesting. There's a Carl's Jr near my house. And for years I've been going there and there's this older man that just every night is there writing a novel, just has his laptop on it, just writing a novel. And it's like, it's crazy. That's just what he does. I feel like old people drink coffee with everything though. Right? Coffee's really good. Like no matter what time",
            "start": 1549.24
        },
        {
            "text": "on it, just writing a novel. And it's like, it's crazy. That's just what he does. I feel like old people drink coffee with everything though. Right? Coffee's really good. Like no matter what time of day it is. It's the only thing keeping them awake. Yeah, that's it. Otherwise they're passing out at five o'clock in the afternoon, sleeping away the rest of their life. Is that why you drink so much coffee, Nick? No. It's like, this is bringing it back to the point where you used to make fun of me. There's so many things you're known for. Before like past week when you used to make fun of me. No, we don't do it anymore. Now we just make fun of you for thinking you're fat. It's like, I always laugh at Jerry Seinfeld's parents in Seinfeld. Like when he'd go visit them in Florida, they'd get up at like four 30 in the morning and then they'd go to dinner at like four or four 30. That's the way old people live their lives. Good for them. I think the only acceptable answer is McDonald's. I",
            "start": 1587.36
        },
        {
            "text": "up at like four 30 in the morning and then they'd go to dinner at like four or four 30. That's the way old people live their lives. Good for them. I think the only acceptable answer is McDonald's. I think McDonald's is really just, it's the right answer because they have a little bit of everything that you'd want, which means they have a wide menu of different types of burgers. It's all variations of burgers, but they're different enough that they all taste different and they're all a different experience. So even though Portillo's has burgers, you're saying the fact that there's like a Big Mac or a Double Cheeseburger, Quarter Pounder or the Buffalo Burger or whatever. I'm also standing by the fact that Portillo's is not fast food, at least not in my life. Here's what I hope happens. Wendy just told you that it was. I hope that Dick Portillo or someone from the Portillo's corporation sees that, fires Linda. We are not fast food. We are good food quickly, Linda. Wow. I'm just saying",
            "start": 1619.84
        },
        {
            "text": "just told you that it was. I hope that Dick Portillo or someone from the Portillo's corporation sees that, fires Linda. We are not fast food. We are good food quickly, Linda. Wow. I'm just saying it's going to be a funny story for us. Not because I want Linda to get fired. It's going to be funny for her and she's on the dole again. We would never even know. I don't know. Now I'm going to worry about it. We can call her back in a week. We'll check in because Linda's still there. But yeah, McDonald's to me is the quintessential fast food and it has everything. It's cheap, it's good and they're consistent. That is my favorite thing. There's some bad McDonald's like the one near IGN. What's so bad about that one? It's just when you go to certain McDonald's, you're like, oh, like this is not going to be a good experience. This is where people do crack cocaine. Yeah. There's like Shady McDonald's over at the end of the sunset by the DMV. Oh, the Shady McDonald's. Man, wait, are we talking",
            "start": 1663.68
        },
        {
            "text": "going to be a good experience. This is where people do crack cocaine. Yeah. There's like Shady McDonald's over at the end of the sunset by the DMV. Oh, the Shady McDonald's. Man, wait, are we talking about Shady McDonald's at Stanion? Yeah, where Golden Gate Park goes. Yeah, yeah. Shady McDonald's. When I'm speaking of that, I mean the one near IGN and that one growing up to me specifically, that one was like, uh-uh, like things are going to go bad. Shady McDonald's is the worst. But even then it's still good though. Food's fine. It's consistently good. And like whenever they have a new burger, it's good. You can trust that it's good. And like that's what I love about it. It's consistency and their fries always good. Sometimes they're better than other times, but they're always good. And their soda. Yes. That's the thing sweet. Soda is so important to me. And most places mess it up. The mix is wrong or no refill. Refills are a huge deal. And I hate when they don't give you that shit.",
            "start": 1713.16
        },
        {
            "text": "their soda. Yes. That's the thing sweet. Soda is so important to me. And most places mess it up. The mix is wrong or no refill. Refills are a huge deal. And I hate when they don't give you that shit. Or the worst offense is when they don't support Coke products. When it's this Pepsi bullshit and you have to choose, it's like, I don't want Pepsi. That's always what they say. Is Pepsi okay? And you're like, no. Oh, exactly. Yeah, yeah, yeah. Do you notice they never say is Coke okay? Because you go, can I have a soda? I guess because you order a Coke, right? Yeah. No one orders a Pepsi. When we go out to the, when we start going out, this is what I'm going to do when we start going out for our lunches every week, we go out for a company lunch on Tuesdays, I'm going to start asking for Pepsi instead of Coke and see what happens. Oh my God. See if they say is Coke okay or if they just bring it to you. I bet they just bring it to you. And then I just drink it. I spit it out all over Greg.",
            "start": 1749.48
        },
        {
            "text": "instead of Coke and see what happens. Oh my God. See if they say is Coke okay or if they just bring it to you. I bet they just bring it to you. And then I just drink it. I spit it out all over Greg. What is this? This is not Pepsi. Garbage. That is a hit. That is a knock against Taco Bell is they only serve Pepsi products. So that's my problem. My problem with Taco Bell. But they have Mountain Dew, which is okay. They're owned by Pepsi on. Yeah. That's the thing. Mountain Dew is kind of the go-to. But even then, for some reason when a company's owned by, when a company, I don't know, fucks with Pepsi, I don't know whatever it's called. Fuck with Pepsi. Yeah. Yeah. When it's, you know, their shit's Pepsi. Like the, all their shit sucks so bad. Like all the options you get are bad. And it's like, well, I kind of like Mountain Dew. I really like Mountain Dew. Mountain Dew is good. But for some reason the mix is never right. So places like Canada Express and all this ruins it. So I told",
            "start": 1792.44
        },
        {
            "text": "like, well, I kind of like Mountain Dew. I really like Mountain Dew. Mountain Dew is good. But for some reason the mix is never right. So places like Canada Express and all this ruins it. So I told you, so the other day I was like, I was hell bent on getting Taco Bell. I was looking forward to it all week. I'm like, you know what? Sunday I'm going to get Taco Bell. So I go and the first thing I ordered at this place, first of all, it was an unseasonably hot day last Sunday. I don't know if you guys remember it or not, but I usually don't leave the house on weekends. It was, it was pretty hot. I get in there and I, the only thing I wanted was nachos. I just wanted a nacho Belgrinde from Taco Bell. That's all I need in my life. The guy's like, I don't have any more chips. And I'm like, what do you mean you don't have any more chips? He goes, well, I'm an assistant director. I forgot to order more chips. I thought we could get through it, but we can't. But he was cool. And he was like,",
            "start": 1831.64
        },
        {
            "text": "do you mean you don't have any more chips? He goes, well, I'm an assistant director. I forgot to order more chips. I thought we could get through it, but we can't. But he was cool. And he was like, I'll gladly open up a bag of Doritos for you if you want me to like make them out of Doritos. And I was like, that's a little too extreme. I'll just go with whatever the other concoction is that tastes like nachos because they have 50 items. They're like the nacho burrito, the nacho, chalupa, whatever. So I ordered like four of those things and then I'm like, cool, can I have a hot water Pepsi? Cause I have to have soda with this. I can't just not drink soda. And the guy goes, I give this to you, but we don't have any ice. And the machine had broke. So not only was there no ice, it was lukewarm Pepsi that came out. That's going to go down good. Like RC Cola. Oh God, it was bad. I got a big, I got a big jug of it. Luckily I was taking it home. So I threw some ice in it. Pepsi is just the",
            "start": 1866.06
        },
        {
            "text": "Pepsi that came out. That's going to go down good. Like RC Cola. Oh God, it was bad. I got a big, I got a big jug of it. Luckily I was taking it home. So I threw some ice in it. Pepsi is just the older I get the less and less I can, I can deal with Pepsi and I drink diet Pepsi, like Diet Coke, Diet Pepsi. It's the worst. Diet Coke's really good. No, it's not. Diet Coke is horrible. Diet soda is just, don't do it. But let me ask you this, cause Greg brought up the RC Cola. Just real quick, where the fuck does RC Cola get off even existing? You know what I mean? Like, like you go to a fucking barbecue when you're a kid and you see that shit on the table and you're like, oh fuck. You knew that person, you knew that person did not want to shell out. They didn't want to shell out the dollar. The dollar. Yeah. They got the 79 cent RC Cola. We had a pizza place that you'd order a pizza from and like they'd give you a free two liter. Well every pizza you got a two liter of this RC Cola. RC",
            "start": 1899.74
        },
        {
            "text": "The dollar. Yeah. They got the 79 cent RC Cola. We had a pizza place that you'd order a pizza from and like they'd give you a free two liter. Well every pizza you got a two liter of this RC Cola. RC Cola's an abomination. That's what upsets me so much about Taco Bell is this Pepsi stuff. But I think, I think Colin's right. I think they are owned by Pepsi. I think Pepsi owns them. KFC is the same thing. That really sucks. But you got the KFC connection, right? So it has a lot good for it. My biggest problem with Taco Bell besides the soda. Oh man, the Pizza Hut and Taco Bell. There's a song called combination Pizza Hut and Taco Bell. You should Google it. There's rock and roll McDonald's too. Oh yes there is. But with Taco Bell, my biggest problem is there's too much options. There's just way too many options because you go in, you never know what you want. And like their numbers always change. And like their whole menu changes with McDonald's, with most of the other places you go in,",
            "start": 1941.26
        },
        {
            "text": "way too many options because you go in, you never know what you want. And like their numbers always change. And like their whole menu changes with McDonald's, with most of the other places you go in, you're like, I can order something. It'll be a meal. I know that if I order a numbered meal, I can get, depending on how hungry I am, medium or large, I'm never going to small. Are you kidding me? But medium or large. Can you go small with a value meal? Yeah. Oh dear. I don't know. But it's like, depending on how hungry you are, that will fill you up. Or there's always a nice little dollar menu to get a little something extra if you need it. Taco Bell is just essentially a shit ton of dollar menu stuff. So you always overbuy things and it's just like, Oh my God. And you just never know. And then like, it's like, Oh, well it's also KFC and I really like their wedges. And then all of a sudden you're eating like an entire world. Biscuits, gravy, and a taco. Exactly. And it's like, well, this",
            "start": 1979.42
        },
        {
            "text": "like, it's like, Oh, well it's also KFC and I really like their wedges. And then all of a sudden you're eating like an entire world. Biscuits, gravy, and a taco. Exactly. And it's like, well, this is awesome. But then I just spent way too much money on it because their dollar menu is not a dollar menu. It's like a dollar 19 menu. And it's like, Oh, this one's 189. But even then, like what's the max you've spent in the Taco Bell? I've never left a Taco Bell spending less than like $15. What are you getting? Because I just get overexcited with this stuff. Whereas McDonald's, they hold me back. They let me know what I'm getting into. I physically can't carry that much Taco Bell. $15 with Taco Bell is like 18 pounds. No, it's not. It's like four macho meals. A pound of Taco Bell is 85 cents. It's like, you order by the pound in some countries. In Britain, you just order 10 pounds. I'll take 10 pounds of Taco Bell. I also got to give a shout out. I spent the weekend in Texas and I love",
            "start": 2016.86
        },
        {
            "text": "It's like, you order by the pound in some countries. In Britain, you just order 10 pounds. I'll take 10 pounds of Taco Bell. I also got to give a shout out. I spent the weekend in Texas and I love going to new places to experience the fast food that they have. And oh man, Texas has some stuff I've never had. And it's just, what do they have? So this place called Whataburger. Oh yeah. I support Whataburger. They're good people. Place called Steak and Shake. Yeah. What do they serve there? Extremely goods. I got hamburger. Didn't they have that here? Wasn't there a Steak and Shake in Tan Fran? Yeah. I thought there was one in the mall. Like back in the day. Yeah. I feel like there was. I'm going to stand by that. I used to only go when we go to Tan Fran. I used to only go to the places that would serve the chicken on the... They'd give you the free samples, right? And then go and get like five of them. That's still fun. Thank you. Oh, you put more ice in there for me. So Whataburger was",
            "start": 2051.66
        },
        {
            "text": "would serve the chicken on the... They'd give you the free samples, right? And then go and get like five of them. That's still fun. Thank you. Oh, you put more ice in there for me. So Whataburger was good. Whataburger? You finally went? Finally had it, Greg. Sorry. I don't mean to keep jumping out. The Steak and Shake was better than Whataburger. Had you never been to Steak and Shake before? That's crazy. But my number one experience of this weekend, my first time ever, Chick-fil-A. Oh, doctor. And Colin, you speak highly of this. Chick-fil-A is my answer. And it was good. Chick-fil-A is your answer? Yeah. Really? Yeah. Why? Why is that? Not that I'm saying that. Chick-fil-A is so much better than every other fast food restaurant. Really? That it's just not... You can't even compare the experiences. Now there's a problem. There's an inherent problem built into this issue with Chick-fil-A. Chick-fil-A is closed on Sundays. Now that's... Messed up my weekend pretty bad. Yeah, like",
            "start": 2099.34
        },
        {
            "text": "the experiences. Now there's a problem. There's an inherent problem built into this issue with Chick-fil-A. Chick-fil-A is closed on Sundays. Now that's... Messed up my weekend pretty bad. Yeah, like people that don't know, they don't plan around these things. They're in for a fucking rude awakening because they do not open on Sundays. Do they still only take cash? No, they take credit cards. Because this was my big thing growing up with Chick-fil-A. Because it didn't exist in the Chicagoland area, at least when I was growing up. Now it's there everywhere there. But when I went to Mizzou, we had the food court in Brady Commons that had like... There was a pizza out there and there was a little Taco Bell and there was a Chick-fil-A there. And that was the first time I ever had Chick-fil-A and I was in love with it. It was so good. But just like I know, Portillo's being shipped to you isn't as good as Portillo's in the restaurant. I knew that the Chick-fil-A sandwiches under a warming",
            "start": 2148.38
        },
        {
            "text": "and I was in love with it. It was so good. But just like I know, Portillo's being shipped to you isn't as good as Portillo's in the restaurant. I knew that the Chick-fil-A sandwiches under a warming light weren't the same. So when I moved out to DC for a summer, I drove my Ford Taurus from Chicago to Washington DC. And as I came off my exit to where I'd be living, there was a sign for a Chick-fil-A. I saw the Chick-fil-A. I'm like, yes. So I went to that Chick-fil-A on the first time. It was Sunday, they were closed. I'm like, live and learn. I went the next night, walked in, made this order, like, all right. And I gave him a credit card. Like, we only accept cash. And I just, I'm like, I don't have any. I turned around and left, never went there. Never went back. It's like, I never had cash. I've never had that. I've been eating a Chick-fil-A for a long time. They probably changed it. Or maybe it was, you know, this is years ago. Chick-fil-A is so good. I was pleasantly surprised by",
            "start": 2180.7
        },
        {
            "text": "I've never had that. I've been eating a Chick-fil-A for a long time. They probably changed it. Or maybe it was, you know, this is years ago. Chick-fil-A is so good. I was pleasantly surprised by their, just the amount of sauces they had. I'm a big fan of sauce. I'm a big fan of dipping things. And man, their sauces were good. They were a nice taste, everything about them. Wasn't thrilled about the fries. The waffle fries? Oh, you're out of your mind. Tasted a little point. It was missing something. They didn't, they weren't crisp enough for me. Yeah. I mean, the thing about Chick-fil-A, there's a few things about them. A, the service is top notch at Chick-fil-A. Top, top notch. They care. Like, they pay their people really well. So like, they'll be very polite to you and call you Sir or Madam and bring your food to the table and ask if you want refills. They'll like actually walk around the restaurant and be like, you want more Coke? And then they'll take your drink and then they'll",
            "start": 2217.42
        },
        {
            "text": "Madam and bring your food to the table and ask if you want refills. They'll like actually walk around the restaurant and be like, you want more Coke? And then they'll take your drink and then they'll bring it back to you. Like these kinds of really nice things. But the, fundamentally, the chicken sandwich, just their chicken sandwich is fucking awesome. It's so good. I don't know, like how they do it, but it is so, so good. They fry it. I loved it. Oh, it's so good. And I get it twice. I get it without, like a lot of people, you know, it comes with pickles. I don't like the pickles on it. I take the pickles off. Then I smother it in mayonnaise. Yeah. Cause you're Colin Moriarty. And then I take, this is what I do. I have a tradition at Chick-fil-A. You can have Cheryl. Cause Cheryl and I go to San Jose sometimes just to go to Chick-fil-A. I go in, I order the number one, which is chicken sandwich and fries and two more sandwiches. Okay. So I have three chicken sandwiches and fries",
            "start": 2261.26
        },
        {
            "text": "I go to San Jose sometimes just to go to Chick-fil-A. I go in, I order the number one, which is chicken sandwich and fries and two more sandwiches. Okay. So I have three chicken sandwiches and fries because I got to really load up. I'm going to Chick-fil-A because it's in San Jose. You're like a chipmunk. You're putting all on your cheeks. And then sometimes I buy like four more and I bring them home. Yeah. But you eat the three at once? Yeah. Yeah, sure. Oh my God. So then I take eight mayonnaise packets, eight, no fewer, no more than heart attack. Nice. Nice. He's a fewer by the way. And I take one. So I take three of them. So one each on sandwiches. I put one on each on the sandwiches and I think the other five, I pour them all out onto the tray on the paper, on the tray. And then I dip my waffle fries in the mayonnaise now and I got a Coca-Cola of noise. Now, now what's really cool and you can tell their Southern heritage is because the, the, they flagrantly and shamelessly use",
            "start": 2297.18
        },
        {
            "text": "dip my waffle fries in the mayonnaise now and I got a Coca-Cola of noise. Now, now what's really cool and you can tell their Southern heritage is because the, the, they flagrantly and shamelessly use styrofoam cups, which is my favorite thing about that place. They're just like, I don't, we don't give a fuck. We use styrofoam cups. We are a deep South chain. It is fucking hot as balls in Atlanta where we're based. People want their drinks to stay cold. We are serving the customer, you know? And that's what the thing is, is that they're all about the customer. You know, I really, really appreciate it. Now I understand that they got into this whole, you know, Dan Cathy or whatever, which is a CEO, like got all in this whole anti gay marriage thing or whatever. You know what? Like, well, cause the company is more run is Mormon, right? No, they're not Mormon, but like the they're, they're, they're hardcore Christians. That's why they're called on Sundays. Okay. I got you. And you know,",
            "start": 2337.98
        },
        {
            "text": "the company is more run is Mormon, right? No, they're not Mormon, but like the they're, they're, they're hardcore Christians. That's why they're called on Sundays. Okay. I got you. And you know, that's fine. Like I, you know, teach his own, I guess like I, I personally don't want to follow that line of thinking of saying like, I'm going to punish an organization for the belief of one person. I don't think that's really appropriate. The knee jerk reaction was easy, right? Totally. I was like, that sucks. I love Chick-fil-A and I'm never going to eat there again. You know what I mean? But then you see people on the news are like, yeah, you know, I'm a franchisee. I own this Chick-fil-A. I love gay marriage. It has nothing to do with that. And it was very, I mean, it was, this was happening when we were, when IGN was still owned by Fox. And I mean, how easy is it to be like Rupert Murdoch sucks. So clearly everyone who works every Fox thing sucks too. And it's like, it's not that cut and",
            "start": 2373.02
        },
        {
            "text": "we were, when IGN was still owned by Fox. And I mean, how easy is it to be like Rupert Murdoch sucks. So clearly everyone who works every Fox thing sucks too. And it's like, it's not that cut and dry. Right. Cause it wasn't a mandate from this guy that every Chick-fil-A has to be like, fuck it. This sucks. Yeah. My whole thing with it was, was simple really, which was, you know, he, he felt the way he feels he donated his money and the company's money, their private company to these organizations. That's kind of his prerogative. I mean, like, I don't want people like telling me how I, how I do or don't spend my money or how I like the things I feel are right or wrong. Like you can agree or disagree, but you know, I'm not going to punish the entire company for the sins of one man, the perceived sins of one man, even though I totally and vehemently disagree with what he was saying, what he was doing. And what was funny was that a lot of people agreed with me. I mean, you know, on the",
            "start": 2412.14
        },
        {
            "text": "sins of one man, even though I totally and vehemently disagree with what he was saying, what he was doing. And what was funny was that a lot of people agreed with me. I mean, you know, on the day that Chick-fil-A was supposed to be boycotted was a record sales day for them, you know, like, so it totally backfired. And like that was the whole, you know, kind of ironic twist with it was everyone was like, not supposed to go there and actually like lines were around the block because even people that support gay marriage were just like, well, I also support his freedom of speech to kind of feel that way. I don't necessarily agree or disagree with him, but, you know, so a lot of people gave me shit for still loving Chick-fil-A after that. But you know, the way he feels doesn't affect me, you know, like, like, and you know, he spends his money the way he wants to spend his money. I'm gonna spend my money the way I want to spend my money. Do you think it's because everyone that was",
            "start": 2447.26
        },
        {
            "text": "me, you know, like, like, and you know, he spends his money the way he wants to spend his money. I'm gonna spend my money the way I want to spend my money. Do you think it's because everyone that was boycotting got hungry? Yeah, well, they're right upside down, right outside like, oh, fuck it, drop the sign. Chick-fil-A is too good. They start smelling good. They smell like chicken sandwich. Okay. So another thing about them that does put them to me, I mean, I don't, it's been, it's a little too early for me to put them at the top of my list. Sure. They're, they're, they're out there though. They, I can see that they deserve a spot in my top area, but what puts them there for sure is their ketchup. Oh yeah. Ketchup's another big thing. No, no, no, no. But they have it in little plastic containers. So the best like ketchup is such a make or break for me at fast food places because there's certain places like Burger King where nine out of 10 of them, they just give you the stupid little",
            "start": 2483.34
        },
        {
            "text": "So the best like ketchup is such a make or break for me at fast food places because there's certain places like Burger King where nine out of 10 of them, they just give you the stupid little packets you have to rip open. And that never works. That is the worst because great. Now I need to spend five minutes opening ketchup to pour it somewhere before I can eat my fries. You know what happens is you eat four fries first, then you think, damn it, I need to open this ketchup packet. And then your hands are so greasy that you can't get it. And you're breaking thumbs. Going back to McDonald's. They're awesome. Cause they have the pump. Oh, they're good. But there's one thing even better than the pump. What's better. And that's what Chick-fil-A has, which are these little Heinz packets that are like, you know, when you get barbecue sauce, you rip them open, like you rip it open. It's like that. It has a little pull tab, rip it open and you can just dip it in. It's deep, but it's also",
            "start": 2522.3
        },
        {
            "text": "are like, you know, when you get barbecue sauce, you rip them open, like you rip it open. It's like that. It has a little pull tab, rip it open and you can just dip it in. It's deep, but it's also squeezable. So you could squeeze it out if you wanted to. It's some next level. We got to take a trip to Chick-fil-A. I would go, I would break my no carb diet to go to Chick-fil-A. We should do that like once a month. We'll try each other's favorite thing. I mean, I know I love portillo. I actually, I think I've eaten a Chick-fil-A before. You all have to eat a Taco Bell. By the way, Taco Bell has none of these amenities. You're not getting service. You're not getting someone to come refill your, your, your bail. You're barely, you're lucky if the toilet Taco Bell works and someone's not in there doing, doing crack. When I go to Taco Bell, I just get six soft tacos. That's it. Oh, that's the jam right there. Six. I like to get the Macho Bell sometimes. No fewer, no more. I can't remember",
            "start": 2556.3
        },
        {
            "text": "doing, doing crack. When I go to Taco Bell, I just get six soft tacos. That's it. Oh, that's the jam right there. Six. I like to get the Macho Bell sometimes. No fewer, no more. I can't remember the last time I ate a Taco Bell. Really? Yeah. I'm never happy leaving Taco Bell. Really? And I say this as a huge fast food enthusiast and I do still love Taco Bell. How was that? I never leave happy. I'm always, I always feel like I spent too much money. I always feel like I'm not. Too much money? Either too much money or not full enough or just I'm disappointed. These words don't even make sense. No. So the other day I went, this is a different instance. I've been actually hitting Taco Bell a lot lately. I should've been cheating a lot. Why don't you cheat on the shit food, but you won't cheat when we go to underdogs? Because we go to underdogs. That's why you end up with no lettuce and one thing. Every single, every single thing we do is, and it doesn't matter. The, uh, yeah, I'm telling",
            "start": 2595.82
        },
        {
            "text": "when we go to underdogs? Because we go to underdogs. That's why you end up with no lettuce and one thing. Every single, every single thing we do is, and it doesn't matter. The, uh, yeah, I'm telling you guys eat a lot and poorly. No fewer than five times a week. That's good too. You did good. Look at that go. Jiggle, jiggle, jiggle, jiggle, jiggle it. Um, body by best foods. You're a beautiful man. Thank you. You're just gorgeous. Um, no. So I went to Taco Bell and I was like, I'm going to, I'm going to show restraint. And I got like a taco, a girl stuff burrito and like a small nacho went home, ate it. Five minutes later. I'm like, I didn't get enough. Went back to Taco Bell. Oh my God. Got a couple more tacos. There you go. There's your wife thinking. By the time I got back, I was already full. I didn't need to eat the tacos. No, she was like, this is your day. If you want to go, go back to Taco Bell. Now, what did the woman that saw me 20 minutes prior think? She thought I was",
            "start": 2633.42
        },
        {
            "text": "full. I didn't need to eat the tacos. No, she was like, this is your day. If you want to go, go back to Taco Bell. Now, what did the woman that saw me 20 minutes prior think? She thought I was fricking crazy because I acted like I hadn't come in. Oh, did you just build this Taco Bell? It's crazy. She knows me now though. Also shout out to the tacos at Jack in the box. No, I've never liked those. I have never liked Jack in the box. Here's why I had one bad experience where I was, you know, you always go to Jack in the box when you're drunk. I don't know if you guys have always, and because it's really greasy. So you think it's going to help. It does not help. I got like a triple Jack one time, whatever the big like triple Decker, it's got like eight cheeses and like, and, and bacon. I think you're talking about the ultimate cheeseburger. Chocolate frog in the middle. Beef, beef, beef, beef, cheese. And that's it, baby. Remember that they have a new burger called the jalapeno burger.",
            "start": 2682.14
        },
        {
            "text": "you're talking about the ultimate cheeseburger. Chocolate frog in the middle. Beef, beef, beef, beef, cheese. And that's it, baby. Remember that they have a new burger called the jalapeno burger. It's a Bay Area exclusive. Very happy about that. Of course you like that. There's hella jalapenos. No, I got, I got that. Uh, no, I was drunk. Obviously we were in college and we used to hit the Jack in the box. There's only three options to go. And I just had one of those tacos. It did not do well. It's too queasy. They're just too disgusting. There's something special about them. Like I love them. Not because they taste like tacos. I love them because they taste like nothing else I've ever had. They're fried. They're just fried. They taste like Jack in the box tacos. That's what they are. When I moved here, I couldn't believe there was a Jack in the box in business still. Cause the only time in Chicago, the only time I ever heard about Jack in the box is when one of the burgers killed that",
            "start": 2722.06
        },
        {
            "text": "I moved here, I couldn't believe there was a Jack in the box in business still. Cause the only time in Chicago, the only time I ever heard about Jack in the box is when one of the burgers killed that kid. Some kid ate a burger and got E. coli and died. And so it was like the Jack in the box scare, the Jack in the box. There was the only, I remember having to ask my mom like, what the fuck is Jack in the box? See to me, it's like Wendy's. For the longest time I never had Wendy's cause oh, there's the finger that was found or whatever. I never heard that story. I still love Wendy's cause they have square pads. I hate Wendy's. Spicy chicken sandwich. How many times a week do you think you went to Wendy's when we were at the old Brisbane office? Truck stop Wendy's. Yeah. One and a half times a week. Yeah. Because Craig Harris liked to go in there a lot and he used to... One and a half times a week? Yeah, on average. Oh, okay. On average. But halfway there, you're like, nah, fuck it. Let's",
            "start": 2763.66
        },
        {
            "text": "week. Yeah. Because Craig Harris liked to go in there a lot and he used to... One and a half times a week? Yeah, on average. Oh, okay. On average. But halfway there, you're like, nah, fuck it. Let's go to the police. But I agree. I remember the Jack in the box things with all the Jack in the boxes on the Island closed down in like the late 90s, early 90s because of that whole E. coli thing. That was like when E. coli, I don't even know what E. coli was as far as I remember. But my Jack in the box stories, cause I had Jack in the box once in a while and there's one in the Richmond. And that's the one I grew up right next to and love. So I've gone there a few times. And so when my girlfriend and I went to see Dredge... You need to do it right. My girlfriend and I went to Dredge, which was one of my favorite bands. We see them live whenever in the city and we saw them at the Fillmore or something. So we were driving back, like, you know, you go into the Richmond and then down into the",
            "start": 2795.66
        },
        {
            "text": "one of my favorite bands. We see them live whenever in the city and we saw them at the Fillmore or something. So we were driving back, like, you know, you go into the Richmond and then down into the sunset through the park. And I was like, you know, I was drunk and fucked up. So I was like, you know, let's, I'm gonna go, she was driving and I was all wasted. I'm like, I want to go Jack in the box. So I went and I got, you know, you can get breakfast all day. So I got like the sausage, you know, McMuffin kind of knockoffs there. I like ate them in the car and we got back. Cause when I lived in my old place in Daly city, I got back and I like threw, like I threw everything up, but I wasn't like drunk enough. And I was throwing up blood, like straight up, like seriously, like throwing up blood. And I don't think it was related. I think it was like, like a coincidence. Like I was probably sick or something. I have a lot of stomach problems and stuff like that, but that always scarred me.",
            "start": 2829.74
        },
        {
            "text": "And I don't think it was related. I think it was like, like a coincidence. Like I was probably sick or something. I have a lot of stomach problems and stuff like that, but that always scarred me. And I've never eaten a Jack in the box since because I was like, what the fuck? They're curly fries, man. Yeah. The curly fries. When I had skin cancer, you know, my, my, you know, sliced my nose open and I, my doctor was in the Richmond and I would walk by that place every day. And I, you know, cause I had to go there like fucking a million times. That's when you, that's when you moved in. I was like, I like lived at the fucking doctor's office. It was ridiculous. And I walked by that every time to go back to the bus to take it home. And I never had the will to eat there, but I'd go to Hard Knocks. Oh, Hard Knocks. Yeah. Which is a fantastic soul food. Before we close this section out, cause I feel like we're coming to a close on it. Where do we come down on Burger King? I like Burger King a",
            "start": 2867.42
        },
        {
            "text": "Oh, Hard Knocks. Yeah. Which is a fantastic soul food. Before we close this section out, cause I feel like we're coming to a close on it. Where do we come down on Burger King? I like Burger King a lot. And you know what, Burger King's underrated and it's rare out here, which is really weird. Underrated and rare. Absolutely. There's not a lot. No, they're not. Not like they are out here. Yeah. There's a shit ton in the city. Way more than McDonald's. There's no way, man. There's like two of them. There's the one across from Asia SF. Now, and now I'm searching for a third. That is the one on 9th and Harrison. Yeah. There's one in Gary. There's a third in Gary, Van, Fillmore in Gary. Yeah. There is one right there. Where I find the other taco bell. There was a lot of burgers. There's about one burger king. There used to be one in Chinatown. I feel like there's a taco. You need to go to, I'm assuming it's the island is like the suburbs of Chicago. I mean like Dunkin Donuts this, you can't",
            "start": 2904.06
        },
        {
            "text": "burger king. There used to be one in Chinatown. I feel like there's a taco. You need to go to, I'm assuming it's the island is like the suburbs of Chicago. I mean like Dunkin Donuts this, you can't get away from it. I'm saying like growing up here, it was always upsetting the like burger king to McDonald's ratio. Gotcha. What's most upsetting to me though about living here for only seven years is that anyone eats at any of these places at all. If they have access to In-N-Out because Yes. In-N-Out is like so superior to Burger King and McDonald's. Yes. And what really puzzled me is the one that, you know, because the one in Daly City, like all along the highway is right next to a McDonald's. And it always puzzled me how In-N-Out didn't just put that fucking McDonald's out of business. You know, like, I don't understand how they exist. McDonald's is a quality McDonald's. That's like one of the opposites of the other ones we were talking about. It's the opposite. There's also Carl's Jr.",
            "start": 2949.34
        },
        {
            "text": "know, like, I don't understand how they exist. McDonald's is a quality McDonald's. That's like one of the opposites of the other ones we were talking about. It's the opposite. There's also Carl's Jr. right next door. Me and my friend very often are going out to dinner and we're driving by and we're trying to decide which one to go to. We almost never go to the In-N-Out. We always go to Carl's Jr. Yeah. I think In-N-Out. Carl's Jr. is the like good shit. You got to pay for it. Like I used to go and get a double, the double Western cheeseburger. A double Western Chi. That's the one cheap thing. Two for four. Oh, so good. And they had the Chris cut fries. Like talk about a waffle fry. Talk about someone who knows how to make a waffle. Yeah. See, that's what those little fries I'm used to. Oh, good. So good. Yeah. I don't know about In-N-Out though. I think it's that you take it for granted having grown up around it. Maybe. And that might be the reason we all love it so much is that we",
            "start": 2984.38
        },
        {
            "text": "Oh, good. So good. Yeah. I don't know about In-N-Out though. I think it's that you take it for granted having grown up around it. Maybe. And that might be the reason we all love it so much is that we come here as transplants and there's this amazing fast food where they're fucking putting the potato in the thing right back there. It's all fresh. They put cheese on everything. See, I've never, I never was a huge In-N-Out fan. You're stupid. There's plenty of them in Orange County, but if you gave me the option of In-N-Out or Carl's Jr. I would actually probably pick Carl's Jr. I don't see too many of them. Well, that's the, Carl's Jr. has this like mystique about it. At least around here where you don't get it that often. And also the Carl's Jr. there is ran by crazy people, which are fun. That's fun. That's always fun. Do they have a, do they have a salad bar? They, they do. And I love the salad bar. I used to, I used to get the salad bar every once in a while just cause, and I eat",
            "start": 3026.06
        },
        {
            "text": "That's fun. That's always fun. Do they have a, do they have a salad bar? They, they do. And I love the salad bar. I used to, I used to get the salad bar every once in a while just cause, and I eat all the cottage cheese. Jesus. Oh my God. Yeah. I don't know. It's called Hardee's back my way. And that's not a place you want to eat at. No. Hardee's? I feel like Arby's is the place here. Like Arby's. Oh, nobody wants to see the Arby's. Do not do Arby's. Arby's is like, yeah. Arby's is rough. You know what, you know what a wild card is? I'm gonna throw a wild card in here. A wild card. Roy Rogers. Did you guys grow up around Roy Rogers? No. Craig Harris always talks about it. Yeah. Roy Rogers was like a New York, New Jersey, Connecticut, Delaware kind of area. Kind of like a Fudrucker. Oh my. Yeah. First off, Fudrucker is not fast food. If Fudrucker was fast food, fuck everything. That's number one. There's another wild card I'm going to throw in the mix. Oh, by the way, Roy Rogers is",
            "start": 3058.78
        },
        {
            "text": "my. Yeah. First off, Fudrucker is not fast food. If Fudrucker was fast food, fuck everything. That's number one. There's another wild card I'm going to throw in the mix. Oh, by the way, Roy Rogers is definitely in, in, if you're from. It's like donuts, isn't it? What Roy Rogers? No, no, no. It's burgers and like steak and stuff like that. Steak sandwiches and stuff. But it's, it's, it's famous for being on the New Jersey Turnpike. Like if you, like a New Jersey Turnpike has the best and like most elaborate rest areas. Like every 20 miles of Roy Rogers and is that like every one of them. In Massachusetts, the rest areas are McDonald's. In Connecticut, the rest areas are Burger King. So you learned a little something. Yeah. Travel in this great nation of ours. But another wild card I'm going to throw at you, which is probably the best burger place, like legit burger place, but kind of rare. There are a couple around here. It's Five Guys. No. Five Guys is good. Dude, it just tastes like",
            "start": 3093.26
        },
        {
            "text": "to throw at you, which is probably the best burger place, like legit burger place, but kind of rare. There are a couple around here. It's Five Guys. No. Five Guys is good. Dude, it just tastes like so much meat in your mouth. Yeah. Oh, yes. When you go to Five Guys, you get a lot of meat in your mouth. I'll go back to the goat experience. Five Guys reminds me of a backyard barbecue. Like that's, you know what I mean? That's the kind of taste I get out of their burgers. I've only been there once. They're so expensive as shit. Expensive as shit. But good. They have to wait forever. All the toppings. It tastes like meat, just too much meat. And that's my problem with the ultimate cheeseburger at Jack in the Box. It's just overbearingly meat. And it's salty. And then you get the peanuts. I'm like, get out of here. You don't have to eat the peanuts. Somebody's forcing you. I know. But it smells like peanut. Well, because they do everything in peanut oil. But the best thing about Five Guys",
            "start": 3133.66
        },
        {
            "text": "like, get out of here. You don't have to eat the peanuts. Somebody's forcing you. I know. But it smells like peanut. Well, because they do everything in peanut oil. But the best thing about Five Guys when you go there, my favorite Five Guys to go is in Times Square or near Times Square. You go, if you ever in New York, go to New York Comic Con. Just walk away. Go to Penn Station. It's right there. It's Pittsburgh. A little expensive because it's in Manhattan. They like, what their tradition is, is that, I don't know if you guys noticed this, when you go, is they give you your burger and your fries. Then they'll take a cup and they'll dump fries in your bag. And that's like their tradition. So like they just fill the bag with fries. I always really liked that. So it's like, you get your fries, they order it and then you get a little something to kind of pick at. You know, I really, really, really, really like the customer, Tim. I hate the taste of their fries. They're just giving you a",
            "start": 3167.58
        },
        {
            "text": "they order it and then you get a little something to kind of pick at. You know, I really, really, really, really like the customer, Tim. I hate the taste of their fries. They're just giving you a bunch of shitty fries. Wow. It upsets me. Wow. And then you see, and then you see like, what I like is they always have like these gloating signs all over. I don't know if you realize, like from all like in Long Island or New York City, it's always like, you know, Newsday says the Five Guys is the best burger place on Long Island. Like all of these like gloating, they just like, you know, their dick's like, you know, huge. Like they're just like, they're just like, we're the best. So fuck yourselves. You don't like it. And there's a, and the irony is that in San Jose, there's a Five Guys right next to Chick-fil-A. What do you do? I go to Chick-fil-A because I have to do it, but I, I do, I think Cheryl wants to punch me in my throat sometimes because I just think that's just living with you in",
            "start": 3202.14
        },
        {
            "text": "to Chick-fil-A. What do you do? I go to Chick-fil-A because I have to do it, but I, I do, I think Cheryl wants to punch me in my throat sometimes because I just think that's just living with you in general. Yeah. But I, I brought it up like what if we around noon went to Chick-fil-A and then there's like a Target. Yeah. We'll go shopping and we'll get our groceries on that. And then we go to Five Guys. This is insanely blowing my mind because the Five Guys in San Jose next to the Target, me and Alfredo have been, we have drove from here to San Jose by NASA so many times. I did not know that. But there's so, so many good food places there that we have had the question of like, Oh, what are we, this is the first time I had Five Guys. I was like, Oh, try this. But it was like, there's also a boiling crab there. And I'm like, I came here for the boiling crab. What's that? Seafood? Yeah. It's one of those like crab shack. Here's a couple of years ago. It was like one of the, like the cool",
            "start": 3233.58
        },
        {
            "text": "boiling crab there. And I'm like, I came here for the boiling crab. What's that? Seafood? Yeah. It's one of those like crab shack. Here's a couple of years ago. It was like one of the, like the cool Asian things to like, okay. Just it's like a long John Silver's. I got it. Go ahead. It's like a long John Silver. Okay. It's exactly like long John Silver. But they have so much food in this complex. It's like really nice. Really good. I didn't know Chick-fil-A was there. Yeah. Chick-fil-A is there and it stands alone, but man it's in that corner. That's awesome. This is like the time I've never been more in love with Steimer when we went to Philadelphia and we were like, we wanted to go try those cheesesteak places. So we went down to that place where it's Al and Gino's across the street from each other. Went to Al's, had a sandwich, went to the bar, had a drink, went to Gino's, had another sandwich. Did you get it with Wiz? Oh yeah. That's how you got to do it. I don't always get it",
            "start": 3283.18
        },
        {
            "text": "from each other. Went to Al's, had a sandwich, went to the bar, had a drink, went to Gino's, had another sandwich. Did you get it with Wiz? Oh yeah. That's how you got to do it. I don't always get it with Wiz when I go to Philly. My brother lives in Philadelphia. It was my first and only time. So I had to live it up. Yeah. Yeah. But it's weird. Like I know I'm getting old because my brother's lived in Philadelphia for 22 years. Wow. It's like, all right. That's good. I used to go there and visit him sometimes when I was a little kid. He lived in like this shitty fucking area. South street. Isn't that the Southie? No, Southeast in Boston. South street is like, I think it's South street, right? Is it broad street? I've never been to Philadelphia. You're asking the wrong man. I don't remember what it is. It's like some street that's like pretty famous. Needle dolphin later. I don't know. Whatever. All right. So we're done. Yeah. What was Tim's pick? I knew I heard McDonald's is still it.",
            "start": 3318.62
        },
        {
            "text": "what it is. It's like some street that's like pretty famous. Needle dolphin later. I don't know. Whatever. All right. So we're done. Yeah. What was Tim's pick? I knew I heard McDonald's is still it. Or it's Fuddruckers if it's considered. Fuddruckers is not fast food. So Taco Bell. If Wild Wings isn't. Yeah. Buffalo Wild Wings, by the way, the one in at Sarah Monte. It's the worst fucking service. Cheryl and I were just like, we're not going here anymore. Like it's fucking overload too. Even for like me, I love sports and television and just having these glowing fucking springs in my face. I walk in there. I'm like, what in the fuck is going on here? How could there be this many sporting events on right now? That's the one place that makes me actually give a small shit about sports because there's TVs that I have to look at them. I want to go there like in a dead like what's a dead zone for sports? Like, dude, it's not there. It's like January when the bye week for playoff football",
            "start": 3355.26
        },
        {
            "text": "there's TVs that I have to look at them. I want to go there like in a dead like what's a dead zone for sports? Like, dude, it's not there. It's like January when the bye week for playoff football where there's like nothing. There's no sports on. I want to go there and see what fucking shit they dig up. I mean, I put on those TV screens, bowling, PBA bowling will be on there probably. Oh yeah. Some golf tournament. It's going to be. All right. We got the rail. What would Nick's pick for a favor? I'm Portillo's chick fillet. It does a diverse setting here. Clearly the weakest Taco bell. I agree with that. Absolutely. 100%. I don't know why I'm so addicted to that place. I love it. I think growing up, I think it was, it might've had something to do with, there was a Taco bell in Riverside where I grew up and my aunt and uncle worked there and they were significantly younger than my dad. Yeah. Cause he was, he had like, he came from five children. So I would always go there cause we'd get",
            "start": 3398.3
        },
        {
            "text": "I grew up and my aunt and uncle worked there and they were significantly younger than my dad. Yeah. Cause he was, he had like, he came from five children. So I would always go there cause we'd get just hooked up and he'd hook me up with special stuff. We'd like, I'll make you something like special. Cause it's like, he was like 19 at the time. So I have a Mexican pizza. No, he'd do like, they used to do like the Pinto and cheese, which is like a little bean cup, but he'd put like meat and stuff all in that for me. And he'd give us meat. It was amazing. That's also how I discovered the Inchurrito, which is still on the menu today. What's an Inchurrito? It's a wet burrito. Taco Bell cheese. By the way, when you get it home, it tastes like they sprinkled cheese, melted it, then then dried it, like actually like let it coagulate. And then they just put like cold red sauce on top of it. That's how disgusting it is. That sounds awesome. I love it. Jesus Christ. I'll go next. My topic is",
            "start": 3443.5
        },
        {
            "text": "it, like actually like let it coagulate. And then they just put like cold red sauce on top of it. That's how disgusting it is. That sounds awesome. I love it. Jesus Christ. I'll go next. My topic is what's the most horrific thing you've seen in a movie that's stuck with you a living nightmare, a living hell. He's instantly know that. And that is Pewie's big adventure. Yeah. Oh wow. That's so funny. Cause that's what I was thinking of too, man. That scared the shit out of me. To me. That was just like the scariest thing in the world. It's that and lady and the tramp, what the cats, the Siamese twin cats. Is that the weird nuts? That's leading the tramp. I thought that was 101 Dalmatians. I don't know these dumb movies. Oh my God. That traumatized me. I don't know why. There has to be a foil for all the dogs. Isn't that Cruella de Vil? Yeah, that's right. She probably the cats. I like how we're jumping to different conclusions. What I was coming at, right. Is I'm talking about the most",
            "start": 3483.26
        },
        {
            "text": "for all the dogs. Isn't that Cruella de Vil? Yeah, that's right. She probably the cats. I like how we're jumping to different conclusions. What I was coming at, right. Is I'm talking about the most horrific thing I've seen in the movie that like I think about sometimes it'd be like a living nightmare. And what I'm going with is in John Malkovich being John Malkovich. When at the end, John Cusack, spoiler alert, gets caught in his kid's whatever, like brain, right? Like he went through the door into his cell front. I don't remember anymore. I can't remember. But at the end of it, he's stuck in somebody else's head watching their life. He can't do anything. He's just watching their life through their eyes. Like he's just in their head for the rest of their life. What a fucking nightmare that would be to be conscious for like, I mean, Colin's head the rest of his life. Jesus, can't do anything. I just got to watch whatever the fuck this kid is doing. Terrible shit. Do I sleep? Do I just",
            "start": 3531.74
        },
        {
            "text": "would be to be conscious for like, I mean, Colin's head the rest of his life. Jesus, can't do anything. I just got to watch whatever the fuck this kid is doing. Terrible shit. Do I sleep? Do I just sit there for eight hours in the dark? Yeah. Can I ever communicate? It's like a Dante's Inferno situation. Being stuck in Colin's head, I'd, Oh my God, I don't know if I can hit like that. I actually, no, I could not handle that. No, you couldn't. I'd like to be stuck in your head for like, no, you wouldn't. But you know, the thing was you didn't even know what he, you didn't know. He couldn't hear her thoughts or anything. So it's literally just like, you're just looking into someone's eyes. You remember this movie, right? That's the thing that makes it even worse to me. If I could hear his thoughts, then I'd at least kind of understand what was going on. But like, I imagine he reads a lot about things that I wouldn't understand. He also probably reads like way faster than you too. So",
            "start": 3574.54
        },
        {
            "text": "thoughts, then I'd at least kind of understand what was going on. But like, I imagine he reads a lot about things that I wouldn't understand. He also probably reads like way faster than you too. So you'd miss every other page. It would be really annoying. This sounds bad. Yeah, it's real bad. That's not what I, that's not, well, first of all, two things, two observations. One, it's funny Tim and I came to the same conclusion because that is exactly what I thought. Tell him large, large. I was fucking horrified. What does she do? Something happens. It's really scary. She does the weird face. And to this day, it is like, I had to look away when I, on the second and third and fourth time I saw that movie because I was so terrified. It came out of nowhere. And that's what you got to love about that movie. Yeah, it was, that was like, I, I used to rent that movie when I was a kid from the library and like my sister used to be like, all right, don't look now. It's like, this is what's",
            "start": 3611.66
        },
        {
            "text": "about that movie. Yeah, it was, that was like, I, I used to rent that movie when I was a kid from the library and like my sister used to be like, all right, don't look now. It's like, this is what's coming up. It freaked me out too. But the second observation is just that I wasn't going there with this because there's just, when you say something like this, like what parts of movies stick with you and like, you don't forget. And I think about scary things. What I think about is fire in the sky. Do you guys remember that movie? Oh my God. Don't even talk about it. Don't even, that movie, I watched that movie. So I love my parents. They're good people. They really do mean well, but they had zero concept of like what a child should watch and shouldn't watch. Like, you know, I saw movies like predator and alien and like, and Robocop in the movie theater. Like when I was like four or five, I don't even know how that whole, I got in there. I just remember seeing on the screen and fire in",
            "start": 3643.58
        },
        {
            "text": "predator and alien and like, and Robocop in the movie theater. Like when I was like four or five, I don't even know how that whole, I got in there. I just remember seeing on the screen and fire in the sky was one of those things where I rented it. I used to have a great relationship. Like, and when I say grid, I mean, I used to terrorize my local video store because remember back in the day you used to have to reserve, they'd only get like three copies of something in. So like you need to do reserves. They would see me coming and they, you know, I'd call up and be like, Hey, I need you to give me this copy of this thing. I know it's coming out. I check all the paper. And I used to have a little pamphlet when things come out. And so fire in the sky, I can't remember how I used to know. Oh no, that you'd go and they would have the, they would have listings coming out. And I would have like, cause I had nothing else to do. I was like, I just loved movies. That was all I wanted to do with",
            "start": 3685.98
        },
        {
            "text": "that you'd go and they would have the, they would have listings coming out. And I would have like, cause I had nothing else to do. I was like, I just loved movies. That was all I wanted to do with that. And like Reese's peanut butter cups were my jam. So I got fire in the sky. No idea what it was. I knew it was like kind of scary. Parents had no idea I was renting it. I go up and they used to have a VCR in their, in their, in their bedroom and I watch it and I get to like the horrifying part where he wakes up in the weird, like latex bubble cocoon and he like cuts himself floating. Tim doesn't know what this is. By the way, fire sky. It's so let's explain what this movie is first. And by the way, I saw this in the theater with my brother and it was horrifying. So, so, and I was like six or seven years old when I came out, uh, fire in the sky is a movie about these dudes. It's based on a true story apparently about guys, I think in upstate New York that are abducted by aliens. Like",
            "start": 3717.26
        },
        {
            "text": "or seven years old when I came out, uh, fire in the sky is a movie about these dudes. It's based on a true story apparently about guys, I think in upstate New York that are abducted by aliens. Like they're like, they're driving on like a country road and they're abducted by aliens. And it's about what the aliens do to them. Like, so like it's an alien abduction movie, but it's like not a joke. Like it's fucked up. It's not, it's totally fucked up. It's a fucked up movie. Like they, they have this scene. So he wakes up in this cocoon, right? Where like, and the alien walks in and he's like, either we, we can tell everyone on earth you had sex with a goat or you have sex with a goat. They bring in a goat in the camcorder and they're just like, what's it going to be? Um, they take, he, he, he's able to free himself. Right. And then he looks around and you realize that they're, that they have multiple little bays, little pods. They keep people in, there's like thousands of them. Right. So",
            "start": 3759.02
        },
        {
            "text": "able to free himself. Right. And then he looks around and you realize that they're, that they have multiple little bays, little pods. They keep people in, there's like thousands of them. Right. So they've done this before clearly. And he doesn't know what else is in their first rodeo. And so he's kind of floating in space, floating in space and he gets in like one of the hallways and then one of the aliens finds him. And it's one of those like insectoid, not, not, not insectoid, but like, you know, the big heads, like big eyes, Mars tax, but they're like really tall, really fricking terrifying. Right. And it grabs him with like this insane brute strength and just hauls his ass down this long tunnel. And he's seeing like kids shoes and like toys and like people's like garments all along this hallway. Right. Then they just randomly throw them on this table and they take this like sheet, like this little tiny, like really thin sheet and put it over him. And they hit a button and vacuum",
            "start": 3803.9
        },
        {
            "text": "hallway. Right. Then they just randomly throw them on this table and they take this like sheet, like this little tiny, like really thin sheet and put it over him. And they hit a button and vacuum seals him to the table. Do you remember that part? And he's, I'll never forget a second, it's over his face. And so he's screaming. And then when it vacuum seals to him, all you can kind of hear is the muffled scream as his mouth, like going in and out, gasping for air and they take a scalpel and they cut it open and then they cut his eye open so that only his eye and his mouth are there. Oh, wait, they cut the hole. They cut the hole around it. All you can see is one. You can see, but he's not, it's not for sight. So we can see and his mouth's open and they jam something down his mouth so he can breathe and like they do all this stuff to him. And then you just see a needle start coming down. Oh no. And it just starts coming down and it gets an inch and then they cut back to him like in the",
            "start": 3844.54
        },
        {
            "text": "breathe and like they do all this stuff to him. And then you just see a needle start coming down. Oh no. And it just starts coming down and it gets an inch and then they cut back to him like in the normal time. Like, I mean, he's just totally screwed up for the rest of his life because of this. And it's actually semi-based on a true story. Right? Yeah. I mean, those guys claim that that's what happened to them. Like I've only seen this film once and I remember that's how vivid it was. Yeah. I went back and watched it in college because I was like, this movie scarred me because I used to go to the movies with my brother all the time. My brother's 11 years older than me. We used to go see fun movies like TMNT or, you know, like, you know, Batman and stuff like that. But this is one of the movies where I was like, I want to see Fire in the Sky. And he's like, all right. D.B. Sweeney, right? Wasn't that him? No. Yeah. Who was the main character? I don't, I don't remember that, but that",
            "start": 3881.34
        },
        {
            "text": "movies where I was like, I want to see Fire in the Sky. And he's like, all right. D.B. Sweeney, right? Wasn't that him? No. Yeah. Who was the main character? I don't, I don't remember that, but that movie really was hurt. Like that, when I think about a movie that really fucked me up, like that was one of the, that movie like really haunted me. It was very similar to like reading for me. I used to read Ray Bradbury a lot. I don't know if you've read him like old sci-fi writer from like the forties and fifties. He used to write Twilight Zone episodes and stuff, but he's like a prolific sci-fi writer. And he wrote this one story about aliens that only children can see. Have you ever, did you ever read this story? Like it's all about like, if I remember correctly, like kids would go into their parents' kitchens and steal like all this shit. And like the parents weren't sure why they thought they were playing. Like they'd steal a bowl and they put it over their heads and all this stuff.",
            "start": 3911.18
        },
        {
            "text": "parents' kitchens and steal like all this shit. And like the parents weren't sure why they thought they were playing. Like they'd steal a bowl and they put it over their heads and all this stuff. It ended up being that they were like giving the aliens like all of this shit, like just like supplies and all this kind of stuff. And like only the kids can see them. Like that was the kind of shit that used to scare me. For some reason I was always scared even though fascinated by aliens. Well like, but by the way, when we grew up, it was like no holds barred. We had these weird movies. Remember the movies about like trolls and dwarfs and stuff that would crawl out of holes and like mess with kids? I don't know. There was a movie called, I think it was called, was it Troll 2? No, it's true. That's a scary movie. Maybe. Leprechaun. Leprechaun was terrifying. Leprechaun in the hood. So by the way, it was DB Sweeney as the main character. Let me see the poster. Yeah, it's the one where the",
            "start": 3950.38
        },
        {
            "text": "That's a scary movie. Maybe. Leprechaun. Leprechaun was terrifying. Leprechaun in the hood. So by the way, it was DB Sweeney as the main character. Let me see the poster. Yeah, it's the one where the guy's getting like shocked by the thing. And I love, and I love, by the way, I just love the name of that movie. Fire in the Sky is like an awesome name. Yeah, I mean look at this poster. Yeah, it's even terrifying. The guy that directed this apparently, by the way, went on to direct D3, The Mighty Ducks. Oh, that's a great connection. I want to see the poster real quick. Another one that got me was Amityville Horror. I never saw that. Oh, really? I was always, in the same way like people get into aliens, I was really into ghosts. And they scared the hell out of me, but I would still want to know more about them. And Amityville Horror is one where I remember watching at a friend's house and just being so fucking scared, like I was going to shit my pants. I know where Amityville is. The",
            "start": 3983.82
        },
        {
            "text": "know more about them. And Amityville Horror is one where I remember watching at a friend's house and just being so fucking scared, like I was going to shit my pants. I know where Amityville is. The island. Yeah. But there's a point in that thing where the girl has an imaginary friend, and you're doing wrong, and now it's all dumb and movies. It's hard to make a good ghost movie now. But the kid's talking and talking to this imaginary friend, and the mom goes, he's like, who are you talking to? And she's like, Jody. Oh, where's Jody now? And she's like, she's out the window. And you look out the window, there's like two glowing eyes there. I remember that being the fucking freakiest thing. The Amityville Horror really happened, at least. Yeah. But then they went back on the story, but then they went back on that story. But like, so here's a little funny story for Amityville. It's like right, like a few times away from where I grew up. And I used to go there when I was in college, when",
            "start": 4025.5
        },
        {
            "text": "they went back on that story. But like, so here's a little funny story for Amityville. It's like right, like a few times away from where I grew up. And I used to go there when I was in college, when I'd go home, I was in a band called Paper Chip. We talked about this when we used to play this place called the Village Pub, which was like downtown Amityville. And like a mile away was the Amityville Horror House. You can go see it. So like me and my friends would, you know, we would go like walk down there before a show or whatever and like go to the house. And what's weird is like the house really is freaky. Like the house doesn't face the street. Like every house is like faces the street except for this one like faces sideways. I think it is. It's like there's just something off and weird about it. And we would just stand in front of it, like look at it and be like, this is fucking totally weird. You know, I just like the guitars on your back. You like you have the drumsticks. You're",
            "start": 4062.06
        },
        {
            "text": "about it. And we would just stand in front of it, like look at it and be like, this is fucking totally weird. You know, I just like the guitars on your back. You like you have the drumsticks. You're totally like, it's totally weird. Long Island has like a lot of weird people. Yes. But like a lot of like a lot of weird families. Yes. But like, like a history, like a weird possession kind of history, like Indian burial grounds, like all sorts of, you know, Long Island was very, you know, that's why all of our town names are very weird is because of, you know, Indian tribes and stuff like that. We took those names, Hop Hog, Rongkang, Hmong, Patjog, et cetera, et cetera. And like, so there's something creepy just about Long Island in general. Everything's kind of, let's see, a lot of people are from California or from, even from the Midwest don't quite know what old is in American terms. Sure. Like where we have legitimately houses from the 1700s, like that would be unheard of out here.",
            "start": 4094.22
        },
        {
            "text": "are from California or from, even from the Midwest don't quite know what old is in American terms. Sure. Like where we have legitimately houses from the 1700s, like that would be unheard of out here. And like, so like when you have, like when you have a whole, you know, set of these old ass houses and they just all have this kind of haunted kind of aged historic field of them, it makes everything a little more scary. You know what I mean? Yeah. We also have something, you know, we have Brookhaven National Laboratory, which is fucking ridiculous. I'm from Brookhaven and it's like right next to us, whatever. What is it? It's a national lab, like super secret national lab. Oh, okay. Like Fermilab. Yeah, exactly. It's where the video game was invented. Oh, okay. And ironically, and Higginbotham lived in my town. But there's like all this, so people would like sneak into Brookhaven National Lab's land to try to like find things and they used to get arrested and so yeah, it's a thing out",
            "start": 4133.82
        },
        {
            "text": "lived in my town. But there's like all this, so people would like sneak into Brookhaven National Lab's land to try to like find things and they used to get arrested and so yeah, it's a thing out way out east on the on the forks called Camp Hero, where there's like a huge abandoned satellite dish and there's like all these stories about it. So there's like all this weird haunted history on Long Island that's a little bizarre. So I always kind of, that was always kind of part of my upbringing was like, how freaky can you get? What is going on? All right. So there's, there's when I was a kid, obviously, I mean, this is when a lot of this stuff got was get you right. Nowadays you've got movies like, you know, you got movies like the Human Centipede, things like that that are supposed to, that's not supposed to be scary. No, it's me. But you know what the fuck that is. It's a really weird movie. What is it? It's a movie about a deranged doctor who decides to kidnap a group of people. It's",
            "start": 4174.38
        },
        {
            "text": "not supposed to be scary. No, it's me. But you know what the fuck that is. It's a really weird movie. What is it? It's a movie about a deranged doctor who decides to kidnap a group of people. It's torture porn. It's torture porn. It came out during the whole together. He stitches them together like a centipede. So ask them out. Ask them out. Yeah. And then eventually like one of them dies because there's three people if I never saw it, but I think I think there are from what I read, there's three people and then it's asked him out, asked him out. And then like, you know, that was it. And then there was a sequel called full, the full sequence or whatever. And then supposedly that when he just went like balls to the wall of just how disgusting can I be? And it was something like there was like 15 people in a thing. And that's the third sequel coming out called the final sequence or whatever. And it's 100 people asked him out. Okay. Well, I got to see this, but those movies don't really,",
            "start": 4212.94
        },
        {
            "text": "15 people in a thing. And that's the third sequel coming out called the final sequence or whatever. And it's 100 people asked him out. Okay. Well, I got to see this, but those movies don't really, you know, I think back in the, in the lineage of movies that is sort of not terrified me, but really just kind of shook me. Silence of the Lambs is one of them. There's the sequence where it's the guard sequence, right? And it's not the blood that gets me. It's when you realize that Hannibal Lecter has the upper hand. It's the second, the guard goes to close the cage and the cuffs hit his hand. Right. And then you see Hannibal Lecter who, and he beats the one guard to death. And then he goes over to the guard. That's like basically like dying. And he picks up like the razor. Right. And he's like, I forget what he says, but he says this horrible thing to the guy. And you know, the guy's just dead and you don't see what he does to him until later when he strings the guy up like an angel, like",
            "start": 4253.26
        },
        {
            "text": "I forget what he says, but he says this horrible thing to the guy. And you know, the guy's just dead and you don't see what he does to him until later when he strings the guy up like an angel, like a tortured angel and cut his face off so that he could put his own, the guy, the guard's face on his and sneak out that way. Things like that were like really twisted, insanely intelligent things. Like something you would do, like a psycho would do, but he's super smart. That's always stuff that used to freak me out. Cause you can't, you can't, no matter what you do, there's no defense against that. Right. Yeah. There's, there's something about that. I mean, that's a great movie, right? Like my earliest memory of that movie was, I think like it was like was confused about the scene where agent darling, whatever her name is, right. Is that her name? Starling. Starling. Yeah. Goes in. Clarice. Yeah. Clarice. Right. Goes in like to meet Hannibal for the first time. And one of the criminals",
            "start": 4305.26
        },
        {
            "text": "darling, whatever her name is, right. Is that her name? Starling. Starling. Yeah. Goes in. Clarice. Yeah. Clarice. Right. Goes in like to meet Hannibal for the first time. And one of the criminals like grows something at her. And I was like, and I was like, what is that? You know, like a kid or whatever, didn't not understand what it was like, what was going on in that scene until like, I was like 20 bro. Yeah. But there's always this, like we talked about, there's just a trifecta of things that are always scary in film, right? It's, it's religion is always creepy. Oh yeah. Right. And to me, history is always creepy when they use it right. And kids. Oh gosh. So that leads me to my next, the thing that probably left indelible marks on me was Poltergeist. The part, there's like nine parts in that movie. Well, I'm sure we'll get to all of them. The part with a clown to this day has me still looking out of my bed. Like I cannot, I could not deal with that scene. Like when the clown comes",
            "start": 4344.14
        },
        {
            "text": "that movie. Well, I'm sure we'll get to all of them. The part with a clown to this day has me still looking out of my bed. Like I cannot, I could not deal with that scene. Like when the clown comes to life and drags the kid. And it's just like, don't do that. There's also, and that's, this is why Steven Spielberg back in the day and still to this day, of course, is amazing. But back in the day, he just had those, like, he would really know how to set the scene. And they had those, they didn't want to leave the house. Right. Cause Carol Ann was missing and they had those haunting moments where she was like, speaking to them from the TV. Right. And Mary Jo Beth's like, Carol Ann. And she's like, mom. And you hear that kind of like resonating crazy, like techno sound from like the beyond. Right. But then they ended up staying in the house. Right. Because they call on like the clairvoyant and she comes in and she's like this house, it's clear, but she starts speaking really softly and",
            "start": 4389.66
        },
        {
            "text": "Right. But then they ended up staying in the house. Right. Because they call on like the clairvoyant and she comes in and she's like this house, it's clear, but she starts speaking really softly and really slowly. And it's really freaky. Yeah. Cause you're kind of like dollying it on her, like really slowly talking about like what's going on. And simultaneously though, you do feel a crazy sense of like warmth and home, which is why I thought that like everything you did in that movie was phenomenal, but still terrifying. And at the end, the damn house like engulfs itself. Yeah. It's a scary movie. It was so much in that. The talking to the TV, like the, just the scene where the kids talking to the TV and like, you don't see what she sees, you know, it's, it's, my favorite part of the movie has always been that the parents just don't stop getting stoned ever. That's like the whole thing in that movie is like, they're always in their bedroom, just smoking weed, like constantly. I was",
            "start": 4431.1
        },
        {
            "text": "has always been that the parents just don't stop getting stoned ever. That's like the whole thing in that movie is like, they're always in their bedroom, just smoking weed, like constantly. I was like, all right, well, that's how you're going to deal with that. Just kill it. Oh, they also had another, another amazing, I think it was in poltergeist two with the worm. Do you remember that one? Might've been the third one. There's a part where Craig T Nelson's drinking tequila to cope and the worm in the, at the bottom of the tequila bottle kind of wakes up and looks around and then goes down his throat and like possesses him. Yeah. That's a good, I mean, my, my, my favorite, I think we've talked about this on the show before, but my favorite scary movie is still Rosemary's Baby and The Shining are like two and three. Well those are, yeah, those are classic. But my favorite is Children of the Corn still like, cause Children of the Corn is based on a Stephen King short story, but I just",
            "start": 4476.94
        },
        {
            "text": "are like two and three. Well those are, yeah, those are classic. But my favorite is Children of the Corn still like, cause Children of the Corn is based on a Stephen King short story, but I just fucking love the premise of that movie. What, I don't think I've ever seen Children of the Corn. What's the premise of it? It's about two, have you seen it before? Yeah. It's, it's, it's an excellent movie. It's a short story. You should read it too, but it's, it's a great movie. It's about a doctor, like a young kid who's like 28 and he just became a doctor and like his girlfriend, he just graduated and they're like driving home like across country and they like end up in this town in like Oklahoma or something like that, Texas. And it's like, like they're having car trouble and they like pull into the, it's Gatling, Gatling is the name of the company. And what, basically what the movie's about is like the, the kids in the town, like all the young kids basically took the town over, killed all",
            "start": 4508.3
        },
        {
            "text": "the, it's Gatling, Gatling is the name of the company. And what, basically what the movie's about is like the, the kids in the town, like all the young kids basically took the town over, killed all the adults and like revered these two kids, like older kids as their God. And so like, they've maintained like the facade of this town for like two years. No one knows anything's wrong because they have like a few adults that they've left alive that like keep everyone at bay and make things seem normal. But like, really like they have and they meet in the cornfield or whatever, like, and they like commune in this cornfield where this guy, Isaac, who was like the kid that they all revere is like a God. And they have like all this weird, like religious imagery and shit like that. It's like so fucked up. Yeah. I remember that movie being really just like, it's awesome. Freaky to the point of where it's like, I don't know what's happening really. Like, I don't know what all this shit means, but",
            "start": 4544.14
        },
        {
            "text": "up. Yeah. I remember that movie being really just like, it's awesome. Freaky to the point of where it's like, I don't know what's happening really. Like, I don't know what all this shit means, but that scares me even more. Like not understanding this is scary to me. Surprised me that you have never seen that. No, I never have. I always want to see it. It's on Netflix. Another, maybe I'll check it out tonight actually. Another, I mean, Stephen King, basically everything he did freaked me out. But the thing that, the thing that actually one of the ones that I do now remember that stuck with me was, do you remember It? Yes. That was the first time I legitimately remember thinking I cannot watch this. I can't finish this. I don't know. I shouldn't be watching this. And I can't remember if it was a movie or a mini series. I feel like it was like a three-part like mini series on TV. That and The Stand were both miniseries. What was The Stand? The Stand was the post-apocalyptic book he wrote",
            "start": 4581.18
        },
        {
            "text": "a movie or a mini series. I feel like it was like a three-part like mini series on TV. That and The Stand were both miniseries. What was The Stand? The Stand was the post-apocalyptic book he wrote about like the virus or whatever. And it's about like different people that survive it or whatever. It's a great book. I should check that out. It's a fantastic book. It's long, but it's good. No, it is. So The Stand was like a mini series on TV. Okay. Yeah. They did a lot of those, but it was one of those where I started watching it and I was hooked. And then as it kept going, I was like, this is really terrifying. This is like, and I'm sure I'm remembering it throughout a child's eyes. Cause I'm sure if I watched today, I'd be like, Oh, Tim Curry is the clown. That's the way I feel about some of the things I've seen. I mean like, yeah, I used to be, what was that? What was that one horror series that I used to be horrified of the Hellraiser. Oh, those were kind of weird though. Yeah. They",
            "start": 4624.22
        },
        {
            "text": "of the things I've seen. I mean like, yeah, I used to be, what was that? What was that one horror series that I used to be horrified of the Hellraiser. Oh, those were kind of weird though. Yeah. They were weird. Like Lawnmower Man and all that kind of shit. Like I was like, there were certain movies, like when I go back and watch them now, I'd be like, yeah, Lawnmower Man was badass. Puppeteer scared me. Was it called Puppeteer? Yeah, the Puppeteer. Where there was those little toys and stuff. That scared me because of the animation. Like how they looked, it was like kind of claymation, but kind of not. And like, it was so jerky and like it looked freakishly like that's how I imagined toys would move. Yeah. Like they only have like three joints. Yeah. Which is really jerky and weird. And like, it was, that was scary. That was the worst. I want to give just a special shout out real quick. It's not a horror movie, but I want to give a special shout out to Alive because that was another",
            "start": 4657.9
        },
        {
            "text": "like, it was, that was scary. That was the worst. I want to give just a special shout out real quick. It's not a horror movie, but I want to give a special shout out to Alive because that was another movie that used to scare me. Oh yeah, man. Being stuck in the Alps. Wait a minute. That's crazy. I was going to bring that up earlier too. It was one of like the, when they had to eat them, like the each other, that is something that stuck with me when Greg initially brought this up. I was like, that will forever stick with me. The first thing when I was like, whoa, that's a creepy movie. Well, that'd be a fun topic for the next show. Would you eat me if we were stuck in the Alps? I don't know. I don't know. I've thought about that situation before just generally like, would you be accountable? Like the Donner party, right? Yeah, I probably would. Will you do what you have to do? I guess like, there's such a faux pas of eating human in our society, most societies, which is understandable.",
            "start": 4699.18
        },
        {
            "text": "Like the Donner party, right? Yeah, I probably would. Will you do what you have to do? I guess like, there's such a faux pas of eating human in our society, most societies, which is understandable. Yeah. There's some societies that that's not looked down upon. I don't think it's like a societal Moray issue. I just think it's, we're like the apex, like the alpha, the apex predator. Like we don't eat our own. Yeah. And we're also self-aware. Yeah. So it'd be a little freaky to eat, Colin. Yeah. I'd probably take a slice of you. I'd go to you before I go, Greg. Really? I feel like Greg's got a lot of good meat on him. I want some of that Italian beef. Yeah. I don't know if it translates so well when it gets to like the exterior parts, you know, Greg, Greg tastes like a hot dog. That's what I heard. And beer. Just tastes exactly like beer and poches. Yeah. For me, going back to the kids, it's not a movie, but the game Fatal Frame 2. Did you play that? Crimson Butterfly. Crimson Butterfly.",
            "start": 4737.02
        },
        {
            "text": "heard. And beer. Just tastes exactly like beer and poches. Yeah. For me, going back to the kids, it's not a movie, but the game Fatal Frame 2. Did you play that? Crimson Butterfly. Crimson Butterfly. Yeah. Looking at it now, it's like, okay, whatever. This is stupid. This is not scary at all. When I first played it, I think it was Eleven and which was, it's old for being scared by things like that. But it's story, these two little girls, I don't even remember exactly the details, but it's like two twin girls or something. And they have the camera and like, you take pictures of ghosts and shit. And like, you only see the ghost of the camera. And I remember playing it and it was more of a situational thing where in my, the house that I was living at the time, the only place I could play games was in this back room that had a lot of sun in it. And so there was a lot of glare on the screen and it was really hard to see. And it was me and my friends sitting there trying to like make out",
            "start": 4780.46
        },
        {
            "text": "was in this back room that had a lot of sun in it. And so there was a lot of glare on the screen and it was really hard to see. And it was me and my friends sitting there trying to like make out what the path we were supposed to be going on, but you couldn't really see because like there was so much glare, which just made it so much scarier and we're dead quiet playing. And the controller didn't vibrate the entire game. And we walk over to the door and it just starts shaking. I didn't know it was going to shake. I've never been more scared in my life. And I had nightmares about that. And that's the first thing I can think of. Fatal Frame. Fatal Frame 2. Yeah. And that was crazy. Are you done? Yeah. You missed a good topic. I'm sorry. Was it Colin's? It was your topic. Oh yeah. I enjoyed most of what I heard. It was good. Then I had to leave for the one piece. Colin, take us home. So I like science very much. Now I'm not much of a math guy. I'm not much of a hard science guy. I",
            "start": 4826.22
        },
        {
            "text": "most of what I heard. It was good. Then I had to leave for the one piece. Colin, take us home. So I like science very much. Now I'm not much of a math guy. I'm not much of a hard science guy. I understand a little bit of it. I like reading more about it, about the theories. I like chemistry, especially in physics. I think those are very interesting. But I also like astronomy a lot. And I've always been really fascinated by specifically the planets in our solar system. And as you grow up, you're kind of fascinated by them, right? You're kind of fascinated by space and astronauts and all this kind of stuff. Space travel. Obviously we're all kind of nerdy. We like sci-fi a little bit to varying degrees. And so I have a very simple question for you is like, what's your favorite planet? Uranus. Gotta get it out there. Goats Uranus. Mm-hmm. Earth. We're on it. Earth? It's like my least favorite planet. It supports life. We're on it. It's got nice colors. Yeah. I got to give a shout out to",
            "start": 4864.46
        },
        {
            "text": "Gotta get it out there. Goats Uranus. Mm-hmm. Earth. We're on it. Earth? It's like my least favorite planet. It supports life. We're on it. It's got nice colors. Yeah. I got to give a shout out to earth too. It's a good place. It's the most aesthetically pleasing. I think we've got the most variety here. I go close second Mars just because there's so much mystique. I don't like Mars. Martian man hunters home. What's on Mars? We don't know, right? We just landed there. That face. We got rovers. Yeah. We got some rovers on there. We got some satellites. We're sending the suicide mission to Mars, which, you know, we talked about. We're not sending it. Well, yeah, my private company is doing it. Yeah. Are they actually doing that? Yeah. I didn't know that. Yeah. Mars. What is it called? Mars one or something like that. I would say Pluto, but not anymore now. I know. You hear about Pluto, man. Great episode of Nova about Pluto and how it was removed from being a planet. What really is",
            "start": 4911.18
        },
        {
            "text": "one or something like that. I would say Pluto, but not anymore now. I know. You hear about Pluto, man. Great episode of Nova about Pluto and how it was removed from being a planet. What really is knowing Saturn with its high fluting bullshit. Oh, I got a ring around me. Everybody look at me. Do something. That's so cool. It's just ironic though, because like four planets have rings around them, but we just couldn't see them. Yeah. You know, Saturn's are so prominent. Jupiter has rings. Uranus has rings and Neptune has rings. Jupiter's the biggest of all the planets, right? Yes, by far. You can fit all the other planets in Jupiter. Yeah. Big shout out to Jupiter for that. Big shout out to Jupiter. Jupiter might be a failed star. It might've been a binary system. Also the coolest name. Jupiter. Yeah. God of war. Sounds about us. What was Jupiter? No, God of war is Ares. No, there was Roman and Greek gods. Yeah. Jupiter might be the God of war. Was that Mars? Mars might've been the God",
            "start": 4952.86
        },
        {
            "text": "Yeah. God of war. Sounds about us. What was Jupiter? No, God of war is Ares. No, there was Roman and Greek gods. Yeah. Jupiter might be the God of war. Was that Mars? Mars might've been the God of war. Yeah. Cause it's red. Yeah. It's a red planet. Jupiter was what? Ooh, speed. Let's look at this up. This'll be fun. You guys talk amongst yourselves. Mercury is the messenger of the gods. That's why it's so close. What's your favorite planet? Neptune. I don't know. Neptune's a good planet. It gets underrated though. Who the fuck? Dude, who cares about Neptune? Neptune, I remember in high school, I couldn't remember. I named all of them. Couldn't remember Neptune. Started asking all my friends. I'm like, name all the planets. And like five people named all of them, but Neptune. They're like, oh shit. I don't know what that last one is. And there you go. You know, I got to give a shout out. Just baked me. I never needed that. It was my, my, what is it? My very. I thought it was my very",
            "start": 4992.78
        },
        {
            "text": "oh shit. I don't know what that last one is. And there you go. You know, I got to give a shout out. Just baked me. I never needed that. It was my, my, what is it? My very. I thought it was my very energetic mother. Just baked, made me just, I don't know. Can we all name them? I don't think I could name all of them. Mercury, Venus, earth, Mars, Jupiter, Saturn, Uranus Neptune. There you go. That's exactly what I was going to say. I got to give a shout out to like, I liked all the planets for different reasons. Sorry. Jupiter was the the Zeus. Oh, so the God of the gods. The God of the gods. Yeah. That makes sense. Mercury is cool because, you know, it's right. It's tiny planet, heavily cratered. Very dense. Very close to the sun. Barely see it. Right. I like that. Venus is interesting because Venus has a runaway a runaway what do they call it? Bride. A green, a greenhouse gas. They have like a runaway greenhouse effect. A lot of problems there too though. Like, so Venus, even though",
            "start": 5028.7
        },
        {
            "text": "Venus has a runaway a runaway what do they call it? Bride. A green, a greenhouse gas. They have like a runaway greenhouse effect. A lot of problems there too though. Like, so Venus, even though Venus is further away from the sun is actually much hotter than Mercury because of the runaway greenhouse effect there. Like they, that is an example of what it's like. It's also the strid, the runaway stridestand effect. Earth obviously we're here on earth. Mars is cool because Mars is a parallel to us and we, we have like a strange fascination with that planet. I understand that. We could live there. Closest and we haven't gotten to it. No, no men haven't stepped on it. That's why we're super stoked. Soon. Soon. Then we have the asteroid belt, which was a planet. Not anymore. How long does it take to get to Mars? When was it a planet? Nine months. It was a planet before it was destroyed. Two, three years ago. Oh. What? Yeah, like the asteroid, the asteroids aren't just there for special",
            "start": 5080.7
        },
        {
            "text": "take to get to Mars? When was it a planet? Nine months. It was a planet before it was destroyed. Two, three years ago. Oh. What? Yeah, like the asteroid, the asteroids aren't just there for special reasons. It's the same reason why there are rings around them, around the planets because those are destroyed moons. Did we ever know it was a planet? I mean, it wasn't a planet in our lifetime. Okay. No, no, like billions of years ago. That would be awesome to see some shit like that. We'd die if we saw something like that. And then we come to the gas giants, right? So now the planets are no longer made of rock and mineral. Now they're made of gas and Jupiter is huge. It's huge, very stately planet with a fucking ton of moons, like 60 moons, you know, and that, that to me is like awesome on its own. Come on, it's baller. And, and, and it's got its own ring. We didn't know that until we went there with, I think Voyager. So do we need to like redesign what we look at? Like are all the kids",
            "start": 5120.22
        },
        {
            "text": "own. Come on, it's baller. And, and, and it's got its own ring. We didn't know that until we went there with, I think Voyager. So do we need to like redesign what we look at? Like are all the kids at the science fairs right now really fucking up and not putting rings on Jupiter? No, because I don't think like that's not, it's the red spot is it's prominent feature. You know, you want to focus on the red spot. Of course. It might be the death star growing up. Jupiter did? Yeah. Oh, because of the, yeah, I see, I see, I see. Saturn's cool because of the rings, obviously also a ton of moons. Also has Titan, which might be the, the body other than earth most likely to support life, which is very cool. Back to Jupiter. Jupiter has, what is it? Io, which is the, the ice planet or the ice moon that they think might have a full ocean underneath it that could support life, which is pretty cool. Are we ever going to find life on any of these planets? Microbes, some planets in our system.",
            "start": 5157.74
        },
        {
            "text": "moon that they think might have a full ocean underneath it that could support life, which is pretty cool. Are we ever going to find life on any of these planets? Microbes, some planets in our system. Probably not. Maybe Mars, maybe Titan, maybe IO. I mean, those are the, those are the targets, but certainly life in other. There's a lot of hot women on Venus. No, none. Nope. Why are they from Venus? It's just an analogy. Well, who came up with that? Where'd that come from? The guy who wrote the guy who wrote the book, the guy who wrote the book, the guy who wrote the book, the guy who wrote the book, the guy who wrote the book. Fuck that guy. That was a big book in the nineties. Looking at some images here. I'm looking at the scale of how big Jupiter is compared to everything else. It's big. It's huge. It's not small. That's why they're saying like, so when a, when a star turns on, it gets, it gets big enough and hot enough. And they, and some people think that Jupiter was a failed",
            "start": 5200.94
        },
        {
            "text": "big. It's huge. It's not small. That's why they're saying like, so when a, when a star turns on, it gets, it gets big enough and hot enough. And they, and some people think that Jupiter was a failed star, like a Brown dwarf, right? Like a star that just didn't turn on. Because if you think about tattoo, a good example is Tatooine, right? Tatooine's in a, in a binary system, two stars, right? And we might, and we might've, we might've had a, well Sirius is a real example, right? Like Sirius is really a binary. Yeah, but we all know Tatooine. Right. So maybe we would have been on a system and then you get to the blue plants. So like, you know, Uranus is in a nice green, sea green color. What's interesting about Uranus was that it was a, there was an ancient collision with another huge body that sent its axis on the side. Like Tim can't even. I can't handle it. Uranus. Is it Uranus? It's, it's, it's Uranus. But is, do you think if we had to right now, lives depends on it. The four people",
            "start": 5232.94
        },
        {
            "text": "sent its axis on the side. Like Tim can't even. I can't handle it. Uranus. Is it Uranus? It's, it's, it's Uranus. But is, do you think if we had to right now, lives depends on it. The four people at this table would know more about the planets in our real solar system or in star Wars. I would know more about the real solar. I 1000% would know more about star Wars. I don't know about the real, you know, about individual plant. Unless you can name any of the other, if you could name another, can you name another planet and tattooing system? Cause I can, can you guys name another, another, another planet in that system? There's another plan in that system. Yeah. There's other planets. Dantooine is another planet in that system. Dagobah. Where's Dagobah? Dagobah is in the Dagobah system. Well, that's easily. Uncle Ben. Where's Hoth? Hoth's in another system. Far-flung. Padme. Padme is a woman. But, but, but, but yeah, so I feel like there's a lot of diversity in the, you know, I, it's",
            "start": 5274.46
        },
        {
            "text": "that's easily. Uncle Ben. Where's Hoth? Hoth's in another system. Far-flung. Padme. Padme is a woman. But, but, but, but yeah, so I feel like there's a lot of diversity in the, you know, I, it's hard for me to pick a planet. I really like Uranus story, you know, a lot because there's this ancient collision with it. Like Uranus, you know, if you look at the planets that rings, right? I just can't do it. Stop saying it. Uranus. The rings go around like normal, right? But like Uranus' rings go around the other way, like, you know, vertically. And it's because, and its axis is actually vertical. So it was actually sticking out. It's because it was knocked like really hard by another object. It's cool that we have like, So something big rock hard went into Uranus. Yeah. Something really hard went into Uranus. And it's, it's just cool that we have like all this ancient evidence of all this shit happened. Like the asteroid belt being a planet. We know it was, but we've never seen it. Like,",
            "start": 5317.1
        },
        {
            "text": "went into Uranus. And it's, it's just cool that we have like all this ancient evidence of all this shit happened. Like the asteroid belt being a planet. We know it was, but we've never seen it. Like, it's just cool that like the, the, the socialist was like 5 billion years old. So, and the universe is 13 billion years old. So there's like all this cool, That's not fact. It is. Theory. 13.7. It's theory. But there's all this cool evidence of all this cool cosmic shit that happened. That's what I'm really fascinated by. It's the same thing with like, you know, they think that there was a rogue planet that ran into the earth back in the day that gave us the moon. And we realized that because the moon is made of the same stuff that the earth is. And we only knew that when we sent the Apollo astronauts there. And so what they think is, I think they call it Via, I think is the planet that knocked into the earth, probably disintegrated or kept going out of the system. And then like all of",
            "start": 5360.86
        },
        {
            "text": "astronauts there. And so what they think is, I think they call it Via, I think is the planet that knocked into the earth, probably disintegrated or kept going out of the system. And then like all of the dust, like went around into a ring and then became the moon. That's why the moon is getting further away by two inches every year, because it's been, you know, it's flinging itself out technically. You're blowing my mind right now. So there's a lot of cool stuff. So you're saying in 50 years we won't have the moon anymore. No, I'm not saying that. Everybody quote them. And, and what's so funny to me about Pluto is Pluto is a cool planet. Pluto we've never really seen. I mean, Pluto is so small. Why did Pluto get downgraded from a planet? So Pluto is a dwarf planet because it, the, the, the, the definition of planet is that it has to be a large body that clears its orbit and the orbit of Pluto crosses into the orbit of Neptune. So you guys remember when you were kids, Pluto was actually",
            "start": 5393.66
        },
        {
            "text": "the definition of planet is that it has to be a large body that clears its orbit and the orbit of Pluto crosses into the orbit of Neptune. So you guys remember when you were kids, Pluto was actually closer to the, to the earth than Neptune was for awhile. And then they cross back over. So because Pluto doesn't have its own elliptical orbit around the sun, but rather crosses into another orbit, it is not a planet. Plus there are bigger bodies in, in the outer solar system than Pluto that we just didn't find at the time. Pluto is actually not the biggest dwarf planet. How many planets do we know about? Dwarf planets? Yeah. I think there's like 10 or 12 dwarf planets that are like of some significance. There's one in the asteroid belt too, but you know, what, what, I think they like being called little planets. Little planets? Yeah, little planets. But what's so funny to me is that in 2005 we sent this before Pluto was downgraded, before anyone, everyone stopped giving a shit about",
            "start": 5427.82
        },
        {
            "text": "called little planets. Little planets? Yeah, little planets. But what's so funny to me is that in 2005 we sent this before Pluto was downgraded, before anyone, everyone stopped giving a shit about Pluto, we sent New Horizons, which is a probe like to Pluto. Pluto is so tiny. Pluto is like the size of the moon. We've never really seen it. When you ever look at pictures of it, it's like two pixels. Yeah. And like, we don't really know anything about it. You know, Charon or Charon, depending on how you say it, is, is a, is a, it's moon. And we've never seen it either. We just know it's there because of like the way the planet wobbles. And in fact, they wobble around each other around a center, a point in the middle, which means that one and the other are like not that much different in size. They actually like rotate around the center space. What's the center space? Is that another planet? No, it's just like a point in between them, like a point, a center point in gallery. But what's",
            "start": 5470.94
        },
        {
            "text": "They actually like rotate around the center space. What's the center space? Is that another planet? No, it's just like a point in between them, like a point, a center point in gallery. But what's funny is that New Horizons is still going to Pluto and it arrives next year. And it's, and that's like, what's so cool is like, we're finally going to see this fucking planet. You know, like I'm really excited about it. What if we get there and you see cities? What propulsion do they use to get something that far out in space? Is it solar? Yeah, it's solar, but like they, they use, you know, what they call gravity assist. So like they'll send, I think with new horizon, they actually sent it into the inner solar system. And then it like swings around, like a swing around Venus and like get a gravity assistance. Shoot. It's like angry bird space. I was going to go Star Trek where they go back in time to save the whales, but what are the other angry bird spaces? So anyway, I just want to talk a",
            "start": 5507.74
        },
        {
            "text": "assistance. Shoot. It's like angry bird space. I was going to go Star Trek where they go back in time to save the whales, but what are the other angry bird spaces? So anyway, I just want to talk a little about the planets. That was insane. Are you watching the cosmos? The amount of facts and names. Should I watch the cosmos? Yeah. Neil, Neil deGrasse Tyson's fucking awesome. He seems like a bad-ass. I have such a crush on him, man. I really do. Like he's so fucking smart. Like I love listening to him talk. And did you want, you watched Carl Sagan's cosmos, right? I tried to, it's a little, it's a little dated. It's so good. It's so good though. Do you like scientists say we'll never know what happens on the moon. That's not, that's not that dated. But, but it's cool because it's not only about the planets in space, it's about life and like how, where life comes from. The last episode was really cool. A lot of it was about dogs and like the diversity of dogs and how the diversity of",
            "start": 5544.7
        },
        {
            "text": "about the planets in space, it's about life and like how, where life comes from. The last episode was really cool. A lot of it was about dogs and like the diversity of dogs and how the diversity of dogs that we found are only like 25,000 years old or something like that. Like, like not old at all. Like the, the wolf was 25,000 years old and then Portillo is today. And like everything that happened in between with dogs and between like wolves and now are like happened in that short time period based on forced evolution. And they're talking about natural selection, about how this happens naturally over longer periods of time. It's very fascinating show. That's fucking cool. Wait. So like dogs, like I know dogs, so not wolves, not crazy stuff, just normal dogs. When did those first come? Like they were domesticated over time. Like what, what they were basically saying was like during like, you know, when Cro-Magnon was like roaming Europe, whatever, they'd have these wolves at bay and",
            "start": 5587.26
        },
        {
            "text": "they were domesticated over time. Like what, what they were basically saying was like during like, you know, when Cro-Magnon was like roaming Europe, whatever, they'd have these wolves at bay and the wolves would be there. It was actually really well, like very eloquently explained. Like where they would say like they, the wolves like wanted food. They were afraid of fire for instance. Right. So like they would keep them away, but then they would realize that the humans realized that the Cro-Magnon realized that they could encourage the wolves to protect them and bark into all these things if they fed them. And then like created this sort of, you know, system where like one is being protected and taking, you know, and the other is being taken care of. And like this caused the rapid domestication of dogs, like from wolves out of no, like out of nowhere. Interesting. And that because they were able to like natural selection happens over a huge period of times, like the Galapagos, the",
            "start": 5625.42
        },
        {
            "text": "of dogs, like from wolves out of no, like out of nowhere. Interesting. And that because they were able to like natural selection happens over a huge period of times, like the Galapagos, the Galapagos Islands, Galapagos Islands, or like the finches on all these different islands, right. And how like they all have different beaks to deal with different things, whatever that happened naturally over millions of years. But the humans were able to make, you know, because they found like a specific mutation in a wolf, like very quickly, they were able to breed that wolf and keep that mutation. So it wasn't natural at all. So it happened really quickly. I heard a rumor that the first wolves looked like Portillo. Is that true? Yeah, certainly did. They were gigantic Portillos. One of the things they talked about was polar bears, about like the mutation that inevitably happened when polar bears have white fur, technically clear fur. And like that was, and that was, wait what? Yeah, and that was",
            "start": 5664.06
        },
        {
            "text": "talked about was polar bears, about like the mutation that inevitably happened when polar bears have white fur, technically clear fur. And like that was, and that was, wait what? Yeah, and that was technically a mutation, like that what they think happened is that there were normal bears, like, you know, during the ice age, the ice caps, you know, the ice sheets like went further north and south, so like down to like Washington, DC or whatever. And they assumed that like bears, like at some point had a mutation where they were like, were pig, like, or what would you call them? Albino. Albino. And that actually benefited them because the snow like that would guard them as opposed to a black bear on white snow. Right. And so that mutation actually stuck and that is what a polar bear is. Wait, go back to the clear part. Yeah, the polar bears fur, I think it's technically clear. So they're halalite? It's the absence of color. No, it's, I think it's like translucent. Like you can see",
            "start": 5700.94
        },
        {
            "text": "Wait, go back to the clear part. Yeah, the polar bears fur, I think it's technically clear. So they're halalite? It's the absence of color. No, it's, I think it's like translucent. Like you can see through a string of their hair. So they look white because they themselves are super white. I think it's because like you always see them in a white environment. I'll look real quick. I'm going to. I see. It's reflecting, reflecting. Man. Science, man. I'm telling you. Science is cool. Sometimes I love, I love studying history. I just wish I wasn't so ignorant of the foundation of science where I could have, I should have paid closer attention to math because math is the foundation for everything. And like you can't do shit in science without math because what a lot of people don't know about me is that when I major in history, I love history more than anything in the world. I would have definitely majored in that, but I was really into botany actually. Like I really loved plants and like",
            "start": 5744.3
        },
        {
            "text": "me is that when I major in history, I love history more than anything in the world. I would have definitely majored in that, but I was really into botany actually. Like I really loved plants and like all this weird shit, but like you can only go so far with the observation and reading before you really need to get down into the chemistry and the biology and stuff and I can't do it. Sure. Yeah. Yeah. So I pay attention to math kids. Each hair shaft is pigment free and transparent with a hollow core that scatters and reflects visible light, much like what would happen, what happens with ice and snow. So snow obviously is clear cause it's just water, but it appears white cause it refracts light is what they're saying here. You didn't know that either? No. I thought snow was white. So is the sky now blue? Colin, you want to handle that one? That was a doubt. The sky only appears blue because of the, of the, of the, you know, the, the, the makeup of the atmosphere. Fucking science, man.",
            "start": 5787.5
        },
        {
            "text": "sky now blue? Colin, you want to handle that one? That was a doubt. The sky only appears blue because of the, of the, of the, you know, the, the, the makeup of the atmosphere. Fucking science, man. I'm happy there's people figuring that shit out for me. Meanwhile, you're debating Charles Jr's double Jack cheeseburger. They're just remarkably smart people out there, man. Like really, like, I like reading books about science. Like I think Stephen Hawking's books are really, really, really good. And there's other books, there's a book called the black hole war, which is like excellent about the discovery of black holes and all the competing theories and stuff like that. But when you, and you could read those books, those are layman books and I read them, but man, there's some books that are really technical. I was reading a book about like the nuclear bomb and the Manhattan projects and stuff. They're just getting really into the minutia of math and physics and the particles and the",
            "start": 5829.58
        },
        {
            "text": "are really technical. I was reading a book about like the nuclear bomb and the Manhattan projects and stuff. They're just getting really into the minutia of math and physics and the particles and the atoms and, and atomic science, you know, atomic math and all this kind of stuff. I'm like, that's too much for me, man. I wish if I can go back and change something, I wish I paid better attention in math. You know, math and science are what really matter. I hated math. Like I'm so happy I cheated through math because I don't care. Like that's just so crazy. I'm so happy that you exist. But, but I'm not one of the people that know it. And like, we can say we don't care, but you know who makes all the fucking money? The mathematicians and the scientists, you know, they make all the money, the engineers, you know, like the people that like computer science hate their lives. No, they don't. I know people that I went to school. I went to college with a bunch of people that major or electrical",
            "start": 5868.3
        },
        {
            "text": "you know, like the people that like computer science hate their lives. No, they don't. I know people that I went to school. I went to college with a bunch of people that major or electrical engineers and all that kind of stuff. They are fucking rolling in it, you know? And they're like totally fucking thrilled and happy. I went to school with pharmacists that are making a ton of money. I went to school with like people that really study and really work hard. You know, I loved history because it was interpretive. See, I know, I know a bunch of pharmacists and doctory type people now and like they seem to to really be happy with that because like, I don't know, I guess they feel like that's what they want to do. That's what makes them happy. So that's cool. I've never met someone that likes math that's like doing like accounting or something and like, or like whatever the hell this is the shit happy. Yeah. They're like I have money. That makes me happy. Okay. Then whatever real math is.",
            "start": 5908.22
        },
        {
            "text": "math that's like doing like accounting or something and like, or like whatever the hell this is the shit happy. Yeah. They're like I have money. That makes me happy. Okay. Then whatever real math is. Accounting. I remember, I remember looking at an accounting textbook in high school and there was like an accounting math class. I was like, are you fucking kidding me? Like this is, this is your debits and your credits. It's so easy. Like maybe it gets harder. I'm sure it does, but like it was so easy. Like laughably easy. They have Excel spreadsheets. Yeah. Advanced algebra is what did me in. Yeah. Advanced what? Algebra algebra. I'm like, whatevs. And then they're like, Oh, here's this advanced shit. And my day, I somehow went all the way. I think we talked about this before, but I somehow went all the way up to higher math, which was college level math. Like calculus. No, it was, we had, I did pre-algebra in the seventh grade, then algebra in eighth and pre-calc, calc. But what that's",
            "start": 5941.66
        },
        {
            "text": "went all the way up to higher math, which was college level math. Like calculus. No, it was, we had, I did pre-algebra in the seventh grade, then algebra in eighth and pre-calc, calc. But what that's like a skip. No, pre-calculus calculus. And then we had higher math, which was where, where geometry falling on it. I'm sorry. Geometry was seventh grade geometry. What? Geometry was seventh grade. Seventh grade geometry. I did geometry in 10th grade. Yeah. I, I basically had to cheat, not cheat, but like my friends helped me all the way through. I was actually in like, I think I had, I did was in physics, AP physics, AP biology. Were you like Duke Houser? No, I had no idea what I was doing. That was the thing that mystifies me. When I think back to my high school career, I have no idea how I had close to a 4.0 grade point average and was like not failing every class. I just had no idea how to, how I passed a higher level college grade math class. I feel like in a lot of ways, you and me",
            "start": 5982.78
        },
        {
            "text": "had close to a 4.0 grade point average and was like not failing every class. I just had no idea how to, how I passed a higher level college grade math class. I feel like in a lot of ways, you and me are similar, even if you don't want to admit it. One of us will destroy the other soon. It's probably you, me, cause I'm slower and older. You're really old. Um, but we're really good at like not actually doing the work, but looking at what work needs to be done and doing that. So like for me, the most work I would ever do in any class was the first week when you get the syllabus and you look at the syllabus and plan out, okay, this is exactly what I need to do to get an A. Guess what? I got a shit ton of A's because that's all I did. Everyone else is stressing out about all the other stuff. I'm like, I just need this. Okay. I'm going to do just this. It was fun. Yeah, that was not me. I would just copy off of Clay Wilkinson's homework. I had a shout out to Clay Wilkinson. Clay Wilkinson",
            "start": 6025.66
        },
        {
            "text": "I'm like, I just need this. Okay. I'm going to do just this. It was fun. Yeah, that was not me. I would just copy off of Clay Wilkinson's homework. I had a shout out to Clay Wilkinson. Clay Wilkinson used to let me copy obviously at first he was like, stop. And then I was like, come on dude. And he would let me copy him. I didn't know you knew him. If I was invisible, if I turned you around. Oh, sorry. Aiken. Aiken. Clay Wilkinson, I believe is a lawyer now down in Southern California. Does he sing that song ever? No, Clay Aiken is running for Congress in South Carolina. Yeah. Sure. Apparently we have a, uh, was there a dribble thing? There was a dribble incident. Like a real one or is like, like Richard Gere's gerbil incident. I think some guy went up and was like, okay, would you fuck a gerbil? No, I have a gerbil go up your ass or, and have no one know about it. Or no, this is the, this is the goat simulation from earlier today. But see what works here is this actually happened to",
            "start": 6065.9
        },
        {
            "text": "gerbil? No, I have a gerbil go up your ass or, and have no one know about it. Or no, this is the, this is the goat simulation from earlier today. But see what works here is this actually happened to Clay Aiken and he was like, you know what? This did not happen to Clay Aiken. This happened to Clay Aiken and he was like, you know what? I'm not going to do it. I'll let everyone think it. And that's what happened to his career. So everyone thought he did that with the gerbil. I think Tim's pulling. Do you know what I'm talking about here? No, there was a huge thing of like Clay Aiken putting gerbils up his ass. No, that's the Richard Gere thing. Every generation picks somebody. Okay. Well he was picked and it's not, hold on. This is a conspiracy here. People aren't just being picked randomly. There was someone giving these people options and they're choosing the option we talked about earlier. Oh, okay. That's what's happening. Is that someone the devil? It's a losing game, Colin. Yeah.",
            "start": 6108.22
        },
        {
            "text": "There was someone giving these people options and they're choosing the option we talked about earlier. Oh, okay. That's what's happening. Is that someone the devil? It's a losing game, Colin. Yeah. Well, I'm telling you, Colin, you got to go. You got to stuff the gerbil up your butt. Well, ladies and gentlemen, that's how the Game Over, Gregi show works. Four friends come together each week, bringing a random topic to the table. We do one in the very beginning and then make an awkward callback to it in the very last second of the show. If you liked that, make sure you like us on YouTube, subscribe to the channel, share us with your friends. Remember that if you don't want the show broken up, every Friday we post the MP3 version for $1 on gameovergregi.bandcamp.com. You get to listen to it however you like. Then over on YouTube the next week we start parceling it out day by day, topic by topic. Until Friday we get to the big show. It's all free there. Don't give us any money. We don't",
            "start": 6152.62
        },
        {
            "text": "however you like. Then over on YouTube the next week we start parceling it out day by day, topic by topic. Until Friday we get to the big show. It's all free there. Don't give us any money. We don't mind, but go buy a t-shirt. Why not? Tim, you like these t-shirts? I like you said parcel. Yeah? That was fun. Thank you. I'm glad I entertained you. Yeah, they're fun t-shirts too. Yeah, exactly. So ladies and gentlemen, until next time, have a great day. Follow us all on Twitter. Go love yourself and your mother. What was it? What's the saying? Kick the D. No, no, no. Don't kick the D. You want to suck the D and kick the P, the Care Bear slogan. Yeah. Interpret at your leisure.",
            "start": 6190.7
        }
    ]
}