{
  "id": 5,
  "video_id": "8wE_FXv1ZQY",
  "show_name": "A Conversation With Colin",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "Steve Jobs Is a Douche: A Conversation with Colin",
  "description": "Today, Greg reaches into the conversation pile and pulls out the Steve Jobs card. What will Colin have to say about him? Let's see.\n\nLeave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
  "published_at": 1345575612,
  "duration": 500,
  "transcript_chunks": [
    {
      "text": "it becomes very clear when you start studying Silicon Valley and you start studying the rise of Apple that Steve Jobs is a douchebag and um and I mean that in the nicest way possible. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate Colin. Now Colin has a tendency to say crazy stuff sometimes, so every Tuesday and Thursday we reach into the topic pile, pull one out, toss it at Colin, talk it out here for your enjoyment. If you like that, like the video, subscribe to this channel, share it with your friends, we'll all have fun. Colin, are you ready? Yes. You have no idea what I'm about to read to you. Nope. Today's topic of conversation is Steve Jobs. Oh, you're a hypocrite. Oh, am I? Yeah. You remember I remember I had the iPhone forever and you you you were happy with your Palm Pre , this terrible little device and then you finally finally got on board, got an iPhone, then you started this is great and this is awesome and you read the Steve Jobs biography. Yeah, answer",
      "start": 0.8
    },
    {
      "text": "your Palm Pre, this terrible little device and then you finally finally got on board, got an iPhone, then you started this is great and this is awesome and you read the Steve Jobs biography. Yeah, answer for your crimes. Uh, so we're talking specifically about Steve Jobs, we talking about Apple? Uh, well that includes everything, doesn't it? Okay. Oh, I guess so. Um, I can fix it if you want. I can write on the card Apple. No, no, it's fine. It's your card and your it's your tool to to use as you want. Uh, so one of my favorite topics to read about is the history of Silicon Valley and I've read most if not all of the big major works that have been released um because there aren't like a lot of them and um so I did read Walter Isaacson's Steve Jobs biography, but let me rewind a little bit because please um it becomes very clear when you start studying Silicon Valley and you start studying the rise of Apple that Steve Jobs the douchebag and um and I mean that in the nicest way possible. Steve Jobs is a Visionary",
      "start": 41.64
    },
    {
      "text": "very clear when you start studying Silicon Valley and you start studying the rise of Apple that Steve Jobs the douchebag and um and I mean that in the nicest way possible. Steve Jobs is a Visionary and Apple would have never been what it was without him, but without the technical knowledge which he really lacked, um I think that Steve Jobs gets all of the credit for uh what's like what's great at Apple without really giving the credit to the people that actually deserve it and I think that the person obviously that's overlooked the most is Steve Wozniak. Um, and so I think that Steve Jobs is an interesting character. He's he's super interesting and reading the Walter Isaacson biography it made it appear especially later when he came back after being Ed from Apple and coming back in the 90s that he was instrumental in getting everything going for Apple because Apple was really a quarter or two away from dying when he came back. Yeah, and that's really hard to believe today because Apple is one of the",
      "start": 83.4
    },
    {
      "text": "instrumental in getting everything going for Apple because Apple was really a quarter or two away from dying when he came back. Yeah, and that's really hard to believe today because Apple is one of the biggest corporations in the world. Um, but man they were getting their clock cleaned in the 90s and they were making terrible devices like the Newton and all this **** that no one wanted and um he was a Visionary behind you know let's have all you know like almost another Macintosh with you know iMac and let's do the iPod and let's see the iPhone and the iPad. I mean like you know he was the Visionary behind those things and that's great, but when you study him in the 70 s um there's so many awful stories about him that I think you can't help if you know those stories to kind of look at him a little bit dubiously and I can regail them. Please do. This is your conversation. So uh one story that is really fascinating to me is um Steve Jobs uh went to Xerox. Xerox had uh a lot of people don't know",
      "start": 124.08
    },
    {
      "text": "bit dubiously and I can regail them. Please do. This is your conversation. So uh one story that is really fascinating to me is um Steve Jobs uh went to Xerox. Xerox had uh a lot of people don't know Xerox owned something called Park, P-A-R-C, Outdoor Research Center and they Xerox is a New York based company in Park was in Silicon Valley and Xerox was basically just giving them unlimited amounts of money to just build whatever they wanted and Xerox Park made something called Xerox Alto which is really the first personal computer and it um had color Graphics it used the GUI, Graphics user interface, uh had ethernet they were sending email they had a laser printer they had all these things things that no one had any idea like what the **** was and Xerox certainly had no idea what it was. They even invented the mouse and one of the famous stories about that is Xerox went to New York and with the mouse in the 70s and was like we made this thing called The Mouse and we want you to look at it whatever",
      "start": 162.44
    },
    {
      "text": "the mouse and one of the famous stories about that is Xerox went to New York and with the mouse in the 70s and was like we made this thing called The Mouse and we want you to look at it whatever and they pass it around the table, the board table and everyone looked at it and the CEO was like you want me to manufacture something called a mouse and then basically threw it out back at them and like sent them back out west. Yeah , and so Xerox um in return for I think some Apple shares gave them Apple access to Xerox's Park and they went there and stole everything and that everything they stole ended up in the Mac. So Wozniak made Apple One and Apple 2, but then they the Macintosh was like really the first computer that was supposed to be like the educational machine it was like really you know quite uh quite technologically advanced and they stole everything from Xerox and it did it blatantly and they poached almost everyone from Park to make as in the documentary Pirates of Silicon Valley",
      "start": 204.32
    },
    {
      "text": "quite uh quite technologically advanced and they stole everything from Xerox and it did it blatantly and they poached almost everyone from Park to make as in the documentary Pirates of Silicon Valley starring Noi Wyle. Yes, yes, yes, a good movie. Um, so you know so later um Bill Gates from Microsoft gets a Macintosh so they can start building things for you know some software and what they end up doing instead is creating Windows basically stealing the operating system of Macintosh putting it on PCs in Japan and then selling them there and I think NEC was the first computers that had them. So um Steve Jobs called uh Bill Gates over and basically called him a hypocrite and and a liar and a thief and all those things and and you're stealing from us the famous line of course in Pirates of Silicon Valley such a good movie and and Bill Gates is the first guy to tell tell it like it is and like you stole from Xerox and we stole from you so why don't you stop being a hypocrite about it and that's",
      "start": 241.44
    },
    {
      "text": "Valley such a good movie and and Bill Gates is the first guy to tell tell it like it is and like you stole from Xerox and we stole from you so why don't you stop being a hypocrite about it and that's just one of the many stories of course another story is that Steve Jobs used to work at Atari and Steve Jobs was tasked with creating games like Breakout for Atari 600 and he had Steve Wozniak help him with the game and if he can get it on as few as few chips as possible they would give him a bonus to make manufacturing costs as cheap as possible and Steve Wozniak was a genius so Steve Wozniak made it on like ridiculous you know like just made the board so small and so Compact and Steve Jobs got a like a windfall from Atari and then lied to Steve Wozniak about how much money he was paid and gave him like $500 of the money um while he promised to split the bonus with them so why did Woz keep working with him? Um, I think Wozniak was like a little bit naive but I also think Wozniak um was altruistic. I think that",
      "start": 282.4
    },
    {
      "text": "of the money um while he promised to split the bonus with them so why did Woz keep working with him? Um, I think W ozniak was like a little bit naive but I also think Wozniak um was altruistic. I think that he believed they used to have this thing in in the 70s called at Berkeley called The Homebrew Computer Club where they would basically share things with each other and they would share pirated software basically and all these things and that was where Apple One was introduced and Wozniak wanted to give Apple One to everyone and let them kind of play with it and Steve Jobs was the one who was credit that said like we can sell this and make a lot of money and that's how their partnership was forged. So I think that like they had an interesting partnership and obviously when Apple went public Steve Wozniak became rich and then kind of disappeared. Yeah, um so I just think that Steve Jobs is just an unsavory dude. I think that there's like a lot of you know he he had an a daughter with a woman um and",
      "start": 322.12
    },
    {
      "text": "Wozniak became rich and then kind of disappeared. Yeah, um so I just think that Steve Jobs is just an unsavory dude. I think that there's like a lot of you know he he had an a daughter with a woman um and basically neglected her for 15 years, named a computer after her, Apple Lisa, but totally ignored, neglected her, pretended that she didn't exist, like he's just not a good he's not a nice guy and when you read Walter Isaacson's biography like he doesn't hold back. So do you think I mean you know when Steve passed not too long ago it was very much this like whole like giant worldwide grieving thing and stuff did he make up for it in the end like we keep talking about this stuff in his past did did his presence catch up to where you know he did eventually acknowledge Lisa he did start taken care of her and stuff like that yeah is history's portrait accurate of him now yeah I think that like when first of all I recommend everyone read the book is the book's absolutely fascinating Walther Isaacson's like",
      "start": 356.6
    },
    {
      "text": "stuff like that yeah is history's portrait accurate of him now yeah I think that like when first of all I recommend everyone read the book is the book's absolutely fascinating Walther Isaacson's like a really brilliant biographer and he had he had unlimited and unprecedented access to Steve Jobs especially when Steve Jobs was dying and that's when he was saying like for those two years when he was just saying everything that he needed to say and I think that he was trying to redeem himself but um think that the proof is going to be in the pudding specifically about how Apple in the next five or 10 years survives without him because I think the story is going to be written about him how much of a Visionary he really was if Apple starts to tank sure um because Apple was great with him and then fell off the planet he came back they were great again and now we're in this period where you know with Tim Cook and all these guys where we don't really know what they're going to do next and",
      "start": 397.92
    },
    {
      "text": "then fell off the planet he came back they were great again and now we're in this period where you know with Tim Cook and all these guys where we don't really know what they're going to do next and what's the you know they can iterate on iPhone and iPad all they all they want but they need something new and like without him there who knows I I think that like he's just an unsavory dude but obviously one of the Great Visionaries really one of the Great American technological forces in all of history I mean you you have to look at him you know up up there with Edison you know and and guys like that I mean just like you know Henry Ford like dudes that knew their **** pioneered an entire industry George Washington Carver George Washington Carver of course the master of the peanut so um yeah I don't know man I mean I think Steve Jobs is a really complicated um complicated figure and I think like many figures I think his history will be written a long time from now when we kind of have",
      "start": 432.2
    },
    {
      "text": "I don't know man I mean I think Steve Jobs is a really complicated um complicated figure and I think like many figures I think his history will be written a long time from now when we kind of have more clarity great yeah well thank you Colin I think that wraps up our conversation what do you think Steve Jobs douchebag Visionary good guy let us know in the comments below then like the video share it with your friend subscribe to us here on the YouTubes as I think it's called Uh and until then I hope you have a conversational day",
      "start": 467.4
    }
  ]
}
