{
    "id": 14127,
    "video_id": "2i9kDP4Xfo0",
    "show_name": "Screencast",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Blessing Adeoye Jr."
    ],
    "title": "The Last of Us Season 2 Episode 6 SPOILERCAST",
    "description": "Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747686317,
    "duration": 2796,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] What's up and welcome back to another kind a funny Last of Us season 2 spoiler cast. The penultimate episode is upon us. This one's called The Price, episode 6 out of seven of season 2, directed by Neil Drman himself this time. Uh, and written by Neil Duckman, Haley Gross, and Craig Mason all together right in this one. So, obviously a little more special because it's from the OG team that did uh Last of Us Tunic. Kind of cool. Kind of cool. Uh, we've been talking about this each and every week. Of course, we being me, Tim Getty's, this guy blessing out of Yoya Jr. and that guy Nick Scarpino me. That's him, everybody. Sometimes Greg's here and sometimes he's not. You know what I mean? He's on winter solstice or whatever. He is on winter solstice. So good. Oh man, I love talking [ __ ] about Greg. Uh but hey, remember this is the screencast. Sometimes when movies, TV shows, or trailers come out, we like to talk about them. A whole lot's been going on recently. uh we've",
            "start": 0.0
        },
        {
            "text": "[ __ ] about Greg. Uh but hey, remember this is the screencast. Sometimes when movies, TV shows, or trailers come out, we like to talk about them. A whole lot's been going on recently. uh we've been doing in review for for Alien and Predator. Um we recently added Thunderbolts to the MCU in review. Uh we're this week of course going back to Mission Impossible with the Final Reckoning. You'll get all of our thoughts on Tom Cruz's latest adventure. And last week we did some trailer breakdowns to Superman and to the latest from the MCU in the form of Iron Hart. So check out all of those if you want. Some of the videos got taken down from YouTube. You can go over to watch the video on Spotify if you want to see our um breakdown of Zo stuff. Kevin's bringing up some details on the winter solstice. I mean, summer solstice isn't until June, right? We got time. We got time. Is it closer to June or is it closer to December? What was it? December 21st. I don't think it matters to Greg. I don't",
            "start": 74.56
        },
        {
            "text": "I mean, summer solstice isn't until June, right? We got time. We got time. Is it closer to June or is it closer to December? What was it? December 21st. I don't think it matters to Greg. I don't think it would matter to any of us if he was like, \"Hey, I'm taking the day off for the winter solstice.\" And we would make fun of him just the same. What is he doing? Who? I don't think I want to know. I think it's spring break. God, spring break. We already did spring break. He already did spring break. I think he did spring break. Right now it's summer vacation. Greg takes eventually he's going to have winter solstice is going to come up. He's going to do the moon ceremony. Respect all the school holidays. Oh, so he takes holidays like he goes to school. Yeah. And he wears shorts, too. And they put him in a little Jansport backpack. I just think it's really important. You know, anyone that has a kid should probably just respect all those holidays and take them with their kid and enjoy them.",
            "start": 120.4
        },
        {
            "text": "put him in a little Jansport backpack. I just think it's really important. You know, anyone that has a kid should probably just respect all those holidays and take them with their kid and enjoy them. I think that's super important. You know what I think is important, Nick? What's that? Spring Breakers is getting a sequel. Yeah. Is Vanessa Hudins in it? No. None of them. It's a whole new crew of young misfits. Tik Tockers. They're all Tik Tockers. Of course they're Tik Tockers. I hope they shot the whole movie on Tik Tok. I hope I hope it's I hope they shot that movie. How Snowike Mike watches movies. Look at all my [ __ ] Mike showed me him watching Minecraft today and it was Did he watch it in 500 parts on TikTok? Scroll through it. What a what a disaster this whole world is. And hey, I guess it's a disaster in the future, too. The apocalypse is upon us. The mushrooms are here everybody. But guess what? You can support us with the kind of funny membership. It gets you the show ad",
            "start": 157.28
        },
        {
            "text": "I guess it's a disaster in the future, too. The apocalypse is upon us. The mushrooms are here everybody. But guess what? You can support us with the kind of funny membership. It gets you the show ad free. You get an daily exclusive Greg way. That's going to be blessing today. Yes. Did you do it already? I already did it. Did you get in the right hands to get it uploaded? Cool. Greg's out, isn't he? He is out. Yeah. Yeah. We'll get it. We'll get it to Raj very soon after this and then it'll be up. It'll be Bless talking all about. Uh it's me doing my my games calendar talking about like, all right, what are the games that are coming up that I want to check out and I'm looking forward to. So, hell yes. Blessing. Super fun game calendar coming soon to Gregway feeds. Uh, today's a fun day. We had games daily. We had a games cast that was a [ __ ] list of every Rockstar game ranked. After this is going to be a very special fun kind of funny podcast featuring who, Nick. Oh, it's going to be",
            "start": 194.96
        },
        {
            "text": "had games daily. We had a games cast that was a [ __ ] list of every Rockstar game ranked. After this is going to be a very special fun kind of funny podcast featuring who, Nick. Oh, it's going to be me, Joey, and Andy. Love that. What a fun combo. What shenanigans are you going to get into? Are you guys going to try the We're going to try Sprite. Sprite. Sprite sent me a their latest Sprite. You're trying this Sprite? The Sprite tea. Get on this podcast. You want to get on the podcast? Yeah, I might be on the podcast. I assumed you already drank it when you one single can they sent us. Kevin is obsessed with this thing and he asked us if we could all try the Sprite. He said we'll do little shots of the Sprite. So, we're going to we're going to kick it off with with the Sprite. And I'm going to tell you guys about my Silver Alert story. That happened yesterday, didn't it? Mhm. Yeah. All San Francisco. Yep. It was terrifying. It was really scary. And I was sitting next to an old dude",
            "start": 232.64
        },
        {
            "text": "to tell you guys about my Silver Alert story. That happened yesterday, didn't it? Mhm. Yeah. All San Francisco. Yep. It was terrifying. It was really scary. And I was sitting next to an old dude in a Starbucks and I didn't know if it was him or not. So, I was like this. So, I was like this. I was like looking at him. He's by himself and I'm looking at him and I'm like this. [Laughter] That's No, don't burn the broadcast. Save him for Godamn Patreon producers Carl Jacobs, Omega Buster, and Delin Twining. Today, we are brought to you by Subway Surfers and Factor, but we'll tell you all about that later. Let's talk about Last of Us. Plus, yes, it was one of the big ones. some of the most iconic moments of Last of Us 2 now in live action. What did you think? I really enjoyed it. It's this season has been so fascinating because I I've been on I think most of the discussions uh for season 2 on this show and I feel like the ones that I happen to show up on are the are the are the episodes",
            "start": 271.12
        },
        {
            "text": "has been so fascinating because I I've been on I think most of the discussions uh for season 2 on this show and I feel like the ones that I happen to show up on are the are the are the episodes that I love the most and this continues that trend of like wow this for me did the justice of we knew um what's the name of the song? Future Days, we knew Future Days was coming. We knew the museum scene with the spaceship was coming, right? Like there's so much that we expected them to tackle here. I think the way they weaved it all together did so much justice to how to I guess supporting Ellie's journey earlier in this season, right? Like I think one of the bumpy things this season for me has been buying into Ellie's revenge mission of like really believing that like she's all the way in, right? She's bloodthirsty. She's like where she's at in the video game. And I think part of the um reason you have these moments that are these flashback moments that are um help filling in that",
            "start": 320.64
        },
        {
            "text": "in, right? She's bloodthirsty. She's like where she's at in the video game. And I think part of the um reason you have these moments that are these flashback moments that are um help filling in that relationship with Joel is to I think grant legitimacy to that motivation. And they do such a good job of taking us through the years of where Ellie was at at the end of last one is he called um and then getting us yearbyear to all right this is where we're at with Ellie. She's celebrating her birthday museum scene. All right, year later, she's starting to get a little bit rebellious as a teenager. And then like having it build into Ellie as she gets older becomes a bit more curious and becomes a bit more, yo, what the [ __ ] is really going on here? Like I'm starting to have mistrust to this person that is my caretaker, which I think is accurate to like a lot of teenagers and how a lot of us might, you know, grow with in that relationship with our parents. I think Joel h being in this",
            "start": 363.12
        },
        {
            "text": "person that is my caretaker, which I think is accurate to like a lot of teenagers and how a lot of us might, you know, grow with in that relationship with our parents. I think Joel h being in this position of um having that flashback with his father and his and confronting his father about certain things and his father saying that he hopes that he's a better father than he was, right? Like I think building that all together in this way was so well done to where I truly believe like the tension that they built here as far as why Ellie is upset with Joel, how Ellie got here with with that, but then also why Joel is doing what he's doing. Like I I think they did it really well. Yeah, Nick. Uh, this is my favorite episode so far of this season. Um, and and it's interesting because I remember playing the game and I remember some of the more quiet moments like with the museum and with that obviously being more character building moments and and and I I I lost focus in those. They didn't get",
            "start": 407.12
        },
        {
            "text": "the game and I remember some of the more quiet moments like with the museum and with that obviously being more character building moments and and and I I I lost focus in those. They didn't get me, I think, as much as they did watching them unfold in live action. I really really enjoyed all of that. I enjoyed the time skipping. I enjoyed the book ending of it all. Uh, and in my brain I'm like, man, I wish I could go back and play part two, but with all those moments that weren't like hardcore game mechanics of stealth and like having to kill people. Just sub this in just cut to live action like it's a 1990s game and we just I just watch this scene cuz it was so good and they did so good in this and that that final scene with Joel and like I mean we got to talk about Joey P. We got to talk about Joey Pentaliano, right? He just randomly popping up in this and stealing the entire episode for me was just what what a what a 10 out of 10 banger episode this was. What did you think, Tim? I'm",
            "start": 450.4
        },
        {
            "text": "about Joey Pentaliano, right? He just randomly popping up in this and stealing the entire episode for me was just what what a what a 10 out of 10 banger episode this was. What did you think, Tim? I'm right there with you. This one was great. I've been loving the show. I love the game. I love the the differences and I love what they keep the same. And I think this episode's the best example of that. Everything that they did one for one, I thought they nailed. and everything that they added I think really really really uh was earned and I think strengthens the story of Last of Us 2 in a lot of ways that some of the choices so far are a little more questionable of like all right this is different we'll see where it pays off I think that a lot of the choices they've made in this episode paid off and the I think dualsided thing of getting the storyline in starting the 80s with Tony Dalton who's like a badass I love this guy anytime he shows up I freaking love him. Uh, and seeing him as uh",
            "start": 489.68
        },
        {
            "text": "off and the I think dualsided thing of getting the storyline in starting the 80s with Tony Dalton who's like a badass I love this guy anytime he shows up I freaking love him. Uh, and seeing him as uh Joel and Tommy's dad. Awesome. Seeing uh the watch, Joel's watch is actually the dad's watch. It's like, oh, that just adds such an extra layer here. And I do think that it's way on the nose, but I think it works for the type of story that this is telling here where um having uh Joel's dad and Tommy's dad have that line of just like I hope that you just do a little bit better than me and then having Joel obviously at the end do that to Ellie. I just think it just tightens up their characters even more than the the games do. And on top of that, having the whole Eugene storyline and having Ellie make him promise that he's going to take uh Eugene back to uh say goodbye to his wife and then obviously we see what goes down with that. And having that be the trigger for Ellie realizing, oh, he",
            "start": 528.0
        },
        {
            "text": "make him promise that he's going to take uh Eugene back to uh say goodbye to his wife and then obviously we see what goes down with that. And having that be the trigger for Ellie realizing, oh, he lied to me. Like when he swore that was a lie. Um that stuff to me I think oh this is better than the game. like this strengthens these choices and decisions and Ellie being so mad at Joel. All of it, her seeing it for herself and discovering it herself, I think just makes it a lot better. Adding on top of that, the him having the line about like, I hope that if you have a kid, knowing she does have a kid, you know, and the decisions that she makes later, it's like it's rough. It it really I think enhances the tragedy of Ellie's storyline. Um, but I also think it puts such a a beautiful bow on Joel Miller. And uh I think that this is one of the rare cases where the show took an incredibly important poignant scene from the games and did it even better. Like I think that the the patio scene",
            "start": 574.88
        },
        {
            "text": "Joel Miller. And uh I think that this is one of the rare cases where the show took an incredibly important poignant scene from the games and did it even better. Like I think that the the patio scene the patio scene I I re just rewatched the game one too and I'm like obviously it's incredible. This is, I think, a lot more emotionally resonant. And I think it's also the placement of the story changes it. Like this being the one of the last things, if not the last dialogue we get in the actual video game, is the, you know, I don't think I could ever forgive you, but I'd like to try. Like, god, that hits so hard. And that's the end of the game, which I think is great for the context of that story. But the way they're telling this version of the story, I think having it here being this like actual goodbye to Joel is something that I think that we've all kind of wanted a little bit from Ellie's journey here and the episode ending like pretty much right after last week of her killing Nora",
            "start": 622.16
        },
        {
            "text": "actual goodbye to Joel is something that I think that we've all kind of wanted a little bit from Ellie's journey here and the episode ending like pretty much right after last week of her killing Nora and it's like oh [ __ ] Like we are now getting a Ellie that is freshly thinking about her last moments with Joel. That's crazy man. She's about to [ __ ] [ __ ] up. Yeah. I love I mean I love that too because the entire time you're waiting right obviously this whole episode's been done in flashbacks the entire time you're waiting for that shot and you know it's coming the shot of her in the rain looking like a [ __ ] just a murderer walking back to the theater and we get it toward the very very end there and it's uh it's very powerful stuff. Yeah. Um I loved the framing of the flashbacks like the last week I was talking to I don't think it was you. No, you were gone. It was uh I guess you and Greg and I was saying I think that next week's is going to be a bunch of different flashbacks",
            "start": 668.96
        },
        {
            "text": "the last week I was talking to I don't think it was you. No, you were gone. It was uh I guess you and Greg and I was saying I think that next week's is going to be a bunch of different flashbacks and I'm happy it was like this was exactly kind of what I wanted from it where these flashbacks are kind of placed throughout the game uh in the the the video game story version of it. Putting them all together with this added context I think was a very wise call. Yeah, I like it too cuz I I I think it being we're toward the end of season 2 and knowing that we're going to have to wait for a season 3. So many of the stuff they touch on in the flashbacks I think are very important to Ellie's character where she's at right now, right? I I think they're doing a good job in season two of arcing this around Ellie and we kind of know that season three, at least I don't know if we know season 3 is going to be about Abby, right? But you assume that there's going to be more of a shift in terms of all",
            "start": 711.6
        },
        {
            "text": "around Ellie and we kind of know that season three, at least I don't know if we know season 3 is going to be about Abby, right? But you assume that there's going to be more of a shift in terms of all right, now we're on to this story that's going to have a bit of a different vibe to it to then bring it around back to where where Ellie's at. I think this makes a lot of sense to do it this way, especially going into you. Imagine I don't I've not seen the next up on yet, but like I imagine next episode is going to be [ __ ] violent, right? I imagine it's going to be Ellie continuing that journey and getting to somewhere of an apex of that story. And with that being the case, I think having the flashbacks be the thing to kind of build up that tension of, oh, now I understand where Ellie's where Ellie's at fully. like we understood before, but now I think having the audience understand that last interaction with Joel puts us in a place of, oh, okay, so this is what she's fresh off of, and",
            "start": 748.16
        },
        {
            "text": "Ellie's at fully. like we understood before, but now I think having the audience understand that last interaction with Joel puts us in a place of, oh, okay, so this is what she's fresh off of, and this is why she's now on this murder rampage. I think it makes a lot of sense. I think narratively it works, too. I I think you have to break up, you know, we've seen we've seen this style of a show a lot over the last like 15, 20 years, right? We watched all of us went sat through 900 seasons of The Walking Dead and all those spin-offs and stuff like that. And I think they're wise to be like, we have to have these wonderful character moments because that is the strength of the show to me, right? Seeing seeing the infected, seeing all that stuff, that is cool. But after a while, you know, when you've got actors like Katherine O'Hara and and Pedro Pascal and and and this phenomenal cast, being able to write these nuance moments for them and really showing sort of like the heart of the the",
            "start": 787.12
        },
        {
            "text": "you've got actors like Katherine O'Hara and and Pedro Pascal and and and this phenomenal cast, being able to write these nuance moments for them and really showing sort of like the heart of the the entire thing, which is the relationships between Joel and Ally. G getting that out of the way for me specifically as I as I started to sort of wayne a little bit on it, not not 100% but getting to the point where I was like, you know, if I wasn't reviewing this, maybe I'd wait a couple weeks for this. And seeing this, I'm like, yes, I'm going I need to know what's going on in in the seventh episode. I think this was a a perfectly placed moment to get all that backstory out. And then just randomly like I didn't know who Eugene was going to be. So when it was the captain from from Bad Boys, I was like, \"Yes, dude. I'm so glad it's him. I'm so glad it's him. Uh, a little touch. I loved them bringing back the two spores in the uh, intro because this was like a Joel and Ellie episode, which is",
            "start": 824.24
        },
        {
            "text": "like, \"Yes, dude. I'm so glad it's him. I'm so glad it's him. Uh, a little touch. I loved them bringing back the two spores in the uh, intro because this was like a Joel and Ellie episode, which is fun. Oh, snap. That's cool. Um, and and yeah, like Nick to your point about talking about Eugene, I thought they did a great job with that character. Like we got the the Eugene was a concept of a character in the game, but we really knew nothing about him. Uh, you just had his little weed farm. But, uh, the show fleshing it out with the therapist, Katherine O'Hara, being his wife, and we get in the early episodes, the kind of setup that she has beef with Joel because of how he killed her husband. And now actually seeing it, it's kind of a version of what we all kind of thought was going to happen, right? Like he turned and and he was killed. But like the way it all went down, it's that classic Last of Us conundrum of like, did he do the right thing? Did he do the wrong thing? Like there's",
            "start": 866.0
        },
        {
            "text": "right? Like he turned and and he was killed. But like the way it all went down, it's that classic Last of Us conundrum of like, did he do the right thing? Did he do the wrong thing? Like there's perspectives to it, right? Like Yeah. I think I mean from my perspective I he first of he 100% did the right thing. I think Ellie Ellie brought with her I think the wrong energy into that conversation because I think if you take a step back you're like of course you can't you can't bring him there. That's why they have protocols right and this is her first patrol. She is still young. She still doesn't quite understand the ramifications of this but Joel just [ __ ] up. He shouldn't have promised. He shouldn't have said that one thing. See and that's where that is the bad thing that he should have just been like go get the horses. Right. Exactly. And I think that is the core issue that I think is very well highlighted as far as that relationship between Joel and Ellie. And it being like at its",
            "start": 909.36
        },
        {
            "text": "just been like go get the horses. Right. Exactly. And I think that is the core issue that I think is very well highlighted as far as that relationship between Joel and Ellie. And it being like at its core, I think this a lot of this season is about somebody growing up and a father having to allow a daughter to like be an adult. Yeah. Like the I mean going back to the scene of I forget which birthday it was, but one of the birthdays where 16 I want to say where she's in the room with the girl and she's getting tattooed and smoking weed and messing around and do all that stuff, right? and he busts in and he's like, you know, getting mad and like as a viewer I'm like, \"Oh, damn.\" He's like, \"You're really you're mad for some reason.\" Like, I don't understand where this is coming from, but it's him being a father. Like, it's him having that trying to have that ownership over somebody who's his adopted daughter. He has that great line, too, where he's like, \"All the adult things happen at",
            "start": 945.52
        },
        {
            "text": "him being a father. Like, it's him having that trying to have that ownership over somebody who's his adopted daughter. He has that great line, too, where he's like, \"All the adult things happen at once, all of them.\" Yeah. Like messing around, like experimenting with girls, drugs, tattoos, ant to end drugs. And she's like, \"Well,\" and then she has a great line, too, which like it's not an experiment. Like, this is basically who I am. And I there's another another fun line I liked in there too is like you know him looking at the other girl being like like really like 17 and she's like I'm 19, right? Like you know there is this almost like um rebellious nature coming from Joel because he is just trying to have he's trying to hold on to a thing that he's losing and I think it's kind of double back to the fact that he has lost a child before. I was going to say he's he's holding on to a thing that he lost. Yes. Yes. And that he never really had. Right. Exactly. And we have a line, we have",
            "start": 982.16
        },
        {
            "text": "back to the fact that he has lost a child before. I was going to say he's he's holding on to a thing that he lost. Yes. Yes. And that he never really had. Right. Exactly. And we have a line, we have a line in here that I think was really really poignant, too, where they're going on patrol and they get the radio from Eugene and he goes, \"Go back to the go back to the camp.\" And she goes, \"I'm your partner, not your daughter.\" And she's saying that in context to like that's their that's how this is supposed to work with the cruise. Like you don't leave your partner. Tim, of course, the classic Top Gun can never leave your wingman. But she's really saying that sort of that has a double meaning to it, right? Sorry, I cut you off. I interrupt you. No, but I mean you're you're making the points that I'm making, right, of the fact that I think they've built Joel's character well. Uh, one, the Pedro Pascal portrayal of Miss So good. Like, Pedro Pascal is so good at playing that character, but",
            "start": 1020.0
        },
        {
            "text": "that I'm making, right, of the fact that I think they've built Joel's character well. Uh, one, the Pedro Pascal portrayal of Miss So good. Like, Pedro Pascal is so good at playing that character, but also to Tim's point earlier of like, you know, this is a character that, you know, is operating in the gray a bit, but he's so likable and we as an audience [ __ ] with him because PJ Pascal is doing such a great job, but then also he is doing things that are clearly bad. like he's doing things where I'm like, \"Oh, you just make you are an asshole.\" Yeah. As a character. And what what I love about it though is that um a lot of that is to protect, right? Like it is like from even in the opening scene, we see him trying to protect Tommy and like there is this level of like his entire life he is trying to whatever it takes. He'll lie to anybody to protect the people that he loves. and um seeing the the framing of the birthdays year to year to year. I thought was very very wise uh for them to",
            "start": 1055.04
        },
        {
            "text": "trying to whatever it takes. He'll lie to anybody to protect the people that he loves. and um seeing the the framing of the birthdays year to year to year. I thought was very very wise uh for them to do uh here because it allowed us to see Ellie grow in a a very like literal way of like being like okay a year in her life has passed and like what's the relationship between them uh look like now and seeing him walk in on them in the room and how angry he is and how dadlike he is. But even by the end of that scene he is like realizing I didn't handle that correctly and I need to give her space. Let's get her the garage. you know what I mean? Like let's work on it. And I love that at the end of each one of these uh kind of like little tidbits, vignettes, he is actually, no matter how many lies, no matter how many bad moves he made, he is trying and he's doing the right things. You know what I mean? He does a lot of wrong things surrounding it. But I do like that it's at the end of the",
            "start": 1093.12
        },
        {
            "text": "lies, no matter how many bad moves he made, he is trying and he's doing the right things. You know what I mean? He does a lot of wrong things surrounding it. But I do like that it's at the end of the day, he's not an [ __ ] dad. He is a good dad just trying his best to understand this [ __ ] Yeah. Yeah. And I feel like they did a good job of like having all of that and it then leads to the porch scene of her being like, I don't think I can move on, but I want to try. Like, God, that's so good. And like a bad person wouldn't deserve that. Yeah. I don't And again, I don't think Joel is necessarily a bad guy. I think he made I think we could all agree that he made one really bad choice with the Fireflies. I was going to say I feel like that's a bad guy. Yes. Go with this again. I mean, he kept the cure from humanity. Yes. And he knows that and you see that in this we don't know it was going to work. He I mean he kind of implied that he that it was going to work. At least these people had",
            "start": 1136.56
        },
        {
            "text": "the cure from humanity. Yes. And he knows that and you see that in this we don't know it was going to work. He I mean he kind of implied that he that it was going to work. At least these people had like they were like cranking [ __ ] power into that O. There's no way that career was going to work. That was [ __ ] But I mean honestly, you know, you see that and that's what that's what's so interesting about his character, right? Is that he even has that I mean that whole speech was just wonderfully done where he's like, \"If I had to do it over again, I would absolutely do it again because I love because I love you and you're my daughter and like and then it's bookended with that great line where he's like, you know, one day you might have one and hopefully you're a little bit better than me.\" Um or I just slaughtered that. He said, \"If that day should come, I hope you do a little better than me.\" And that's such a good line. Pedro just just so subtly just not just nodding through the",
            "start": 1175.84
        },
        {
            "text": "me.\" Um or I just slaughtered that. He said, \"If that day should come, I hope you do a little better than me.\" And that's such a good line. Pedro just just so subtly just not just nodding through the tears with all of this. But the Eugene's in my opinion the Eugene situation completely different situation, right? Like you look at why he would lie to her is a to get her away from having to see this thing and confront this and b also just to give Eugene a moment of like hope before he has to die. And then we have that horrible gut-wrenching moment where he comes out into the clear and he's like, \"I need my wife, not a view. I don't want I need a [ __ ] view. I want to tell her all these things. I want to see her face one more time before I die.\" And he goes, \"You love someone. You can always see their face.\" I'm like, \"Fuck [ __ ] man. God, it was so good.\" Yeah. And dude, we got to say it. Pedro Pascal, like obviously amazing. We've seen him kill it so many times. There's been the",
            "start": 1208.96
        },
        {
            "text": "see their face.\" I'm like, \"Fuck [ __ ] man. God, it was so good.\" Yeah. And dude, we got to say it. Pedro Pascal, like obviously amazing. We've seen him kill it so many times. There's been the question of like, oh, is he in too many things? No, he's not. And the reason why he could pull this [ __ ] off, like that whole porch scene was the best acting I've ever seen him do. Yeah. And it's unlike anything we've seen from him before in this character or otherwise. I was so impressed by the way that he handled it and telling her all the truth being there. Like she was like putting it all on the table. Like you need to tell me right now. And he just does. I for me it's the it's the flashback to the therapy scene in either I think it was episode one where he's being confronted with all like what did you do like what did you do to this girl right she's asking the secret what's the secret what what's the yeah and like the amount of difficulty he's having voicing it to the point where Ellie",
            "start": 1251.8
        },
        {
            "text": "did you do like what did you do to this girl right she's asking the secret what's the secret what what's the yeah and like the amount of difficulty he's having voicing it to the point where Ellie is essentially having to pull those words out of him of like I did it or like I you know there were no fire or not fire there were no raiders yeah like you know we weren't being chased or whatever like I killed them all like I think that is for me that is where I'm like oh man Pedjo you got the stuff and I'm one of the people that complains of like yo Pedro Pascal is in everything but if this is what you're bringing to it then like dude he's so he's so good in this scene and this is no disrespect to Bella Ramsey but he elevates her performance like they say like the sign that like the mark of a good actor is how good you are as a scene partner right so like if you and I are in a scene and it's your scene but I have to give you something too like he's there and then it cuts back to her and you",
            "start": 1296.96
        },
        {
            "text": "actor is how good you are as a scene partner right so like if you and I are in a scene and it's your scene but I have to give you something too like he's there and then it cuts back to her and you can see like as they're filming it that like her acting is being elevated by how [ __ ] incredibly good he is and it's like not not a not a you know a knock against her but dude that whole scene is just you're just so in that scene because of him because of what he's given absolutely I mean to give uh you just equate him to Shawn Michaels that is true though that is very very true I would have play but that's okay that would have been the opposite of the guys look bad uh but uh Bella I think was uh great in this episode in a different way just because we got to see them throughout the years and I think that that was something that the energy that this version of Ellie has in season 2 I think is uh more one note compared to what we got in season 1 just because of her age and like the dynamics",
            "start": 1334.0
        },
        {
            "text": "think that that was something that the energy that this version of Ellie has in season 2 I think is uh more one note compared to what we got in season 1 just because of her age and like the dynamics of her and Joel and what was going on in the story. So in this episode being able to see her as a little bit of that younger more naive Ellie and then trans uh forming into the the version of Ellie that is questioning like what happened like and and her place in it all. Um, and even just like the the dealing with the tattoo and the moth and what the moth represents and Pedro uh Pedro's Joel talking about it being like it's like a oh, it's changed a butterfly. It's a moth, dude. Uh, all that stuff I thought was so great and allowed Bella to kind of give a lot more a much more dynamic performance, I'd say, as Ellie. Yeah, I think that transformation helped for me, right? Like I think I one of the things that I've tried to grapple with with Bella's current Ellie is how different she is from",
            "start": 1378.32
        },
        {
            "text": "I'd say, as Ellie. Yeah, I think that transformation helped for me, right? Like I think I one of the things that I've tried to grapple with with Bella's current Ellie is how different she is from the video game Ellie where video game Ellie even though they're the same age there's something about video game Ellie that I think strikes as more calculated and more mature mature. Yeah. Yeah. But also like I think it's that weird age of like I think you could play a 19-year-old older. You could play the 19-year-old more naive and like Bella's I think plays more to the naive part. But I think that also makes sense for how they're developing that character. I think this episode for me did a great job of me seeing that evolution going, \"Okay, no, I believe this actually like this makes sense for you.\" Yeah. For me as well, I think it was I I think it's I don't I don't know that I ever could put my finger on the sharpness that she plays the role with and that little edge that she brings to it.",
            "start": 1429.28
        },
        {
            "text": "Yeah. For me as well, I think it was I I think it's I don't I don't know that I ever could put my finger on the sharpness that she plays the role with and that little edge that she brings to it. And I think it's because like it's kind of almost bratty and it makes sense now that you see it cuz you're like you've been lied to pretty much your entire life and you know it and it's bugging you, you know, and that's why you're acting out. That's why you're so brash. That's why you're always shoot first, ask questions later, which by the way is the coolest thing ever. Um, and so yeah, seeing this, this was a really, really pivotal I think episode. And this might have been probably the most important episode of the entire series for me, like just seeing this. Before you ask that question, bless. Yep. Let's take a quick word from our sponsors. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood",
            "start": 1468.24
        },
        {
            "text": "Yep. Let's take a quick word from our sponsors. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway Surfers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. It's kind of funny as Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. On top of that, Subway Surfers has made a special QR code",
            "start": 1501.76
        },
        {
            "text": "amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. On top of that, Subway Surfers has made a special QR code just for the best friends to get even more rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart, Protein Plus, Keto, and more. We at kind of funny love factor meals. Bless and Greg love it for a",
            "start": 1546.0
        },
        {
            "text": "45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart, Protein Plus, Keto, and more. We at kind of funny love factor meals. Bless and Greg love it for a quick lunch in between shows and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindafoney5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind of funny 50 off at factormeals.com/kindofunn5050 off for 50% off plus free shipping. Factormeals.com/kindfunny5050 off. Bless. Yes. Uh my question I was going to ask is how do you guys feel about Ellie telling the therapist Catherine the truth after Joel lied to her? Again for me another moment of obviously it's coming from her knowing that she lied to him about the other thing. That's not what she's really saying. what Julie saying is you lie to me about the",
            "start": 1588.0
        },
        {
            "text": "Again for me another moment of obviously it's coming from her knowing that she lied to him about the other thing. That's not what she's really saying. what Julie saying is you lie to me about the fireflies and the raiders and all that stuff and basically destroying the entire world. I think she was 100% in the wrong though, right? Like and then this is another one of those moments. This is another one of those moments where you go like you're a child. Why would you do this? you this person I had this narrative crafted for your husband who you love and I told the last thing the last possible memory of him that you could have had is this one that I'm incepting into your brain of him being a brave hero and killing himself and just so he never brought this back to you and Ellie's like that's not what happened. He wanted to come back. He begged to come back here and basically infect the entire [ __ ] all all of the city, but instead Joel put a bullet in his head. And it's like it's it's so",
            "start": 1641.28
        },
        {
            "text": "what happened. He wanted to come back. He begged to come back here and basically infect the entire [ __ ] all all of the city, but instead Joel put a bullet in his head. And it's like it's it's so it's nuanced and it's complicated cuz obviously yeah, she had every right to be like, \"Hey, you lied.\" But at the same point, what kind of a shitty kid thing is that to do? Just an act of rebellion against your dad cuz you're [ __ ] mad. And now now the therapist has to deal like live with this for the rest of her of her life. It's shitty. I I think for sure it's to your point, it's childlike um irrationality, but also I do like it as a way to be like, \"Hey, Joel, [ __ ] [ __ ] you.\" Like the fact that you lied to me to go off and kill this dude. Like I I understand again why Joel felt like that needed to happen. But it is the core problem of his relationship with Ellie where he's treating her like a child because up until this point like he's essent she's essentially been his child but at",
            "start": 1679.76
        },
        {
            "text": "needed to happen. But it is the core problem of his relationship with Ellie where he's treating her like a child because up until this point like he's essent she's essentially been his child but at the same time like it's gotten to a point of almost I don't know if ownership is the word. What I guess there's the trend of you are lying to me. You are taking um I guess yeah taking ownership of things out of my hands, right? Like you're taking my ability to do my own thing out of my hands. You don't have any agency over here. That's the word I'm looking for. Thank you. Yes. Like I could have saved the world. I like, you know, I have an idea of how to um approach this situation. You might disagree, but in this situation, we're supposed to be partners. You're not supposed to be operating as my father here. Right. Right. Right. Right. But again, the counter-argument to that, of course, is that he is the like the more the person with the more seasoned veteran of the two. And it is in",
            "start": 1724.48
        },
        {
            "text": "as my father here. Right. Right. Right. Right. But again, the counter-argument to that, of course, is that he is the like the more the person with the more seasoned veteran of the two. And it is in completely irresponsible to bring someone back that you don't know. There's no Oh, his hand didn't shake yet. Well, what if he by the time you get him back, he's completely going to infect every single person in the camp or go crazy, right? You don't know. It's the wrong thing to do. But again, he could have. Again, that's that's that's where the nuance is, right? What he should have done was pull her aside and be like, you know, we can't do this. Yeah. You know, we can't do this. No matter how much you want to do, you have to be an adult now and you have to put emotions aside and you have to do what's best for everyone. The needs of the many outweigh the needs of the few are the one. Of course, Star Trek. Exactly. Thank you, Tim. Of course. Well, yeah. Like the other the other scenario",
            "start": 1767.04
        },
        {
            "text": "do what's best for everyone. The needs of the many outweigh the needs of the few are the one. Of course, Star Trek. Exactly. Thank you, Tim. Of course. Well, yeah. Like the other the other scenario would have been Yeah. You argue with Ellie back and forth until he does turn. It's like, \"All right, cool. We just waste the time yelling at each other and now where our relationship is even more strained, you know?\" Yeah, it's Yeah, it sucks. But I I feel that though, right? And I think going back to the scenes where he was trying to be the dad. And I I love those scenes because it is skating that line of like I don't think he's overbearing or over controlling. I think he made a mistake a long time ago or at least feels like the guilt and the weight of that decision that he made. And so he has those those he gets up to the point where he overreacts because of it and then pulls way back because because of that old history, right? And so all that stuff is being said like not without being",
            "start": 1803.12
        },
        {
            "text": "those those he gets up to the point where he overreacts because of it and then pulls way back because because of that old history, right? And so all that stuff is being said like not without being said. Even him reacting and realizing when he sees her like moving the thing being like, \"Okay, I don't even think he actually says that I overreacted in that moment or like I I I did the wrong thing.\" I think he just has that that quiet like let's let her do her own thing. But you would with an adopted child of being of not sure if if they see you as that dad or not, you know, and and so much of his decisions, even the even the decision after the Seth fight of just leaving and just being like so hurt by it, but not being able to express that to her because he doesn't feel like he is necessarily her dad and and he he knows he [ __ ] everything up, but like he did it for the right reason. I don't know. All that stuff is really really complex. And Pedro does it so well. Like when he walked",
            "start": 1838.8
        },
        {
            "text": "her dad and and he he knows he [ __ ] everything up, but like he did it for the right reason. I don't know. All that stuff is really really complex. And Pedro does it so well. Like when he walked away from her at the [ __ ] at the the barn dance or the church dance, whatever it was, I was I'm heartbroken for him. Yeah. Like he does that. He he give this man an Emmy. Give him a golden globe for this. And give Joey P a golden globe for that scene. Why not? Joey P literally like is in this movie is in the show for like 5 seconds and I literally had to get up and like go hug my wife afterward. I was like, \"Babe, I was like, she was like sleeping. I was like, babe, if I ever die of an infection, I'm going to see your face. Don't worry about it.\" And she's like, \"What the [ __ ] are you talking about?\" And I was like, \"Oh, you'll know tomorrow when you watch Last of Us at lunch.\" It's true. Spoiled it for her. I really I liked how they handled it because it is that complicated thing where I",
            "start": 1877.44
        },
        {
            "text": "about?\" And I was like, \"Oh, you'll know tomorrow when you watch Last of Us at lunch.\" It's true. Spoiled it for her. I really I liked how they handled it because it is that complicated thing where I think it's a smart call for the story and giving her the real reason that she's able to catch him in the lie and like not just have it be told like and then later when it is told it's even more heartbreaking. But um yeah, it's also one of those things where I like that she was able to take things in her own control, but it was not the right call. It's like it is a perfect example of yeah there is a person in a leadership position here that there's a lot more writing on his choices than her feelings. Um but that doesn't make things right wrong. It like hard decisions have to be made. And her having that outburst was a like she call later calls Joel selfish. That was selfish for her. She could have handled that completely differently with Joel later. Whatever. She could have had a",
            "start": 1913.28
        },
        {
            "text": "And her having that outburst was a like she call later calls Joel selfish. That was selfish for her. She could have handled that completely differently with Joel later. Whatever. She could have had a conversation. She wanted to bring him down, which makes sense, you know, like that's real and like that that I think is a a human uh kind of need, but when you look at Joel's place in the Jackson community and Tommy's place as well, and even to this point in the story, like we're hearing that like Joel's kind of seen as like a newcomer to this world, but he's also incredibly valued because of how skilled he is, right? that level of tension is already there of him being like new to this place and like already kind of like ascending in in um leadership word, right? Stature, right? It's like to a degree that there's a threat there or the greatest um ally possible. And for the lead therapist, the only therapist of this community to now have this feeling towards him, like that's complicated",
            "start": 1953.2
        },
        {
            "text": "a degree that there's a threat there or the greatest um ally possible. And for the lead therapist, the only therapist of this community to now have this feeling towards him, like that's complicated because in a lot of ways, like you got to imagine Ellie telling her that way probably changed therapy forever for Jackson and the way that it is handled. Oh yeah, everyone's [ __ ] Now, that goes back to Joel's the one that did it, you know, but that goes back to Joel did the right thing and needed they could not have just brought him back and like had a nice goodbye. Like that's not how this works. But also again, as a as a as a as an adult looking at that situation, how is that going to go? Oh, sure. If somebody brought my wife to me was like, \"Hey, we have to go shoot her right now.\" But she just wanted to say, I'd be like, \"Fuck no.\" Like, I don't want to see you shoot her in the back of the [ __ ] head. I don't want to hear that shot. Do it out there and tell me the nice narrative.",
            "start": 1998.16
        },
        {
            "text": "she just wanted to say, I'd be like, \"Fuck no.\" Like, I don't want to see you shoot her in the back of the [ __ ] head. I don't want to hear that shot. Do it out there and tell me the nice narrative. That's what I want. Cuz it doesn't It's not going to change the fact that she had to die. God, this is getting really dark. You know what I mean? Like that. Totally totally inappropriate to bring it back at all. I thought for a second, by the way, I thought he was going to be like, \"She's going to have to like this is your first patrol. You got to do it.\" But I mean, real talk, like I feel like that there is a world where that happens, but I think that this is another character thing for Joel. He wasn't fully ready to let Ellie be on patrols. And I think that's what he would have done. Exactly. For me, that's the bigger thing where I don't think I don't think Joel's major decision of, oh, we got to put down Eugene. That's not the wrong decision whatsoever. I think the selfishness of it",
            "start": 2042.08
        },
        {
            "text": "For me, that's the bigger thing where I don't think I don't think Joel's major decision of, oh, we got to put down Eugene. That's not the wrong decision whatsoever. I think the selfishness of it comes into the conversation of how he went about it, right? Of being like, \"Yes, I'm going to do it. Go get go grab the thing and then I'm going to sneak off and kill Eugene over there to what we're talking about earlier, right? It could have been the thing of pull her aside.\" It could have been I think any I think what Ellie was probably looking for in that moment was to feel like either an equal or to feel like she had any certain any sort of agency in the situation. I think having that agency stripped away and having Joel lie was the thing of playing that over again. And that's where that outburst comes from, right? comes from 5 years of built up like man this guy has been like this guy has been lying to me this guy took this thing away from me and now like all it's all coming out in this",
            "start": 2078.24
        },
        {
            "text": "comes from, right? comes from 5 years of built up like man this guy has been like this guy has been lying to me this guy took this thing away from me and now like all it's all coming out in this moment and Katherine O'Hara just happens to be just happens to be the the victim in the situation where it's going to happen it's interesting too because he got the reason she got the patrol in the first place was the birthday present right that if the memory shows correctly like and even then you're like is this the right move is she old enough for this I mean I think she's old enough but I mean but she needs to be correctly supported though you know what I like not like a half step of like you get to come but like not really do the things, right? This is always that moment in like the movies where it's like we got to go out and it's like you got to get your first kill or something like that and it changes you forever, right? I don't know if they allowed her to have that moment. I do want to",
            "start": 2114.4
        },
        {
            "text": "it's like we got to go out and it's like you got to get your first kill or something like that and it changes you forever, right? I don't know if they allowed her to have that moment. I do want to go back though briefly to that to I think it was episode one with a therapist where she says, \"I'd love that moment now and watch I want to rewatch that scene where Katherine O'Hara is basically like I know that you did the right thing. I know that by by our protocols and our laws here, you did what you were supposed to do, but I [ __ ] hate you. I [ __ ] hate you and I will always hate you for it. And just such a good of course that's how you would feel. And he co that she she totally could have had that weight lifted off of her had Ellie just kept her mouth shut. But that situation, that one little outburst of basically like again to your point like and the nuance of this and the subtlety of this and like Ellie's not being just a an impulsive teenager here. She's fighting against sort of",
            "start": 2150.08
        },
        {
            "text": "little outburst of basically like again to your point like and the nuance of this and the subtlety of this and like Ellie's not being just a an impulsive teenager here. She's fighting against sort of like the conservatorship that it has been Joel for the last like you know 16 years or however long for of her life, right? But that choice like all choices have ramifications and we've seen where that future ends up and it ends up with the the one person who's in charge of everyone's mental state is kind of broken. Yeah. God, it's good stuff, man. Good story here. Where do we think next week's episode's going to take us? That's the big question, man. Because there's a lot of stuff like cuz here's the thing. We got to assume that the episode ends, and again, this is a full spoiler show, so just be aware of that. We're all aligned in assuming it ends at the theater with Abby coming back shooting Jesse, right? I imagine so. Yeah. And then the final lines are like Aby's like looking at the",
            "start": 2188.56
        },
        {
            "text": "be aware of that. We're all aligned in assuming it ends at the theater with Abby coming back shooting Jesse, right? I imagine so. Yeah. And then the final lines are like Aby's like looking at the camera and I forget exactly what she says, but like before the cut when it like goes to the the flashback eventually for Abby and the Doctor and all that stuff, right? I I mean she's walking back into the theater at the end of this. So if that happens, presumably we have to get everything else that happens with Ellie leading into that. What's left with Ellie is the aquarium cuz Ellie has to deal lightly with the sarapites unless we already dealt with that like like them going through the two weeks ago was how they're going to do that. But I feel like there's the second her trying to get through to the aquarium, right? She has to go through a bunch of sarapites unless they skip that. Then she gets in the boat and goes to there's like the arcade she goes into and faces like a a big bloater guy",
            "start": 2230.96
        },
        {
            "text": "the aquarium, right? She has to go through a bunch of sarapites unless they skip that. Then she gets in the boat and goes to there's like the arcade she goes into and faces like a a big bloater guy or whatever and then gets to the aquarium and kills a bunch of people. Like that's where Owen dies and Mel dies. I mean, they all have to die, right? They're the Owen dying day three. Yeah. Wow. Yeah. Literally like next to each other. Holy [ __ ] So I'm like, next episode are we about to I mean I we I think we have to get Owen's death, Mel's death, and then that's why Abby comes because you killed all my friends. Cuz right now she's only killed Nora. Yeah. Yeah. We need to see her kill Mel and Owen. And then I mean Manny we don't see die until Aby's story, right? Oh man. Sorry, spoilers for the game. Didn't Didn't this section end though in the basement of the the theater with like you sneaking around and Abby trying to [ __ ] kill you? And that was Aby's Abby. That's you facing Ali cuz",
            "start": 2277.12
        },
        {
            "text": "the game. Didn't Didn't this section end though in the basement of the the theater with like you sneaking around and Abby trying to [ __ ] kill you? And that was Aby's Abby. That's you facing Ali cuz they both end in the same kind of time frame where you're back in the theater. But I think you don't have Abby versus Ellie and doing that whole gameplay sequence until Abby day three. Okay. [ __ ] But I do complicated. I think you could get there though as far as what you're talking about, right? Like I I mean you you fasttrack it a bit. Maybe we don't I forget like what happens in the arcade, but maybe you don't get that. Yeah. In the chat, Cooper is correct, right? Technically, that's not where it ends, right? The story does end on the beach. Is this No, no, but like this story like where this season ends in the theater, right? Where we get both of them like their the day three story ends here. Yeah. Ends in the theater in a post aquarium world. We're in a post aquarium world. post",
            "start": 2325.28
        },
        {
            "text": "this season ends in the theater, right? Where we get both of them like their the day three story ends here. Yeah. Ends in the theater in a post aquarium world. We're in a post aquarium world. post aquarium roll. I think both of the day 3's end of the theater and then there's like an abbey post day three where I think you're playing back as Elliot and you go to Santa Monica or something. Yeah, you have to go chase after it's like a like two more hours or [ __ ] like that. It's something crazy. It's cool. It's a wild two hours. Um, but yeah, I think it could fast track it. And I wonder like I mean maybe you spread it out a little bit where I mean it could be the thing of Abby or Ellie kills everybody in the last 10 minutes of the episode. Or maybe she runs into somebody at the arcade instead of I don't know. It's got them at the aquarium. It's got to end with that and then season 3 has to pick up with like it's got to end with almost that like them almost killing us each other and then",
            "start": 2363.28
        },
        {
            "text": "of I don't know. It's got them at the aquarium. It's got to end with that and then season 3 has to pick up with like it's got to end with almost that like them almost killing us each other and then see it just like stops cliffhanger and then season three episode one is Abby, right? Yeah. has to be that's so much it has to go all the way back to we'd be there is such a big missed opportunity if we didn't start season three and then just kick off with that do you save all the Sarafite stuff for next season I could see that I well cut it out Nick I don't think we see the fight between them no that's what I'm saying I think I think it's it's the almost that moment the tension of that and then stop cliffhanger season 3 kicks off and it's it starts with Abby like training oh man that's tough to do in like to get like that and I know they did it in the video game, right? But like to have it be a thing of, oh, they're about to fight and then we wait a couple years and then season 3 starts and",
            "start": 2402.64
        },
        {
            "text": "do in like to get like that and I know they did it in the video game, right? But like to have it be a thing of, oh, they're about to fight and then we wait a couple years and then season 3 starts and you realize that you're not going to get what's next until the end of season 3. That's awesome though. It's going to be so fun. But also, don't forget that like here's the thing. I mean, what's crazy is like we could just fast track it. Get that get Ellie just to the aquarium. Like she finds out they're at the aquarium cuz we don't know that yet, right? No, I don't think. So, how do they figure that out? Did Norah tell her? What did Norah tell her? Did Norah tell her anything? No. Oh, we don't know. We don't know because it ended with her being like, \"Where's Abby?\" She's like, \"I'm not telling you shit.\" And then you're just beating her ass with the uh like torturing her basically, right? Yeah. She has to figure out how to get to the aquarium, get to the aquarium. All Ellie has to do is",
            "start": 2444.64
        },
        {
            "text": "you shit.\" And then you're just beating her ass with the uh like torturing her basically, right? Yeah. She has to figure out how to get to the aquarium, get to the aquarium. All Ellie has to do is kill Owen and Mel. Maybe we're good there because getting back to like after she kills Owen and Mel, if I remember correctly, it then just goes right back to the theater and that's when Jesse comes out, gets shot by Abby, Abby uh essentially makes Ellie drop the gun and it's like, you let you live and you [ __ ] wasted. You killed all my friends. That's where they're going to end the season. So, my question is, did the aquarium already happen? No. Because she's been thinking about Joel for a long time. Maybe we flash back in season three to all the [ __ ] that happened in the aquarium. No, but see, we need we need to see her kill Owen and Mel before Abby comes and says, \"You killed all my friends.\" Do we? I mean, [ __ ] I guess maybe we know it. That's be wild. Yeah. But I'm saying is like",
            "start": 2484.48
        },
        {
            "text": "see, we need we need to see her kill Owen and Mel before Abby comes and says, \"You killed all my friends.\" Do we? I mean, [ __ ] I guess maybe we know it. That's be wild. Yeah. But I'm saying is like cuz I don't know. You really don't know what Aby's like emotional status is here. So imagine how crazy it would be if like midway through season 3 it cuts back to their sh their and this this [ __ ] Wraith is out there. this Ellie like angel of death is just killing all of her friends and she's like, \"We have to [ __ ] stop.\" And then she's like, \"Well, they're in the theater. Let's [ __ ] go.\" Yo, you might be [ __ ] on to something because that way we don't need to like I feel like it would be a little rush to get to it next. But if we get it, if we never even get it from Ellie's perspective killing them, but we get it from Aby's perspective that Ellie or not Aby's but that story line that she comes ah Aby's not there though. That's the one thing that I don't think that they can frame",
            "start": 2524.48
        },
        {
            "text": "killing them, but we get it from Aby's perspective that Ellie or not Aby's but that story line that she comes ah Aby's not there though. That's the one thing that I don't think that they can frame this in a way of Ellie coming in looking like the bad guy. Unless they just do. But we know. I think they do. I'm already at a place where I'm ready to call Ellie the bad guy cuz I think Ellie is the bad guy to Abby, right? Ellie is kind of the bad guy period. Like it's just the good guy in her own story potentially. But at this point, she's the bad guy. She's just cold blooded murder at some point. So it could be interesting. It could be cool. That makes sense. That could be. Zach in the chat seems convinced we're seeing the aquarium next week. The aquarium with Ellie is not that long. So, we could just It could be It could start with the aquarium and then we wind up back here. But either way, we're at the theater and that's where that's where the showdown happens. So, there's no way she's",
            "start": 2568.0
        },
        {
            "text": "just It could be It could start with the aquarium and then we wind up back here. But either way, we're at the theater and that's where that's where the showdown happens. So, there's no way she's going to the theater, then back to the aquarium, then back to the theater. It's not [ __ ] happening. It's just that's she does. Even in the game, cuz the theater's like your home base. Yeah, that's a good point. Yeah. I just don't remember in the game. Somebody let me if you in the chat right now can tell me. How does she know to get to the aquarium? Does she go back to the um theater and then Jesse and them were listening to the [ __ ] radio or something and found out they're at the aquarium? That's their base. I just remember Norah tells her. They're saying Nor. Norah tells her. Yeah. Okay. And she doesn't tell her in the show. Well, we I don't think we left it on a cliffhanger. Oh, okay. I think she was like the last thing you hear her say is like, \"Where's where the hell is Abby?\" or",
            "start": 2607.28
        },
        {
            "text": "And she doesn't tell her in the show. Well, we I don't think we left it on a cliffhanger. Oh, okay. I think she was like the last thing you hear her say is like, \"Where's where the hell is Abby?\" or whatever. And then she just goes whap and then it ends. Okay. Okay. So, yeah, probably Norah probably tells her in the show and then we get next episode she's going directly to the aquarium. Got it. All right. Cool, man. Well, we'll find out next week. One more thing. What? Remind me what was up with the boat cuz I remember riding a boat down downtown. That's how she gets to the That's how she gets Okay. Yeah, cuz you she gets the boat. I mean, the boat event you first get the boat going into the hotel, right? Not hotel. Sorry. The um hospital. Convention. Oh, hospital. Okay. I remember the convention center's Abby. Is it really right? I thought that was Ellie. I'm I'm mixed up because as somebody who lived in Seattle, I am thinking about the route from the convention center to the",
            "start": 2646.24
        },
        {
            "text": "the convention center's Abby. Is it really right? I thought that was Ellie. I'm I'm mixed up because as somebody who lived in Seattle, I am thinking about the route from the convention center to the aquarium and I'm like, \"Oh, you could probably ride a boat all the way down down the street.\" Yeah, cuz Ellie does have that big thing where she deal where she gets sucked through the sewers, which the show kind of just like quickly did. It wasn't like a real full-on thing. Ellie and Jesse. Yeah. Oh, okay. Yeah. Convention center is right before the boat. So then yeah, you get she gets the boat and then the boat she like goes on the crazy ass waves to get out to the aquarium. Yeah. And then it's an Aby's story where she's going through the little boat dock station thing and that's where Manny is and Manny gets shot by Tommy. Yes. Cuz you're Tommy's shooting you. Yeah. But you don't know it's Tommy. You don't know it's Tommy. Yeah. But like that was cool. I remember that scene. That was a",
            "start": 2683.2
        },
        {
            "text": "is and Manny gets shot by Tommy. Yes. Cuz you're Tommy's shooting you. Yeah. But you don't know it's Tommy. You don't know it's Tommy. Yeah. But like that was cool. I remember that scene. That was a fun scene. So sick. What a game. What a game. What a show. Uh, next week we will be giving our thoughts on the finale of season 2. Uh, and then I'm sure having a similar discussion to this about what we think is going to happen in season 3. I think it'll be a lot clearer after that. Um, stay tuned after this. We're doing the kind of funny podcast. It's sure to be a great episode where uh, everyone takes some shots of some Sprite tea, sees what's up with that. Uh, but until next time, I love you all. Goodbye. [Music] Hey, hey, hey. [Music]",
            "start": 2724.32
        }
    ]
}