{
    "id": 14159,
    "video_id": "92geppKW5tM",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino"
    ],
    "title": "Nick Continues DOOM: The Dark Ages!",
    "description": "Go to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748469897,
    "duration": 8528,
    "transcript_chunks": [
        {
            "text": "[Music] three, two Yo, what the heck is going on, ladies and gentlemen? Welcome back to another funfilled stream. My name is Nick Scarpino. I'm riding with the master of ones and twos, Kevin Coelloo. It's supposed to be ones and zeros. Uh, welcome back, everyone. We No, it's I think they say ones and twos. Is it ones and twos? I like ones and zero though a lot. Oh, I thought I always thought it was a binary code thing. I never if that's the case. I have not noticed that. Greg, wait. Chad, is it ones and twos? Twos and ones? Threes and ones? Who? Cuz that's usually what I say. They say ones and twos and I say twos and ones. Yeah, cuz I like the same numbers backwards like that. Huh? But I like the binary thing. Call you the binary god. Oh man. Big day for me, Kevin. Huge day for me. You beating this game today? No. God, no. Oh, although maybe I have no idea where I'm at in this game. Uh, no. Sony announced a new little camera. That's Oh, really? Yeah. The FX2 and so I'm dorking out",
            "start": 0.77
        },
        {
            "text": "beating this game today? No. God, no. Oh, although maybe I have no idea where I'm at in this game. Uh, no. Sony announced a new little camera. That's Oh, really? Yeah. The FX2 and so I'm dorking out about how much people are hating it. Chad, does the audio sound good? Cuz now I it started again. The little staticking on my end, but I can't tell if that's just a monitoring issue that I'm having. Are you also hearing this? Let me go back in the game. Let's start it up, everyone. Of course, ladies and gentlemen, this is kind of funny streams where each and every week we like to play games for you right after they do the real shows. I'm playing Doom: The Dark Ages right now. And man, I I had a blast playing this with Andy last week. Uh, and I've been wanting to go back to it. Uh, I downloaded at home and I was very, very, very, very interested in playing it more and then I guess I just got so caught up in Cyberpunk again, which I know is just the most contemporary of new games. Uh, so",
            "start": 55.92
        },
        {
            "text": "at home and I was very, very, very, very interested in playing it more and then I guess I just got so caught up in Cyberpunk again, which I know is just the most contemporary of new games. Uh, so Chris Hank, I apologize for texting you so much about the monowire, but uh, thank you for your recommendations on that and let's jump into this game right now. Of course, guys, if you're just joining us for the first time, this is how it works. We'll play for a few hours. We're going to have some fun. We're going to look at all these bad boys and uh, if you guys feel like subscribing, that would be fantastic. If you've got Amazon Prime, you get one free Twitch Prime subscription, and we'd like that to go to us. You guys can use that right now. But if it's not going to go to us, don't even don't don't even worry about it. No, you don't even worry about it. Come to us. I got to remember this. Hold on. Let me get Let me just kill these. Ah, let me kill these guys real quick. Cyber Punk is very",
            "start": 102.4
        },
        {
            "text": "don't even worry about it. No, you don't even worry about it. Come to us. I got to remember this. Hold on. Let me get Let me just kill these. Ah, let me kill these guys real quick. Cyber Punk is very good, man. We should play Cyber Punk today. No, this game work. Have you played this at all, Kevin? No, I have not. This looks good. Looks Every time you play it looks fun. It's super fun. You crank that field of view, huh? Um, hey, Andy set this up for me. This big. Yeah, I did not set this up. Chat, you're going to have to bear with me cuz I'm in cyberpunk land right now, so I have to remember how this works. Oh, you just got douched. Oh, yes. Yes. Yes. Oh, I died. That was fast. That was fast. Let me just load this. Oh, Doom of the Dark Ages. We played a couple hours last week and we had some fun and I really want to go back to this. So, I was hoping that Andy uh would allow me to cuz Andy is my master here. Your keeper? Yes, he's the keeper of Nick. Ride with us. Mike is out. And my",
            "start": 137.84
        },
        {
            "text": "some fun and I really want to go back to this. So, I was hoping that Andy uh would allow me to cuz Andy is my master here. Your keeper? Yes, he's the keeper of Nick. Ride with us. Mike is out. And my favorite thing to do is whenever I hang out with Andy or Roger, I tell people that I'm hanging out with Mike's best friends. I'm like, \"Hey, let's go to Starbucks. Mike's best friend, Roger.\" Oh, you say to them. Oh, yeah. Yeah. I tell let them know so that just so they know they're Mike's best friend cuz Mike's never I'm never Mike's best friend ever. God, this game runs insane. Do you notice a difference? All right. Have you only played on st Andy Station? Uh, I've only played on Andy Station, but I played Cyberpunk now on both my st my my 3090 at home and the 5090 that's in this machine and it is it's still actually very enjoyable even on my 3090 if I'm being real. But holy crap, it's a night and day difference. Yeah, it is just like I almost want to like do a comparison video with it",
            "start": 213.68
        },
        {
            "text": "it is it's still actually very enjoyable even on my 3090 if I'm being real. But holy crap, it's a night and day difference. Yeah, it is just like I almost want to like do a comparison video with it where I just but it's going to make me cry cuz I just don't think you like whatever voodoo magic they've got going on in these cars with with AI. It's so ridiculous to watch to roll around night like look how first off this looks incredible right now. I mean, this is crisp as hell, but I don't think Doom necessarily is pushing like I don't I think this game is set up to be like really performancedriven. Mhm. I don't think it's pushing the uh the ambiance and of the path trace lighting and all that jazz, but man, when you roll around Night City, even a game that's that old and they've optimized it, it's so freaking it just like draws you in. You just want to hang out there and exist in that world. You know, something that me and Andy have always talked about doing and like I guess it was",
            "start": 263.36
        },
        {
            "text": "it, it's so freaking it just like draws you in. You just want to hang out there and exist in that world. You know, something that me and Andy have always talked about doing and like I guess it was like for sponsorship things, but really it's for fun is um I did some research on one controller controlling two PCs. So essentially your laptop or your mouse and key you get the exact same experience basically. Yeah. And I wanted to start like two games at the same time. same games just different settings cuz we'll do screenshots and then compare them side to side but it's not the same as being able to switch live from one to another and like I have the technology set up we just got to that point and then haven't done haven't gone further cuz it's such a big difference and like the screenshots are great and they give you an like an idea of like how different it looks but the movement and like how the light interacts it's you know it's it's it's all more dramatic and I want to see it. Oh, I",
            "start": 312.88
        },
        {
            "text": "are great and they give you an like an idea of like how different it looks but the movement and like how the light interacts it's you know it's it's it's all more dramatic and I want to see it. Oh, I agree. All right. I got to like the set. I can't be going. Look at how crisp that is, though. Kabs, do you need a dual setup for that or can you use something like um like is that a softwarebased thing or is that something with like a physical Kabs here in the chat says I wanted a dual setup for stuff like that remastered PS1 games and I'm like I wonder if you can do that with like a hardware based thing with I guess you would need how do you make sure I guess you start the game you'd have to start them at the same time at the same time. Yeah. Yeah. Oh, he jumped up there like that. Yeah, I don't like how he's like just swiping at me like a cat playing with me. Mhm. You You messed him up real Oh, he's still alive. Oh, yeah. There he goes. What's What's up with that green helmet on the",
            "start": 365.12
        },
        {
            "text": "I don't like how he's like just swiping at me like a cat playing with me. Mhm. You You messed him up real Oh, he's still alive. Oh, yeah. There he goes. What's What's up with that green helmet on the floor? Uh the green helmet is uh shields. I just picked that guy apart, but I think I'm full shields. No, I just got it. Yeah, you definitely weren't full shield. I love that. There's just the great the the thing about this game that's so freaking fun is that everything is feels like it is tailored to keep you moving forward. Mhm. And that's like there's such an inertia to this. Like even that right there is see where it the green well where like you know it gives you a little extra like forgiveness when you dart across like [ __ ] like that where you do the shield bash. It just feels very like hey man we want you to get this guy. Oh that's a big thing. Oh like a crab man. Yeah he's a big crab guy. Ah [ __ ] Is the guy hurting you? I was going to say that guy's behind me. [ __ ] Oh [ __ ]",
            "start": 429.36
        },
        {
            "text": "hey man we want you to get this guy. Oh that's a big thing. Oh like a crab man. Yeah he's a big crab guy. Ah [ __ ] Is the guy hurting you? I was going to say that guy's behind me. [ __ ] Oh [ __ ] There was another crab man behind you. Big crab guy. And now what level of difficulty are you playing on? I'm on medium. Okay. Yeah. I remember when I played uh Eternal, I got about 3/4 of the way through the game on medium. Then I was like, let's go to let's go to a little easier. Won't work due to RNG. Sure. Sure. But it'll work enough. And I think depending on the game, like Cyberpunk, how many times do I have to do it? It would be like good enough to walk into environments and show, you know, not for the whole game, but maybe for the first few minutes of like, hey, look, this is a sideby-side comparison. Also, don't like it'd be fun to just just test the limits of technology, you know? We got to upload it to Vimeo, though, so you can see it at actual full resolution. That's right.",
            "start": 494.12
        },
        {
            "text": "comparison. Also, don't like it'd be fun to just just test the limits of technology, you know? We got to upload it to Vimeo, though, so you can see it at actual full resolution. That's right. [Applause] J. God, it's so fast. Yeah, it just goes fast. You just got to get into it. This double bar shotgun could not be nastier. Also, Andy when he went in here, he just jacked up the music and jacked down the sound effects. So, I'm like at any given time, I'm like, I have no idea what's happening, but there's pulse pounding metal music happening, which is great. I mean, you can change the settings 100%. But I just thought we Andy has he has chastised me so much for not playing on the correct settings that I'm now just going to play as he tells me to play. Like he totally he he definitely got me to uh tone down my mouse sensitivity. Yeah. Which is good actually. I think really you're feeling that difference. Yeah. I know cuz I was here when he did that. Oh, okay. But if he asks, you know,",
            "start": 558.32
        },
        {
            "text": "me to uh tone down my mouse sensitivity. Yeah. Which is good actually. I think really you're feeling that difference. Yeah. I know cuz I was here when he did that. Oh, okay. But if he asks, you know, it's good. Sure. [Music] But I've done it across the board in all my games, you know. Oh, doctor. Oh, have you? That's impressive. Now, yeah. Every time I play, even in Cyberpunk, I was like, I'm going to do this. I owe it to Andy to do this. Oh. Oh. Oh. Oh. What the hell is that thing? Hey man, not cool. What the heck, man? That's tasty. Secret. Secrets. I've got a secret. You're singing sticks. Yeah, it's great. Andy is slowly morphing into Fran with getting in the menus. That's I don't think it's slowly the nicest/ worst thing you could ever say to someone. Always exciting to get a Fran text. What's Fran up to? I don't know. He He texted me for my birthday. That was sweet. Where'd you guys end up? I saw that picture that you posted. Where'd you guys end up going to dinner? Uh place",
            "start": 650.56
        },
        {
            "text": "text. What's Fran up to? I don't know. He He texted me for my birthday. That was sweet. Where'd you guys end up? I saw that picture that you posted. Where'd you guys end up going to dinner? Uh place called Lazy Bear. Uh two star Michelin restaurant. Have we been there before? No. Okay. Yeah, I've heard of it. It's uh It was wild. Was it good? Yeah, it was delicious. It's a tasting menu, so it's like 12 courses, but everything's like a spoon. Oh god. Ah. Land on Oh. Oh no. This game is super Yeah. This game. Yeah. Like not even doing attack. No. No. I don't even want you to do that. Look at that big boy. Oh, and he's got a gun. I don't think he needs a gun. You're dying. Yeah, I know. Oh, I forgot what I supposed to do. I got to put my shield in him. Dang, I'm playing like boo boo right now. Ah, excellent. Hugo Martin says, \"Hello, I'm the game director.\" You liking it? He's the game director for Doom. No proof of it, though. Yeah, I don't believe you. But like, let's pretend he is.",
            "start": 744.64
        },
        {
            "text": "now. Ah, excellent. Hugo Martin says, \"Hello, I'm the game director.\" You liking it? He's the game director for Doom. No proof of it, though. Yeah, I don't believe you. But like, let's pretend he is. Yeah, he's liking it a lot. Yeah, this game's incredible. It's so fun. Peter, I want that little page. I don't know what it is, but I want it. [Music] hit. I guess I should have jumped it over there. Dang. All right, let me try that again. Let me see if I can go back and get that. obtain a key. Okay, I missed that. Hugo says, \"Proof. I just streamed last night. Um, I got three kids. I'm old.\" Yeah, I need your PIN. That's not proving anything. Your social security number. I'll verify. I'm not seeing this. Secret. Secrets. We've got some [Music] secrets. Where did I go? I must have gone through here, right? [Music] How far are you on? Like, are you only playing this on stream? Oh, yeah. Yeah. Oh, I found the codeex. Yeah. just on stream. Like I said, I wanted to play it a little bit more",
            "start": 806.28
        },
        {
            "text": "here, right? [Music] How far are you on? Like, are you only playing this on stream? Oh, yeah. Yeah. Oh, I found the codeex. Yeah. just on stream. Like I said, I wanted to play it a little bit more uh on my own, but I'm just so into my netrunner build right now, guys. You have no idea. I had to respe for the Delmain missions. It was a big thing for me and Chris to figure out. It'd be fun to make you play this once on uh on the actual actual Xbox. Why is that? Just I'd like to see your thoughts on like cuz like you know you used to be the kind of gamer you'd play on Xbox no problem. Now you've had fun with the PC for so long. Oh, sure. where it's like I wonder how much of like a downgrade it would feel like. It probably feel like a pretty big downgrade. Hugo says, \"I watched your guys' podcast reviewing our game. Really appreciated the review. Sorry the dragon got a little tedious, but the updates are coming to streamline the experience a bit more. Thanks for playing. Enjoy. See you",
            "start": 899.04
        },
        {
            "text": "reviewing our game. Really appreciated the review. Sorry the dragon got a little tedious, but the updates are coming to streamline the experience a bit more. Thanks for playing. Enjoy. See you later. Thanks, Hugo. Thanks, Hugo. Thanks for making an awesome game. Very good. It's really quite fun. Everyone loved it unanimously. I think we actually did. No, I know. That's what I was saying. I think I ran that podcast. You know what? I want to do this guy. I think it's this guy, right? Red Shinobi. That's actually exactly why I'd like to see him play it. He was saying it's not much of a downgrade. The Xbox can run this uh can handle this game just fine. It's more of an analysis as Nick as a gamer over the last couple years. Oh, god dang it. I'm really missing something, chat. What mechanic am I missing here? What am I doing? I was having zero problem with these guys the first time I played this. I got to get my I got to get back in my head for uh for Dark Ages. Maybe I just need to be",
            "start": 992.72
        },
        {
            "text": "am I missing here? What am I doing? I was having zero problem with these guys the first time I played this. I got to get my I got to get back in my head for uh for Dark Ages. Maybe I just need to be eight times louder. Let's try this right here. There you go. Maybe that's the problem. No, Red Genobi. Is that true? Tell them to switch control right now and that's basically the Xbox experience. Yeah, I don't know. I mean PC is just so much more streamlined. Like it's I know it's a pain in the ass sometimes get deal with drivers updates and whatnot. Yeah. I mean you still have updates on consoles but I don't know. It's just being able to play mouse and keyboard for games like this. Currently working says really nice. Check what upgrades you uh got so far in the menu. Let's see here. Uh what's my menu here now? Oh, let me get past this spot real quick. Is it the letter E? No, I have Who am I getting [ __ ] hit? Oh, it's this guy. God damn it. [Music] There's a red vial behind that barrel.",
            "start": 1054.64
        },
        {
            "text": "my menu here now? Oh, let me get past this spot real quick. Is it the letter E? No, I have Who am I getting [ __ ] hit? Oh, it's this guy. God damn it. [Music] There's a red vial behind that barrel. Yeah, it's it's for Was that not healing? No, healing is green. Damn it. I think it's green and blue. It's just red right now cuz you're so low, I guess. Yeah, very red. I just keep getting nuked in that section. Let's go over here real quick and see where I'm at with my upgrades. Upgrades available. All right. Uh oh, I got gun upgrades. Oh, see hitting a demon with shield throw. Now, are upgrades the thing where like if you upgrade in guns right now, you're not going to have as much upgrade for melee? Yeah. So, I mean, you should upgrade the gun that you're using, right? Or Yeah. I just don't know which gun I prefer. I guess I mean, that's what I'm going to use. I mean, you just said the shotgun's perfect. Shotgun is great, but the ch I just got the chain ball at the end of the other one.",
            "start": 1103.56
        },
        {
            "text": "know which gun I prefer. I guess I mean, that's what I'm going to use. I mean, you just said the shotgun's perfect. Shotgun is great, but the ch I just got the chain ball at the end of the other one. That's awesome. C instantly charge your next shot. I don't know about that. currently working. Says, \"Also throw the shield into enemies to keep them stunned. [Music] Interesting. I don't need that.\" Oh, let's see what this is. Let's see what my shield is at. I don't think I can upgrade this, can I? Your shield might be very basic right now. Oh man, I need that. Oh, that's sick. That's so [ __ ] cool. I'm going go to the restroom. Yeah, have fun. The chain shots your favorite. Where is that at? We'll do this later. Let's get to this spot first. We need health. Oh, this is the chain shot. This is what you're talking about. Yeah. Yeah. Yeah. This does look lit. There we go. Get daddy a shield. God damn it. Why do I have zero [ __ ] health right now? Oh. I know what I'm going to do. This",
            "start": 1181.6
        },
        {
            "text": "is what you're talking about. Yeah. Yeah. Yeah. This does look lit. There we go. Get daddy a shield. God damn it. Why do I have zero [ __ ] health right now? Oh. I know what I'm going to do. This gun. Let's just shoot these guys. Heat. Heat. Thank you, Jesus. Thank you, Jesus. I need the key. Found it. It's kind of okay to never have health in this game. Fair. I prefer to have health, though. Oo, Doom plushy. Look at him. He's cute. Oh, yes. I'll tell you what, I'm just proud that I was actually able to redeem my skin and now I have it in this game. I'm proud of myself for that. That's some real gamer stuff right there. All right, chat. What upgrade should I do right now? Where should we go? Let's get an upgrade. Let's get a nasty upgrade going. Mhm. Melee. Maybe this. Demons hit by flail are scorched and drop armor. Yeah, I kind of love that. That's funny. I like that. Uh, Lucid Dre, that's funny. Funky Fitness, thank you for that Prime stuff for 40 months. Remember guys, if you have",
            "start": 1281.12
        },
        {
            "text": "are scorched and drop armor. Yeah, I kind of love that. That's funny. I like that. Uh, Lucid Dre, that's funny. Funky Fitness, thank you for that Prime stuff for 40 months. Remember guys, if you have Amazon Prime, you guys have Twitch Prime, give it to us. Please don't make me ask twice. Don't make me beg. Ignited. All right, let's rock. How do I switch fire mode on this? There it is. That's what I want. Oh, this is fun. I want that ruby. Give it to me. Oh, big guy. Ah, already low health. Okay, that's what I forgot. You got to just be fist bumping those guys. Ah, jet. Ah! Ah! I got stuck in the water. It's so slow. Stay out of the water. Oh, really? Okay, I already got the upgrade. Cool. God, I mean, this is ridiculous. running at 200 frames per second right now. I should be much better at this game. Ah, just ran right at his ass. Oh, did you see unique technique says I heard you Hugo saying on his stream that they made the game harder since you played last. Really? Yeah. No way. I",
            "start": 1507.4
        },
        {
            "text": "at this game. Ah, just ran right at his ass. Oh, did you see unique technique says I heard you Hugo saying on his stream that they made the game harder since you played last. Really? Yeah. No way. I don't know. It seems a lot harder. The floor is acid and quite annoying, but that might not be for now. Oh yeah, it's it it feels harder. Yeah, I'm not going to lie. I thought I just got really bad at this game, but it feels like my health is not lasting as much. And when I when I kill the the ads, they're not giving me as much like health. I I swear to God, the first time I played this, I died maybe four times. And I have died eight times since I started playing this game. They did make it a bit harder. Okay, well, it is harder. Okay, I'm not crazy. I thought I was going nuts. I was like, why am I so bad at this game right now? Okay, we going. Well, you know what I always say. If they make it harder, we go easier. About to jack that down to easy mode. I I play Doom for the story,",
            "start": 1688.76
        },
        {
            "text": "why am I so bad at this game right now? Okay, we going. Well, you know what I always say. If they make it harder, we go easier. About to jack that down to easy mode. I I play Doom for the story, everyone. Yeah, I don't play for the mechanics. I play for the story. It's a very story driven game. [Applause] Currently working. Says shield up always. It would be hilarious if Andy turned up the difficulty for Nick. That would be funny. Well, remember when they made me play Pokemon inverted for some reason or whatever it was? Yeah, that was a fun bit. And we turned it off eventually. Oh, he doesn't want none. Do you want some? Come get some, dude. Give me the balls. Listen to that. Give me the freaking balls, dude. All right. Well, that was a mistake. Oh, you don't have to like hit it like exactly. That's No, it's very forgiving, but um a little less forgiving than it used to be. Truth be told, this thing is still out there, man. He's haunting me. Oh, yeah. your shield like my shield uh",
            "start": 1761.04
        },
        {
            "text": "That's No, it's very forgiving, but um a little less forgiving than it used to be. Truth be told, this thing is still out there, man. He's haunting me. Oh, yeah. your shield like my shield uh bash takes forever to recharge now. Charander, I've been doing good. No complaints. Oh, okay. He's dead. There you go. You got him. I could have sw I was like I swear to God I have to take his armor off of him, but I guess that was it. Look at that, chat. I think you did break his armor. Like I It looked like at points things were coming off of him. But were they ever really on him? Yeah. My big life update, Charanders. And my little my little dude's crawling around now. Cool. Oh, no. I love it. It's the best. Oh, we got to be careful with the dog water, but other than that, you know, you know, he'll figure that out eventually. It's hydrating. Also, uh, Blueprints just, uh, put out an update to fix the the glitch. Oh, did you get your saves back or whatever? Yeah, I just need to actually like I",
            "start": 1853.68
        },
        {
            "text": "figure that out eventually. It's hydrating. Also, uh, Blueprints just, uh, put out an update to fix the the glitch. Oh, did you get your saves back or whatever? Yeah, I just need to actually like I haven't started playing, but this weekend for my birthday, they did it. Chat, what do I got to do? Is this thing got like We all do. I have to kill the totems for this thing. How do I get in these little circles, chat? Yeah, let me flash on him. I I didn't play for the last three weeks because of the I had the PlayStation glitch, so I kept losing days, which was heartbreaker. But yeah, I am so excited. I'm so excited to get back in soon. The problem is like I've learned a lot of stuff just through like Tik Tok videos and my little brother coming up and bragging about how much he's getting done. I also got a lot of things done that I now have to redo. I was up to seven summ keys. You know what I'm saying? Oh [ __ ] And now I'm back down to five. So sigils. Yeah, sigils. I only had two sigils",
            "start": 1937.12
        },
        {
            "text": "I also got a lot of things done that I now have to redo. I was up to seven summ keys. You know what I'm saying? Oh [ __ ] And now I'm back down to five. So sigils. Yeah, sigils. I only had two sigils open, but I think I know how to do a third one. Oh [ __ ] It was just a heartbreaker that like I'm back to five keys and it's like one of them is like really RNG and I hope I get that run. The next run I get the same thing. Ah [ __ ] The audio sounds insane. Like it's supposed to sound insane or is it sounding bad for this game? Uh, yeah, just somebody two people in chat said something about the audio, so I'm just double [Music] checking. Oh god, that sucks. Lord Incredible says, \"I found the anti-chamber for the first time after 59 days and then the game glitched. I felt the pain.\" Yep. [Music] Peter pop off. I get what you're saying about blueprints blueprint game with less RNG, but the fact is that once you get into the the like deeper gameplay that like Hey, there you go. The game",
            "start": 1987.32
        },
        {
            "text": "Peter pop off. I get what you're saying about blueprints blueprint game with less RNG, but the fact is that once you get into the the like deeper gameplay that like Hey, there you go. The game works with you. It feels a little bit more forgiving. It's not so much RNG and more like strategy now. H, that was interesting. That fight didn't get triggered that first time. Cool. Leader. Uh, Gav Atris, uh, Kevin, are the sigil solutions pictures or do you need to read the text to solve them? So, I've gotten a couple pictures, but I think that I'm also at a place where I can start using Oh [ __ ] Oh my god. What is that? That's not a thing. No, that was a thing. Jeez, that's a thing. Yeah. Yeah. OMGX is totally right. The RNG isn't bad when you're chasing 20 different leads. That's so true. I could have swore it was blueprints. Like you had to figure out the blueprints for stuff. Mhm. Well, you you kind of I mean, yeah, that that's the the that's like the joke of the the name. Okay. Yeah.",
            "start": 2072.56
        },
        {
            "text": "could have swore it was blueprints. Like you had to figure out the blueprints for stuff. Mhm. Well, you you kind of I mean, yeah, that that's the the that's like the joke of the the name. Okay. Yeah. Well, that's the pun. Yes. Thank you, Eric De Cooper. That is what I was trying to say there. Oh, this is the acid water. Oh, it's acid water. Well, the yellow spot there, I think. Yeah, when they cough it up, it's acid and it goes away eventually. But man, this I got to I do have to drop the difficulty level down on this. This got really hard. No shame. Let's Oh, it's 100% shame. No, it's a hard game. Oh, that's all right. Yeah, we got to do that. This is it. That That was the last time. I'm like, \"All right, we got to go a little less with this.\" Why would they do that? There's difficulty levels. Uh where is the game play? Oh, you had set to ultraviolence. Is that Yeah, but I think that's the middle one. That's crazy. their naming scheme for this. Uh, where is it? Chat. Lucid Dreamer",
            "start": 2133.76
        },
        {
            "text": "levels. Uh where is the game play? Oh, you had set to ultraviolence. Is that Yeah, but I think that's the middle one. That's crazy. their naming scheme for this. Uh, where is it? Chat. Lucid Dreamer says, \"Nick, the melee attacks will drop armor if you weave it between shots.\" Yeah, it's not helping me though. It's not moving as fast as I was before. I'm just tired today. Let's see. No, that's not Where's game play difficulty? Ultraviolence. Oh. Oh, it did go up. I was on Hurt Me Plenty, I think, before. God damn it, Andy. Oh, interesting. That's weird. Wasn't there five difficulty levels last time I played this? Whatever. Nicholas 123 says, \"Maybe just turn down the damage for to player.\" Is that an option? That's crazy. It was on hard. Yeah. What's that? No. No. Just people reacting to It does look like maybe it was on a harder setting. Oh, it definitely was. It's fine. It's fine. And I'm just not I'm just not that good. Even now it's like it's not let me shield bash so much I used",
            "start": 2192.92
        },
        {
            "text": "It does look like maybe it was on a harder setting. Oh, it definitely was. It's fine. It's fine. And I'm just not I'm just not that good. Even now it's like it's not let me shield bash so much I used to. That's weird. Freaking Andy. Always good to prove he's better. Shrine detected. Oh, upgrades available. No, it's waiting. This is fun, though. This is like uh this kind of bigger open world area. I've been in for a hot second and it's kind of cool to just kind of see. Look how good that looks. Playing on Ultra Nightmare and there is zero freaking lag. It's so wild. Kevin, we need 5090s. Call Tim. Call Mr. Nvidia. We need Everyone needs a 5090. Yeah, I think most people in the world are feeling that right now. Oh, here's a big boss battle. Lucid Dream asks, \"Nick, how do you feel about the overall gun selection?\" I think it's great. That was really cool. This is my boomstick. It's video. Oh, this guy's the guy. Mhm. The guy with like all the golden shields around him. Yeah, I think so.",
            "start": 2276.48
        },
        {
            "text": "overall gun selection?\" I think it's great. That was really cool. This is my boomstick. It's video. Oh, this guy's the guy. Mhm. The guy with like all the golden shields around him. Yeah, I think so. I think you got a guy on your left, too. Yeah, I got guys everywhere. Yep. Do I have to kill this guy first? I got to kill that guy first, right? He's got There's a giant guy up top, too. Maybe that's the guy I got to kill. Chad, who I got to kill first, cuz I'm doing dick all damage to that guy. Don't go for the guy with the icon above their head until the purple bar wears out. Okay. [ __ ] Everyone else first. Yeah. It's so forgiving. It seems like you're lasting a little bit longer now. Oh, yeah. This is This is what how this is definitely the difficulty level I played on last time. God damn Andy. Uh, Ramirez at Art Jam asks Kevin and Nick, \"What are the games of the year so far for you?\" I would say based on listening to Kevin and and everyone in the office, Blueprints is definitely",
            "start": 2384.56
        },
        {
            "text": "Andy. Uh, Ramirez at Art Jam asks Kevin and Nick, \"What are the games of the year so far for you?\" I would say based on listening to Kevin and and everyone in the office, Blueprints is definitely going to be your game of the year. Hands down. Like, it's not even close. Yeah. And Blueprints has fully got me engaged in a in a way that games don't typically grab me. But what about you? Oh, wait. What do I do with this thing? Oh, shoot. Got to kick this thing, right? Well, they were saying you have to keep uh Oh, keep shield bashing him. No, no, no. They were saying the the blue the purple bar has to Oh [ __ ] has to be gone first. Oh my god, that guy's got giant wings. Oh god, that's not good. I got to get the [ __ ] away from that guy. Expedition 33 is looks like on a lot of people's lists as well for game of the year contender. Next game of the year is Cyberpunk and that's okay. Hey, you know what? It kind of is. Yeah. It's such a weird game to to get back into, but they've optimized",
            "start": 2500.0
        },
        {
            "text": "as well for game of the year contender. Next game of the year is Cyberpunk and that's okay. Hey, you know what? It kind of is. Yeah. It's such a weird game to to get back into, but they've optimized it so much more. [Applause] The biggest issue I'm having with Blueprints is like once I start playing it, it's so hard to stop. And it's like, man, you look at the clock and you're like, \"Okay, 11. I'll do one more run.\" And suddenly it's midnight. You're like, \"Ooh, but I now like I I think this next run will be really good.\" And then it's like, \"Oh, now it's 1:00 in the morning. I really [ __ ] up. I think you still have to take out a couple ads. That music's getting [ __ ] cool. It just gets better and better every single time I do I hear it. Got him. Shield disabled. Ah [ __ ] Get Bellatro is another game I'm scared to play cuz seems like so much my style. So, the cool thing about the shield bash, you can just kind of use it to be like to get across the whole map. But you got his",
            "start": 2587.6
        },
        {
            "text": "is another game I'm scared to play cuz seems like so much my style. So, the cool thing about the shield bash, you can just kind of use it to be like to get across the whole map. But you got his purple down. There he is. So, now you're actually hurting him. Oh. Oh, got his ass. Shove it into my heart. Oh my my Oh, good. Oh, my shield went up. That was cool. Little upgrade. Damn. A lot more slots you can upgrade. I'm slotted out. That was a good fight. I'm at my level, guys. I'm not like, you know, all state AAA or whatever it is, but I'm a solid B Doom player. I wish the developer was in chat now to see me do good. Hugo, come back. Hugo, get back here. Oh man. Oh [ __ ] gold. Sweet. Give me the one shield on blueprints. It's just a puzzle game, right? Yeah, it's a puzzle game. So, you've inherited a house from your uh uncle that's magical and lot of peoples. A lot of peoples in this house. Uh, no. What's the peepphole? If you had to guess like 1 to 10, how many peoples per per day? I",
            "start": 2704.92
        },
        {
            "text": "inherited a house from your uh uncle that's magical and lot of peoples. A lot of peoples in this house. Uh, no. What's the peepphole? If you had to guess like 1 to 10, how many peoples per per day? I mean, there's there's there's a security room that has cameras that you can That seems right. Yeah. Okay. Which is kind of like a peepphole. Okay. All right. Jesus [ __ ] Christ. Ah, you're on fire. Can't you? What is happening? Everything in this land is trying to kill me. The house is a big grid. It's uh 9x5. And so there's 45 rooms that you can like draw, right? Halatial. Yeah, a big old house. And then the goal is to get to the end and open up the 46th room. And they don't tell you how to do that, so you have to figure that out. Um, and it is just wildly satisfying and constantly engaging and like it's, you know, it starts out and like there's a room that has a note that's like, \"Oh, you might want to take notes.\" And you're just like, \"Haha, I don't need to take notes.\" But like, you",
            "start": 2862.88
        },
        {
            "text": "and like it's, you know, it starts out and like there's a room that has a note that's like, \"Oh, you might want to take notes.\" And you're just like, \"Haha, I don't need to take notes.\" But like, you know, you do a couple runs and you're like, \"I should be writing stuff down.\" And then you start writing it down now everyone has like papers full of notes and it's like when Greg journals. Uhhuh. And it but it's so satisfying and it's like it's great to like uh you know play alongside like your friends and stuff and just kind of ping them and be like oh you know you you like trying to like be vague but not give them updates but also kind of see where they are and like you like oh you uh you figure out how to turn on the four flames and they'll be like oh yeah I figured out the four flames like whoa you go down there you open up the thing it's like yeah open up the thing. H it's so much fun. H my boomstick. Ah, Jesus Christ. That's a big guy. But you've killed one of these guys. Oh yeah,",
            "start": 2910.8
        },
        {
            "text": "whoa you go down there you open up the thing it's like yeah open up the thing. H it's so much fun. H my boomstick. Ah, Jesus Christ. That's a big guy. But you've killed one of these guys. Oh yeah, I just killed one. But they're hard as [ __ ] God, they look so cool. The design of this game is so rad. Oh my god. Yeah, moments like that are so cool, too. You do the tunnel. I've I've done some of the tunnel. I've done some of the tunnel. I I just opened up the the the something that lets me do more with the tunnel, and I'm I'm still working on that, but none of that saved because I had that glitch. So, I'm waiting to go back in there and redo the thing now. I know how to solve that. You know what I mean? Yeah. Nick, if you have Game Pass, you can play BR. Blueprints. It's on Game Pass. That's right. I have a good buddy of mine that we do a lot of escape rooms together. I I put him on blueprints. He's got Game Pass and like he was fully addicted for a while. [ __ ] This guy's just eating",
            "start": 2952.0
        },
        {
            "text": "right. I have a good buddy of mine that we do a lot of escape rooms together. I I put him on blueprints. He's got Game Pass and like he was fully addicted for a while. [ __ ] This guy's just eating me up, man. I need a better gun. Hold on. Let's go to that one. Got his ass. Suck me into the hole. Oh god, Greg just sent me a video. Is he here today? Yes. They don't want you to know that Coca-Cola's delicious. Okay. All right. It's apparently a conspiracy theory. It's uh it's wild cuz you could have just come in and whispered that. No, I think it's better with that we keep that secret. I don't think we need to expose the audience to that. Oh. Ah, those are underwater flames. Oh, who would have thought? Yeah, it happens like volcanoes. People that go splunking is just insane. Yeah, I don't love that at all. Oh [ __ ] Nicely done. There you go. Coming. Coming. Coming. Oh, puzzle time. Oh. Oh, this is fun. Oh, there we go. Radio Shack, like you are totally right. Like having those",
            "start": 3032.6
        },
        {
            "text": "don't love that at all. Oh [ __ ] Nicely done. There you go. Coming. Coming. Coming. Oh, puzzle time. Oh. Oh, this is fun. Oh, there we go. Radio Shack, like you are totally right. Like having those conversations and not trying to spoil things is like a a fun conversation to have where you're just like hinting at stuff and be like, \"Well, if I say this, does this make any sense?\" No. Okay, don't worry about it. Don't worry about it. What's up, game you? Welcome to the chat. You can try blueprints. Maybe I will. Maybe I will. Kevin very seldom gets into games, but when you do get into game, they tend to be really good. Yeah, this is one that like it the first time me and uh Mike played it was on stream and it was like we did I think something like five days, so like five loops and it was like by day five we were like this game [ __ ] sucks and then we're like we played like two more loops and we were like wait a minute wait no no it's actually incredible. We were hyped. I would love to",
            "start": 3130.8
        },
        {
            "text": "by day five we were like this game [ __ ] sucks and then we're like we played like two more loops and we were like wait a minute wait no no it's actually incredible. We were hyped. I would love to see you try. Yeah, I tried. Get the transports ready to launch. We're beginning to evacuate civilians now. Thank you, Slayer. As a best friends from South Dakota, what four Doom games make it to your top Mount Rushmore of Doom? Are there more than four Doom games? I mean, there's the original Doom that I played in the lab at at in high school. How many floppies did they give you for that? It was like 16. There was so many floppies. It was like It was like this big. I actually got it in junior high. My band director uh gave it to me. He was like, \"Don't share this with anyone.\" Then he gave it to everyone. I was like, \"This is the coolest game I've ever seen in my entire life.\" I was obsessed with it. Obsessed with Doom. Uh then you got Quake. You know, you got to put Quake up there, right?",
            "start": 3235.84
        },
        {
            "text": "everyone. I was like, \"This is the coolest game I've ever seen in my entire life.\" I was obsessed with it. Obsessed with Doom. Uh then you got Quake. You know, you got to put Quake up there, right? Kind of the Doom successor. Eternal is amazing. I didn't like the first Doom that came out for this current or like the last console uh cycle. It was a little too straightforward, but Eternal really got me back into it. And this, I think, is a really fun balance. Eternal was a lot more movement based and you had to like chain stuff together and it was fun, but this is it. Oh my [Music] melee my minions. Wow. OMGX. Quake was basically the Doom. The first like it was just like a 3D Doom, right? Or you could actually move X and Y. I'm not crazy. It is Doom. You mean Z, right? I mean Z. No, Z. You could always move in Zpace with Doom. And you could always move in X. Yeah, but you could never look up and down in Doom for the first couple games. And I think Quake was the first one to add that.",
            "start": 3311.28
        },
        {
            "text": "could always move in Zpace with Doom. And you could always move in X. Yeah, but you could never look up and down in Doom for the first couple games. And I think Quake was the first one to add that. Quake was an arena shooter. Okay. So Quake was the Quake was like what 5v5? I remember we used to do land parties with it, but I couldn't remember if it had a single player game or not. When you did land parties, do people bring over their PCs? Yeah, you had your you had to you had to tell your mom. Yeah. Listen, I need to borrow the PC for the weekend basically. And I remember saving up like $300 or $500 for a a Voodoo Graphics 3D card so that I could play Quake and actually have it be like some level of like look good and not play at a dog water snail pace. And then yeah, we we did land parties. We'd drive over to each other's houses with our Dells and it was lit. And then there'd be that one smart guy like you who'd be like, \"Just let me plug the Ethernet cable.\" And I was like, \"Cool.",
            "start": 3372.24
        },
        {
            "text": "We'd drive over to each other's houses with our Dells and it was lit. And then there'd be that one smart guy like you who'd be like, \"Just let me plug the Ethernet cable.\" And I was like, \"Cool. What's that? Unreal Tournament I played a little bit of. Quake I played more of. Okay. Unreal Tournament was a campaign based. What was the last? Yeah, Wolfenstein was in the Doom family. So, of course, you got to put that. Wolfenstein 3D was a game. Actually, I take it back. I'm thinking Wolfenstein 3D on the floppy discs. Quake I think was only like three or four discs maybe, but Wolfenstein 3D was like it took forever to install that freaking game. That game [ __ ] rocked. Whoa. Fun fact, Rocket League started out based on a UT mod. Unreal Tournament mod. Really? Yeah. That's cool. Good old floppies. Yeah, the big floppies were so big, too. They were big, but they were fun to play with. I liked opening the little metal slide part and just looking at it like giving a little spin and being",
            "start": 3420.48
        },
        {
            "text": "Yeah, the big floppies were so big, too. They were big, but they were fun to play with. I liked opening the little metal slide part and just looking at it like giving a little spin and being like, whoa, turret time. Do they overheat? Oh, that was cool. Oh, they're flaming heads. Really not stopping them. No, more decorative than anything. This is people's one criticism with the game is that the game play is kind of broken up into stuff like this. Uh-huh. It's f I don't mind it, but the flying sequences I actually like the flying sequences better than the mech sequence. I just feel like I'm pissing on this guy. Yeah, he's not He doesn't care. Uh-oh. Hit him. I see. I would I would have hoped that would would have done more. Oh, okay. Oh [ __ ] That was just me dying. What were we supposed to do? get out of the thing at that point. I assume so. Maybe. I don't think it's really going to I think I have to shoot his armor. Maybe that was a little wild. That felt unbalanced. A little bit of",
            "start": 3482.68
        },
        {
            "text": "do? get out of the thing at that point. I assume so. Maybe. I don't think it's really going to I think I have to shoot his armor. Maybe that was a little wild. That felt unbalanced. A little bit of a departure. Those 5.5 in floppies. Yeah, big boys. Wish it was three and a half and five and 5.5, I believe. So, yeah. Maybe I have to get out and get health. It's crazy that people don't know that the s the save icon is a floppy for a lot of Why would they? It hasn't been around 40 years. Well, yeah, but like history, you know. There you are. You're popping them this time. Were you missing before? I must have been. Didn't feel like it. Oh. Uh, we got a bolt. Okay. So, he lit up that time when you bolted. Oh, he's lit up. So, now I can hit him. Oh, there you go. Yeah. Now I got Now I got to like skin on skin contact now. or bullet on skin contact. There it is. Jim the wiener. Oh, his legs like coming off. There it is. Yeah, you can kind of take the meat off of his leg. Let me know if you",
            "start": 3571.6
        },
        {
            "text": "skin on skin contact now. or bullet on skin contact. There it is. Jim the wiener. Oh, his legs like coming off. There it is. Yeah, you can kind of take the meat off of his leg. Let me know if you want me to run an ad. You can use a go to bathroom break or something. We almost have everyone else. Sure. Let's do that now. Actually, this is a good spot for that chat. We'll be right back after a word from these. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and I'm loving how each one feels. Their Sleepy Time",
            "start": 3648.8
        },
        {
            "text": "you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and I'm loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industryleading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com promo code kind of funny for 20% off. Chad, he's not back yet, but he'll be back momentarily. But when he's gone, I still do the countdown just in case he can hear me. But, you know, I never know. Also, uh there's a delay. So, that's why we got the from these if they if I",
            "start": 3712.4
        },
        {
            "text": "be back momentarily. But when he's gone, I still do the countdown just in case he can hear me. But, you know, I never know. Also, uh there's a delay. So, that's why we got the from these if they if I wait the appropriate amount of time to hit the button, they freak out and they're like, \"Are you going to hit the button?\" It's like, \"I just hit it.\" I'm like, \"Oh, okay. [Music] the Trinitron. That's Sony, right? Good stuff. I think I had a 32 in. It was great. Eventually, it was like downgraded to like our garage TV. I remember uh we got uh Grand Theft Auto and like it was one of those things my dad bought it on a random like Tuesday or something and I wasn't allowed to play video games till uh the weekend. So I was just quietly standing in the garage by myself being like this is a game's incredible. Um Lord incredible. Yeah, the tortoise is doing good. He's moved up with my mother-in-law who lives in Soma and he is thriving. He's gained like 10 lbs. So he's like at 60 lbs. Big boy",
            "start": 3762.24
        },
        {
            "text": "incredible. Um Lord incredible. Yeah, the tortoise is doing good. He's moved up with my mother-in-law who lives in Soma and he is thriving. He's gained like 10 lbs. So he's like at 60 lbs. Big boy Boris. Love him. Hanging out with a bunch of goats. Four goats he hangs out with. But yeah, it seems like the the heat there is is treating him well. But yeah, I loved watching that tortoise just sit and eat grass. Boris the tortoise. That's correct. Sounds like five goats. Yeah. Goats not a great pet, but you know, I want one. No, you don't. You don't think so? No. They like they get like annoyed and they start trying to push you and then you're like, \"All right, I have to dominate this.\" Yeah. You got to dominate the goat. And then it's just like gh. But you know what? You're being an animal up, but whatever. That's what they're used to in their kingdom. I'll tell you what's great is clipping their nails. Oh, you got to clip the goat nails. Yeah. Clean them up. Oh, look at the flames on",
            "start": 3830.76
        },
        {
            "text": "up, but whatever. That's what they're used to in their kingdom. I'll tell you what's great is clipping their nails. Oh, you got to clip the goat nails. Yeah. Clean them up. Oh, look at the flames on this guy. And ah, it's so much fun, Nick. It's I don't know if you've ever watched the Facebook or Instagram videos where people are cleaning up like a cow's hoof, but it's just as good as the internet videos. I have never watched that, but I love You've never watched that? It's like Oh, the horse. The horse thing I have? Yeah, the horse I've seen. Yeah. So satisfying. and like doing it in real life is it's it's so easy cuz you look and you're like, \"Wow, it's a professional doing this, but I think I can do it.\" And then you do it and you're like, \"Oh, it's not that hard.\" I just like when you have to put the the leg between like grab the leg and they're like, \"Well, I can't do anything now.\" The horse can't figure out how to get the leg out. They're like, \"I'm just subservient now to",
            "start": 3888.48
        },
        {
            "text": "you have to put the the leg between like grab the leg and they're like, \"Well, I can't do anything now.\" The horse can't figure out how to get the leg out. They're like, \"I'm just subservient now to you.\" Life sigil. So now I got a little life sigil, which means if I die, it'll bring me back. I don't have to restart. Sick. Yeah, it's like extra life. Little restart. Although I don't plan on dying ever again. No. Look at this. Look how good that looks. Mhm. Look at that. A lot of smoke. But just like those like you you catch moments in games where you're like, wait, it almost looks real. That's wild. God, I did a 5090. Trade out Andy's 5090 with my 3090 and see if he notices. I don't think he will definitely notice immediately. I definitely need to go the other way. Okay. God, look at that. God bless you, Nvidia. You deserve to be a trillion dollar company. Mhm. What have I ever done? You know, what have I ever done with my time? Okay. Well, I guess I'm not going that way. I go up. Do",
            "start": 3932.56
        },
        {
            "text": "God bless you, Nvidia. You deserve to be a trillion dollar company. Mhm. What have I ever done? You know, what have I ever done with my time? Okay. Well, I guess I'm not going that way. I go up. Do I need to go up? God. Do you remember how heavy CRTs were? Yeah. I remember Brennan, my buddy Brennan had a big ass CRT that he was like, I have to keep this CRT, man, because this CRTs got the best response for when I played the Smash Brother or whatever. We carried that up two flights of stairs, and it was the worst my back's ever felt in my entire life. Yeah, I remember when Tim was moving out of his uh childhood home, we were getting out this giant CRT out and it was just like the heaviest thing and I was like, I have this. Move aside. You're insane. Yeah. Bam. They're coming. Check this out. Do you like Oh, I can't do here. I got to show you my alt skin for this character. It's you like better. Don't go alone. Father, I didn't know there was different skins. Yeah, I have the silver one",
            "start": 3999.88
        },
        {
            "text": "Do you like Oh, I can't do here. I got to show you my alt skin for this character. It's you like better. Don't go alone. Father, I didn't know there was different skins. Yeah, I have the silver one right now. I think it's the one you get when uh you're awesome. Yeah, be my guess. I can't remember, but I'm pretty sure that's the one. Carried a CRT to land parties repeatedly. That's [ __ ] bonkers, dude. What's the conversion on that? Like how do you get old computer to Were you using that uh S video cable? Let me know. Currently working. Okay. So, I got to go over there. There. There. Got it. Every once in a while I'll find the VGA cable like in my house and I'll be like whoa so happy we're off this standard. The VGA. Yeah. You know the like [ __ ] prongs screw them in. Suck on the sides. Having said that, I do wish that HDMI had felt more secure cuz I always feel like you're going to just be able to rip that thing out and you don't really, but like when you're when you're in a",
            "start": 4065.84
        },
        {
            "text": "sides. Having said that, I do wish that HDMI had felt more secure cuz I always feel like you're going to just be able to rip that thing out and you don't really, but like when you're when you're in a professional situation like me and Kevin are where you use like SDI cables that and can't pull out, you want that for every part of your life. Well, that's then you have display port cables, right? And those a lot of times come with little like little hooks. And it's like sometimes people don't know that it's got the little hooks. And I I'll see people try to pull it off and be like, \"Whoa, whoa, whoa, slow down. Press the top.\" Oh, I didn't even know that. Yeah. And that that's a higher refresh rate than HDMI cable. A lot of times, unless you have a really fancy HDMI cable, but then you need to have an HDMI port that can support that. It's all tricky. But yeah, display ports are pretty cool. Here's my thing with display port cables. Mhm. They always they always screw me. How? Cuz I think",
            "start": 4125.92
        },
        {
            "text": "to have an HDMI port that can support that. It's all tricky. But yeah, display ports are pretty cool. Here's my thing with display port cables. Mhm. They always they always screw me. How? Cuz I think it's an HDMI cable and I go, I have one. But like, don't you learn quick enough that like, oh, it's not it's it's got an angle on one side, not eventually. But then think, how pretentious are you? Why don't you just be an HDMI cable? Yeah, sure. Like, why do you got to be all front and Oh yeah, old Apple chargers with the little clips on there, too. God, remember they had the 19 pin for so long, dude. Enormous. Remember, no matter which which way you tried to plug it in first, it was always the wrong way. Always. And then they came out with the lightning cable, which was the first cable that like it up, down, doesn't matter. Just shove it in, it'll fit. So smart. And then USBC, everyone was like, \"Thank you for thinking.\" And now that's the new standard. And then Apple fought it. And",
            "start": 4170.64
        },
        {
            "text": "like it up, down, doesn't matter. Just shove it in, it'll fit. So smart. And then USBC, everyone was like, \"Thank you for thinking.\" And now that's the new standard. And then Apple fought it. And everyone was like, \"Nope. Thanks to the EU, we're done with Lightning Cables.\" Well, you know, they wanted you to buy the lightning cable from them. Yeah, of course. That's how they made all their money. Mhm. I got to start using the flail. I got to flail it out. Bro, USB sucks. Why does it suck? How dare you? How dare you? Who said that? You're banned. We're a USB household here. As a technician, that short breaks all the times. That short breaks all the time. That is very true. That is the number one complaint I hear with like cameras and stuff that are powered by USBC is it just that port just I think he meant that port the port just shorts out. Oh, that do nothing. Oh, that little chip in the middle. Oh. Who do you think you are? I am. Nope. Just put that guy in his [ __ ] I got these",
            "start": 4233.6
        },
        {
            "text": "I think he meant that port the port just shorts out. Oh, that do nothing. Oh, that little chip in the middle. Oh. Who do you think you are? I am. Nope. Just put that guy in his [ __ ] I got these invisible guys trying to sneak up on me. Oh, where you landing? Right in the middle of the Devil's Deuce. God, it's so fun. This game's hypnotic. It's so beautifully at this incredibly perfect um difficulty level. Mhm. It's so well paced. in the chat. Saw Woo says, \"Kev, is it possible to go display port to HDMI if I want to run my PC on a Sony OLED?\" OLED. Uh yeah. Yeah, it is. Um there's a cable for it. They're obviously birectional. They port to HDMI. Oh, yeah. Yeah. Uh we actually uh in the control room most of the computers because every graphics card is one HDMI three display ports. We have to get that little converter cable and it works great. We're not gaming on them so I I can't tell you if if you get the highest refresh rates but um I I believe it is possible to get decent refresh",
            "start": 4296.96
        },
        {
            "text": "to get that little converter cable and it works great. We're not gaming on them so I I can't tell you if if you get the highest refresh rates but um I I believe it is possible to get decent refresh rates with [Applause] that. How's your week been? Uh long. I was celebrating my birthday and I'm lucky enough that many of my friends wanted to hang out, but not on the same date. So, I've just been non-stop hanging out with people and it's it's been fun, but I'm tired. I miss my son. That's what I do with my PC. Sony [Music] ability. Yeah, we there's always issues that arise though with that where it's like the just the screen tearing we've been having with this what is this Samsung we bought where just we can't get it to stop tearing on the TV. Okay, I'm going to assume I got to kill this guy first. I've had a hard time running my Mac Mini on a 1440 on a HDMI. Um, that's interesting. Uh, Greg has a Mac PC and like finding the correct dongle that would support the USB type-C to display",
            "start": 4417.6
        },
        {
            "text": "guy first. I've had a hard time running my Mac Mini on a 1440 on a HDMI. Um, that's interesting. Uh, Greg has a Mac PC and like finding the correct dongle that would support the USB type-C to display port was a bit of a challenge, but it exists. We have since solved that issue. I can't remember what it has to say on there, but there's some special feature that it has to have and then it works smoothly. So, I don't know if that's the issue you're having there or are you just converting uh display port to HDMI, but uh you just got to write find the right cable. Oh, yeah. 120 frames. That's going to that's definitely going to cause issues. You have to get a higherend cable. But the reality is like finding high-end cables for affordable prices is so much more doable than it was when we were kids. Oh man. tech support and gameplay. Got to love it. Yeah, it's fun stuff. Always nice to hang out and chat for a bit while Nick smashes some demons. Slayer, I want to get into you. Up and over.",
            "start": 4482.32
        },
        {
            "text": "kids. Oh man. tech support and gameplay. Got to love it. Yeah, it's fun stuff. Always nice to hang out and chat for a bit while Nick smashes some demons. Slayer, I want to get into you. Up and over. Got it. Copy that. Yeah, fool's gold doesn't like the forced dongle life of Apple. Man, that's so annoying. Thank god they've been forced by the governments that be to stop that standardize it. Yeah. Well, I mean, they haven't stopped it, right? A bunch of the Mac Pros are just like, \"Oh, you get two USB type-C's.\" And it's like, \"Yep, get a dongle.\" But fortunately, there are affordable dongles that do everything you need. Wow. Also, technically some GPUs have two HDMI ports, Kev, and three display ports. Is that right? I don't know how many two HDMI. Well, like you can't output more than four signals at the same time from most uh GPUs. Four signals, I mean. Yeah, the pandemic [ __ ] the prices for a lot of things. Yeah, fool's gold. USB cameras were impossible to find at the time, but",
            "start": 4539.36
        },
        {
            "text": "signals at the same time from most uh GPUs. Four signals, I mean. Yeah, the pandemic [ __ ] the prices for a lot of things. Yeah, fool's gold. USB cameras were impossible to find at the time, but like fortunately for us, we were one step ahead when we were switching over to the a6400s coming in with the with the Elgato face cam. Not a cheap solution, but a good looking solution that worked. Now we have turrets to mess up all the prices here. Yeah. What a time. What a time. Fun. Thankfully, we we're future proofed. When the apocalypse comes, we'll just we're all set to keep streaming. Yeah, we'll just keep streaming for you guys today or what? Oh, it's just that like J1 visas got have like been stopped. Oh, great. Yeah. So, they're not that like they're stopping like student visas and uh uh temporary workers. So, it's like that's See how long this pause last. That's not good. Jeff, I hear what you're saying, but I think I think you are maxed out with most GPUs as with four inputs or",
            "start": 4639.6
        },
        {
            "text": "uh temporary workers. So, it's like that's See how long this pause last. That's not good. Jeff, I hear what you're saying, but I think I think you are maxed out with most GPUs as with four inputs or four outputs at a time, even if it has that fifth slot. Ah, I can't do that. Thanks, Vic. Oh, I have a Let me open another station. I love all the pieces of them that Yeah, they just get dismembered. Okay. So, I can't get over there that way. I got to go all the way over that way. Get it. Does this also have multi- poo poo? What does that mean? Mia poooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo. Multiplayer this game. Yeah. Does it? I don't think so. Yeah. Not yet at least. I don't know if it's going to or not. [Music] by maybe. Not going to lie, I was hoping for Mike and Blessing play rematch. Playing rematch. What? Why would you say that to us? Having a great time. We're all having fun. Yeah, I think they're all gone, too. They're all on different",
            "start": 4715.08
        },
        {
            "text": "for Mike and Blessing play rematch. Playing rematch. What? Why would you say that to us? Having a great time. We're all having fun. Yeah, I think they're all gone, too. They're all on different trips going knows where with God knows whom. Mhm. I'm not trying to blow up their spot right now, but they might never come back. Why not go up? Why not go down? I got up. Oh [ __ ] Uhoh. You're locked in. They're locked in with you. I love the multi- poooooooooooooooooooooooooooooooooooooooooo on other multi poooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo. Love multi-poo. Uh Sawu from Twitch asks, \"Nick, think we'll ever get another Glorious Sin 2 Nerdle stream?\" Oh, maybe. You and Kevin having No, no, no, no, no, no, no. I didn't read that last part till I read out loud. Having what? Like having us started. Having us play it. Me and you? Yeah. No good. No, I'm I'm good at random obscure ones, but like there's but there's too many like ones that I should",
            "start": 4848.96
        },
        {
            "text": "out loud. Having what? Like having us started. Having us play it. Me and you? Yeah. No good. No, I'm I'm good at random obscure ones, but like there's but there's too many like ones that I should know the answer cuz I'm not good with faces, but every once in a while I'll see a face and remember a random movie. There you go. Ian Anderson. Not going to lie, I was hoping for Nick and Kev playing Doom. Right. Nick's Nick needs Joey and Raj. What was really fun is to discover that Joey and Raj really need Nick. Yeah, that's the sad part for them. That's the worst part for them. Doom. The Nick age. Definitely missed a Ruby back in that big open world area. That's a bummer. Where's the football? A soccer game. And the control the controls are insane where it's like as you're running to the ball, you have one set of controls. When you have the ball, it's a different set of controls. Then if you want to like pass, you have to like switch them too. And it's like whoa whoa. That sounds crazy.",
            "start": 4913.2
        },
        {
            "text": "you have one set of controls. When you have the ball, it's a different set of controls. Then if you want to like pass, you have to like switch them too. And it's like whoa whoa. That sounds crazy. That's a game for real gamers in a way that I just I don't think I got it. I don't think I got it like that for me either, dude. My stream died. Oh, never mind. Rematch [ __ ] hard. Yeah, rematch looks fun. Look, I like watching rematch and cutting rematch is fun, but like I I honest to god don't think I'll ever be able to play that game. Captain Mark says he's addicted to [Music] rematch. Did you two cut out? Broadcast complete. Isn't tweaking on this? Maybe. No, everything's fine. We're good. Never mind. Didn't mean to scare you. Twitch still going. I think YouTube's saying some weird stuff. No, we're still on YouTube. I'm using streamerbot to look at both chats combined and sometimes it says weird things. Confuses me, but we're all good. The final transports are ready to launch. Is that",
            "start": 4979.52
        },
        {
            "text": "No, we're still on YouTube. I'm using streamerbot to look at both chats combined and sometimes it says weird things. Confuses me, but we're all good. The final transports are ready to launch. Is that just how soccer game works? The naughty biscotti. I I don't know. I've never played a soccer game. I can go play soccer in real life. You know what I mean? For all of 15 seconds. Oh. Oh, I really like when you knock out all the shield guys. Yeah, Naughty Biscotti, I I really enjoy the encouragement, but I'll tell you right now, I am not a good video gamer, you know. Structural damage detected. Just always had problems not knowing all the buttons. And there's a lot of buttons in that game. To get to an upgrade point, dude, I got a lot of gold. Uh, Nick Sawu asks, \"So, given how this Doom plays to Eternal, which do you say you like better?\" I I I don't remember Eternal that well. um truth be told, but I remember really getting into that game and really enjoying the heck out of it. So,",
            "start": 5055.88
        },
        {
            "text": "plays to Eternal, which do you say you like better?\" I I I don't remember Eternal that well. um truth be told, but I remember really getting into that game and really enjoying the heck out of it. So, probably that one over this by just a just a hair cuz I remember thinking like I got to finish this game. Man, I'm really bummed at myself for not getting that Ruby out there. I'm never going to forgive myself. Yeah, Spoon McKay. I like I know you're saying it's not as hard as it seems, but like the tutorial which is cool and it looks like it gives you a lot of instructions. It watching them do the tutorial I was like this is too much. You just got to play it not on stream. That's like my number one thing whenever I want to actually enjoy a game and get good at it. You just don't play it on stream. Look at this. Eat it. Oh, they're dead. You didn't even look around. N there's no fall damage. I don't care how pretty this looks. This guy doesn't understand it, man. I think you can get into",
            "start": 5147.76
        },
        {
            "text": "Look at this. Eat it. Oh, they're dead. You didn't even look around. N there's no fall damage. I don't care how pretty this looks. This guy doesn't understand it, man. I think you can get into Slay the Spire. I'm going to Google it. I'm googling Slay the [Music] Spire. Oh, it's a card game. Ah, I don't know about that. I don't know about that. My little brother's always trying to get me to watch Magic or play Magic with him and it's I don't know about that. Monster Train 2 just came out. Yeah, that game looked fun. It was cool to watch when we did our um the old presentation. It was one of those games that like I kind of didn't want the demo to end. [Music] You just hanging there. He ain't happy. No, I don't think he's thinking much. No, I think he's Whoa. Oh, there's a lot of boys there. Oh, challenge complete. You got a new skin. Nice. Yeah, man. These are the moments this game is built [Music] for. More addicting than the lava. I've known a lot of people that are lost to Elatro.",
            "start": 5201.44
        },
        {
            "text": "Oh, challenge complete. You got a new skin. Nice. Yeah, man. These are the moments this game is built [Music] for. More addicting than the lava. I've known a lot of people that are lost to Elatro. Uh, have you watched anything good lately? Anything the movie bro himself recommends? I mean, obviously the latest uh Mission Impossible I thought was fantastic. I didn't have as much uh like I wasn't so down on the first 40 minutes like everyone was at the studio. I I think I enjoyed the But it also had been a really long time since I'd seen um the first one and I was so enthralled by everything. So I I thought that was really good. Other movies have I seen recently? I don't know. I've got some movies coming up that I'm excited about though. Yeah, Mickey 17 was a lot of fun. Oh, that's on Netflix now, right? Yeah. Or HBO Max. Yeah. Um I also watched what was uh movie that came out with our friend who doesn't Novacane. Yeah. How was that? I liked it. I thought it was really fun. It was a a a",
            "start": 5303.24
        },
        {
            "text": "now, right? Yeah. Or HBO Max. Yeah. Um I also watched what was uh movie that came out with our friend who doesn't Novacane. Yeah. How was that? I liked it. I thought it was really fun. It was a a a real fun like they double down on this genre of like this is an action movie and like I think that they they do such a good job. What the hell? I thought I had a [ __ ] sigil thing. Oh, maybe they they killed me twice. Oh, whatever. That sucks. I thought I had an extra life. Sorry. Continue. No, no, no. I mean, that was it. It was just good movie. I have to watch Companion still, you know. I got to say, I watched Companion recently and I want to say maybe a third in the movie opens up to like what's going on and it's just like uh the the like the story didn't get me and then it's just kind of I it didn't do it for me. Okay. Good great acting in it. Uh everyone in it is phenomenal, but I just I felt like the story is something we've seen before and kind of lacking anything too crazy. That's",
            "start": 5394.08
        },
        {
            "text": "it didn't do it for me. Okay. Good great acting in it. Uh everyone in it is phenomenal, but I just I felt like the story is something we've seen before and kind of lacking anything too crazy. That's where Novacane was like, \"Oh, the story's just like they're going to double down on the premise really hard and it's like they're so in and I'm I'm behind them on this.\" How about that new Jurassic Park movie? I haven't seen Jurass the last like two or three Jurassic Park movies. I'm over that franchise. It's just upsetting how good the first one is. I also like the sequels fine and the two and three. After that, I did not I'm not a worldy. I'm an anti-worldy. Haven't watched Mission Impossible or not an Mission Impossible guy? I you confused on this question or statement? I love Mission Impossible movies. Highly recommend them. Uh, Sawu, it was more on my own and more on my own. Just you make connections sometimes and they they're great. Uh, Stage Geek asks, \"Nick, if you were to have a",
            "start": 5457.52
        },
        {
            "text": "movies. Highly recommend them. Uh, Sawu, it was more on my own and more on my own. Just you make connections sometimes and they they're great. Uh, Stage Geek asks, \"Nick, if you were to have a podcast dedicated to a specific genre of movie, what would it be in?\" John Carpenter films. Just John Carpenter. Just John Carpenter. Interesting. Not a not a long podcast. He made a lot of bad movies. Yeah. Oh, yeah. Made a lot of good ones. Tawu, Twitch hasn't added the feature to let you add the prime subs through mobile because they want to not have you do that cuz that's free money that you're giving us and we support that. But they don't look at John Carpenters's disography of film filmography. Yeah, that's what I meant. Oh, Escape from New York. Oh, yeah. There's a lot of movies on here I haven't seen. You like the Vampires movie? Oh, yeah. I love it. This guy's eating my lunch. When will he go down? My favorite guilty pleasure John Carpenter movie is Vampires and then Ghost of Mars. Oh,",
            "start": 5521.4
        },
        {
            "text": "seen. You like the Vampires movie? Oh, yeah. I love it. This guy's eating my lunch. When will he go down? My favorite guilty pleasure John Carpenter movie is Vampires and then Ghost of Mars. Oh, Ghost of Mars. There's an awful movie, but one that I enjoyed watching when it came out. There was Ghost of Mars, which is the one with is Ice Cube in that? Looking it up. Oh yes, there was ice cube and toss a henri I want to say. Sure. Jeez. I was like, is this guy bugged? Why is this taking so much? Oh, you got him. Man, I do not remember anything about Ghost of Mars other than Ice Cube. Give it to me. Give me my more health. Squeeze it real hard. There it is. Maximum health increased. Nice. That was [ __ ] nasty, man. That was just fun. King Novik's position. Oh, let me flash on him. Says, I might have heard you wrong, but you can use your prime sub with Twitch app. Is that right? Uh, yeah, let's go with that. Okay, I'm going to I'm going to open up the Twitch app and give us the prime sub",
            "start": 5619.44
        },
        {
            "text": "have heard you wrong, but you can use your prime sub with Twitch app. Is that right? Uh, yeah, let's go with that. Okay, I'm going to I'm going to open up the Twitch app and give us the prime sub cuz that's the big reason why I I forget often. Twitch. We're streaming. Lower the volume here. Oh, I got some shield upgrades. Okay, let's do this. Yes, Chad Cho says you can't. I think unless they changed it. Just did. Oh, I guess you can. I'm really using this gun a lot. Yeah, the price keeps going up, huh? Oh, use Twitch Prime. Yeah, you can. Or at least on Android. Oh, look at that. That's pretty handy. Oh, that's awesome. Yeah, look at that. Confident and Kevin just subscribed. Whoa. Oh, that's sick. Nice. It might be an Android thing. Uh, anyone that has an Apple device on their Twitch app, go ahead and give us a sub. Let us know if you used money or the Twitch Prime. See what I did there, Nick? Mhm. Ah, get all these already. I'm not seeing on Apple. That sucks. Blade master acquired.",
            "start": 5758.8
        },
        {
            "text": "go ahead and give us a sub. Let us know if you used money or the Twitch Prime. See what I did there, Nick? Mhm. Ah, get all these already. I'm not seeing on Apple. That sucks. Blade master acquired. That's so sick for me. Did I already get these? I guess that's it. I must have these already. Yeah, I don't know. Everything says locked. So, right now it's all This is all locked now. Now I can start adding [ __ ] to this. Okay, but that's not okay. So, I got to go to the next thing here, which is flail strike deals extra damage. Okay. Or what can I get for my cool guns here? Cuz I'm really digging this gun. No, I'm not digging that gun. Digging this gun. Oh, if you sub via Apple devices, it's $2 more. It looks like if you sub via Android as well, it's it's $8. That's what I'm seeing. So, that makes more sense. Is there a Steam code for you guys if I want to buy? I mean, I imagine it'd be kind of funny, but I honestly don't know. I'm sorry. Interestingly enough, chat might know more about",
            "start": 5849.28
        },
        {
            "text": "makes more sense. Is there a Steam code for you guys if I want to buy? I mean, I imagine it'd be kind of funny, but I honestly don't know. I'm sorry. Interestingly enough, chat might know more about that than me, right, Shane Raven? Uh oh. We just have an epic creator code. That's We definitely have an epic creator code, but just type in kind of funny. see what happens. Pulse Theory 7 just subscribed for 13 months. Thank you, Pulse Theory. Keep the stream going a little longer. That's not true, but you know, free rubies. Jeez Louise. Let Nick concentrate on this. Getting his stuff. Now you're good. I'm all I'm all good to go. I just upgraded it. All the rage just did it on his phone on his Android device. Yeah, he did. Resubscribe for 36 months. Thank you. All the rage. Zero cool TV. I love that name. That will always be a good name. Mhm. I was zero. Cool. I have a thing still. Oh, you know what? I started watching, Nick, that someone was asking me earlier what I'm watching. The",
            "start": 5910.4
        },
        {
            "text": "I love that name. That will always be a good name. Mhm. I was zero. Cool. I have a thing still. Oh, you know what? I started watching, Nick, that someone was asking me earlier what I'm watching. The studio. Oh, yeah. Hey, you guys are all into it. Yeah, I watched like three episodes that I'm a little behind. Um, but I enjoy it. I think I I think I might actually be at three episodes, too. I just I think the last one I watched the one I'm at the one I think the last one I watched was the Ron Howard episode. Oh, yeah. I'm I'm at that place, too. Yeah. And it was hilarious. The ending of it so good. It's so good. Anthony Mackey did great in I got a good laugh out loud when he was like, I love I love the ending. It's so good. He goes, \"What the [ __ ] is wrong with you guys?\" Feels good. It feels good. They're like, \"We thought you love.\" He's like, \"No, I was just saying that.\" Yeah. Oh, and in the meeting, too. Oh my god. Yeah. The It is really frustrating cuz it's like, yeah, that's",
            "start": 5980.88
        },
        {
            "text": "feels good. They're like, \"We thought you love.\" He's like, \"No, I was just saying that.\" Yeah. Oh, and in the meeting, too. Oh my god. Yeah. The It is really frustrating cuz it's like, yeah, that's how things get done, you know? No one's got the balls to say, \"Hey, that's how bad movies get made.\" Uh-huh. Slayer or good movies get ruined. This is the silver outfit. Yeah, it's my silver outfit. It's usually green, but I like silver. Oh, yeah. You look fancy. I want Andy to cosplay as this guy, not that guy. The other guy. Yeah, the devil. I assume it's the devil. I don't know. Yeah. Oh, fool's gold. You don't have to limit yourself with just the phone, you know? You can open up a computer and you can do it for us and make us feel so special. Oh no, I'm slaying. Have you watched your friends and neighbors? That's the show I will not shut up about. It's so Yes, it's John Ham's new show. It's so freaking fun or good. What is it about? Dark. Uh John Ham plays a uh stock broker basically",
            "start": 6029.6
        },
        {
            "text": "and neighbors? That's the show I will not shut up about. It's so Yes, it's John Ham's new show. It's so freaking fun or good. What is it about? Dark. Uh John Ham plays a uh stock broker basically like a hedge fund manager, gets fired uh and is uh kind of destitute, so he decides to start robbing his rich neighbors. Oh, I think I've seen an ad for this. Yeah. He's like he lives in like this bougie ass like 1% place in upstate New York like the Hamptons. Oh, god damn it. Fool's Gold said next month. I used it in May to support Andy. Chapter complete 92. All right. Well, at least it's going somewhere good, I guess. I uh looking forward to Did you ever watch Mayor of East Town? Did anyone ever watch that show? That movie is great. There's a new uh show coming out by that creator with Mark Ruffalo, and it's like a It's like a cop detective show. It looks so [ __ ] good. Why won't they just let him do the What's the series that Mark Ruffalo is like obsessed with? I don't know. I'm not",
            "start": 6098.4
        },
        {
            "text": "Ruffalo, and it's like a It's like a cop detective show. It looks so [ __ ] good. Why won't they just let him do the What's the series that Mark Ruffalo is like obsessed with? I don't know. I'm not familiar. You'll know once I say it cuz Gary Wood, I think was involved. Also, the detective who was like a bumbling idiot but really a genius. Uh oh. Uh Columbbo. Yes, Columbbo. Thank you, Chad. Yes, they do like Columbbo. Funny ant. Oh, not Gun Dog. God damn it. Columbo. He wants to do Columbo. Mr. Bean. I hate Mr. Bean. Everyone hates Mr. Bean. Mr. Mr. Bean was one of those moments where we all just decided we all had to ask ourselves a question. If we had Twitter, would we like Mr. Bean? Cuz we all would have dogged on that dude back then. The makers, their directive was clear. What would you have us do? Nothing. [ __ ] you. I love this. Some people just don't have taste, chat. Some people just don't have taste. It's wired to a detonator. Mr. Bean in review. That demon. He's after",
            "start": 6155.04
        },
        {
            "text": "you have us do? Nothing. [ __ ] you. I love this. Some people just don't have taste, chat. Some people just don't have taste. It's wired to a detonator. Mr. Bean in review. That demon. He's after something. You saw that? We call it the heart of Argent. The heart of Argentina. Anyone who wields it, they'd have the power of a god. Stronger than maybe even you. But the heart is incomplete. It's made up of two parts. The other half is a power source and we don't know where it is. Balance search party is still active. If he ever gets control of it that much power in hell's hands, none of us would survive. Mr. Bean has a McLaren F1. Good on him for getting that bag. Lol. I don't know what that means. Sawu has a McLaren F1. Like he owns the McLaren like a He owns a McLaren. He's got that kind of money. Is F1 like a model of McLaren or No. Yeah. Yeah. You got to give us more information. We're dumb. Yeah, you have to link stuff. No. Well, you don't just put a link in the chat to Rowan",
            "start": 6209.68
        },
        {
            "text": "kind of money. Is F1 like a model of McLaren or No. Yeah. Yeah. You got to give us more information. We're dumb. Yeah, you have to link stuff. No. Well, you don't just put a link in the chat to Rowan Atkinson's car collection. Car collection. Does he have more than Jay Leno? No one has more than Jay Leno. I ask for money to be earned. Oh, it's an old super car in the '9s. Oh, cool. Oh, one of the most rare super cars ever made. It's like a $40 million car. Jesus crashed it. I would sell it. You know, there is no one left to try. I don't know that I would. Oh, didn't he post one of the best times on Top Gear pass lap? That's really cool. Still don't like him. I have no idea what's going on in the story here. Well, neither do I. You don't play Doom for the story. Put that on the box. But it looks so pretty. It's a pretty game. He's on sight. The doom slayer road car. I'm meeting him at the forge. I don't know that I would ever have the balls to take a $40 million car out on the road",
            "start": 6291.6
        },
        {
            "text": "it looks so pretty. It's a pretty game. He's on sight. The doom slayer road car. I'm meeting him at the forge. I don't know that I would ever have the balls to take a $40 million car out on the road ever. I mean, it would live in a garage. I think that's generally what people do with that sort of thing. Just keep in a garage somewhere. I Mr. Bean's twice wrecked Mc McLaren F1 is for sale. Twice wrecked. Yeah. How much is it for sale for? My people and sold it for combined. He sold it for an 11.3 million profit. Oh, good for Jesus Christ. Well, I guess that's God. Good. That's an appreciating uh asset right there. Yeah. Wow. So, I guess he doesn't have anymore. So, he's got 11 million bragging about it. Don't know what they're talking about. I think we're all hating on Mr. Bean, but I don't like him. I've told I've been very clear about that. Do you see the God, never mind. Say it. No, there's there's this comedian who I I just don't remember the names of anyone, so it's hard to like",
            "start": 6368.0
        },
        {
            "text": "like him. I've told I've been very clear about that. Do you see the God, never mind. Say it. No, there's there's this comedian who I I just don't remember the names of anyone, so it's hard to like I'll say it for you. Who is it? There's a there's like a British comedian who does really really spectacular dry kind of comedy. He has a good bit about how like the um and you know it's a well trend on topic, but like the English museum of whatever is just like them stealing a bunch of stuff and people like wanting it back and how they they're just like, \"No, I'm going to keep it.\" Mhm. Anyways, he had a a a joke or like I saw a video of him being interviewed on how like Rowan Atkinson stole his girlfriend. How upsetting it all was. People name a lot of great people in chat. Ricky Jarez, Jimmy Carr, Eddie Isizard, James A. How do you say that last name? James Aaster. Oh, Acaster. Yeah, it's Acaster. That's how you say his name. Yeah, really. I think he's quite funny. Oh. Oh, this is bad.",
            "start": 6437.6
        },
        {
            "text": "Carr, Eddie Isizard, James A. How do you say that last name? James Aaster. Oh, Acaster. Yeah, it's Acaster. That's how you say his name. Yeah, really. I think he's quite funny. Oh. Oh, this is bad. No, maybe they wanted you to go that way. No, they definitely did not. Yeah, I know. I was just trying to be nice. Deers a caster. Thank you. He was a Gogg buster. I don't know what the hell that means. Ew. Oh, smelling there. The gate will open. Oh, he died painfully. So lame. Your shield didn't make it. Ghostbuster. Okay, that makes a lot more sense. Was he a Ghostbuster? James Agasser. Yeah, I don't think so. He's in the best season of Taskmaster. I would like to watch more of this Taskmaster show because the clips that I get on TikTok, phenomenal. Yeah, he was in Frozen Empire. Didn't watch that one. Didn't watch that one. Is it worth it? Uh, Greg loves it. Yeah. Yeah. Greg said it was pretty good. Yeah. But like, can we trust him with something like that, guys? Like, if he walks out of",
            "start": 6493.92
        },
        {
            "text": "that one. Didn't watch that one. Is it worth it? Uh, Greg loves it. Yeah. Yeah. Greg said it was pretty good. Yeah. But like, can we trust him with something like that, guys? Like, if he walks out of Superman and he's like, \"It's incredible.\" You still got to be like, well, he's getting extra points cuz he loves it. And you know, it's tough. It's hard to do. There's nothing wrong with that. I'm the same way with Kevin Smith movies. Wow. You binged 10 seasons of it. Yeah, but I don't think it's available in America. Oh, Cooper, congratulations. Cooper's going to have a kid. Nice job, Cooper. Congratulations. Me and Nick. Yeah, Henry's doing great. He's crawling all over the place. Mentioned that earlier. It's a lot of fun. Big smiley boy. We say stand up and he starts he goes and he stands up. It's really great. We'll hold him, but you know, he's getting there. JShot says, \"I watched Frozen Empire with my dad and we looked at each other then and agreed it was not great.\" Great. Okay,",
            "start": 6590.56
        },
        {
            "text": "up. It's really great. We'll hold him, but you know, he's getting there. JShot says, \"I watched Frozen Empire with my dad and we looked at each other then and agreed it was not great.\" Great. Okay, so that sounds that sounds right. Oh, they have all full episodes on their official YouTube. Well, thank you very much, Spoon McKay. I might quietly do that at night while everyone sleeps. Oh, Billy Sunrider says, \"I saw Friendship today and it was great.\" See, friendship was one that I was scared that I was going to go watch and and just not like it at all cuz I could see myself going either way on that movie. And I the the last Paul Rudd movie, the unicorn one. Mm- didn't do it. Didn't do it. Even though I really like the guy that plays the dad of the family. I like several people in that movie. Just it it was poorly written. Very quickly, you're like, \"Oh, I see how this is going to go. Uh Mikey likes it. Uh how is the sleep schedule doing so far? Oh, great. Great. We uh we did the kind",
            "start": 6671.04
        },
        {
            "text": "Just it it was poorly written. Very quickly, you're like, \"Oh, I see how this is going to go. Uh Mikey likes it. Uh how is the sleep schedule doing so far? Oh, great. Great. We uh we did the kind of the it's called the pause method where he starts waking up, starts crying a little bit, and you give you give a beat. You wait like 2 minutes, let him figure out what's going on. Maybe he goes back to sleep and then you do that longer and longer over time and uh it worked. He sleeps uh sleeping consistently 10 hours and recently we got blackout curtains for him and now over the weekend slept for 11 hours and a half. So we're right there. 12 hours is the dream. 8 to 8. Nick, did you like the I think you should leave now? No. No. No. That wasn't for me, unfortunately. But I do like the Detroiters. Um, which is slightly less awkward because it's mellowed out by Sam Richardson. Mhm. Who is uh another comic, but he's way more fun to watch, I think. So, I think he's good when he across Tim",
            "start": 6753.52
        },
        {
            "text": "Um, which is slightly less awkward because it's mellowed out by Sam Richardson. Mhm. Who is uh another comic, but he's way more fun to watch, I think. So, I think he's good when he across Tim Robinson, but uh not my favorite. Oh, yeah. I love Sam Richardson. He's great. He was in the What was that show that they did? Yeah, we learned when they took I know him from VEP. Yeah, you should watch Detroititers and if you like Tim Robinson if you liked I think you should leave cuz it's it's a lot more like lighthearted. Yeah, I watched half a season of the first season and I was like this is one of the funniest things I've ever watched and I stopped and I haven't gone back. It's amazing. I I really like the humor of that. Yeah. Friendship is very awkward. Yeah, Detroiters is incredible. Where's Detroit? What What are you watching Detroititers on? I think it's on Netflix now. And bats in in the chat says Detroiters is incredible. Yep. Yep. Two seasons. All right. I will say having a child",
            "start": 6819.2
        },
        {
            "text": "Detroit? What What are you watching Detroititers on? I think it's on Netflix now. And bats in in the chat says Detroiters is incredible. Yep. Yep. Two seasons. All right. I will say having a child makes it very very difficult to watch things because it is like all we have to wait for him to be asleep and at that point because otherwise he's now that he's crawling he's just going to try to look at the TV wherever it's at. We're trying to be TV free for a while. So yeah, we get especially when he goes to bed it's 8:00 and it's like you want to just hang out and talk and you know like oh we should watch something. It's like, oh yeah, what if we go to sleep at 9:00? That'd be pretty good, too. Wow. Many don't know this, but Tim Robinson used to skate professionally and got hurt and then got into acting. Look at that. Everyone's journey's different, you know. Maybe I should start skateboarding. I'm sorry, Nick. You're over 30. No, the window is closed. I've always been devastated. I'd",
            "start": 6874.4
        },
        {
            "text": "into acting. Look at that. Everyone's journey's different, you know. Maybe I should start skateboarding. I'm sorry, Nick. You're over 30. No, the window is closed. I've always been devastated. I'd never been able to ollie on a skateboard. You can. Can't. You definitely can. Uh, last time Cool Greg had a skateboard out of nowhere and I tried and I nearly oied. Oh, feel that. Kev, we've been playing some board games after putting the baby down. That's great. I just uh cleaned the hot tub up a little bit, so that's ready to rock and roll. So, I'm excited to put him to sleep, get the iPad, bring it out. I just have to if I have to run in, I'll be ready to rock and roll. I broke three decks. They're learning to ollie. Yeah, 64. I'm pushing 300. That That'll certainly do it. busy books. Yeah. It's crazy how captivating uh the TV is for a young child cuz like if it's on in the background and he catches it like that's all he's looking at. Yeah. It's like whoa whoa. I might maybe try this busy",
            "start": 6958.08
        },
        {
            "text": "crazy how captivating uh the TV is for a young child cuz like if it's on in the background and he catches it like that's all he's looking at. Yeah. It's like whoa whoa. I might maybe try this busy books. I've been wanting to get this computer engineering for babies book for a while. Maybe that's a little more advanced. Shut down after the attack, but the forge still has power. The demons are drawn to it. I feel like millennials have a special bond with skateboarding. Yeah, it was like coolest thing in the goddamn world. And even if you couldn't skateboard, Tony Hawk, you just want to be around it. Tony Hawk Pro Skater. I had I've had so many skateboards. Did you skateboard? Yeah. Oh, I thought was that not one of those things that like you guys got hurt a little bit and your mom was like, \"Skateboard's gone.\" Yeah. Yeah. Yeah. But up until that point, I skateboarded. Yeah. It was funny. Growing up, Tim and Cool Greg always skateboarded, but like I can't imagine Tim skateboarding. He",
            "start": 7043.64
        },
        {
            "text": "\"Skateboard's gone.\" Yeah. Yeah. Yeah. But up until that point, I skateboarded. Yeah. It was funny. Growing up, Tim and Cool Greg always skateboarded, but like I can't imagine Tim skateboarding. He was I can't imagine doing Tim anything any and this is not a knock against Tim, but I can't imagine Tim doing anything athletic. He just hates moving his body so much. He was in track. Was he really? Yeah. That's wild to me. I think maybe he did the long jump too. I don't know. Yeah, he uh he skateboards a way that's called I think Mongol style where it's like he uses his front foot to kick. That I think is insane. Just the lack of control like it feels like you have is but like you know that's just how he did it. Yeah, I got into skateboarding uh freshman year of college just because I was like, I need uh something to be more mobile and get to these classes faster. And I just rip it down the hill. [ __ ] That's it. [ __ ] Oh, Billy Sun Rider said, \"I I used to uh longboard a lot in",
            "start": 7095.04
        },
        {
            "text": "was like, I need uh something to be more mobile and get to these classes faster. And I just rip it down the hill. [ __ ] That's it. [ __ ] Oh, Billy Sun Rider said, \"I I used to uh longboard a lot in college. It was really fun, but then moved to SF and the hills were too scary to ride for me.\" Yeah, the hills are insane. It takes It take Especially I mean a longboard's great though cuz you know depending on how busy the street is, you can really do the slide left and right, left and right. Slow yourself down. Idaho soy board. Real fat in the middle. Love that board so much. [ __ ] Switch is tough, but it's doable and approved by Tony Hawk if it's your only way to skate. Yeah. There's the story that Tim's told I think many times before, but where Tony Hawk just came by a skate park he was hanging out on and like he was trying to do I think it was a kick flip and like Tony Hawk gave him some pointers and he nailed his one and only kick flip he's ever done. But like if you're going to",
            "start": 7151.68
        },
        {
            "text": "hanging out on and like he was trying to do I think it was a kick flip and like Tony Hawk gave him some pointers and he nailed his one and only kick flip he's ever done. But like if you're going to nail it in front of someone. Pretty cool. Tony Hawk, you know. I mean Yeah. Yeah. I'm never going to forget that interview with you, Tony Hawk. Were you there? Oh, you were there for that? I was there. Yeah. Like, hey, this is just going to be a 30-minute interview with you and Tony Hawk. I'm like, I don't really Yeah, it was scheduled for 15 minutes originally, right? And then they're like, we're going to extend it and it just like I think it ended up being a 15-minute interview, but that was about that was a solid 12 minutes more than Tony wanted. Yep. Yep. Yep. I said Tim useless in that. I was like, Tim, we'll do the heavy lifting and I'll do color. Panicked and Well, you I think you both panicked and I just ran out of questions. Well, but at the time I think that your level of panic",
            "start": 7233.68
        },
        {
            "text": "I was like, Tim, we'll do the heavy lifting and I'll do color. Panicked and Well, you I think you both panicked and I just ran out of questions. Well, but at the time I think that your level of panic was like, \"Okay, I'm going to double down on this thing I'm trying to get him to talk about.\" And it just go fun. That's still available on the internet somewhere. was hanging out with the Opair recently talking about standup and Paul's like, \"Oh, Kevin has a standup video too, I think, up on online.\" I was like, \"Nope, don't look him up. That's nope.\" This is scary, but a fun thing to do. You one of these people say, \"Biopic or biopic?\" Uh, biopic. I hate them. After watching his biopic, I think y'all were talking to him while he was in a bit of a downward spiral in terms of his life. It felt like that. It definitely felt like he didn't want to be there. Yeah. And then after 40 minutes, I didn't want to be there either. Yeah. had a much better time talking to Devon Sawa. He was great.",
            "start": 7290.24
        },
        {
            "text": "like that. It definitely felt like he didn't want to be there. Yeah. And then after 40 minutes, I didn't want to be there either. Yeah. had a much better time talking to Devon Sawa. He was great. The level of excitement that the the like we had when he came by, everyone came out to see him. Yeah. The girls really liked him. Yep. That's weird. Yep. I don't understand that. They don't respond to me the same way they respond to him, which is fine cuz I'm happily married. Crazy. You're just as good looking. It's crazy. Just as jacked, just as successful as someone would say. They call me the friendly ghost. You were someone's final destination for sure. Well, see what I did there? It was good. Took me a minute. Took me a minute. You got there, though. What do you think of a for a skate marathon stream when it comes out? First of all, is skate actually ever coming out? Cuz I feel like they've been talking about that for so long. Devin Sawa, the dude from Idol Hands. Yeah, Devon Sawa, the",
            "start": 7358.16
        },
        {
            "text": "stream when it comes out? First of all, is skate actually ever coming out? Cuz I feel like they've been talking about that for so long. Devin Sawa, the dude from Idol Hands. Yeah, Devon Sawa, the dude from Idol Hands. He's a friend of ours. He's a friend of the show. Friend of the show. Friend of the show. Really nice dude. Yeah, he's right. Lot of nice dudes. I remember meeting Brandon Ralph and being like, \"Oh, you're really nice.\" He was lovely. Really sucks that I hate your Superman movie. You know, it's not your fault. I like parts of a Superman movie. What part? The plane sequence is stunning. Oh, yeah. It's a good You're right. That's an incredible scene and like forever will be live in my mind. just was boring. And I get the fault. It's not his fault, unfortunately. It's Brian Singer's fault. Yep. I used to play Gears of War with the main actor of Step Up 3. That's a handsome man. I don't think I got that far into movies. Yeah, I don't think I could pull that person. [Music]",
            "start": 7420.72
        },
        {
            "text": "fault. Yep. I used to play Gears of War with the main actor of Step Up 3. That's a handsome man. I don't think I got that far into movies. Yeah, I don't think I could pull that person. [Music] Uh, Sawu asks, \"Hey, Nick, what is Shang Wang like in person?\" He's really nice. Going to catch his standup in SoCal soon. Uh, he's really nice. I've done a couple shows with him. Um, he's just very chill, funny guy. Last show I did, him and Louis Catz came by and just hung out for a little bit and dropped ads. It was really fun. That's awesome. He's a funny dude, dude. He's just one of those guys where like his delivery is in and of itself is funny. So he could be reading the phone book and it still be [ __ ] hilarious. I'm assuming I got to go this way. How's that all been going? I haven't heard many updates like me. Is it everything? Yeah, but like you're getting uh was it passed past? I'm passed. Yeah, I'm a paid regular now. So now I'm getting hired to host Punchline Cobs. Uh I'm passed",
            "start": 7466.0
        },
        {
            "text": "many updates like me. Is it everything? Yeah, but like you're getting uh was it passed past? I'm passed. Yeah, I'm a paid regular now. So now I'm getting hired to host Punchline Cobs. Uh I'm passed down at Rooster Tea Feathers, which is a club down in San uh Sunnyvale. So, I've got a weekend coming up there at the end of June, which is fun. It's good. That's awesome. Yeah. Is it everything you hoped it was? It's um I mean, it's very fun. Yeah, it's definitely very fulfilling, but it's a long grind upward. The heck am I going? I go up this way, maybe. Yeah, it's just one of those things where you think you're going to enjoy a lot of success early on, and it it's just it's a marathon for some for me. For other people who are more talented, it's uh you know, a little easier, but to each their own. Everyone's got their own path. It's It's been quite a while since I've seen one of your sets. At some point, I need to go and check it out again. See what see where you've gone. Take the Opair.",
            "start": 7522.32
        },
        {
            "text": "own. Everyone's got their own path. It's It's been quite a while since I've seen one of your sets. At some point, I need to go and check it out again. See what see where you've gone. Take the Opair. Take the Opair. Have her see some real standup. Hey, you got to show them the city a little bit, you know. Sure. Oh, he stayed invisible after he died. Yeah, you have to hit him a certain way for him to get uninvisible. You have to get that. Nick, you ever met Jeff? Arery. Uh, spell it. A R C U R I. No. He's going to find out half Nick's jokes are making fun of Kevin. God, that would suck. No, I don't make fun of the coworker. I only make fun of my co-workers to their face on streams. Mhm. Where it can make us all money. Yeah, I see your clips every once in a while. It's great. Yeah, I got to post more. That's the one thing that's the toughest part about it is it's more fun to just do the comedy and write and perform and not worry about video work. And unfortunately, the way you get big,",
            "start": 7570.0
        },
        {
            "text": "post more. That's the one thing that's the toughest part about it is it's more fun to just do the comedy and write and perform and not worry about video work. And unfortunately, the way you get big, the way you get more of a following is by posting clips. And I just I hit Sunday and I'm like, well, I could either go do another set of punchline or I guess sit here and and clip videos. And it's I just always pick the more fun thing. Yeah. It's unfortunate. I actually like noticed when I film myself my my sets like when I I've backed off a little bit cuz I'm like I want to go I just want to get to the venue early, do a little writing, maybe have a cocktail and just enjoy people's company in the green room and then my set is always inevitably better. It's just better. Just more relaxed. Yeah. Cuz I'm not worried about, you know, when you do video stuff, you know, you you people know your brain's in that analytical sort of mindset. And I think if you if you get in that a little too uh too",
            "start": 7628.88
        },
        {
            "text": "Cuz I'm not worried about, you know, when you do video stuff, you know, you you people know your brain's in that analytical sort of mindset. And I think if you if you get in that a little too uh too much. All right, buddy. What are we doing? Um, you know, it kind of throws you off of that the the creative part of your brain. So, I've kind of backed off a little bit, but I am sitting on like maybe 40 or 50 minutes of sets that I should go through at certain point, start pulling some clips from cuz that that's also a fun process as well. But, you know, it's like doing homework. Once you sit in, you're like, \"Ah, it's fun.\" But just getting to the point where you have to sit down and actually do it, it's not as fun. And I've like I've I've hired people in the past to like just cut stuff for me. And it's like it's never how you want it, right? I always want to be like do it myself. Yeah. I mean, that's a tricky situation, right? Like someone cutting something so personal, you know what I",
            "start": 7669.6
        },
        {
            "text": "me. And it's like it's never how you want it, right? I always want to be like do it myself. Yeah. I mean, that's a tricky situation, right? Like someone cutting something so personal, you know what I mean? Yeah. Yeah. It's uh the the two times that I was able to do standup, like the the writing process of it was so much more fun than I expected it to be, but the like getting to it, like, okay, I'm going to sit down and start writing, awful. Hate that. Well, that's that there's a trick with that is um if you go to like if you put yourself in a position where you're going to go to like mics, for instance, um that helps a lot because then you're in an environment where you feel inspired to write, you know? M that makes sense. Got it. And so I I do a lot of my writing either before the show starts or during the show when I'm if I'm, you know, have just done my set and I'm just kind of, you know, hanging out, chilling around, hanging out. Um, and then to and from mics is when I'm most",
            "start": 7709.84
        },
        {
            "text": "starts or during the show when I'm if I'm, you know, have just done my set and I'm just kind of, you know, hanging out, chilling around, hanging out. Um, and then to and from mics is when I'm most creative cuz I'm driving and my brain's kind of Oh, we're doing this again. Okay, here we go. There it is. Turret time. Oh, cool. That's all they wanted, huh? Just a bolt and done. So I I still do the Uber joke sometimes. Yes, I do. It's a good joke. It's a good bit. Yeah. When I have to do longer sets, if I'm doing like 20 minutes, I'll I'll I'll close with that. But I tie it into another joke I do now. Oh, don't tell me. I want to see it. Okay. Yes. Give me the ruby. Has there been anyone at like Punch Line or the other spot where like you were like, \"Oh [ __ ] this person's coming.\" Yeah. And you were like a little nervous. Uh oh yeah. Oh yeah. Yeah. I was at I was at a venue one time and uh my my uh the guy that runs it a venue called Cheaper than Therapy and the team that runs that",
            "start": 7758.8
        },
        {
            "text": "And you were like a little nervous. Uh oh yeah. Oh yeah. Yeah. I was at I was at a venue one time and uh my my uh the guy that runs it a venue called Cheaper than Therapy and the team that runs that really great nice people. Um we're like hey you got to be really cool right now. And I was like what am I never cool? Yeah. Granted they're like Nick we know you. You can't keep a secret and you say the wrong thing at the wrong time all the time. I was like I'm cool. I'm cool as a cucumber. Why? What's going on? And I looked over and there was this short lady with her mom and and I and she spoke and I was like, \"Oh, that's Ali Wong.\" Oh. And there he's like, \"Yeah, Ali's just going to do 20 real quick.\" And I was like, \"Cool.\" Damn, that's crazy. Bay Area legend. Yeah. My friend Travis was hosting and uh and uh the show producer walked up to him and was like, \"Hey, just so you know, like Alli's up next.\" And he goes, \"Allie who?\" And he goes, \"Alli Wan?\" He goes, \"Oh, cool.\" He's like,",
            "start": 7809.44
        },
        {
            "text": "hosting and uh and uh the show producer walked up to him and was like, \"Hey, just so you know, like Alli's up next.\" And he goes, \"Allie who?\" And he goes, \"Alli Wan?\" He goes, \"Oh, cool.\" He's like, \"Okay, cool.\" I was always like, you know, that's just fun to be able to um, you know, introduce that. And then she did set at Punchline. And then I did uh I'm actually going back to the stream on June 5th. I'll be in Santa Rosa for the Flamingo Inn. Uh, Nick Croll dropped by for a set. He closed that out. So, that was pretty fun to see him kind of just hang. I I don't Nobody ever wants to talk to me. You know, they're mostly just kind of there to do their job, but every once in a while, you'll get to network or not, you know, just hang out with someone and get to know them a little bit. That's always kind of special cuz you know they're comics. You're a comic. They're better but Yeah. Yeah. By by by a marwide margin, but it's cool to be able to watch it. I mean, they've also been doing",
            "start": 7850.48
        },
        {
            "text": "always kind of special cuz you know they're comics. You're a comic. They're better but Yeah. Yeah. By by by a marwide margin, but it's cool to be able to watch it. I mean, they've also been doing it, you know, 15 years longer than you. Exactly. So, but yeah, that's the cool thing about Punchline is it's like it is such a nice It's such a wellrespected club that you get those people that actually want to come there, you know? Um, and even if they're if they're big enough to sell out like a a theater for instance, like Ally could easily be selling out like massive theaters if she wanted to. She could minimum if she comes to San Francisco, she's doing the Masonic if not like the Palace of Fine Arts or a bigger room like that or the Bill Graham, right? Um, but she likes Punchline because it's it's a great club. It's just good acoustically, great lineage. People that run it are phenomenal. So, yeah. Well, it's also like people seem to like like big names go there to work stuff out. Yeah,",
            "start": 7887.2
        },
        {
            "text": "it's a great club. It's just good acoustically, great lineage. People that run it are phenomenal. So, yeah. Well, it's also like people seem to like like big names go there to work stuff out. Yeah, Chappelle's always there. Um, yeah, I've seen him there twice, I think. Yeah. Oh god, those are those are bombs. We're not far now. But it's cool. And I hear a lot of people, you know, a lot of LA comics like coming up here because you can do if you're if you're established, but you're not quite putting you're not quite selling out an entire weekend like Cobbs or Punchline. They like doing like a one night or a punch line and they like coming to our scene because we've got so many cool independent shows that you can just kind of hop on and do like 10, 15, 20 minutes if you're a bigger name. So, it's a really fun San Francisco's so small that you can go show to show to show. Not quite like you can in New York, but similar to that, and people really really dig that. I got to update my uh my",
            "start": 7928.08
        },
        {
            "text": "it's a really fun San Francisco's so small that you can go show to show to show. Not quite like you can in New York, but similar to that, and people really really dig that. I got to update my uh my schedule on my Instagram. I'd like to Oh, a new weapon. Someone was asking a question about crowd work. Sure. Basically, do you think crowd work is going to stick around for a while? Yeah, it feels like crowdwork has become more popular with Tik Tok, right? Yeah, definitely. I mean, you have comics. Um, what is this? Grenade launcher. Grenade. Take your time. We can pause on this. No, you're fine. Uh oh. Uh, Lucas Zelnik is a guy that I met a couple times and I've done shows. He's he's blowing the hell up right now and he's kind of a crowdwork guy. So, I do think that there's I think people like it. I think people like the interactivity of it and the excitement of it. Um, and I think a lot of headliners do crowd work as they're working on their 45 to an hour, like their new special, because",
            "start": 7971.68
        },
        {
            "text": "it. I think people like the interactivity of it and the excitement of it. Um, and I think a lot of headliners do crowd work as they're working on their 45 to an hour, like their new special, because it can help them be That was sick. Uh, it can help them pad that hour out while they're working on material, right? If that makes sense. Yeah. It also seems like a really smart thing to like you post your crowd work and that can be, you know, you don't have to burn your material. Yeah, exactly. Yeah, that's that's absolutely what people do. Um, and hopefully it sticks around cuz I like doing crowd work. Mhm. I love it. But it's it's you have to be careful at my stage that cuz I'm good at it like is relatively speaking. Um, but I need to be really focusing on developing more material cuz when you do clubs, they don't want you to do crowd work. You're a host. They want you to they want you to actually just do 15 minutes to 20 minutes of material. And I want to get past as a feature",
            "start": 8021.52
        },
        {
            "text": "when you do clubs, they don't want you to do crowd work. You're a host. They want you to they want you to actually just do 15 minutes to 20 minutes of material. And I want to get past as a feature eventually, so I'll need 25 minutes to 30 minutes of just material. Um, and if you do crowd work during that audition, they go, \"No, no, that's for the headliner.\" Right. Right. Right. The other problem with crowd work is it trains the audience to think, \"Hey, let's talk.\" And if the headliner is like a, you know, a traditional comic, they don't want them talking. They want to perform for you. Yeah. Yeah. I feel like that's kind of the most dangerous thing about crowd war, especially with it like blowing up on social media of like, hey, this isn't this that's not what comedy is. Like that's a moment, you know? Yeah. Sadly. And I've seen I've worked with quite a few headliners that are really good at it. Like Mosha Kesher is [ __ ] phenomenal work is phenomenal. Um and then I've seen other",
            "start": 8069.2
        },
        {
            "text": "moment, you know? Yeah. Sadly. And I've seen I've worked with quite a few headliners that are really good at it. Like Mosha Kesher is [ __ ] phenomenal work is phenomenal. Um and then I've seen other headliners who are like, I'm not comfortable doing this, but my literally my management team's like, you got to do it. So they'll go out there and be like, all right, they'll do like I've seen headliners and I don't want to name names, but they'll go No, not in a bad way. It's not bad at all. But they'll do their material and then when they're done with their like 45 minutes, they'll go, \"All right, my manager wants me to do crowd work for socials.\" So like, \"What do you guys want to talk about?\" But they give people the show first. And then like Mosha is so first off, he's really great at crowd work because his crowd like works is I mean, he's like one of the best. Him and Phil Hanley are really great at crowd work, but Mosha is so like um upfront about it. He brings a wheel of",
            "start": 8107.92
        },
        {
            "text": "at crowd work because his crowd like works is I mean, he's like one of the best. Him and Phil Hanley are really great at crowd work, but Mosha is so like um upfront about it. He brings a wheel of questions. Oh yeah. He's like, \"Who wants to spin the wheel?\" And they'll they'll spin the wheel and it'll just be like, \"All right, tell me your deepest darkest secret.\" and like who wants to say their deepest darkest secret now and someone will raise their hand and it gets but it's like the interactive portion of the show so that if you don't want that he'll still do really really really good bits. That's really clever. That makes sense. Yeah. But Mosha and Phil Hanley's [ __ ] If you guys don't follow Phil Hanley and Mosha Casher, you should follow both those guys there. It feels so [ __ ] good at crowd work. And it's been fun to watch those guys. Like I haven't been doing it long enough. I've seen these guys go from like 50 to 100,000 followers to being like blowing up. That was sick. And",
            "start": 8142.24
        },
        {
            "text": "at crowd work. And it's been fun to watch those guys. Like I haven't been doing it long enough. I've seen these guys go from like 50 to 100,000 followers to being like blowing up. That was sick. And it's very inspirational. Does this have a different fire? So much flying at you right now. I know. So much. How do you like this new gun? Uh, I don't love it. I don't really understand it. Can you flip switch on the fly? On the fly or Yeah, but it's not actually It doesn't actually pause the game. So, it like slows the game down. Oh, I see. but it doesn't pause it, which I think is very clever, but also really [ __ ] annoying. It also looks really cool. Ah, give me that health. just [ __ ] people up with this flail. Love it. Is it bad when they're glowing white or good? Is it bad when they what? Glow white. No, it's not good. That's like a shield, I think. It doesn't seem like my head hits are doing [ __ ] Oh, okay. Beat that. Uh-oh. I don't love this. Uh-oh. This is bad. No, he looks like",
            "start": 8177.6
        },
        {
            "text": "Glow white. No, it's not good. That's like a shield, I think. It doesn't seem like my head hits are doing [ __ ] Oh, okay. Beat that. Uh-oh. I don't love this. Uh-oh. This is bad. No, he looks like he might be a friend. You think he wants to hang out with me? Yeah. He just wants to take me a lunch. Is that his own face on his shield? That's so lame. All right, we have that purple bar building up again. Oh, Kevin, what are your five favorite comedy shows? That's so hard. That's such a hard question. I've seen a lot of comedy like on TV and there's so many good comics out there. And also now with Tik Tok, I'm seeing so many clips of new people. It's so hard to like before I used to be able to name everyone I like. Now it's just like that one Latin dude that has a very like, you know, monetary talking. Huh? Ralph Barrosa. Yeah. Yeah. He's [ __ ] I've seen him go for I saw him at Punchline a couple times and then he just [ __ ] blew up. Yeah. It's just It's really crazy to see like",
            "start": 8287.84
        },
        {
            "text": "monetary talking. Huh? Ralph Barrosa. Yeah. Yeah. He's [ __ ] I've seen him go for I saw him at Punchline a couple times and then he just [ __ ] blew up. Yeah. It's just It's really crazy to see like someone will just get that one bit that everyone wants, that one second and it can really launch a career. Oh, absolutely. I mean, they they got to be able to back it up, right? Yeah. Well, that's that is an issue that a lot of like Tik Tockers run into cuz there is a there's a lot of uh maybe I should try this other thing. Hold on. Try this. But I mean like what Shane Shane Gillis. Yeah. I mean, he had one bit that blew the hell up and like obviously he'd been doing comedy for a long time and he was ready to back it up and it just Yeah. Shane's been a comic for a long time. Did you guys have to force snow bike Mike to take PTO? Uh, yes. Oh, shoot. Yeah, I like the message as well. Nice. We have to force like Mike pretty much do everything. Mhm. Mhm. It's funny. We come back from a long",
            "start": 8354.56
        },
        {
            "text": "to force snow bike Mike to take PTO? Uh, yes. Oh, shoot. Yeah, I like the message as well. Nice. We have to force like Mike pretty much do everything. Mhm. Mhm. It's funny. We come back from a long weekend and he's like, \"Ah, three days too much, you know? Three days too much.\" Slappies. I hate it. I love Mondays. Who doesn't love Mondays? It's like he hung out with family this week, too. He's He's so lonely. He's just so alone. What difficulties are you playing on? I'm on playing I'm on hurt me plenty. I'm not on nightmare for whatever. So I could be wrong in chat. I got to look this up, but I Kevin I think there used to be five. Last week there was five. That sounds right. I think that's what I heard too. Yeah. So Oh, I just really shitty on that. 50%. That was terrible. Well, it's 49. I round it up. I round I rounded up like I round up everything else. Zero rubies. [ __ ] that sucks. Got to go back and replay that demonic armor. Uh, we are at 255 and I think, ladies and gentlemen,",
            "start": 8414.24
        },
        {
            "text": "I round it up. I round I rounded up like I round up everything else. Zero rubies. [ __ ] that sucks. Got to go back and replay that demonic armor. Uh, we are at 255 and I think, ladies and gentlemen, this is a great place to end it. Thank you guys so much for hanging out with us today. Kevin, thank you for hanging out with me. And if you guys enjoyed Doom, well, guess what? I'm playing it again, I think, tomorrow. So, I'll be back and maybe I'll do better for you guys with these uh percentage of uh how how badly I am playing each level. But you guys have been amazing. Thank you for chatting with us today and we will see you tomorrow. Bye-bye. [Music]",
            "start": 8488.4
        }
    ]
}