{
    "id": 14098,
    "video_id": "aS8e3tAGFjI",
    "show_name": "Highlights",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Mike Howard",
        "Roger Pokorny"
    ],
    "title": "Mike is PISSED at Roger",
    "description": "From Gamescast: https://www.youtube.com/watch?v=APolmSqRMKo\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on\ntheir best-selling Carver Mat frame.\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1747342550,
    "duration": 1123,
    "transcript_chunks": [
        {
            "text": "Some [ __ ] went down yesterday which we're not gonna talk about. That was We're not allowed to talk about it. Turns out it's embargo. So tough. Everyone don't tell Nintendo. Well, it's making it worse. Just be cool. It's like when uh when Blessing was reviewing Tears of the Kingdom and Nick was like, \"Blessing's off doing something really important.\" I was like, \"Thanks, Nick.\" But nobody ever guessed it. Yep. So, some [ __ ] happened yesterday that put a Well, actually, we got to dial this back all the way. Dial it back. Shout out to Mike and Roger for having an amazing marathon stream for Death Stranding. A walk-athon uh for your health for everyone's enjoyment value. You guys crushed it, right? We call Tim. Call Tim. We We got I'm so sad I didn't answer. I'm sorry. We also got to talk about Tim big time in us. Big time. Big stuff huge cuz we're walking on this shitty treadmill and then we realize, oh [ __ ] he has a [ __ ] pelon. never once offered it. Never once never once offered",
            "start": 0.08
        },
        {
            "text": "Tim big time in us. Big time. Big stuff huge cuz we're walking on this shitty treadmill and then we realize, oh [ __ ] he has a [ __ ] pelon. never once offered it. Never once never once offered it. And that's when you realize the tier of Tim Daddyy's life. Here's the thing, though. We thought I I we did talk about this a long time ago, but like logistically, there's no way that would work. Mike has a big car. He could have figured it out. Put it in. Dude, this thing is big. Big big Kevin's car. Oh man, I don't know. I got four cars. Put two of those cars together and it would be totally We can put that thing in there. You also can't plug his uh his pelon in cuz it requires a much bigger it's like a washing machine. I I I heard you guys called everybody because of some like big like thing you guys did in the stream. Um well, where was my call? Well, let's talk about that real quick. We called everyone. You called [ __ ] everybody but not me. We called everyone that was the guy who",
            "start": 50.48
        },
        {
            "text": "you guys did in the stream. Um well, where was my call? Well, let's talk about that real quick. We called everyone. You called [ __ ] everybody but not me. We called everyone that was the guy who regularly checked up on you. The guy who called you to fix the couch shot because we're doing a bit We wanted the bit of everybody were calling to not answer, right? We knew Barrett was there. We knew Barrett was going to answer. So, we're like, who is the people that were going to annoy the most? Tim. No, Greg. Yeah. Bless for sure. Blessing [ __ ] big timed our asses, too, by the way. Did not respond to my text, but completely big time. Joey, she's in Beyonce. She's hanging out with Beyonce. She didn't respond, right? And then we finally called Andy cuz we knew he would be annoyed even if he was watching. Bear, I knew you would love to to be on the on the Bear would have rode for us. Yeah, he would have wrote for us. Yeah. God forbid. Yeah. Yeah. He wouldn't know. But yeah, we had an",
            "start": 93.52
        },
        {
            "text": "he was watching. Bear, I knew you would love to to be on the on the Bear would have rode for us. Yeah, he would have wrote for us. Yeah. God forbid. Yeah. Yeah. He wouldn't know. But yeah, we had an amazing You guys come off literally help fix the stream. I literally see you guys before Friday. Mhm. And you're friends. Okay. After the weekend, you're brothers. Monday, we're brothers. Monday, you're brothers. Monday, we're back. It's like he never bought a yard. It's like the That's how back relationship. It's Mike picking up Roger whether Roger wants to get in the car or not. It's Mike with the with the 4erunner Uber just just showing up at the house and blocking his exit until Roger runs through. I was unblocked from him. That was great. Unblocked on the phone. It was a big deal, too. So, I'm looking forward to this, right? I'm looking forward to hanging out with Mike on Tuesday. Uh what is it? What? Yeah, Tuesday. Uh uh to see what this new burgeoning relationship looks like. And",
            "start": 130.8
        },
        {
            "text": "So, I'm looking forward to this, right? I'm looking forward to hanging out with Mike on Tuesday. Uh what is it? What? Yeah, Tuesday. Uh uh to see what this new burgeoning relationship looks like. And then Roger had to big time. I didn't big time him. There was a big- time moment that happened. Yeah. And I'm thinking executive decision. An executive decision made and a Venmo request still requested. I canceled the Venmo request. He still sent it to me now. Still sent it though. He still sent it to me. That is what it is. Okay. I'm thinking to myself, they can recover, right? This is just one rift in this brotherhood. Brothers fight sometimes. It happens, right? I used to get in fist fights with my brother every once in a while. Mom used to get really pissed off and just throw [ __ ] at us. I'm like, Elena, you're not helping. You're just throwing [ __ ] into the chaos. Right? Like when a wooden spoon hits me, I get more more mad, not less mad. Yeah, everything's fine. We've we've we've",
            "start": 175.04
        },
        {
            "text": "I'm like, Elena, you're not helping. You're just throwing [ __ ] into the chaos. Right? Like when a wooden spoon hits me, I get more more mad, not less mad. Yeah, everything's fine. We've we've we've figured it out by the end of the day. And it somehow works out that the last three people in the office are me, Mike, and Ryan. Incredible. The boys. Now the boys just together. Great day. Great meeting at We're highing. We're talking about the the sequel stream potentially. We're just high. It's a vibe. We did a post more. We did pros and cons. We did some pain points. We did some some some great points. all that stuff. Great. Just 10 out of 10. Very professional. And I'm feeling great, right? I'm like, I'm going to go home, maybe do a little workout, maybe play a little game. This is going to be great, right? Surely the team, these guys I rely on, there's not going to be another like wedge thrown. Yeah. To widen the gap between them. And then we start walking out and I look down and",
            "start": 215.92
        },
        {
            "text": "to be great, right? Surely the team, these guys I rely on, there's not going to be another like wedge thrown. Yeah. To widen the gap between them. And then we start walking out and I look down and right right by the exit there's a bunch of stuff. Now Tim, you know me. Mhm. Whenever there's a bunch of stuff gets upight, I get up tight. Get upight. So of course I have to say something to me. Hey, what is this stuff? Does anyone know what this stuff is? And then you reminded me cuz that stuff was actually mine. I was going to bring it home. Um, Greg got sent uh through Towerorn and Xbox a uh Love Sack. Um, I think it's Yeah, from Loveack Super Sack, I think it's called. Superack. Yeah, Super Sack. Uh, it's this massive bean bag. And Greg got it sent. He's like, \"Hey, who wants it in the office?\" And then I looked at Greg and I looked around at the office. I said, \"If anyone doesn't want it, I would love to take it.\" Leanza, I when I was in the office on um Monday, I need to pick up",
            "start": 258.32
        },
        {
            "text": "office?\" And then I looked at Greg and I looked around at the office. I said, \"If anyone doesn't want it, I would love to take it.\" Leanza, I when I was in the office on um Monday, I need to pick up something. I looked at it and I told Lenza and she was like, \"Oh, that sounds awesome. I would love that.\" I said, \"Yeah, I would love to take it.\" Craig says, \"It's all yours, buddy. You take it home then.\" I'm like, \"Awesome.\" I go, \"Great.\" Well, real quick, uh Mr. I'm getting glare. I can't see that pit. Says, \"Aren't those like $3,000?\" Yes. Very expensive. These are very expensive sacks. This is like $1,400. Yeah, it's a big sack. It's a very expensive sack. It's It was I don't know if it was that big sack, but it was It is. It's It's huge. It's a big sack. It's huge. It's super sack. Not as big as the super duper sack, but this is the super sack. And we're walking it out and Roger goes, \"Love sack.\" And I'm just thinking, \"Great. Get it out of the office.\" Right? Cuz I can't I can",
            "start": 302.72
        },
        {
            "text": "as big as the super duper sack, but this is the super sack. And we're walking it out and Roger goes, \"Love sack.\" And I'm just thinking, \"Great. Get it out of the office.\" Right? Cuz I can't I can envision that thing sitting over in the corner collecting dust and and and Mike or Kevin sleeping on it at one point and it just being disgusting and having a smell factor to it. So, I'm just trying to get this thing out of the office, but I'm noticing there's two other boxes that come with this. One's an ottoman and one is a box that has a cover to this love sack. All the Xbox brand you can imagine, Tim. Mhm. And Mike goes, \"Wait.\" Mike goes, \"Wait, this is a an Xbox branded love sack.\" And Roger goes, \"Hey, wait the perfect beat.\" Because he realizes he's been God. Yeah. He realizes that this is strike two, right? that that he should have given this to Mike as especially since that that day's past trans transgression would dictate the primmaa of you have to then give him yes you have to",
            "start": 335.92
        },
        {
            "text": "is strike two, right? that that he should have given this to Mike as especially since that that day's past trans transgression would dictate the primmaa of you have to then give him yes you have to give him something in return because you didn't get him the thing that you have my good side is right I got your shirt and Tim just set it up for you on my side of things okay walk in the morning notice this beautiful Xbox branded postage box and I'm thinking man my name should be on that Greg Miller's name's on Okay. You know, and that's the most thing. Doesn't say a word. Doesn't ask a question. Doesn't think about the fact that Greg gets sent things all the time that aren't for him necessarily. Put the Put the team on my back. Right. Games Daily with Gary writing a stream with my main man Nick. Putting the team on my back somehow. Well, Mike's got the team on his back with Baron and Gary. Shout out to you. You have the team on your back. Okay. Roger out here. Who's taking this giant Xbox",
            "start": 378.24
        },
        {
            "text": "Putting the team on my back somehow. Well, Mike's got the team on his back with Baron and Gary. Shout out to you. You have the team on your back. Okay. Roger out here. Who's taking this giant Xbox love stand? Ask my question when there's no one in the office. Ask in the water. Here's here's the thing that you need to understand, Mike. You walk in, you look at this thing, you don't say [ __ ] That's all you have to do is say [ __ ] because he's got to accept it first. We get your mind, Mike. Yeah. Yeah. Very aggressive knock on the door. Cool. Greg wasn't there to help. So, guess who has to [ __ ] stand up? Guess who has to do manual labor? thing. I should have the [ __ ] love sack. All right. You should have to open the door. I have to pull this thing in. Roger. It's heavy as hell. I don't know how you're going to get it to your house. So, well, that was strike three. That was strike three. So, I'm just setting up how I feel, right? Because now their emotions are going of like, okay,",
            "start": 426.96
        },
        {
            "text": "know how you're going to get it to your house. So, well, that was strike three. That was strike three. So, I'm just setting up how I feel, right? Because now their emotions are going of like, okay, well, there's an Xbox thing here. I want that. You know what I mean? Like, shout out. And so, you only want the Xbox. You don't want the love. What he said was, I quote, I'm the Xbox guy. I don't care that Tim canled XCast. I'm the Xbox guy in this office. I should have the Xbox themed merch. And Roger immediately realizes he's made a mistake. This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures.",
            "start": 469.28
        },
        {
            "text": "company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys, who rocks his shady rays every day, going on Pokémon Go walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-f free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support. Exclusively for our listeners, Shadyra is giving out their best deal. Head to shadyra.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com, promo code funny. This episode is brought to you by Auraframes. Every day we're taking photos from big events to silly moments. But doesn't it sometimes",
            "start": 517.12
        },
        {
            "text": "by over 300,000 people. That's shady.com, promo code funny. This episode is brought to you by Auraframes. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Aura frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift",
            "start": 560.72
        },
        {
            "text": "photos and videos and invite as many people as you want to an Aura frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aframes.com to get $20 off plus free shipping on their bestselling Carver matte frame. That's afra. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower",
            "start": 602.72
        },
        {
            "text": "were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts, and then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunn today. That's rocketmoney.com/kindfunn. Rocketmoney.com/kindfunn. And then what does he do to me, Tim? Oh, pick up the handle and carry it out. You know what happened? That's not what happened. No, what happened was this. Roger goes, Roger",
            "start": 646.16
        },
        {
            "text": "Rocketmoney.com/kindfunn. And then what does he do to me, Tim? Oh, pick up the handle and carry it out. You know what happened? That's not what happened. No, what happened was this. Roger goes, Roger goes, Roger goes, \"Okay, guys, I'm just going to take this stuff to my car.\" And I look and Roger starts doing the thing you do when you walk into a Target for one thing, but you actually need 10 things and you should have got the basket and you should have got your friends to help. He starts collecting this [ __ ] in his arms and this love sack is like a solid 70 or 80 lb of packed in love. And so I go, \"Mike, we got to be cool. Let's just just grab an end of this thing and help me carry this.\" It's got [ __ ] handles on it. That's how heavy this thing is. Mike picks this thing up and as he realizes the weight both literally and metaphorically of what's happening, he lets out a gutter. I love you so much, Roger. I love you. I love you so much. That's how you know he's mad. And then we",
            "start": 690.08
        },
        {
            "text": "realizes the weight both literally and metaphorically of what's happening, he lets out a gutter. I love you so much, Roger. I love you. I love you so much. That's how you know he's mad. And then we walk out to the car. He can't even fit it in the car. Can't get in his car. He can't even fit in the car, Tim. I left as these two were laughing and screaming at each other and I just drove out into the sunset cuz I knew this was going to be an ongoing joke for the rest of our lives. Roger stole Mike's love sack. I just wanna I just want to clear up a few points. One, I did not expect them to carry this [ __ ] thing. I was going to do it myself. The How are you gonna get that thing out of It's amazing. I was going to do multiple trips. Were you going to drag it? I was going to bring all my [ __ ] to the sack. I was going to do multiple [ __ ] trips because love. You know why I know how that I can move it? Cuz I brought it home yesterday. I carried it up my up my stairs by myself. Brought it",
            "start": 728.96
        },
        {
            "text": "to the sack. I was going to do multiple [ __ ] trips because love. You know why I know how that I can move it? Cuz I brought it home yesterday. I carried it up my up my stairs by myself. Brought it into the house, opened it up, looked at it, and I had multiple multiple situations that I learned as soon as I looked at it. One, this thing is [ __ ] massive. I have a small little apartment and we start measuring. Nothing's fitting. This is not going to fit. We're going to have to throw away this cat tree. This poor cat's going to have to live on the street. The cat tree's got a love sack now. Enjoy a cat. If we get a love sack, this [ __ ] cat's gone. Okay, so that's tough, right? Even if we do fit it. There's another thing that I learned and I realized Mike will never forgive me for the rest of his [ __ ] life. He will always be snow [ __ ] Mitch to me for the rest of his life if I don't give him if he doesn't if I don't if I don't give into his tantrum right now and bring this thing",
            "start": 769.36
        },
        {
            "text": "of his [ __ ] life. He will always be snow [ __ ] Mitch to me for the rest of his life if I don't give him if he doesn't if I don't if I don't give into his tantrum right now and bring this thing back and you better give him that candy. Yeah. And then and then so I open it up. I don't even take it out of the [ __ ] thing. I open up. I look at it and I say if I take it out it's going to inflate and then I and then it's going to be a nightmare. So I just open it up and I just leave it and I call Mike immediately. I know. I gave the phone to Leansza because he I don't want to deal with this. No I don't want to [ __ ] deal with this because he put it on Leansza too. He was like, \"If Lanza likes it, if Lanza likes it, you keep it.\" And he gets all tight. He looks at me. He says, \"But if she doesn't, I'm there at your house in 5 minutes.\" So, I give the phone to Lance. I'm like, \"You break the news to him.\" Okay. She She says, \"Mike, we thought about it.\" And she really hams it up. She's",
            "start": 808.4
        },
        {
            "text": "doesn't, I'm there at your house in 5 minutes.\" So, I give the phone to Lance. I'm like, \"You break the news to him.\" Okay. She She says, \"Mike, we thought about it.\" And she really hams it up. She's great. I love her so much. She hands it up and she's like, \"We don't want it.\" And then Mike just immediately goes, \"Oh, you sure?\" \"No, no, keep it.\" I'm good at that. I'm good at that. You're good at such You're an [ __ ] Think about it. Think about it. Sleep on it. Don't check. for real. No, it's going to let it's going to leave people in their house. You need it. You need this. Come on. Cuz I know him. He's thinking about it and he's like, I can I can just [ __ ] just think about this for the rest of my life. I have journal entries for the next 10 years. Journal entries. Tim, there's going to be a whole chapter called the love sack. During the weekend, we ordered food for dinner and we had Denny's. And I looked at Roger and I said, \"If this Denny's order doesn't have syrup on it, I'm",
            "start": 844.08
        },
        {
            "text": "to be a whole chapter called the love sack. During the weekend, we ordered food for dinner and we had Denny's. And I looked at Roger and I said, \"If this Denny's order doesn't have syrup on it, I'm throwing the biggest temper tantrum. I'm whipping pancakes at the wall. And Roger now gets on the Door Dash app and is live texting the guy like, \"Please God, bring the syrup.\" Yeah. Cuz he knew it was gonna go. Yeah. And then I I hid the syrup as a joke and then he got scared. Um but whatever. So then I brought this [ __ ] love sack back downstairs by myself. Threw it in the yards and it's in my trunk right now waiting for you. So yeah, you're going to take it. I need the update. Yeah. Do you want this love sack? Hell yeah. I can't wait. Oh yeah, I can't wait. No, because he looked at me. He said, \"Even if you keep the love sack, you give me the cover. I I'll wear the cover for as as a blanket or a t-sh Oh, yeah. Yeah. I'll wear I'll wear the the Xbox cover as a t-shirt uh to represent the",
            "start": 884.8
        },
        {
            "text": "\"Even if you keep the love sack, you give me the cover. I I'll wear the cover for as as a blanket or a t-sh Oh, yeah. Yeah. I'll wear I'll wear the the Xbox cover as a t-shirt uh to represent the shirt that you never got me.\" Now, you know, you realize, of course, that Mike has it's a win-win for Mike cuz now he gets the love sack, but he also gets to be salty for the rest of his life that you didn't immediately give him the love sack. He had to he had to accept the the the, you know, the sloppy seconds of the love sack. Once you didn't want it anymore and now Mike's giving this thing a home like it's a rehoused dog. It's in the journal. It's all in the journal. So Mike, you're going to get this in your house. Roger immediately realizes this is not for my house. Is it for your house? Oh yeah, I can't wait. Well yeah, it's for his house. Yeah, I can't wait. He's got empty He's got empty room. He wants an N64. Empty room. An N64. Yeah. No, N64 table is what he wants. I want that N64",
            "start": 926.72
        },
        {
            "text": "yeah, I can't wait. Well yeah, it's for his house. Yeah, I can't wait. He's got empty He's got empty room. He wants an N64. Empty room. An N64. Yeah. No, N64 table is what he wants. I want that N64 that were lowballing that guy. We were going to break him. He was having Leansza message a guy on Facebook Marketplace that was selling an N64 table. And she would he would message her and be like, \"Hey, I can only do 220. Tell him that.\" And then she would go, \"I can only do 220.\" And then she would screech out the response and send it to him. And then they would go back and forth like that. He's asking for 400. I say, \"We're going to lowball this guy. Tell him 200.\" Guy goes, \"Absolutely not. 350 Lois. I go, \"Let's get him again. Tell him we'll be there tonight.\" 225. Guy goes, \"Absolutely, Leanza, your go-between.\" Well, we having fun. No, she is. And that's the funny thing is that Leanza looked at Mike and said, \"I want this thing.\" I don't think there's He would either have to turn",
            "start": 969.12
        },
        {
            "text": "Leanza, your go-between.\" Well, we having fun. No, she is. And that's the funny thing is that Leanza looked at Mike and said, \"I want this thing.\" I don't think there's He would either have to turn heel on Leonza, which he would never do cuz he loves her too much. And they share they share the the inner goblin where they love pure good where they love candy and inner goblin. Yeah. Coach Mike, gym cats. Coach Mike ruined her life. I live with that. Broke her ankle. I live. He broke her ankle technically, which is crazy because you think if you if you broke someone's ankle, you should give them a free love sack. Yeah, exactly. And you would also think that like if you broke someone's ankle, like you you would just be, you know, give me a freebie for that. Just give me one. Yeah, I live with that. Or just let me be mad at you for once. But no. Well everybody, um, stay tuned here to kind of funny for the ongoing shenanigans and lore of Snowike Mike and Roger, their love. We're gonna make",
            "start": 1017.28
        },
        {
            "text": "that. Or just let me be mad at you for once. But no. Well everybody, um, stay tuned here to kind of funny for the ongoing shenanigans and lore of Snowike Mike and Roger, their love. We're gonna make it up. We're gonna figure it out on the remix. We're gonna figure it out. We're going to figure it out by the second stream. Oh man, how far will they walk? We'll have to wait and see. Uh, let us know in the comments below if you're still interested in checking out FBC Fire Break. And I know a lot of people are asking in the live chat, where is the Superman reaction? We are about to record it, but we can't do it live. It'll post as soon as we can get it up afterwards because uh the studios have been taking down our live trailer reactions and we got to be careful because uh we got too many strikes going on. We don't want to get Mr. Bucketed if you know what I mean. Exactly. Otherwise, uh we will be doing stuff live still. We have uh Mike and Nick playing Escape from Tarov. If you're on",
            "start": 1056.72
        },
        {
            "text": "strikes going on. We don't want to get Mr. Bucketed if you know what I mean. Exactly. Otherwise, uh we will be doing stuff live still. We have uh Mike and Nick playing Escape from Tarov. If you're on Twitch, stay where you are. If you're on YouTube, make the jump over to the other video. But until next time, love your sacks. Yeah. Or Roger Sack.",
            "start": 1097.44
        }
    ]
}