{
    "id": 14014,
    "video_id": "CuNn6f4fKSU",
    "show_name": "Highlights",
    "hosts": [
        "Tim Gettys",
        "Jeff Grubb"
    ],
    "title": "Everybody LOVES Expedition 33",
    "description": "From KFGD: https://www.youtube.com/watch?v=0OBQz9vNGVE Wishlist Now!\nEmpyreal Steam Page - https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299\nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1746221809,
    "duration": 879,
    "transcript_chunks": [
        {
            "text": "Let's get to story number three here. We love expedition 33 and so does the president of France. This comes from Chris Skullion at VGC News. French President Emmanuel Macarron has praised Clare Obscure Expedition 33 for its success. The game's official Instagram page posted a bilingual message on Thursday thanking players and referring to the game's French heritage. What a crazy week. Thank you to everyone. It's been 7 days since we launched Clare Obscure Expedition 33. What a pleasure it's been to see players from all over the world experiencing the game. We hope you've we hope you enjoyed spotting the nods to our home country throughout. We're proud to share this adventure with you. Uh so subtle. I'm sorry. I mean interrupt the subtle nods to France. Sorry. I'm sorry. Keep going. That's hilarious. Uh Mac would reply to the post from his own official Instagram account praising the studio for hitting the million sales milestone so quickly. 1 million copies sold and currently one of the",
            "start": 0.08
        },
        {
            "text": "Uh Mac would reply to the post from his own official Instagram account praising the studio for hitting the million sales milestone so quickly. 1 million copies sold and currently one of the highest rated games in history. And yes, it's French. Uh congratulations to Sandfall Interactive and all the creators of Expedition 33. your shining example of French audacity and creativity. Uh the game was released on April 24th, has enjoyed widespread critical appeal with a Metacritic score currently standing at 93. Uh the game sold more than 500,000 copies in its first 24 hours and 2 days later past the million units shipped milestone. This number doesn't even take into account any of the Game Pass stuff. Jeff, are you playing Expedition? I am. And uh I was I played the the preview build that they sent out a few months ago and immediately I was like, \"Yep, yep. This is it. This is people are going to lose their minds for this game. It is one of the reasons why when all the uh sort of concern",
            "start": 41.76
        },
        {
            "text": "sent out a few months ago and immediately I was like, \"Yep, yep. This is it. This is people are going to lose their minds for this game. It is one of the reasons why when all the uh sort of concern around Oblivion launching, they're like, \"This is going to bury this game.\" I'm like, \"Don't worry, y'all. It's going to be awesome. It's going to be it's going to be fine. Just fine. In fact, it's going to break through.\" I was like, \"It'll sell a million copies in two weeks.\" Took a day or something like that for it hit a million copies. um it just has the juice. It is a game that fully understands what it is, what it like and then when it understood what it is like and we know how to get the most out of that. Uh the the combat is so exquisitly designed. Everything flows into everything else. Everything pops off the screen. Everything feels so good to do. And I mean everything. And it's like I'm so excited to just get back into combat. And then it turns out great story, great writing,",
            "start": 82.88
        },
        {
            "text": "Everything pops off the screen. Everything feels so good to do. And I mean everything. And it's like I'm so excited to just get back into combat. And then it turns out great story, great writing, great performances, a really great look. All of the overt Frenchness, the franophileness of it, you know, it's I guess it's not franophile if they're actually French. So, the overt like proud heritage that they put into their game is also fantastic. It like I'm like I can't wait to see what they're going to do next. Oh my god, Amime, are you serious? It's so so cool to see this game really find an audience. And I think it's um the kind of thing that expands the genre. I think that there is uh you know the the the JRPG which you know I think I I get technically not Japanese but this is a game very much inspired by those other games so let's give it you a little bit of respect to say it's trying to be a JRPG I'm going to call it a JRPG and the fact that they can be like okay we're going to do",
            "start": 123.76
        },
        {
            "text": "much inspired by those other games so let's give it you a little bit of respect to say it's trying to be a JRPG I'm going to call it a JRPG and the fact that they can be like okay we're going to do that but we're going to do it in our own way I think it's going to open a lot of people's eyes to be like oh I do like this what why was I so standoff standoffish with this genre before and I think it's going to open the eyes of the people that have been working in that space for a long time. I think they're going to feel more emboldened to make games that have a different vibe and a different flavor. It really is just a singular game. It's special, man. I I'm making my way through it and I am at every twist and turn just enthralled. I I haven't felt this way about a new video game world in such a long time. Like, I'm a big franchise guy. I love sequels. I love going back to things I'm familiar with. Like, uh, but being this into something and wanting to live in it and wanting so much more",
            "start": 166.4
        },
        {
            "text": "a long time. Like, I'm a big franchise guy. I love sequels. I love going back to things I'm familiar with. Like, uh, but being this into something and wanting to live in it and wanting so much more of it, like, it's truly special. And I keep seeing people talk about that have beat it, saying that it feels generational and it feels like this is going to be uh my friend Professor Noctis on on Twitter was saying that he thinks that this is going to be the Final Fantasy 7 to a new generation. And I buy it, man. Like there's something about these characters and the gameplay and just the story too about the game being made like the the the team and their passion and the price point. Like they just kind of nailed everything about this game. And I I'm so damn impressed by that. And going back to the the French stuff, um I love the style of this game. Like the the out there's a swag to this game that I've never experienced in any other medium, honestly. Like I didn't know that the French had",
            "start": 206.0
        },
        {
            "text": "the the French stuff, um I love the style of this game. Like the the out there's a swag to this game that I've never experienced in any other medium, honestly. Like I didn't know that the French had it like this. Yeah. Right. Yeah. I'm sorry. I wasn't familiar with your game, France. Like for real. Um it it is it's it's all that, right? And it's um I think it's a wake-up call that while we are having all these conversations about what is the future of games and can these publishers that are massive make this make sense? Ubisoft employs you know 14,000 people plus and they make more like less money than they've made in a very long time. This thing is just waiting to implode. What's going to happen to these big games that we expect from these big companies? And it's like look the reality has changed on the ground. the the engines are there and they are they're mature and and people know how to work with them and they can get more out of them than they've ever gotten before. the",
            "start": 252.16
        },
        {
            "text": "has changed on the ground. the the engines are there and they are they're mature and and people know how to work with them and they can get more out of them than they've ever gotten before. the democratization of the tools has happened and now there are several genres where we've seen uh this happen where they go away and then indie teams or smaller teams or or you know just nothing compared to the 500 600 to a,000 people that make a Ubisoft game or whatever these smaller teams can enter these genres and plant their flag and say we're doing this now we don't need the biggest teams in the world to do it and it's this this breath of of fresh air it's this relief of Oh, these games aren't going to go away. They're just going to come from the bottom instead of from the instead of from the top. Yeah. And that's like, oh, I'm my hobby is safe. We're good here. They're charging less money than than for uh games that should be, you know, that should be this price. They're actually hitting",
            "start": 300.4
        },
        {
            "text": "top. Yeah. And that's like, oh, I'm my hobby is safe. We're good here. They're charging less money than than for uh games that should be, you know, that should be this price. They're actually hitting this price. Yeah. And it's on Game Pass, right? It's just got everything going for it. And it's um Yeah, I think it's going to be special long term. We're going to look back at this as a moment in gaming. Yep. I I totally agree. And it's there's something about it too that it it's all of the elements lined up, but it all comes back to this is a game made by people for people. Those people are specific. There's they knew who their audience was and they made something for those people. And that works. Surprise, surprise. Like it it's so cool to see that uh that they pulled it off because like even uh my my best friend who plays uh a lot of video games, but usually it's just Spider-Man 2, The Last of Us or whatever and otherwise he's more old school of a gamer. We grew up playing Final",
            "start": 343.2
        },
        {
            "text": "even uh my my best friend who plays uh a lot of video games, but usually it's just Spider-Man 2, The Last of Us or whatever and otherwise he's more old school of a gamer. We grew up playing Final Fantasies together like seven and 10 and all that. And uh I got a couple hours into this game and I was like he needs to play this. And I literally just I sent him a code and I was like you need just boot it up. I don't want to tell you anything. you're going to love this. And he's farther than I am now. Like he's been addicted the last couple days and I'm like they they got it. You know what I mean? Like they and he's not somebody that is necessarily willing to just try a random game he knows nothing about. But like from the jump it was clear that this game had the stuff. Yep. Yeah. And uh people in chat point out this game got a lot of help from outside studios. And that's that's true. But that's that's true of like big teams as well. like the when you read the credits of something like oh",
            "start": 385.92
        },
        {
            "text": "in chat point out this game got a lot of help from outside studios. And that's that's true. But that's that's true of like big teams as well. like the when you read the credits of something like oh a thousand people working on this game then you'll get to the point where like and also we got help from this studio and and that's an external team like that happens on every game of every size so it's like still working with a core team of around 30 people and then getting contractual help from the outside it's still a very different thing than absolutely you know a thousand plus people working on a game on like from that that are all employed by by Ubisoft yeah I'm super impressed by this uh Mikey Mog says as someone who has only played Pokemon for turn-based combat. I love Expedition 33. I can't stop thinking about it when I'm not playing. Hell yeah. Dolphin Corn says, \"Uh uh, Expedition 33 is my favorite game of all time now. I love it.\" And like that's that's wild. But I mean, I also",
            "start": 430.0
        },
        {
            "text": "can't stop thinking about it when I'm not playing. Hell yeah. Dolphin Corn says, \"Uh uh, Expedition 33 is my favorite game of all time now. I love it.\" And like that's that's wild. But I mean, I also am not going to be surprised if years from now, you're not alone, Dolphin Corn. I do think this game is going to hit like that for for people. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using",
            "start": 468.32
        },
        {
            "text": "with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardigrams to explore by looting defeated enemies, or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder cardigrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses, and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox",
            "start": 510.48
        },
        {
            "text": "Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wish list now. It helps so much. Wishlist Imperial. This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond, beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura frames. It takes about 2 minutes to set up the frame using the Aura app. Aura Frames",
            "start": 554.72
        },
        {
            "text": "so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura frames. It takes about 2 minutes to set up the frame using the Aura app. Aura Frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's a rafra.com. Promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. Uh, story number four. Did PlayStation fire Sack Boy? We have to get to the bottom of this. This comes from Vicky Blake at IGN. He works for me now. PlayStation seemingly pulling its one-time poster child Sack Boy from its marketing materials. As noticed, as noted by Real Radic, Sack Boy was notably absent from the PlayStation Productions banner at the start of the Until Dawn",
            "start": 602.48
        },
        {
            "text": "its one-time poster child Sack Boy from its marketing materials. As noticed, as noted by Real Radic, Sack Boy was notably absent from the PlayStation Productions banner at the start of the Until Dawn movie. Although most of his peers like Astrobot, Nathan Drake, and Aloy still have a place. I can confirm after seeing Until Dawn that Sack Boy is not in the PlayStation Productions intro anymore. I don't like this era of Sack Boy eraser. Uh once upon a time, Sack Boy was the golden child of PlayStation, becoming a mascot for the brand in much the same way Sonic is associated with Sega and Mario represents Nintendo. I wouldn't go that far, but I appreciate the sentiment. Uh, now, however, Sack Boy hasn't starred in a PlayStation game since 2020 is delightful. Sack Boy, A Big Adventure. Uh, I would agree that that game was delightful. He's not Sack Boy anymore. He's Sad Boy now, teased another. While others lamented, \"Why can't Astrobot and Sack Boy coexist?\" Others had a more measured",
            "start": 649.04
        },
        {
            "text": "I would agree that that game was delightful. He's not Sack Boy anymore. He's Sad Boy now, teased another. While others lamented, \"Why can't Astrobot and Sack Boy coexist?\" Others had a more measured reaction. Sack Boy being erased from the PlayStation Productions logo does not mean anything. DreamWorks also swaps out characters in their logo montage sometimes, said another Jeff. Yeah. What do you think? I mean I they are deemphasizing Sack Boy for sure. I mean that's uh the studio media molecule, right? They they I can't remember the exact fate of him, but they are they still going concern or they're still going. I can't. Right. But yeah, there was still Right. They had Right. Okay. The Dreams is done and I think that there is no evidence that they are like All right. And that's because we're returning back to Little Bigplet or Sack Boy or anything like that. So yeah, I think they have maybe moved on a little bit. And that doesn't mean Sack Boy is like done for good or fired or and",
            "start": 690.56
        },
        {
            "text": "we're returning back to Little Bigplet or Sack Boy or anything like that. So yeah, I think they have maybe moved on a little bit. And that doesn't mean Sack Boy is like done for good or fired or and never coming back. Will never show up again. I mean, it was in Astro. Um and Sumo Digital did um the most recent game, so it's not like it has to be Media Molecule to to make a Sack Boy game. Ex a good point as well. Yes, they there is they found ways to bring Sack Boy back even without Media Molecule. But um I just don't think that that is what PlayStation is right now. they are a different company like they are focused on uh more mature games, more broadly appealing games in their opinion and um I think Sack Boy just doesn't necessarily factor into that. Again, that doesn't mean that they're going to toss them out. It just means like when they're building a when they're spending money building an intro and they got what to pick the characters they're going to put in there. I think Sack",
            "start": 732.64
        },
        {
            "text": "going to toss them out. It just means like when they're building a when they're spending money building an intro and they got what to pick the characters they're going to put in there. I think Sack Boy is in like that lower tier now. I think that's all that means. Yeah, I know this is probably not going to be a popular opinion, but good [ __ ] riddens. I don't give a [ __ ] about this little sack. Never liked him, never will. Enjoy Little Bigplet. Really enjoyed uh the big adventure game, but at the end of the day, nah nah nah nah. Is this is this your like you also don't like the Astro Boy Astrobot design, right? I just don't I just think the design is generic for Astrobot. It's a separate thing when it comes to to No, the Sack Boy. It's just like it's just I don't know. I just don't like him. Doesn't do anything for you. I trust him. Yeah. Okay. I wouldn't let him around my wife. Like it's it's a whole thing, man. Like Yeah, you're right. I wouldn't ask him to watch my laptop at a",
            "start": 776.56
        },
        {
            "text": "him. Doesn't do anything for you. I trust him. Yeah. Okay. I wouldn't let him around my wife. Like it's it's a whole thing, man. Like Yeah, you're right. I wouldn't ask him to watch my laptop at a coffee shop. You're right. I would like Sack Boy, please. No, thank you. Um my kids love Sack Boy. They that big adventure game. They uh love that. They love dressing them up. So my one kid thought thought he's a me and like wanted me to get a Sack Boy doll and all this stuff. So there is some love for Sack Boy in this house. And I appreciate that. Just not in this house. Not for me. Oh yeah. I was never a Little Bigplet guy. So uh I'm I'm all right with this too. You It's weird how they excuse me how they decide this. There was um like a a banner that they would have on the PlayStation website like a couple years ago, long after Bloodborne was uh came out and it was like deep into the hey, they should do something with Bloodborne. And they put the the hunter from Bloodborne back into that",
            "start": 815.12
        },
        {
            "text": "like a couple years ago, long after Bloodborne was uh came out and it was like deep into the hey, they should do something with Bloodborne. And they put the the hunter from Bloodborne back into that image at one point. It's like are you doing something with Bloodborne? I'm like I knew they weren't doing anything with Bloodborne. Like this is weird. But it's like well they still want people to know we're the Bloodborne company. Uh, and I just think it's like, oh, well, Sack Boy, I don't think they care if people consider them the Sack Boy company anymore.",
            "start": 852.56
        }
    ]
}