{
    "id": 14039,
    "video_id": "eGUG_bnnRVw",
    "show_name": "Screencast",
    "hosts": [
        "Barrett Courtney",
        "Anthony Carboni",
        "Saige Ryan"
    ],
    "title": "Star Wars Andor Season 2 SPOILERCAST Episodes 7-9",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746824671,
    "duration": 4743,
    "transcript_chunks": [
        {
            "text": "[Music] Let's tear the [ __ ] out of this place. What's going on everybody? Welcome back to another episode of the Kind of Funny Screencast, your home for all of the TV and streaming show convos you could want and or need here at Kind of Funny. The Star Wars crew is back today to talk about Andor season 2, episode 7 through 9. And to do just that, we are finally joined by our rebel spy who has returned from his recent mission at Star Wars Celebration in Japan. It is one Anthony Carboni. Hello. It is wonderful to be back. It is wonderful to be back with these penultimate episodes of the show where ba baby I don't know. I'm starting to think that Andor is a good Star War. Yeah. You think so? I don't know if I don't know if y'all I don't know what y'all think, but I'm st I don't want to you know it might be a little too early to say that honestly. Only three episodes left. I don't know. I think this might be a good Star War. Carboni, how have you been? How was Star Wars Celebration? We",
            "start": 6.43
        },
        {
            "text": "know it might be a little too early to say that honestly. Only three episodes left. I don't know. I think this might be a good Star War. Carboni, how have you been? How was Star Wars Celebration? We have missed you. It's crazy that we are three4s of the way through the show already and we're just finally getting you. Oh man, it was absolutely wonderful. uh maybe one of the best events we've ever had at Star Wars Celebration in in my 10 years of doing it. And uh it was lovely to be in Japan for a little bit of time afterwards. It was lovely to uh to walk amongst the forests on the philosophers's path and really just really just think about Gorman, you know, look at the beautiful temples and be in the woods and in the forest and surrounded by all this nature and be like, \"What about Gorman?\" Yeah. What's going to happen on Gorman? Yeah. Um, no, it was it was wonderful. It was wonderful. I missed uh I missed being here with y'all and I'm excited to catch up. We miss you as well. Um,",
            "start": 58.08
        },
        {
            "text": "Yeah. What's going to happen on Gorman? Yeah. Um, no, it was it was wonderful. It was wonderful. I missed uh I missed being here with y'all and I'm excited to catch up. We miss you as well. Um, yeah, I'm very excited from the the Star Wars Celebration stuff. Obviously, the big pop for me was the the Darth Maul show coming next year. Um, I don't know how yall are feeling about that. Um, I forget where you're at with the animated stuff, but yeah, I'm very very excited with that. Oh, dude. It's going to be it's going to be crazy. And it's it's so funny because uh Sam and I are are we're friendly. We're friendly outside of work, you know what I mean? And uh and it's so funny. He's just been like busy for the last year. He's just been like busy, you know what I mean? I'm like, \"What are you doing? What are you doing over there?\" Busy. Yeah. He's like, \"Yeah, what are you doing over there?\" And and then like the I think like the night before uh we started up the show, I got my schedule and",
            "start": 105.52
        },
        {
            "text": "What are you doing over there?\" Busy. Yeah. He's like, \"Yeah, what are you doing over there?\" And and then like the I think like the night before uh we started up the show, I got my schedule and I looked at the schedule and there was a big block with Sam and I just like I took a picture out. I was like, \"What are you doing? What are you doing?\" And he's like, \"Nothing, man. I'm just busy. I'm just busy. Just busy. Could be anything.\" Um and also joined with us as always is the best rebel cell leader anyone could ask for. It is Sage Ryan. Sage, how you doing today? I have I'm staring at my computer because I took so many notes during these three episodes. So, I'm thriving. These episodes were like jam-packed. I kept having to rewind and rewatch scenes cuz I just didn't want to miss any of it. Uh there will never be another time where I can rewatch those first three episodes for the first time, and I'm already sad about it. Yeah. Yeah. Same. I I meant to watch some stuff back last",
            "start": 155.52
        },
        {
            "text": "of it. Uh there will never be another time where I can rewatch those first three episodes for the first time, and I'm already sad about it. Yeah. Yeah. Same. I I meant to watch some stuff back last night, but I was I was honestly way too tired uh after uh a long week. And so cuz yeah, there there there is so much to unpack and so much to uh dive into here. So um before we get into it very quickly, uh since last week's episode, um uh it was May the 4th and with the last few years, Star Wars has dropped uh some stuff on May the 4th, uh specifically the Tales of series. Have either of you y'all caught Tales of the Underworld that dropped on Sunday? No, I have not had time. Watch the first one. Okay. Just the first episode of the first half. Just the first episode of the first half. Okay. All right. Um yeah, I I I kind of I I binged through I you know, it was a nice chill night, I think, and so I put them on. They're, you know, short eight to 15 minute episodes. uh this season kind of uh",
            "start": 202.08
        },
        {
            "text": "right. Um yeah, I I I kind of I I binged through I you know, it was a nice chill night, I think, and so I put them on. They're, you know, short eight to 15 minute episodes. uh this season kind of uh evolving around uh Assange Ventress and Cad Bane and I thought they were I thought they were fine. Um I think the I I think the premise of all of the tales of uh series have been interesting that unfortunately never like fully go anywhere truly interesting outside of Count Dooku. I think Dooku's three episodes from the very first Tales of Drop was awesome and fascinating and I think ever since then um these kind of smaller things have definitely struggled to to kind of keep me and um make me think back on them a lot. Um but I had fun with them. Uh shout out to Lane Factor who uh is in the Assange Ventress episodes. He's uh uh in Reservation Dogs. He plays uh a new buddy of Assange Ventress and I was like hell yeah. Shout out to that kid right there. Um, remember I'm a big venturous guy, so",
            "start": 253.76
        },
        {
            "text": "Ventress episodes. He's uh uh in Reservation Dogs. He plays uh a new buddy of Assange Ventress and I was like hell yeah. Shout out to that kid right there. Um, remember I'm a big venturous guy, so I I wanna I I want to get into it as soon as possible, but andor andor takes precedence. Oh, yes. Yes, it does. And with that, remember this is the kind of funny screencast we're almost each and every week. We break down the most recent episodes of the biggest shows airing. The crew will be back on Monday to talk about the upcoming episode of The Last of Us season 2. And believe it or not, will be back one last time next Friday for the finale of Andor season two. And don't fret, even though Tim Gettys went on a sbatical after his embarrassing loss and kind of funny game showdown to recover from that. He will be back next week uh to talk about the final episodes and I'm sure uh to talk about his thoughts on these episodes as well. Uh, now just one piece of housekeeping for today. You are",
            "start": 306.24
        },
        {
            "text": "that. He will be back next week uh to talk about the final episodes and I'm sure uh to talk about his thoughts on these episodes as well. Uh, now just one piece of housekeeping for today. You are about to witness history. Snow bike Mike, the most athletic man inside of his own mind, is embarking on his most daring quest yet, going step forep with Sam Porter Bridges in a literal marathon stream on a treadmill. Come join Roger and Mike today, right after this, as they attempt to do a full playthrough of Death Stranding 1 through the weekend, but they can only do it with your support. Will Mike and Roger break this treadmill and have to drive to Andy's home at 1:00 a.m. to borrow his. As someone who lives with Andy, I really hope not. Find out exclusively on Twitch right after this screencast. Uh today our uh Patreon producers are and asked uh Delaney Twining, Carl Jacobs, and Omega Buster. Today we're brought to you by Imperial, Oraf Frames, and BetterHelp, but we'll tell you about that",
            "start": 355.76
        },
        {
            "text": "Uh today our uh Patreon producers are and asked uh Delaney Twining, Carl Jacobs, and Omega Buster. Today we're brought to you by Imperial, Oraf Frames, and BetterHelp, but we'll tell you about that later. For now, Carboni, I want to start with you. Give me less than a minute what your feelings have been on the season so far and then tell me about your thoughts on the episodes that have come out this week. First of all, I want to give a shout out to the true heroes of the rebellion, the top two, the greatest to ever do it. Number one is uh is obviously Clay Marquy. Clay Marky, who I think is the real the real power behind the Axis spy network. She just crushes in these three episodes just as everybody is falling apart watching her just get more and more focused. The bit with her um bit with her trying to remove the microphone from the artifact to the point where it hurts her hand so much that it's bleeding while Luan is like while Luan and Cassian are just like crying like babies. just",
            "start": 402.8
        },
        {
            "text": "her trying to remove the microphone from the artifact to the point where it hurts her hand so much that it's bleeding while Luan is like while Luan and Cassian are just like crying like babies. just like babies. And she's like, \"No, I'll I'll bleed until this is until this gets done now.\" Everybody shut up. Uh, and the second one, big shout out to our boy behind the counter at the hotel in Gorman. Gorman Bell, let I want to say one of the things that's been really lovely to me about about this show. This is my thesis statement for these three, and we'll get into we'll get into the real stuff, but what I love is having Gorman based on the French resistance in World War II has really allowed them to do a lot of very interesting things. and the malicious compliance that we see from everybody at all levels. You know, I can't I'm not going to be somebody who shoots a sniper rifle out a window, but I can be the guy who doesn't leave a paper trail for the sniper. I'm not the person who can",
            "start": 458.24
        },
        {
            "text": "at all levels. You know, I can't I'm not going to be somebody who shoots a sniper rifle out a window, but I can be the guy who doesn't leave a paper trail for the sniper. I'm not the person who can escort the senator out of this armed building, this imperial building, but I can be the person that mysteriously fixed the locks on the broadcast room the night before that happened, right? like all of these little things that show the malicious compliance, the way people are just like, I'm going to do what I can for the rebellion at every level has been really really cool to see. Really cool to see. Uh and also just my final statement is uh I'm glad Sirill K figured out what a douchebag he was before he died. I wanted him to die knowing what a douchebag he was. Rest in peace. There was a moment of growth for for Cirill. Who are you, dude? Who are you? Who the [ __ ] are you? Uh, we'll get into I don't even know you, bro. Uh, Sage, what about yourself? How did you feel about uh these three",
            "start": 516.24
        },
        {
            "text": "of growth for for Cirill. Who are you, dude? Who are you? Who the [ __ ] are you? Uh, we'll get into I don't even know you, bro. Uh, Sage, what about yourself? How did you feel about uh these three episodes? Oh my god. I mean, it's something that like uh Anthony, you haven't been here, but that's the exact same thing that I've been saying is like it's all of these like small pieces of the Rebellion. Like, we've seen what Jedi can do for the Rebellion. We've seen what the best pilots in the galaxy can do for the Rebellion, but this is all about what everyday people do in both directions. It's about the actual compliance of everyday people that allow the empire to take hold. And it's about the people who are not heroes that did their part. The people who were nobody special that didn't have access to anything special uh that were integral pieces of why the empire collapses. Um but these three episodes like I have chills thinking about them. Um I'm so proud of the direction they went",
            "start": 568.72
        },
        {
            "text": "access to anything special uh that were integral pieces of why the empire collapses. Um but these three episodes like I have chills thinking about them. Um I'm so proud of the direction they went with this. I was waiting for a long time during these episodes for them to say the word genocide. Um, which is like an interesting thing where I was like, \"Ooh, there was like three times towards the beginning of when everything was starting where it was like, oh, they could have said it there, but they didn't.\" And when it said it was so unbelievably powerful by Mon Mothma, and that's kind of exactly the thing, right? because we talk about how many parallels there are between our current world uh and Star Wars where it was so interesting to see like nobody wanted to say it and when she got up and said it the room was a gas right like everybody was absolutely stunned. Um I think her performance in this was brilliant. The third episode was called Welcome to the Rebellion. Uh and that moment",
            "start": 613.44
        },
        {
            "text": "and said it the room was a gas right like everybody was absolutely stunned. Um I think her performance in this was brilliant. The third episode was called Welcome to the Rebellion. Uh and that moment just like will absolutely stay with me. Um, and I am so glad, yes, that uh Sirill died like the [ __ ] he is. Sorry. Wow. Uh, strong. He realized at the end. Oh. Oh. So what? No, cuz he did and he didn't, but he like attacked and like Yeah. I realized I shouldn't do a genocide, but also I still blame Andor for messing up my life and not me. He takes no responsibility until the last moment. In his last moment, he has the choice and he's makes the smallest choice possible and he dies like the smallest man possible. Yes. I do like that we get a little bit of like a hint that he and he and uh Öza or the the the rebellion the the Gorman rebellion leader's daughter, right? um who we see uh Öza or Enza, I forget, but uh we get a little bit of a a hint that maybe she and Sirill have been having a",
            "start": 656.72
        },
        {
            "text": "or the the the rebellion the the Gorman rebellion leader's daughter, right? um who we see uh Öza or Enza, I forget, but uh we get a little bit of a a hint that maybe she and Sirill have been having a thing while Dedra's been off planet and and she immediately the the way we get the hint is she slaps him because anybody who dates K knows that they got to slap him. Very slappable. Yeah, he's just the most slappable dude. But also to reference romantic relationship, Will's got hoes in different area codes. Yeah, Will. Will Will loves a blonde white lady. I Okay. Hey, he's got a type. We've all got a type. Guys, guys, maybe maybe this is problematic of me to say, but like I had to look up to be like, is that the same blonde white lady? I was like, there's no way they got her to this planet, right? It's been a year. I guess she could have cut her hair. I had to look them up to be like, that's a new blonde white lady. Are you sure? Is she just like a little older and a little, you know, has",
            "start": 711.28
        },
        {
            "text": "It's been a year. I guess she could have cut her hair. I had to look them up to be like, that's a new blonde white lady. Are you sure? Is she just like a little older and a little, you know, has a little more dirt on her face now? He's a lovely fighter. You know, Star Wars loves a brunette with a British accent. Wilman loves a blonde white lady. Y uh yeah, I I do. Sorry, Carbony. Go ahead. Uh I do love I do love Wilman in these three episodes. I love the Saw Guerrera of it all. I love the fact that we for a brief moment we were led to believe that Will was going to become like a weird RO in uh addicted extremist like Saw. Yeah. Um it's also cool to see why Sawerrera was the way Saw Guerrera was in Rogue One. You know what I mean? It's like listen Saw's always been a little a little off his rocker, but like he's got a robot leg and he's sniffing stuff. What is going on with Sawerrera? And it's cool to get that that uh that context, but it's also cool that Wilman did not go that way and",
            "start": 765.6
        },
        {
            "text": "rocker, but like he's got a robot leg and he's sniffing stuff. What is going on with Sawerrera? And it's cool to get that that uh that context, but it's also cool that Wilman did not go that way and instead became like such a bigger part of this than I think you would ever have imagined in the beginning of the show to the point where, you know, he stays behind for her. He's he's helping her. She's like, \"We can't leave until we get this message out to as many people as possible.\" Right. It's like, big ups to Wilman, man. Yeah. He uh Yeah. the last time we saw him, uh, it it definitely sparked something in him that I think woke up and made him realize even more what he needs to be doing. And yeah, I did think it was interesting that it wasn't saw uh being the answer there. And I I would be interested to see what happened in that aftermath, like what happens in between uh your three uh BBY3 and BB BBY2 here uh to see what that kind of uh that arc or uh thought process was for him. Um",
            "start": 819.36
        },
        {
            "text": "be interested to see what happened in that aftermath, like what happens in between uh your three uh BBY3 and BB BBY2 here uh to see what that kind of uh that arc or uh thought process was for him. Um cuz yeah, I was very surprised when we see him uh pop up on Yavin 4 and then uh breaking out a uh breaking up a makeout session with uh Cass and Bixs there. Uh yeah, I I really loved these three episodes. I think I'm more so fascinated by what our finale is going to look like because so much of this show has been leading to this year to the the Gorman massacre uh to the fallout of that and how that affects so many people how it affects the uh the people that we have been uh coming to know in the last couple of weeks uh on the streets of Gorman. uh how that's going to affect uh Sirill, Dedra, their relationship, how that's going to affect Andor in his willingness to keep fighting the fight, right? Um and I think a lot of this stuff has really uh crescendoed here and it is all very",
            "start": 869.28
        },
        {
            "text": "Dedra, their relationship, how that's going to affect Andor in his willingness to keep fighting the fight, right? Um and I think a lot of this stuff has really uh crescendoed here and it is all very beautifully done and just so gut punchingly tragic. Um, and a lot of things uh from this episode 8 and 9 were just kind of just like very vitriolic reminders of like Sage was saying earlier of our kind of current political climate uh current um real world tragedies that are happening right now and what that does to people on the a very human level. And um I'm very I'm fascinated where things are going to leave off in the last three episodes cuz I don't know if we can quite hit the same level of here as is seeing this massacre um kind of being uh manipulated into happening by the Empire. And then seeing the fallout of that in episode nine where we see the complacency of so many uh people with privilege and uh finally seeing someone speak out against that and then like uh Sage you were",
            "start": 924.24
        },
        {
            "text": "then seeing the fallout of that in episode nine where we see the complacency of so many uh people with privilege and uh finally seeing someone speak out against that and then like uh Sage you were saying of the kind of like the gasping in the room and the immediate yell back uh uh that people had for man even within the room, right? Um, a lot of it was just a kind of just a a really depressing reminder of where we're at. Um, and it it seeing what the the Empire is doing and also being fascinated by some of the the uh quote unquote criticism from people who are like this is what the Empire is. if uh if you're finally recognizing some parallels between the Empire and you know a real world uh uh political power and that makes you uncomfortable maybe take a take a little bit and reflect on that and reflect on why that makes you uncomfortable. Um anyways yeah you might be like 50 years late but yeah you're very it's been a long time coming I sorry Sage go ahead. No but like you know I",
            "start": 986.24
        },
        {
            "text": "that and reflect on why that makes you uncomfortable. Um anyways yeah you might be like 50 years late but yeah you're very it's been a long time coming I sorry Sage go ahead. No but like you know I guess figure it out at some point. Yeah. Yeah. uh at some point our boy serial K. Serial K. Not my boy. Not my boy. Not my boy. I do want to say the the serial Dra relationship and uh was a really there was a really powerful uh Denise Goff had a had that really powerful moment. You know, Partardiggas the entire time has been telling her. Every time she slumps a little, every time a little bit of emotion gets into her voice, you've got Partardiggas going, \"You seem animated. You seem agitated. What's going on?\" And she immediately pulls herself back in and she just can't do it. Like, she finally, that scene where she just can't do it, I think was Denise Goff um is playing such a [ __ ] rat in this show. Dedra is such a [ __ ] rat and I just love watching her play the depth of this honestly",
            "start": 1046.64
        },
        {
            "text": "that scene where she just can't do it, I think was Denise Goff um is playing such a [ __ ] rat in this show. Dedra is such a [ __ ] rat and I just love watching her play the depth of this honestly like spineless person. Yeah. Utterly starting to look like a Sith. She's starting to visibly visually look like a Sith. Yeah. She's like the way she's hollowed out 100%. I noticed that. I'm so shooting her with these like wide angle lenses. Yes. the way that she can physically frown. I don't know how she does that with her mouth. She has more muscles. She has more muscles than we do. I noticed that she's standing up there on the balcony looking over Gorman as the genocide is about to take place. And she looks over them with a such a specific scowl that I had to write down. Like Dedra is starting to there's something visually about her is starting to look like a Sith Lord. like looking like an actual Sith. And that's so scary. I'm trying to do I've been trying to do since she did it that that",
            "start": 1100.56
        },
        {
            "text": "to there's something visually about her is starting to look like a Sith Lord. like looking like an actual Sith. And that's so scary. I'm trying to do I've been trying to do since she did it that that frown. I can't do it. I literally can't. I think that the um the the two contrasting scenes between Dedra and Sirill that were really interesting is the first one, which is when Dedra like forcefully and aggressively kisses him. Yeah. Um where it's just so Yeah. It's horrible. And like I can only imagine how many times she has done that to shut him up and to make him move past like an argument or any sort of questioning of anything cuz again like I've been saying from the beginning of this season, Sirill is a pet and he will always be looked at as a pet by Dedra and his mother, right? Uh yeah. And then obviously that's but sorry it's just the that scene the way the reason why I love it so much is because yes they've probably done this a thousand times but this time you can tell she hates",
            "start": 1158.16
        },
        {
            "text": "And then obviously that's but sorry it's just the that scene the way the reason why I love it so much is because yes they've probably done this a thousand times but this time you can tell she hates doing it and he hates having it done to him. They're both disgusted by each other. Like it's the nastiest kiss. And I remember at Celebration I was like I asked them I was like what is it like being the ickiest couple in Star Wars? Like I was like, \"What is it like for the two of you to just be the ickiest, grossest couple in Star Wars?\" Star Wars, which canonically has a a couple that is like a pig man and an owl person. You know what I mean? And you're the ickiest couple. I'll raise you one better. Worst kiss. And we've seen siblings kiss. Yeah, that's right. I felt more grossed out in the moment by Sirill and Dedra kissing than the Luke and Leia kiss. They're the ickiest couple in Star Wars. And when I asked them that, they were like, \"Oh, there's a moment that we do later on in the",
            "start": 1210.4
        },
        {
            "text": "moment by Sirill and Dedra kissing than the Luke and Leia kiss. They're the ickiest couple in Star Wars. And when I asked them that, they were like, \"Oh, there's a moment that we do later on in the season and you'll see it and it's disgusting.\" And we were both grossed out and we both like we had to do it multiple times because we were so disgusted like we couldn't do it or we would start laughing or we would start just being grossed out by it. And I think it it had to be that kiss. It had to be that kiss. Yeah. Now there's a contrasting scene to this where Sirill stands up to her where he's realized what's happening and he like grabs onto and is very like physically aggressive with her and scared. Yeah. and then he ends up grabbing and choking her. Um, and it's so interesting to see the fear. There were two, this is the only thing that bothered me about these scenes, right, is I kept looking at this and being like, \"Okay, well, Dedra, you can and should kill him.\" Um, and same with",
            "start": 1260.08
        },
        {
            "text": "fear. There were two, this is the only thing that bothered me about these scenes, right, is I kept looking at this and being like, \"Okay, well, Dedra, you can and should kill him.\" Um, and same with Cassian. When he attacked Cassian, I'm like, \"There's no way this guy is getting the jump.\" Like, there's no way that this dude has ever climbed more than two flights of stairs. You know what I mean? Mhm. Like I just don't think that this dude even with this like kind of surprise because Cassian saw him when I know Cassian ended up taking him but the amount of hits that serial was able to get in I was like no way absolutely no way. I think I think the thing that we forget because they did such a good job the first six episodes of this season of um of trying to declaw and normalize Sirill in our minds. They really did a great job the first half of the season of being like, \"Oh, Sirill's finally getting what he wants and maybe he's not so angry anymore and maybe like, oh no, he's going to",
            "start": 1312.72
        },
        {
            "text": "our minds. They really did a great job the first half of the season of being like, \"Oh, Sirill's finally getting what he wants and maybe he's not so angry anymore and maybe like, oh no, he's going to realize.\" And this is something that that you know the Gilroys are very good at doing is making you forget who a character is. But we we have a tendency to forget that in the first seasonal was like serial is like an angry toddler who like when he has an actual meltdown. I don't know if you've ever been in a room with a kid who has a real meltdown and they start swinging and screaming. It's like you forget how strong a person is when they are just angry. When they are just like seeing red, no emotions but anger. Uh I do think some of the stuff you're right like some of the techniques that that Sirill and Cassian used on each other I was like serial where did you learn that Sel and if you and if you knew that technique Sirill you haven't used it in six years. How do you still remember it?",
            "start": 1366.64
        },
        {
            "text": "Sirill and Cassian used on each other I was like serial where did you learn that Sel and if you and if you knew that technique Sirill you haven't used it in six years. How do you still remember it? You know, but it the sort of the fact that serial was mostly fighting by just like trying to trying to like choke and crush Cassian and like cover his mouth and like claw at him. I I believed the fight. I believed it. Not 100%. But yeah, but I believed it a little bit. And and I I 100% believed that Dedra forgot how dangerous Cirill is because you remember be when they first met and like he was her He was her insane stalker. Yeah. Like that's how they met. Yeah. And he was like she was afraid. She was clearly very afraid in season 1 that Sirill was going to like raise hands to her. Uh and she thought that she had that totally under control. And uh no, he's a bad person and a petulant child. Yeah. Yeah. Um Yeah. And I think just to keep on serial just because you know we talked about it last",
            "start": 1421.76
        },
        {
            "text": "that she had that totally under control. And uh no, he's a bad person and a petulant child. Yeah. Yeah. Um Yeah. And I think just to keep on serial just because you know we talked about it last week of it seems like every week we're going to get a very nonchalant significant death and we were saying last week it was probably going to be Bix but uh we'll talk about Bix later but it ended up being serial this week and I I think in those last moments cuz yeah as he's walking out into the square with this massacre going on around him. I like you could see his kind of world crumbling before him. And yes, he is having this realization way too late of him just being a um a rule follower who wants to be told he's done a good job, but not realizing what he's doing that for. All of that kind of comes, you know, it's it's it's unfolding uh right before him. And I think there could have been a moment where he's like, I got to repent or do something about the evil I have just unleashed here.",
            "start": 1479.2
        },
        {
            "text": "comes, you know, it's it's it's unfolding uh right before him. And I think there could have been a moment where he's like, I got to repent or do something about the evil I have just unleashed here. Especially after talking with Carr, the uh he's the um kind of the older uh man who's like the leader of the front uh on Gorman. And Carr calls him out. He's like uh Sirill says, \"I meant you no harm.\" And Carr says, \"How dare you walk among us? How do you say that? How do you say those words? You've destroyed us. And uh Car's the first one who says like what kind of a being are you, dude? Oh, that was so good. It was so good. And I think that's like having all of that swirling around in him. There could have been something what I had been guessing since uh the first week of season 2 is that like Zero might not do the whole [ __ ] 180. Now I'm fighting for the rebellion. But I I thought that maybe Sirill after realizing what uh the events of Gorman were going to be gets an opportunity to do",
            "start": 1540.76
        },
        {
            "text": "Zero might not do the whole [ __ ] 180. Now I'm fighting for the rebellion. But I I thought that maybe Sirill after realizing what uh the events of Gorman were going to be gets an opportunity to do something okay. And Sage uh I think you ma made another like a pretty like solid guess of he would do something okay but in the most weasly childish way as he would do, right? And I think just tragically the universe put something in front of him that prevented him from doing that work in the last moments of his life. And that was the universe putting Cassie and Andor right in front of him where he's working through these emotions and then he sees this man and sees this man as the first domino into the final domino falling right before him and ruined. throws all sort of self-reflection out. And that I think that is the big um that is the big tragedy with Sirill cuz again in his actions following that up and tackling Andor preventing Andor like inadvertently preventing Andor from killing",
            "start": 1598.56
        },
        {
            "text": "And that I think that is the big um that is the big tragedy with Sirill cuz again in his actions following that up and tackling Andor preventing Andor like inadvertently preventing Andor from killing Dedra. Um yeah, him undoing all of this work that could have been could have been done and through his actions he will just be forgotten about and killed like anybody else. And before the final question he is asked before he died is who are you? Cuz Cass has no [ __ ] clue who Cel is. And it's one of those moments where you're like oh right he only kind of saw the back of Cirill's head for like 30 seconds. And that was at this point four years ago. And Sirill is stunned. He doesn't understand. He didn't consider that at all. Like the shock on his face when he says, \"Who are you?\" He starts putting down the gun. He starts putting down the blaster, too. He's like, \"What do you mean, who am I?\" Like, uh, what I think you have such a good point with like he might have been on his way to do",
            "start": 1655.84
        },
        {
            "text": "putting down the gun. He starts putting down the blaster, too. He's like, \"What do you mean, who am I?\" Like, uh, what I think you have such a good point with like he might have been on his way to do the expected thing, the expected turn and change. And I think there was such an interesting opportunity of after that conversation with Caro where he says, \"What kind of being are you?\" that I thought that Sirill was going to go and find Enza, which is of course Carl's daughter. Um, and I thought maybe he would die kind of protecting Enza, right? Like he would get in the way of the shot in some capacity and he would do something very small. He would never contribute to saving Gorman in any way, but he would redeem himself essentially just to Caro uh and just to Enza into that one family. And he couldn't even do that. Yeah, that's what I love is is we didn't get a redemption. We got a final reminder of how petty he is. And that's perfect. As a as an audience member, that is just such a",
            "start": 1709.76
        },
        {
            "text": "he couldn't even do that. Yeah, that's what I love is is we didn't get a redemption. We got a final reminder of how petty he is. And that's perfect. As a as an audience member, that is just such a perfect thing. Uh I'll tell you what, you know who had like more emotional growth, more of an arc was the uh was the dude Lazine. Lazine was the was the guy who like pops up during the first meeting that Sirill goes to and is like this is wrong and blah blah blah suspenders like and he's the guy who um who wrestles with the dude or the blaster that gets the woman killed. And uh what I love is like you see more arc in him. Yeah. Yeah. Than you see in Sirill. And that's another thing that I love about this series is is people like him and like the hotel clerk and all this stuff. They do such a good job of setting these people up and showing how these minor characters are changing and growing. Yeah. Um uh and that was just Lzine bringing like starting to sing the Gorman anthem and turning it",
            "start": 1755.04
        },
        {
            "text": "job of setting these people up and showing how these minor characters are changing and growing. Yeah. Um uh and that was just Lzine bringing like starting to sing the Gorman anthem and turning it from turning it from a justifiable Imperial attack, right, into a into an Imperial attack where they needed to call the sniper in. Yep. Uh I think was so interesting. Yeah. How often do you get to check in with those small characters years down the line? What other show do you get to do that? Yeah, exactly. Unless you're running for like 20 seasons like uh Grace Anatomy or something, right? Um um I only have that on the mind because of Nick Scarpino, but yeah, I think um like getting the follow because of all the similarities between Andor and Grey's Anatomy. Yeah, 100%. Uh the bellboy followup was fantastic and it really confirmed like the first time that Cass and him meet when Cass is sent there. I think it was last week's uh episodes, right? And Cass is playing the like ignorant tourist",
            "start": 1806.24
        },
        {
            "text": "was fantastic and it really confirmed like the first time that Cass and him meet when Cass is sent there. I think it was last week's uh episodes, right? And Cass is playing the like ignorant tourist very well, but there's a little subtle thing between them where he can kind of tell like I I [ __ ] with you and I don't know why and I feel like you're here to help in some way, shape or form. Well, that's Cassian's job, right? And we're watching Cassian get better and better as being a spy. And you notice everywhere Cassian goes, he's always asking these questions. He's always asking people these questions because it's like, who else can we bring into this fold? Who else could be Axis? Who who else could be uh re rebellion, you know, because he's recruiting for who else could do what I can do, right? Yeah. And Yeah. What can you do for us? Yeah. And seeing the followup with him where Cass comes back, uh, you know, recruited by Will to check in on Gorman again. Um, requested by Luan, who",
            "start": 1853.84
        },
        {
            "text": "right? Yeah. And Yeah. What can you do for us? Yeah. And seeing the followup with him where Cass comes back, uh, you know, recruited by Will to check in on Gorman again. Um, requested by Luan, who significantly doesn't show up until, I believe, the third episode this week. Right. Uh Luan is kind of very quiet uh on on in this group of episodes uh which we'll talk about later, but uh which everybody which which sets everybody on edge, right? Where is Luth? Why aren't we hearing from Luan? Things are going wrong. Why isn't Luan here to tell us what's happening? Exactly. You know, um and seeing the bell boy kind of recognize him and be like, \"Hey, I'm going to get you this room.\" Cuz again, I feel like there's some I I I feel you doing something here for us. and him feeding the line to Cass uh the morning of the massacre, rebellions are built on hope. Um, yep. Was just one of those like perfect moments where it's just a random dude you'll talk to two or three times that can say something",
            "start": 1899.92
        },
        {
            "text": "the morning of the massacre, rebellions are built on hope. Um, yep. Was just one of those like perfect moments where it's just a random dude you'll talk to two or three times that can say something that sticks with you for a a long time and obviously for a couple of years cuz Cass will repeat that later on. um to uh I'm blanking on her name from Rogue One. Um Jin Erso. Jyn Erso. Thank you. And uh yeah, that that moment kind of hit like a ton of bricks and seeing Cass kind of take that in um especially in this week of episodes where he is very much struggling with his involvement in this anymore and feeling kind of uh himself breaking uh slowly and slowly and slow uh over the course of these uh three episodes and wanting to be done with all of it. And I want to talk more about where Andor is in all of the Andor of this uh batch of episodes right after a word from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist",
            "start": 1949.12
        },
        {
            "text": "is in all of the Andor of this uh batch of episodes right after a word from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading",
            "start": 2007.84
        },
        {
            "text": "will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your",
            "start": 2054.0
        },
        {
            "text": "May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need to call your mom, you could also send her a new pic of you from that trip you're telling her all about. Aura has a great deal for Mother's Day. For a limited time, listeners can",
            "start": 2098.0
        },
        {
            "text": "next time you need to call your mom, you could also send her a new pic of you from that trip you're telling her all about. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oruraframes.com to get $35 off plus free shipping on their bestselling Carver Matt Frame. That's a rare frames.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it",
            "start": 2142.48
        },
        {
            "text": "people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunny to get 10% off your first month. That's betterhelp hp.com/kindofunn better betterhelp.com/kindofunn. So a big theme of uh Cass's kind of arc here in these three episodes is him carrying the weight of a lot of the people of all of the oppression he sees around the galaxy. how much that slowly breaks him over time, but how important that fire is inside of him for the rebellion, but he feels so much of it all of the",
            "start": 2187.28
        },
        {
            "text": "of all of the oppression he sees around the galaxy. how much that slowly breaks him over time, but how important that fire is inside of him for the rebellion, but he feels so much of it all of the time that he kind of wants to walk away, right? In the first episode of of this batch, we see like the force sensitive healer lady who like might be a hack or ding ding ding ding ding ding ding. Yeah, you just found the only scene that I don't like in Andor. Congratulations. Let's talk about it. Let's talk about it. Carbon, you won. Okay, listen. This is a personal thing. I understand it's not a bad scene. I don't think there is a bad scene in Andor. Uh but for me personally, I did not like this scene. I did not like the vibe of it. M uh I don't I don't think we need a prophecy that Cassian is a special boy. I don't think we need that. Star Wars is full of special boys. What we need is a regular guy who does his best at all times and is still a hero. That's supposed to be the story of Cassie",
            "start": 2243.48
        },
        {
            "text": "special boy. I don't think we need that. Star Wars is full of special boys. What we need is a regular guy who does his best at all times and is still a hero. That's supposed to be the story of Cassie and Andor. Yes. Um now I also don't like that we need this force healer for Bix to make her sacrifice. Oh, I knew you were special, but the but the magical lady also said you were special, Cassian. So, I'm going to make this decision because of what the magical lady said. I really feel like Bix's message and Bix's actions would not would have been just as good, if not better, if they were 100% motivated by herself and not a wizard who heals burns. Yes. Okay. I I agree with you. Mhm. In general, I do agree with you. However, I'm going to take it as it's not that the prophecy has foretold, but that she is just seeing the inevitable future to some extent through the Force, right? Like there's a lot of malleability to like what how the Force actually works and what different people can do",
            "start": 2305.04
        },
        {
            "text": "that she is just seeing the inevitable future to some extent through the Force, right? Like there's a lot of malleability to like what how the Force actually works and what different people can do with interpreting this like mystery magic, right? Like it does different things for different people. So my my thought, we just fixed one of Ray Palpatines's powers in this very episode. Yeah. So my thought on it is that it's not that he is like prophesized or or like you know that the universe has decided this but instead that like upon seeing him she got a glimpse of like what is inevitably to happen uh which is that he will be an instrumental part of it. And I was really hating Bix's message and I still kind of hate Vix's message about like why she's leaving and what she has to do. Um the only line I like is her saying I choose the rebellion. Yeah. And I'm like, that did bring it back to her agency enough for me that I'm like, this is imperfect, but I'm glad she didn't say you need to",
            "start": 2365.76
        },
        {
            "text": "only line I like is her saying I choose the rebellion. Yeah. And I'm like, that did bring it back to her agency enough for me that I'm like, this is imperfect, but I'm glad she didn't say you need to save the world. You need to be part of the rebellion. I'm doing this for you. She's saying I choose the rebellion. Yeah. Right. You are you are doing a lot of good for the rebellion. I am us being together only hurts the cause. Yes. Um I think that's an important message. I I think it is and I think it's true. like the two of them together. I mean, this is the thing. You watch the two of them together in the previous three episodes. And it is true that they are they could be together or they could be useful agents to the rebellion. You see it when they're living on Coruscant together. And at this time in history, they need to be useful agents to the rebellion. And Bix is the only one that's clear-headed enough to see that. I just I just don't like that magic lady was there to like to like",
            "start": 2408.8
        },
        {
            "text": "time in history, they need to be useful agents to the rebellion. And Bix is the only one that's clear-headed enough to see that. I just I just don't like that magic lady was there to like to like put a hat on it for everybody so the audience because in a show that like in a show that respects the audience so much and the audience's uh ability to keep up with detail and symbols and imagery so much like this show does. I did not need the hat on a hat of the special lady being there. The only that's all the only moment that didn't work for me cuz I I think on paper it works thematically for me cuz my read of it wasn't that oh you're it's a Star War. It's a Star War. But it it wasn't the typical like oh you're a special boy. You have a mission to go do it. You know the the line that really stuck uh stood out to me was when she's talking to Bix after Cass walks away. She says like very few gather as they go and he gathers everything that he sees and witnesses and feels and he doesn't",
            "start": 2460.2
        },
        {
            "text": "stuck uh stood out to me was when she's talking to Bix after Cass walks away. She says like very few gather as they go and he gathers everything that he sees and witnesses and feels and he doesn't unload that at all and he's a messenger and that is something that we do see a lot throughout the show and I know he's a messenger can be interpreted as he's the one who sends the message in Rogue One and like all of this stuff but to me it felt more of like she felt um he's the one that sends the message in Rogue One. Yeah. Exactly. Exactly. But then to me it felt more of like he like she felt his the weight of everything that he has been carrying and she felt the importance of what the rebellion needs for that right and the only reason it doesn't work for me for Bix is when you know um she touches Bix at the end she's like oh let me essentially like let me see if you're a part of his future and she touches Bix and then she just gives her a look and walks way. It's like, okay, like, oh, Bix",
            "start": 2518.0
        },
        {
            "text": "Bix at the end she's like oh let me essentially like let me see if you're a part of his future and she touches Bix and then she just gives her a look and walks way. It's like, okay, like, oh, Bix isn't a part of his future. We [ __ ] get it. But like, that I did not need because Carbon, like you were saying, it very much felt like Bix was already coming to that conclusion on her own. She says while on Coruscant, I like if we're going to do this, I need us to win. And I think like if you have if you take this scene out but still keep the scene with Vel where Vel comes in and visits Bix to be like yo like the rest of us recognize how much we need this dude and how important he is to this whole thing here on Yavin specifically. And so when he goes off and does stuff with the Luthan who is interestingly and I think importantly not a part of like the Yavin rebel cells coming together like it makes us question whether he's fully in this or not, right? And I think that was already giving",
            "start": 2572.64
        },
        {
            "text": "interestingly and I think importantly not a part of like the Yavin rebel cells coming together like it makes us question whether he's fully in this or not, right? And I think that was already giving like Bix the kind of emotional inner turmoil of what does Cass need to do? And I and for her motivation was there motivation was there already. Um, I do I do understand that we do need to we also do need to show Cassian's um distrust of the Force. Cassian is is a Han Soloish type of character in that way where he's like, \"Well, the Force has never done anything for me.\" Yeah. So, why would I So, why would I believe in the Force? Um, you know, we need that in Rogue One for when Cassian teams up with Cherit and Baze, right? Um, but uh, yeah, it it was just a very on then scene for me in a show that doesn't tend to be on the nose a lot, but we can we can move on from it. Like I said, it's not it's not a bad scene. It's a scene that just didn't work for me. Uh, I think the rest Yeah. I think",
            "start": 2621.84
        },
        {
            "text": "that doesn't tend to be on the nose a lot, but we can we can move on from it. Like I said, it's not it's not a bad scene. It's a scene that just didn't work for me. Uh, I think the rest Yeah. I think the rest of everything that goes down with Cassian and Bix and I just I think everything that goes down with Bix over these over these last six episodes um where we watch her go from PTSD to like, look, as soon as we blow this guy up, I'm good. Yeah. Like like I got mine. I'm okay now. Are you okay, dude? Yeah. Yeah. Sometimes a little revenge would solve it. Yeah, actually I feel that way. Um I I think that it's devastating. I think they did a really good job with it. I was with you, Barrett, of being like, \"Yeah, Bix is going to die in the next three.\" Like, there has to be the motivation in that like we see Cassian wanting to leave the rebellion to start this life with her. We know somehow she's not there and somehow he's going to get K2 and there's no reason for him to have that bond",
            "start": 2679.2
        },
        {
            "text": "that like we see Cassian wanting to leave the rebellion to start this life with her. We know somehow she's not there and somehow he's going to get K2 and there's no reason for him to have that bond uh if Bix was somewhere. Um, and it doesn't mean she isn't going to die, but she doesn't have to. Now, in this kind of setting, we don't know for sure. Um, but her leaving is that same motivating factor. Yeah. Um, yeah, I I I thought that was a good kind of, you know, the the death flags for for Bixs have been around since her introduction in season 1, right? Um, and so I think that was the big expectation either in this week or next week. And to have the left turn be that no, she see she leaves because she knows and she feels it in in her heart essentially that Cass needs to be a part of the rebellion and she knows that Cass is not going to be a part of the rebellion as long as she's around and her making that decision for the rebellion which again loops back to because it's less about",
            "start": 2730.0
        },
        {
            "text": "rebellion and she knows that Cass is not going to be a part of the rebellion as long as she's around and her making that decision for the rebellion which again loops back to because it's less about like oh Cass you need to be here cuz you're the special boy. It's it goes back to what she was saying on Coruscant of like if we're doing this [ __ ] I need us to win. And I think in her mind, the way the cards have played out, the rebellion needs Cass to win. Um Yes. Yeah. Because at the end of the day, he is a special boy who sends the message. Um and but yeah, the her saying like, I choose the rebellion, it hits like a ton of bricks 100%. Um how about Oh, go ahead. Oh, I was just going to say and it's interesting to watch Cassian feel like less part of the rebellion as the rebellion is coming together, right? He's the secret boy. He's the wet works boy. He's the boy in the shadows. Um and to the point where even at the end of this when you see him uh rescue Monothma and um and he's told",
            "start": 2780.88
        },
        {
            "text": "together, right? He's the secret boy. He's the wet works boy. He's the boy in the shadows. Um and to the point where even at the end of this when you see him uh rescue Monothma and um and he's told like, \"Hey man, uh Gold Squadron's going to take the going to take the win for this one.\" Yeah. Uh cuz we need it to look like the rebellion came in and saved Mona because we need Is that all right with you? Because there's another show called Star Wars Rebels that we kind of need to write this into, right? But also, but also it does make sense from like cuz this season of Andor started with uh a ministry of propaganda telling us exactly what they're going to do to Gorman. This whole thing has been propaganda. And it's not like, hey, we sent in we sent in a dirty little secrets boy to like to shoot his way out with the pretty lady. It's like, no, we sent in gold squadron, the heroes of the rebellion, our brilliant crack fighters. Yeah. Who came in and saved Monma as she was speaking about",
            "start": 2828.08
        },
        {
            "text": "shoot his way out with the pretty lady. It's like, no, we sent in gold squadron, the heroes of the rebellion, our brilliant crack fighters. Yeah. Who came in and saved Monma as she was speaking about freedom. Yeah. And it's like that makes more sense. And we already know that Luan has been like actively pursuing just as much propaganda as the Empire surrounding Gorman. We had the idea of what the Empire wanted people to believe of Gorman. And then we had Luan admitting to it being like, I understand they're all going to die, but think of how powerful of a message it will be that a wealthy planet like Gorman has joined against the Empire, that has stood against the Empire. Think of the message it will send. Yeah. And that's the thing about this changing rebellion, right? Like Luan has said in, you know, Luan has said since the beginning, he's had a hundred poetic Tony Gilroy quotes that all mean, I don't get to be part of this because nobody wants the guy who did all the murders in",
            "start": 2880.4
        },
        {
            "text": "in, you know, Luan has said since the beginning, he's had a hundred poetic Tony Gilroy quotes that all mean, I don't get to be part of this because nobody wants the guy who did all the murders in secret to be a part of their grand rebellion. That's not my part in this. And that's not and he keeps trying to tell Cassian that's that's not Cassian's part in this, right? But I think what's what's nice is as the rebellion is coming together on Yavin and Cassian feels that sort of like institutional chafe, right? Like he doesn't like authority. He doesn't like organization. He really feels like it's going to turn against him. Um but at the same time, they're telling him like, \"No, this is good. It's better this way, and we need you, and it's better with you.\" And uh it's such a fundamental thing of Cassian's character that he's he can't trust it. He cannot trust it. And then when they say something to him like, \"Hey man, Gold Squad's going to take the uh going to take the W for this.\" He",
            "start": 2929.2
        },
        {
            "text": "of Cassian's character that he's he can't trust it. He cannot trust it. And then when they say something to him like, \"Hey man, Gold Squad's going to take the uh going to take the W for this.\" He feels hurt. Yeah. You can see it on his face that he just feels hurt by it. Uh cuz he does like because in a mirroring of him and Sirill K, they both want to be told they're good boys. Neither one of them ever gets told, you know what I mean? That they're good boys. Yeah, they've just always been looking for that approval ever since he was a a little child, right? Um and so this isn't important, but um Cassian and Bix's Airbnb on Yavin. I I was fascinated by like the living quarters of Yavin. I was like, does everybody get this like nice little little house? That's crazy. It really looks like one of the like homepage like destinations book a treehouse on Airbnb. It's like the the official Star Wars retreat is closed. But here's our cool hipster Star Wars retreat in the middle of uh in the",
            "start": 2980.32
        },
        {
            "text": "one of the like homepage like destinations book a treehouse on Airbnb. It's like the the official Star Wars retreat is closed. But here's our cool hipster Star Wars retreat in the middle of uh in the middle of nowhere. That'll cost uh an arm and a leg. Do you know what it reminded me? It reminded me of like if if the Ewoks had a tourist hotel on the forest moon of Endor. Like if Ewoks were like like humans come to stay on the forest moon of Endor and Ewoks are like now you can have an Ewok style house or a human style house. Which one do you want? Like do you want the full Ewok experience? Mhm. Or do you want something a little maybe more to your liking, you know? That's what it look I I would join the rebellion if they gave me a cool treehouse like that. 100%. I was like, damn, it'd be cool if they did put that on Airbnb. Yeah, right. I'd go. I'd go. Where's fictional Yavin? I'm in. Let's go. Uh, yeah, but I think I think I think the kind of Andor deciding because we know that in",
            "start": 3026.96
        },
        {
            "text": "cool if they did put that on Airbnb. Yeah, right. I'd go. I'd go. Where's fictional Yavin? I'm in. Let's go. Uh, yeah, but I think I think I think the kind of Andor deciding because we know that in Rogue One, he still hasn't really decided that he wants to be part of the fancy rebellion. Mhm. You know, Rogue One starts with him just being like, \"Well, I'm just going to kill a guy in an alley and then maybe I'll shoot your dad. I don't know. I don't know what I'm going to do today.\" So, we know that he's never going to like fully take on the the sort of Captain Andor that they want him to be on Yavin. So, it'll be interesting to see what what happens with him in this growing more organized rebellion over the next three episodes. Sage just sent over uh an Airbnb. I did. I found I think already a very very similar I literally Googled uh I all I did I googled treehouse yurt Airbnb and I got to tell you I found it guys I found it that is that is where they stay on Yavin 100%. It's got the",
            "start": 3076.08
        },
        {
            "text": "a very very similar I literally Googled uh I all I did I googled treehouse yurt Airbnb and I got to tell you I found it guys I found it that is that is where they stay on Yavin 100%. It's got the same little like almost like balconyesque area. Um it's pretty good but it's it's very easy to find. And that's the table where he reads the message from uh Bix. Exactly. Let's watch the finale in the Yavin Airbnb. No, this is a strong idea coming together here. I like this. I like it. It's coming together. Um I like it. It's the redwoods. Let's go. Um speaking of coming together, let's talk about this little plan by Bale Orana and Mon Mothma to get her to get her to address the Senate here. Bale Orana played of course by who he's always been played by, Benjamin Brat. Uh, before we talk about Benjamin Brat, I need to resend and apologize. Uh, Benjamin Brat was pretty good though, Barrett. Didn't you think Benjamin Brat was pretty good? He was pretty good. He was pretty good. He was pretty",
            "start": 3130.08
        },
        {
            "text": "Benjamin Brat, I need to resend and apologize. Uh, Benjamin Brat was pretty good though, Barrett. Didn't you think Benjamin Brat was pretty good? He was pretty good. He was pretty good. He was pretty good. He was pretty good. Last week, I speculated that maybe Jimmy Smith didn't [ __ ] with the the show uh Andor because Jimmy Smith always finds an excuse to be in every single Star Wars piece of media. And I personally found it insane that he somehow did not make time for what is a lot of people consider to be the best Star Wars media in decades. Uh and so I was like, what else could he possibly be doing? I feel like he might just not [ __ ] with the show if he if he's not in the show. Uh a lot of people commented uh very upset by this and uh corrected me that uh Barrett in fact uh he Jimmy Smith was working on something very important, the next season of Dexter. And I'm very bewildered by that because as someone who's a fan of the original run of Dexter, didn't he die in like season",
            "start": 3187.6
        },
        {
            "text": "Smith was working on something very important, the next season of Dexter. And I'm very bewildered by that because as someone who's a fan of the original run of Dexter, didn't he die in like season 3? I'm very confused by that decision. And honestly, him choosing Dexter over Andor season 2 solidifies even more that I don't think Jimmy Schmidz [ __ ] with contract. That's contract. It's all about what contract you sign first. You don't get to choose. I know. You don't get to choose. I'm joking. I'm joking. Funny kind of funny deals are decided over like a deep dish pizza. You like you like kind of funny deals are like you both eat a chicken wing from either side and when you kiss in the middle it means you work it kind of funny. That's not the way [ __ ] works in the real world. No, it's not signing on for a teleision series. I'm just doing a goof. Um but also I can't believe you made it to season 3 of the original run of Dexter. That show that show went downhill so quickly so quickly.",
            "start": 3230.48
        },
        {
            "text": "signing on for a teleision series. I'm just doing a goof. Um but also I can't believe you made it to season 3 of the original run of Dexter. That show that show went downhill so quickly so quickly. It was like past season four. I think whenever the after the Trinity killer stuff happened, that's when that show really started to tank. Anyway, Benjamin Brat who who valiantly took the place of Jimmy Smith's who couldn't be here. Barrett, I'm saying Jimmy wanted to say the word [ __ ] And it's like that'd be so funny if that's why. Yeah. Jimmy Smith Jimmy Smiths like calls back and he he he's like, \"I'm sorry, Jimmy Smiths doesn't curse on camera. That's not Jimmy Smiths? That's not how Jimmy Smiths has ever been.\" And everybody's like, \"Jimmy Smith talks about himself in the third person.\" And he won't curse on camera. Jimmy Smiths is weird. Carbon, talk to me about Benjamin Brat. I love Benjamin Brat. uh second best part of Miss Congeniality. I think we can all agree. And uh Benjamin",
            "start": 3278.96
        },
        {
            "text": "And he won't curse on camera. Jimmy Smiths is weird. Carbon, talk to me about Benjamin Brat. I love Benjamin Brat. uh second best part of Miss Congeniality. I think we can all agree. And uh Benjamin Brat uh as Bale Orana here talking to Man Mafma. And it's very interesting because the way they're speaking, it's like one of them gets to go be with the rebellion and continue working, but one of them has to stay in the Senate and be the hated person in the Senate. Y and Bale Orana is like, \"You go ahead. I'm gonna be the most hated person in the galaxy for a little while. That's cool. It's kind of my thing. Um, and also like staying here and being like, I'm probably gonna get killed for this. Mhm. Like I know there's a plan for you to leave here and I'm going to stay. You have to say the important part and go and whatever fallout, I'll still be sitting here while everybody is freaking out after what you said. After man's like, \"Why are you booing me?\" I'm right. Yeah. Uh yeah, I I find",
            "start": 3329.6
        },
        {
            "text": "part and go and whatever fallout, I'll still be sitting here while everybody is freaking out after what you said. After man's like, \"Why are you booing me?\" I'm right. Yeah. Uh yeah, I I find it early on, you know, this is maybe the night uh after the the massacre has happened. I don't even think it's technically the next day yet. Uh we see the Gorman senator getting arrested uh speaking out about the truth and they're not even arresting him for a reason. Um they don't give him a reason for him being arrested. Hey, shout out to Man Mothma in the beginning of this season saying, \"You better stand up for yourself, buddy. It all ends the same way. It all ends the same way. Orin, I remember his name because he's a he's a [ __ ] Rhymes with [ __ ] because that's what he is. Listen to Mon Mothma when Mon Mothma tells you to do something, coward. Listen to Mon Mothma when she says, \"The death of truth is the ultimate victory of evil.\" You want to talk about uh You want to talk about this?",
            "start": 3388.0
        },
        {
            "text": "when Mon Mothma tells you to do something, coward. Listen to Mon Mothma when she says, \"The death of truth is the ultimate victory of evil.\" You want to talk about uh You want to talk about this? Okay. Star Wars. Yes. always mirroring political uh political themes and political events of the time. Star Wars has never been allowed to get this close to saying what people are thinking at this moment. Star Wars has never been able to be this explicit before. Yeah. Uh you know, it's always been about past things that we're all like, \"Hey, that's not actively happening and we agree that was bad.\" Mhm. No, even even this it's like, oh, what's the planet like that that what's Gorman like? Oh, it's it's World War II Paris. You know what I mean? Like, yeah, it's not they they always are like, here are images of the past. We hope that you will extrapolate and realize that these themes continue into the present and into the future. But if you don't, hey, it's cool. Enjoy the space lasers. Yeah.",
            "start": 3437.68
        },
        {
            "text": "are images of the past. We hope that you will extrapolate and realize that these themes continue into the present and into the future. But if you don't, hey, it's cool. Enjoy the space lasers. Yeah. Uh, this was really Dan Gilroy saying, \"Buckle up, motherfuckers.\" Yeah, I got some things to say about the world. Yeah. And even though the imagery of Gorman is very Yeah. World War II, Paris, I think a lot of the things that surround how the Empire goes about justifying uh their genocide and space fracking of this planet is very much, you know, uh, text, not subtext of what this is all being pul uh, pulled from. And yes, there are probably uh examples uh specifically from occupied France and stuff that they directly pulled from, but I think the the PR spin specifically for a genocide um definitely feels like a oh that's what we're talking about. All righty. Um and I I think the they've been very good about they've been very good about taking little things. Uh, and there's so many like,",
            "start": 3496.56
        },
        {
            "text": "feels like a oh that's what we're talking about. All righty. Um and I I think the they've been very good about they've been very good about taking little things. Uh, and there's so many like, you know, you could spend you could spend hours going into them, but talking about Man and Bale Orana, uh, when they when they shake hands before they go into the assembly, uh, Bale says, \"Next year on Yavin.\" Um, and that is such a refrain that you hear. I mean, the first time I ever heard it, um, growing up as a Jewish kid is starting after World War II, a common things that that Jewish people say to each other is next year in Jerusalem. Like, next year when the Jews are free, we will see each other, right? And that's also something next year in blank is something that a lot of nations and people take to be their thing of like, I will see you when there's peace. I will see you when we are fair and we are equal. And like taking little things like that and putting it in just really like even the",
            "start": 3546.72
        },
        {
            "text": "to be their thing of like, I will see you when there's peace. I will see you when we are fair and we are equal. And like taking little things like that and putting it in just really like even the fact that it was not just that they were speaking French. It sounds like a mix of French and Eastern European languages to me. Like it sounded like a mix of to my ear because of my grandparents. It sounded like French and Yiddish. you know, they've been very good at taking these real things and really putting them into Star Wars in a way that like haven't been put in before. Not to this extent. Yeah. And it really comes to a head in this episode. Yeah. And the, you know, we've seen or we've heard a part of man's speech before from the child's cartoon Star Wars Rebels, uh, that was, you know, showing on Disney, uh, Disney XD, I believe, was where that, uh, now this is the cartoon for babies where the Jedi chase after the melons, right? Exactly. The Muruns, as we call them, right? And we do",
            "start": 3601.92
        },
        {
            "text": "on Disney, uh, Disney XD, I believe, was where that, uh, now this is the cartoon for babies where the Jedi chase after the melons, right? Exactly. The Muruns, as we call them, right? And we do hear the word Gorman genocide from man. Uh I believe in that episode where they they help uh get man after the events of this episode. Right. And I think you know they're they're not like you were saying like Star Wars is you know it's has been very open about kind of taking the easy uh language and stances on things when looking back at stuff. And this show has gotten very close to being the closest we've ever gotten with Star Wars and being like, \"Hey, this is the real [ __ ] that we need to talk about now.\" And seeing the kind of recontextualization of and full uh kind of uh wording of man's speech here and actually seeing the events of what has happened in the last three weeks of these episodes, her saying like what happened yesterday on Gorman was unprovoked genocide. and having that all",
            "start": 3653.28
        },
        {
            "text": "here and actually seeing the events of what has happened in the last three weeks of these episodes, her saying like what happened yesterday on Gorman was unprovoked genocide. and having that all come to a head. the the weight that you feel uh of it actually cuz in Rebels you don't really it's like Gor what f you have no idea what Gorman is what's happened there and seeing it actually unfold over this entire show so far and it's just a Star Wars it's like it's like many Bothans died okay what a shame for the you know yeah and like oh we'll just kind of wash over that that doesn't mean anything um and it it to have man be the first one to actually say it, right? Um to kind of call out her fellow senators in terms of all of the senators speaking before her are just regurgitating the same things we see from the news broadcast, right, of oh this is this is a real violent uprising uh going against imperial norms. Um right, I need to be reelected. This is the way that my electorate feels.",
            "start": 3706.48
        },
        {
            "text": "we see from the news broadcast, right, of oh this is this is a real violent uprising uh going against imperial norms. Um right, I need to be reelected. This is the way that my electorate feels. Um, and so I've been telling my people to chill the [ __ ] out even though, you know, the boot is I'm a politician. We, you know, we even hear from Orin like in the beginning he's when he says to to to man where he's like, \"Nah, I don't think Gor Gorman can like be on top of this with you cuz we can't afford to make the emperor angry.\" And that's what a lot of these people are doing, right? It's like, we can't afford if we just play along, the empire will leave us alone. Uh, yeah. And that's never how it ends up. Uh, no. Absolutely not. Nobody is safe from it. Everybody thinks that like they'll be outside of it if they're complicit. Yes. And the end of Man's speech uh that we get to fully hear here is uh she says the truth has that truth has been exiled from this chamber. And the monster",
            "start": 3759.84
        },
        {
            "text": "be outside of it if they're complicit. Yes. And the end of Man's speech uh that we get to fully hear here is uh she says the truth has that truth has been exiled from this chamber. And the monster screaming the loudest, the mount monster we've helped create, the monster who will come for us all soon enough is Emperor Palpatine because they only gain as much power as we allow them to. Um and so yeah, that's why this this third episode really hit in a lot of ways of seeing the kind of mirror being uh thrown up in front of us. Yeah, I I it's been it was really fascinating watching this leadup because the whole the theme for Manothma as a character in Andor is always like public verse private, right? Like everybody is doing everybody in Andor Andor is about duality for everyone. What do you do? What do you do in secret? What do you do in public? But Mon Mothma's theme is really about like public respectability more than anything else. That's always been her thing, public respectability.",
            "start": 3807.12
        },
        {
            "text": "do? What do you do in secret? What do you do in public? But Mon Mothma's theme is really about like public respectability more than anything else. That's always been her thing, public respectability. And it's so fascinating watching her kind of psychologically unravel when she realized she does not get to be publicly respectable anymore. She knows that this is what it's been working up to, but it's completely counter to everything she's been doing to help and to protect herself and her family and the rebellion for the last, you know, 5 years. Uh, and so it's it's this episode really has a lot of people like starting to crack under the pressure, but watching her crack under the pressure, watching her like dismiss Erskin, watching her talk to Luan, and you know the code that Luan uses that Luth makes everybody use. I have friends everywhere. But when Luan says it to her, grabbing her arm, it's a threat. She takes it as a threat, right? Like, you will never be rid of me. I have friends",
            "start": 3860.48
        },
        {
            "text": "Luth makes everybody use. I have friends everywhere. But when Luan says it to her, grabbing her arm, it's a threat. She takes it as a threat, right? Like, you will never be rid of me. I have friends everywhere and watching that in her eyes like h am I trusting the right person and like ultimately you you are with Luan trusting the right person but uh you are not going to like the fact that you're trusting the right person. Yeah. Yeah. Man had a really mom had a really interesting reaction um to when Cassian says it to her. Like it has this like realization. I just think that she it's such a brilliant performance of this is really happening. Like you can see it in her eyes of like I know I was told this is going to happen but holy [ __ ] it's really happening. He's here. He said the thing it's now. Yeah. And that that keeps that keeps growing. It keeps growing and growing the the further we get uh the two of them together. And you know the we've got the ISB undercover lady just",
            "start": 3916.0
        },
        {
            "text": "thing it's now. Yeah. And that that keeps that keeps growing. It keeps growing and growing the the further we get uh the two of them together. And you know the we've got the ISB undercover lady just absolutely crashing out and totally like flubbing that whole situation. And I love that lady though. Whoever shout out to that actor. That lady ruled. She was really fun. And them immediately killing her and her uh I forget her assistant's name but him trying to help cover for that. And then man taking that in of like you just killed that woman. And that's where Cass says like welcome to the rebellion. This is what this [ __ ] is about. And little will Cass know is that um he will be fed those same words at the very end of this episode, right? Welcome to the [ __ ] rebellion, dude. This is what you need to do. And that theoretical versus actual rebellion. Yes. Like Mon Mothma's like, \"Oh, you're the money and you're the person who says the words and you're the person who does this.\" And",
            "start": 3966.0
        },
        {
            "text": "you need to do. And that theoretical versus actual rebellion. Yes. Like Mon Mothma's like, \"Oh, you're the money and you're the person who says the words and you're the person who does this.\" And it's like, \"Oh no, you're a part of this.\" like, you know, when when Tay got murdered, you know, that really rattled her. That was like the closest I think up until this point that she's been to the actual rebellion and Luan, what she's really been funding this whole time, right? She's been able until this point to look at Luan and be, \"Oo, gross. What you do is dirty. Do less dirty things. Here's more money.\" Mhm. You know, and like but do it less dirty. And then in this episode like with after Tay getting after Tay getting murdered and then being with Cassian as Cassian's like pew pew pew like killing an ISB agent who she doesn't know and then that escalating to her driver that she does know. Yeah. What's his name? What's his name? Corin. Corin. I found her. I found her. Freaking that was",
            "start": 4011.44
        },
        {
            "text": "killing an ISB agent who she doesn't know and then that escalating to her driver that she does know. Yeah. What's his name? What's his name? Corin. Corin. I found her. I found her. Freaking that was good. Barry, I saw you and I made the exact same face when Anthony um referenced uh Oh god. Uh Erskin. her skin. I feel so sad. Her like assistant, right, that was like assigned to her by Luan that she didn't know was also working for Luan. And like it made so much sense that she felt betrayed because she felt so close to him and trusted him. But I also feel deeply that Erskin loved her, like cared about her deeply and genuinely and honestly and like in that moment was so sad to have lost that, but was like, I don't care. I will still continue to protect her. When Luan says like he has protected you in ways you will never know. Um it's heartbreaking. Yeah. You you hear in the wedding episode when he speaks to Luan. Luan says, \"Oh, how you know how long have you been working for for the",
            "start": 4054.72
        },
        {
            "text": "you in ways you will never know. Um it's heartbreaking. Yeah. You you hear in the wedding episode when he speaks to Luan. Luan says, \"Oh, how you know how long have you been working for for the senator or whatever?\" And he's like, \"Or what's your connection to the center?\" And he's like, \"Oh, she found me and she took me in. She rescued me.\" Right. Yeah. And so he does he loves her better probably than anyone has ever loved her in her life. Her child is a [ __ ] Nazi youth. Her husband is the worst guy in the world. And this her assistant is the only one who's ever like seen what she has done for him. Y uh and then when Luthan is like we can we can surmise that Luan said I can help you protect her even more. Yeah. Right. If you love her she's already wrapped up in this. Yeah. I can help you help her be safe. Uh, and so you can see how her and then that whole thing like when she when they finally when Cassian gets her back into into the little headquarters and they like and they",
            "start": 4109.76
        },
        {
            "text": "help you help her be safe. Uh, and so you can see how her and then that whole thing like when she when they finally when Cassian gets her back into into the little headquarters and they like and they actually like hug each other, I'm just like, she understands. Yeah, cuz that was sad. Just watching him take it on and have to keep moving was so sad. Um, and again, it's that thing of like these are small characters that we're getting so much complexity from. And I I I give a lot of credit to the performances for that. Yeah, for sure. To wrap this all up because I know one snow bike Mike is raring to go and marathon across the entire continent in Death Stranding one. We have to talk about the K2SO of it all. Uh we finally got him and I was very um I didn't know if we knew this was when uh he was going to be introduced. Uh but I was reflecting on it. I was like, man, I am surprised how restrained they have been. I feel like a lesser show would have introduced him very early on. The entire",
            "start": 4157.84
        },
        {
            "text": "was going to be introduced. Uh but I was reflecting on it. I was like, man, I am surprised how restrained they have been. I feel like a lesser show would have introduced him very early on. The entire show being about their rapport and building. Uh but I think he comes at such the perfect time where he is a remnant of this uh Gorman massacre now a constant reminder something that Cass not doesn't have just something within him but a physical reminder of what Cass has always seen is now going to be his like number two bud on missions from here on out. And if I if I've offended you, I'm sorry, but if not, don't turn that thing away from me. And it's it's a reminder of like how scary these units are. Like K2SO is like threatening, but it's always used for like a gag in Rogue One where it's like in season one when he like when Andor gets picked up by one of them uh before he gets arrested, that's like kind of the first moment you're like, \"Fuck, these guys are like these guys are scary and",
            "start": 4208.16
        },
        {
            "text": "in season one when he like when Andor gets picked up by one of them uh before he gets arrested, that's like kind of the first moment you're like, \"Fuck, these guys are like these guys are scary and terrifying.\" tosses Enza. He toss K2 unit tosses tosses her so much to the point she just dies. Yeah. Yeah. He throws her to death. Yes. And like that's crazy. I think we've seen that the K2 units are scary, but I do not think we have ever seen them represented this terrifying. Like I felt scared watching them trapes through the square in Gore. And my I love that everyone Sorry. I love that everyone in Yavin was like, \"Hey, put on goggles and blasters and back up and we've got this thing restrained, but still like maybe maybe have more guns. Maybe have all the guns.\" Yeah. And you know, Cass in that moment was just like, \"Fuck it. I'm not I'm not doing that. I'll have a gun.\" But he is just so emotionally just in a weird place that he's like, \"Fuck, I don't care if this thing turns on. Who",
            "start": 4261.2
        },
        {
            "text": "that moment was just like, \"Fuck it. I'm not I'm not doing that. I'll have a gun.\" But he is just so emotionally just in a weird place that he's like, \"Fuck, I don't care if this thing turns on. Who gives a shit?\" I I did have a weird broken Star Wars brain moment where Sirill is put into that room with all of the K2 units and there's that one that just kind of keeps staring at him. I had a fear K2. Well, not even that, but I had a fear of like, god [ __ ] damn it, just like the um you know the um what is it? The robot lady whose consciousness gets put into the Millennium Falcon. And I'm like, if they turned serial into the consciousness of K2SO, I'm going to [ __ ] lose it. Thank god they didn't do that. But that was a moment where I was like, don't. Please don't. Can you imagine? Please don't. Anthony Gilroy. Anthony Gilroy deciding that he was going to do that. That would have been so buck wild. I'm just There was that moment I was like, why are they what's happening here? Uh, but",
            "start": 4309.92
        },
        {
            "text": "don't. Anthony Gilroy. Anthony Gilroy deciding that he was going to do that. That would have been so buck wild. I'm just There was that moment I was like, why are they what's happening here? Uh, but thank god they did not do that. But I to go back to the actual scene of them turning K uh K2SO on and them walking through Andorf like hey we think we've reprogrammed him. We've never done this before, but like when we turn him on it either is going to work or not work and we're going to just kind of have to take that chance maybe a little bit. And seeing like at first like the uh him kind of like resist and try to go against the straps. You're like, \"Oh god.\" Yeah. This thing. Real Frankenstein. Real Frankenstein [ __ ] And then we get our boy. Yeah. Now, here's my big question to the three to the two of you. Uh to to the 17 of you. Here's the question. Spirit of Jim Gettys as well. That's right. As always, when there was one set of footprints on the ground, etc., etc. Uh my question to",
            "start": 4360.0
        },
        {
            "text": "to the two of you. Uh to to the 17 of you. Here's the question. Spirit of Jim Gettys as well. That's right. As always, when there was one set of footprints on the ground, etc., etc. Uh my question to you is now what is the tone of this series? Does it change? Does the K2 of it change it? And how does it change it? K2 Allen Tudy in in Rogue One. Silly guy. Strong guy. Silly guy. Very funny. What is What is going to happen to Andor in these last three episodes now that K2 is here? That's a good question. I don't think we get a full change, but I think that we could use and I would welcome the reprieve of Cassian having moments of joy, like moments of uh like reprieves from the darkness. Like he has experienced so much and like him in this arc being abandoned in his eyes by Bix and like being condemned to this life, right? Uh when he tried to choose something else, he was condemned to a life of a soldier. Um, seeing moments of him getting to smile I actually I do welcome, but I don't",
            "start": 4410.0
        },
        {
            "text": "condemned to this life, right? Uh when he tried to choose something else, he was condemned to a life of a soldier. Um, seeing moments of him getting to smile I actually I do welcome, but I don't think they'll change the whole tone of the show. Yeah, it'll be kind of like subtle moment because he's still kind of messed up in Rogue One, but he does have little moments of smiling when either uh, you know, Jyn is giving K2 uh, [ __ ] uh, throughout Rogue One. He does have those little moments and I I I think we'll we'll see that but not nearly as as often as I think he will bring in a fun vibe for the audience, but I think and knowing the uh you know uh the crew working on this, I think they're going to be able to find a balance of like, oh, we get to chuckle at this, but it's not going to overtake whatever is going to happen a year later from now, which I am honestly again like very fascinated where we go from here cuz Again, a lot of this show was building up to this week and so I",
            "start": 4465.04
        },
        {
            "text": "to overtake whatever is going to happen a year later from now, which I am honestly again like very fascinated where we go from here cuz Again, a lot of this show was building up to this week and so I wonder like do we end with him on that planet where he kills that dude, right? Uh I'll be fascinated by that. And uh I I I'll do my bold prediction now. The last scene of this the last scene of this show will be Bixs finding Andor after the events of Rogue One. Like uh quote unquote Andor of learning where he went. Uh, I don't think they get to talk one more time cuz, you know, she does promise of like after this is over, I will find you. And I think it's you think we're going to get a a shot like that uh like that Clone Wars season 7 shot of Vader like like looking out over where Ahsoka was like that sort of thing. Very similar vibe, I would say. Um, how they pull that off, I don't exactly know because I forget if at that point if they blow up the entirety of Scarif or if it's just that",
            "start": 4514.08
        },
        {
            "text": "like that sort of thing. Very similar vibe, I would say. Um, how they pull that off, I don't exactly know because I forget if at that point if they blow up the entirety of Scarif or if it's just that like area of Scarif. Oh, yeah. Scarif. No, Scarif's gone. Scarif like Sorry if you had a vacation home on Scarif. Yeah, cuz Jedha also was only like a part of the planet, right? And so, yeah, it'll be interesting to see how that works uh in it all. But yeah, so that's uh do we think anything about Cassie and sister is coming up? [Music] We started we we we showed it in the the first season was I'm looking for my sister. Will we never touch again the cuz like he's not thinking about it. He's not talking about that anymore. But bigger things move. That's a Gilroy move to plant to plant a detail. Let us forget about it and then bring it back. Yeah. I would love to see that because it did feel like an kind of unsatisfying way to end that thread when Marva is like she's gone like you got to",
            "start": 4564.96
        },
        {
            "text": "Let us forget about it and then bring it back. Yeah. I would love to see that because it did feel like an kind of unsatisfying way to end that thread when Marva is like she's gone like you got to move on from from that, right? Um it it did feel like a okay, we're just that's where we're going to drop this. So I I could see that happening. I could see it happening. I don't know how of season three of Andor. Season three of dead. Season three of Andor is all the time skips. We go back and we fill in every single time skip or hear me out sister. That's what I meant. Yeah, she's Andor now. Oh, new andor just dropped. Even though that was actually Marva's last name, she didn't really have that same last name. But she can take it. Hey, hey, hey. If Ray can be a Skywalker. If they could be a Skywalker, we're not drawing the line at his sister being Andor. We'll be back next Friday for the finale of these episodes when we find out that Cass's sister has found him and has taken on the last",
            "start": 4616.0
        },
        {
            "text": "Skywalker, we're not drawing the line at his sister being Andor. We'll be back next Friday for the finale of these episodes when we find out that Cass's sister has found him and has taken on the last name Andor. Thank you, uh, Carboni Sage, for joining me this week. Carbon, where can people find you? In shadowy alleys, doing what I doing what I know is right even though in in my heart in the moment it feels wrong. I love that. Sage, where can people find you? Everywhere on the internet at not Sage and Pixel Circus. Thank you all so much for joining us for episodes 7 through nine. Spoilercast of Andor season 2 will be back next week for the finale. Remember, uh, The Last of Us Screencast will be back on Monday with that crew. But until then, it has been our pleasure to serve you. [Music]",
            "start": 4677.12
        }
    ]
}