{
    "id": 14041,
    "video_id": "eKLWcxceSSo",
    "show_name": "Gamescast",
    "hosts": [
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Roger Pokorny",
        "Parris Lilly"
    ],
    "title": "Doom: The Dark Ages Review - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nYou are about to witness history. SnowBikeMike, the most athletic man in his own mind is embarking on his most daring quest yet, going step-for-step with Sam Porter Bridges in A LITERAL, marathon stream on a treadmill.\nCome join Roger and Mike this Friday as they attempt to do a FULL PLAYTHROUGH of Death Stranding 1 through the weekend, but they can only do it with your support! Will Mike and Roger break this treadmill and have to drive to Andy's home at 1am to borrow his?\nFind out: Friday on Twitch\nWe’re an 11-person business all about live talk shows.\nAfter Gamescast is the 3rd episode of our limited series, What Was Cut from the Elder Scrolls Online Show\nIf you’re a Kinda Funny Member:\nToday’s Gregway is Roger with a Doom the Dark Ages daily journal breakdown\nThank you to our Patreon Producers: Karl Jacobs, OmegaBuster, & Delaney Twining\n\n00:00:00 - Start\n00:01:20 - Housekeeping:\n00:05:50 - TOPIC OF THE SHOW: DOOM The Dark Ages \n00:08:30 - Roger’s Thoughts\n00:10:30 - Blessing’s Thoughts \n00:13:00 - Parris’ Thoughts\n00:16:00 -  Andy’s thoughts\n00:30:00 - Music and Audio\n00:35:53 - Difficulty\n00:39:55 - Weapons\n00:46:45 - Upgrades \n00:51:30 - Levels and secrets\n00:56:45 -  Mech and the Dragon\n01:00:15 - Superchat\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746815289,
    "duration": 4437,
    "transcript_chunks": [
        {
            "text": "[Music] Welcome to the kind of funny games cast for Friday, May 9th, 2025. You're probably wondering where games daily is. Whoa. Whoa. There's not one. That's it. No, there's no news today. There's no news today. I'm Andy Cortez. I'm joined by blessing Addio Jr., Roger Porny, and Paris Lily. Yeah, good day Andy. Good day. Good day, Andy. How's it going? I'm doing great. Good morning, everyone. I'm good. I'm good. How you doing? I'm I'm excited to talk about cool video games with everybody. This is the kind of funny games cast. Each and every weekday we get to talk or we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. You keep it tight, Andy. Yeah, that's what I like. Keep it tight, Andy. I'm trying to I mean, I had a whole bit going on. I was excited for it. If it's games daily, I'll talk to you about volleyball. Yeah, that's true. But you know, this is a review. We got important stuff.",
            "start": 0.0
        },
        {
            "text": "trying to I mean, I had a whole bit going on. I was excited for it. If it's games daily, I'll talk to you about volleyball. Yeah, that's true. But you know, this is a review. We got important stuff. We got to get to Doom: The Dark Ages. Yeah. If you love what we do, support us with a kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show for a chance to be a part of the show. Submit your thoughts and opinions as YouTube super chats as we go. Send in uh your biggest questions for Doomed the Dark Ages and uh we'll try to answer them today. He had the doc wrong. You see that? You see that? Or what? No, I'm like, \"Oh, great comment.\" I'm like, \"No, it's a chat being mean to Roger.\" Yeah. There's no reason. I'm betting all eights and nines and Roger being wrong. That's so [ __ ] up. [ __ ] y'all. It's funny cuz usually I'm the butt of bad joke. No, it's they they've now shift blame to",
            "start": 52.08
        },
        {
            "text": "There's no reason. I'm betting all eights and nines and Roger being wrong. That's so [ __ ] up. [ __ ] y'all. It's funny cuz usually I'm the butt of bad joke. No, it's they they've now shift blame to me now. I'm the new guy. I'm the new guy. It is always the new guy. The roast. Um, everybody, this is a big momentous day in kind of funny history. Okay, you are about to witness history as Snow Bike Mike, the most athletic person living in his apartment maybe, um, is embarking on the most daring quest yet with Roger Bourney. Snow Bike Mike will be walking a literal marathon step for step with Sam Porter Bridges. A big big stream today. Roger, do you want to give us a tease at all? Uh, yeah, we got a lot of liquids. We got a baby in a jar. We're going to fill it with liquid. Um, we're very excited about this and we're going to be walking again with uh every single step that Sam Porter Burgess makes in the game. Snow Bike Mike will take that same exact step. So, we're going to be trying to",
            "start": 87.52
        },
        {
            "text": "about this and we're going to be walking again with uh every single step that Sam Porter Burgess makes in the game. Snow Bike Mike will take that same exact step. So, we're going to be trying to go the entire weekend. How's he doing? So, what do you mean? On a treadmill. On a treadmill. On a treadmill. And we also have, I believe, some type of like um climber like step climber he has. And then also, if this uh treadmill breaks, we will come to your house and take your walking pad at 1:00 a.m. Is there a plan for this treadmill after this stream? Uh, it is Lanz. Damn it. So, it's going right back to her. Yeah, you're trying to take the title. That's kind of what it is. You're trying to take No. Uh, so it's very exciting. And, uh, we're we're very nervous for Snowike Mike and his body because he did say that he was supposed to be on this this, uh, podcast today, but he's like, \"No, I got to stretch.\" That's a lie. He's not going to stretch. There's no There's no way he's going to",
            "start": 138.96
        },
        {
            "text": "because he did say that he was supposed to be on this this, uh, podcast today, but he's like, \"No, I got to stretch.\" That's a lie. He's not going to stretch. There's no There's no way he's going to stretch. He's going to stretch for two hours. Yeah, there's no shot. So, uh, pray for him and, uh, watch us live all weekend. Hopefully, we're going to try to finish this game, uh, by hopefully kind of funny games daily on Monday. Beautiful. We'll see how this goes. Can't wait. Can't wait to see the shenanigans. Uh, tune in live on Twitch. Twitch only, correct? Yes, Twitch only. Because of the whole YouTube, you know, you go longer, you have to create a new event. It's annoying. Uh, we're an 11 person business. All about live talkers. Go ahead, Bears. Yeah, I actually have a little bit of housekeeping and go ahead. Greg's not Look, Greg's not here, but blessing you are. Mhm. Twice now on KFGD, I have caught in strays over some Xbox stuff where you two mocked me. Don't think I don't see it.",
            "start": 175.04
        },
        {
            "text": "and go ahead. Greg's not Look, Greg's not here, but blessing you are. Mhm. Twice now on KFGD, I have caught in strays over some Xbox stuff where you two mocked me. Don't think I don't see it. No, I just I just want to say that. You talking about me? I don't I don't Andy does. No, no, it's Blessing and Greg the other day. Andy does the Paris voice, too. And he does it actually well. That's the problem is that me and Greg do a very bad job of it. So, it's funny cuz we were like, \"Oh, this is a terrible Paris impression.\" Andy, I got the range. I got Andy has the range. He can actually get deep. Point blank period. Wow. Nailed it. I [ __ ] crushed that. Yeah, you actually did. Has he ever said point blank period? Was that a thing? I've heard him say it twice and I was like that's his thing now to me. It may not be but it to me it is cuz I heard him say it twice. Uh we're in 11 business all about live talk shows after games cast is the third episode of our limited series. This is the",
            "start": 209.36
        },
        {
            "text": "now to me. It may not be but it to me it is cuz I heard him say it twice. Uh we're in 11 business all about live talk shows after games cast is the third episode of our limited series. This is the Elder Scrolls online show. Tune into that if you care about game development, if you care about game devs talking about the trials, tribulations, successes, everything that goes into making a video game. Uh, and this episode especially is, uh, what was cut from The Elder Scrolls Online video game, which that's always my favorite thing to ask devs whenever we talk to them. And it's always kind of a dicey thing cuz you risk the devs pissing off fans and stuff like that. So, they go in depth with it. It's really good. I I try not to get into hot water there. Uh, remember if you're a kind of funny member, today's Gregway is Roger with a little daily Doom: The Dark Ages journal, just like Blessing did with his Death Stranding, too. Yeah. Back to back. Stealing my shine. Yeah, stealing your shine",
            "start": 254.08
        },
        {
            "text": "today's Gregway is Roger with a little daily Doom: The Dark Ages journal, just like Blessing did with his Death Stranding, too. Yeah. Back to back. Stealing my shine. Yeah, stealing your shine right here. Uh, yeah. So, uh, I think it's 50 minutes or something like that of me every single time I've played the game. I I pull out my camera and I would just talk about it and, uh, how my opinion has changed all the way up until this review. Can I say that's such a good value if you're on Patreon, if you're a kind of funny member, right? Like two backto-back days of hourong unique content of, yeah, both me doing the Death Stranding 2 thing, Roger doing the Doom, the Dark Ages thing. That's a lot of content. That's what happens when Greg's not here. I mean, come on. Come on. Come on. Uh today uh or thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by Imperial, Auraf Frames, and Better Help, but we'll tell you about that later. For",
            "start": 293.04
        },
        {
            "text": "or thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by Imperial, Auraf Frames, and Better Help, but we'll tell you about that later. For now, let's start with topic of the showt. Doom: The Dark Ages, a prequel to the critically acclaimed Doom 2016 and Doom Eternal that tells an epic cinematic story of the Doomslayer's rage. Players will step into the bloodstained boots of the Dooms Slayer in this never-beforeseen dark and sinister medieval war against hell. I mean, it just sets the stage right there. This is the the sequel or the prequel, but a sequel. Um, already sitting at an 85 on Metacritic right now. Wow. Um, this is the obviously Doom Eternal came out in 2020. in 2020. Kevin, can you bring up the video uh for our first ever piece of pandemic content? Oh, yo, what's up? Welcome to Funny Games Cast. Do me a review. I'm only audio. We didn't have video for this. Didn't have video. We didn't think it was going to last",
            "start": 327.36
        },
        {
            "text": "ever piece of pandemic content? Oh, yo, what's up? Welcome to Funny Games Cast. Do me a review. I'm only audio. We didn't have video for this. Didn't have video. We didn't think it was going to last long. I also pushed that we could do video and everyone was like, \"No, it's too much.\" We were like, \"Ah, we don't need to do that. Don't worry about it.\" Like, we can do it. I have the technology. And they were like, \"No, no, it's we won't need that technology.\" This was four years. This was in March. This is March 2020. Just listen to the audio quality though. Like the audio quality is good. I feel like once he added video, then we're pulling it off a Discord. I'll tell you what, 3 years in the pandemic, I'm like, our audio quality is still better than all of ESPN. It's ridiculous. ESPN was like took a long time to catch up. Uh, but yeah, that's a weird little kind of look back at, holy [ __ ] we've been doing this for quite some time. Nick Scarpino was on that review with us. Yep.",
            "start": 381.72
        },
        {
            "text": "was like took a long time to catch up. Uh, but yeah, that's a weird little kind of look back at, holy [ __ ] we've been doing this for quite some time. Nick Scarpino was on that review with us. Yep. That's when he was like only 48 or something like that. Wow. Time time really flies by. Gotten hired like a couple months before that. Yeah, very good. I remember like I think I over yapped during that review and I remember reading the comments being like, \"Bless, you got to let other people talk.\" Uh, so Doom Eternal was a an 89 on Open Critic, Doom 2016, an 86 on Open Critic, and this is the more modernized Doom, Doom the Dark Ages, uh, running on IDTech 8, the brand new, um, engine that they have over there at ID. Um, I'd like to get everybody's kind of quick thoughts, you know, quick little just give me a couple sentence summary with your review score. If you've beaten it, how long did it take you? I know that this game is very much a chapter by chapter type game. It tells you how many",
            "start": 416.96
        },
        {
            "text": "just give me a couple sentence summary with your review score. If you've beaten it, how long did it take you? I know that this game is very much a chapter by chapter type game. It tells you how many chapters there are. I'd rather not say how many chapters there are for people that don't know cuz if you're I mean, it tells you in the game. It's like you're on this chapter of this many. It gives you the actual number. Damn, I didn't realize that. It actually does. Yeah, it does. Mhm. All right. Well, [ __ ] it. [ __ ] my idea. I didn't want to be like, well, we're on chapter, you know, 20 and somebody be like, oh man, that means um people saying don't say it. One person said don't say it. That's why don't say it. Just don't say it. Uh but how long did it take you if you've beaten it? Uh what did you play on and what score would you give it on the kind of funny score? Roger, I'll start with you. Hi. Uh I finished the game so I won't say the chapter thing. Uh I don't know how many hours.",
            "start": 464.44
        },
        {
            "text": "did you play on and what score would you give it on the kind of funny score? Roger, I'll start with you. Hi. Uh I finished the game so I won't say the chapter thing. Uh I don't know how many hours. It doesn't say. I was looking at like the chapter ending thing and I don't think it says like how many hours I put into it or whatever, but what did you play on? Uh PS5. I played on PS5 base PS5. Uh and I really really dug this game. Uh I was a big huge fan of Doom 2016. It's one of my favorite video games of all time. Doom Eternal a little bit of a step back for me even though it is a step forward in a lot of ways. Uh it just got a little too complicated with the gameplay. I was managing too many systems, dealing with uh too many uh you know, the ammo uh shooting off the top of the one enemy, switching weapons, it was just a lot to to for me to focus on, and I just didn't have as much fun. And also, the parkouring of it wasn't necessarily my thing. I had some fun elements with it, but it",
            "start": 508.24
        },
        {
            "text": "switching weapons, it was just a lot to to for me to focus on, and I just didn't have as much fun. And also, the parkouring of it wasn't necessarily my thing. I had some fun elements with it, but it wasn't my jam. So, going going into Doom: The Dark Ages and stripping all of that back and focusing on the uh on the ground Doom Slayer running around and just parrying things and with the shield, it just it feels heavier. It feels better and it also feels way more streamlined. I'm interested to see what the rest of the Doom community is going to think, especially the Doom Eternal people, because it feels like a step back a little bit because there is no double jump, there is no dash, there is uh a focus on uh streamlining these systems specifically when it comes to your health and your ammo. Uh you know, you are able to get health and ammo pretty frequently in this game. Uh you don't really have to deal with, you know, the chainsaw or different uh elements. you can just kind of go in",
            "start": 549.52
        },
        {
            "text": "Uh you know, you are able to get health and ammo pretty frequently in this game. Uh you don't really have to deal with, you know, the chainsaw or different uh elements. you can just kind of go in there and, you know, beat the game and fe and feel like you are constantly getting ammo and replenishing it. You don't have to worry about the chainsaw or whatever. Uh, with all that aside, I really really dug this game. This is my probably the best out of the three in terms of like the gameplay and the way that it feels. And this is my perfect middle ground. I don't love the story though. The story is like the big negative uh that is keeping that from an amazing score. But uh if I were to give a score right now, I would say it's an 85. really great blessing you're a junior for this I there's a comparison I want to make that's gonna be a little bit wacky but stick with me right like I'll stick with you big dump you know if you know me you know I grew up in Illinois and I remember like my",
            "start": 590.96
        },
        {
            "text": "a comparison I want to make that's gonna be a little bit wacky but stick with me right like I'll stick with you big dump you know if you know me you know I grew up in Illinois and I remember like my first time I had deep dish pizza oh that was going to be a Michael Jordan reference no I remember when Michael Jordan no I remember my first time I had deep dish pizza cuz my friend my best friend Abby at the time right her mom made it homemade and I ate it and I was like man this is some of the best the best food I've ever had in my life deep dish Pizza is blowing my mind. And for me, that was Doom 2016. Doom 2016 was the first time I had deep dish pizza where I was like, \"Oh, y'all have something here. Oh, this is a magical.\" You're on to something. You're on to something. Like, this is a special experience right here, right? I deep dish pizza for me is something that you cannot have all the time. It is something that I have every once in a while, right? Like I remember my second time",
            "start": 630.4
        },
        {
            "text": "special experience right here, right? I deep dish pizza for me is something that you cannot have all the time. It is something that I have every once in a while, right? Like I remember my second time having deep dish was like at Geodos or whatever, right? And like I remember coming I went to Chicago a few months ago for Magic Con with Mike and me and him. Uh went to I think it was Gordonos that we went to. It was either that or the other spot. Chat, let me know the other spots in Chicago that you go for deep dish. But it was one of those things where the more I have it, the more I'm like, \"All right, I love this. It's more deep dish pizza, but it's not as special as that first time for me.\" And that's kind of where I'm at with Doom: The Dark Ages where, you know, it's been every about four, five years, uh, that we're getting a new Doom game now. And the formula, the structure, like the core ideas of it stay the same. And so, as I'm playing Doom: The Dark Ages, I'm like, \"Oh, this is",
            "start": 669.44
        },
        {
            "text": "five years, uh, that we're getting a new Doom game now. And the formula, the structure, like the core ideas of it stay the same. And so, as I'm playing Doom: The Dark Ages, I'm like, \"Oh, this is fun. This is what I want.\" In a lot of ways, this is comforting. Like, I'm having a really good time with this game, but at the same time, it's not blowing my mind. And like that first time I I jumped into Doom 2016 and I was like, \"Oh, you guys like, you know, redefined what this is in a way that really made me fall in love with Doom.\" Uh, which is kind of crazy when you think about like the legacy of Doom and how far back Doom goes. Doom Eternal, uh, like Roger was talking about, right, added this mobility to it, added the air dash, added these things that had you like, you know, moving around the map a bit quicker. Uh, Doom: The Dark Ages, the thing that it does different is it grounds you a bit more. It turns you into a tank. Uh, I like that. One of the first things that happens um uh",
            "start": 705.2
        },
        {
            "text": "the map a bit quicker. Uh, Doom: The Dark Ages, the thing that it does different is it grounds you a bit more. It turns you into a tank. Uh, I like that. One of the first things that happens um uh when you uh start off the game is that you get dropped from a tall distance, you land and like all of the enemies [ __ ] die around you. Like you have like this shock wave and they keep that through the rest of the game where if you jump from a tall distance and land like all the enemies around all the fodder enemies around you will die. Like they really do a good job of characterizing you as as a tank, right? You have that you have the shield that you're using to stand your ground and parry. They don't have a dash in this game. They have like a um an R3 run, which I believe is new for this game. I don't remember that being in Doom, right? It was not in Doom Eternal. Exactly. And so like I I like the ways in which they're finding ways to make it slightly different, but at the end of the day,",
            "start": 747.84
        },
        {
            "text": "I don't remember that being in Doom, right? It was not in Doom Eternal. Exactly. And so like I I like the ways in which they're finding ways to make it slightly different, but at the end of the day, I think by the time I finished this game, cuz yeah, I I beat this game. I don't know if I said that before. By the time I finished it, I was like, \"All right, I don't know if I'm going to be thinking about this game that heavily toward end of the year or years from now as like a monumental experience that I had.\" But if you're somebody who loves Doom, if you're somebody who's looking for more of that experience, I think it gets the job done in a really good way. If I'm giving it a score, I'll give it an eight out of 10. Paris Lily, what about you? So, for me, I I wasn't necessarily a big Doom guy back in the day, right? So, when 2016 and then Eternal came in, you know, I gave him a shot. I honestly felt Eternal got a little overly complicated from from what from what I wanted from it,",
            "start": 785.36
        },
        {
            "text": "guy back in the day, right? So, when 2016 and then Eternal came in, you know, I gave him a shot. I honestly felt Eternal got a little overly complicated from from what from what I wanted from it, right? So going into Dark Ages and and Blessing and Roger have already touched on this. I feel like they streamlined it a lot more. And I think the thing that they've done with this is they've made it more welcoming to a more casual audience to someone that isn't familiar with Doom. It so you can kind of ease your way in because I love how you can customize the difficulty in this depending on what it is that you're trying to do. So I just played this on just a standard difficulty. I didn't I didn't tweak or modify anything beyond that. Oh, and I played this on PC and I actually have no idea how long it took me. I would guess anywhere between 15 to 17 hours, something like that. Um, I really enjoyed it. I really did. I I I felt this being more grounded and and like you're saying, Doomslayer is",
            "start": 825.68
        },
        {
            "text": "it took me. I would guess anywhere between 15 to 17 hours, something like that. Um, I really enjoyed it. I really did. I I I felt this being more grounded and and like you're saying, Doomslayer is more like a tank now instead of trying to have him flip and fly all through the air and do all this crazy stuff is what I wanted from it. I wanted to get a bunch of cool guns, get that freaking shield and just slay demons. And that's what I got to do in it. Um, I enjoyed the music in it as well. I think from a visual standpoint, it it looks fantastic on IDTech 8. They really did their thing when it ca came to that. This was a lot of fun to me. The story was the story. Honestly, I'm just killing stuff. It It didn't really matter to me about the story, but um I really liked it. I'm I'm gonna go score a little bit higher than than the other two. I'm gonna say a nine because I think this is just a firsterson campaign shooter and that's all it's trying to be. It's not trying to be anything else",
            "start": 871.12
        },
        {
            "text": "a little bit higher than than the other two. I'm gonna say a nine because I think this is just a firsterson campaign shooter and that's all it's trying to be. It's not trying to be anything else beyond beyond that. But it's a lot of gosh darn fun. And I also think there's replayability in this, believe it or not, because there's all the secret areas and things that you can go back and try and get because when you do get to the end of a chapter, it gives you the percentage of everything that you've done in that chapter. So, that does compel me to want to go back and see if I can 100% everything. Not to mention all the difficulty stuff. So, you can ramp up the difficulty in this. And I'm sure we'll get into that as we talk about this more. But, I I can't even imagine what nightmare difficulty is like on this thing. So, I definitely want to go back and check that out, too. Andy, thanks, guys. I didn't know you wanted to know my thoughts so much. Uh, I have not beaten it. I'm about 13 and",
            "start": 921.12
        },
        {
            "text": "is like on this thing. So, I definitely want to go back and check that out, too. Andy, thanks, guys. I didn't know you wanted to know my thoughts so much. Uh, I have not beaten it. I'm about 13 and a half or 14 hours in, something like that. I'm right kind of near the end, though. And, um, I I love this game. I love that in an era where a lot of studios and publishers are chasing the games as a service thing still or what's the best way to monetize blah blah blah. This is just a let's just give you a sick ass shooter with awesome action with fun mechanics. Um random boss fights that kind of pop up out of nowhere that kind of like oh [ __ ] I'm I'm excited to kind of take this on. um with a lot of different um levels of difficulty and customization. And I enjoyed that whenever I had an issue with something, there was always an accessibility option that allowed me to tweak things while I'm playing the game. I'm trying to play on one of the harder difficulties. I'm getting my ass",
            "start": 964.88
        },
        {
            "text": "an issue with something, there was always an accessibility option that allowed me to tweak things while I'm playing the game. I'm trying to play on one of the harder difficulties. I'm getting my ass whooped. I'm always getting shot from angles I can't see. And I'm like, \"Fuck, man.\" Like, I I I know I could be better if I just saw where that was coming from. Maybe you I could dodge it, jump over the the projectile or whatever. And then I looked in the accessibility settings and there's an option to turn on like directional wherever you're getting shot from. Oh [ __ ] Really? Yeah. And that would have changed my life. And it made me enjoy the game so much more to know that I'm dealing with this big [ __ ] And I know that there's a lot of smaller dudes kind of trying to catch up to me. Yeah. And I I don't know how close they are though, but those, you know, the directional things really help out a lot. Um, another thing that I remember when I previewed it and Blessing was watching, we",
            "start": 1016.64
        },
        {
            "text": "And I I don't know how close they are though, but those, you know, the directional things really help out a lot. Um, another thing that I remember when I previewed it and Blessing was watching, we were all watching the trailer and Blessing, one of Blessing's criticism was that whenever somebody is periable, they get outlined in a very, very purple bright outline sort of look. And that's obviously good for people who want the big notification, but sometimes it's a little too much of an outline and it's a little too bright. And the option is there to turn that off. And I turned that off and I enjoyed it a lot more as well because you only see the button prompts pop up to go kind of in for the finisher attack. I think this game just I think this game is like immaculately paced. I I'm I'm so blown away by how quickly you're getting in and out of the action and how they're kind of breaking up any sections that may start to feel monotonous. They I think they do a really good job of kind of",
            "start": 1059.36
        },
        {
            "text": "blown away by how quickly you're getting in and out of the action and how they're kind of breaking up any sections that may start to feel monotonous. They I think they do a really good job of kind of ending levels where you think they should end before they kind of go on a little bit too long or if you've seen the previews at all when you ride the dragon or when you do other sections they everything is like just as long as it needs to be which is I think awesome. At least in my opinion that's how I felt. I never felt like any one section kind of dragged on too long. Um, I enjoyed all the weapons. The like when I previewed it, I wasn't really blown away visually because I think IDTech has always been amazing and they have always looked so far ahead of their time. And so when I played it at the preview event, I was like, I mean, it looks awesome, but it doesn't look like what I thought the next generation of IDTech would be. And I was I was so [ __ ] wrong. I don't know if maybe I guess",
            "start": 1102.88
        },
        {
            "text": "the preview event, I was like, I mean, it looks awesome, but it doesn't look like what I thought the next generation of IDTech would be. And I was I was so [ __ ] wrong. I don't know if maybe I guess we were just playing on another build or something, but I played on like the highest settings possible and the uh I was just blown away by all of the lighting details, by all of the breakable objects that are still casting shadows and like the amount of tech going into this uh really really blew me away. I love the visuals. I love the lighting. Um and I love the fun of it. I think it's just a straight up fun ass shooter. If you're looking for something to just like turn your mind off, and you kind of will because the story is whatever. Yeah. Kind of a bummer because during the preview they were really kind of pumped about, look, you're not just kind of like experiencing things through little vignettes. You're getting we're giving you narrative. We're giving you finding everything through",
            "start": 1150.24
        },
        {
            "text": "really kind of pumped about, look, you're not just kind of like experiencing things through little vignettes. You're getting we're giving you narrative. We're giving you finding everything through codeex anymore. You're going through here. We're actually do cut scenes that are going to bookend every chapter. We're going to make this a big thing. And they were awesome to look at. They were hype with the content of them were cool, but I didn't care about what the things were being said or the sort of uh the antagonist. Yeah. Like I just I loved seeing what was happening because it looked visually impressive and and I get pumped up whenever the Doom Serge is looking at something and throws his arm out and the shield goes to his arm. Like it's just like it's just stuff to get stupid hype over. But it was nothing that I ever made me go, \"Oo, I wonder what the antagonist is going to do next.\" It's a weird one, right? cuz this is it's a prequel and it feels like it is trying to capture a new",
            "start": 1193.6
        },
        {
            "text": "But it was nothing that I ever made me go, \"Oo, I wonder what the antagonist is going to do next.\" It's a weird one, right? cuz this is it's a prequel and it feels like it is trying to capture a new audience or people that haven't played the other Doom games, but the story is so in the weeds like you know what I mean? Like I like there's no it doesn't feel like from the beginning of it it's like here's what's going on. Here's kind of the vibe of all these characters. It just kind of feels like you're in this world now and there's no way to jump on to any of it. I I don't know like I it's it did not feel it it felt like intrusive in some moments. Not too obtrusive, right? Because it's like two-minute cut scenes per chapter. you can easily skip those things, but it just felt like a weird choice with what they're going for when it comes to the gameplay and making this such an easy experience for everybody to have like this very in the weeds, whatever story that's that's so it's like I'm",
            "start": 1235.28
        },
        {
            "text": "with what they're going for when it comes to the gameplay and making this such an easy experience for everybody to have like this very in the weeds, whatever story that's that's so it's like I'm sure the the the nerds, the really big dude nerds are going to love this stuff. Uh but for me, I was waiting for the moment of like, oh, everything's gonna change. This is going to connect to this thing. And I was like, no, it just by the end of it, I was like, it's whatever. I even had some moments of surprise and shock in Warhammer Space Marine too where I'm like, \"Whoa, I didn't expect that plot twist.\" And here it just like I haven't gotten there yet. I'm not quite done with the game yet, but I still love the cut scenes cuz I think uh everything they're doing tech on a technical level is just so freaking impressive. And we don't talk about it 8 and or Tech enough. I know like Desim was always the one we always talk about. Itch is like so efficient and it runs so well and it looks amazing.",
            "start": 1270.88
        },
        {
            "text": "so freaking impressive. And we don't talk about it 8 and or Tech enough. I know like Desim was always the one we always talk about. Itch is like so efficient and it runs so well and it looks amazing. Go ahead. Wait, you did you play on PC? Yeah. Okay. That's Yeah, cuz I was going to go where you're going to go. Yeah, because I I wasn't actually blown away as much. Paris, were you about to say something? No. No. I was just I was going to echo what Andy said cuz I played on PC as well. And I mean, playing at ultra with ray tracing, u all the reflections, global illumination. I mean, it was stunning. Really, really did. So, so it is interesting that you on on console it wasn't as impressive cuz I was blown away by decade. I thought it was fantastic. It ran really well on a on a base PS5, right? I mean, it runs 60 fps, or at least to my eyes, 60 fps. It's super smooth. But this is the first time where I played a Doom game or an IDTech game where I was like, \"Oh, it felt like the entire",
            "start": 1308.88
        },
        {
            "text": "I mean, it runs 60 fps, or at least to my eyes, 60 fps. It's super smooth. But this is the first time where I played a Doom game or an IDTech game where I was like, \"Oh, it felt like the entire industry caught up.\" You know what I mean? Like, they finally caught up to where they are and now Doom feels good. It looks great. It looks amazing, but like it doesn't feel like a standout in the in the competitor field of everything that's going on. So, it didn't look bad at all, but it wasn't like a standout for me where the other Doom games were a standout um every single time. And I mean to to compleiment it though, right? Like I think the thing that did stand out to me in terms of what they're doing with the power of the consoles is how much is going on on screen at any time. Like the amount of enemies that they're throwing at you. This feels like the most enemies that you have on screen out of any Doom game so far. Um in fact, massive encounters. Massive encounters while playing this",
            "start": 1351.28
        },
        {
            "text": "of enemies that they're throwing at you. This feels like the most enemies that you have on screen out of any Doom game so far. Um in fact, massive encounters. Massive encounters while playing this game halfway through. I was like, I got to boot up Doom 2016 to compare and contrast. Uh and it was funny cuz I I looked it up on my PlayStation and I was like, [ __ ] I own this game physically. Do I still own this game? Like do I still have the disc? and I went and I dug out my Doom 2016 disc, put it in, and like, yeah, it's crazy the jump in terms of like how massive the battles feel this time around versus previous Dooms, uh, which I think really enhances it. And also the level of destruction that you're having on enemies cuz they I think they introduced this quite a bit in Doom Eternal as far as how Yeah. how enemies will degrade as you're shooting them down. And here it's the same thing. One of my favorite enemies was I forget the name of it, but it was an enemy that would ride around",
            "start": 1387.52
        },
        {
            "text": "as how Yeah. how enemies will degrade as you're shooting them down. And here it's the same thing. One of my favorite enemies was I forget the name of it, but it was an enemy that would ride around on like their mount. I love them. It's like you had to take out the guy. Like you would get essentially two uh like glory kill prompts, right? One for the guy that's on the mount. Like halfway through killing him, you would take him out and then it's okay. Now you're just fighting the beast and then you have to take out the beast. Like that type of [ __ ] is where this game exceeds, right? And like I think for me that's where I come I come around on, man, for me this is such good comfort food and it's such good like just pure mindless fun. I was just smiling like the whole time. I just had a great time with it. Um, I I don't know if I would give it a score yet. I'd probably like it'd be between 85 and nine for me because I'm I'm still so blown away by by the the fact that I think Roger makes",
            "start": 1424.96
        },
        {
            "text": "time with it. Um, I I don't know if I would give it a score yet. I'd probably like it'd be between 85 and nine for me because I'm I'm still so blown away by by the the fact that I think Roger makes a great point that the industry caught up and that's something that I was always kind of worried about, man. It's been there have been so many amazing indie games that have come out that look fantastic and play amazing. Witchfire, dude. Witchfire, even you know this Void Breaker demo that I can't freaking wait to come out when early access hits. There's so many awesome stuff that indie game indie devs or you know I guess still indie devs but people from certain studios that break off and make their own thing. There's a lot of amazing video games out there and how can this powerhouse still kind of prove to us that no well we're still doomed. Like don't don't get it mistaken, you know? And I think that they did that and I had so much fun with my time. Um, yeah, it'd be it'd be between an an",
            "start": 1463.04
        },
        {
            "text": "of prove to us that no well we're still doomed. Like don't don't get it mistaken, you know? And I think that they did that and I had so much fun with my time. Um, yeah, it'd be it'd be between an an 85 and a nine for now. Um, I I once I beat the game, I'll have a better decision there. Um, but I'd love to keep talking about this game a little bit more right after a word from our sponsors. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using",
            "start": 1507.8
        },
        {
            "text": "with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies. Boss fights and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies or buy them from other players online at the trading post. Imperial features three weapon archetypes: the fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other",
            "start": 1554.56
        },
        {
            "text": "excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are",
            "start": 1598.48
        },
        {
            "text": "it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So, the next time you need to call your mom, you can also send her a new pick of you from that trip you're telling her all about. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aura.com to get $35 off plus free shipping on their bestselling Carver Matte frame. That's a rafra.com. on promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they've avoided seeking mental health support due to fear of",
            "start": 1646.4
        },
        {
            "text": "that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they've avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindfunny. better betterhelp.com/kindfunn. And we're back to",
            "start": 1688.32
        },
        {
            "text": "to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindfunny. better betterhelp.com/kindfunn. And we're back to get into the nittyritty. And there's a lot of things that we can kind of go into right now. And the first thing I want to touch on cuz I would like to get some of the more negatives out of the way whenever it happens all the time with the games cast. Man, I love this game. This is an eight. Man, I love this game. This is a nine. Easiest recommend easiest recommendation I can make this year for an hour and then we talk and then we we sort of [ __ ] on it for a while. But it comes from love. It was just the map. We're talking about the map. Well, that's Yeah, you guys are right. The map [ __ ] it comes from a place of love. You know what I It's like, man, this game could have been perfect if this or but also this game is like such it is such an iterative game, right? That it feels like it is",
            "start": 1732.88
        },
        {
            "text": "comes from a place of love. You know what I It's like, man, this game could have been perfect if this or but also this game is like such it is such an iterative game, right? That it feels like it is like the the negatives like pop out because the game is so [ __ ] good. We've talked about it for so much that the negatives pop up. But yes, we should get the negatives out before we start talking about all positives. And you know, I'm kind of worried about even talking about this negative negative because I know that it will really kind of start fires for a lot of people because we know that um Mick Gordon and uh Doom Maternal and that whole issue and him, you know, a lot of drama, a lot of bad stuff, right? Um and the the audio in this game and the music in this game, first off, the music kicks ass. I think the audio mixing in this game is real real bad. And it took every other level I'm lowering up. I'm raising the volume of the music cuz it's way too quiet. And the and and then some",
            "start": 1778.88
        },
        {
            "text": "kicks ass. I think the audio mixing in this game is real real bad. And it took every other level I'm lowering up. I'm raising the volume of the music cuz it's way too quiet. And the and and then some of the shooting is like getting cl it's clashy with each other. It's kind of like oh that doesn't sound very good. Like there was a lot of moments where I I have issues with the audio and and it again it feels like I'm trying to start drama like oh Mick left and now look at the audio. Like no, like I think that's a legitimate critique cuz I also was missing some of those needle drop moments that you've had out of previous Dooms where I can I can call out names of songs, right? I BFD BFG division from Doom 2016 is one that I still have on repeat at times and I don't think I had any moment of of that from Doom the Dark Ages. In fact, like probably about halfway through or so, I was like, \"Fuck it, I'm just going to put on my own music. Like I'm going to rock out to my own stuff while",
            "start": 1824.32
        },
        {
            "text": "of of that from Doom the Dark Ages. In fact, like probably about halfway through or so, I was like, \"Fuck it, I'm just going to put on my own music. Like I'm going to rock out to my own stuff while playing this game.\" I I recommend uh people unless patches go through or anything like that, who knows what the the day one patches could be. Uh cuz I got to assume that they it feel they have to be aware that it isn't as good as it can be. So I would recommend 100% volume on the music and maybe like 75 or 80 on the sound effects. I even did that and I just didn't feel like the music was loud enough. Like and I thought I thought it was like a revisionist history thing, right? Cuz like we think about the music so heavily with Doom. So I went back and I played Doom Eternal. I'm like, \"No, this is way better.\" Like the mi mixing in that game is is substantially better than in Doom: The Dark Ages. So, I couldn't find a good middle ground. I played with really nice headphones. I played on my TV.",
            "start": 1869.12
        },
        {
            "text": "way better.\" Like the mi mixing in that game is is substantially better than in Doom: The Dark Ages. So, I couldn't find a good middle ground. I played with really nice headphones. I played on my TV. I switched my settings and I just I couldn't figure it out. Yeah. I I also don't think the the music is totally fine. Yeah. But I don't think it has like that replayability as Blessing is saying. Like I I will never listen to this on Spotify when it comes out and that sucks. I I think it could have been I I still think the music is awesome though. It's very metal. It's different tempo type [ __ ] I I I loved it and I think it would have been more impactful had it been implemented in a in a better way. Paris, you you you enjoyed the music. Did you feel at moments like I felt where because they hit you with sort of open roam moments, the natural sort of fading out and fading in of the music when you're starting encounters didn't feel so natural in the way that Spider-Man does it when you're",
            "start": 1909.6
        },
        {
            "text": "hit you with sort of open roam moments, the natural sort of fading out and fading in of the music when you're starting encounters didn't feel so natural in the way that Spider-Man does it when you're about to start swinging. This it felt kind of lacking for me. What are your thoughts on the audio Paris? Yeah, I mean to that point I think you're correct. I just think overall I thought the music was fine. Um I guess I guess I never looked at it from Roger's point of view. I was like, do I want to replay this on the Spotify playlist? I never thought about that. But I thought in the moment as as I'm going through the game, some of the beats really kept me engaged at, you know, as I'm in these battles. But the transition from that, you know, to quieter moments, I I think you're kind of spot on about that. They could have been a little better. And it is funny that you say as far as the audio mix goes cuz I cuz I play with these exact headphones on and I'm like do I have this pitch too high?",
            "start": 1949.76
        },
        {
            "text": "about that. They could have been a little better. And it is funny that you say as far as the audio mix goes cuz I cuz I play with these exact headphones on and I'm like do I have this pitch too high? It's like what you know? So I was kind of messing with that a little bit as well. So maybe to your point after, you know, there might be a day one patch or something might come out later that addresses some of that. But I think people should go in expecting for for the audio mix to be a little little pitchy in my opinion. I thought the same thing when I did the preview. whenever you see a bunch of enemies out in the distance. And a cool mechanic in uh this game is obviously you have your sick ass shield. And we'll get into all the mechanics here in a bit. Talk about the shield. When you heat when you shoot an enemy shield with bullet projectiles uh and eventually with laser guns, they happen to it. It just happens faster with bullet projectiles. You'll see the heat the shield start to",
            "start": 1990.72
        },
        {
            "text": "when you shoot an enemy shield with bullet projectiles uh and eventually with laser guns, they happen to it. It just happens faster with bullet projectiles. You'll see the heat the shield start to heat up, turn a really really bright yellow color. You throw your shield, boom, it pops. It breaks everybody else's shield and you get a lot of armor coming to you. And I wish I could just take the armor sound and lower that down a bit because it hits you in chunks like I think it's it's a it's a console specific issue because if you play on console by default it comes out of the controller. So I I because I played with my pulse headphones so it wasn't coming out of my controller. It was coming out my headphones and yeah that [ __ ] sounded ugly. Yeah. They they need to figure out a slider there cuz yeah, when I turn it on for the controller, I was like, \"Wow, this is loud as [ __ ] I need to I need to put on my headphones.\" I thought those sound effects were a bit overwhelming at moments.",
            "start": 2030.88
        },
        {
            "text": "cuz yeah, when I turn it on for the controller, I was like, \"Wow, this is loud as [ __ ] I need to I need to put on my headphones.\" I thought those sound effects were a bit overwhelming at moments. And I I hope that they can figure out a better mix cuz there's a lot of awesome accessibility issues or accessibility settings with gameplay and visuals and all sorts of things like that. And I would love for the audio to have as, you know, customiz customizable uh options as you can. One more talking about it, right? Like this might be a very specific my setup kind of thing, but I was playing on PS5 with my Pulse headphones and when I tell you the intro like sound stuff for the game, like when you first boot up the game sounds so crunchy in that way and I don't know if that's a patch. I don't know if that's a oh, you just can't listen to it at the volume level that I'm at, but it it I I could see like a lot of this stuff maybe getting fixed in Yeah, I I really really hope so. Um, so that's",
            "start": 2073.84
        },
        {
            "text": "if that's a oh, you just can't listen to it at the volume level that I'm at, but it it I I could see like a lot of this stuff maybe getting fixed in Yeah, I I really really hope so. Um, so that's yeah, my biggest issue with this game is the audio and that's a bummer because it it's so important to the Doom experience having that Yeah. that cut scene start with a like and also anybody all think that uh the intro music kind of Did you get the Cyberpunk 2077 vibes? I always kept on expecting [Music] Welcome to Night City. I always kept on waiting for that to pop in. Um, I'd love to talk about um weapons and and how some of them are kind of not necessarily throwbacks, but some of them are more medieval kind of I would because that's going to be a positive conversation. One more thing I want to I want to uh talk about which I think might be a little bit mixed to positive is the difficulty cuz like I remember in Oh, I got some I remember in talking about Doom Eternal during our review, one",
            "start": 2111.12
        },
        {
            "text": "I want to uh talk about which I think might be a little bit mixed to positive is the difficulty cuz like I remember in Oh, I got some I remember in talking about Doom Eternal during our review, one of my bigger critiques was it felt like Doom Eternal the normal difficulty which I believe has always hurt me plenty was tuned on the way difficult side. Um and I remember getting frustrated toward the end being like I got to lower this [ __ ] down. Like this game is [ __ ] kicking my ass in the in the last few levels. I remember that one enemy that just wouldn't die the [ __ ] I forget his name but like we were like I need a parry for you. Yeah. Yeah. I was like this guy's all over the place. And they were like we agree. They were like we got to get this guy out of here. Let's make a whole game with parry. Doom the Dark Ages feels tuned on the opposite direction where for every Doom game I always play on Hurt Me Plenty cuz I look at that as the default normal difficulty. I was breezing",
            "start": 2161.84
        },
        {
            "text": "game with parry. Doom the Dark Ages feels tuned on the opposite direction where for every Doom game I always play on Hurt Me Plenty cuz I look at that as the default normal difficulty. I was breezing through this game. Um and like when we talk about the new mechanics being added, right, the big new thing is the parry and the shield and stuff. When I tell you the default parry window feels so generous and you can tweak it. They have like a very specific like oh you can go in here and make it smaller. If you play on this higher difficulty it'll make it smaller. All that stuff. Um but I found that fascinating that on the default difficulty that [ __ ] dude I'm parrying everything. I'm knocking everything back. For the first time in my [ __ ] life, I played a game on hard. And and like I played most of this game, I think from chapter 8 to the ending on hard. And I had a great time because of that because the first eight chapters I played on regular and I was just, man, this is way too",
            "start": 2197.84
        },
        {
            "text": "most of this game, I think from chapter 8 to the ending on hard. And I had a great time because of that because the first eight chapters I played on regular and I was just, man, this is way too easy. I actually went in there and I made the peri window to the smallest possible. And I still felt it was too easy. Really like I think there is some patch they even patched the um the version that we were playing with cuz there was some issues with the parry window. Um, even after that patch, I was still I still felt it was too easy. So, I think there's going to be some, especially with the audio mixing with this, that they're going to start tweaking afterwards to make it right. But it the parry window just never felt perfect. I mean, here's the issue. We just finished I just finished Expedition, right? So, Expedition has such a perfect parry window that I'm like I maybe it's just that I don't know. I also think it's the fact that it's a first-p person shooter that they're trying to do like",
            "start": 2237.52
        },
        {
            "text": "right? So, Expedition has such a perfect parry window that I'm like I maybe it's just that I don't know. I also think it's the fact that it's a first-p person shooter that they're trying to do like a a parry with. And I think that it was them figuring it out it out a bit. I think overall it's been a it's it's a success in the game. like I grew to really like the parry. Um especially with how they do it with the different types of projectiles where whenever you see a green projectile or a green melee move from an enemy, those are the ones that you can parry. Um I think it felt additive to the experience, but yeah, it never felt tuned to like when you're playing a third person action game and the parries feel perfect. I think a lot of that has to do with Yeah. first person the perspective of you not exactly knowing in a third person game, you know where that swing is about to hit you. first person might throw off your your view point for Paris, what were your thoughts on the um",
            "start": 2274.24
        },
        {
            "text": "of you not exactly knowing in a third person game, you know where that swing is about to hit you. first person might throw off your your view point for Paris, what were your thoughts on the um difficulty? Yeah, I I definitely want to jump in on that because I I like I said before, I left it all default. I didn't change anything. So, I essentially played it on the the normal difficulty that they wanted you to play on. And to your point, Roger, it was extremely easy until about chapter 12. Yeah, I felt that it got a little more challenging at that point. And then when you get to the end, I reflected and going, man, I should have played this on hard. So to that point, I do want to go back and start it from the beginning and play it on a harder difficulty. And I and to your with the pairing, I didn't tweak any of that. I wanted to play it just as it was. That patch did come in. I didn't think it really did anything beyond what it was already doing. So that would be a suggestion I would",
            "start": 2308.4
        },
        {
            "text": "I didn't tweak any of that. I wanted to play it just as it was. That patch did come in. I didn't think it really did anything beyond what it was already doing. So that would be a suggestion I would have for anyone that is a veteran to to first person shooters. Don't play it on the default difficulty. ramp it up if you want more of a challenge cuz you essentially will breeze through about I don't know probably threequarters of this game on that difficulty. I Yeah, breeze through the entire game honestly. Yeah. And you won't it won't even be like more of a challenge. I think you'll have a lot more fun honestly cuz then you'll be able to experiment with all the weapons because at least for me those first eight chapters I was just using one gun and I could have just finished the entire game with that one gun. That's how easy I was using the plasma rifle the entire time. I mean there's a lot to talk about because we can get into the nitty-gritty of the combat now where the weapons are",
            "start": 2353.68
        },
        {
            "text": "with that one gun. That's how easy I was using the plasma rifle the entire time. I mean there's a lot to talk about because we can get into the nitty-gritty of the combat now where the weapons are fantastic. The weapons are fantastic. And I real quick, I just want to say I played on uh I played on nightmare difficulty, which is the it seems like there's seven difficulties or eight. I don't know how many. It's crazy. I'm on cuz there's aspiring slayer, there's hurt me plenty, there's ultraviolence, and then there's nightmare. I've been playing on nightmare and it's really challenging and it gets like and I've been I've been dying a a decent amount every like I've been using my my life relics which is like your kind of immediate resurrection power which is awesome. uh not a power just kind of ask you if you want to use one or whatever. But like it is a great amount of challenge and I turned it down to ultraviolence because I was like, \"Oh, I want to try to beat it before the review.\"",
            "start": 2390.96
        },
        {
            "text": "of ask you if you want to use one or whatever. But like it is a great amount of challenge and I turned it down to ultraviolence because I was like, \"Oh, I want to try to beat it before the review.\" And you know, there's a lot of moments where I'm right there close to beating a massive boss and you kind of like do the gamer lean and you kind of get up close. You're like, \"I'm going to [ __ ] get your ass.\" Like it's I think it's a a really an amazing amount of fun difficulty as opposed to like a frustrating type of difficulty. I will say I still had plenty of fun playing it on the default difficulty because it was kind of that turned my brain off. I am taking down everything. And this time around, this time around on default difficulty, they're very generous with resources. I remember in previous Doom games running out of ammo and like being down to my last couple of guns and being like, \"All right, like I have to use this thing.\" Right here, to the point of Roger talking about using",
            "start": 2433.68
        },
        {
            "text": "previous Doom games running out of ammo and like being down to my last couple of guns and being like, \"All right, like I have to use this thing.\" Right here, to the point of Roger talking about using one gun for most of it in this time around, I'm late game. I'm just going back and forth between two two guns. I got the Oh, what's the one that crushes the skulls? Is it the ravager or whatever? It's the skull crusher, but there's one really awesome thing about this game is there's a lot of weapons and some of the weapons have two variants and they switch up either this one has less bullet spread, but it does less damage or whatever. Like they give you kind of two variations and and don't forget the upgrades. What's up? Don't forget and you can upgrade and you can you can upgrade the weapons and the shield and all in the melee as well. Upgrading the weapons is fantastic and I've been using the upgraded version of the skull crusher that you were talking about busting because it's a bit of",
            "start": 2473.12
        },
        {
            "text": "and the shield and all in the melee as well. Upgrading the weapons is fantastic and I've been using the upgraded version of the skull crusher that you were talking about busting because it's a bit of a a tighter shot window. It isn't as spread out, you know. Yeah. So, for me it was that in the super shotgun and then occasionally I would switch to other weapons just to like, you know, have some fun or I added one upgrade to the rocket launcher that gave it a certain benefit and I wanted to try that out. But for the most part, I'm sticking to those two weapons and I'm having I mean, super shotgun for Doom is such a classic. It's like my old reliable kind of thing and I'm upgraded to the faster shots. Oh, of course. No, I upgraded that thing all the way as soon as I could. Um, but I'm doing that. I'm like the the melee this time around is what gets you ammo from enemies and it's way more generous than in previous games or chainsawing, but like you can chainsaw once and it's like a",
            "start": 2514.72
        },
        {
            "text": "doing that. I'm like the the melee this time around is what gets you ammo from enemies and it's way more generous than in previous games or chainsawing, but like you can chainsaw once and it's like a limited resource and so you have to pick and choose when you do that. Here you have uh three me depending on the melee weapon that you have. Um you have a certain amount of melees that you can do but that replenishes fairly generously. Um depending on which one you use. Depending on which one you use. Yeah. Uh, and like I was just getting I was getting ammo back. Like I had a rotation of shotgun in the face, melee you one more shotgun, end you with a glory kill and then and then shield bash shield basham and throw my shield at you that thing gets stuck in you and like [ __ ] starts in your chest. We got to talk about the shield cuz cuz to me this is in Mario Odyssey I that was like my first 3D Mario game that I really got into and I loved and I fell in love with Cappy. I love Cappy so",
            "start": 2549.36
        },
        {
            "text": "chest. We got to talk about the shield cuz cuz to me this is in Mario Odyssey I that was like my first 3D Mario game that I really got into and I loved and I fell in love with Cappy. I love Cappy so much. It's my favorite game mechanic. I go back and I'm like [ __ ] I wish I had Cappy. That's what I feel like is gonna happen with Doom. If we take away the shield, I'm gonna be [ __ ] pissed because I can't live I can't play Doom without the shield. I played a little bit of Doom Eternal um after I finished this game and I was like, man, I just need the shield cuz it it changes the way you play this entire game. As as Blessing alluded to, you can take the shield, you can throw it at an enemy, and it stuns them for a very generous amount of time where so then you can focus in on that. Now you don't have a shield. So now you're you're you're vulnerable to a lot of uh things, but you can go around, you can end that enemy, you can you can really do a lot of great strategic stuff with it. And",
            "start": 2588.16
        },
        {
            "text": "don't have a shield. So now you're you're you're vulnerable to a lot of uh things, but you can go around, you can end that enemy, you can you can really do a lot of great strategic stuff with it. And it's just [ __ ] badass, dude. It's so cool. Honestly, shout out. It's the Captain America fantasy. Yes. I was going to say shout out to Rogue Lights for I think helping out with a lot of not helping out, but just I I think getting game developers and creatives more creative with what abilities how abilities can upgrade and how things can get better and continue to progress. Cuz I loved so much. The weapons that I mained were I mean I kind I'm kind of using a lot but for a while I was like super shoddy all the way of course for short for close-range type [ __ ] but then I ended up using the normal shotgun again cuz I upgraded it to have the three round and then it lies lights people on fire while it's doing that and then the second upgrade for the plasma laser weapon or whatever. The",
            "start": 2624.56
        },
        {
            "text": "normal shotgun again cuz I upgraded it to have the three round and then it lies lights people on fire while it's doing that and then the second upgrade for the plasma laser weapon or whatever. The first one you get little uh a weaker but a much faster shooting type of uzi just very very very fast rapid fire thing. But then you get an upgrade that's a bit more of a medium range. It shoots a little bit slower but upgrading that one and the lightning or the the electricity sort of stunning enemies and then chain lightning to other people was such a freaking blast. Dude, will chain lightning ever get old? No, never is so [ __ ] cool. It's always the best thing in a game. What do you think about this game has all the coolest [ __ ] in the world? Like it has chain lightning and it has a shield, it has parrying. Like this is just the coolest game ever, dude. And then uh and then the the standard like assault rifle. Just the the spike sort of shot thing was just so fun. The way it feels. So,",
            "start": 2669.68
        },
        {
            "text": "it has parrying. Like this is just the coolest game ever, dude. And then uh and then the the standard like assault rifle. Just the the spike sort of shot thing was just so fun. The way it feels. So, one thing I loved was whenever there's a large enemy and kind of I think this game is just like a beautiful symphony of violence cuz there's so many things you could do together to just have fun. And that's a back of the box quote right there. Yes, it is. I would throw I would throw my shield at one of the large enemies and the shield when it's embedded in an enemy like Roger was mentioning earlier, they get stunned and they kind of like wait there, right? But then I upgraded my AR. The I call the AR, but I I upgraded the AR to then when I'm shooting the enemy, it spreads bullets to other enemies around it. And so other enemies are getting hit by the bullets that are also hurting the main dude. And then you could obviously recall the shield, shield bash. Um, the other weapon I was using",
            "start": 2718.08
        },
        {
            "text": "around it. And so other enemies are getting hit by the bullets that are also hurting the main dude. And then you could obviously recall the shield, shield bash. Um, the other weapon I was using quite a bit was the uh the the medium skull crusher one, which I was mentioning earlier. That's another like absolute fun weapon that I had a lot of a lot of fun with, especially with the larger enemies when there's so much real estate to hit these enemies in. And these crush projectiles, you see them kind of perfectly covering the size of the enemy and it's just shredding them down. You're seeing the body parts disfigure. It's amazing. I love the upgrade on that one because you can upgrade it. So once you're at full like cuz it ramps up like a like a turret, right? So once you get to that full ramp up, then you do extra damage and with like with then getting the glory kill, then you just get unlimited ammo pretty much and you're just going and you just constantly have that right trigger going.",
            "start": 2762.88
        },
        {
            "text": "up, then you do extra damage and with like with then getting the glory kill, then you just get unlimited ammo pretty much and you're just going and you just constantly have that right trigger going. It is it is so cool once you can figure out that type of gameplay. The upgrade I wanted to mention was on the the second plasma gun that I really love the the slower one. Yeah, I I love that weapon because of the stunning, because of everything, but then the highest I think one of the highest upgrades you get on it. Uh, and you find these uh upgrades either through finding money throughout the world or secret areas where you get these rubies. The ruby the size of the tangerine. I have to say that every time. Every time I get a ruby. What do you What is that from? Michael, like what movies? [ __ ] Dark Knight. He found a ruby the size of a tangerine. Come on. [ __ ] Jesus. He don't know. He just saying, \"Yeah, I mean, I love the dark, but where where was the Ruby in that movie? Where you",
            "start": 2810.16
        },
        {
            "text": "Dark Knight. He found a ruby the size of a tangerine. Come on. [ __ ] Jesus. He don't know. He just saying, \"Yeah, I mean, I love the dark, but where where was the Ruby in that movie? Where you find the Ruby?\" I saw I saw that, too. I saw that moment of him being like, \"Yeah, yeah, yeah.\" Like, I don't want I trust him, you know? He's not going to lie to me. Trust He's not going to lie. It was the monologue about about the crazy what was it? The Yeah, the little the village that burned down the whole village or whatever. He's talking little Joker analogy. Little Joker. He did it again. The actual Ruby in the movie. He did it again. Yeah. There was never a real dark night. Was that not right? Was that Rises? It was Dark Knight. Yeah, it was Dark Knight. He was talking about the Joker. He was talking about the Joker. How like this one guy was stealing uh uh he was stealing from everybody and never to use it just because of chaos and he was just like some people want to watch the world",
            "start": 2850.0
        },
        {
            "text": "was talking about the Joker. How like this one guy was stealing uh uh he was stealing from everybody and never to use it just because of chaos and he was just like some people want to watch the world burn. Just want to watch the world burn. Um the other So I upgraded that one all the way and as you're shooting people it shoots faster, gets stronger and then it starts dropping health. Oh yes. And it was called like the vampiric whatever. And that's like I love vampiric type [ __ ] in abil in uh games whenever you're leeching life off of people. So that ability felt so much freaking fun. Paris, what were the weapons that you felt yourself kind of uh I was leaning towards the plasma like you were, but I love the super shotgun and I love the shredder. Those were probably my go-tos that I was constantly going to. Yeah. Was that the shredder's the AR, right? Uh-huh. Yeah. Okay. Gotcha. Yeah. And then Yeah. Actually, I think that's exactly what you talked about as far as the upgrade because",
            "start": 2887.28
        },
        {
            "text": "constantly going to. Yeah. Was that the shredder's the AR, right? Uh-huh. Yeah. Okay. Gotcha. Yeah. And then Yeah. Actually, I think that's exactly what you talked about as far as the upgrade because you have that upgrade where it will spread spread out the the bullets to other ones and then the plasma had one where it took I think that was Yeah, it was the plasma where it would take out everyone's shield immediately when you hit an enemy. Yeah. So, I Yeah, I freaking loved it. Absolutely loved it. Also, the shield has its own upgrade path that you kind of unlock later on. And really cool stuff there that I'm not sure what I'd love to find out what the numbers are, the numbers differences as far as what damage they do to actual things and you know what the best minmax is or whatever, but I kind of just went for whatever shield upgrade I thought looked the coolest. Same. And uh one of them that you eventually unlock uh if you parry a projectile, your little shoulder turret pops up and",
            "start": 2931.36
        },
        {
            "text": "I kind of just went for whatever shield upgrade I thought looked the coolest. Same. And uh one of them that you eventually unlock uh if you parry a projectile, your little shoulder turret pops up and and just starts shooting. Oh, I didn't like that one just cuz I felt like it was just like tickling them. Like, you know what I mean? I didn't feel like I was doing anything. I was like, I'm not doing this. Well, that's not the one I used. I used the one with like the the spirit birds or whatever the [ __ ] Yeah. Like these magical sort of things. Uh Paris, how did you upgrade your shield? What did I do exactly? Cuz one of them when one of them when you parry you kind of set a trail of fire on the ground. All the runes that you apply. Yeah. I don't you [ __ ] I don't remember. I don't remember. He was just so into play eternal because I was because part of Well, no, because part of with the upgrades I kept putting into the weapons. Yeah. More so than than the shield. I was trying to",
            "start": 2977.84
        },
        {
            "text": "He was just so into play eternal because I was because part of Well, no, because part of with the upgrades I kept putting into the weapons. Yeah. More so than than the shield. I was trying to think. I did it twice with the shield. [ __ ] I can't remember. Can I fire it up right now and tell you? Well, we should talk about the upgrades in terms of how it is presented to you, right? In Eternal, you're just kind of finding these things and you can upgrade a certain weapon. In this one, you it is based on exploring the levels and finding coins, finding rubies, finding what was it the other one, the the weird purple crystal sapphire, a wrath gem or something like that. So, and they have like um so gold you can find anywhere and then the rubies and then the wrath gem that is based on finding puzzles. lot more. A lot more secretive stuff. Uh I was negative on that at first cuz I was like, I just want to [ __ ] upgrade my gun. I want to [ __ ] go from here to here. I don't want to have to do",
            "start": 3023.2
        },
        {
            "text": "lot more. A lot more secretive stuff. Uh I was negative on that at first cuz I was like, I just want to [ __ ] upgrade my gun. I want to [ __ ] go from here to here. I don't want to have to do this. But then I open up the map and I was like, \"Oh, they just show me where all this is.\" Which I did not. I told Blessing about that. He's like, \"There's a map?\" It's kind of weird. Cuz I've never opened a map in a Doom game. I would just go from one place to another, just [ __ ] end it. Uh but for here, I was I was 100%ing levels. Like I was actually going in there. Actually, no, 98%ing levels cuz I would always forget one [ __ ] gold piece and they would count that towards that. Whatever. [ __ ] the the map way more improved this time around. Way more improved. It's not this really hard to look at hologram thing where you're like what what floor am I on? Like uh you know in in it I forget if it was Eternal or the first or Doom 2016 that used that sort of hologram look which aesthetically",
            "start": 3068.4
        },
        {
            "text": "at hologram thing where you're like what what floor am I on? Like uh you know in in it I forget if it was Eternal or the first or Doom 2016 that used that sort of hologram look which aesthetically looked awesome but it was really hard to tell what like the maps would the the floors would be kind of overlaid on each other and it was really kind of hard to to to grasp what the hell was going on. But they made it a bit easier with kind of opaque floors and letting you know. I did think it was flat level design this time around. Well, yeah, cuz there's no verticality, right? Yeah. I did think it was kind of weird though that they showed you where the secrets were. Like I love that. It's a little weird, but for me, I was I was cool with it because then it allows me to upgrade everything and go in there and actually find a lot of secrets that I wouldn't have found otherwise. And really cool stuff. Like really cool secrets here. really cool level design, especially towards the ending of the",
            "start": 3103.28
        },
        {
            "text": "in there and actually find a lot of secrets that I wouldn't have found otherwise. And really cool stuff. Like really cool secrets here. really cool level design, especially towards the ending of the game when there's this one which I'm not going to spoil where it is or how it happens, but there's this one where it's like cuz usually you go to find a secret level and it's just one ruby or whatever, right? There's this one that kind of follows the entire map and it's like four to five different secrets all in one. It feels like a huge chunk of the game. Like it feels like it's it's a like a main path but it's not. It's like one long secret path. Really cool stuff the way they ramp it up. See, the one that I liked was and I wasn't um expecting was there was like a a ruby that was behind a wall that I could see and I just had to like go around and get it. And I went around and like look for it. I'm like, \"Oh, where'd it go? I thought it was in this room.\" And I come out of this room and",
            "start": 3142.48
        },
        {
            "text": "that I could see and I just had to like go around and get it. And I went around and like look for it. I'm like, \"Oh, where'd it go? I thought it was in this room.\" And I come out of this room and like they do like a trippy thing of, \"Oh, you're not where you thought you were.\" Now it's a combat challenge. We're throwing 100 enemies at They do they also do a fun one where you throw uh a shield at certain things where like the shield like almost like Kratos when he throws it at like the um the ice thing where it like locks the the door. You have to throw it there and it opens up a gate but you can't take back the shield because then you'll close the gate. So you throw it there and then you go around the corner and up there's a million enemies. Now you got to fight them without the shield. I wish they did a little bit more of that cuz that would have been like a nice way to like actually in the main game switch it up. But that like things like that add to the experience. So, I'm I'm",
            "start": 3178.96
        },
        {
            "text": "I wish they did a little bit more of that cuz that would have been like a nice way to like actually in the main game switch it up. But that like things like that add to the experience. So, I'm I'm actually very happy they did upgrades like this because this game is a very short game in the grand scheme of things. Like 13 12 13 hours. I feel like you can mainline this game. Hey, in 12 13 hours, I feel like and if you're playing on easy or whatever, like or or regular, I feel like you can mainline this game without doing any secrets in in a in a very short amount of time. So, forcing you to kind of go outside the boundaries and find the secrets is very important for the length of this game and and really understanding the whole depth of it. Chad, I'd love to you all uh for y'all to prep your super chats while we ask Paris um what what were we asking Paris? Ask me about the shield. I I recorded all I recorded all my gameplay. So I was like [ __ ] let me go back and find where I was",
            "start": 3212.96
        },
        {
            "text": "your super chats while we ask Paris um what what were we asking Paris? Ask me about the shield. I I recorded all I recorded all my gameplay. So I was like [ __ ] let me go back and find where I was actually doing upgrade. So the last upgrade I did on the shield was the power surge where it you throw the shield and it'll cause it to bounce around and hit a bunch of different enemies. That was the last one I did. Everything else I was putting into weapons. Captain America vibes right there. I I love again because of the amount of enemies they throw into a lot of the combat encounters. I love the ways in which they let you take care of a lot of them at once. Like I mean talking about the shield, we might have mentioned this before, but I know we mentioned the plasma thing of if you have enemies with plasma shields, there's plasma weapons that'll overload the shields and those will explode in their faces. They also for the metal shields, if you do enough damage to them, they'll then blink",
            "start": 3246.88
        },
        {
            "text": "with plasma shields, there's plasma weapons that'll overload the shields and those will explode in their faces. They also for the metal shields, if you do enough damage to them, they'll then blink red and if you throw your shield at them, like [ __ ] explodes everybody. That's where you get the loud ass armor. And that was always satisfying to me. Always great. Um the sh also the shield bash which is if you're playing on PC if you're blocking with your right click then you left click and you just very you just autozip towards somebody and then that causes a massive sort of uh you know big sort of area of effect blast killing a lot of the fodder enemies and those are essentially your reloads to get more armor, more ammo, more health you know. Um, and I I I there were times while playing this game that I missed the dash, like the air dash from Doom Eternal, except for when I was reminded that I could do that. The shield bash kind of functions at that as that a little bit. Like if you",
            "start": 3287.04
        },
        {
            "text": "this game that I missed the dash, like the air dash from Doom Eternal, except for when I was reminded that I could do that. The shield bash kind of functions at that as that a little bit. Like if you just see an enemy from far away and you want to get to them fast, like it works from quite a bit of distance of L2 to lock onto them, R2, and then you shield bash right towards them. I thought that was a really great mechanic. I do wish there was some sort of just dodge. Um, especially with the parries, like I I need a little because like there's some moments where you're you're do you're doing one parry and then the other parry is over there and you have to kind of run to it and it just I want just a little bit of a side dash. It felt like I'm kind of with with how some of the projectiles work. Enemies will shoot out, you know, three red blasts with one green in the middle, right? But sometimes it but sometimes they are connected by a red gate of damage that will hurt you if you hit it.",
            "start": 3332.4
        },
        {
            "text": "Enemies will shoot out, you know, three red blasts with one green in the middle, right? But sometimes it but sometimes they are connected by a red gate of damage that will hurt you if you hit it. So you can't just stand in between these shots. So sometimes the green one will be on the very far right with a big gate and then you parry that one and then the next wave it'll be on the far left and it feel it did feel cool to like start to sprint to get over there. And I think the window is large enough and and generous enough to where you can parry it. just I I would have felt mechanically cooler to be like dodge left. I think that's why the per Now remember, yeah, you can dodge when you're on the dragon. Yes, we haven't talked. We got to talk about that. I the dragon segments and the mech segments for me left more to be desired. I was not looking forward to it. Yeah, when I whenever those segments start, I'm like, \"All right, I guess I got to get in the mech.\" The mech felt like I was",
            "start": 3370.32
        },
        {
            "text": "segments for me left more to be desired. I was not looking forward to it. Yeah, when I whenever those segments start, I'm like, \"All right, I guess I got to get in the mech.\" The mech felt like I was like playing it. I want to say it felt like playing Punch Out, even though mechanically it's not, right? like it just felt like I was this heavy all right do or um yeah dodge R2 R2 R2 All right now he's down now onto the next one kind of thing. It is a very overly simplistic uh game design, right? Especially with the with the dragon and the the mech. And it's it's very weird because they're trying to break up the the gameplay, right? They don't want it to be boring. But I honestly I want all Doom stuff. Like I just want to play as the Doom the Doom Slayer, the Doom guy running around shooting things because there is so much depth to that gameplay. And then when you take me out of it, you're like, \"Okay, here's a cool moment where you're in a mech. Okay, that's awesome.\" But then the",
            "start": 3420.08
        },
        {
            "text": "things because there is so much depth to that gameplay. And then when you take me out of it, you're like, \"Okay, here's a cool moment where you're in a mech. Okay, that's awesome.\" But then the gameplay is literally just right trigger, right trigger, right trigger, dodge. It it really stands out in comparison to the main game, which is has so much depth, has so much fun there when you're just doing the most baseline stuff. But I will say it's there's not much of it though. There's not much of it in this game. And that's where that's where I'm at. I think that they are I think that they are short segment. I think the the segments are short enough to where the g Yeah. Yeah, the gameplay is kind of basic, but for me, it's more of the it's more of the scale of stuff that's happening. I'm kind of more into the visuals and what's being pulled off technically. Um because I just loved seeing the little tiny tanks down there and then these big enemies that are being t that I' that I've seen",
            "start": 3460.72
        },
        {
            "text": "of more into the visuals and what's being pulled off technically. Um because I just loved seeing the little tiny tanks down there and then these big enemies that are being t that I' that I've seen from the ground level. Yeah. Out fighting in the distance, which is always cool as [ __ ] whenever they you're just kind of running through these open levels, but then you see a gigantic mech and a gigantic demon fighting each other. It's some of the coolest visuals you'll ever see. Um Yeah. Yeah. The visual. Yeah. Visually incredible. Um, one thing I wanted to bring up, and I think it's one I think it's an easy thing to miss, but once you'll once you notice it, I think you will have a really great appreciation for it, especially if I don't know how the experience is on console, but on PC when you're playing the game and then the cut scene happens, the tech is so the the the technical team, they're they were so [ __ ] flawless with going from shot to shot without the load in or pop in. And",
            "start": 3497.84
        },
        {
            "text": "you're playing the game and then the cut scene happens, the tech is so the the the technical team, they're they were so [ __ ] flawless with going from shot to shot without the load in or pop in. And that almost never happens in video games. When you're watching a cut scene and Doomsayer's walking and then it cuts to somebody else yelling at him, when that cut happens, you always see hair load in or people load, you know, like there's always some sort of visual jutter that you just kind of expect from modern game engines. This [ __ ] was so flawless from shot to shot. I was and and you could tell it was like a big point of like that they wanted to nail that [ __ ] because they really did and I thought it I was just always blown away by man that's so cool cuz you just kind of expect that with games nowadays that cuts to the next shot and you know the dress will kind of like fall down because of the the the physics have to load in or whatever. I don't I was just really blown away by",
            "start": 3544.64
        },
        {
            "text": "with games nowadays that cuts to the next shot and you know the dress will kind of like fall down because of the the the physics have to load in or whatever. I don't I was just really blown away by that [ __ ] on a technical level. um like to read some super chats. Uh and then we can also talk about some other stuff after that. We're running a little bit long, but we got a I guess there's really only bosses and stuff. There's not a whole lot else we can really go into, but I'll read some super chats for the time being. Um we have a super chat from IC Weiner. Oh. Oh, $2 super chat. Futurama reference asked, \"Can we get a quick Snow Bike mic review?\" You have the tweeted him. Blue Sky. Yeah. If only he was streaming for 72 hours. He did finish the game. Shinobi 3000. Something to point out. Yeah. Yesterday he was like, \"Uh, Andy, can you take the hosting spot for me tomorrow?\" I was like, \"Okay.\" I looked him. I was like, \"Mike, you beat the game though, right?\" I got to stretch. I got",
            "start": 3597.76
        },
        {
            "text": "Yeah. Yesterday he was like, \"Uh, Andy, can you take the hosting spot for me tomorrow?\" I was like, \"Okay.\" I looked him. I was like, \"Mike, you beat the game though, right?\" I got to stretch. I got to stretch. You're the first one of us to beat the guy. Uh, Shinobi 3005 with a $2 Super Chat says, \"Letsoft take a crack at a Halo game.\" Oh, god damn. I was thinking about this, not this specifically, but just how good Doom is from a quality um perspective of just like moving around in the world and feeling like man, there's no other shooter that's like this. Like there's something about like how grounded and how like I don't there's a feel to Doom that hasn't been replicated as well. And like I would be fascinated to see how they interpret how they interpret Halo crossover game. You know, it's it's funny to bring up Halo because they've already committed to Unreal 5, but it almost seems like Halo would be great in in this IDTech engine. But I guess I guess we'll never know with all the",
            "start": 3643.04
        },
        {
            "text": "it's funny to bring up Halo because they've already committed to Unreal 5, but it almost seems like Halo would be great in in this IDTech engine. But I guess I guess we'll never know with all the physics and all the breakable things like ah it'd be a freaking blast. We also have a super chat from Justin Madison who says uh should work with Mishuga on music and audio. Mishuga is a metal band. Cool. I thought the music was again awesome. It just wasn't implemented in in a way that made it super memorable for me. Sure. Yeah, that's um Cody Bishop with a $2 super chat says Quake next time for action space sci-fi. I was that was another thing I was thinking about um is like what is the feature for for it software? Do you get another Doom? I I I think they've done a good job of um like doing those incremental all right this is what we're doing. This is the direction we're taking this. All right, Doom the Dark Ages is going to be a bit more tanky and not as mobile uh as the previous one. I",
            "start": 3682.88
        },
        {
            "text": "incremental all right this is what we're doing. This is the direction we're taking this. All right, Doom the Dark Ages is going to be a bit more tanky and not as mobile uh as the previous one. I wonder if it's time for either, all right, let's take a break for one game and do a Quake or do something else or do a new IP or if it's time to like redefine Doom. One of the conversations I was having back um uh in the in the office with Mike the other day was like, could you find a new either not genre, but I guess a new format like I think Roger was talking about like like doing the Srank type stuff with the action. And I was talking to Mike about like what if they went Returnal with it and like made more of a bullet hell um like Rogite style Doom thing. Obviously, these are dreams and hopes like I don't know if they'll actually do that kind of thing, but could be an interesting That would be incredible. Yeah, it could be an interesting lane. Um, Blessed, did you play on PS5 Pro? No, I",
            "start": 3736.56
        },
        {
            "text": "like I don't know if they'll actually do that kind of thing, but could be an interesting That would be incredible. Yeah, it could be an interesting lane. Um, Blessed, did you play on PS5 Pro? No, I don't have a PS5 Pro. I just play played on base. Yeah, I was going to answer that. That was a question from Mark. $2 super chat. We have a $2 super chat from Demon Hacker says, \"This not competing with Blueprint.\" It was It says BP. I was like, \"Lanther uh Xbox 33 and and Death Stranding 2 for God.\" Uh, no. But it it might be a contender. It might hit my top 10. I think this year's just so strong. We'll see. Yeah, I I was thinking about this because I was talking with Danny about this um uh yesterday. I don't This year is already so stacked with game of the year candidates. I don't think this would make the list, but to your point, maybe the back end of the top 10 just as a standalone campaign, you know, shooter experience. But yeah, this this is just a crazy year for game of the year. So,",
            "start": 3774.16
        },
        {
            "text": "make the list, but to your point, maybe the back end of the top 10 just as a standalone campaign, you know, shooter experience. But yeah, this this is just a crazy year for game of the year. So, it's going to be tough. I I I think if they update this with some type of like uh hoorde mode because I know that they added a horde mode in um eternal if they do that here. I I I could see that being a little bit higher in my top 10 to I can't read that name. I don't know what it says, but a $5 super chat um says one of the handful of people who played 2016 internal on Switch. I loved it. Praying for Switch 2 port with mouse controls and gyro. Ooh. Ooh. I mean, that sounds like it can happen for sure. I was always kind of shocked that Doom Dark Ages wasn't announced at the Switch 2 thing with all the other Yeah. third party um you know, the little third party um what's the word I'm looking for? Yeah. No, I was going to say collage. Oh, montage. Montage. One of those aes. Hollow Night was",
            "start": 3820.96
        },
        {
            "text": "all the other Yeah. third party um you know, the little third party um what's the word I'm looking for? Yeah. No, I was going to say collage. Oh, montage. Montage. One of those aes. Hollow Night was there. Hollow Night. Was it? You could do anything though. Yeah, the gamage. The gamage. Um, Demon Hacker asked uh how the performance was on console and Blessing and Roger said they loved it. Yeah, it was awesome. I mean, it sound I I have to like I need you to boot the game up for me on PC so I can look at how it looks on your PC because it sounds like it might look better than it does on it. I mean, of course. Oh my gosh. I saw Mike playing it next to me. It looked really really good. I played it on It's also funny. U Paris, we were laughing earlier about the difficulty levels that they have and how there's like seven of them and they're all kind of named weird things. The same thing for the visuals. I think high is the third of like seven or eight visual options. You go like low,",
            "start": 3867.84
        },
        {
            "text": "have and how there's like seven of them and they're all kind of named weird things. The same thing for the visuals. I think high is the third of like seven or eight visual options. You go like low, medium, high, and then like [ __ ] horny and I don't know what. Like it gets it gets like violent. It gets like violent, ultraviolent. I forgot what it was, but I had my visual settings on ultraviolet violent. It looked freaking incredible. And um yeah, I'm I'm stoked to see how it continues to improve cuz it wasn't even the most most recent driver. Were you having that issue uh Paris whenever you booted up the game? I got the latest driver from Nvidia. Oh, this Oh my god. So, but but it's funny. When I first started playing, I didn't have it. And then when I got the new driver, I did see it. It definitely helped. It definitely improved uh performance on there. But um yeah, dude, playing that thing at 4K. I mean, I guess I can talk about this now. I was playing RTX 5090 and uh DLSS4 on",
            "start": 3912.24
        },
        {
            "text": "It definitely helped. It definitely improved uh performance on there. But um yeah, dude, playing that thing at 4K. I mean, I guess I can talk about this now. I was playing RTX 5090 and uh DLSS4 on balance mode, I guess, what they suggest you play on performance mode, but I was still averaging like 280 to 300 frames per second. It's ridic. Yeah, it's it's nuts. What's up, Les? I mean, Kevin's out there right now working on my computer, adding in a new GPU. I forget which one he said, but it's one of the good ones. It's one of the good ones. It's one of the good ones. And so, like, I don't know. My PS5 might be coming. You didn't know how many fans your computer has. I forgot that it overheated. It was incredible. Listen. All right. I just I need somebody to do it for me so I can take it home. Like, I'm not I'm not full Greg Miller, but I do have some Greg Miller jeans in me when it comes to the PC. Oh, you definitely do. I remember when we wanted to get you a new processor and you were",
            "start": 3961.68
        },
        {
            "text": "Like, I'm not I'm not full Greg Miller, but I do have some Greg Miller jeans in me when it comes to the PC. Oh, you definitely do. I remember when we wanted to get you a new processor and you were like, \"But like I don't use my I don't lose my info if that happens, right?\" Like, \"No, it's on your hard drive.\" I'm like, I'm not going to like lose everything on my computer, you know? I got I got stuff on there. But, um, any last thoughts on um Doom: The Dark Ages? Suggest I suggest everyone give it a shot. Check it out. Play it. I think I think you'll have a great time with it. Have a lot of fun. Yeah, it's an easy recommendation. Easy pickup. Uh, had a great time with it. I'm excited to see what they do post launch. Uh, because Eternal was supported a ton after launch. I know that that was the pandemic, but we got two pieces of DLC. We got a bunch of modes. Uh, I'm excited to see what that looks like for Doom: The Dark Ages. They did it again. Also, I want to um bring in another super",
            "start": 4007.44
        },
        {
            "text": "the pandemic, but we got two pieces of DLC. We got a bunch of modes. Uh, I'm excited to see what that looks like for Doom: The Dark Ages. They did it again. Also, I want to um bring in another super chat from Rain and Bishop real quick who says, \"Do you miss glory kills? Do you like the new execution system?\" Also, what's up, Paris? Um, real quick, I think I do miss the glory kills. I That was one of the things that I when we first saw the trailers, right, it was like the um you kind of go in and melee them to death as opposed to like go in, snap their neck, right? Like take their arm, [ __ ] shame to their thing, right? Doom 2016 and I had to like double check this cuz I booted up again. Um like most of the kills even for the fodder enemies were like they had animations to them and I kind of miss those animations. I kind of get why they take them out because there's just a lot more enemies to kill uh this time around. I think there's a lot more going on but I think it would break up",
            "start": 4047.44
        },
        {
            "text": "of miss those animations. I kind of get why they take them out because there's just a lot more enemies to kill uh this time around. I think there's a lot more going on but I think it would break up the combat a lot. So I don't mind them being gone. But I did like that if you if you jump up in the air a different animation will happen. And that is I I think that made that was enough variety for me cuz I think early on I had the same thought of like oh man, you know, the glory kills got really violent and kind of cool and creative. But then I think after about 4 hours like I'm just seeing the same ones all over again. I don't I it is kind of like breaking up the momentum. I want to see Happy Medium cuz they do have him when you are facing off against like a powered up enemy like that. Like if you kill this enemy you your maximum ammo gets increased and usually those I wish those were like a nemesis system. Yeah. Oh my god, that's a call I kept on thinking about cuz they were named",
            "start": 4088.16
        },
        {
            "text": "Like if you kill this enemy you your maximum ammo gets increased and usually those I wish those were like a nemesis system. Yeah. Oh my god, that's a call I kept on thinking about cuz they were named enemies. They were the ones on the map that all right, this is like a special lead. They called like leader enemies. They're the leader of this whole crew. You have to kill all of the sort of mini bosses to then be able to face that leader while it's still attacking you. You can't attack. You're also after you kill all the mini bosses, more mini bosses spawn and you have to kill that person. It's crazy. And when you do that, you you like reach into their chest and grab their heart and then like I kept on wanting him to eat it. I kept on wanting to take a bite of the heart. But I I wish there was a bit more a bit more animations. I understand why there's not an animation for every enemy cuz I I think that does get a bit repetitive. But in booting up Doom 2016, I was surprised by how quick",
            "start": 4128.8
        },
        {
            "text": "was a bit more a bit more animations. I understand why there's not an animation for every enemy cuz I I think that does get a bit repetitive. But in booting up Doom 2016, I was surprised by how quick the glory kills are. Like it's not like they're [ __ ] 5 seconds for each of them. Like it is go in, snap neck, go in, snap neck, right? Like they are fairly quick. I would have liked to see just a little bit more. Um, I have another super chat from Ghostly Icon who says, \"Xcast, baby. Off topic. They should really remake Skyrim. Release it a year before Elder Scroll 6.\" And no, Andy, I'm not doing mobs. Have no time for that [ __ ] I need a real release. Mobs. Yeah, Andy. What do you mean moss? Stop talking [ __ ] about the mobs. Yeah, moaf old mods maybe. Oh. Oh, like to mod Skyrim, maybe. cuz they spelled it M O Bs. No, we know. We know they're after you. We know who you pissed off. I mean, I know what you mean. Yeah, mods can be a pain in the ass. Whenever I see Skyrim looking",
            "start": 4169.6
        },
        {
            "text": "maybe. cuz they spelled it M O Bs. No, we know. We know they're after you. We know who you pissed off. I mean, I know what you mean. Yeah, mods can be a pain in the ass. Whenever I see Skyrim looking amazing, they're like, \"We have 4,000 mods in here.\" I'm like, \"Ugh, no thank you.\" Um, yeah. My final thoughts are the game is uh easy recommendation. So much freaking fun. Go I mean, G uh Game Pass obviously massive. Oh, yeah. Holy [ __ ] man. That's insane. Yeah, that's it's insane. Um, and I I just also wanted to shout out the art team cuz every every detail and corner of this world is just so perfectly art directed. There's so many little things that you will see for two seconds. It reminds you of like watching a a a Studio Ghibli movie. Yeah. Where the most insane painting you've seen is on the screen for two seconds and it's gone forever after that. And there are so many awesome props and uh like not I guess art designed but also for like level design purposes. There's a really",
            "start": 4212.08
        },
        {
            "text": "is on the screen for two seconds and it's gone forever after that. And there are so many awesome props and uh like not I guess art designed but also for like level design purposes. There's a really awesome moment where you're you're in your big Atlland mech and the mech puts his hand on a cliff and suddenly you're out of the mech as the Doom guy again and you're running on the arm and it's just like god this [ __ ] looks so [ __ ] good. The the art team just really really popped off. Um and yeah, I I think this game rocks. Play it if you have time. Play it if you have money. Play it if you have Game Pass. Easy recommendation. Um. Oh yeah. Everybody, thank you for joining me on this episode of the Gamecast. Paris, where can people find you? You can find me at Gamertag Radio. You can find me every now and again here. Write it at kind of funny. And you can find me on my YouTube channel. Don't ask me URL cuz I never remember. It's my name. Just look up my name. Just look it up. You'll",
            "start": 4265.2
        },
        {
            "text": "me every now and again here. Write it at kind of funny. And you can find me on my YouTube channel. Don't ask me URL cuz I never remember. It's my name. Just look up my name. Just look it up. You'll find it. Uh remember we uh talk about the biggest review reviews, previews, and topics of video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. You can catch the uh games cast after this, which is uh another awesome deep dive into The Elder Scrolls Online, talking about the stuff that they cut from the game, which is going to be super interesting. And then after that, the big Death Stranding stream where Snowbike Mike and Roger screencast after that. Yeah. Yeah. Andor andor. Oh my Bar was talking to me about Andor last night. Dude, I have no time for this show that I really really",
            "start": 4313.36
        },
        {
            "text": "stream where Snowbike Mike and Roger screencast after that. Yeah. Yeah. Andor andor. Oh my Bar was talking to me about Andor last night. Dude, I have no time for this show that I really really want to watch. Yeah. Should I marathon it? Doom. I mean, now that now that I'm I'm done with Doom the Darkness, cuz I was going to finish Expedition 33. Oh, you should finish Oh god, there's too many good things. A blood glut of good content out there right now. Can I can I make an admission before before we leave? about say this publicly. Oh no. I've I've not played Expedition 3. Oh no. End the podcast. End it. I beat it last night for the second time. I was like, \"God, this might be a This might be a 10.\" Actually, I was I was probably wrong. Would you give it? It is insane to everyone everyone is universally loving this game and I've not played it yet. So, I I got to find time. Thank you so much for watching everybody. We love you all. Take care of yourself. Take care of each other and we'll",
            "start": 4353.92
        },
        {
            "text": "universally loving this game and I've not played it yet. So, I I got to find time. Thank you so much for watching everybody. We love you all. Take care of yourself. Take care of each other and we'll see you on the next Games Cast and then again, big Death Stranding stream today. where Stom Mike will be on a marathon walking for however long it takes. 72 hours. 72 hours hopefully. We'll see you next time, gamers. Goodbye. [Music]",
            "start": 4393.2
        }
    ]
}