{
    "id": 14046,
    "video_id": "fSfV6MRZ1Mk",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Kevin Coello",
        "Mike Howard"
    ],
    "title": "Nick Tries To Catch ONE Pokémon For 2 Hours! - Pokémon Nicklocke 2.0",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746698462,
    "duration": 6364,
    "transcript_chunks": [
        {
            "text": "two. Yo, what the heck is going on Pokemon trainers? Welcome back to another kind of funny games afternoon stream with your boys, Poke Trainer Mike, Pokemon champion, Nick Scott, eight badges down, one Lugia, and I'm sitting here in my watery throne at the bottom of this waterfall with my five kimono ladies just all around me. Let them know. And we're just having a great time everyone because yesterday of course we got the law. We got the man himself. We got the sheriff. We got Lug and we got him Natty. We got him Natty. That's the craziest thing, right? It didn't feel right to do it the other way, you know. Well, Chris Anko was like enough is enough. Yeah. Throw the master ball. And we got him natty. We got him. Got him natty. Prove to the world that we could do it is right. And that was sick. Nick, that was so cool. Can you move the mouse off? So chat, welcome in to your Wednesday afternoon stream. We are back for more Pokemon and this could be the very end our Pokemon journey for",
            "start": 4.96
        },
        {
            "text": "sick. Nick, that was so cool. Can you move the mouse off? So chat, welcome in to your Wednesday afternoon stream. We are back for more Pokemon and this could be the very end our Pokemon journey for Soul Silver. Nick's Nuzlocke 2.0 is coming to an end. And this is probably going to be it right here and right now. Maybe you said it was four more days. I I I put it out there that it could be four more days, but no. Could it? Now fly back to New Bark Town. Let me use it here. What the [ __ ] Is it here? Oh, you're still in the cave. You have to use the rope. Ah, [ __ ] Yeah, you're good. Yeah, you're good. We'll get out of there. Hell yeah, bro. Look at us, bro. Level 24 Krabby coming out of here like he's Look at this goddamn Krabby, man. But Krabby's a cool Pokemon, dude. Shout the crab. Crabby sucks. Shout the crab, bro. I I watch uh a lot of Tik Tok, Nick, and I see this guy catching crabs off the Atlantic coast and he pulls off all the barnacles on them and then throws them back. Oh,",
            "start": 52.56
        },
        {
            "text": "sucks. Shout the crab, bro. I I watch uh a lot of Tik Tok, Nick, and I see this guy catching crabs off the Atlantic coast and he pulls off all the barnacles on them and then throws them back. Oh, I like that. He loves this. I do that with crabs or turtles. With crabs. I've seen the guys do ones with turtles. They get the big sea turtles out and the turtles like and they're like, \"Hold. We're trying to help people cuz he doesn't know what's going on. Let me go.\" \"Yeah, let me go.\" And they scrape him off his shell. They like take shell parts off with him cuz his barnacles are stuck on there. And then they go, they like put like a little cream on it and Oh, they put a little cream on it. Say, \"You're okay now. You're safe.\" Mike, is that the guy that goes, \"You know how we do?\" Yes. Love that guy. You know how we do. Yeah. Yeah. Love that guy. There's two of them, too. But yeah, that's the guy over there. I think I think I watched the other guy. Yeah. Oh, you probably watched uh the",
            "start": 102.0
        },
        {
            "text": "that guy. You know how we do. Yeah. Yeah. Love that guy. There's two of them, too. But yeah, that's the guy over there. I think I think I watched the other guy. Yeah. Oh, you probably watched uh the lobster like the true lobster catcher. Yeah. Yeah. But yeah, the guy over there, he's pretty funny. He gives him a piece of meat every time he throws them back in. And it's interesting. Crabs lose a leg, lose a uh lose an arm, they grow back. Yeah, they multiply. That's why That's why they always do gene splicing with crabs to try to see if we can grow a claws back. You think I'll be able to grow back that toe I lost? You lost the toe? Long time ago. That's crazy. I didn't know that about you. Don't go shoeless. Where did you go? Wait, what? I was like, damn, that would be amazing. That'd be amazing if you were just told to this entire time. Never told you about it yet. Wait, before you fly, you want to you want to look up to where the dogs are? No, I'm going to fly back to the town and",
            "start": 139.76
        },
        {
            "text": "amazing if you were just told to this entire time. Never told you about it yet. Wait, before you fly, you want to you want to look up to where the dogs are? No, I'm going to fly back to the town and put Lugia in my uh sheriff and put the sheriff in. I'm saying two two birds, one stone. You Well, he's not on the map. I don't see him on the map. All right, that's my flag. Hello, chat. Welcome back in as well. It's great to see you all Twitch and YouTube. Of course, shout out to our Pokemon winners throughout this Nick Nuzlocke stream of the Andy Cortez one of Ones. I have now reached out to every single one of you. So, I am awaiting your address so I can send you your sweet Andy Cortez drawings, which he did the big turtle yesterday. Did the big turtle yesterday. Beautiful looking. I don't know if you can see that or not. I think there's an Imperium coat over it. Okay. Right now, but thankfully Kevin just left the room. Yeah, he just left. Don't worry about it. Just walk right out.",
            "start": 179.76
        },
        {
            "text": "know if you can see that or not. I think there's an Imperium coat over it. Okay. Right now, but thankfully Kevin just left the room. Yeah, he just left. Don't worry about it. Just walk right out. Let's see. I can open this up to somebody. Here we go. You can never get that man seated. You know what I mean? He's always on the move. Always on the move. He talks for 5 seconds. Gets bored with us. Just first five minutes of the stream. You know what? It's good enough. Okay, I'm out of here. Let's get the sheriff out there. Let's have some fun. All right. So, if I Oh, look at how big he is. So, we want to put him in for Keep Cap Wet, but then we don't have fly. Can you teach Lugia a fly? I guess I can put him in for my Polly. Yeah, we probably don't need whirlwind anytime now anymore. What did we replace that guy with though? Uh the the pseudowood. Oh yeah. Okay. You know what? Pseudowoodoo, you're out. You're out. We never loved you. Well, I mean, we could use a rock guy, but the question",
            "start": 222.0
        },
        {
            "text": "we replace that guy with though? Uh the the pseudowood. Oh yeah. Okay. You know what? Pseudowoodoo, you're out. You're out. We never loved you. Well, I mean, we could use a rock guy, but the question is, is Pseudowudo better than Kev Kev Wetweet? Well, let's see. That's where that's where we're at. He's got a lot of great moves. Yeah, because I don't have anyone that has rock moves. Okay. And he has a dark move, which is that faint attack, which is sick. I mean, he's a really well-rounded guy. We just don't use him that much. He's got a fighting move, a rock move, a normal move, and a dark move. That's crazy. Then guess what? As long as you teach Sheriff how to fly. Well, that's the real question is, can we Let's take a look at Lugia right now. Yeah. And a lot of people in the chat are riding for Shudo. Let's just look at our Pokemon here real quick and we'll just take a look. Why can't you just let me see my box? We just look at it. Where's my party? There we go. Uh chat as well.",
            "start": 263.12
        },
        {
            "text": "riding for Shudo. Let's just look at our Pokemon here real quick and we'll just take a look. Why can't you just let me see my box? We just look at it. Where's my party? There we go. Uh chat as well. Another fun one. Nick is interested in catching uh one of the dogs and so you want to get crazy with us. Oh man, he's got nasty moves. Nasty. We could probably teach him. The rain dance move is not good. That's like a That's just a status effect move. Yeah, that's when you put the rain dance up and then your water moves. I could teach him fly and basically he has a flying move of vortex air which is shoot for inflict damage has high circular hit ratio that's nasty and that's his special and his special attacks 99 which is better than his normal attack. So we keep in that move hydrop pump has a power of 120 but we've already decided we're not really hydrop pump people so we could pop that out. Yeah but then what's the point of rain dance? I mean yeah it's a good point. Rain dance is Rain",
            "start": 310.88
        },
        {
            "text": "a power of 120 but we've already decided we're not really hydrop pump people so we could pop that out. Yeah but then what's the point of rain dance? I mean yeah it's a good point. Rain dance is Rain Dance is for your water moves. So, if you're not going to do a water move, then you're not doing a lane move. This psychic move is nasty. So, we got to keep that cuz that's stab and that's a special. This is a great move right here. Power 80, accuracy 100. So, we're keeping that. So, it's either rain dance or hydrop pump that we're leaving. But that's I say we just take out rain danc. And then let's go back to let's take a look at our homie here. Let's look at our boy. I feel like Kev Kev Wet wet is just Yeah, let's talk about Kev. Kev Wet wet. fly. We like We do like it's a high powered move. It's a great move and it dodges. Yeah. You know, he's gone for a move so he can't get hit. This one kicks people out of the battle and makes them change which we do like the wing attack. Yeah. Not",
            "start": 357.52
        },
        {
            "text": "It's a great move and it dodges. Yeah. You know, he's gone for a move so he can't get hit. This one kicks people out of the battle and makes them change which we do like the wing attack. Yeah. Not bad. And then a quick attack which is not bad either. I don't know man. I mean the positive here is Kev Kev Wetw just goes to the bench. It's not like he's gone forever. That's true. He can always be replaced if we feel like uh pseudo wood is not carrying the wood. Yeah, I think we get rid of rain dance. I like we just teach him fly get rid of dance. I like that. And then the question is do we need I mean pseudo wood our guy because I feel like here's the real deal. If we end up catching one of the dogs, right? Oh [ __ ] Well, the cats we we've talked about the we've talked about the dog cats chat. Uh we want to know who you're interested in the most. Uh, we went back and forth on who is what really fits the vibe and I have leaned towards the fire ante. The anti is ante anti anti ente. I",
            "start": 405.6
        },
        {
            "text": "chat. Uh we want to know who you're interested in the most. Uh, we went back and forth on who is what really fits the vibe and I have leaned towards the fire ante. The anti is ante anti anti ente. I think it's anti ent. Looks dope. Yeah, we have a red gyardos so we don't need the water one cuz I'm not swapping out a red gyardos. Chris Ankle will never ever OMGX. Holy [ __ ] With 20 gifted subs. Thank you so much off today's stream. Thank you for the love for the love and the support. Um, and thank you as well for your uh mailing address as well. Chrisa has said to me that he will disown me if I take Gyarados out of the party, my red Gyarados, cuz that's his third favorite Pokémon. Okay. Okay. So, I don't think we need to go after the water. Ninetales. Here's the thing. Prime time. Prime Time has never been our favorite. You were excited. You and I watched back the tapes. Yeah. I've been watching all of the videos and you and Andy were very excited when you got the Vulpix. The Vulpix",
            "start": 451.68
        },
        {
            "text": "Time has never been our favorite. You were excited. You and I watched back the tapes. Yeah. I've been watching all of the videos and you and Andy were very excited when you got the Vulpix. The Vulpix brought you thought the run was going to be turning around. Vulpix turned us around. But so you have a little bit of a connection. But was Vulp But was Vulpix the the draft pick that just didn't deliver? You know, was it the Reggie Bush of of our Pokéball? Did Reggie get to touch the ball enough though? That's the question. Was the team so stacked that we technically never needed Reggie or did he him dating Kim Kardashian just totally throw him off his game and then ruin his career? I would be thrown off too. That's a lifestyle that some people can't handle. It's tough to act like you start to live with Kim, you start to live with the Kardashians. The problem is you live with one Kardashian. You live with all the cars. You live with all of them. Even Rob their loser brother. Oh my god.",
            "start": 497.76
        },
        {
            "text": "to live with Kim, you start to live with the Kardashians. The problem is you live with one Kardashian. You live with all the cars. You live with all of them. Even Rob their loser brother. Oh my god. He's he's he's living on the compound. I mean, he's driving his little golf car around. Protect the police and buy it as golf cart around. They got to own like the You know what would be cool? You know what I mean? You get that much money. You just buy the golf country club that has the full golf course and all the houses and Yeah. We just drive golf cart to golf cart waving at each other. Pull up into the house. I'd be buying a whole plot of land. So yeah. Ninetails here. Yeah. Just never never got their shot. Never. It wasn't their time. It wasn't their time. So, I think we we I think the move right now is that we sub out. We're going to we're going to take Kev Kev Wetwet out. Kev Kev Wetwet out. We can definitely confirm that. That's out and we are going to sub back in. Who do we want?",
            "start": 536.88
        },
        {
            "text": "right now is that we sub out. We're going to we're going to take Kev Kev Wetwet out. Kev Kev Wetwet out. We can definitely confirm that. That's out and we are going to sub back in. Who do we want? I We have some decent picks here, right? This is our ghost type. We don't have a ghost type. Uh, we don't have a ghost type. Yeah, this is our rock type. So, this is our guy right here. Pseudo. We have a psychic type. Now, this is your backup six. Yeah, these are the Oh [ __ ] Break glass in case of emergency. Okay. So, we'll put I guess we'll put Zudo back in. Yeah. And then when we go get this squad and then the dog is going to sub in for Ninetails. We're going to go with the fire dog cuz you talked fire. I mean, Dudikov's the [ __ ] He's level 47. He's got he's basically carried this whole game. Dudacov is your main Pokemon. He's so weird looking. He's like, \"How did it go from sheep to this?\" It's like when a child draws something, you're like, \"What is happening? Give this kid more",
            "start": 576.8
        },
        {
            "text": "game. Dudacov is your main Pokemon. He's so weird looking. He's like, \"How did it go from sheep to this?\" It's like when a child draws something, you're like, \"What is happening? Give this kid more aderall.\" What? Uh, okay. I think we go with this. Yeah. So, I I think that's the issue is we don't need an electric. We don't need a water. So, we have to go with the fire dog. I mean, you know what I mean? Yeah. A I mean, here's the other thing. Here's the thing. We have a Dratini. Now, we don't have a dragon type, and dragons are kind of bad to the bone. So, this could be a solid six. I mean, you I mean, we got a water type. You got a nice little backup six that you can rare candy the crap out of. And here's the thing in the with the backup six, right, is we put ninetailes in here. That is everything we really need. Water type, dragon type. We don't have an electric, but that's okay. Ghost, psychic, and a ground with Graler. You become kind of freak. You become kind of a freak. Cuz I",
            "start": 625.28
        },
        {
            "text": "everything we really need. Water type, dragon type. We don't have an electric, but that's okay. Ghost, psychic, and a ground with Graler. You become kind of freak. You become kind of a freak. Cuz I want to level up I want to level up Dratini to see what the [ __ ] that looks like. Dude, you got to level it up and then I think you got to give it something. You probably got to give it some become the super thing, the dragon stone or something crazy. I bet. [Music] Let's People are saying you used Dragonite last time. Did I? I don't remember Dragon. Dragonite might have been on the squad though, maybe. guys talking about the Rattatas out [Music] there. They suck. We also have a freak Togepi. Sometime Sometimes you forget about Togepi. Let's go get him and see. You want to go see the baby? You want to go see the baby? Let's go get Let's go see the baby. And maybe we bring the baby to the Elite 4 with us just to see what it's like. Put the baby out there. I want to just see what the baby's",
            "start": 672.16
        },
        {
            "text": "want to go see the baby? Let's go get Let's go see the baby. And maybe we bring the baby to the Elite 4 with us just to see what it's like. Put the baby out there. I want to just see what the baby's like. Hello, father. I've waited for you for a long time. Father, my dad's suffering to military school and now I've just been here for my entire life. I will be the good side. I will make you proud. Dogge is going to be like that uh the really buff guy from Fury Road, you know? Oh, yeah. The jacked out steroid dude from Fury. How do they get steroids in the Fury Road? How do they fumble that? Fury Road. The the whole that's they make Fury Road. They make Mad Max. We're [ __ ] riding the high. But then they take seven years to make Furiosa. Well, I think that's what happened. Good though. Furiosa was good. Furiosa was dope. I'm just saying I think I think it proves you can't be taking that long. You got to hit You got to You got to get back. It's true. I wanted more Mad Max in my life. I",
            "start": 726.64
        },
        {
            "text": "was good. Furiosa was dope. I'm just saying I think I think it proves you can't be taking that long. You got to hit You got to You got to get back. It's true. I wanted more Mad Max in my life. I wanted Furiosa. I wanted another movie. I would still watch [ __ ] what's his name? Tom Holland. Tom Hardy. Tom Hardy. I've still watched Tom Hardy grunt around freaking out. Do we change White Cav? We've done a whole lot of [ __ ] Okay. Uh yeah, give me one second. Yeah, take your time. Studio, you know there's three more movies to watch now, Mike? Right. No, you can't be talking about the originals, Chris. I know that. But yeah, no, we're talking about the new [ __ ] Jay Gordon wants you to turn on the battle animations. I missed the battle animations. Okay, I'll turn those back on. Oh, the sheriff now has fly. The good looking squad. Made it even better when we get that fire dog. The [ __ ] fire dog level. There you go. 45. Oh, great. Look at this team, man. That's a squad. Dudikov is 100%",
            "start": 770.0
        },
        {
            "text": "now has fly. The good looking squad. Made it even better when we get that fire dog. The [ __ ] fire dog level. There you go. 45. Oh, great. Look at this team, man. That's a squad. Dudikov is 100% carried this. Dudikov, I think, just takes us all the way. If I'm being real, I could tell. I think we take out every single one of our Pokemon and we take one by one, we take him to the leader for see who they can take out. It's funny, Nick, when we started this, we didn't know where this was going to take us. We thought [ __ ] Roger would be the guy, but I could tell stories about each and every one of these Pokemon, right? Like look at Milk Mommy up there. Yeah. Remember when we first faced a milk mommy and Tim Getty's was licking his lips just waiting for you to fail thinking that that Pokemon was going to stop us and you absolutely dominated. Well, the thing about Tim is that he thinks he's better than me. He thought he was better than you and he's not right. He's not right. [ __ ] wish.",
            "start": 826.44
        },
        {
            "text": "was going to stop us and you absolutely dominated. Well, the thing about Tim is that he thinks he's better than me. He thought he was better than you and he's not right. He's not right. [ __ ] wish. I took that milk tank and he was like, \"Oh, it's going to roll out.\" And I [ __ ] smashed its face in and then I made it mine. I said, \"Get on my squad. Let me drink your milk.\" I said, \"Get on my squad and have the right face.\" Yeah. You got to have the milk. Beautiful moment. Look at its vapid psychotic face. Look at it. Look at it. Staring through you like it's thinking about your [ __ ] spleen. How do I eat your spleen? And so like you pull out of this one, right? You go you can go down the list and just like look at these. Look at look at Koolito. Kito is the best. Kito came when we needed them the most. Now did we already have a Gyarados? Yeah. But is a red Gyarados cooler than the other Gyarados? Yeah, it's way cooler. Way cooler. We already had a Gyarados. We didn't need this, but",
            "start": 880.88
        },
        {
            "text": "them the most. Now did we already have a Gyarados? Yeah. But is a red Gyarados cooler than the other Gyarados? Yeah, it's way cooler. Way cooler. We already had a Gyarados. We didn't need this, but we wanted it. How do you spell Judic? Okay. And then the sheriff. You caught it all natty. Natty. Ice. This sheriff's 100% natty. This is like the liver king. So natty. Just so natty. You know, I met the liver king once. I met the liver. I walked by. It was at Wrestlemania. When we went to Wrestlemania, he was up in the booth area and like you're not going to be like, \"Yo, Liver King, what the [ __ ] bro?\" You know what I mean? He looked at me, I looked at him. I said, \"Hello.\" Yeah. Yeah. He's all natty. Oh, he's 100% natty. You can just tell he's natty. He's so natty. You can tell he's natty. All right. So, this is our sheriff, man. This is the law. This is the [ __ ] bringer of order and peace. This is our Robocop right here. That's our guy right there. The sheriff. And then, of course,",
            "start": 920.96
        },
        {
            "text": "All right. So, this is our sheriff, man. This is the law. This is the [ __ ] bringer of order and peace. This is our Robocop right here. That's our guy right there. The sheriff. And then, of course, Pseudooo put some water on that thing. It woke up. Boom. All of a sudden, we've never let it out of the squad. Never let it out of the squad. I don't think it's ever battled. I to I honestly don't think it has. I think Pseudo has maybe taken three fights maximum and I think most of the fighting was me grinding Pseudo. Oh my god, that's so funny. You know what I mean? Like that's crazy. He's got the Never Melt ice. What does he have on him? The quick claw. So he's faster. What does not Nick have on him? Nothing on him. Okay, we should put some items on people just for shits and giggles. Put some items on. See if the Let's see if the lock came with an item. He's got a sidearm on him. Nothing. Got the XP share. Nothing. Damn. Well, we took all that off. Oh, it might be on one of your backup",
            "start": 966.8
        },
        {
            "text": "items on. See if the Let's see if the lock came with an item. He's got a sidearm on him. Nothing. Got the XP share. Nothing. Damn. Well, we took all that off. Oh, it might be on one of your backup six, but I was I took all that off when I was in grind mode. That's why. Yeah, that's okay. I just want to put I might as well put the XP share off on uh Let's move some items around real quick. I just want to put the XP share on these people. They might as well have items for shits and giggles. Well, you do have rare car candies. Yeah. Throw down there. What the hell? Who cares, right, Mike? It's about passive income. Exactly. I like that. I like that. Let him do the work for us. Let the money make money for you. Exactly. Let the money make money for you. When are we buying a yacht? Not Nick already overachieved. Honestly, who is not Nick? Not Nick. Pudo. Pseudo Widow. Oh, Pseudo Widow is not Nick. Yeah. Not Not Nick is that friend in the group project that did absolutely nothing and got",
            "start": 1015.2
        },
        {
            "text": "already overachieved. Honestly, who is not Nick? Not Nick. Pudo. Pseudo Widow. Oh, Pseudo Widow is not Nick. Yeah. Not Not Nick is that friend in the group project that did absolutely nothing and got the A. Great job. You made it. You dig? Go to the death box. Let's take a look at the death box. Where is the death box? It's the last box. No, he was on the last box. What happened to our death box? I think you're mixing stuff in. Yeah, it might be. Hold on. They might Hold [Music] on. Let's go back to just the move Pokemon. I don't know why it's not letting me look at all this stuff. There's the death box. Okay. Oh [ __ ] Damn the death. Damn. Don't kill the teddy bear. Dude, it When the [ __ ] did you catch that hawk thing? I don't know. Did we? I don't think this is That's the scarmony one, dude. That's the thing. Oh, no. This They just got added to this box. Yeah. Okay. Okay. This might be the death box. No, that's our That's our What's What box is this? Oh, this is the overflow box",
            "start": 1061.36
        },
        {
            "text": "dude. That's the thing. Oh, no. This They just got added to this box. Yeah. Okay. Okay. This might be the death box. No, that's our That's our What's What box is this? Oh, this is the overflow box then. Hold on. That's overflow. That's overflow. This has to be death box. But we It's not enough. It It's the last one for Yeah, but we didn't kill these people. I didn't kill this. Well, we definitely killed those top line. That's a That's the top line's the suicide squad. The suicide squad gave their lives. So these people are just in the wrong spot because M the Machop never died and that badass flying thing never No, no, the Machop did die. Did it? Yeah, I'm looking at it right here. Yeah, that one definitely died. That one definitely died. Abra was the last death. He was there, too. Yeah. All right, let's sort this out, then. Okay, so let's go down the list. That mudkip thing. I don't remember the mudkip thing. What's the first one? See, that's what I'm saying. That thing is sick. This",
            "start": 1112.08
        },
        {
            "text": "right, let's sort this out, then. Okay, so let's go down the list. That mudkip thing. I don't remember the mudkip thing. What's the first one? See, that's what I'm saying. That thing is sick. This is [ __ ] bad. The moring, bro. That was the bird thing I was trying to pronounce yesterday. Did it die? I don't know where you caught that. I wasn't here for that. I don't know. But it's sick. It looks really cool. I wasn't present for this. When did you catch that thing? Yeah. See, I just caught these randomly when we were like fishing around, right? The owl one we also didn't kill. We definitely didn't kill our dili. Yeah. See, these need to go in the backups because there's some real good pigs here. This Eevee, unfortunately, I think died. Did I do think we killed that was Radicate? Yeah, that might have been the last one we killed. I'm pretty sure we killed all these. Yeah, that's that's Roger. That's Roger. [ __ ] Roger. Yeah. So, we never put this We never put this ugly little [ __ ]",
            "start": 1150.72
        },
        {
            "text": "might have been the last one we killed. I'm pretty sure we killed all these. Yeah, that's that's Roger. That's Roger. [ __ ] Roger. Yeah. So, we never put this We never put this ugly little [ __ ] in our in our squad. So, the Jinx from here on out. So, let's move these over to the other box. Yeah, just quick box. Doesn't matter. Yeah. Move them over there. So, we have those. That way we can we know. I wish we could rename this the death box. You can't though. [Music] No, we tried to get Nick to replace Pidgeiotto with Scari. Really? When was that, Chad? I wasn't here for that one. Uh, there was some there was some kurfuffle, but he was Sky Armory, Mike. No way. That's the coolest thing ever. You're trying to say like you're saying like it's a former former chief justice. That shit's [ __ ] crazy, man. Really? That's right. 14, like I said. So, there we are. We went down. There's the suicide squad. Gave their lives. There's Roger fumbled. So So this is our this is our our our backup.",
            "start": 1191.36
        },
        {
            "text": "crazy, man. Really? That's right. 14, like I said. So, there we are. We went down. There's the suicide squad. Gave their lives. There's Roger fumbled. So So this is our this is our our our backup. That was our backup. Yep. But I'm going to say something that's crazy. I do think that scar sky armory could be [ __ ] You like that thing? I like that. Look at how bad this dude is, dude. 27 steel flying. Yeah, we don't really need a flying, but we we could use a steel. Could we use a steel? Scarry. What's steel strong again? Wow. Sean from Detroit says, \"Can we not have the cow?\" No. The answer. Hey, Sean from Detroit. Why don't you [ __ ] mind your P's and Q's over there, buddy? That's our mommy. That's our [ __ ] mommy. Ate it. We'll keep this here for now. What's up with that teddy bear? That teddy bear grow big. What's the evolution's on a teddy bear? I don't know. You want to see it? We'll juice this [ __ ] thing up. Really? Becomes a big bear? Yeah. It's just a normal type. We can",
            "start": 1238.72
        },
        {
            "text": "That teddy bear grow big. What's the evolution's on a teddy bear? I don't know. You want to see it? We'll juice this [ __ ] thing up. Really? Becomes a big bear? Yeah. It's just a normal type. We can just juice this thing up. Oh, we just juice the [ __ ] out of We have so much steroids in this game that we should That's what we should do is we should take just the danger. See what happens. Do they evolve? Don't they have to like fight? Some do, some don't. Some have to be your friends. Some need the stones. Some need all that [ __ ] Right. This one evolves at level 30. Sean says they got me. I've been gone. Sorry, Sean. The The cow doesn't leave the group. [Music] Yeah. God forbid we get rid of the cow. So, let me go back to move some items here. David says, \"Lucky if we get out of the boxes today for David. Take us to the mall.\" [ __ ] David, you got to get take your ass to the mall if you want to see that. Now, so wait, what? [ __ ] Can we go back to the Pokeball guy? Where the",
            "start": 1292.16
        },
        {
            "text": "boxes today for David. Take us to the mall.\" [ __ ] David, you got to get take your ass to the mall if you want to see that. Now, so wait, what? [ __ ] Can we go back to the Pokeball guy? Where the [ __ ] are all my items? Maybe they're just in my inventory. Call you back after work. Love you. No, my little brother. Oh, I think now I can't remember cuz it's been a long ass time, but the ball dude. I think he was making quick ball for We can just [ __ ] the ball guy, dude. He had a He had a whack me. The ball guy, dude. He's straight up with you. He [ __ ] never loved the ball guy. [ __ ] you, dude. The ball guy rocks. Kevin ball guy. hated the ball guy technique from the rip. I just think it's a smart idea to go back to the ball guy so that we can get quick balls to use on these dogs. Well, we're max we're just maxing them. What? I thought we were picking one and we were just boppinging it on the head with the master ball. Uh I mean Yeah, we're game over in that then. But we save",
            "start": 1339.68
        },
        {
            "text": "Well, we're max we're just maxing them. What? I thought we were picking one and we were just boppinging it on the head with the master ball. Uh I mean Yeah, we're game over in that then. But we save right beforehand and we see we can do it ourselves. No, you're right. That's the right move. Kurt did nothing wrong. Basement key. Take him to the mall. Oh [ __ ] You're in the This game had so many whack [ __ ] game mechanics that didn't need to be there. So dumb. This [ __ ] was so dumb. You even know which berries you want to do. Do them all. Yeah, you just go to grow the berries, dude. I got to water it. Grow the berries and take it to the ball guy. Get Get three Pokeballs that don't matter. Just Hey, man. The [ __ ] heavy Pokeball got us the thing. it. I mean, it worked, but we were going to catch them regardless. Yeah, but I don't know. We had We had 50 Ultra Malls. We were going to catch them eventually. [Music] Man, it sure takes time, doesn't it? It's a whole process. It's like",
            "start": 1396.72
        },
        {
            "text": "to catch them regardless. Yeah, but I don't know. We had We had 50 Ultra Malls. We were going to catch them eventually. [Music] Man, it sure takes time, doesn't it? It's a whole process. It's like schedule one. You got to You got to put the plant fertilizer down. You got to put it in there, water it. [Music] He's waiting for Oh, yeah. That's right. Did you just do the same one? I don't think so. I think I did three different ones. Just four. Yeah, I only have three three different types of areas, I think. Other things I can come out here. [Music] Sean from Detroit take another shot of the cow. Ready for this one? He just hates the cow. Not Nick and the cow are like the coach's kids ass, but still on the team. First off, it's good. That's a good one. That's not a bad idea. Okay, but the cow could be strong. It's just when you have Dudikov and Koulito and the sheriff, it's like you're not going to get playing time. That's how it goes. [ __ ] transfer schools. That's That's what you have",
            "start": 1447.92
        },
        {
            "text": "could be strong. It's just when you have Dudikov and Koulito and the sheriff, it's like you're not going to get playing time. That's how it goes. [ __ ] transfer schools. That's That's what you have to do. Yeah. You got to transfer schools. No, transfer schools if you want playing time. I don't need this [ __ ] Cool. All right. Let's take our Lugia for a ride here. Yeah. Let's go to the mall. We're not going We don't need to go to the mall. Do you want to go to the mall? No. We I mean we have to go to the mall once. No, we don't. We've gone to the mall every single part of this playth through. We don't go to the mall once. Are we really playing? You were literally standing next to What What does Sean from Detroit want us to do? Cuz he's got so many opinions on our team here. What the [ __ ] does Sean want us to do? Sean. Yeah. Talk to us. No, you're going to the ball guy. Go to the ball guy. I love the ball guy. He's my guy. Hi, dude. Go talk to the ball guy, man. Give me a little",
            "start": 1532.4
        },
        {
            "text": "does Sean want us to do? Sean. Yeah. Talk to us. No, you're going to the ball guy. Go to the ball guy. I love the ball guy. He's my guy. Hi, dude. Go talk to the ball guy, man. Give me a little gutter. Ready? I love you so much. Oh my god. I have a baby. Oh my god. So much love. Easy. Oh, Ramirez says she get some fresh water from the vending machine for all time sake. Remember that we just keep jamming the vending. Well, they don't let you just go like a hundred of them. No. That shit's crazy. That [ __ ] is crazy. What'd he give you? I don't know. I didn't even read what he gave us. Who cares? What are the white ones again? Do we You really want me to look it up? I want heavy balls. I think those are the black balls. The black ones. Yeah, I don't have that. I'll just do the pink ones. All right, let's go catch oursel a dog. Woo! Woo! Let's go catch a legendary dog, y'all. Let's see what these little [ __ ] are. Hey, do you know which one you want? I want the fire one. Oh, okay.",
            "start": 1575.84
        },
        {
            "text": "All right, let's go catch oursel a dog. Woo! Woo! Let's go catch a legendary dog, y'all. Let's see what these little [ __ ] are. Hey, do you know which one you want? I want the fire one. Oh, okay. Well, they're both kind of in the same area. Yeah. So, I mean, if we catch both. Great. Oh, well, we only have one master ball. So, we I think you can only catch one. Really? Well, like right now, cuz of the master ball. You guys are Stop. Stop. Stop. Okay. [ __ ] You need to shake off this [ __ ] Master Ball. Oh. Oh, you're going to try to battle this Yeah, I'm taking this thing off. I've never run away from you. Yeah, but we don't know how to stop him. Oh, yeah. We got to get a move that has the [ __ ] trap him. Trap him. What's the Google move? What's the trap? Should we put a radicate in there and and just put a radicate as plotter? Do we have a radicate? If we have a radicate, but I know where to find this whole time. We can definitely find one. It's like the radicate up. Let's",
            "start": 1639.92
        },
        {
            "text": "in there and and just put a radicate as plotter? Do we have a radicate? If we have a radicate, but I know where to find this whole time. We can definitely find one. It's like the radicate up. Let's definitely get the radicate. Let's get a radicate and get them all set. Let's get it [ __ ] Let's experiment on this radicate. It's called mean look is what we need. We need mean look. Do we have mean look? I don't think so. I don't think I have a TM that has mean look in it. Okay, let's take a look. Oh, let me look through. Maybe it's an HM. What's the difference between HM and TM? Nobody knows. Teach teach move. Honor move. Is that right? Hone move. Mean look. Is that what it's called? I need the navigator to look into ente. We already have Mickey. Uh we I I gave Nick the big three. Yeah, I already showed Nick the big three. We discussed it heavily yesterday. We've already discussed it today. We already we we know what we want. Yeah. The TMs are one time used. The HMS can be taught over",
            "start": 1683.84
        },
        {
            "text": "already showed Nick the big three. We discussed it heavily yesterday. We've already discussed it today. We already we we know what we want. Yeah. The TMs are one time used. The HMS can be taught over and over again. Okay. Okay. Got to look through some of these, man. I got some dope ass [ __ ] Okay. But to catch mean look is it wears off if you switch the Pokemon using it out. So we got to jack up one [ __ ] mean look. It's got to stay in the fight the whole time. So we have to basically what we need to do if we want to catch all three of these cats is we need to get eradicated to level [ __ ] feeding a bunch of candy. We need to make him the bruiser the destructor. I love this. I love And then we get him false swipe. So he technically can't kill it. Yes. And he's he's got you trapped. Get it. [ __ ] Are we good at it? Are we doing this? Let's make it happen. Why not? Let me see. Let me go in and see if I even have a radicate. You have a radicate. No way. Yeah, I think we caught one.",
            "start": 1733.76
        },
        {
            "text": "it. [ __ ] Are we good at it? Are we doing this? Let's make it happen. Why not? Let me see. Let me go in and see if I even have a radicate. You have a radicate. No way. Yeah, I think we caught one. [Music] Hello, father. All right, let's see. Yeah, we have to have one, right? We're getting a lot of conflicting reports here. Now, Ente knows Roar, which will force the Pokemon to flee. Mean look, will only work for one turn. So, I have one turn to get this thing. So, here's what we do. We get that Radicate [ __ ] 99. Okay, get this. See this mean? Look, it's stuck. False swipe. Instantly going to take it to one no matter what. How do we fall swipe then? We got to We can buy it. There he is right there. [ __ ] put him in the squad. Feed him a bunch of rare. Where is he? I don't Oh, I see one. Look at him. I see his ass. Oh, yeah. Oh, the captain. Dude, we got the name the captain. Are we going to Are we Are we keeping Rad the captain in for a while? Should I ask? I don't think so. I mean,",
            "start": 1783.32
        },
        {
            "text": "Look at him. I see his ass. Oh, yeah. Oh, the captain. Dude, we got the name the captain. Are we going to Are we Are we keeping Rad the captain in for a while? Should I ask? I don't think so. I mean, I don't think it matters. He's here for one job. We've hired the captain for one job. The captain is a mercenary. Okay. The captain is just minutes giving him rare candies. No, it'll go fast. It'll go fast. We can go real fast. We can go real fast. Zubat learns me. Look at 29. We're past that, Jack. I We could do a Zubat. Who can we teach? [ __ ] that. The Radicate is perfect. Who can we Okay. Yeah. Click on false swipe. Let's see if we can Let's see if we can teach it to If we can teach this to the Radicate, we're [ __ ] in. And this is a Is this a TM or an HM? Can't He can't learn false swipe. Are you [ __ ] kidding me? No one I have in my squad. Are you kidding me? Okay. Okay. Maybe he has to be higher level. How about mean look? You have a mean look. Where's Mean Look at I think he",
            "start": 1846.48
        },
        {
            "text": "Are you [ __ ] kidding me? No one I have in my squad. Are you kidding me? Okay. Okay. Maybe he has to be higher level. How about mean look? You have a mean look. Where's Mean Look at I think he has mean look. Let's see if No, you're thinking of You're thinking of Radicate has a different move that's not mean look. What's the one that Mean Look the one where it can't you can't get out of it. Yeah, but no, Radicate wasn't hitting you with Mean Look. It was catching you with something else. Oh [ __ ] It was hitting you with pursuit. Pursuit. Pursuit was the No, no, you're not allowed to leave. Yeah, that was the move that kept [ __ ] y'all. Is pursuit what we want then? See that? Tries to switch out of Well, but but he can still leave though. We could have still left. No. No. When you try to leave, it hits you. Yep. Yep. Yep. And killed us. Yeah. [Music] But can we use pursuit to catch the dogs? No. So, this is useless. Yep. We got to do the Zubat. Yeah. Myas can learn mean look. Who's",
            "start": 1897.28
        },
        {
            "text": "leave, it hits you. Yep. Yep. Yep. And killed us. Yeah. [Music] But can we use pursuit to catch the dogs? No. So, this is useless. Yep. We got to do the Zubat. Yeah. Myas can learn mean look. Who's this? The [ __ ] is that? Mr. V. The You liked her. She was like a little witch. Oh, is that the little ghost? The little ghost monster. [Music] Ken Jr. is a little late on that message. Yeah, Ken Junior, where were you 5 minutes ago? Yep. Ken Junior. Ken Junior. Ken, I see it. Ken Jun, you're late on that one. We miss you. [Laughter] We're really overthinking this one. We're just going to hit this thing with a master ball with the Dude, I'm getting all three of these [ __ ] dogs. at some point. Hey, if you want to get all three of them right here, we we are more than welcome to. Andy was right. Has anyone told them they can't fly to the dogs? I know, Chris. I got to fly close to the dogs. Fly close to him. We'll get a home. Chris, fly up here and come hang out with us. Where are you,",
            "start": 1939.52
        },
        {
            "text": "right. Has anyone told them they can't fly to the dogs? I know, Chris. I got to fly close to the dogs. Fly close to him. We'll get a home. Chris, fly up here and come hang out with us. Where are you, Chris? Where are you going? Where have you been? I watched a movie with you. Where's my Zubat? Did you Where's my Zubat? Where have you been? Level six Zubat. Maybe it was Saturday night. I don't remember. Look, look, look, look at your Was it There it is. There it goes. Goldbat. No. Goldbat level 22. Are Are we not Are we ditching the the eradicate? The radicate's not working. Oh, you want the mischievous? We got Well, this has me look. Okay. I mean, does it We have to check the stats. Well, I mean, [ __ ] juice it up. [Music] Confus. They might not have it yet because you got to gas it up. Uh, gas him up. What's uh Gobat, right? Gobat. What level is it? 22. That's 22. All right. Give me one second. I'll look at its move set. Gobat is generation 4. You could have it learn mean look and",
            "start": 1988.48
        },
        {
            "text": "Uh, gas him up. What's uh Gobat, right? Gobat. What level is it? 22. That's 22. All right. Give me one second. I'll look at its move set. Gobat is generation 4. You could have it learn mean look and confuse rays and confuse rays. Stall it out is what the mean look is 33. Oh, here's some here's it learn false swipe. Confuse rate. Does it already have confus? Cuz that's Yeah, we do. We do. It already has confus. What is confuse rate get us? I want false swipe. Well, yeah, we're going to go false swipe. Confuse rays. But we don't know if we can learn false wipe. Well, you're going to find out right now. False. You can just type in the TM right there. It's wipe. Hold on everyone. Stop. Anony's calling me. This is important. [ __ ] Anthony. What's up? How are you? Tired of this [ __ ] Something about a Ge, dude. This is cool. Oh, I ate some berries. That one friend that has nothing going on, but they just about the mundane [ __ ] in their lives. I don't think he can learn it cuz Gobbat is",
            "start": 2046.72
        },
        {
            "text": "about a Ge, dude. This is cool. Oh, I ate some berries. That one friend that has nothing going on, but they just about the mundane [ __ ] in their lives. I don't think he can learn it cuz Gobbat is what? What did this 27 or something? Why don't you type in who can learn both? Yeah, let's start with that. I like the attitude. Who can learn? Let's just start off. I have the list right here. Yeah. Who is it? Who can learn it? Do you see how many Pokemon? There's a thousand Pokemon. Meow. Can Well, [ __ ] me out. We We like to Meow a lot. The false sight didn't work. None of these guys can learn false swipe. Okay. What if we just gas him up and he just he kind of tackles him a little bit until he gets low level. You don't need false swipe. Yeah, we don't need Yeah, we're going to gas him up. Just just start popping. All you need is mean look, right? Yeah, we just need we need mean look. Huge rays will freak him out. Yeah, but we got to be able to take it down. Yeah, I mean I think he's",
            "start": 2101.12
        },
        {
            "text": "Just just start popping. All you need is mean look, right? Yeah, we just need we need mean look. Huge rays will freak him out. Yeah, but we got to be able to take it down. Yeah, I mean I think he's got to move to do that. He'll have a tackle or something. I love Mike's confidence. Absolutely. He'll have a tackle or something. Tackle. He's got something. Don't worry about it. All right, let's I'm just trying to get to the candy feed. You know what I mean? I'm trying to get to the candy. [ __ ] feed him up, dude. He's going to have air cutter mean look at 33. Sit back, relax while we feed this thing to [ __ ] 75. Air slash at 55. This is our [ __ ] Heisenberg, bro. How What's the level of these dogs? Do we know? 45. The dogs are 45. I'm pretty sure they're 45. Get it to 51 so you can have air slash, which is 95% accurate, 75% uh power. But we don't want to kill it. We need a move that stops it but doesn't kill it. We need to get it close cuz if we kill it, we don't get it, right? People",
            "start": 2147.2
        },
        {
            "text": "slash, which is 95% accurate, 75% uh power. But we don't want to kill it. We need a move that stops it but doesn't kill it. We need to get it close cuz if we kill it, we don't get it, right? People are saying the dog's at 40. So, let's let's get the 55. 55. May maybe 60. You know what I mean? Let's just make this our monster. You want this random guy we've never rode with to just finish the movie for us? Let's make this [ __ ] Vin Diesel dies and we just get [ __ ] some random other wrestler to come in. Diesel dies. I brought in John Cena. [ __ ] He just gets John Cena with his bad hair. [Music] Heenberg cutter. Heisenberg. He's asking why is there a two in there? Yeah, that's the way I wanted to say it. That's how he wanted it. Maybe Andy wanted that cuz Andy's crazy. Andy's [ __ ] crazy. All right, so air cutter. Air cutter. Change out astonish for that one. Astonish. Yeah. Well, what does astonish do? Cuz this actually like [Music] No, we shouldn't do that. Or wing attack. One of",
            "start": 2190.64
        },
        {
            "text": "All right, so air cutter. Air cutter. Change out astonish for that one. Astonish. Yeah. Well, what does astonish do? Cuz this actually like [Music] No, we shouldn't do that. Or wing attack. One of the two. But I user attacks the foe while shouting in a startling fashion. It may also make the target flinch. That's a good point. Winning a wing attack. We also never use astonishes flinch. Yeah. So get rid of astonishing. Yeah. We do love dark bite though. Dark bite we ride for. Confusion isn't do [ __ ] No, we want we need that one. Yeah. Yeah. All right. It only has power 30, right? We're going to freak the [ __ ] out of this Pokemon. It's about making it flinch. That's fine. [Music] [ __ ] yeah. Gas him up. Gas him up. So mean look is at level 33. [Music] Jesus. What's What's Chris saying in the [ __ ] chat? Is the best. What does he say? Confus doesn't do [ __ ] Christ. It's like they they haven't played 300 hours of these games. We're shooters. [Music] [Laughter] Chris, we're looking",
            "start": 2238.8
        },
        {
            "text": "the [ __ ] chat? Is the best. What does he say? Confus doesn't do [ __ ] Christ. It's like they they haven't played 300 hours of these games. We're shooters. [Music] [Laughter] Chris, we're looking at victory road. Chris, you can't look at these look at these gentlemen in this box and say they're not at the end. They've done it. Here we go. Here we go. The What's the move? Mean look's coming. Mean look. All right. Now, what are we getting you? Uh, I think we're dipping out on that. Uh, wing attack. Are you sure? Wing attack or air cutter? One of the two goes. Probably air cutter. Air cutter, right? Because it's a special and his special is way lower than his attack. So, but it has a high chance of critical. Yeah, but this has more power and better accuracy. Do it. All right. See you air cutter. I can't remember which one did the is it the ripple that we like or for this guy or you're good. Does he upgrade? What does that mean? Pass Goldbat or is it always Goldbat? I think Goldbat's",
            "start": 2312.72
        },
        {
            "text": "cutter. I can't remember which one did the is it the ripple that we like or for this guy or you're good. Does he upgrade? What does that mean? Pass Goldbat or is it always Goldbat? I think Goldbat's high Goldbat for for this game. Gobbats are electric, right? So he could be our He could be a nasty. No, he's just a flying Oh, he's just flying. He's not electric. He's got like he's electric. He's flying poison. He's Oh no. Give him the sight. Go back with friendship. You need friendship. We're not We don't do friendship. Well, I give him the sooth ball. Just carry him on my party. I'm sure [Music] you don't know how long we're playing this game for. Might for another month. This [ __ ] might just stick around. So he I'm sorry. So he does have one more evolution. Uh yeah, but through friendship, but I don't What is this friendship [ __ ] [ __ ] [ __ ] with us. That's what they did. [Music] Oh, people are saying so if you give him the sooth ball and keep pumping him full of candies, he",
            "start": 2371.04
        },
        {
            "text": "but I don't What is this friendship [ __ ] [ __ ] [ __ ] with us. That's what they did. [Music] Oh, people are saying so if you give him the sooth ball and keep pumping him full of candies, he might just evolve. Let's try it. What would he evolve into? The next [ __ ] bat of the bone. Crowbat. Wait, is that how that works? A crowbat. Well, I think so if you give him rare candies, it helps with the friendship level, but I don't know if it's going to work. I feel like that's like forcing something you should. It's like giving your your your Well, I mean, all animal ownership is sort of a form of slavery. I don't think that's accurate, right? Can your dog leave? Is it allowed to leave? Can it go wherever it wants? Exactly. They got freedom. Do they have freedom? In the backyard a lot. Probably trying to find a quiet area. Yeah. He's probably trying to get away from everything. Just have a little moment of his own just so he owns cuz he can't own anything. This is own. This is his area.",
            "start": 2424.24
        },
        {
            "text": "trying to find a quiet area. Yeah. He's probably trying to get away from everything. Just have a little moment of his own just so he owns cuz he can't own anything. This is own. This is his area. How's the other dog? Ramsy's. Yeah. Good. Well, yeah. Nice. He's bugging. Are they friends or no? Yeah, they're friends. Okay. Okay. How about the cat? Oh, cat loves the Oh. Oh, yeah. They're best friends. Should a movie be I got poison fang? Oh, let's try. Let's go. Poison. 50 power 100 accuracy. Well, we probably don't want Poison Fang cuz if we hit him and it becomes poison, then we can't control if it's going to die in front of us or not. Yeah, but if it does Oh, we can always poison will leech though. And if it starts to die, we'll throw a master ball at it. Okay. So, this we don't have Yeah, that's what I'm saying is No. No. We want to keep confusion, right? Yeah. Either because we want him to be confused and not be able to dip out. No, mean look makes it makes him so he can't dip. No,",
            "start": 2471.76
        },
        {
            "text": "that's what I'm saying is No. No. We want to keep confusion, right? Yeah. Either because we want him to be confused and not be able to dip out. No, mean look makes it makes him so he can't dip. No, mean look only keeps him there for so long. It keeps him there for as long as we're we don't trade out. Correct. But then they were saying that it could be shorter. Who was saying that? Chad was saying that. Yeah, Chad said that. I guess dark bike can go cuz he's not dark. Yeah, bike can go. We love dark poison. Got to go. Does it have to go? Yeah, I mean it doesn't. Well, this is stab because he's a poison type. So, this is great. I'm just thinking like later down the road if we want to do a second run of this. Read the damn chat, says Mergy. Mergy, what did you say? Yeah, you got to say the rest. What is it? We're waiting. The amount of false information they teach each other is wild. If you believe it, you see it. Don't worry about it, chat. We're fine. Thank you, Axel 360. Axel Axel",
            "start": 2520.64
        },
        {
            "text": "rest. What is it? We're waiting. The amount of false information they teach each other is wild. If you believe it, you see it. Don't worry about it, chat. We're fine. Thank you, Axel 360. Axel Axel said no. He locks them in forever. Okay, I know because I fought people that give me mean look has been given to me before. Do you remember that? Yeah. The sponsors were giving them to you and then they would cursing you. That was a crazy time. Mean look will work until anti uses roar. See that's why we hit it with confuse ray so it can't use roar cuz it's [ __ ] freaked out. Yeah, but that's not 100%. It's not 100% chance that it's going to confuse him. It might not confuse him. It might not. But we're at least holding him back from using roar is our goal. I would teach her bat taunt. It's too late for that. We'll never teach him taunt. Uh, this time [Music] I'm just going to go and throw the [ __ ] ball at this thing. It's TM2 taunt. Okay, I can teach him taunt. 12. Team 12. Team 12.",
            "start": 2559.2
        },
        {
            "text": "too late for that. We'll never teach him taunt. Uh, this time [Music] I'm just going to go and throw the [ __ ] ball at this thing. It's TM2 taunt. Okay, I can teach him taunt. 12. Team 12. Team 12. Yeah. What does taunt do? Uh, it taunt prevents the target from using status category moves for three turns. Okay, we can do that. I mean, yeah, we're we're going, you know, let's just go at this point. This [ __ ] gold bath's going to be up right now, bro. Uh oh. You want to learn haze? No, I probably don't. I just want to see what Oh, it's a haze move. Ace move. We're going to cancel that. Forget it. Yeah, we don't need that. They're doubting you. They say you're not going to catch this this dog and beat the game. All right, I think we're leveled up enough. How far should we get him? I mean, keep going. You want to just keep seeing what happens? Keep pushing him up a little bit more. If I juice him up too much, it's going to hit one hit and find. We're not going to wait. Get up to like",
            "start": 2610.16
        },
        {
            "text": "keep going. You want to just keep seeing what happens? Keep pushing him up a little bit more. If I juice him up too much, it's going to hit one hit and find. We're not going to wait. Get up to like 55. All right. 55. Good god. Mike wants to see him evolve. [Music] Yeah, but he needs like a 250 friendship. Now Sean Sean's telling me, Mike, look up Tyranitar and tell me you don't want one of these bad boys. I of course love a Tyranitar. Is that in this game? I don't think we're in that generation yet. Oh, that's cool. Yeah. Is it in this game? No way to know. No way to know. I want this thing to [ __ ] evolve. Yeah, it looks like it. It says they can't handle Tyranitar. Well, we've yet to see one. If we come across one, we'll catch it. Well, let's see. It evolves level 55. Oh, so there's a baby Tyrannitar. Yeah. I mean, there's like two stages. There's Okay. Okay. Larvitar. Wait, what is he like? It's in the book. Flying slash. Oh. Oh [ __ ] That's crazy. I told you. He's not in this",
            "start": 2671.68
        },
        {
            "text": "a baby Tyrannitar. Yeah. I mean, there's like two stages. There's Okay. Okay. Larvitar. Wait, what is he like? It's in the book. Flying slash. Oh. Oh [ __ ] That's crazy. I told you. He's not in this book yet. Chad, you got to remember there's a whole second half. We have slash or air slash. Air slash. And that's 75 and 95%. I'm going to find this [ __ ] Pokemon. Is that better than wing attack? Probably, right? It's better, but it's lower accuracy. Yeah. Yeah. And it's not much better. And it's only his special and his special attack 77. So, we don't want to learn this, I don't think. Yeah, cuz the other one's attack, right? Yeah. I think we'll just We'll forgo this one. Oh, physical attack. Why do they got to make this [ __ ] so confusing? [Music] What could make anti- [Music] flinch lose wing attack? Yeah, maybe we do lose wing attack. This is a really powerful move, but it's not as special. The problem is we don't want to be overloaded for overlevel for the elite four level. How",
            "start": 2727.76
        },
        {
            "text": "wing attack? Yeah, maybe we do lose wing attack. This is a really powerful move, but it's not as special. The problem is we don't want to be overloaded for overlevel for the elite four level. How to obtain it? Level uparitar right there. Air slash can make him flinch. All right, I'll put air slash in. [ __ ] it. War talk. Well, instead of attack. Oh [ __ ] I mean, it's not it's not great cuz his attack's 106 and a special attack 77. So this but I don't know how that equates to the power of the move cuz the power air slash is so much more powerful than than wing attack. So this is where I don't know how you calculate the [ __ ] compound interest on these moves. Yeah, bro. You never know. What's better is wing attack. Who's giving you a better interest rate? You don't know. Lynch equals no roar, meaning the battle can last longer. [Music] Chad, we need help on what we should do here. Is air slash better than wing attack? Yeah. Who do we put in? I mean, it's stronger. Use air slash, says",
            "start": 2791.8
        },
        {
            "text": "meaning the battle can last longer. [Music] Chad, we need help on what we should do here. Is air slash better than wing attack? Yeah. Who do we put in? I mean, it's stronger. Use air slash, says use air slash. It's safer. All right, [ __ ] it. Let's put it in. Go with your heart. Flip a coin. Too late. All right, we're at 5. We're at 51. Mike, you want You want 55? 55. Freak this thing. Freak this thing. If we're going to If we're going to do it, let's do it. You know what I mean? [Music] I'm looking up the Safari Zone right now so we can get a Scyther. No. So if we can catch this Tyranitar because they were yelling at me in the game. No, no, he he is. He's in the game, but there's two separate games here. He's rock/d dark. All right, we're ready. I I think he's in both. Yeah, he's both. Soul Silver. No, I'm talking about two separate halves of the game. You know what I mean? Like was he in was is he technically in the first half? You have to catch his first form. All right. Eisenberg",
            "start": 2842.0
        },
        {
            "text": "Silver. No, I'm talking about two separate halves of the game. You know what I mean? Like was he in was is he technically in the first half? You have to catch his first form. All right. Eisenberg is first. We need to teach him taunt. That was a question that came up. I don't know if I have it, but we can buy it cuz we have a lot of know how to get the dogs. But we're trying our hardest to figure it out, right? I don't have taunt, but I do have to pee. I'll be right back. Mike, look it up. Kevin, run the ad. This episode is brought to you by Imperial. We've told you all how important it is to developers to wishlist games that you're interested in. So, if this sounds cool to you, make sure you wishlist it. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly",
            "start": 2920.72
        },
        {
            "text": "in a far-off corner of the galaxy to explore an imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith. Accessible only by using mysterious artifacts known as cardoggrams. Each card affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies or buy them from other players online at the trading post. Imperial features three weapon archetypes. The fast-paced acrobatic glaive, the defense focused mason shield, or the devastating cannon with a range of customizable skills and abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix",
            "start": 2968.8
        },
        {
            "text": "abilities that can make short work of the awaiting automatons. Your weapons and abilities can be changed before any excursion into a cardoggram. So, if a loadout isn't working for you, you can mix things up to create the perfect play style. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X ands, and PS5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraframes. If you haven't called your mom in a while, here is your reminder to do it. But then you want to go above and beyond. Mother's Day is coming up and I have the perfect gift idea. Aura Frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right",
            "start": 3013.28
        },
        {
            "text": "to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Greg, Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. So the next time you need to call your mom, you can also send her a new pick of you from that trip you're telling her all about. Ara has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oruraframes.com to get $35 off plus free shipping on their bestselling Carver Matt frame. That's a rafra.com promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be",
            "start": 3058.88
        },
        {
            "text": "the show by mentioning us at checkout. Terms and conditions apply. The show is sponsored by BetterHelp. It's super great that mental health awareness is growing, but there's still progress to be made. 26% of Americans who participated in a recent survey say they have avoided seeking mental health support due to fear of judgment. We can do better. No reason for fear. BetterHelp has over 10 years of experience matching people with the right therapist from the diverse network of more than 30,000 licensed therapists with a wide range of specialties. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. It isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit",
            "start": 3102.48
        },
        {
            "text": "major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. We're all better with help. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp hp.com/kindfunn. better betterhelp.com/kindfunn. I have no idea how this is going to play out. All right, that's why we wanted to Yeah, I don't know. Let's go [ __ ] find out. And guess what? If [ __ ] hits the fan, we'll [ __ ] rare candy the [ __ ] out of another animal. All right, so he's right above right now. He's right on route 43. Okay, so now Chris says they move, but they do move. So we have to clash. We have to fly and find into them. Yeah, but we can't fly to them. We have to I got to teach him. [ __ ] I got to teach. We're good. We're good. So, that's the big fly as a [ __ ] thing. Come on. This game is You got to go outside, bro. You got to go outside. You can't fly out the roof. Chris Anka called me,",
            "start": 3145.84
        },
        {
            "text": "to teach. We're good. We're good. So, that's the big fly as a [ __ ] thing. Come on. This game is You got to go outside, bro. You got to go outside. You can't fly out the roof. Chris Anka called me, by the way. Yeah. He's checking you. He's checking I'm sure. Let's see what he said. Let's Let's double check. He's still there. [Music] After you fly, check the map, they say. Okay. Yep. We got a bike. We'll [ __ ] We'll super ride over, dude. I got this [ __ ] guy. Don't worry about it. We'll get him. You got to remember he caught a Lugia [ __ ] first try. First try all natt natty. Okay. Think to yourself when did you go all natty? Yeah. Y'all out there getting that master balls and cheats Machina coming in. Did you go Did you go all natty? I haven't seen you go all natty lately. Everyone's out there getting a [ __ ] left hard. [ __ ] left. [ __ ] left hard. All right. Yeah. This is going to be hard to get him. What do we do now? You just ride your bike to him, right? Yeah, that's what I",
            "start": 3194.08
        },
        {
            "text": "there getting a [ __ ] left hard. [ __ ] left. [ __ ] left hard. All right. Yeah. This is going to be hard to get him. What do we do now? You just ride your bike to him, right? Yeah, that's what I would assume. All right, put on the max repel. Yeah, we're going to put on the max repel and just [ __ ] whip the dip. Well, no, the max repel is going to wear out real quick cuz 40 of them. No, I know. You're just going to have to do them a lot is what I'm saying. Fine. Who cares? I have 40 of them. But I mean, unless you're going through, Kevin, I have 40 max repels. It's going to be okay. He's got he's got max repels. Don't worry about it. Green. Let him rip. Let him rip. He's just running. Oh, he's coming closer to you. No, it's going to We're going to clash with this thing. We're about to clash. We're going to ride this bike and clash up. I need to put my bike on my thing. I [ __ ] his ass. I'm just going to run at his ass. Just run at him. Did Andy give up on these guys or what? Andy's",
            "start": 3266.16
        },
        {
            "text": "We're going to ride this bike and clash up. I need to put my bike on my thing. I [ __ ] his ass. I'm just going to run at his ass. Just run at him. Did Andy give up on these guys or what? Andy's busy. He's busy. Andy's too cool for school. He's He's saving his 10%. 10% for him always. What's up with that ball? I don't know. I mean, is surfing the right move here? Look at him. Look at that little fucker's right there. Do I catch him? I can't get through it, though. I don't have a cut. I don't have a cut. [ __ ] cut, dude. God damn it, Nick. [ __ ] He's right [ __ ] He can't get out. That's not even the dog we want. But I want him now. He's right [ __ ] there. He's trapped. Is he trapped? He's trapped. Well, he can't open it. Wait, wait, hold on. I can teach cut to someone right now. I don't have any. There it is. Please tell me I can teach you to this [ __ ] zubat. God damn it. All right. Well, we got to pass up on this bad boy. It's tough cuz he's That's a bad [ __ ] right there. Look",
            "start": 3308.76
        },
        {
            "text": "have any. There it is. Please tell me I can teach you to this [ __ ] zubat. God damn it. All right. Well, we got to pass up on this bad boy. It's tough cuz he's That's a bad [ __ ] right there. Look at him. Let's communicate with him. What What is that thing doing? You know what I mean? What's he doing? I mean, [ __ ] that though. [ __ ] I mean, he's not even on your map. Is he on my map yet? Or is maybe it's the lightning one's gone. Oh, where's the third dog? I don't know. What is that thing? No, that see that's not on your map cuz look, there's the third. That's got to be the third one. Is he just always there? I think this guy's special. Oh, he's special. [Music] How do we not have cut? Someone's saying save, save, save. Save for what reason? We have to move no matter what. So, so this is Yeah, he's popping things Yeah. Okay. So, I don't need this. I'm He's I'm going to get him no matter what. Yeah, you'll get him later. This was the one that the the scientist was chasing all",
            "start": 3369.28
        },
        {
            "text": "this is Yeah, he's popping things Yeah. Okay. So, I don't need this. I'm He's I'm going to get him no matter what. Yeah, you'll get him later. This was the one that the the scientist was chasing all around freaking out about. Okay. I mean, Chris, I already knew about it. I already knew about Yeah, Chris, we already knew about. We're testing you, dude. We've been testing you. We're here to catch catch this fire Pokemon. Oh, dude. He's running from us. And they doubted you. They didn't think you got They didn't [ __ ] doubt me, dude. They doubted me. They didn't think you got this. See, I want to save that Master Ball for this one. For this guy, for that No, the other one. Yeah. Yeah. [Music] Chris is always out there trying to keep us honest, dude. Yeah. Uhhuh. He wants you to play with risk. And I like that. We get it. I like playing with a little bit of risk. All right. He's running. Save this thing. Safe. Not like we're going to need the save. You know what I mean? We're not going",
            "start": 3449.84
        },
        {
            "text": "And I like that. We get it. I like playing with a little bit of risk. All right. He's running. Save this thing. Safe. Not like we're going to need the save. You know what I mean? We're not going to need this. [Music] My friend Jim is so invested in this right now. Super Mario Mario. Okay, I'll take a look. Ground points. I need something fun to play. Chad, it's my birthday. What am I going to play tonight? I don't know. Wait. Okay. What games am I in? Jim, what are you talking about here? He's going to move, too. Jim says he's going to move when you walk out. Go to Ecto and out of the route south until they are in the patch, please. Okay, he's going to move too. I don't know what that means. You've confused me. They change location every time you go in and out of a route. Okay, they But what about Oh, I think he's right here. Don't worry about it. Got this guy right here. [ __ ] clash this thing right now. He's right under it, dude. We're on it. [ __ ] face to face. [Music] Where is",
            "start": 3504.64
        },
        {
            "text": "what about Oh, I think he's right here. Don't worry about it. Got this guy right here. [ __ ] clash this thing right now. He's right under it, dude. We're on it. [ __ ] face to face. [Music] Where is he? Where is he? Where is this little [ __ ] [Music] See the dog anywhere? People, anyone see the dog roof? Where's this [ __ ] dog at? Roof roof roof. Maybe my repel stopped it. No. Do I need the Ah, [ __ ] Okay. Yeah, the repel stops it. Why is he gone? Well, it's just repelling everyone from being around me. Yeah, but they're like they're actually on the map. [Music] [ __ ] punked up by eradicate. This is a [ __ ] eradicate. God damn it. Yeah, I'm a child. Who's boss now? Heisenberg. Welcome to [ __ ] Heisenberg now. Welcome to [ __ ] Heisenberg. Payback's a [Music] [Applause] [ __ ] God, Chris is out there just hoping we fail. Uh-huh. Yeah. Yeah. Yeah. He He likes watching that. He hates us, dude. Here we go. I feel it. It's the dog. [ __ ] yeah. What? I thought you bang into the dog.",
            "start": 3567.12
        },
        {
            "text": "is out there just hoping we fail. Uh-huh. Yeah. Yeah. Yeah. He He likes watching that. He hates us, dude. Here we go. I feel it. It's the dog. [ __ ] yeah. What? I thought you bang into the dog. You got to You got to find him. It's [Music] random. You can't flinch me, dude. It's random. Yeah, it's random. Huh? It's here. We We'll hit it eventually, but it's random. No, it's out here. Is he still in the area? Yeah, I think so. Yeah. Where is he? No, he's down there. He left. He [ __ ] left. He's on the complete opposite side of the map. [Music] We banged into him before. We have. So, what are we doing wrong? [Music] You just It's random. It's a random encounter. Okay. They've been saying it. Chad's been saying it. Go in and out of the route. Okay. Oh, just keep waking him up. Yeah, just keep waking him up and see where he's at. Pick me up inside. He's just It's random. He's doing his thing. I think you got to go through back and forth, back and forth. You got to officially change",
            "start": 3674.04
        },
        {
            "text": "keep waking him up and see where he's at. Pick me up inside. He's just It's random. He's doing his thing. I think you got to go through back and forth, back and forth. You got to officially change [Music] [Applause] routes. Why did this become a nightmare? You know, it's just like love. When you want it, you can't find it. And then when you say, you know what, I'm going to focus on myself. That's when she comes. She comes to you. That's when she comes to you. That's the truth. Love. Kesha Cole going on tour. Who's Kesha Cole? the person who sings love. Thank you for that. Between you and Kevin today, I swear to God. I swear to God between you two. Look at my my two [ __ ] ADD friends over here. Where are we going? Focus. Mike, everyone is the focus. [Music] Oh [ __ ] Go under and then go in and out of the two routes there. How do we get this? Wait, what? How can I go get this other one? You can get whatever one you [ __ ] What's the What's the Suka cane? No, you can't get that one.",
            "start": 3744.24
        },
        {
            "text": "in and out of the two routes there. How do we get this? Wait, what? How can I go get this other one? You can get whatever one you [ __ ] What's the What's the Suka cane? No, you can't get that one. Why not? That one's off the list. That's a plot point. But I want to throw a ball at it. Well, yeah. Unfortunately, you can only get the electric one or the fire one, right? Well, I can't throw a ball at this this other one. You not? No, you can't even look at it. Don't even look at it. Easy to run, huh? Yeah. Okay. Go south under the gate, then just walk in and out. Got it. Sounds [Applause] good. Oh. Oh [ __ ] Oh my god. Is it on top of you right now? I think he might be right on top of me. Let's walk in here real quick. Yeah, this is where I saw him last [Music] time. Like he's in the tall grass. Yeah. Come on, baby Jesus. Let me catch this [ __ ] thing. Let me just catch him. [ __ ] It's a [ __ ] Pidgey. Maybe he won't show up cuz you're Cuz this guy's so strong. He's not that strong.",
            "start": 3814.68
        },
        {
            "text": "grass. Yeah. Come on, baby Jesus. Let me catch this [ __ ] thing. Let me just catch him. [ __ ] It's a [ __ ] Pidgey. Maybe he won't show up cuz you're Cuz this guy's so strong. He's not that strong. [Music] He's the strongest in the video. 55. I am the destructor. Does he move after battle? He probably does. Let's see. He has different music. Okay. He also looks different. He's got to be right on top. He's right in there. He's right in there. Okay. They're saying it's in there. Right in there, dude. He's in. You'll know by the music, they say. Oh, not the same guy. That's different music. No, that's Pidgey again. They say just stay in this patch of grass. Okay. [Music] Why is the Pidgey faster than me? I'm level 55. People were asking that. Why was the Pidgey faster than you? What the hell? Heisenberg's kind of slow, but Heisenberg's a big bat. It's a big It's a large bird. [ __ ] stay in the grass. All right, we're going to stay in the grass. Well, we're going to be here a while.",
            "start": 3869.32
        },
        {
            "text": "hell? Heisenberg's kind of slow, but Heisenberg's a big bat. It's a big It's a large bird. [ __ ] stay in the grass. All right, we're going to stay in the grass. Well, we're going to be here a while. Just run from these low levels. Or you can murder him. [Music] It's like the same amount of time to run as it is just to dork them out, you know. Yeah, I agree. I I agree with that. I don't know. I don't I don't feel positive I'm running. I'm going to slow off walk this. Slow off. Let him come to you. Let him come to you. Oh, [Music] [ __ ] Okay. I hope we'll just run from the stupid [Music] [Music] thing. And the chat's frozen again. Sorry, chat. I got him over here. Don't worry about it. What are they saying? What What did Mr. Anderson say? How did they not know how quick Mr. Anderson Mr. Anderson, what are you saying? What What [ __ ] are you talking right now, Mr. Anderson? How do they not know how quick attack works at this point? Oh, well, yeah, we know what quick attack is. We're",
            "start": 3928.72
        },
        {
            "text": "Anderson, what are you saying? What What [ __ ] are you talking right now, Mr. Anderson? How do they not know how quick attack works at this point? Oh, well, yeah, we know what quick attack is. We're just blown away that Pidgey so much faster than Goldbat. We want Goldbat to be faster. That's unfortunately not his style. This motherfucker's not here. I'm going to give him five more minutes and then we're going to go catch that sweet king. Throw a ball at its face. What if you go down? Is there more grass lower? He's probably gone right by now, right? No, he's here until you. As long as you don't change routes and don't put on Maxel, you're in. Well, I can look around him and see. Let's see if he's just up there still. Maybe. Oh, you just changed. Yeah. [ __ ] I just changed. God dang it. Yeah, he's back on the other side. [ __ ] do the same thing you were doing. Yeah, let's go. These double mint twins freaked me out. So, he was in that patch of grass. He must have been. He's only in",
            "start": 3996.36
        },
        {
            "text": "Yeah, he's back on the other side. [ __ ] do the same thing you were doing. Yeah, let's go. These double mint twins freaked me out. So, he was in that patch of grass. He must have been. He's only in that patch of grass. Oh, look at this Vulpix. Oh, yeah. Vulpix, man. But I'm talking about not to get cut off the team. Terrible advice there. Jedberg says, Jenberg, what was I supposed to do? We got to try something here. Okay, we got to [Music] try. He's on you again. [ __ ] you. Dear baby Jesus, we're back. Come on. Get a hold of this [Music] thing. Come on, dude. Getting clowned out by this Pidgey. [Music] Yeah, we're just rocking. We're just rocking and rolling. I'm I'm getting more and more nervous as this goes. Oh, look at this thing. Oh yeah, we got one of those. We got one of those. The elf Pokemon saying just keep walking. [Music] Oh, he uses quick attack. That makes sense. Now, Colton says repel plus a level 40 lead mon means they'll only encounter ente. Well, we have we don't",
            "start": 4046.0
        },
        {
            "text": "The elf Pokemon saying just keep walking. [Music] Oh, he uses quick attack. That makes sense. Now, Colton says repel plus a level 40 lead mon means they'll only encounter ente. Well, we have we don't have that. We have 45 or 55. Those are our Pokemon at this level. So, is it level 40 minimum or am I too high level? Can I put it on my guy? Let us know, Colton. Cuz I'd love to put a repel on him and just I don't think you can put a repel on this guy. He's too high. It's got to be 40. So, you only call up the 40 plus. If you go 50, he's only calling 50 plus. Well, you made me juice this guy up to the [ __ ] Colonels, dude. This guy This guy rules, bro. Is he still in here? Let's take a look. I think he's gone by now. If he's gone, we're we're going to ditch him. No, he's in, dude. He's in here. He wants me to [ __ ] catch. He want See, I think it's your I think it's your lead Pokemon. You think he's just not coming out? I think he's afraid because you got the I don't have a choice. All",
            "start": 4122.56
        },
        {
            "text": "He wants me to [ __ ] catch. He want See, I think it's your I think it's your lead Pokemon. You think he's just not coming out? I think he's afraid because you got the I don't have a choice. All right, fine then. Here's what we'll do. If you switch him out, though, he's going to run. That's fine. We'll just throw the master ball at him. Save right now. Okay. Save right now. Just in case. Save right now. Think is going to be so mad in the chat. Just in case. Save right now. Save right now. Just in case. We're going to catch this Pokemon. All natty. But I don't have a level 40. Oh, my other guy's like 47. Well, there's gold ball. So, there's the master ball or gold bath. Those are our two routes, right? Okay. We're trying to go gold. What do you want me to do here? I mean, I'm swap in a lower level. I want you to save. Save really quick first. Okay. Before we do anything, swap in a lower level and let's just see if it calls to him. Maybe he'll think we're You make the chat go. I don't",
            "start": 4188.4
        },
        {
            "text": "level. I want you to save. Save really quick first. Okay. Before we do anything, swap in a lower level and let's just see if it calls to him. Maybe he'll think we're You make the chat go. I don't [ __ ] I will, of course. So, it's so annoying to just look up at a chat and have [ __ ] Mr. Anderson's cut off message. No disrespect, Mr. Yeah, I understand. But for Christ's sake, can we get a computer that works in this room? A multi-pillion dollar studio that we have [ __ ] Rupen Murdoch's like, \"Hey, good day, mate. Great. All this great and we got a [ __ ] three painting 386 running our chat here. These are the only people that know what they're doing. You and I are idiots blind leading the blind. Kevin's out there smoking a cigarette and chewing gum at the same time. Just go to the bottom. Just scroll down. Unpause it. Unpause it. I'm on too far. Lay on your [ __ ] side and unpause it. Okay. [Music] All right, we're saved. I think I saved. Let's try save one more time. Just scroll",
            "start": 4234.16
        },
        {
            "text": "Just scroll down. Unpause it. Unpause it. I'm on too far. Lay on your [ __ ] side and unpause it. Okay. [Music] All right, we're saved. I think I saved. Let's try save one more time. Just scroll down. All you got to do is scroll down. Just literally scroll down. Just scroll. Use your [ __ ] fingers and scroll down. You're so blind. Just keep going. Down, down, down, down, down. Oh, no. You can't do it. You can't do it, bro. Is there a reload button somewhere? Just Yeah, type in refresh, maybe. I don't know. What's the quick What's the What's the button for refresh? What's your quick tap? No idea. They don't have like a control F or something. I don't know. Maybe the chat could help me out, but I can't read them right now. Why isn't the screen mirrored? Why couldn't it be mirrored? Why does it have to be a second monitor? Why would you not mirror it? Just pull the thing out so I can see it here. I got a laptop. I got a MacBook, bro. There you go. A little bit over. Go up a little. Go",
            "start": 4281.84
        },
        {
            "text": "it have to be a second monitor? Why would you not mirror it? Just pull the thing out so I can see it here. I got a laptop. I got a MacBook, bro. There you go. A little bit over. Go up a little. Go up a down. Down. Just go slow. Go slow. Go slow. Go slow. Go down. Go slow. Stop [ __ ] We laughing. Go slow. Shut up. Go slow. Down. Down. Down. Down. Down. Down. Down. Keep going down. Keep going down. Keep going down. Stop. One more down. One more down. Now, uh, right there. Go down a little bit. Little bit. Little bit. Right there. Hit end. Like hit just click into it. And now just type something and hit enter. That did nothing. It's fine. Get back up here. It's fine. We got to figure it out. Don't worry about it. Get back up here. I'm putting Kito up. Okay. But if he kills Kito, we're That's That's the other problem. We don't want to put this guy first cuz he might dunk on my guy. Whatever. We're m we're masterballing him. [Music] We're never catching this [ __ ] thing. [Music] Oh god.",
            "start": 4333.6
        },
        {
            "text": "That's the other problem. We don't want to put this guy first cuz he might dunk on my guy. Whatever. We're m we're masterballing him. [Music] We're never catching this [ __ ] thing. [Music] Oh god. We're never catching this thing. Perfect. Thank you. Oh my god. God forbid we just do what every other streamer does. You know what I mean? Just have the do. We got to have the thing the two chats, guys. It's just easier to have the two chats in there. Every 13year-old streaming over here. [Music] We got to do it our way. We got to do it our way. our way that breaks every [Music] day. The best part is the cord doesn't move enough. I have to lay on the ground. Of course. Yeah. No, it's we got a 4ft cord for a 5ft space. We got to jack all this [ __ ] in within an inch of its [ __ ] life. Oh my god. Jedberg one wants to switch back. I don't know why Jedberg. Why? I'm not catching this thing [Music] today. Yeah, I'm just masterballing it at this point, guys. Yes, I know. I'm aware, guys. We're",
            "start": 4380.64
        },
        {
            "text": "Jedberg one wants to switch back. I don't know why Jedberg. Why? I'm not catching this thing [Music] today. Yeah, I'm just masterballing it at this point, guys. Yes, I know. I'm aware, guys. We're just trying to figure this out. I don't think this thing's [Music] here. Mike just died. Mike's just [ __ ] dying. [Music] insignas says the the kito is too damn high. [Music] Yeah, he's still on top of us, chat. That didn't work either, Mike. So, I'm putting I'm putting Heisenberg back in. They're saying you need to be level 40. No, they're saying it uh the repel. You can do level 40 and repel. Yeah, but anything above level 40 is too high to use. It'll just get him away. So, we could swap him out for a level We Yeah, we'd have to just go back and level someone up to 40 and see. But at this point, I'm just like, I'm probably going to master ball no matter what. We've wasted so much time with this. Yeah, we had so many plans. So many plans. I just don't think we're to get him. He's just He's",
            "start": 4480.96
        },
        {
            "text": "I'm just like, I'm probably going to master ball no matter what. We've wasted so much time with this. Yeah, we had so many plans. So many plans. I just don't think we're to get him. He's just He's in here. It's crazy cuz we banged into him a couple times. I banged him three times. Why Why are we not banging into him now? All right, let's jump the ledge in the top part of the grass. Oh, I see what you're saying. So, I could do this. If he's over in this patch of grass, he might be. I'm going to say [ __ ] you to that kid. You said that was bad advice. Well, you made me go. I I was trying to get down to this patch of grass, though. But this is him. Nope. Another [ __ ] Pidgey. Yeah, but I don't have a level 40 mon Colton. I'd have to go swap it out and we'd have to do mean look all over again. We don't got a man. Oh, I I see what you're saying. Throw in someone that's super low and then we'll just master ball him. That's probably what we're going to do. Let's do that. This is going to",
            "start": 4584.96
        },
        {
            "text": "We don't got a man. Oh, I I see what you're saying. Throw in someone that's super low and then we'll just master ball him. That's probably what we're going to do. Let's do that. This is going to take too [ __ ] long. All right. So, Gold Blast go is retiring. We're going to retire. A smart idea. It was a great idea. It's a great idea. He still could be in here. Well, I doubt it, but this is going to be so slow. [Music] Chris just uh texted me four minutes ago. Says Mike [ __ ] this whole run. I agree. How did I [ __ ] this? Chris, I agree. How did I [ __ ] this? I don't know what he did. Yeah, exactly. I had a plan. I didn't even want the dogs. I want I was the one who said we just finished in this game today. All right, let's just go. Let's just go to Elite 4. Let's take our gold blat and just murder everyone. Yeah, we're not doing we're we're out of this thing. Watch this. Bang. This is the one. Bangs right up to it right here. [Music] Albby says, \"You're all really unlucky right",
            "start": 4648.32
        },
        {
            "text": "and just murder everyone. Yeah, we're not doing we're we're out of this thing. Watch this. Bang. This is the one. Bangs right up to it right here. [Music] Albby says, \"You're all really unlucky right now.\" That's just the nature of the beast. That's what it's got to be. We're just unlucky. Yeah, we're just unlucky right We one timed all natti the Lugia. The Lugia is Lugia's on the bench. The sheriff's on the bench yawning right now. We should have known that it was unlucky when the chat dropped when the screen just blew up. Yeah. And then you had to lay down on the ground. Jesus. [Music] We're just going to throw random Pokemon in there, repel, and just go for shits and giggles. Who thought the laptop on the floor was a good idea? Why would the laptop be I don't know. Why is the laptop on the floor? My arms hurt. The cap blew up. Well, no, it's still underneath in the back, but it won't turn on. We got it. It's fine. It's the way it's going to be. It's the way it's going to be from",
            "start": 4696.32
        },
        {
            "text": "on the floor? My arms hurt. The cap blew up. Well, no, it's still underneath in the back, but it won't turn on. We got it. It's fine. It's the way it's going to be. It's the way it's going to be from now on. Yeah, it doesn't matter. I mean, I'll I'll look at it. It doesn't matter. Don't worry about it. [Music] All right. All right. What are we putting in? What are we doing? Well, sorry. We got to [ __ ] There's a deposit and then there's a move. And there's really no reason to ever use deposit. There's no reason to ever use deposit. It's always moving. You just move. I don't know why there's why there's so many different options in this game. We just deposited his ass. All right. I'm taking this level 17 skip loom. Okay. Yeah. Yeah. We're going to put his ass in the be the front. And boy, you got to get it up to 40, right? No, we don't need It's sub 40. Anything that's 40 or below with the repel, he'll come to you. If you're above 40 with the repel, he won't come to you. Okay. So, I'm",
            "start": 4752.72
        },
        {
            "text": "you got to get it up to 40, right? No, we don't need It's sub 40. Anything that's 40 or below with the repel, he'll come to you. If you're above 40 with the repel, he won't come to you. Okay. So, I'm putting this little [ __ ] out first. Do it. Do it. I love this. Right, chat. We're going to put this guy in our first place and we're just going to go [Music] hunt. It needs to be higher than the Pokemon on the grass. Why? Cuz it's repelling those. Oh, so like if I'm level 40, right, I'm repelling anything below 40, but anything above 40 will still bang into me. I see. So this skip loom needs to be like 35 so it can call upon the other one. So we need something that's like 40ish or in the mid 20s. How many Oh, we have the [ __ ] skip loom. We have this thing. What's this thing? That's 27. That's higher than you can just jam it with a couple of [ __ ] rare candies and bada bing bada boom. It's 35. But here's the thing. Oh, you're masterballing it? Yeah. Okay, then. Boom. I'm just going to",
            "start": 4799.92
        },
        {
            "text": "higher than you can just jam it with a couple of [ __ ] rare candies and bada bing bada boom. It's 35. But here's the thing. Oh, you're masterballing it? Yeah. Okay, then. Boom. I'm just going to master it. What's that? What's that? Cuz if I can't Yeah, cuz I can't catch it with 40. I have to teach me and look at all that [ __ ] We're just going to master ball it. People are saying you're good. 40 should work. 27. Yeah, you're fine. I'm catching 16, so it'll it'll be fine. [Applause] See if he's still down there, little [ __ ] N he's back over there now. It's s cuz we don't have two master balls. So what do we do on the other guy? The other guy? I don't know. Should we just keep it for him? Well, the other guy's on you right now. [ __ ] [ __ ] You know, just keep going back and forth. We want the other guy. I don't know if you can catch him. Well, the other guy's electric. We already have dude. We got the dude. Yeah, we got duty to call. Oh, no. That's cool, though. I thought the",
            "start": 4858.0
        },
        {
            "text": "We want the other guy. I don't know if you can catch him. Well, the other guy's electric. We already have dude. We got the dude. Yeah, we got duty to call. Oh, no. That's cool, though. I thought the other guy was or ice. I don't know. No, you're not allowed to talk to that one. Really? Yeah, you're not allowed to talk to that one. That's a story thing. Yeah, it's a whole thing. Uh, how close are we? Well, you know, you missed out. You missed out on a lot. Did you catch him? I mean, did you attempt to We're going to catch him now. We're going to catch him now. It's a whole thing. It's a It was a delicate dance. Have we seen him? No. No. Now we're only getting the the water guy. Now, this [ __ ] water guy. You know what? We catch the water guy. We move on. We got a cat. He's the electric guy. We got a cat. We got the We got the electric guy. You caught one? No, we have not caught one yet, Kevin. I'm confused there. It's okay. We're We're ground zero. You missed absolutely nothing. We're",
            "start": 4907.52
        },
        {
            "text": "We got a cat. We got the We got the electric guy. You caught one? No, we have not caught one yet, Kevin. I'm confused there. It's okay. We're We're ground zero. You missed absolutely nothing. We're going to catch this thing. If this [ __ ] doesn't go to the other side of the map, dude, what the [ __ ] This guy doesn't go to the other side of the map. I'm submitting Kito over killing this other one. Oh my god, that was that [ __ ] was so funny. Also, why do we why are we changing? Uh, it's a whole thing. It's a whole nightmare thing. No, we're going to master ball him. You can't be too high of a level with the whole thing. It's a legendary dog, but it's afraid to fight us. It was a whole thing. Yeah. So, we're just going to master ball. We've changed plans to 1.0, but now we need to use someone that's under or around higher than the level of the Pokemon in the grass. We can use repel. Otherwise, we keep having to run from these level 16s. Yeah. Mike [ __ ] Mike made the gobat too",
            "start": 4946.96
        },
        {
            "text": "someone that's under or around higher than the level of the Pokemon in the grass. We can use repel. Otherwise, we keep having to run from these level 16s. Yeah. Mike [ __ ] Mike made the gobat too strong. [ __ ] the whole planet up. That's not true. Exactly what happened. I mean, I did want that gold bat way too strong. I mean, now the Goldbat will never fight. Ah, that's some nice. If this [ __ ] doesn't go away, dude, get I'm just going to get out of the town. Just Why don't you fight him just for fun? It doesn't work like that. What do you mean? The whole thing. It's a whole thing. What we're going to do here is a whole thing. It's a whole thing. I would love for you to just explain. So, here's the deal, Kevin. We're going to use a max repel, but max repel will only repel the smaller baby Pokemon away and entice the larger Pokemon to come fight us. If you go over a certain level, it will repel away the big Pokemon as well. So, that's what we've done here. And so, we're just we're",
            "start": 4991.28
        },
        {
            "text": "baby Pokemon away and entice the larger Pokemon to come fight us. If you go over a certain level, it will repel away the big Pokemon as well. So, that's what we've done here. And so, we're just we're just drawing them out. We're just drawing them out. He's getting real comfortable on that southeast. He really is. Maybe we just need to go. Oh, here he comes. Here he comes. Okay, he's coming toward us. He thought he was just going to fly over there. No, you can't do that. I can't tell if you [ __ ] with me or not. Okay, that's 100% fantastic. Oh, he's right there. Here he comes. Like watching an animal at the zoo. They're coming over to the glass. All right, he's here. Okay. Did you get cut? You're done with questions for us. You're done. You're done with questions for the rest of the day. You're done with questions for the rest of the day. I can't catch you up on the last 30 minutes. You're done. You're not You're allowed to ask one more question for the rest of the day. Broken. It was",
            "start": 5039.36
        },
        {
            "text": "done with questions for the rest of the day. I can't catch you up on the last 30 minutes. You're done. You're not You're allowed to ask one more question for the rest of the day. Broken. It was a whole thing. It was a whole thing. Did you get cut? I don't know why he's laughing cuz it's the the not the right guy. He's not the right guy. Different guy. He's part of the story. You're not allowed to talk. We can't get that one. That one doesn't move. That's three. Get the [ __ ] out. No, it's part of the story. Kevin, it doesn't move. No more questions. No more quests. It doesn't move. No more quests. Where the [ __ ] is this Pokemon? [Music] Why is it on the floor? It's a great question. Seems like Chris lied to us. Where's the echo coming from? Oh, so the screen it was just pause still with me here. Now we're here. I wonder if he's I mean the question is is he in the other patch? Is he going to be in the other patch for me? He's got to be in the other [Music] patch. God, I have I have",
            "start": 5094.48
        },
        {
            "text": "me here. Now we're here. I wonder if he's I mean the question is is he in the other patch? Is he going to be in the other patch for me? He's got to be in the other [Music] patch. God, I have I have questions. This is so hard. Here it comes. Come [Music] on, Chad. You answer my questions. You know what they are. [Music] That's the look Mike gives me. Like, how much longer do you want to waste people's time? I mean, if it doesn't work, I tell you what, they wasted our time. They told us They wasted our time. Don't Don't you put that on us. They wasted our time. Is this [ __ ] thing near me? It's still near me. Not all the dogs are just like sprites that you can see. So the three dogs become two dogs because one of the dogs is due to the story. So it now becomes two dogs. We can't catch that until we hit that story prompt. So that one's out. That's the one I need cut for. So we no longer have to worry about can't see that guy. We're good. So now we go after these other two dogs. And the",
            "start": 5158.64
        },
        {
            "text": "until we hit that story prompt. So that one's out. That's the one I need cut for. So we no longer have to worry about can't see that guy. We're good. So now we go after these other two dogs. And the best place to do that is right here because you can prompt the dog to move. Every time you go into and out of the city, it moves. So, we have to span that entrance and it's in this. It's in this grass, but it's not popping up. Yes. I'm going to stare at Kevin if we ask another question. Do you have any more questions? Questions. I mean, yeah. So, it's just the one dog that we see. We see we see both dogs. We see both dogs. We don't want the other dog. We want the other dog. That one right there is the is a electric dog, right? Yeah. We don't want that. We don't want that one. We want the fire dog. And the fire dog's on top of us right now. And we're going to master ball him. We're not actually We're going to master ball him. We're done with trying to mean look him. We're just going to He",
            "start": 5245.84
        },
        {
            "text": "dog. And the fire dog's on top of us right now. And we're going to master ball him. We're not actually We're going to master ball him. We're done with trying to mean look him. We're just going to He All we have to do is exist in this grass until it pops up. But it's not popping up. It's not popping up. Jim Ler says, \"I think we should stop using repels.\" Yeah. People can see cuz I do think we're repelling this thing. Well, now we're about to take [ __ ] We're about to see what our [ __ ] sky armor can do. Get out there. [Music] Oh, his name is Om, huh? I'm just going to keep my lowest guy out here for the next half of the Pokemon. I thought of a new idea. Yeah, we figure out to set it up cuz you know Twitch has had Twitch plays Pokémon. We have the kind of funny best friends play Pokémon. Then the chat just guides it and we can judge their decisions. Perfect. And see if the chat can ever come together on one. I love that. I love that about that. I mean, look. Yeah. I'll stop using",
            "start": 5286.24
        },
        {
            "text": "Then the chat just guides it and we can judge their decisions. Perfect. And see if the chat can ever come together on one. I love that. I love that about that. I mean, look. Yeah. I'll stop using your pels. I'll automatic. Use repels. I just thought you could see these dogs. You can't. No, you cannot see them like uh out in the water. No, they have to pop out. They're that one dog because you could see it was a story mission. You have to go over there and find it. You're going to It's always going to be there. These dogs roam around the map and they jump out at you. I've encountered this dog like three times. Just randomly trying to get away from it. I just ran I clash right into it. But of course, now you want them. Yeah. Just like sex. Whenever you want it, you can't get it. Can't get it. God, it's the worst. But then when I don't want it, I get it and I don't want it. What level is this uh armory? Like 27. Yeah, it doesn't matter. I'm just going to throw a ball at this thing as",
            "start": 5341.44
        },
        {
            "text": "it. God, it's the worst. But then when I don't want it, I get it and I don't want it. What level is this uh armory? Like 27. Yeah, it doesn't matter. I'm just going to throw a ball at this thing as soon as it pops out. I'm not doing I'm not [ __ ] around with this. I just needed something high enough that it could repel the grass, but but not so high that it would that it would uh repel the dog as well. You don't want it. A mic. You know what I mean? Reset the route, guys. What does that mean? Uh, it means go up here and reset it. I think we just leave this route. Let's go anywhere but here. Okay. But I'm not going to the radicate route. Yeah. Anywhere. Anywhere that's not this one. Let's go anywhere else. Level 15 Radicate. You got a level 27. Let the dogs out. Let's see where he is now. Down there. He's such an [ __ ] This route, too. This route sucks. Were those the only two grass patches in that route? Yep. Yeah, cuz if you go one little bit lower, it is like route 38. It prompts",
            "start": 5391.68
        },
        {
            "text": "Down there. He's such an [ __ ] This route, too. This route sucks. Were those the only two grass patches in that route? Yep. Yeah, cuz if you go one little bit lower, it is like route 38. It prompts the next one. I mean, it seems like a good spot to be showing a kiss. Now you're thinking next Pokemon. Yeah. Us four versus the chat. Two Pokemon games running at the same time. The chat has to come together and be able to beat Pokemon. Us four in the room. There's no way the never going to be able to do it. And we'll beat the We'll beat you fast. The three of us can't decide what to do. We're in the [ __ ] room. We will beat you faster for sure. Now chat, we're making content. Jonakus, that's a great idea. Kevin, that's your next project. figure out how you get the chat to control Pokemon. I'm still working on my last problem. I'm trying to figure out a subtr. All right. Damn it. The other one. What if we just say [ __ ] just catch him? The issue is fight him. Hit him. Let's see what",
            "start": 5447.16
        },
        {
            "text": "I'm still working on my last problem. I'm trying to figure out a subtr. All right. Damn it. The other one. What if we just say [ __ ] just catch him? The issue is fight him. Hit him. Let's see what happens. Yeah, we don't have him. Don't have the big boy. If this [ __ ] pops up, like if you put on a repel and all of a sudden we walk down there and that one pops up. Throw a propeller. We throw the controllers at the top. I mean, he's not going to do anything. He'll just pop up and run. Oh, yeah. Of course. He'll run away. Yeah. Yeah. The route right outside New Barktown would be quicker. I mean, we could try that. Yeah. Let's go over there. Broken subtime. returns on Friday. I don't like that map should also show you where they're I agree. Fly map. Yeah. Why is that? What What map does he have that you don't have that you're not You know what I mean? Give him the map. Give him the map. The [ __ ] are we doing? The dogs broke us. It's amazing. Now you check the map again. Well, I got to",
            "start": 5506.4
        },
        {
            "text": "that you don't have that you're not You know what I mean? Give him the map. Give him the map. The [ __ ] are we doing? The dogs broke us. It's amazing. Now you check the map again. Well, I got to go outside of it. There we go. So, this is what I was talking about here. All right. Okay. Now we work. Now we work. We just go back and forth. Boom. He's coming. He's coming. He's coming to that southeast side. Horny for me. He's He wants [Music] it. What is this music? God damn it. He's back where we wanted him to be. God damn it. He's over there. This little [ __ ] This is the fight of our life, guys. This is the fight of our life. I mean, now he's dodging me. Now he's just playing around. Yeah, we we could have just We could have beat the game by now. Ah, [ __ ] The other one's over here. Well, I mean, you're going to move in a sec. He's not going to get you in the wilderness. [Music] He's such a prick. They got some music going on on this one, man. [Music] He's not even coming down here.",
            "start": 5575.84
        },
        {
            "text": "I mean, you're going to move in a sec. He's not going to get you in the wilderness. [Music] He's such a prick. They got some music going on on this one, man. [Music] He's not even coming down here. No, he doesn't like me. Did he like come down here? He was hanging out here. He was living down here at one point. A cat. He was strolling into our mom's house just [ __ ] eating some milk. He's a dog. It might be cats. They might be cats. Definitely a dog. We thought they were dogs. I think they're cats. But it's definitely dogs. Are they dogs? Legendary dogs. Okay. Okay. There we go. He's here, baby. He's here. Anukica, right? Here we go. Lot of patches of grass here. This is it. This is it. It's the same music. So, we're not repelling this. Uh, we can, but people said stop repelling, but we could try. I think we try not repelling. Okay, let's have 10 encounters and then we're Here it is. Yeah. This is him. [ __ ] you, dude. [ __ ] you, dude. [ __ ] fight him. Fight him, Nick. Yo, I'll",
            "start": 5631.92
        },
        {
            "text": "could try. I think we try not repelling. Okay, let's have 10 encounters and then we're Here it is. Yeah. This is him. [ __ ] you, dude. [ __ ] you, dude. [ __ ] fight him. Fight him, Nick. Yo, I'll fight him with my level 27. This is for you, Chris Hanka, because you always believed in us and you never criticized us. Never thought bad about us. We had it the whole time. Ladies and gentlemen, this is for you. We love you very much out there. Thank you for all of your support. Chris Ank, I don't have me. Look, master ball. Yeah, that Pokemon's too strong. Taking it to the [ __ ] streets. Get in my bag. Get in my bag, Chris Anka. Now we're ready. Give me a number, Mike. Now that's pod racing. Oh my god. What is it? The number. Yes. from the random number generator out of 382 is [Music] 249. What's that name, Kevin? 249 Cuz Offman Aldo has got the honor to name this legendary dog. The Cuz after all the stress and the pain worth it. It was all worth it. Cous is back. How do we spell cous?",
            "start": 5695.68
        },
        {
            "text": "What's that name, Kevin? 249 Cuz Offman Aldo has got the honor to name this legendary dog. The Cuz after all the stress and the pain worth it. It was all worth it. Cous is back. How do we spell cous? K u z. The cous is back. But this is cous 3. Okay. What do we call? What's the third? What's the third? Cuz third gear. Revenge of the cous. Tokyo drift. Revenge of the goodness, right? It's too long. Oh, cous three. Johotto drift. I think we just go, man. Who's with three? With three Z's is great. Yeah. There you go. Who's All right. Are we changing prime time? Yeah, prime time is out. Who's lives, baby? All right. That's crazy. God damn it. This Radicate is going to kill me. Nick, I want to I want to tell you I'm very impressed that you recognize the music and we're like, \"This is it. It's happening.\" That's crazy. That's crazy. Did you recognize that music? That was grown so much as a gamer. That was sick. Well, if they spam it in the chat enough times, it sinks in. You really It",
            "start": 5765.4
        },
        {
            "text": "It's happening.\" That's crazy. That's crazy. Did you recognize that music? That was grown so much as a gamer. That was sick. Well, if they spam it in the chat enough times, it sinks in. You really It really does sink in. All right, Mike. So, let's take a look at our squad. Yeah. Let's go back to Golden Rock. Take us back home. Let's go back home. Let's go back to Golden Rock City. I'm not going to the [ __ ] mall. All right. I love it. I I love it. This is our city. This is our city. We're golden boys. We rep this town. We repen boys, baby. All right, so let's let's get the squad together. Wait, hold on. In the chat, Sage Shinagami says the Cuz with the E as a three is perfect. Yeah, it's pretty good, too. It's pretty good, too. You go change his name real. No, I like Cuz with You're absolutely never changing it. I'm never changing that again. I' I've spent so much time thinking about this [ __ ] thing. I never Oh, look how big he is, though. All right. So, do we put him in for",
            "start": 5837.92
        },
        {
            "text": "absolutely never changing it. I'm never changing that again. I' I've spent so much time thinking about this [ __ ] thing. I never Oh, look how big he is, though. All right. So, do we put him in for Ninetailes? Yep. Yeah, he's our fire. Okay, cool. And now, who do we switch this guy back to? Uh, I think we need to switch. Nope. [ __ ] I'm [ __ ] prime [Music] time. Prime time. Okay, Prime Time's going into our Yeah, he's going into our B squad. Let's go over to the B squad. And we want to Who do we have? Who do we Who we miss? Not Nick is who we're missing. We want it no. Wait up a sec. No, we're missing one. Yeah, not Nick. Yeah, it is not Nick. Okay. Is it not Nick? Is it not Nick and not Nick? Where the [ __ ] do we put not Nick? Probably Nick right there. Yeah. So, we had the whole Gat. I mean, we could put Gobbat just in as a free killer. Freak Gold might be able to win the game for Go 55. Just murderer, poison, flying type. Oh man, that was What type was it? Murder. That was a",
            "start": 5888.8
        },
        {
            "text": "I mean, we could put Gobbat just in as a free killer. Freak Gold might be able to win the game for Go 55. Just murderer, poison, flying type. Oh man, that was What type was it? Murder. That was a battle. All right, now look up this [ __ ] Pokemon's moves. Yeah. Is it even worth it? Yeah, cuz [ __ ] At least Prime Time had fire moves and was ready to rock. Well, Prime Time had some really good [ __ ] So, let's take a look. This thing now needs to have some good. He is so cute. He's the baddest. If he doesn't have flamethrower, we got a problem. It's got fire spin and flamethrower. Hey, Also stomp we can get rid of now. So is there something we can give him instead of the roar and stomp? The fo is scorch. So flamethrower we [Music] love. Um we can check prime times [Music] items. Eric Cooper is mean Cooper coming after you. TM. What did he say? We have flame. He said, \"Well, you already have an electric type, so you don't need goldbat.\" [ __ ] you. That was amazing. Do we need a poison",
            "start": 5944.92
        },
        {
            "text": "is mean Cooper coming after you. TM. What did he say? We have flame. He said, \"Well, you already have an electric type, so you don't need goldbat.\" [ __ ] you. That was amazing. Do we need a poison type though? Now we got to Now we have the question of like, who are we trying to Well, now you're getting really deep in this. I mean, the squad right here is is pretty good. Cuz is very low level, though, comparatively speaking. Do we need to give him I mean, we can hand him some candy. We need to hand him candy. Let's get We can hand the C some candy. I say we hand the cousuck. I can't have him feeling underpowered compared to the rest of the team. Not the coups. Give me that. Uh, at 50 he learns fire fang. The hell is fire fang? It's a It's another move. I don't know. 65 and 95. Lava plume at uh 57, 80 and 100. I was listening to that. Soothing belt. You know what? Cal has a good call. It says just drop Nick dick and put the gold bat in there. You juiced him up. [ __ ] it. No. 45 max.",
            "start": 6005.08
        },
        {
            "text": "at uh 57, 80 and 100. I was listening to that. Soothing belt. You know what? Cal has a good call. It says just drop Nick dick and put the gold bat in there. You juiced him up. [ __ ] it. No. 45 max. He's a freak. I don't disagree with the 45 max. Fire blast at 71. God damn [Music] it. 120 power, 85 accuracy. Let's go. Where the [ __ ] Why are these boxes not the right boxes? What are you looking for? I want the boxes with the rest of my Pokemon in there. But why me? I'm just confused when I go to move items. Okay, they are. Yeah, he didn't have any. Okay, good. What does the gold bat have? Uh, he's got the suit bell, but it's fine. Uh, I don't really need to. I could, I guess. It's kind of a why not situation. Well, because I might put him in my party. [ __ ] the gold bat. Yeah. Yeah, we're fine. [Music] All right. Are you leveling this guy up? 100%. We're about to win this game right now. What time is it? 43. You get swept. It's already 45. Oh, 2:42. We're not winning. [ __ ] We got",
            "start": 6061.04
        },
        {
            "text": "fine. [Music] All right. Are you leveling this guy up? 100%. We're about to win this game right now. What time is it? 43. You get swept. It's already 45. Oh, 2:42. We're not winning. [ __ ] We got to go in 15 minutes. We're going to have a really great meeting today with Mike, Nick, Roger, and Kevin. I mean, yeah. What's the point of All right, everybody. Come on down with this team meeting real quick. Y'all like how Nick, can you run that meeting? Yeah. For the four of us, we'll just go to Starbucks. We all fit in one car. This company's falling apart. Are we actually doing the meeting though? Yeah, we Oh, yeah. We're doing the meeting. Yeah, we got to do we talk about tomorrow. Talk about tomorrow. Yeah, talk about tomorrow. We got to talk about Friday. What happens if I fall down? Twist ankle. Who do we call? Call me, bro. I come in. Who do we call? I twist an cancel the stream. You call me. I come in. You start walking with a crutch. Yeah. Every crutch walk is five steps. Bring",
            "start": 6117.44
        },
        {
            "text": "ankle. Who do we call? Call me, bro. I come in. Who do we call? I twist an cancel the stream. You call me. I come in. You start walking with a crutch. Yeah. Every crutch walk is five steps. Bring the crutches. What did he learn? He learned something. What's he want to learn? Swagger. Swagger. Okay, we're not doing that. AJ instead of roar. Yeah, that's what I was going to say. It's just a cooler word. Well, roar does something. What does swagger do? You [ __ ] swagger then. Well, let's take a look. Let's take a look. Everyone, let's relax. [Music] Roar. The foe is scared off to be replaced by another Pokemon in its party. Swagger. The user enrages the foe into confusion. However, it also sharply raises the fo's attack. That seems [ __ ] dumb. All right, 15 minutes. I think we knocking four or [Music] 15. Especially if we know what Pokemon to put in the first slot. Come on, Mike. [Music] Mike, you have until I level this thing up. For what? What do you want to do? I mean, this this is",
            "start": 6165.36
        },
        {
            "text": "or [Music] 15. Especially if we know what Pokemon to put in the first slot. Come on, Mike. [Music] Mike, you have until I level this thing up. For what? What do you want to do? I mean, this this is the end. We'll come back for the Elite 4 next time. We have to Okay. I mean un I mean it is technically just the four of us. We can tell Roger 3:30 and we can finish this. Well, the meeting is at 3:30. Oh, is Kevin. When's the meeting? 3:30. 3:30. We just usually stop by 3:15 so we can have a break before that. But the meeting is not till 3:30. Oh, then let's [ __ ] grip it and rip it. No. How big How big does my big boy need to be here? I mean, okay, if we're getting into that. Okay, let's get into it. Who we putting up? Let's start. Let's all get into it and get real here. I set I set the goal at 45 to the meeting during the Elite 4. Chris says it's another stream at least. Okay, then let's end it here. Yeah. Yeah. I would like Andy in the room for the Elite 4 as well. Oh, yeah. He left.",
            "start": 6215.92
        },
        {
            "text": "at 45 to the meeting during the Elite 4. Chris says it's another stream at least. Okay, then let's end it here. Yeah. Yeah. I would like Andy in the room for the Elite 4 as well. Oh, yeah. He left. No, he's never coming back. He promised he was going to be here for Mike's birthday. He did. We didn't even come in the room. I know. We didn't He literally We did have a whole meeting door. And he didn't even step into the room like a vampire. He had just stayed. Oh, I got to do some things for a cool review thing. And it's true. That thing's going to get more views. We'll [ __ ] You know, we did have we get more views if you were here, Andy, our [ __ ] star quarterback. I don't think so. Sitting the game out. We got to be realistic with POS. Well, let's say goodbye then. Whoa, you're bunch of cowards. Chat, what a good time. I don't I I blacked out during a lot of the stream. I think we only caught one Pokemon today. We did, but it was a big Look at him. It was a lot. Oh, he's jumping. We",
            "start": 6271.12
        },
        {
            "text": "cowards. Chat, what a good time. I don't I I blacked out during a lot of the stream. I think we only caught one Pokemon today. We did, but it was a big Look at him. It was a lot. Oh, he's jumping. We worked really hard to get to this point. I think we jack all these guys up to level 50 and [ __ ] run this thing. If you jack if you jack them to 50, you will run this thing. Like, you will run this thing. And I like that. Chad, thank you so much for a great afternoon stream. We'll catch you back here tomorrow for more streaming fun and of course more kind of funny content. Thank you all so much for tuning in, having a good time. We'll see you back here for another stream. Chris decide. [Music]",
            "start": 6314.0
        }
    ]
}