{
    "id": 14166,
    "video_id": "G2LCuqrmWEE",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Stephen Totilo"
    ],
    "title": "Fan's are Split on Elden Ring Nightreign",
    "description": "KFGD: https://www.youtube.com/watch?v=sFVT8cqtjug&pp=0gcJCbAJAYcqIYzv\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1748645339,
    "duration": 713,
    "transcript_chunks": [
        {
            "text": "with story number three. It's a rock Block of Elden Ring news. Stephen, are you a Night Rain person? No. Good. Me neither, so it's fine. Don't worry. We're in good company. We can report the news and get the hell out of here. Of course, it's officially out today for everyone. You can go get it. You can do the dang thing. Uh, but IGN reports over there from Wesley Yinpool. That's right. WP at IGN. Uh, Elden Ring Night Rings Night Rain sells 2 million units on its first day. Elden Ring Night Reign sold 2 million copies on its first day. Quote, \"Pre-orders and early sales have pushed the game beyond the incredible 2 million unit sales uh milestone.\" Publisher Bandai Namco announced the multiplayer co-op spin-off released overnight and soon shot up the Steam Most Played chart with an impressive 313,593 peak concurrent users. That doesn't tell the whole story, of course, with both Microsoft and Sony withholding Xbox and PlayStation player numbers. But From Software has now given an idea of",
            "start": 0.4
        },
        {
            "text": "313,593 peak concurrent users. That doesn't tell the whole story, of course, with both Microsoft and Sony withholding Xbox and PlayStation player numbers. But From Software has now given an idea of just how big Elder Ring Night Reign is with the announcement of 2 million copies sold already. But it's not all great news. In a separate IGN article, they had this one paragraph. Uh but it also came with a number of negative reviews. 67% of the reviews are positive so far. Uh most of which point out uh so that was in parenthesis. So it also came with a bunch of negative reviews. Most of which point out that Elder Ring's uh Night Ring lacks duos or two-player co-op and voice chat. So, they're just being whiny babies as always. Stephen, I I just pulled up the press release. I just want to I want to share this because it's amusing. If I may, please. Of course. This is what Bandai Namco said. They said, \"Elder Ring Night Re, the standalone multiplayer co-op action survival game by From",
            "start": 47.88
        },
        {
            "text": "I want to share this because it's amusing. If I may, please. Of course. This is what Bandai Namco said. They said, \"Elder Ring Night Re, the standalone multiplayer co-op action survival game by From Software, Inc. and publisher Band Namco Entertainment Inc. is now available to players having already surpassed the milestone of 2 million units.\" Having already surpassed the milestone of 2 million units. Notice notice they're not using there. sold. They didn't say sold. Like what? And yet I don't think this game is on any subscription service. So I don't know why they're avoiding using that word. But it's interesting they're not using that word. I mean they copy. Yeah, you're right. I guess they would have shipped more than 2 million. Pass the milestone of 2 million units. I don't know. It's just a weird way that companies game companies talk. They want to do everything they can to avoid just telling you. They don't want to give you an actual fact. They don't want to give you a hard",
            "start": 89.76
        },
        {
            "text": "It's just a weird way that companies game companies talk. They want to do everything they can to avoid just telling you. They don't want to give you an actual fact. They don't want to give you a hard fact. They want to give you a little bit. This is what's happening over there. What's happened over there? We surpassed it. We surpassed 2 million units. Maybe people looked at the box art two million times. Uh yeah, interesting one on that one. Uh to say the least. Good numbers, obviously. Uh of course, review bombing. I'm so over review bombing. You're not doing it anymore. You retired from review bombing. It didn't do anything I wanted it to do, it turns out. So, I was like, ah, I don't got time for this. It's just like, come on, do your thing. Uh let's move on to another Elden Ring night story. Uh Elden Ring Night Reigns next patch will improve the experience of playing alone. This is uh Thomas over at GameSpot. Bandai, Namco Entertainment, and From Software have just released Elden",
            "start": 129.12
        },
        {
            "text": "story. Uh Elden Ring Night Reigns next patch will improve the experience of playing alone. This is uh Thomas over at GameSpot. Bandai, Namco Entertainment, and From Software have just released Elden Ring Night and are already teasing its first post-launch update. Patch 1.02 is scheduled to release sometime next week and will improve the solo experience of playing this co-op game. Quote, \"Next week, patch 1.02 will be released and will include several bug fixes as well as improvements for solo expeditions. is the official Elden Ring account on X explained. While the full patch notes won't be released until next week, the account did tease some important updates coming to solo expeditions in Night Rain. After patch 1.02, solo players will be able to revive themselves once, I'm sorry, once per night boss battle, and gain more runes, form of in-game currency while playing. This has been uh a ongoing conversation here at Kind of Funny. Of course, Roger uh was one of the folks who picked up",
            "start": 169.6
        },
        {
            "text": "night boss battle, and gain more runes, form of in-game currency while playing. This has been uh a ongoing conversation here at Kind of Funny. Of course, Roger uh was one of the folks who picked up Night Rain during the review period, but he kept trying to jump in and play it solo, and he disliked it so much he's like, I'm just going to stop. So, I'm glad to see they're trying to fix that. I guess it's this is the second straight Elden Ring related release where so quickly after release, what seemed to be the prime design element about it seems to now be getting walked back a little bit through almost immediate patches, right? Um, Elden Ring was uncompromising as were from Software's prior games. Pardon me if I'm ignorant of a rapid kind of course correction patches, but I it does not ring a bell. By contrast, Shadow of the Tree comes out, reviewers are are are crushed by its difficulty, and very quickly you have From saying, \"Oh, okay, we'll make it easier.\" And now you have a game",
            "start": 214.76
        },
        {
            "text": "a bell. By contrast, Shadow of the Tree comes out, reviewers are are are crushed by its difficulty, and very quickly you have From saying, \"Oh, okay, we'll make it easier.\" And now you have a game that is ostensibly a co-op game. It's how it's been promoted. It's how it's been designed. Reviewers have noted this game is very difficult to play solo and you have almost, you know, this is ready to go for the next week patch or at least small elements that will make it easier for solo players. You know, there's been a kind of a meta discussion around game difficulty and from software has been at the forefront of that discussion about developers vision versus player demands and requests and desires and where should the two meet and how uncompromising should either side be. uh from formerly the the the exemplar of don't change it, make people kind of meet you where where they are now is becoming the exemplar of change it and and and meet the customer demand it seems. Which is good. And I",
            "start": 265.44
        },
        {
            "text": "the the exemplar of don't change it, make people kind of meet you where where they are now is becoming the exemplar of change it and and and meet the customer demand it seems. Which is good. And I think again launching an online game, a multiplayer game is such a different beast than a giant single player open world, which I know there was a little bit of co-op, but you know what I mean in terms of like you need to be Johnny on the spot with patches, updates, this that and the other tuning it. Yeah. Yeah. Yeah. Yeah. Yeah. Um, and you got Marathon coming. You got to be ready. Oh man, Marathon is going to swing in here and just be a huge success. I'm sure it's not going to be another colossal PlayStation failure. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, mood.com has created an entire line of functional gummies that target specific health",
            "start": 309.44
        },
        {
            "text": "company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and am loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industryleading 100day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first",
            "start": 351.28
        },
        {
            "text": "their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com promo code kind of funny for 20% off. Uh, and moving on to another Elder Ring Night Reign one for you. Uh, this is actually I'm I lied. It's an Elder Ring movie one. Uh, it could reportedly star a Warframe actor. This is Justin Croll over at Deadline. The highly anticipated Elder Ring movie movie at A24 in video game company Bandai Namco Entertainment is gaining momentum as director Alex Garland may be zeroing in on a familiar face to lead the epic adaptation. While it is unknown where things stand in negotiations or if a formal offer has been offered, sources tell Deadline that the director has talks with Kit Connor, who recently appeared in his war pick Warframe to star in the adaptation. Sources stress several factors still need to be worked out, including",
            "start": 400.48
        },
        {
            "text": "Deadline that the director has talks with Kit Connor, who recently appeared in his war pick Warframe to star in the adaptation. Sources stress several factors still need to be worked out, including scheduling, but both Garlin and Connor want this to happen. It is Warfare. Thank you. Demon Hacker said it's Warfare, not Warframe. He made a movie about Warframe already. Here's what's so funny is like when I read it I was like oh the headline on GameSpot was warfare but I read Warframe and I was like I never knew they made a Warframe movie or you or that Hollywood or that Hollywood stole the name Warframe and now you're telling me it was a war picture called Warfare and I've never heard of this mo motion picture in my life. Never. But I'm not a big movie guy but I don't know what's going on. Yeah. Yeah. We're we're we're we're hauntingly similar people um in that regard. I gotta say, I mean, I I I guess I'm just a hater in this episode and unimpressed with so much of the the news that's",
            "start": 445.2
        },
        {
            "text": "Yeah. Yeah. We're we're we're we're hauntingly similar people um in that regard. I gotta say, I mean, I I I guess I'm just a hater in this episode and unimpressed with so much of the the news that's being shared. Uh I'm weird and that I do not get excited about the games that I like being turned into movies. Like, okay, I'm going to still play the game. I don't But you I mean, you love Zelda. I'm not I'm not I'm not psyched for the Zelda movie. It's like it's a game. I want play it as a game. So, I don't know. But again, that's that's I probably lost the entire audience. Did you What about Last of Us? You care about that? Is that working for you? No. Okay. No. I mean I mean look, The Godfather's a great movie and and it's like hypocritical to say because like uh for me to make this position because it would suggest that I think it should have just stayed a novel, right? It never become a movie. But overall like people are like kind of lose it when it's like it's almost like a status",
            "start": 491.84
        },
        {
            "text": "because it would suggest that I think it should have just stayed a novel, right? It never become a movie. But overall like people are like kind of lose it when it's like it's almost like a status symbol like oh this thing has made it. And so I always feel like there's this kind of a baked in inferiority complex that like oh game this game wasn't good enough or major enough until it became a movie or it became something else. It's it's awesome as a game. I like getting into new audiences I guess. I like seeing, you know, I mean, in a world where so many things are being snuffed out because it didn't make make enough money for the shareholders. The idea that yeah, we're getting more people into it and you're seeing it like I hate the idea of a trans media property, but like the idea that you can expand it beyond the art group. I'm like, okay, cool. Like whatever. Hey, look, we praise transferring. We've played praised now trans media. This is a trans positive uh show overall. I hope so.",
            "start": 533.6
        },
        {
            "text": "can expand it beyond the art group. I'm like, okay, cool. Like whatever. Hey, look, we praise transferring. We've played praised now trans media. This is a trans positive uh show overall. I hope so. It is. It is. Oh, no. Overall, we are transositive. Don't worry about that. Uh, Demon Hacker agrees with you with the super chat. Elden Ring has a promising crew as a movie, but I agree. Not excited. Don't need a Don't need a movie version of this. I'm still interested to see what they do with it. Like, obviously people creating movies are a lot more creative than me, so I'll be interested to see, but I just like I don't want you to fight. Have you seen some some movies are not created by people more creative than you, Greg? Sure. Thank I appreciate that. Uh, but we're just fighting. We're just What's the narrative of this? What's this? What's this dude? These games are so weird about their stories. How you going to put that in there? I don't know. I mean, like, should it be a movie where",
            "start": 566.16
        },
        {
            "text": "What's the narrative of this? What's this? What's this dude? These games are so weird about their stories. How you going to put that in there? I don't know. I mean, like, should it be a movie where like people who watch the the first like run of the movie can put messages into the movie for the people who go see it the next day? Be cool. Jump here. Uh, and a final Elder Ring rock story for you is just the stupid fun one. Uh, this comes from Eric Van Allen at IGN. Some Elden Ring Night Reers are fighting their muscle memory from the original Elder Ring controls and chugging flasks by mistake. Elden Ring Night Reign is out and players are already diving into the shifting lands to fight the Night Lord. If they warmed up a bit on the original Elden Ring though, they might be finding themselves a little turned around by some control changes. While the controls in Elden Ring Night Reign are mostly the same as the original Elden Ring, a few changes have been made, either to accommodate new",
            "start": 603.84
        },
        {
            "text": "a little turned around by some control changes. While the controls in Elden Ring Night Reign are mostly the same as the original Elden Ring, a few changes have been made, either to accommodate new abilities or simply move things around a bit. Some of these are just for new moves or updated versions of old tools. One in particular, though, seems to be causing at least a little confusion, the flask. And from software's Souls games and Elden Ring, the flask is a mainstay of your kit. A refillable potion holder that acts as your main source of healing in combat. Usually, the flask is one of several consumables, and you'd cycle through them and use them mid combat. In Elden Ring Night Reign, the fl the flask is a static element. Uh, you hit the leftmost face button, X or square, depending on your controller, drink it by default, while up on the D-pad becomes your use item option. And so, everyone right now is confused apparently. And there's a million things they had in this IGN article of",
            "start": 643.28
        },
        {
            "text": "controller, drink it by default, while up on the D-pad becomes your use item option. And so, everyone right now is confused apparently. And there's a million things they had in this IGN article of people accidentally drinking flasks. And I thought that was very funny. I like that. Yeah. Eric Van Allen's a terrific reporter as well. Um for Kotaka once he did a whole story about how somebody had duct taped themselves to a ceiling. It's like a famous photo from like a Counter-Strike land party. I remember that one. He found the guy who was duct taped to the ceiling. Like I remember stuff. Good stuff.",
            "start": 683.28
        }
    ]
}