{
    "id": 14130,
    "video_id": "iZHxrEmHYuA",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "What Will Consoles Look Like in 10 Years?",
    "description": "From our Gamescast: https://www.youtube.com/watch?v=c9z9q1Ryy30&t=43s Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1748040864,
    "duration": 1598,
    "transcript_chunks": [
        {
            "text": "So, let's dive into some of these bullet points then, right? I have a whole section here called the big three. I want to know because this is something we asked 10 years ago. What consoles will there be? Oh, yeah. 10 years makes it tough. Um, there will be a Nintendo and there will be a PlayStation. There will also be an Xbox. Yeah. Yeah. Will there be a new entry? Will someone else step in? Does it always have to be the big three? We were so hung up last time with Amazon and Activision. Are they going to enter the console market? I think now it's China, right? I think now it's it's looking at the 10 cents and and and those those type of groups. And I don't think so. I think that uh we are at a point already that it is more ecosystem digital based, app based, um storefrontbased, but I think I think all three of the big three currently will still have consoles out in 10 years, new consoles. You know, the rumor was right that Xbox's next thing could dual boot. That was one of the rumors",
            "start": 0.24
        },
        {
            "text": "I think all three of the big three currently will still have consoles out in 10 years, new consoles. You know, the rumor was right that Xbox's next thing could dual boot. That was one of the rumors Paris was talking about. We've seen them around the, you know, scuttlebutt. Do you think you see PlayStation do that as well? Like I I, you know, I have the same questions we have here and I think at the top level we can all answer. I'm like, will PlayStation exist? Will Xbox exist? Will Nintendo exist? I think yes across the board, right? Yeah. I think they could and probably will look dramatically different in the same way if we were to dial back 10 years ago what you're talking about. Xbox does not look like Xbox then, right? Even PlayStation to a degree, but it also looks the most reminiscent. Nintendo's gone through such a shift because of the success of Switch and where they're at. Um, but I do wonder about the boxes and what that is and who one of the questions I had here that I I",
            "start": 47.56
        },
        {
            "text": "Nintendo's gone through such a shift because of the success of Switch and where they're at. Um, but I do wonder about the boxes and what that is and who one of the questions I had here that I I I'd like your opinions on to piggyback off this, right? What does success look like for first parties in 2035? I think it continues to look different for each of them. Yeah, I feel like that it's a trend that really started I mean debatably Nintendo started it with the the Wii when it decided to be completely underpowered. Like that was a choice strategically. Um but I think that this generation that we're currently in of the Xbox Series X, PlayStation 5, and Nintendo Switch, like each one of them were clearly going down different paths. And I feel like Xbox kind of fumbled down the path in a bunch of ways, but found their direction. And where they're going down now, it's like, yeah, I think this is going to really pay off for them. And I think that they're going to in terms of sales um",
            "start": 87.12
        },
        {
            "text": "a bunch of ways, but found their direction. And where they're going down now, it's like, yeah, I think this is going to really pay off for them. And I think that they're going to in terms of sales um absolutely crush. I think it's cheating cuz they just bought everybody and yeah, that's how that works. But like I do think that they are easily going to be like the biggest publisher. So then I want to bring this question in because I think it's tied to this, right? But I wrote down what are the rankings of the first parties in 2035 cuz my bold thing to say right here a decade out being Mr. PlayStation and loving my PlayStation so much. I think they're in third place. And I know that we're talking in a very it's a very hard conversation because now you're saying, well, what metric of success are we talking about, right? Where I think so many of us right now in 2025 would be like, man, PlayStation won this generation when it's like, well, no, Nintendo, they they went a different direction",
            "start": 130.48
        },
        {
            "text": "are we talking about, right? Where I think so many of us right now in 2025 would be like, man, PlayStation won this generation when it's like, well, no, Nintendo, they they went a different direction and like number of unit sales and sold and mind share kicked the [ __ ] out of PlayStation, right? But it's like not what we think of. We think of the AAA box. This is what we're going for where Nintendo isn't playing that game. Xbox lost so badly. uh last generation that they stopped playing that game and made a big deal this generation of we're not playing that game anymore. I think in 10 years based on what we're seeing right now in the Xbox PlayStation race, I think Xbox has set themselves up so well to be the most successful between Xbox and PlayStation because I think they're going to they're going to be ahead on cloud. They're going to be ahead on the app. They're going to be ahead on play on whatever device you want. The campaign that's running right now, this is an Xbox, right?",
            "start": 171.2
        },
        {
            "text": "they're going to be ahead on cloud. They're going to be ahead on the app. They're going to be ahead on play on whatever device you want. The campaign that's running right now, this is an Xbox, right? This is an Xbox. I think PlayStation is going to realize, if they haven't already, that [ __ ] that was a great move on where the tech is going. And by the time they start trying to spin that up, it'll be hard, I think, personally, to get the same hopeful mind share out of an audience, out of the world that that's what they're doing. I I mean, there's so many variables obviously with trying to predict this stuff, but I think we look at Sony and go, \"Oh, they won, right?\" And you know, we're discounting that Nintendo's still dominating, but they beat Xbox because they have the they have the IP, right? They have the IP that's on HBO. They have the IP that uh when we're talking these first party thirderson action games that we think about are the big sort of those are the ones that you look",
            "start": 216.0
        },
        {
            "text": "right? They have the IP that's on HBO. They have the IP that uh when we're talking these first party thirderson action games that we think about are the big sort of those are the ones that you look at and go, man, Xbox needs four of those and like and they have none right now. But I don't know if it all depends on does Sony stick with the just first party strategy or do they eventually start to kind of take notes and see, oh [ __ ] Xbox is selling a lot more copies for their first party games first party because they're going everywhere now. Do we sort of follow suit? And I know that everybody's like really certain that they're never going to do that. For me, I just think that executives up top go, \"Well, doing that equals more money, so yes, let's do that.\" I mean, 10 years ago, we were certain probably that they want to put it on PC, right? I We didn't talk about that specifically. We were way more talking about, oh, well, if this NX thing doesn't hit Nintendo, we'll be putting",
            "start": 257.84
        },
        {
            "text": "certain probably that they want to put it on PC, right? I We didn't talk about that specifically. We were way more talking about, oh, well, if this NX thing doesn't hit Nintendo, we'll be putting everything out multiplatform. They'll just be a third party publisher. It'll just be Sega. I think again, as we've seen these walls fall down, like it's inevitable that PlayStation I think inevitable that PlayStation releases will be day one on PC as well. I know we can point to hell divers, but I mean bigger things, too, because I think eventually you're going to see these numbers in my mind of what's going with PC gaming shift in a way that all right, so many people have gone to PC. There are so many people that haven't and still own a PlayStation. There are the people who want it crossby, crossplay, all this stuff. Like, just give it to them that way. I think convenience and being in meeting gamers where they want to be is what the next 10 years is all about or is seeing it now. But it's",
            "start": 312.0
        },
        {
            "text": "all this stuff. Like, just give it to them that way. I think convenience and being in meeting gamers where they want to be is what the next 10 years is all about or is seeing it now. But it's such an old example I think of IGN when we were there right before you were there when you were there but like old IGN where we had a conversation I remember being there whatever year it was I can't remember if you're actually there or not but of like are we putting IGN videos on YouTube and the answer in was no we have IGN.com people will come to us and they will watch videos on IGN.com and that was wrong right and we learned the hard way at the time of like no you need to go meet the gamer the the consumer where they are and clearly the consumer I think is speaking right now loudly of I want my games everywhere I want be able to play. I want to have some fun. Yeah, it's it's interesting. I I kind of am on the other side of this one. Um I think that uh everyone you guys are making a lot of",
            "start": 348.88
        },
        {
            "text": "games everywhere I want be able to play. I want to have some fun. Yeah, it's it's interesting. I I kind of am on the other side of this one. Um I think that uh everyone you guys are making a lot of sense, but I think that with where we're at, PlayStation's in a different place. Uh when we talk about the the prestige games and like what people think the general public thinks about PlayStation, they still have that. I don't think they're going to lose that. And I think 10 years is a long time. There will be a lot of technological changes that could make everything I'm saying wrong. But I think that what to Andy's point, Xbox is selling uh more than they have ever whatever with these games because they're putting on a console that has an insane install base. PlayStation putting their games on Xbox doesn't have that. So, it's like not necessarily going to change that so much. PlayStation games be on PC day one. I do think that that is uh an inevitability. That should be the goal. I",
            "start": 386.64
        },
        {
            "text": "on Xbox doesn't have that. So, it's like not necessarily going to change that so much. PlayStation games be on PC day one. I do think that that is uh an inevitability. That should be the goal. I imagine that will happen. I mean, PlayStation put on on Nintendo is what I'm talking. Yeah. Like PlayStation going everywhere like Yeah. And the Nintendo thing I do think is is an interesting uh possibility there. But I I think that PlayStation's going to continue to try to be on that the highest end and really be the ones to to push push push the boundaries where I do think everyone else is going to start to go a little bit lower and follow more. As Nintendo reaches up with the tech, I think that everyone else is going to kind of come down a little bit to get on all the handhelds and all that. I think that PlayStation is going to in the same way that people buy 4K Blu-ray players because they want that dedicated physical hardware that it can do it the best. I think that PlayStation is going",
            "start": 422.32
        },
        {
            "text": "think that PlayStation is going to in the same way that people buy 4K Blu-ray players because they want that dedicated physical hardware that it can do it the best. I think that PlayStation is going to be the last remaining console that is trying to be the best console. And I think that that is going to speak to core gamers that I think will always exist. Um, I think that their numbers will dwindle, but I think in 10 years there's still going to be place for a system, a con a video game console that that is the best way to play these games and the only way to play these games. I mean, maybe not only because of PC and stuff, but I would not be surprised if PlayStation doubles down as like our games are only on PlayStation 6 for all the flack audio users out there. Yeah. Um, I I also wanted to point out that like 10 years obviously seems like a lifetime, especially when tech is constantly evolving the way it is, but even I know Steam DB isn't everything, and even I kind of hate when",
            "start": 464.32
        },
        {
            "text": "to point out that like 10 years obviously seems like a lifetime, especially when tech is constantly evolving the way it is, but even I know Steam DB isn't everything, and even I kind of hate when Steam DB is like the only thing that people ever reference when they're looking at numbers and stuff, but PUBG is uh an 8-year-old game by this point. PUBG came out in 2017. That's almost a decade old and it's still number three on the most concurrent players right now. 225k. There's just there's such a great chance that the games out right now are still going to be dominating just like Counter-Strike 2, which is a more visual upgrade to Counter-Strike, right, Mike? Like Counter-Strike is still 1.2 million concurrence right now at the top of the charts. And I think we will like there's a good chance that the top five games being played in 2035 that one or two of them came out this year or are out already or just came out recently or whatever. Um, but I also wanted to to call out that uh when",
            "start": 509.76
        },
        {
            "text": "that the top five games being played in 2035 that one or two of them came out this year or are out already or just came out recently or whatever. Um, but I also wanted to to call out that uh when we were talking about does anybody else have a can any other company kind of enter in here when we talked about how Google Glass and all that and Google Stadia being way ahead of the curve. I think Steam machines were way ahead of the curve and I think Valve with the Steam Deck is showing that they are taking hardware seriously and I could see them selling a Mac Mini looking console that is some type of Steam machine. Steam machine is what they were called. Yeah, Steam machines were way ahead of the game and I think if we see a little baby mini thing that they put out that's like 600 bucks, it runs everything faster and better than what you got right now. Uh, but it's a little tiny PC or whatever and maybe it's got the Steam storefront or it has the Steam OS as opposed to just straight up",
            "start": 561.72
        },
        {
            "text": "runs everything faster and better than what you got right now. Uh, but it's a little tiny PC or whatever and maybe it's got the Steam storefront or it has the Steam OS as opposed to just straight up Windows. Um, I I think yeah, I think they were still ahead of the curve way back in the day with Steam machines and their stupid ass controller that didn't feel good or look good. But no joysticks, just these two like satellite dishes. Awful. Terrible. Terrible idea. But I I really do think that them seeing the sort of excitement, enthusiasm for their hardware with these little um with the Steam Deck that that could evolve in the future. So, here's ju just real quick, I want to stay in this. Yeah, me too. Me, too. Just real quick, I just want to say uh again, you're making a lot of sense. I think that it will happen. I think Steam will put out a more like dedicated like not desktop, like home theater top uh setup. I think all things considered, it's going to be a non-factor. Like I I don't",
            "start": 607.68
        },
        {
            "text": "that it will happen. I think Steam will put out a more like dedicated like not desktop, like home theater top uh setup. I think all things considered, it's going to be a non-factor. Like I I don't think that it's going to uh saleswise make up for anything in the conversation of like the the console space. Like I think that it'll sell significantly less even than the Xbox Series S or X. I Mike was bringing up earlier, kids want PCs more nowadays. And I totally agree just based I mean this is all anecdotal but seeing my nephew who only watches streamers and watches like you know people playing PC games. If you could tell a uh you know a family who has a son that really wants that expensive PC, oh Steam, they're selling that Steam box for $700, $800, whatever it may be. As opposed to the big $2,000, $1,500 PC you might want to buy. this this is an equivalent of that as opposed to the PlayStation where he wants to play on keyboard m I don't know that's all peripheral based and maybe",
            "start": 652.48
        },
        {
            "text": "big $2,000, $1,500 PC you might want to buy. this this is an equivalent of that as opposed to the PlayStation where he wants to play on keyboard m I don't know that's all peripheral based and maybe things change in the future but I I think that with the younger audience they are seeing their favorite personalities play on PC and that's I think only going to continue to grow my question in all this would be I doubt not that I don't think it could happen obviously but I doubt Valve's interest in entering into the hardware market whether it be a box or anything else because I I think they did what they needed to do where ste the Steam machines were a great idea, too complicated, didn't work in terms of like an easy marketing ploy, right? The Steam Deck came out and was like what so many of us had been saying like, \"Oh man, the Switch is great. I wish it could play real games and quotes. That's insulting, but you know what I mean, of like Witcher 3 at max settings, blah blah.\" They make",
            "start": 710.0
        },
        {
            "text": "us had been saying like, \"Oh man, the Switch is great. I wish it could play real games and quotes. That's insulting, but you know what I mean, of like Witcher 3 at max settings, blah blah.\" They make the Steam Deck really make a splash in our market, not in the, you know, wider mainstream thing. And that has inspired, right, Republic of Gamers and has inspired so many other people to do this and tinker and blah. And I think my my perception of Valve would be they saw that and they went excellent. And I'm not saying they don't do another Steam Deck, but I think they step back and let everybody else run with these ideas and one of them I would think makes the box. And again, if it is true, this rumor that Xbox is doing this Xbox, the next generation Xbox also boots Steam and boots Epic and does all does whatever it does, right? If they're able to do that, then that's the ultimate Trojan horse to get PC gaming in at an affordable price point theoretically that you could do. And I think",
            "start": 754.8
        },
        {
            "text": "does all does whatever it does, right? If they're able to do that, then that's the ultimate Trojan horse to get PC gaming in at an affordable price point theoretically that you could do. And I think that's more interesting to Valve who already makes money handover fist. They've they've done what they needed. I I feel right now 10 years before you watch this future, Greg, that they pushed the snowball at the top of the hill. And I do think it's gaining momentum and becoming a snow boulder as it goes. In 10 years, will it be this giant thing that runs over a town? Who knows? But I think that's more of what Valve's position would be. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one, not two, but 21 different locations in their 200th",
            "start": 794.4
        },
        {
            "text": "their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. As kind of funny as Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to kind offunny.com/subways or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surerfers, and start running if you don't want to miss out on",
            "start": 837.04
        },
        {
            "text": "or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surerfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore, and the fast food trips can go from a weekly to daily occurrence very, very fast. So buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart, Protein Plus, Keto, and more. We at Kind of Funny Love Factor Meals. Celeste and Greg loved it for a quick lunch in between shows and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals.",
            "start": 881.56
        },
        {
            "text": "Greg loved it for a quick lunch in between shows and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindafoney5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindofunny50 off for 50% off plus free shipping. factormeals.com/kindfunny50 off. Tim, am I wrong? I I don't know. I mean, I I I feel like there's there's a lot to to even what you just said there, but I I think that yeah, the I think that Steam will put out hardware, and I think that it will be a success to the people that it is. I think the most important thing of all of this is that developers prioritize their games on Steam Deck. So, even though Steam Deck does not have this giant actual foothold uh in the industry, it matters enough to the developers because the people that are playing are [ __ ]",
            "start": 927.2
        },
        {
            "text": "their games on Steam Deck. So, even though Steam Deck does not have this giant actual foothold uh in the industry, it matters enough to the developers because the people that are playing are [ __ ] engaging and they're really playing and they care. And so, I feel like doubling down on that over time, that's going to be that is going to make the size of the PC gaming audience bigger, but I think the importance of the the users on it uh even more so. And to Andy's point that everybody's their their content creators and the people that are watching are using PCs, right? Let's go for a walk. Tim, what was our most successful Let's Play of all time? Guitar Hero. Guitar Hero. Do you remember why? We had broken off 10 years ago for from IGN and started our own company. Kind of funny. And we got hit up about this Guitar Hero event and we said, \"Yeah, we can come play. Do you mind if we come record our own footage and do a let's play live?\" And they were like, \"Uh, hold on and they went and",
            "start": 975.12
        },
        {
            "text": "hit up about this Guitar Hero event and we said, \"Yeah, we can come play. Do you mind if we come record our own footage and do a let's play live?\" And they were like, \"Uh, hold on and they went and talked to people like no you can whatever. We were the only people to do that because we had those showuns the little things that plugged and played and it was like a gamecher in terms of like you can do this kind of content on the road and then you jumped ahead six months and all of our peers were bringing those kind of things and you jumped ahead a year and every demo you went to had the showuns there ready to record. Where I'm driving with this is that when the I bought my Steam Deck and was so excited for it, every time a code came in for review and it's only on PC, I would be like, \"Cool, does it run on Steam Deck?\" And they I don't know, let me go check. And they come back yesterday, whatever it was. Right now, I would say the majority of emails we get are like, \"Here's your code on",
            "start": 1023.2
        },
        {
            "text": "does it run on Steam Deck?\" And they I don't know, let me go check. And they come back yesterday, whatever it was. Right now, I would say the majority of emails we get are like, \"Here's your code on PC. Here's the information if it works or doesn't work on Steam Deck.\" And so many times it isn't running on Steam Deck yet, but it will be verified at launch. like they are telling us are we the games journalists games press game influencers whoever is getting these codes are we everybody no but it shows that enough people are asking that same question and then turning around like I am and being like cool there's a new Starfield update today everybody's talking about I'm I have you know I'm playing anywhere I have my PC version of Starfield that I'm logging into right now to add the coins to buy the thing so that when I get home I can play it on my Series X but I can also play it here like I'm talking about the Rag Ally in a way and with an excitement that I haven't talked talked about a",
            "start": 1060.96
        },
        {
            "text": "buy the thing so that when I get home I can play it on my Series X but I can also play it here like I'm talking about the Rag Ally in a way and with an excitement that I haven't talked talked about a hard piece of hardware in a long long time. He's been awakened. Yeah. That's that desire from gamers that have always had of I want to play my games anywhere at any time, right? And so we are barreling towards that whether it be on your phone on a handheld on a screen or a dedicated console. We're just I think 10 years from now it will continue to be that and that's what gamers want. And whoever is finding that, whoever is for first to that, whoever can really find that and put out great titles and games, that's what they want. That's what we're going to see. I mean, everybody wants that right now is right, Greg. I want to be able to play anything at any time. I love that. So, for sure. Yeah. Who's who's going to do that? Timothy, I like talking about this and what I want to know is about",
            "start": 1098.48
        },
        {
            "text": "now is right, Greg. I want to be able to play anything at any time. I love that. So, for sure. Yeah. Who's who's going to do that? Timothy, I like talking about this and what I want to know is about the Nintendo Switch. I want to know about this Nintendo Switch 2. And one of the questions I have here is like, are we on the eve? Are we talking about that Nintendo Switch 3 in 10 years when we do this? Isn't Are we on the eve of the release of the Nintendo Switch 3? Are they calling it the Nintendo Switch 3? What is Nintendo's next 10 years? Yeah, we'll we'll have a Switch 3 in 10 years. Like we'll already have been a year or two into it, I would imagine. Um I there's so many questions about the success of the Switch 2, though. Like the I think that just the time world we're in right now with all of the politics and tariffs and just all of this [ __ ] Like it's it's going to be rough. And because of all of that, like I Nintendo's either going to grand slam knock it out of the park and",
            "start": 1139.92
        },
        {
            "text": "all of the politics and tariffs and just all of this [ __ ] Like it's it's going to be rough. And because of all of that, like I Nintendo's either going to grand slam knock it out of the park and continue to sell out and all of that, or I think other factors are getting in the way. I think they are primed for it. Like I think that we 10 years ago talking about the where we're at the Wii U and the 3DS. Now we're talking about the Switch, they have got to the point that we are 10 almost 10 years into their handheld and console development cycles being one. And I think that we're going to get a incredibly consistent uh output from Nintendo over the next couple years supporting the Switch 2. And I think it's going to continue the success that the Switch One had in terms of having um the majority of their first party games be uh purchased by the majority of people that have a Switch 2. So, um, because of that and I I think just like having the momentum so early going into it and also still",
            "start": 1179.92
        },
        {
            "text": "of their first party games be uh purchased by the majority of people that have a Switch 2. So, um, because of that and I I think just like having the momentum so early going into it and also still having the Switch One audience, like Nintendo as a whole, they're not going to give up on the Switch One for years from now. Like we have at least at least two years of support of this thing. So, um, yeah, I I feel I feel like this generation, unless things get horribly worse than they are currently, I think it's going to be Nintendo's strongest generation yet. Ah, Andy, you agree with that? Um, man, I I it's just so hard for me to think about the the future of all of it because I I wonder where like when these consoles start to stagnate or when these like have we kind of hit that have we hit the top of the mountain already and how much like Sorry, just just real quick because the point that I want to make just uh to that I want you to then jump off is that I should have said here is the",
            "start": 1224.96
        },
        {
            "text": "the top of the mountain already and how much like Sorry, just just real quick because the point that I want to make just uh to that I want you to then jump off is that I should have said here is the reason I think so highly of Switch 2 is They're gonna continue the first party stuff, but it's the third party that's gonna be the game changer. So, okay. Well, part of me wonders if Nintendo is the company that will most resemble a video game company in the future. Like, and what I mean by that is where gaming is first, where I feel like PlayStation sees the success of of maybe their IP doing movies and Xbox wanting to be everywhere and just kind of be a an app on your screen, like how you can, you know, open up Amazon or whatever the hell on your TV. I I feel like Nintendo will be the company to look most like the game box in the future with the it's going to resemble more of what we think of if you looked on clip art for video games. Yeah. Like and I feel like every other company will",
            "start": 1275.44
        },
        {
            "text": "to look most like the game box in the future with the it's going to resemble more of what we think of if you looked on clip art for video games. Yeah. Like and I feel like every other company will try to do what Xbox did with the Xbox One and how much of a disaster that was, but it was really just way ahead of its time. Uh like a lot of the other kind of failures we've talked about. I think I think Nintendo will continue to be just the gaming platform with maybe some gimmicks that continue to like not really get fully fleshed out like the webcam stuff and things like that, you know. Yeah. What I'm fascinated about with Nintendo is now we see such a push with more handhelds, Tim, we see a push of Play Anywhere. Is there going to be more competition against Nintendo to have them change their ways? When I think Nintendo, it's the games, right? I think it's the parents who grew up with Nintendo. They know it's a familyfriendly safe platform to put their kids on and have them grow in video",
            "start": 1325.12
        },
        {
            "text": "ways? When I think Nintendo, it's the games, right? I think it's the parents who grew up with Nintendo. They know it's a familyfriendly safe platform to put their kids on and have them grow in video gaming. But now with the hardware like you said, right, it's getting better and others are pushing higher, but eventually we'll kind of get to a moment where everything is close. Does Nintendo see a lot of competition and have to change their ways or Yeah, I agree with Andy of like it feels like Nintendo is going to be Nintendo in 10 years. It's easy to say that, but like do we see them massively change? I mean, I think the biggest difference and we're going to see it in just a few weeks. I'm I'm telling you all right now, I brought this week ago. Cyberpunk 2077 is going to be a gigantic surprise to people and how well it sells and the response and reception to it on the Switch 2. I can be totally off and and the thing is if it comes out and it runs like [ __ ] and people don't like it and",
            "start": 1375.44
        },
        {
            "text": "to people and how well it sells and the response and reception to it on the Switch 2. I can be totally off and and the thing is if it comes out and it runs like [ __ ] and people don't like it and it doesn't review well, I take back everything I'm saying for for this. But like I think that this is going to be a statement piece that CD Project Red are they're not doing the stupid game card key whatever the hell thing they are sticking to. We're we're doing the big one. We're investing in that because we believe in it. Nintendo players buy physical games. They still matter. There there's the digital sales, but then there's still this like toy level appreciation of Nintendo being seen as a video game console um that I think works in their benefit. And the third parties that uh adapt that philosophy, I think are going to find a lot of success because Nintendo fans will reward them. And to your point, Mike, it's like, yeah, right now Nintendo fans buy Pikmin and Animal Crossing and Mario",
            "start": 1414.16
        },
        {
            "text": "I think are going to find a lot of success because Nintendo fans will reward them. And to your point, Mike, it's like, yeah, right now Nintendo fans buy Pikmin and Animal Crossing and Mario and Zelda and stuff. If we can now get people also buying all the Square games on Switch, all of the Capcom games, all of the Ubisoft games, can they make it good enough? Good enough. And I think that's the big thing is yes, there's a lot more competition in terms of there's stronger uh handhelds available, whatever. But there's still tinkering. It's still PC gaming. As easy to use as the Steam Deck is, it's not nearly as easy as Nintendo. So, the thing is, it still has to work. It It can't be like Switch One where it's like, \"These are the worst ports ever.\" They need to be like, \"Oh, these are good ports. It has to be good.\" If it's good, I think that Nintendo's about to just run with this [ __ ] Because the the fact of the matter is we don't need to wait for a PlayStation handheld. We don't need",
            "start": 1454.32
        },
        {
            "text": "It has to be good.\" If it's good, I think that Nintendo's about to just run with this [ __ ] Because the the fact of the matter is we don't need to wait for a PlayStation handheld. We don't need to wait for a uh can it play via cloud or whatever. It is a handheld device and the tech's there. Like, we're getting the HDR. We're getting the VRR on the portable side of it. Like, it's 4K. like they they've said everything they need to to be in the competition and they're they're already winning so many other areas of the competition that all they need is third parties and if they get that, holy crap, man, they're about to take over. And the bigger question is, do we also see a Pokemon Land theme park in the future? Come on. Hell yeah, dude. Come on. That's it. In within 10 years. Yeah, that's what you want. It's happening, baby. Now, really quick, 10 years is a long time. We will be done with the Switch, too. we'll be moving into the next one, Tim. Are they going to stick with the handheld",
            "start": 1496.4
        },
        {
            "text": "you want. It's happening, baby. Now, really quick, 10 years is a long time. We will be done with the Switch, too. we'll be moving into the next one, Tim. Are they going to stick with the handheld dual handheld/home console or will they ever move away from that? See, this goes back to what you were saying about um you know, eventually you don't we don't want hardware. It's like we just want to think the thing about the handhelds is you need a controller. No matter what, you need a controller. The what screen you're using, whether it's glasses or a TV or a screen in between a controller, you still need a screen, right? So, because of that, I feel like the Switch is in a we're already kind of saying this, but in 10 years, we're going to be like, \"Dude, the Switch was ahead of its time, right?\" Like, the fact that it is the console that you can plug into the TV and just take with you. It checks all the things you need for video games, control, input, and visual display. I think that it'll",
            "start": 1540.0
        },
        {
            "text": "Like, the fact that it is the console that you can plug into the TV and just take with you. It checks all the things you need for video games, control, input, and visual display. I think that it'll continue to do",
            "start": 1584.0
        }
    ]
}