{
    "id": 14151,
    "video_id": "JNIvXMQkZN0",
    "show_name": "In Review",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez",
        "Joey Noelle"
    ],
    "title": "Karate Kid: Legends In Review - Every Karate Kid Movie Recapped & Ranked",
    "description": "Go to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\n00:00:00 - Start\n00:09:35 - Thoughts on The Karate Kid (2010)\n00:16:05 - Thoughts on Karate Kid: Legends\n00:27:08 - Spoiler Thoughts\n00:31:40 - Plot\n01:24:20 - RaGu BaGu\n01:26:10 - Rank\n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748638589,
    "duration": 5436,
    "transcript_chunks": [
        {
            "text": "[Music] [Applause] [Music] What's up and welcome back to Kind of Funnies the Karate Kid in review. That's right. We are ranking, reviewing, and recapping all of the Karate Kid movies just like we do each and every week here at Kind of Funny with different movie franchises. Of course, I'm your host, Tim Gettys. I'm joined today by the Nitro Rifle, Andy Cortez. What's going on with the gym right now? It's having some fun. You know what I mean? It's figuring itself out. It's having a nice little entrance to the the summer blockbusters, you know what I mean? The gym's getting ready for the essentially backtoback weeks. I feel like they might have already started uh of just big ass sequels to franchises. So, yeah. interview is about to be popping off everybody and that Jib's just gonna be very happy about it. We're also joined by It's Christmas in May, Joey Noel. Happy Taylor Swift reclamation day to everybody that celebrates which is really just me and Greg. Yeah, I'm I'm happy for you.",
            "start": 0.95
        },
        {
            "text": "happy about it. We're also joined by It's Christmas in May, Joey Noel. Happy Taylor Swift reclamation day to everybody that celebrates which is really just me and Greg. Yeah, I'm I'm happy for you. I'm happy for her. Thank you. Yeah, my close Joey's allowed to listen to the original recordings of Taylor Swift again for the first time. I'm I'm more of a fan. What was it? Taylor's Recipe. Taylor's Taylor's Recipe. Rounding out our group. It's Nick Scarpino. Hello, Tim. You're wearing a very white jacket. Shut the [ __ ] up. I feel like I feel like my polo is less egregious than the white denim. I'll be I don't think I've ever seen either of you wear either of these. I've seen Tim wear the white denim. I've worn this a couple times. It's It got It got covered underneath a bunch of my pomber jackets, so I forgot about it for a while. Um but you know, it's got a couple more wears in it before I can't wear it no more. Nick look like looks like he's going to pull up that stool and be like,",
            "start": 55.12
        },
        {
            "text": "jackets, so I forgot about it for a while. Um but you know, it's got a couple more wears in it before I can't wear it no more. Nick look like looks like he's going to pull up that stool and be like, \"You know who else was a legend as a kid? Jesus Christ.\" Oh, you think I'm you think I look more Catholic? You think I just knocked on your door and I'm trying to sell you some Bibles on the Good Word. You look like you were next to Toby Magguire in No Way Home coming through the the portal. You know what I mean? Yeah, I'll take that. I'll take this look. I just feel like trim the stash. Uh I mean I trim it occasionally. I groom. I am a groomer. Nope. Nope. Nope. That does not bode well with what Andy just said about me. Maybe we should just run the whole show. Let's talk about Tim. Put it back on me. I'll take it now. We got to get the heat off my stupid white jacket. Okay, guys. Yeah. Oh, man. This is in review, everybody. This is also kind of funny. You know what we do here. Uh we're",
            "start": 94.72
        },
        {
            "text": "on me. I'll take it now. We got to get the heat off my stupid white jacket. Okay, guys. Yeah. Oh, man. This is in review, everybody. This is also kind of funny. You know what we do here. Uh we're we've been having a great week. Definitely watch the kind of funny podcast this week. There was amazing moments in it. Uh most of them involving Nick. Uh but next week's going to be even better, even more special. We have Switch 2. We have Summer GameFest. We have John Wick the B from the world of John Wick Ballerina uh coming out as well. So for in review people, of course, we will be reviewing that uh for John Wick in review. But next week's big Monday will be our summer gamefest predictions. Tuesday will be our Xbox showcase predictions. Wednesday is going to be our the beginning of our super massive kind of funny switch to allight launch party. Um, starting in the night of Wednesday all the way through to games daily on Thursday morning, we're all going to be unboxing our Switch twos,",
            "start": 142.0
        },
        {
            "text": "massive kind of funny switch to allight launch party. Um, starting in the night of Wednesday all the way through to games daily on Thursday morning, we're all going to be unboxing our Switch twos, playing Switch 2 games. Uh, really it's going to be Mike and Roger holding down the fort all night so that the next day, Thursday, it's going to continue. We're going to be playing way more Switch 2, getting hyped, and then Friday, guess what? More Switch 2 and then Summer GameFest. We're going to live react to it. We're going to break it all down after. Then Sunday, we're going to come back in and do it one more time for the Xbox showcase. So, great week of stuff coming up for y'all next week. Get hyped for that. Shout out to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. You're going to probably want to get the kind of funny membership so you can get everything I just said ad free and a daily exclusive. Greg Way. Um, today we're brought to you by Mood. We'll talk",
            "start": 187.04
        },
        {
            "text": "You're going to probably want to get the kind of funny membership so you can get everything I just said ad free and a daily exclusive. Greg Way. Um, today we're brought to you by Mood. We'll talk about that later cuz we have to talk about not one but two movies. This is officially The Karate Kid Legends in review, but due to timing and scheduling and how the years worked, we never actually reviewed The Karate Kid 2010 with Jaden Smith and Jackie Chan. We never thought because originally we're going the Miyagi verse is what we were reviewing. We never could have comprehended in our silly little minds Andy that it all was the Miyagi verse until Legends and now like well we got to go back. But we're just going to halfass it. This one was like we're running out of time. So it's optional homework for people to watch Karate Kid 2010. Who here watched it? Raised your hand. [ __ ] no. Everyone except Andy Cortez. Andy, have you seen this movie before? A long time ago. It was one of those",
            "start": 226.08
        },
        {
            "text": "for people to watch Karate Kid 2010. Who here watched it? Raised your hand. [ __ ] no. Everyone except Andy Cortez. Andy, have you seen this movie before? A long time ago. It was one of those again summer movies on HBO when you're 12 years old and it plays at 2 p.m. Mhm. And you're like, \"All right, well, you know, you know, Blues Clues is done and you know, Dexter's Lab is done now, so I guess I'll watch this.\" Yeah. Yeah. Uh, the chat says, uh, CT Wig says, \"I feel like Tim just models his life around Tommy when he was the right White Ranger.\" And, uh, I appreciate that cuz I do look like Tommy just wearing his casual like human clothes. That's [ __ ] awesome. You're uh you're you're Disney bounding. You're ranger bounding. You just made my weekend there. Um but yeah, I want to right now just letting y'all know the format of the show. Nick, I need you to lock in just so you understand what we're about to do here. Okay. Uh we're going to be talking about two movies. I'm going to run",
            "start": 267.68
        },
        {
            "text": "just letting y'all know the format of the show. Nick, I need you to lock in just so you understand what we're about to do here. Okay. Uh we're going to be talking about two movies. I'm going to run through the I'm still going to rough Machio's hair. He is. We'll get there. We'll get there. We will get there. I'm gonna I'm gonna go through the rigmarole of the details of both the movies just to get it out of the way. Um, then I want us to talk about our thoughts on Karate Kid 2010 for the people that have watched it, uh, just real briefly, uh, or anything we want to say about it. Then I want to get to spoiler-free thoughts on Karate Kid Legends because a lot of people haven't seen it. Still in theaters. Then of course we'll get into the plot and the entire spoil the movie, give all our thoughts and all that stuff. Perfect. Capich? Mhm. Capich. Fantastic. Thanks, Jeff. Karate Kid Legends came out May 30th, 2025. Directed by Jonathan and Twistle, who is best known for End of the [ __ ]",
            "start": 311.92
        },
        {
            "text": "and all that stuff. Perfect. Capich? Mhm. Capich. Fantastic. Thanks, Jeff. Karate Kid Legends came out May 30th, 2025. Directed by Jonathan and Twistle, who is best known for End of the [ __ ] World, the Netflix show that I really liked season one of and then never watched season two. And he and the kid was in from Legends was in this, right? Was in that was Oh, was he? I think so. The SAT kid. Oh, yeah. Yeah, that was him. Yeah. And he's from Mid as well. Yeah, that's what I was saying. Oh, that that's what we were trying to figure out. Are you British? Aren't they all British, Andy? Aren't you British? It wouldn't surprise me if this entire time you've been doing an American accent, but you were actually good at it. Michael's a lot of American. Uh the music was done by Dominic Lewis, a composer, uh who has also done the man in the high castle, ducttales, Peter Rabbit one and two, and the Fall Guy and Bullet Train most recently. He also was a wide varing voice for Lurch in the Adams",
            "start": 347.76
        },
        {
            "text": "composer, uh who has also done the man in the high castle, ducttales, Peter Rabbit one and two, and the Fall Guy and Bullet Train most recently. He also was a wide varing voice for Lurch in the Adams Family Too. I was just thinking about Lurch last night. Yeah. Why? Um, they mentioned Lurch on the Dan Levitar show and then I remembered thinking why did I dress as Lurch for Halloween with my brother. I need a picture of both of us as Lurch and I was I don't know why it really just feels like the biggest like bargain bin discount thing of like let's get two of those costumes. I don't even remember loving Adam's family a whole lot as a kid either, but like we were both lurch and we both had our faces painted like zombies. I don't know if we've seen a picture of this dude. I think you've seen a picture. I think that we've brought this up before, but I was probably about like this tall like and me and my brother just sitting there with our little our pumpkins and painted our faces look",
            "start": 394.72
        },
        {
            "text": "a picture. I think that we've brought this up before, but I was probably about like this tall like and me and my brother just sitting there with our little our pumpkins and painted our faces look like all zombified with the dark under. Yeah, it was weird. I don't know why I did that. Lurch and lurch. Uh he was also the singing voice of Donald Duck in the Ducttales reboot. So good for you, Dominic Lewis. Uh the budget of this one was $45 million. Um and then going to Karate Kid 2010, it was just called The Karate Kid. It had a run time of two hours and 20 minutes. It was egregious. Why was No Karate Kid movie ever should be around two hours? Wait, Legends was an hour and a half. Oh [ __ ] Okay. I heard you kind of saying to Joey, I thought Joey was like, \"God damn, this movie is like two hours.\" I thought you were talking about the one we were going to watch yesterday, and I was like, \"Oh, [ __ ] God dang it.\" Hour and a half. That's way too long for the 2 hours and 20 minutes of Jaden",
            "start": 442.72
        },
        {
            "text": "I thought you were talking about the one we were going to watch yesterday, and I was like, \"Oh, [ __ ] God dang it.\" Hour and a half. That's way too long for the 2 hours and 20 minutes of Jaden Smith. Okay. um released on June 11th, 2010. That one was directed by Harold Zart, who's best known for movies in the Netherlands, but also what, Joey? That's right. 2003's Agent Cody Banks, of course. Uh Andy, do you think his friends called him the Zard Attack? The uh heart attack. Like Zard Attack. Yeah. But isn't it Zard with a D? Z W A R T. Oh, then maybe they do. With The Karate Kid 2010, the music was done by James her uh who has done some of the most iconic scores of all time, including most of the James Cameron movies, uh Avatar, Titanic, uh you know, we got Apollo 13, Braveheart, Beautiful Mind here, many of the old school '8s Star Trek movies, Troy. Um so yeah, Amazing Spider-Man, like he's been all over the place. That to people don't talk enough about Troy. They don't talk enough",
            "start": 491.04
        },
        {
            "text": "Mind here, many of the old school '8s Star Trek movies, Troy. Um so yeah, Amazing Spider-Man, like he's been all over the place. That to people don't talk enough about Troy. They don't talk enough about Troy. We should have pushed harder to add that to Gladiator and review. Yeah, we should. Maybe we'll add when we do the sunset whatever when Tim finally capitulates to that. We'll add it to that. Sunset whatever. Uh and then yeah, the budget for this one uh was also around $45 million. Um let's start with Karate Kid 2010. Uh Joey, overall thoughts? Honestly, not as bad as I thought it was going to be. It definitely felt like 2 hours and 20 minutes, but I wasn't necessarily mad about it. I liked it overall. The thing that I will that will stick with me about this movie is the insane music that they use in this. Can we talk about it? Well, I don't really care if we can. I'm going to. Okay. It starts with Do You Remember by J Sean. It's the most egregiously 2010 soundtrack ever. Oh, yes.",
            "start": 547.28
        },
        {
            "text": "they use in this. Can we talk about it? Well, I don't really care if we can. I'm going to. Okay. It starts with Do You Remember by J Sean. It's the most egregiously 2010 soundtrack ever. Oh, yes. And I also love that like 50% of it is just like purely licensed and then the other 50% is Chinese versions of licensed music. Yes. It does like Crazy Rich Asians. The Gorilla's cover. There's the gorillas uh remix that it's just dirty hairy, but it's the Hong Kong version. Like that's kind of cool. Then we have Say What You Need to Say by John Mayer, which is a wild tone. Baby, I'm Back by Baby Bash and Acon, Low by Flow Rider, Poker Face by Lady Gaga, and then it ends with Never Say Never by Justin Bieber, and then Tim blew my mind letting me know that Jaden has a verse on it, which I didn't remember, and that it was made for this movie. What is this? Never Say Never. Whoa, I didn't know that. Mhm. What a weird collection of things for this movie. Honestly, I liked it. Wait, I thought Jane",
            "start": 591.2
        },
        {
            "text": "and that it was made for this movie. What is this? Never Say Never. Whoa, I didn't know that. Mhm. What a weird collection of things for this movie. Honestly, I liked it. Wait, I thought Jane Smith was good. I guess I have never really seen that many Jeene Smith movies. I don't think he's done that many pursuit of happiness. Kind of knocked it out of the park whenever his dad put in a movie. Yeah, he would have. Uh, and it didn't it at the same time did feel as long as it was and didn't. I think Jackie Chan did like a fairly good job. I also don't have like a ton of experience with him, so it's kind of my first one. I do think it's weird that it's not really about karate. Yeah. Well, I mean, that's something we should talk about, right? That's like the weirdest part of the movie, but other than that, I was expecting like real bad and this was surprisingly competent. And it's also just Tokyo Drift. Yeah. So, like, how can I really? Nick, what did you think? Is this your first time",
            "start": 633.84
        },
        {
            "text": "other than that, I was expecting like real bad and this was surprisingly competent. And it's also just Tokyo Drift. Yeah. So, like, how can I really? Nick, what did you think? Is this your first time watching this? No, I saw I saw when it came out. Uh, it's Tokyo Drift, but without the actual fun of Tokyo Drift somehow. Uh, this movie I think has a lot going for it and it's honestly a lot better than I think people would assume it would be. I remember watching it the first time thinking, you know, it's pretty it's a fairly competent movie and it's a it's a good remake for all intents and purposes of The Karate Kid. Um, the choreography is way better, the fighting is way better. Jackie Chan is really fun to watch always cuz he's Jackie Chan and I think he has great chemistry with Jaden Smith who I think is good in this movie, but after two hours of it, you walk away going, \"Ah, there just was something lacking in that.\" that movies of similar ilk, like the fish out of water story of",
            "start": 678.24
        },
        {
            "text": "who I think is good in this movie, but after two hours of it, you walk away going, \"Ah, there just was something lacking in that.\" that movies of similar ilk, like the fish out of water story of Tokyo Drift or like the original Karate Kid, which is a fish out of water story. Um, those movies just have a magic to them that this one just didn't have in there. And I don't know quite why that is. I think Jackie Chan does a great job, especially in these really emotional moments where he's, you know, where when things happen and he's talking about stuff. It's so we have all those beats that are supposed to be there. Uh, and I think Jaden Smith, I think they could have literally built a franchise out of this. I just think it's lacking that one thing that made you want to come back to this world. Um, so not necessarily a waste of a film, but a missed opportunity. I want to start my thoughts off and say I just I can't believe I'm living a life that like we talk about Tokyo Drift with such",
            "start": 715.84
        },
        {
            "text": "Um, so not necessarily a waste of a film, but a missed opportunity. I want to start my thoughts off and say I just I can't believe I'm living a life that like we talk about Tokyo Drift with such praise. Like it's not just me. Like this is awesome. Uh, I was I'm right in line with y'all. I was going into this one like thinking it was going to be bad bad and a waste of time and two hour 20 minutes I was like [ __ ] my life. like a remake of Karate Kid that they're not even doing karate. Like I thought that there was no way this was good and everything I've ever heard about it kind of been that vibe. It wasn't that at all. This is a movie. Like there's uh a couple times on interview I'm surprised by how much of like a movie the things we watch are cuz sometimes it's just like it just feels like content. It just feels like we're just doing this thing. It's episodic whatever the [ __ ] This like oh and maybe a lot of it is the James score that brings it together but it's like checks a lot",
            "start": 753.2
        },
        {
            "text": "content. It just feels like we're just doing this thing. It's episodic whatever the [ __ ] This like oh and maybe a lot of it is the James score that brings it together but it's like checks a lot of boxes. It it it just kind of like it it feels like they were trying to do something and yeah, they just remade Karate Kid, but I think they kind of nailed that. Um, and I I feel like it's a story that is timeless and no matter how many times you tell it, it's going to kind of hit if you just do all the things you need to do. And I think this did all the things. It took way too long to do them. But I think at the end of the day, I forgive that because Jackie Chan's [ __ ] awesome. And I didn't expect the Jackie Chan factor to affect this film. I thought he was just going to be okay cool. He's more of the the sefue Yoda type of just telling him things. Wax on, wax off. Miyagi, we see like a fight scene with Miyagi. Yeah. Right. But like with Miyagi fighting is not really like a highlight for",
            "start": 796.8
        },
        {
            "text": "of the the sefue Yoda type of just telling him things. Wax on, wax off. Miyagi, we see like a fight scene with Miyagi. Yeah. Right. But like with Miyagi fighting is not really like a highlight for anything besides the novelty. Whereas Jackie Chan in the 2010 one, his fight scenes rip, dude. They are so cool. And it's that Jackie Chan kind of prop comedy fighting. Unbelievably good. That's why you watch John Wick movies. Abs. Absolutely. It's there's something special about that. And yo, shout out to Jaden Smith. I did not ever think that this kid had this stuff. He 12-year-old Jaden Smith. Good. Kind of great, man. Love it. Uh the bad guy made me laugh so bad. Like the the little the the the bullies in this movie. Maybe the the the greatest worst squad of bullies I've ever seen. Like you look at these kids, Eddie, and you be like, I can beat the [ __ ] out of these kids. You know what I mean? Uh but then you see them fight and I'm like, hey, this tournament kind of cool. very 2010 but",
            "start": 837.28
        },
        {
            "text": "at these kids, Eddie, and you be like, I can beat the [ __ ] out of these kids. You know what I mean? Uh but then you see them fight and I'm like, hey, this tournament kind of cool. very 2010 but kind of cool. I think that might be one of the one of the things that draws me out of it though and I don't know what it is but they just they just read all of them so young that when they do violence I'm like ah there's something wrong here and the choreography is almost too good. One of the things I like so much about going back and watching the Karate Kid is that he doesn't learn karate and that he masters it. He just learns enough to score points on Johnny and win because it's not about learning karate. It's about overcoming your fear and like doing the thing to prove to someone you to prove that you're good at something. It's about winning the tournament basically and by by proxy of winning the tournament. You're, you know, you're overcoming this wow you're overcoming this fear basically",
            "start": 886.96
        },
        {
            "text": "you're good at something. It's about winning the tournament basically and by by proxy of winning the tournament. You're, you know, you're overcoming this wow you're overcoming this fear basically and proving to everyone around that you got the stuff. So this is is interesting because what it does go kind of devolve into those incredible action sequences. It almost takes me out of the the point of the movie. Andy, what' you think? We didn't watch it. Oh, that's right. I haven't watched it in forever. Like it's just been so long. Uh we'll we'll rank it. uh when we get to the ranking of all of them, we'll just do that together. Um so yeah, now let's talk about Karate Kid Legends spoiler-free before we get into the entire spoiler mode. Um Nick, I want to start with you. Spoilerfree for Legends. Spoilerfree for Legends top level. I think this movie should have gone straight to Netflix because it feels like a straight to Netflix movie. I think it's it's a missed opportunity across the",
            "start": 926.96
        },
        {
            "text": "Spoilerfree for Legends top level. I think this movie should have gone straight to Netflix because it feels like a straight to Netflix movie. I think it's it's a missed opportunity across the board. I had fun watching it with you guys, but not for the right reasons. I had fun sitting next to Andy laughing at these moments that just kind of came out of left field across the board. Um, to speak positively about it, I liked the two leads. I thought they had great chemistry together. I think um I'm going to say that his name here because I brought it up. Uh, Ben Wang is phenomenal. At at one point, and this is a bit of a spoiler, but there is a nod to uh him running around New York and discovering that and sort of doing heroic things. In my brain, I'm like, \"Oh, he's kind of Peter Parker.\" And at some point, someone actually calls him Peter Parker. And I'm like, okay, they know what they were going for here. He has great chemistry with Sadie Stanley, who plays sort of the love interest,",
            "start": 964.56
        },
        {
            "text": "at some point, someone actually calls him Peter Parker. And I'm like, okay, they know what they were going for here. He has great chemistry with Sadie Stanley, who plays sort of the love interest, best friend. Uh, everything in New York is great. The fact that Joshua Jackson in this movie is great. Um, did we have we confirmed if he was, was he in the trailers? Cuz I did not remember. He's on the poster cuz I remember walking in going, I know he's in this movie. Um, I had no idea. He was on one of the posters. I remember shocked. You know, I think Jackie Chan's great in this movie, and I love uh Ming Nawen. I I love all of these people. And then by but by the time we get to Ralph Machio, I'm like there's too there's too much going on here. We're we're the the the biggest fault of the film is that it's really trying to tie the 2010 universe into the Cobra Kai universe. And I just don't think those two necessarily mix well. They they mix and you can shoehorn them in, but it doesn't have",
            "start": 1004.96
        },
        {
            "text": "is that it's really trying to tie the 2010 universe into the Cobra Kai universe. And I just don't think those two necessarily mix well. They they mix and you can shoehorn them in, but it doesn't have the sort of campy nostalgia that that made Cobra Kai what it is. It really it it feels more closely associated with the 2010 movie than it does with Cobra Kai. And to me that's a disappointment. Um I will say the choreography was great, but by the time we got to tournaments and stuff like that, I was like I just I really don't care about what's happening with these characters. Joey Noel, I liked it. I had pretty low expectations going into it. I liked it way more than I thought I was going to and I think it's good. Um, I was shocked that I ended up caring about pretty much every car main character in this movie. I feel like there were so many different places where it could have fallen apart for me or but I think the two leads are really good. Joshua Jackson is like kind of weird and fun.",
            "start": 1041.52
        },
        {
            "text": "in this movie. I feel like there were so many different places where it could have fallen apart for me or but I think the two leads are really good. Joshua Jackson is like kind of weird and fun. I just love him. So, I'm excited to see him. Um, Bing Na Wen I really liked. I think it came together way better than I ever would have expected this like weird uh mix of these two very different but the same franchise together. Um, and I'm like excited to see more. I hope we get another one and I would be stoked to see it. Also, shout out to all of the karate names in this movie. I think as they're doing like the bracket and stuff like that, I think that's the most I've laughed and I'm so sad that you missed it. Andy, you you walked out and unfortunately missed some of the best parts of the movie. You missed the best five minutes of this movie, which sucks. I missed the first uh the first battle and a half in a spot that I won't mention, but I saw the rest of them from the little hallway I",
            "start": 1091.2
        },
        {
            "text": "You missed the best five minutes of this movie, which sucks. I missed the first uh the first battle and a half in a spot that I won't mention, but I saw the rest of them from the little hallway I didn't want to like walk out on. So, I saw like all of that leading into the Did you see the guitar part? Yes. Okay, good. Yes. That I'm not as sad for you. That was Yeah. Um but yeah, I thought they like cobbled together like a good enough crew that I had I liked it. I would I would watch it again. Andy Cortez. I think this is a pretty bad movie with good moments in it. Like there's some parts where I am feeling emotional. I'm like, \"Wow, this is working in a movie that I don't think is good.\" Uh there are a lot of moments that are just crazy forced. Uh so much end of Game of Thrones fast traveling that is just [ __ ] hilarious. It's funny as hell. uh the way that they go about storytelling and and that's the type of stuff that I guess I don't necessarily even mind in this movie cuz it's not",
            "start": 1132.24
        },
        {
            "text": "that is just [ __ ] hilarious. It's funny as hell. uh the way that they go about storytelling and and that's the type of stuff that I guess I don't necessarily even mind in this movie cuz it's not something that I care too something I don't care about it too deeply where I'm like ah you're ruining the sanctity of my karate kit it's goofy it's going to make you laugh there's weirdly like a couple of really good humorous moments where I'm like what you that felt like it was written by like a comedy writer and like that it was kind of missing in some other spots But um I yeah near the end of the movie I'm just like this it doesn't look like it's shot particularly well. This feels like a extremely lowbudget thing that probably at one point was meant for direct to digital but maybe that's not the case. It just always it felt at like such a small scale and like everything was just like fast forwarded cuz they probably had a lot of story beats that they wanted to get through. Um, yeah, I",
            "start": 1184.72
        },
        {
            "text": "the case. It just always it felt at like such a small scale and like everything was just like fast forwarded cuz they probably had a lot of story beats that they wanted to get through. Um, yeah, I think it's like as a whole not a great movie, but you will smile if you enjoy Karate Kid. You will have moments of laughter. You will get hype when the, you know, hero is either s uh, you know, either succeeding or failing at whatever the task is. Um, but there was a lot of, I think, really cool moments of choreography where I was like, man, I want like is Jackie Chan like, you know, doing choreography for a lot of other movies or he was because Oh, for this he was I mean for this you could absolutely tell cuz this reminded me Jackie Chan was like retired for a while. Yeah. Yeah, like this. Watching a lot of these fight scenes reminded me of all, you know, watching a bunch of old like even pre uh um you know, Shanghai Nights and Rush Hour type movies. It reminded me like just really old",
            "start": 1234.96
        },
        {
            "text": "Watching a lot of these fight scenes reminded me of all, you know, watching a bunch of old like even pre uh um you know, Shanghai Nights and Rush Hour type movies. It reminded me like just really old school Jackie Chan movies that were are it's so creative and so fun with how he plays with choreography. But yeah, I think I think the movie is like overall not great, but stay tuned for the postredit scene is what I'll say. Tim, what did you think? Uh, I I really liked it and I think it's because of like Joe, I think more than any of you. I was coming into this with like not just low expectations. Like I was kind of ready to hate this movie cuz I was like everything I've seen from the trailers and stuff, parts of it. Of course, I'm just going to get hyped because I like the silly things, but I I I keep my silly things sacred and I care about Copra Kai so much. I think they've done such a great job of setting a tone and making this world the goofy thing that it is. And this movie trailer",
            "start": 1280.16
        },
        {
            "text": "I I I keep my silly things sacred and I care about Copra Kai so much. I think they've done such a great job of setting a tone and making this world the goofy thing that it is. And this movie trailer and the movie itself is not that at all. And uh so because of that, I really felt like I was like, \"Oh, why? What what's there even going to be here for me to possibly like? It's just going to be another remake of the exact same story we've seen a million times.\" And on that front, I will watch this story a million times if it checks all the boxes. And this checks all the boxes. And I will say without spoiling things, like there's a pretty interesting twist that's introduced early on that I'm like, that's all I needed to keep this fresh. They've added new boxes, too. They added new boxes, but like it's like, \"All right, cool.\" Like, I I I feel like, spoilers a little bit for my ranking, but like I think this is demonstrabably better than the 2010 one, and I really liked the 2010 one. Um,",
            "start": 1320.56
        },
        {
            "text": "like it's like, \"All right, cool.\" Like, I I I feel like, spoilers a little bit for my ranking, but like I think this is demonstrabably better than the 2010 one, and I really liked the 2010 one. Um, the choreography I thought in this was miles ahead of anything that we've seen in Cobra Kai or the Karate Kid movies. Um, I feel like it was definitely short enough for me to not get too mad at anything. There's a couple bits, more than a couple bits, that I'm like, I wish this was better. like uh there's a lot of really stylized things that are very Timcoded, but I wish that there was like maybe draft four instead of draft two of it. Like some of the way things look, I'm like, \"God, I love what you're going for, but I don't think you quite nailed it.\" Um, but I appreciate them trying instead of just doing the same exact thing again and again and again. Reminds me of Miss Marvel in every way of like when it hits it. You got to keep going a little more going with those with the scribbly",
            "start": 1362.88
        },
        {
            "text": "of just doing the same exact thing again and again and again. Reminds me of Miss Marvel in every way of like when it hits it. You got to keep going a little more going with those with the scribbly motif and then dropping it and you forget it existed and they introduce it again. You're like, \"Oh yeah, that happened an hour and a half ago.\" Yeah. If you don't full commit to that, it smacks with someone be like a producer like, \"We need something extra here, like a little extra flare, and they're like, \"Well, how about we put graphics on it like a Street Fighter? Like, that sounds great. Yeah, let's do that.\" Uh, so yeah, I I thoroughly enjoyed this. And I think the biggest thing I can say of like why I enjoyed it besides just the kind of like top level superfluous [ __ ] of just like the Timcoded style and like the choreography, it's I really liked the characters. I would have never bet that going into this after six seasons of Cobra Kai and that's my squad that I want to see. And if",
            "start": 1406.56
        },
        {
            "text": "Timcoded style and like the choreography, it's I really liked the characters. I would have never bet that going into this after six seasons of Cobra Kai and that's my squad that I want to see. And if it's not them, I don't give a [ __ ] I'm now like I want to see these people with the Cobra Kai kids. Like I care about the the kids that they they gave us. Not all of them. Um but I am a sucker for just a bad guy. that is hilariously bad and just that's all that he generic. Uh he looked like Eric Trump and Yes. I mean it's he looked like so if he looks like Terry Silva had a kid. No, I'm talking about the dad. The dad looked like Eric Trump with like the I thought you meant the kid cuz you you never me like he looks like the Trump kid and I was like well the the bad guy in this looks like Baron Trump and I was like it's Baron. No, no, the other one. I was like no it's definitely looks like cuz he has a slick back hair. I was just thinking about like the slick black hair with the really",
            "start": 1442.8
        },
        {
            "text": "Trump and I was like it's Baron. No, no, the other one. I was like no it's definitely looks like cuz he has a slick back hair. I was just thinking about like the slick black hair with the really bad dyed beard. Yeah. like it just only saying the most evil things possible like but that's karate can check the boss baby but yeah the the the callbacks to the other um iterations of the franchise I enjoyed I don't think that it was too egregious. I don't think that this was just pure nostalgia bait in terms of like got to say every [ __ ] line or whatever. I think it was like all things considered fairly tasteful. And the way that it ends I'm like I'm with Joe. I really want a sequel cuz this could be the fast four of all right, we needed to just get a movie there to connect things so then the next one can actually just deliver on what we want. Um, this kid would whoop everybody's ass. This kid would just [ __ ] destroy everybody's ass. Get him in the seai guy, man. Come on. Tie guy. You",
            "start": 1485.04
        },
        {
            "text": "next one can actually just deliver on what we want. Um, this kid would whoop everybody's ass. This kid would just [ __ ] destroy everybody's ass. Get him in the seai guy, man. Come on. Tie guy. You think they're going to do the psychi ta again after all the [ __ ] they went through the last season? Like this is a massive liability. Uh, but we're now going to talk full spoilers getting the movie. uh get into the entire plot, get into all of it. So, if you do not want to be spoiled on The Karate Kid Legends, go away. Come back later. Uh but if you do, we'll be right back after a word from our sponsors. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stress-filled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep. And you",
            "start": 1525.36
        },
        {
            "text": "Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep. And you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and am loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com promo code kind of funny for 20% off. Before we get to the plot, uh I just want to",
            "start": 1567.4
        },
        {
            "text": "please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com promo code kind of funny for 20% off. Before we get to the plot, uh I just want to open it up to just full spoiler conversations if there's anything we want to say cuz there's two things I got to get to. One, I absolutely loved the postredit scene. Perfect. Johnny Lawrence, he's here in full Cobra Kai effect. Ralph Machio throughout this movie, nothing was like against the character of who he is in Cobraai, but he didn't feel like Cobra Kai Daniel Laruso, right? But you see Johnny, you see him with the Kors banquet and you're like the everything he said, the way they shot it, I'm like, this feels like they're like, \"All right, we're going to make a sequel and it's going to be Copraker Kai.\" And that got me hyped as hell. Going back to what I was saying in terms of uh the twist in the the early part, I really loved that the kid was the sefue for the first majority of this",
            "start": 1616.64
        },
        {
            "text": "Copraker Kai.\" And that got me hyped as hell. Going back to what I was saying in terms of uh the twist in the the early part, I really loved that the kid was the sefue for the first majority of this movie like training this boxer. I'm like this is awesome. Like what a great flip of all of this. And I feel like that was totally not something I expect from watching the trailers from this. In fact, I feel like the trailer trailers are fairly misleading for what this movie is. Like you could take Daniel Laruso out of it entirely. It'd probably be a better movie. Some would argue that they should have taken Daniel Russo out of this entirely. And that's that's a that's a that's a big issue I have with it is that, you know, off the rip they're like, we're, you know, we're moving from from Beijing to the to America. And I was like, oh yeah, of course they're going to move to California. That makes a lot of sense, right? Oh, no, New York. How the [ __ ] are we going to get Daniel Laruso",
            "start": 1663.36
        },
        {
            "text": "Beijing to the to America. And I was like, oh yeah, of course they're going to move to California. That makes a lot of sense, right? Oh, no, New York. How the [ __ ] are we going to get Daniel Laruso involved in this? No problem. Jackie Ch just take a quick flight out across the country when they have 10 days to train for this thing and go recruit John Daniel Russo, who's then going to come a day late. So you figure he's got three days to train him on. None of this makes any sense. From Beijing to New York, then New York to California, then California back to New That's that's awful. That's awful. You can't be doing that to an old body. But we can't do we not remember in Cobra Kai when they went to Barcelona to California back and forth like a billion times. Yeah, but the his wife was pregnant, Joey. The air tunnels, Joe. Like you got jet streams up there. But but you know to to to contrast that and we're going to get kind of nitpicky here, but Cobra Kai set us up for a few seasons of",
            "start": 1701.28
        },
        {
            "text": "Joey. The air tunnels, Joe. Like you got jet streams up there. But but you know to to to contrast that and we're going to get kind of nitpicky here, but Cobra Kai set us up for a few seasons of this is such a ridiculous soap opera that all of the stuff sort of makes sense in it. This movie was a bit more grounded than that. And in fact, the things that I liked about the movie were the grounded moments. I like when he walks into the pizza joint. I like when they call him stuffed crust. I like that. Really, at the end of the day, there's a really good movie here about a kid from Beijing who moves to New York and has culture shock and then gets basically shown around by the, you know, a native Italian, I guess. I assume, uh, cuz they run a pizza joint. Maybe I'm being, maybe I'm reading too much in that, but like I love that story. I love the story of because now I'm thinking I'm like, he's Joshua Jackson. He's not Italian. Really interesting like getting in my brain. You know why Andy?",
            "start": 1738.32
        },
        {
            "text": "much in that, but like I love that story. I love the story of because now I'm thinking I'm like, he's Joshua Jackson. He's not Italian. Really interesting like getting in my brain. You know why Andy? Because I thought it was called Victor and then I was like, no, it's not Victors, it's Victor. That was the Italian point. Maybe it was an Irish guy. I don't know. All long story short is I like that component of this. And when you have those moments where it really is kind of feeling like an indie film of a kid running around and on the scooter and she's showing him around and all this stuff, that's great. And then you have the melodramatic moments that I think are just in stark contrast. Whereas Cobra Kai was always like it kind of started here and then immediately went ridiculous and stayed so ridiculous that it just started breaking your brain in ways that you love where when your brain got put back together it was different and then they show you something else and some kid and then",
            "start": 1779.6
        },
        {
            "text": "so ridiculous that it just started breaking your brain in ways that you love where when your brain got put back together it was different and then they show you something else and some kid and then they get to the Sakai Taikai like why are the platforms floating? Smash Brothers don't ask questions just do this. And so I think this movie kind of tried to to to have some of those elements in it. And I just feel like it's it's just off. And I wish it was just Jackie Chan. And I wish Jackie Chan had just come to be as that. And I I wish they had left Ralph Machu out of this, but they they can't. They have to shoehorn him into this. So why not just have moved to California and study under Ralph? I agree with you so much. New York was so the right call. And it's a great city. And I love I love seeing New York. I love seeing New York as a character. I think all the cinematography of New York is great. I love when two people have to discover New York cuz it's a [ __ ] amazing city and",
            "start": 1815.36
        },
        {
            "text": "I love seeing New York. I love seeing New York as a character. I think all the cinematography of New York is great. I love when two people have to discover New York cuz it's a [ __ ] amazing city and everyone should discover it. But like who are the people on that poster? Turn around. Look behind you, Andy. Tell me the three people on that poster. I can see it already. Uh the main kid, Jackie, Chad, and Ralph Machio. Okay. How much is Ralph Machio in this movie? I mean, we're about 40 minutes in. I was like, 40? Where where's he in? I saw I saw an hour before they bring his ass into this. He's in this movie for five minutes, maybe. All told, 10 minutes maybe all told the screen time. That's wild. That's all we need of him, man. Well, then why all we need? But it's not like we could be crazy. I mean, you got to think hair and makeup was like, boy, was this 40 million. Hair and makeup must have been $39 million. Keep that thing in place. Let's get into the plot and we could uh talk",
            "start": 1852.64
        },
        {
            "text": "crazy. I mean, you got to think hair and makeup was like, boy, was this 40 million. Hair and makeup must have been $39 million. Keep that thing in place. Let's get into the plot and we could uh talk about it thing by thing. It is time for the plot. That dead animal on Ralph Machio's head is beginning to rot. Wow. That's it. Before we got into the plot, okay, earlier today, me and Andy were making fun of Well, we're we're giving Ralph Matcha a little [ __ ] for for the the hairpiece that he's wearing in this movie, and Joey said, \"I didn't notice it.\" And Andy astounding had to walk away. He was so angry. Like, what is Big Wig paying you, Joey? I think that I'm authority where I don't notice the wig work. He walked in and Andy laughed. Audibly laughed. I was, you guys were so giggly at one point of the movie and I kept looking over like they can't possibly still laugh whatever the thing was that I couldn't figure out. We were laughing at the parts of the movie that just are outrageous.",
            "start": 1891.44
        },
        {
            "text": "point of the movie and I kept looking over like they can't possibly still laugh whatever the thing was that I couldn't figure out. We were laughing at the parts of the movie that just are outrageous. First off, we were laughing at the the villain of this movie who is just a [ __ ] ridiculous villain or like the dojo guy. The dojo the the domination bad guy. The guy that looks like Terry Silva and uh and the other kid. You're talking about the kid. The kid. Yeah. Well, both of them. Even the coach being likeach we strike to kill. Yeah. The amount of times we would see the the young bad guy just like outside the window of the pizza place looking in and just like it is so just like wow. They're just [ __ ] doing the thing. Yeah. And also it's this movie does the thing that I [ __ ] hate with me and Tim laughed about. We we laugh about this all the time where it's just like the villain just randomly shows up in places where there's no [ __ ] way he would have been on a subway train with",
            "start": 1941.92
        },
        {
            "text": "me and Tim laughed about. We we laugh about this all the time where it's just like the villain just randomly shows up in places where there's no [ __ ] way he would have been on a subway train with them just out of it's completely ridiculous. bunch of strange things. Well, unless he's stalking them. But what if they're been to New York? But they're all small. But if they're all going to the same school, then like you would think that they're on the same traveling class in New York as she had. They had a scooter, a broken scooter in a random place. In a random [ __ ] place. And the kids just there. And then not only that, we'll get to it. We'll get to it cuz I We'll get to Mr. Han or Mr. Han, right? We're going back to We're in China. We're in Beijing. He's a seiffue master and he has a badass kung fu school. And it turns out that uh Lee Fong, his star student, who also has a brother that died by knife, which this movie, by the way, should have started with that scene cuz that would",
            "start": 1983.44
        },
        {
            "text": "badass kung fu school. And it turns out that uh Lee Fong, his star student, who also has a brother that died by knife, which this movie, by the way, should have started with that scene cuz that would have been great instead of showing us that scene and doesn't matter. Uh turns out his mom who's a doctor is like, \"Hey, guess what? I got a job in New York. We're moving to New York.\" And the kid's like, \"I don't move to New York. I live in Beijing.\" And it's like, \"Oh, okay. We're starting off the story.\" And then Hans, you're skipping the whole opening of this. You're skipping the Karate Kid 2 flashbacks, the explanation of the Miyagi and my families. So, a long time ago in a galaxy far far away, they made a movie called The Karate Kid in 2010, right? Uh they could have it should have been called the Kung Fu Kid, but somewhere along the line, someone was like, \"It won't make money. No one will understand what that is. We have to call it The Karate Kid. What if we revive this IP?\" So,",
            "start": 2023.28
        },
        {
            "text": "called the Kung Fu Kid, but somewhere along the line, someone was like, \"It won't make money. No one will understand what that is. We have to call it The Karate Kid. What if we revive this IP?\" So, they have one literally one throwaway line in that movie where Taraji P. Henson goes, \"Oh, are you are these guys doing karate?\" And and Jaden Smith rightfully corrects her and says, \"No, mom, karate is Japanese. They're doing kung fu, which is a traditional martial art of China.\" He says it a little more shitty like a 12-year-old would, but it gets the point across. That's the one piece of exposition anyone in the in the theater needed to be like, I guess I'll just excuse the fact that karate has nothing to do with this movie at all. Kung fu, close enough analog. This movie starts and gives you a really long narrative as to why that was the case. Uh, Mr. on top of Karate Kid 3 and it looked great on screen. This is all this is from too. They the whole Chinese Japanese Miyagi backstory.",
            "start": 2062.64
        },
        {
            "text": "you a really long narrative as to why that was the case. Uh, Mr. on top of Karate Kid 3 and it looked great on screen. This is all this is from too. They the whole Chinese Japanese Miyagi backstory. This is all from the original movie. Is it really? It looks so good. Wild big screen. But that No, that VO of his was they added to it. But but they tell the story. Miyagi tells the story about the guy the drunk guy original seafue, the drunk guy and ending up in China and all that stuff. Like this is all Karate Kid OG cannon. That's wild. But yes, they did add ADR lines to the Karate Kid 2 scene to tie it in with a Han basically. Yeah. Further vac Wild. Anyway, yeah. Now Han running a whole [ __ ] school from Handyman in 2010. 2025 totally different life. Well, you and I like this and I'll tell you why. Because in the 2010 movie, he was obviously depressed because of the the death of his wife and son. And so he had regressed into No, also not by knife, but car. But the car did have a",
            "start": 2101.96
        },
        {
            "text": "tell you why. Because in the 2010 movie, he was obviously depressed because of the the death of his wife and son. And so he had regressed into No, also not by knife, but car. But the car did have a knife. Um, so I like that we've seen him grow. Well, I like that we've seen him find that passion again for for teaching and for and for being a seafue and and uh you know, it's it's interesting though because anytime you start something like this with a school that looks like a more like a legendary traditional like ancient kung fu school. I'm always conflicted about that cuz it's a fun visual, but I'm also like I don't think that's what kung fu classes would look like in China. It is. Is it? It is. My friend Brandon who does this stuff Yes. Like this is so authentic. Brandon loves Karate Kid 2010 because he's just like there's so much about it about the how they like have the the real schools in China and like he's traveled a million times and it's very different than how they do it here",
            "start": 2149.12
        },
        {
            "text": "2010 because he's just like there's so much about it about the how they like have the the real schools in China and like he's traveled a million times and it's very different than how they do it here and it's like it is a much more it's not a strip mall. Yeah. It's not in a [ __ ] strip mall in the valley. Yeah, fair enough. Uh so we start and and Jackie Chan's there and honestly the second we start you're like I never know how much I miss Jackie Chan until I see Jackie Chan. I'm like we got to have more Jackie Chan. Having said that, Jackie Chan, I love Jackie Chan in the last one. This one, I liked him a lot less. And like I He's great. He's still Jackie Chan, but like we just didn't He's older, too. I get it. But we're not getting nearly enough of the fun Jackie Chan. That's what I want. Yeah, but I don't think that's I don't think that's Jackie's fault necessarily. I don't think it's an age issue. I think there's just too many [ __ ] people in this movie. I think there's I think",
            "start": 2190.32
        },
        {
            "text": "Yeah, but I don't think that's I don't think that's Jackie's fault necessarily. I don't think it's an age issue. I think there's just too many [ __ ] people in this movie. I think there's I think the Joshua Jackson character eats up so much space and he's fine. We'll skip it. We We'll get that. Okay. So, uh uh Leeong is like, \"Hey, man. I don't want to go.\" She's like, \"Well, you don't have a choice cuz I'm I'm Mwen and, uh, [ __ ] you.\" And, uh, this movie is going to under completely. But mom, why were we speaking English? Oh, perfect English. Because I went to a school. My mom No, but what did she respond to? Cuz this is there's an audible laugh from kind of a cringy bad I don't remember dialogue. Like, why are we speaking English? New city, new language. Like, what? Why? What? She said that to him. Yeah. When he's like, \"And and by the way, mom, why are we speaking English right now?\" Like we were just speaking, you know, we're we're it just it was just like a weird like you",
            "start": 2227.6
        },
        {
            "text": "said that to him. Yeah. When he's like, \"And and by the way, mom, why are we speaking English right now?\" Like we were just speaking, you know, we're we're it just it was just like a weird like you sitting in your language. Like you're She's probably like cuz this movie weird thing to tell your son. She's like cuz this movie is supposed to be for kids so they can't read this much even though all the previews for this movie were definitely not appropriate for the Karate Kid Legends. Did you guys clock that? Am I going I'm off the map. It doesn't matter. Yeah, it's okay. There was like a There was one for like an indie film about a parttheid in South Africa and I was like, \"What the [ __ ] is this movie? Why looks incredible, but this is like for Karate Kid. Yeah, it looks very heartfelt. I mean, it looks like it's going to get nominated. Yeah. For Academy Award. Uh so off we go to New York, right? Uh and uh we land and he's like, \"It's a cool I mean, look, this is a nice apartment.",
            "start": 2269.48
        },
        {
            "text": "I mean, it looks like it's going to get nominated. Yeah. For Academy Award. Uh so off we go to New York, right? Uh and uh we land and he's like, \"It's a cool I mean, look, this is a nice apartment. She's a doctor. She's making good money. It's pretty cool.\" He goes, \"You know, I'm going to give it a shot. I'm going to try I I saw a pizza place around the corner. I'm going to go get her something for for for dinner.\" And I like this. This kid's a go-getter. I would have been like, \"Mom, what's for dinner? I would have been a shitty little kid. I will say it wasn't until being in the pizza spot that I was starting to warm up to him cuz even right here when she when she's like, \"All right, well, be careful.\" He's like, \"You know, I'm always careful.\" It's like, \"I don't like this. Strap in. This is going to suck. Yeah, this this kid's going to suck. This movie's going to suck.\" Well, we already got the line, too, where Mnaw's talking to Jackie Chan. She's like, \"You already took one of",
            "start": 2302.96
        },
        {
            "text": "This is going to suck. Yeah, this this kid's going to suck. This movie's going to suck.\" Well, we already got the line, too, where Mnaw's talking to Jackie Chan. She's like, \"You already took one of my sons.\" Or something like that. Like, oo. Yeah. And so of course she I forgot I skipped the entire point of every Karate Kid movie which is that the mom makes the kid promise no more fighting and the kid never listens to that promise. So yes, his brother was killed after a tournament by some bad guys and so he is not allowed to fight anymore. That's very very pertinent. So he goes to this uh this pizza restaurant called Victories Pizza run by one that's right Joshua Jackson Joshua Jackson known for wild Dawson's Creek. I was going to say Dr. Odyssey. There you go. crazy to see him. Now, here's my thing, Nick. I don't I did not know he was in this. I have not seen him on any poster. He was not in the trailer to my recollection. To be fair, I also don't know who this guy is. So, maybe I",
            "start": 2338.64
        },
        {
            "text": "my thing, Nick. I don't I did not know he was in this. I have not seen him on any poster. He was not in the trailer to my recollection. To be fair, I also don't know who this guy is. So, maybe I saw him and didn't like clock it, but like this seemed like a total twist. I had I also, but I don't even know if I really paid attention to the trailer that much cuz I knew I was going to watch it anyways. I don't pay attention to [ __ ] in any movies in this movie. I have no idea how. I have no idea how. That's shocking for you to know that. But I'll tell you what, Josh, let's talk about Joshua. Joey, you guys take a break for a second. Yeah. Joey, let's talk about Joshua Jackson right now. He's having a resurgence, which I a renaissance. Yes, he's and he's looking pretty good. Pretty good. Rare or I mean, let's just say that Dak is a river now, if you know what I mean. Andy. Oh jeez. Um maybe not George Clooney levels of like aging well, but like No, but John Ham levels of aging Well, 100%",
            "start": 2377.84
        },
        {
            "text": "or I mean, let's just say that Dak is a river now, if you know what I mean. Andy. Oh jeez. Um maybe not George Clooney levels of like aging well, but like No, but John Ham levels of aging Well, 100% for sure. Great to see him in this. Obviously very nostalgic, but I think we'll get him in a Nolan movie in the future. Maybe he seems like the type of actor like Josh Hartnett. Yeah, really good. It is weird though because I don't really remember him in that many movies. Like he has that one little bit in screen. Well, he did Fringe for a really long time. But that's not a movie. No, that's what I'm saying. I think he was I think he was on Fringe for like 10 years and I think that just was his career for a while and then he took a break for a little bit and now he's back with Dr. Odyssey and I guess forget Dr. Odyssey. I haven't watched it yet. You I don't have your login anymore. Um, there he is right there. Oh, I did for That's so funny that he gets a character. His character. What was",
            "start": 2418.24
        },
        {
            "text": "I guess forget Dr. Odyssey. I haven't watched it yet. You I don't have your login anymore. Um, there he is right there. Oh, I did for That's so funny that he gets a character. His character. What was this released? I've literally never seen this before in my entire life. It's also French. It looks like it says that it's coming out on August 13th in the cinema. Um, it's what was it? Was it pizza place was called Victories though, right? I don't know. Victor name Victor. Victories. Victory was the um production name of this movie. Interesting. Pizza looks great. That's actually a great name. They should call the next one Victories. Uh well, here we meet Satie Stanley uh whose character Mia is the daughter of Victor. And uh this to me is the heart of the movie. These kids have great chemistry together. She's great. I love the little line too where Joshua Jackson and the other the older there's always the older guy that's got the apron that barely fits and every it's got to it's like",
            "start": 2455.76
        },
        {
            "text": "together. She's great. I love the little line too where Joshua Jackson and the other the older there's always the older guy that's got the apron that barely fits and every it's got to it's like every Italian sit at the counter and he looks over and he goes he goes when did you get charming and she's like well somebody has to be and it's like oh this is a good little back and forth I like this I also appreciate that they didn't do that I think that might seems like they're only putting him on like the foreign international like posters I wonder why they're like we got to get a boxer on this thing which makes no sense because he is a in America. So if you promoted it that Joshua Jackson was in this, some people like [ __ ] Mighty Ducks is definitely where I know him most from. That's true. Oh yeah. I mean also has not seen I love how Tim just Tim would have [ __ ] loved Dawson's Creek back in the day. Tim would have been a Tim would have loved the Mighty Ducks. Oh, he he will. We'll get",
            "start": 2503.44
        },
        {
            "text": "yeah. I mean also has not seen I love how Tim just Tim would have [ __ ] loved Dawson's Creek back in the day. Tim would have been a Tim would have loved the Mighty Ducks. Oh, he he will. We'll get to the Mighty Ducks one day because eventually they're going to do a Mighty Ducks like cover. Never the most Tim Gettys ass series of all time. Well, if we do Mighty Ducks, we have to do Major League One and two deal. Are we also doing the Sandlot? Yes, I have seen Sandlot. Lee struggles to adjust uh and is unable to make friends at school. He meets Le Mia uh and this is where he helps her out with the cans. And so this is where we first get uh some of the like style of this movie that I was talking about earlier where it's like it just doesn't fully work. We're getting a lot of comic style panel transitions, the overuse of montages, which like hey, I'm not going to get mad. It's a Karate Kid movie. We're going to get some [ __ ] montages. But they montaged the school stuff in a way that it",
            "start": 2542.64
        },
        {
            "text": "transitions, the overuse of montages, which like hey, I'm not going to get mad. It's a Karate Kid movie. We're going to get some [ __ ] montages. But they montaged the school stuff in a way that it was, \"All right, cool. Time's passing.\" But I didn't really get any story from it. I didn't really get any like I couldn't tell that he was struggling, Tim. You know, like we're supposed to know he's a fish out of water. He's, you know, well, most like it just was people not talking to him. It was just people like your first [ __ ] day. They don't know who you are. It was weird. I So, I didn't love that. And this was one of the f first uh instances of one of the most overused things I've ever seen in one single movie which is like every time a license song played at some point something would happen where it slows down and it doesn't record scratch but it like yeah they did that twice and then it comes No, they did it like five times. I recognize in fight scenes they did it twice, but they",
            "start": 2585.6
        },
        {
            "text": "where it slows down and it doesn't record scratch but it like yeah they did that twice and then it comes No, they did it like five times. I recognize in fight scenes they did it twice, but they would do it for like non-fight scenes like in the montage like for like a dumb little like the locker closes and it like it was just very overdone. Okay. I I especially noticed it when the gas ran out on the moped and then in another sequence I forgot. Greg's in the chat. Greg, I'm sorry, Greg. Day eight dollar short. That's been asked and answered already. We made fun of me already because I tried to make fun of Tim's white jacket and Andy decided to deflect it back over here and now it's on me too. I just expect Nick to have a clipboard like looking at vending machines being like, \"Okay, that's seven on the Mountain Dews.\" Like, Greg's asking if Nick's heading to the church barbecue in the chat. It's okay, Greg. It's okay. Thank you for the dunk. I appreciate it. Also, thank you for wearing",
            "start": 2626.96
        },
        {
            "text": "seven on the Mountain Dews.\" Like, Greg's asking if Nick's heading to the church barbecue in the chat. It's okay, Greg. It's okay. Thank you for the dunk. I appreciate it. Also, thank you for wearing your 40th Ghostbuster shirt yesterday. Um, idiot. I like the scene, by the way. I like I like where she's, you know, we get this great we get this scene where she's got the cans and then she's got to go buy I don't know if it's here now, but I'll say it anyway. She gets to go buy uh a piece of machinery uh in a Chinese store and the lady wants to charge her 650. And we have a great moment where he's like, \"Hold on.\" And he talks to her and he says, \"I'm from Beijing, whatever.\" And she lowers the price and he goes, \"Look, if you just learn a little bit of her language, I think that would go a long way to show a little respect and she'd probably give you like the locals deal.\" And then Mia goes, \"Well, I am a local cuz I'm a local New Yorker.\" He goes, \"Well, you're not a local here.\" And",
            "start": 2667.28
        },
        {
            "text": "long way to show a little respect and she'd probably give you like the locals deal.\" And then Mia goes, \"Well, I am a local cuz I'm a local New Yorker.\" He goes, \"Well, you're not a local here.\" And I I like that dynamic. And that to me that to me is like the heart of this movie. I like the story of the kid moving from from Beijing and to to New York and being shown around. I think all this stuff is great. And he's like, I'll teach you Mandarin if you teach me the city. Teach me in New York. She's like, I can't teach in New York. He's like, yeah, yeah, you can. Let's do it. It's fun. It's cute. Hop on the scooter. Yeah, he's got it, you know. Yeah. And all of this for whatever reason. And and I'm thinking to myself, man, this really just reminds me and I don't know why. Actually, I know exactly why. Cuz Peter Parker's always delivering pizza on a scooter in the first Sammy movies, right? This all reminds me of of Spider-Man and that's all great. I love all of it. And then at one point",
            "start": 2702.0
        },
        {
            "text": "why. Cuz Peter Parker's always delivering pizza on a scooter in the first Sammy movies, right? This all reminds me of of Spider-Man and that's all great. I love all of it. And then at one point she goes, \"Doesn't she call him like the the Asian Peter Parker or something like that?\" Yeah. The dad called Chinese Peter Parker. Chinese Peter Parker. Well, it's because he does the [ __ ] crazy parkour fight against the random guys in an alley. But it's great. And that's all those are all touchdowns that I think are wonderful and make the movie work. Uh but then we go by of course demolition MMA. We kill our opponents. Black and white just like black and white. And you we had a lot of unless you've murdered who is not Zolo. Who was the other kids? What's the other character's name? Robbie Buchanan. So now we meet Connor who is the love child of Robbie and Terry Silva. Silver. I call him Silva. Yeah. Yes, you do. Hey, that's that's Terry Silva. Let you get away with it for the first hour.",
            "start": 2736.96
        },
        {
            "text": "So now we meet Connor who is the love child of Robbie and Terry Silva. Silver. I call him Silva. Yeah. Yes, you do. Hey, that's that's Terry Silva. Let you get away with it for the first hour. Silva's up there. This kid is no disrespect to the actor, but man, they gave him a raw deal. What a [ __ ] terrible one note. Just not believable character in this. We didn't have time for anything else. It's hilarious though because we Yes, we do. We all said the same [ __ ] thing when the moped breaks down. They're on the subway. Uh oh. No, we had already seen them, right? We walked by. They walked by them. They walked by the dojo. And this is where she goes, \"Don't talk to those guys. those guys are bad. And she and she's like, \"Did you used to do martial arts?\" And he goes, \"Uh, yeah, a little bit.\" And she's like, \"Yeah, I can tell you don't really care about it anymore. You've just been staring at this gym full of dudes just like fighting each other, sweaty.\" And you're like, \"Oh, okay.",
            "start": 2776.68
        },
        {
            "text": "bit.\" And she's like, \"Yeah, I can tell you don't really care about it anymore. You've just been staring at this gym full of dudes just like fighting each other, sweaty.\" And you're like, \"Oh, okay. The here where the villains are. We know what the crux of this is going to be, right?\" And yeah, this guy [ __ ] sucks, but he's got the look to suck. And more importantly, he's got the moves. This guy is awesome at fighting, and so is our lead. So having them fight together just looks [ __ ] good. He's awesome. You can't lie that about so many of the other uh back and forths. He's so awesome, Tim, that they have like just flyers of him up in the city. It's amazing. Like the fact honestly the fact that when they fought in the school, the fact like if I'm the principles and people trying to break up the fight, I'd be like that that was awesome, dude. You can't be doing that here. But like you'd be outward outwardly you'd be like, \"Hey guys behavior is unacceptable.\" But when you go home,",
            "start": 2828.8
        },
        {
            "text": "up the fight, I'd be like that that was awesome, dude. You can't be doing that here. But like you'd be outward outwardly you'd be like, \"Hey guys behavior is unacceptable.\" But when you go home, you're like, that [ __ ] was lit. That was awesome. [ __ ] lit. Of course, they're going to fight in the five burrows tournament rises. Was he? He was kid with Apple. Cool. Is that unforgettable? I'm sure Greg remembers. He'll compare it to someone in Man of Steel and Miss Marvel. We We'll skip ahead a little bit here, of course. Uh, as they're showing each other around, the scooter breaks down and, uh, Connor is just a [ __ ] wraith. He's just everywhere. They're on this they're on this subway somehow someway and he's like let's let him pass and and of course Mia stands up and he's like this guy's an [ __ ] but you know you ever make a mistake over and over and over again and then you just got to keep making that mistake. What was the moment that we all audibly went already like the villains",
            "start": 2872.0
        },
        {
            "text": "an [ __ ] but you know you ever make a mistake over and over and over again and then you just got to keep making that mistake. What was the moment that we all audibly went already like the villains are already acting like villain? Was it this moment where he punches him? going to let him go and then he just knocks him in the [ __ ] No, but like even as they walk up and it's like all of everybody else in the scene, you could just blur out because they're, you know, they're extras, but you know those are the villains. Well, I mean, I think it was this because this was the moment that Nick and I were laughing at where it's like, how would they know? How would they find them on the subway and just they come out of nowhere and immediately it's like, okay, we're in the bully mode. Like insane. I laughed so hard because of like [ __ ] already the bullies are like, \"Hey, what's going on?\" Like, but it's it is so funny too cuz you read this you're like I don't know. I guess in the context of",
            "start": 2914.4
        },
        {
            "text": "I laughed so hard because of like [ __ ] already the bullies are like, \"Hey, what's going on?\" Like, but it's it is so funny too cuz you read this you're like I don't know. I guess in the context of the first Karate Kid and I don't know why I don't know why. I just feel like you looked at it and you never thought okay well they're committing assault. But in this one you're like this kid should go to jail. Like the the guy cuz these guys are good at fighting. Johnny Lawrence and Daniel Laruso were just high school kids. Whoa. Watch your mouth. Johnny Lawrence is pretty good at fight. Yeah. Okay. Pretty good. Compare him to this guy. Exact. Oh, yeah. He'll get merked by this guy. Um, of course he beats him up and then they got to go to Victor. Victor's like, \"I'll put some makeup on.\" It doesn't matter. The mom knows. She's like, \"What the hell is going on?\" I told you, \"Don't fight.\" Good stuff, though. Victor good at putting makeup. Why is Victor good at putting makeup on? You used to",
            "start": 2948.88
        },
        {
            "text": "matter. The mom knows. She's like, \"What the hell is going on?\" I told you, \"Don't fight.\" Good stuff, though. Victor good at putting makeup. Why is Victor good at putting makeup on? You used to fight back in his day. I used to be pretty good. But then I had Mia, and Mia was the best thing that ever happened to me. But I had to get something a little bit more uh stable. Except, you know, I'm dumb and I borrow money from lone sharks like this guy O'Shea who was just a just I guess what you call him Trump. Eric Trump. It's called Eric Trump from now on. I'm sure they won't get No, wait, wait, wait. No, I'm saying the dojo guy looked like that's who he borrowed it from. That's who he borrowed the money from. Damn. I didn't know like I totally thought those are two different Holy [ __ ] That's cool. No, no, no. That guy's the bad guy. Yeah. Oh, um I borrowed some money from him. I own back. So now I want to train for this this prize fight or whatever. And I I think this is the part where",
            "start": 2990.72
        },
        {
            "text": "cool. No, no, no. That guy's the bad guy. Yeah. Oh, um I borrowed some money from him. I own back. So now I want to train for this this prize fight or whatever. And I I think this is the part where uh uh he goes to fix Mia's like he can't sleep at night cuz he's thinking about his dead brother who got stabbed and he's like, \"Fuck, I can't sleep. So, I'm going to go downstairs.\" We don't know that yet, by the way. Yeah, but whatever. We learn that here. It's important when we get there and learn it because we'll get there. But, okay. So, he's like, \"Well, I got I'm going to go down and try to fix her scooter because that's what that's what I would do.\" And then, of course, Victor's O'Shea's goons come to tool up Victor and Victor's like, \"I got this kid.\" And Victor gets a [ __ ] 2x4 to the back of that. Who carries a two by? Maybe it was a baseball bat. If my brain was too far, so this kid just [ __ ] pops off and starts and starts beating his ass. But I'm sorry, I did skip a moment",
            "start": 3024.16
        },
        {
            "text": "back of that. Who carries a two by? Maybe it was a baseball bat. If my brain was too far, so this kid just [ __ ] pops off and starts and starts beating his ass. But I'm sorry, I did skip a moment here. I apologize. Where at school, 2 or 3 days later, whatever, next day, he tries to do the [ __ ] dragon kick and Connor just murders, parries the [ __ ] out, counter the hell of it. So that's around there. That is where we actually get the backstory of the the brother and they have their move cuz of course you have the crane kick, you have the high kick, the Jaden Smith does, and then the the tiger kick I think it was called. Um and no, no, no, that was the one. Yeah. Yeah, we'll get there later. But uh the dragon kick is introduced and it is legitimately the coolest [ __ ] thing. This is like you need three ultra bars fold up in a fighting game to pull this one off. This thing I don't I just don't put enough time into the fighting game to understand how this works. It's one of those",
            "start": 3059.76
        },
        {
            "text": "like you need three ultra bars fold up in a fighting game to pull this one off. This thing I don't I just don't put enough time into the fighting game to understand how this works. It's one of those movements that you really only see people pull off unless they're extremely skilled like this. But usually you see movements like this on like the springed floors like in gymnastics. Like it's like how can a normal person flip that many times or in anime like this? It's like some how a human being shouldn't be able to move this way type move. But they're doing it and they're doing it and they introduce it here and it's cool as [ __ ] They talk about the brother dying and all this stuff. And then immediately we're at the school and the kid, the lead is about to pull off the the dragon kick against his opponent. So we immediately get a flashback to him learning the dragon kick from his brother. We've made history in in Karate Kid in Cobra Kai. All right. Every one of these movies, every one",
            "start": 3101.04
        },
        {
            "text": "his opponent. So we immediately get a flashback to him learning the dragon kick from his brother. We've made history in in Karate Kid in Cobra Kai. All right. Every one of these movies, every one of these shows has to have flashbacks to previous moments, previous movies, whatever. This is a record for a scene having a flashback to it because we get the dragon kick introduction and then we get him having the flashback within 30 seconds of it happening. I couldn't believe it. Got to do it. They've never done that in a movie ever. Yeah, was crazy. It was Yeah, it was ridiculous. Either way, this kid gets his face snapped off by Connor who just sees this thing coming from a mile away. Counter the [ __ ] out of counters, puts him on the ground, right? Thanks, dude. Uh, so let's flash forward to this this the best scene I think of the movie, which is this alleyway fight scene where Joshua Jackson gets knocked out and uh, Lee Fong just the lone sharks are here. Just beats the [ __ ] out of",
            "start": 3137.28
        },
        {
            "text": "to this this the best scene I think of the movie, which is this alleyway fight scene where Joshua Jackson gets knocked out and uh, Lee Fong just the lone sharks are here. Just beats the [ __ ] out of these one-dimensional 80s goons that come out of nowhere. Uh, and he's like, \"Man, you're really good at this. Uh, you should maybe you should train me to be I'm I'm a boxer. And if there's one thing that goes really well with the fighting style of boxing, it's kung fu. He just needs to learn speed. Nick, dude, teach me the speed.\" First off, just in that fight scene, I just want to throw out real quick the like the the little tiny Jackie Chanisms of Lee's going to punch the guy, but the guy puts up the trash can to block himself and he stops the punch to be like, I don't want to punch that. So, he like all that stuff is so silly, but so freaking entertaining and like visually appealing when he's doing when he runs off of the garbage cans in this alleyway to then jump on the ladder and",
            "start": 3177.76
        },
        {
            "text": "So, he like all that stuff is so silly, but so freaking entertaining and like visually appealing when he's doing when he runs off of the garbage cans in this alleyway to then jump on the ladder and does that spit around. So [ __ ] awesome, dude. Also, this game, this movie had awesome wire work. Yes. Like I love the sort of midair things that make no sense gravity wise. Yeah, but that momentum doesn't make sense. Yeah. But it was I think it was tastefully done. At no point at one point I was like I had to think was that real or not? And I think that's a sign of really good wire work. Totally. That the specific moment you're talking about was when he jumps off the the ladder, kicks the guy, and the guy lands with his [ __ ] head. Basically paralyzes the guy for life. Uh all that stuff was goes by so fast that you He ran off. He doesn't know he's paralyzed though. It's all adrenaline. It'll set in later. Yeah, the swelling's going to catch up to him. Uh so Victor's like, \"Dude, you're",
            "start": 3218.64
        },
        {
            "text": "goes by so fast that you He ran off. He doesn't know he's paralyzed though. It's all adrenaline. It'll set in later. Yeah, the swelling's going to catch up to him. Uh so Victor's like, \"Dude, you're awesome. You should train me uh to fight.\" And he's like, \"I I need a a seafood.\" Basically, like all the things you told me like, \"This would be cool.\" And and the kid's like, \"Well, I can't do that. I told my mom I I wouldn't fight anymore.\" He goes, \"Well, technically you're not fighting.\" To which if I were Mingwin, I'd pull Victor aside and say, \"You're an adult, okay? I'm his mother. You don't [ __ ] ask him to train you behind my back and take me take him to some weird skezy ass [ __ ] embassy suites ballroom in the middle of New York to pay off your debt to a [ __ ] bookie who runs a place called Demolition Ma. What are you doing? I'm a heart doctor at the heart and the head of cardiothoracic surgery Grace. Yeah. Anyway, how do we tie in Gray's anatomy? It's coming eventually. He",
            "start": 3258.96
        },
        {
            "text": "place called Demolition Ma. What are you doing? I'm a heart doctor at the heart and the head of cardiothoracic surgery Grace. Yeah. Anyway, how do we tie in Gray's anatomy? It's coming eventually. He has to learn the one-inch punch though. He's a boxer and they're introducing the [ __ ] one-inch punch. Like, this is the goofy [ __ ] I live for, man. Yeah, it it was goofy. It was It was also really like there was some great comedic moments when the daughter walks in on this sparring match and to see the like what the [ __ ] is happening here? Like I I just I loved their interactions. I thought they were so playful and fun. It was really really great to watch. Very very good. Uh, at this point the mom, by the way, has given him this SAT teacher who did not need to be in this movie. Um, he grew he grew on me. He starts off with that incredible joke. Yeah. I I didn't love him. Like great stuff in the beginning, but like I feel like I kind of lost him. The moment he started singing",
            "start": 3295.76
        },
        {
            "text": "he grew he grew on me. He starts off with that incredible joke. Yeah. I I didn't love him. Like great stuff in the beginning, but like I feel like I kind of lost him. The moment he started singing Backstreet Boys, I'm like, \"Oh, you're the heart of this film. I love him.\" Okay. He's the secret delight for for Secret Delight. Okay. Do you want to do it now? I mean, it was just a great like for people who aren't going to watch the movie. You're like, \"I don't know how to feel about this kid.\" Right? She's like, \"Oh, he's your tutor.\" And he sits down with the kid and he's got a he's he has a black eye because he just got punched by the bully or whatever. And he's sitting there and it's and he goes, \"Yeah, sorry. My mom like, you know, I'm sorry. She's kind of like the way she is.\" And it's just like a good solid beat of silence. And the tutor kid from um It um goes, \"Did your mom give you that black eye?\" And it just like seriously it was like whoa that's like a really good line of",
            "start": 3345.28
        },
        {
            "text": "just like a good solid beat of silence. And the tutor kid from um It um goes, \"Did your mom give you that black eye?\" And it just like seriously it was like whoa that's like a really good line of comedy. Like I really enjoyed that. Fair enough. Um he's got the SAT kid now and who sort of becomes his deacto wingman sidekick as we go through this movie. But uh we're training and we get the fun training montage with the olive oil sliding across for the oneinch punch. All that jazz. Uh again the the the subplot of this is that Victor needs to pay off this $50,000 debt or whatever it is to O'Shea. the vig has come due, as they say. And so, he's going to go to this tournament or this boxing uh match, maybe two, to go fight again and pay off his debt. And off we go. And this seems cool. I I like the dynamic. And at first, I was like, man, maybe this kid's not going to fight at all. He's just going to be the the Mr. Miyagi to Joshua Jackson. I kind of like that. It's kind of a fun role",
            "start": 3386.24
        },
        {
            "text": "I like the dynamic. And at first, I was like, man, maybe this kid's not going to fight at all. He's just going to be the the Mr. Miyagi to Joshua Jackson. I kind of like that. It's kind of a fun role reversal. It's more rocky than anything else, which is cool. Um, we go and the fight here is fun. It's good. And then of course O'Shea realizes that after uh uh Victor successfully pulls off the one-inch punch through a boxing glove. Uh he's like [ __ ] he might lose. So of course he has his uh you know break his knee, sweep the leg, put him in a body bag moment where he's like starts throwing elbows which is illegal in boxing. It is legal in MMA and is a very good strategy in MMA because you can cut someone's eye. But in this is not cool. And then the ref just there's a moment he pushes the ref. There's a moment that he like tries to knock it like WWE style. So wild. My this is where I start thinking and again I know guys my brain is too analytical for this. You see walk up behind the",
            "start": 3436.64
        },
        {
            "text": "ref. There's a moment that he like tries to knock it like WWE style. So wild. My this is where I start thinking and again I know guys my brain is too analytical for this. You see walk up behind the ref and the crowd's like and the ref has no idea. Yeah. Yeah. But if you throw an illegal elbow in boxing, you usually get a warning. And then if you throw a second one after the ref said stop doing that, you get disqualified. Now Andy, if you if your opponent gets disqualified in a boxing match, who wins the match? I mean, yeah. Like if you're you should lose after all that. Why didn't he get enough money? Yeah. The OA's run this town, Nick, I guess, man. But if the OSHA's run this town, why would they get the money for the tournament that the OSA are clearly running? Do you see what I'm saying? It just get a little itchy. Doesn't matter. It's It's a movie called The Karate Kid where they do kung fu. True. And some karate and boxing. And boxing. So, good scene here, right, where they have",
            "start": 3473.68
        },
        {
            "text": "It just get a little itchy. Doesn't matter. It's It's a movie called The Karate Kid where they do kung fu. True. And some karate and boxing. And boxing. So, good scene here, right, where they have to go to the hospital and Mia's like, \"You have to come with us.\" us and he can't because he's paralyzed with fear because he's seen this scene play about before when his brother was stabbed in a with a knife outside of a tournament in Beijing. It's very heartfelt, very good. Uh uh Ben Wang does a his name right does a great job of uh in this great actor. All this stuff is great. Mia's great and it's good. It puts a nice riff between them that you're like, \"Oh, he's going to have to go really above and beyond to to to really rectify this with her because that's a [ __ ] up thing to do, right? If your dad's being wheeled into into conveniently your mom's hospital um and you don't go. That could be something that someone holds against you for the rest of your life. And so you think to",
            "start": 3515.84
        },
        {
            "text": "If your dad's being wheeled into into conveniently your mom's hospital um and you don't go. That could be something that someone holds against you for the rest of your life. And so you think to yourself, oh, what's what's what does he need to do? Well, he needs to win the tournament to win her affection back. No, he just has his friend play Backstreet Boys up on the cool thing. I some of the solid stuff I really loved was uh the there's a in the beginning there was a lot of when they're in Beijing there's a lot of uh the the students talking to um Jackie Chan and anytime they're speaking in Mandarin like we see the Mandarin characters and we see the English like pop up and like cool stylized stuff and anytime we see like a place with the um Mandarin characters on it would like change into English going through and then they played it in a cool way with this where He's getting FL getting the dad wheeled into the American hospital, but it's having flashbacks to the Beijing hospital and",
            "start": 3558.16
        },
        {
            "text": "English going through and then they played it in a cool way with this where He's getting FL getting the dad wheeled into the American hospital, but it's having flashbacks to the Beijing hospital and it's like going back and forth between the different uh things. That's [ __ ] sick. I I hated this. Like we need to force a way for our characters to have this conflict and I just like I as it was happening I was like please don't go through with this. Like I don't want the conflict to be her being like my dad what are you what's wrong with you? Like I hated that that's the crux of like what this was, you know? Oh, that like he froze when his brother was stabbed, which like what could the kid have done anyway? Which, you know, I understand. I I think the trauma is like more than anything like the main part of it of like seeing your brother be stabbed and killed or whatever. But then, you know, and that line hit when he's like, I let him down. I was like, [ __ ] that. Like, he had just a",
            "start": 3601.96
        },
        {
            "text": "the main part of it of like seeing your brother be stabbed and killed or whatever. But then, you know, and that line hit when he's like, I let him down. I was like, [ __ ] that. Like, he had just a great such a great delivery with it. But then when Mia or what's it? Joshua Jackson. Jackson gets knocked out and Mia is like, \"What are you doing?\" And they're using that as like the Oh, he's he's freezing again. He can't he's not coming through in the clutch. I'm like, \"Ah, yeah. I don't like this. I I I'll disagree. I mean, I liked it. I like the emotion. I I like that the character has hit a low point in this specifically in his in his romance with Mia, which is the B story of this, and then also in the in the the A story.\" Um, and I I think the saving grace for me of this is that line with Joshua Jackson where he's explaining to him like what happened and Joshua Jackson's character like you didn't let your brother down like that wasn't on you like you know. Um I just wish there had",
            "start": 3650.32
        },
        {
            "text": "Joshua Jackson where he's explaining to him like what happened and Joshua Jackson's character like you didn't let your brother down like that wasn't on you like you know. Um I just wish there had been another beat between him and Mia where they did have that reconciliation cuz it feels like they go from her like I'm never talking to you again to she just walks up on the rooftop and is like okay you you put some Pepsi in a in a glass for me and I feel okay with it. which is a high school thing to do. If they treated it like it was that big of a deal, I would have been like, \"Oh, this [ __ ] sucks.\" But they resolved it so quickly and then I'm like, \"Ah, this is to me believable.\" Like, you see her with Connor earlier where she's like, \"Oh, I hate him or whatever.\" And then they're like cuddly the thing. So, it's like I think that's kind of who she is where it's like not that sequence was not great either. That was my that's probably my least favorite element of this where you where",
            "start": 3690.88
        },
        {
            "text": "cuddly the thing. So, it's like I think that's kind of who she is where it's like not that sequence was not great either. That was my that's probably my least favorite element of this where you where it's the dramatic irony of seeing two people at a moment that maybe doesn't read correctly and then not communicating to them. It was led up by a very good moment where she's like, \"You ever make mistakes over and over again? You just don't know why you're doing it.\" So I'm like, \"Wait, so you were with that guy that you went on a date with him that night?\" And then she's like, \"Well, let's make you and I some mistakes.\" And then as a kid who used to be in high school, I'd be like, \"Fuck, I don't.\" Yes. Everything. Every [ __ ] thing. You're everything. There was no chance he wasn't winning the tournament after she said that. Oh my god. Are you kidding me? Uh, this is before the boxing match, too, cuz we had that great moment from Josh Jackson was like, \"What the what? No, no, not now.\"",
            "start": 3727.2
        },
        {
            "text": "the tournament after she said that. Oh my god. Are you kidding me? Uh, this is before the boxing match, too, cuz we had that great moment from Josh Jackson was like, \"What the what? No, no, not now.\" Right. Uh, anyway, so on we go. Someone breaks into the house. He's in a bad place. He's in a bad place. Sefue Shiffue Hanfu is asking, he's calling him and he's not answering. So what does he do? He gets on a [ __ ] plane and he scares the [ __ ] out of this kid by breaking into his house and testing his kung fu ability. And it's a great sequence where you're like, \"Man, read the room. Jackie Chan, I'm really struggling with past trauma that I haven't unpacked here about my brother's death.\" That you didn't stop either. He was [ __ ] there. Where was Jackie J? 5 seconds earlier. Guy had a knife. Jackie Chan like, \"Oh [ __ ] let me get out of here.\" Anyway, how did Jackie Chain get there? So, oh, he had been calling him over and over and over again. I meant at the brother death thing cuz",
            "start": 3758.64
        },
        {
            "text": "Jackie Chan like, \"Oh [ __ ] let me get out of here.\" Anyway, how did Jackie Chain get there? So, oh, he had been calling him over and over and over again. I meant at the brother death thing cuz it was outside of the tournament. So, you imagine they were the coach and him were walking. Maybe he was like, \"Hold on, let me grab my grab my jacket or something.\" I don't know. It's all very It was all very, you know, sort of like washed out. I couldn't really tell what was going on. I digress. Ming Nawin comes home and she's like, \"What the [ __ ] are you doing here?\" And it's awkward and she knows. She's like, \"You can't. You're here to he's gonna have to fight.\" Of course, conveniently, he found the the little flyer crumpled up in Leon's pocket. And he's like, \"The Fight Brothers. This is perfect. You're going to fight in this thing. You're going to get the money that Joshua Jackson no longer needs because again, that boxing organization is legit. They owe him that purse, which is",
            "start": 3801.8
        },
        {
            "text": "is perfect. You're going to fight in this thing. You're going to get the money that Joshua Jackson no longer needs because again, that boxing organization is legit. They owe him that purse, which is $50,000. But I digress.\" And his mom's like, \"I don't I He can't fight. I'm I'm through with him fighting and and Jackie Chan has a great line here you guys will have to help me out with where he's like he's not he's not doing it to fight he's doing it to like overcome to help his friends to help his friends right in Chinese culture we help our friends possible way and he has that great line where he's like you're he's like we have an old saying in in Chinese culture where it's like your friend's problems are your problems so you're going to help your friend and you're also going to get me it back which is dope turned out that was way easier than having to beat the [ __ ] out of five people turned out all it was was an apology and a quick explanation and your friend playing some Backstreet",
            "start": 3843.28
        },
        {
            "text": "which is dope turned out that was way easier than having to beat the [ __ ] out of five people turned out all it was was an apology and a quick explanation and your friend playing some Backstreet Boys does the trick we also talk about the agree egregious Pepsi placement in this movie. Oh, did you do you think Pepsi sponsored this film? All over the pizza place multiple times. It's in this dumb scene. Sony goes great with all this. Sony pictures are always the most egregious product placement stuff. Like there are Tekken 8 posters in every movie, which kind of works though because when we get to the fighting, it is like Tekken, you know, um done on purpose. Tekken, I will say that in the postredit scene, I know I'm jumping ahead. Johnny Lawrence would never allow Pepsi in his establishment. Oh god. Yeah. No. Exactly. No. Oh yeah. You're right. Yes. Yes. Gotcha. Gotcha. Don't [ __ ] this up. So he's like, \"We don't have a place to train.\" And the kid's like, \"I'm rich. I have this",
            "start": 3876.16
        },
        {
            "text": "Oh god. Yeah. No. Exactly. No. Oh yeah. You're right. Yes. Yes. Gotcha. Gotcha. Don't [ __ ] this up. So he's like, \"We don't have a place to train.\" And the kid's like, \"I'm rich. I have this [ __ ] Harry Osborne style mansion, but like rooftop deck I I I I used to train carrot pigeons and not get laid.\" And so he's like, \"This is where we're going to go train.\" And Jackie's like, \"Okay, but we we're missing one element here. I am arguably the greatest martial artist to ever be on the silver screen. I have had a career that spans from the 70s all the way till 2025. But you know what? We need Ralph Machio for this. We need some karate team. We got to go get the We got to meld Miyagi Do Karate with Han Kung Fu in a true melding of the families to tie this back into Karate Kid. So, he flies out to to to Rita. Mhm. And uh this is how much of a sucker I am. He walks in to his old friend's house. What song do they play? California Love. Oh, is it California? Oh, yeah. Walks in though,",
            "start": 3919.92
        },
        {
            "text": "out to to to Rita. Mhm. And uh this is how much of a sucker I am. He walks in to his old friend's house. What song do they play? California Love. Oh, is it California? Oh, yeah. Walks in though, takes his shoes off. Hello. Is he here? Looks over and he sees a picture of Mr. Al. How does he just walk like how does when when Laruso walks in, how does he not be like, \"Who the [ __ ] are you?\" Like, he knows him. He knows him. You have to imagine they know what they've already introduced himself. No, no, but he was like, \"Are you a friend of Were you a friend?\" Oh, that's right. He said, \"I'm sorry to tell you Mr. Miyagi passed away a while back.\" He goes, \"I know.\" Wouldn't it be weird seen a stranger in this place? For sure. Yeah, 100%. Yeah, but not when that stranger's Jackie Chan. If Jackie Chan had walked in here, I'd be like, \"That's [ __ ] Jackie Chan. I would definitely call your attention to Yeah, you would. But to dial it back, he looks at the picture of Mr. M goes, \"Hello,",
            "start": 3967.92
        },
        {
            "text": "Jackie Chan had walked in here, I'd be like, \"That's [ __ ] Jackie Chan. I would definitely call your attention to Yeah, you would. But to dial it back, he looks at the picture of Mr. M goes, \"Hello, friend.\" And I start crying. It's good stuff, dude. It's good stuff. Um, check the box. I mean, that box is checked. Uh, so he's like, \"Listen, man. I need you to come out and train this kid.\" And he's like, \"When's the competition?\" He's like, \"Tomorrow.\" I was like, \"What's the point?\" Not literally, but pretty much literally. Yeah, it's tomorrow. No, but see, here's the thing. Like, as dumb as all that is, I think they did a more than serviceable job of just being like, \"Yo, this kid's [ __ ] good. He doesn't really need hella training.\" Like, we just saw half this movie. He was the Sefue. Like that means a little bit of like uh let's get him to figure out what you just said right there Tim may as well have been in the in the script. Hey, like Jackie Giant looking Dussa going, \"Yo,",
            "start": 4012.56
        },
        {
            "text": "Like that means a little bit of like uh let's get him to figure out what you just said right there Tim may as well have been in the in the script. Hey, like Jackie Giant looking Dussa going, \"Yo, this kid's hella good. He doesn't need hell training.\" Like I mean, they show the they show him like, \"Do hey, do some [ __ ] do a flip.\" And he does it and he's like, \"Look at that shit.\" And D is like, \"Damn, all right, a week is all I need.\" And you know, this this the rest of the sequence, the rest of this movie plays out very much um like I I want to say it's Rocky six, Rocky Balboa, where remember he no longer has Mick as a trainer. He takes Apollo Creed's trainer uh on who I can't remember the doc I want to say is his name and he goes listen you're old and you're slow and you ain't got [ __ ] going for you. So what we're going to p what we're going to do is we're going to focus on blunt force trauma. Remember that line where he's like you're just going to hit this guy really [ __ ]",
            "start": 4050.24
        },
        {
            "text": "[ __ ] going for you. So what we're going to p what we're going to do is we're going to focus on blunt force trauma. Remember that line where he's like you're just going to hit this guy really [ __ ] hard. This reminds me of that because they're like you can't beat this guy so we have to outsmart this guy. And he says and I quote it's time to go catch a tiger. I love that because they're like we have to trap this guy. We have to figure out what the trap is. And that's where Louisa comes in cuz he doesn't know it yet. But then they tell him the story of the dragon kick and how this guy totally [ __ ] kicked his head off with it and he goes, \"Ah, that's how we're going to catch.\" The bragging the the brother's move was the dragon kick. Your move is the tiger trap. Holy [ __ ] we're cooking. That's cooking. And so of course they take him to the subway sequence which I'm like they totally would have got arrested for this. But I love the lady was like, \"How long is this [ __ ] going to be",
            "start": 4095.44
        },
        {
            "text": "That's cooking. And so of course they take him to the subway sequence which I'm like they totally would have got arrested for this. But I love the lady was like, \"How long is this [ __ ] going to be doing this [ __ ] for?\" We asked the dragon kick and going to own one of the turn styles and I was like this is pretty cool man. We kick off the the Five Burrows tournament and I really just and again maybe it's just the old person to me. I just wish this was a little less extra. I wish it was just more like the All Valley tournament. In fact, when they said it, I was like, \"Oh, it'll just be all the karate people from the Buroughs come to this place and they do a tournament, right?\" No. Got to take it to the streets. Take it to the streets. And it again reminds me of Rocky 5, which was the worst Rocky because they didn't even have a fight in a ring at the end of Rocky 5. They just fought outside the [ __ ] bar that Rocky was getting drunk at the entire time. Not fun. I didn't like these.",
            "start": 4132.0
        },
        {
            "text": "Rocky because they didn't even have a fight in a ring at the end of Rocky 5. They just fought outside the [ __ ] bar that Rocky was getting drunk at the entire time. Not fun. I didn't like these. I like more pomp and circumstance. I like when it's in one place so that you can build round after round after round up to that moment where the two the bad guy and the good guy square off. But I guess they were like, \"No, no, no. We'll save the budget for the skyscraper fight.\" I'm completely on the other side of you on this, by the way. Like, we've seen so many of these movies. We've seen the valley space literally so many times, especially if you watched the uh Cobra Kai. Um we saw the Sekai Takai of them doing Smash Brothers in around the world and all this stuff. I love that this was like let's use New York. It's the five burrows. We're going to each burrow. There's obviously a community around this of crowds that are into this [ __ ] Um and I loved how stylized it was. I love how fast",
            "start": 4169.36
        },
        {
            "text": "use New York. It's the five burrows. We're going to each burrow. There's obviously a community around this of crowds that are into this [ __ ] Um and I loved how stylized it was. I love how fast it all was. Like we didn't have time in this movie to introduce all these characters. the [ __ ] the the queen's tornado or whatever it was. Like the names of these people are so [ __ ] so damn good. Again, these are good fighters. We saw just enough for I feel like we got the story that we needed to. This was about getting the two guys together to fight on a goddamn roof of a skyscraper and it was awesome. This fight's great. So, we'll kick this off, right? Me uh his mom comes back and she's like he's like, \"Mom, I'm sorry. I I have to.\" She goes, \"You're not doing it alone. You're fighting with me. I'm here.\" Uh, we get uh Daniel giving him the the bandana, the headman. Hell yeah, man. And I in the trailer, this scene played a lot more emotional and a lot more like uh hey, this is like a",
            "start": 4210.72
        },
        {
            "text": "me. I'm here.\" Uh, we get uh Daniel giving him the the bandana, the headman. Hell yeah, man. And I in the trailer, this scene played a lot more emotional and a lot more like uh hey, this is like a spiritual thing. In the movie, I actually preferred it a lot better. This was just the kind of set off to the hype montage of like getting through this stuff. And that was him cementing the two worlds together. We we get the the bit of Jackie Chan and Ralph Machio kind of like fighting over which style is better, right? Between the karate and kung fu and like just throwing him as like a It was so funny. Like that is what I love the most about the Jackie Chan fight stuff and the goofy Cobra Kai Karate Kid [ __ ] Mwen going, you know, um I guess I'm fast forwarding a little bit, but like we're doing this. You're not alone. Yeah. And I expected like we brought your brother back from the dead. Whoa, mom. [Laughter] So, we start off and this fight is uh is a very well choreographed fight. I think",
            "start": 4248.48
        },
        {
            "text": "this. You're not alone. Yeah. And I expected like we brought your brother back from the dead. Whoa, mom. [Laughter] So, we start off and this fight is uh is a very well choreographed fight. I think that this kid that plays Conor Day is a great fighter. He's got he moves well and these two [ __ ] you know it's the your classic fight where he gets overwhelmed at first and then he starts to figure out the timing and like you know I forget what the lynch pin was for it or the fulcrum point was but then he starts getting points on the board and we're like so it it also to dial back to my my criticism of why I wish it was more in the arena setting. I think it's difficult to understand the rules of of each fight unless there is literally I'm I'm dumb a ref who's like okay here's the rules for the next round. That's so weird because I feel like this is by far the clearest that points have ever been because the points are literally on screen as the hits. That's what got the point there. That's",
            "start": 4296.96
        },
        {
            "text": "next round. That's so weird because I feel like this is by far the clearest that points have ever been because the points are literally on screen as the hits. That's what got the point there. That's but the rounds prior to this were first of three wins. This round was it's timed most points wins. Which I figured out eventually, but I was like who installed that scoreboard? My favorite part about this um was my theater experience and at one point a point is scored and I in my peripheral vision see Nick sitting to my left and like an angry sports fan looks at like I see him look at me to be like what the [ __ ] was how how did that score a point you know like I the karate in him the martial artist in him was like that that come on like he looked at me as for a reaction Like that couldn't have been a point, right, Nick? Like, well, I'm just trying to figure out what I felt the anger there because in the other match there's a point was any contact and in this one it was like you have to",
            "start": 4339.36
        },
        {
            "text": "been a point, right, Nick? Like, well, I'm just trying to figure out what I felt the anger there because in the other match there's a point was any contact and in this one it was like you have to knock the dude down and basically kill him to get the point, right? It just there was a little bit of like you throw a challenge flag in there. That's there was one point where there was one point where he kicked him in the back of the head. I was like in every tournament a back of the head kick is an illegal kick. That's a DQ. I digress. This is why you have this is why when we do our karate competition, the all bay karate competition, you have to save the soul of the Bay Area. Yeah. We're going to have rules that are posted online and we're going to have judges that actually refs that actually sit and step in. Okay. At at one point uh when Joey was uh earlier in the podcast mentioning the the giggly nature of uh sitting next to me and Nick one time uh I guess near the beginning of the",
            "start": 4388.96
        },
        {
            "text": "sit and step in. Okay. At at one point uh when Joey was uh earlier in the podcast mentioning the the giggly nature of uh sitting next to me and Nick one time uh I guess near the beginning of the movie, Gia arrived a bit late. Mhm. And as she's walking up, Nick was like, \"Hey, hey J.\" You know, the movie had already started by this point. And then I kind of whispered to him, \"Who is that?\" Yeah. Which was the kind of funny podcast, too. Mid-con conversation, Nick Dick saying, \"Who is that?\" as somebody just kind of poked their head in because the dude did the hot fuzz thing. He poked it around the corner and did it again. I was like, \"Who is that? Is that someone Andy, I'm sorry.\" And I also laughed at Nick when he said, \"Uh, they're going to fly off the skyscraper.\" Didn't you think that was going to happen? So highf flying. Yeah. Couple things we should talk about. one, the dude sitting next to Gia who kept blowing his nose the entire time. I like we don't have the time to get into",
            "start": 4422.4
        },
        {
            "text": "was going to happen? So highf flying. Yeah. Couple things we should talk about. one, the dude sitting next to Gia who kept blowing his nose the entire time. I like we don't have the time to get into all the details of our theater experience. But I will say I've never been in a movie with the amount of different groups having conversations the entire time, including this uh older couple next to to me and Gia who talked the entire time. Um one of them didn't know what movie they were seeing. So when you guys, oh this is a Karate Kid movie, like oh it was just like oh my god. Guys, I remember him at the end. He was like, \"See, that guy's the guy that was the bad guy in the first Karate Kid.\" I was like, \"We're too [ __ ] This is not the one you introduce people on, bro.\" And God, they blew their noses so many times and the most inappropriate times. And there was one where there was like a emotional sad moment happening and this guy blew his nose and it sounded like he was emotionally",
            "start": 4468.48
        },
        {
            "text": "their noses so many times and the most inappropriate times. And there was one where there was like a emotional sad moment happening and this guy blew his nose and it sounded like he was emotionally wrecked. But it's like there's no chance. There's no chance that you were this moved by this. I thought it was somebody making a fart noise. I thought it was somebody doing like a like fart noise. That was That's how loud it was. Um, but I do owe Andy an apology because I started this off by saying we were going to talk about it, Andy, and I glossed right over it. Let's dial it back 20 minutes earlier. Mr. M, Mr. Han gets out of a taxi cab, walks in, sees the picture of his dead friend. Beautiful emotional moment for me. I'll watch if I watch the movie again, I'll cry again because I love that. It's tearjerking. And then, uh, Daniel Russo walks in. He goes, \"Hey, excuse me. Can I can I help you? And the camera cuts over to him. And Andy, I waited a moment because I was like, just be mature.",
            "start": 4509.04
        },
        {
            "text": "It's tearjerking. And then, uh, Daniel Russo walks in. He goes, \"Hey, excuse me. Can I can I help you? And the camera cuts over to him. And Andy, I waited a moment because I was like, just be mature. Don't be yourself. Don't ruin this experience for everyone else in the theater like Joey is when she looks at her phone five times. Um, yeah. What was up with that, too? Did I look at my phone? Minimum. I think I said, \"Don't ruin this.\" And then I hear Andy laugh. Because Ralph Machio's hair in this movie is egregious to me. You have to admit it. No. No. Look, I have to admit it. Let yourself gray, Ralph. It's okay. I'm with Joey in the sense that like I do not look at this and go, \"That's a wig.\" I will say I look at it and go, I hate his hair. So, I guess like what are your thoughts on his hair, Joey? I just don't look at people's hair, I guess, that intensely. I I Is it a weird I'm not mad at you for this, guys? Wigging out with Scarpino. I don't know what this is, ladies and",
            "start": 4551.68
        },
        {
            "text": "on his hair, Joey? I just don't look at people's hair, I guess, that intensely. I I Is it a weird I'm not mad at you for this, guys? Wigging out with Scarpino. I don't know what this is, ladies and gentlemen. We're in a new chapter of our lives here. Can you bring up the Karate Kid Legends trailer? The scene that we're talking about is in the trailer. It's like somebody just looked at Ralph Machio and took like a big brush on Photoshop of the black color and just like drew an oval around his head. It is just it's it's just one color. That that to me is the is it's less about the hair itself because look, people go bald, whatever. It's the fact that they dye the hair and it's it's so dark. It doesn't match his face. Like it's okay to It's like Have you seen George Clooney recently where he was doing that play on Broadway and he had dark black hair and it looks he looks like a muppet. He was awful. Yeah, it's awful. And he knows he looks awful. That interview was funny. Here. Here we",
            "start": 4605.68
        },
        {
            "text": "he was doing that play on Broadway and he had dark black hair and it looks he looks like a muppet. He was awful. Yeah, it's awful. And he knows he looks awful. That interview was funny. Here. Here we go. Ready? We're here. And then look at that. What? What? It looks like Does it look like hair a little bit? But like Zap Valley. But here's the thing. For Christ sake, how old is this man? I would say this is maybe the best it looked the whole movie. It just got worse. It got bigger. It just looks like too dark. Is that the only thing? That's my biggest my That's my biggest criticism of it. It's also It's also It's also the comb over starts at the ear line. It's also like a very boyish kind of young child haircut. Is that what he always has? Like he's 63 years old. other pictures of him. Like look at Jackie Chan. Let's look at Jackie Chan when he walks in. Kevin, can you pull that back up? How old is Jackie Chan? How old Jackie Chan? Look at Pause. Look at Jackie Chan's hair. Okay, so",
            "start": 4649.2
        },
        {
            "text": "look at Jackie Chan. Let's look at Jackie Chan when he walks in. Kevin, can you pull that back up? How old is Jackie Chan? How old Jackie Chan? Look at Pause. Look at Jackie Chan's hair. Okay, so this is him. This is real him. Hey then it's just crazy dye then cuz there's like brown hair. I'm just saying look at how lovely his salt and pepper hair looks, Kevin. Look at how he's balding a little bit and it doesn't matter because he's in his 70s. We go back. What do we need? I need to see Ralph Machio. Yeah. Okay. I see it. Now that I'm looking at other pictures of Ralph Machio, I understand, but I also don't know that I could have picked it out of Well, that's my job here, Joey. My job is to point things out. Uh, I digress. Uh, we go there and he does the drag. He's like, \"It's fine. It's time, man. Now's your time. This is where you trap him and Sn the Tiger, right?\" And so, yeah. Look, it's too dark. Um, why do you think it's What's the What's giving you the contrast that makes you",
            "start": 4699.52
        },
        {
            "text": "time, man. Now's your time. This is where you trap him and Sn the Tiger, right?\" And so, yeah. Look, it's too dark. Um, why do you think it's What's the What's giving you the contrast that makes you think it's too dark? Uh, the sides. Look at my hair. You see how I have gray on the sides? Oh, you look at Tim's hair. Tim's got a little gray on the sides. He has it there. This is before someone took a Sharpie to his head. It's just It's He's a man in his 60s. Take a page from Joshua Jackson. The gray's hot. The gray is [ __ ] sexy. Go silver. Tim's going to have that full head silver hair and it's going to piss me off because I'm going to look like a [ __ ] thumb. I don't He does a dragon. He does the dragon kick tiger trap, which essentially is just sweeping the leg. And it's awesome. Like this move looks so damn good. And I love that it ties back to Karate Kid. Like just this is what this movie needs to be. Sweep the leg. And then Connor goes, I'm going to be a [ __ ] dick. I lost.",
            "start": 4749.12
        },
        {
            "text": "this move looks so damn good. And I love that it ties back to Karate Kid. Like just this is what this movie needs to be. Sweep the leg. And then Connor goes, I'm going to be a [ __ ] dick. I lost. and and and O'Shea's like, \"You got to [ __ ] you know, actually we missed the beat where OSHA told him to murder him where he knocks him out and then and then Lee Fong wakes up probably concussed.\" Uh, he wins and then Connor's like, \"I'm going to [ __ ] him up one more time.\" And Lee's like, \"No, I know what's coming.\" And puts him on the ground, mounts, and then goes, \"I'm going to [ __ ] kill this kid with my hand.\" And Conor's like, \"Oh.\" And then and his mom's like, \"No.\" It goes bam and just punches right next to his face. Show mercy. And at first I thought go honk. But he didn't. Thank God. That would have been a bridge too far for me. Yes, it would have. that with Machio's hair, I would have walked out of the theater and never gone back. Uh, and then Connor's like, \"Hey, man, you're",
            "start": 4795.76
        },
        {
            "text": "That would have been a bridge too far for me. Yes, it would have. that with Machio's hair, I would have walked out of the theater and never gone back. Uh, and then Connor's like, \"Hey, man, you're cool.\" He pulls he pulls a Lawrence where he's like, \"You're pretty okay, man. We're going to be best friends now.\" But then he walked off still pissed off, which is like natural. You know, he's an athlete, disappointed. I also do want to point out that, and Tim, of course, this will be clearly stated when Joey and I do the Bay Area All Valley tournament. But if you are able to wrap your hands in a martial arts fight, you 100% should wrap your hands in a martial arts fight. That makes your punches so much [ __ ] harder. So much better. You're essentially layering it up like a cast and punching people in the face. Just for point do we do sanction this or we don't? No. Okay. No, we want we want kids to break their fingers. Okay. We want them all walking away having to have ligament surgery in",
            "start": 4832.48
        },
        {
            "text": "in the face. Just for point do we do sanction this or we don't? No. Okay. No, we want we want kids to break their fingers. Okay. We want them all walking away having to have ligament surgery in their fingers. That's what we want. It's done. You've won the day. I forget how this movie ends. Postredit sequence. Oh, right. Yada yada yada. Postredit sequence. We go back to Reita now. No, no, no. We're at the pizza place. They added a new type of pizza. The stuffed crust. Stuffed crust. Which, by the way, this karate name, stuffed crust. That was amazing. Awesome things all around here. You did make us laugh every time they said it. Every single time. And yeah. So then then we get the All right, we got to send a pizza to to our friend. We get California love again. And then we get a a uh pizza delivery to Daniel Laruso. And he $1,000. I didn't order a pizza. And then it's like, oh, it's a thank you from New York. All that. And yeah. Then what happens, Andy? Oh my god. I mean, he we see",
            "start": 4870.4
        },
        {
            "text": "delivery to Daniel Laruso. And he $1,000. I didn't order a pizza. And then it's like, oh, it's a thank you from New York. All that. And yeah. Then what happens, Andy? Oh my god. I mean, he we see him. It's like the best part of the whole damn movie. Johnny Lawrence. Johnny William the Zap Zapka there. Just banger of lines that don't hit, but it's fine cuz he's saying them and it's great. Every possible pizza Miyagi Do pun to be fair. Miyagi maybe. Miyagi dough. Yeah, that I think that hit. That hit. Yeah, I I apologize. That actually did hit for me. And then Alvasio's like that's super disrespectful. That's pretty funny. The pizza is so good. It's so good. General existence just makes me happy. I just love that it was in line with Cobra Kai. Like this this is like all right firmly this takes place like we know they said 3 years after Cobra Kai series ends. So seeing them together I'm like I [ __ ] believe this and this makes me so excited because if we get a sequel I am praying beyond",
            "start": 4912.56
        },
        {
            "text": "place like we know they said 3 years after Cobra Kai series ends. So seeing them together I'm like I [ __ ] believe this and this makes me so excited because if we get a sequel I am praying beyond hope that it is simply called the Karate Kid Cobra Kai. [ __ ] That's it. It writes itself man. It it could be. It could be. I hope it here's my thing. I I didn't particularly care for this film. Um, as you probably have noted in the last hour and a half. Uh, but I hope it does well because I the five seconds that they were sharing the screen again, it I want that forever. I just want these guy I want Zapka to have a career forever. I just want them all these two guys to just do more of of of Karate Kid and continue iterate it. So, if this is the Fast and Furious 4 that gets us to five and six, I would be okay with that. I can't believe Jaden Smith wasn't in this movie at all. The only references to him period were the jacket on, jacket off, which was what Mr. Han kind of like learned from",
            "start": 4961.68
        },
        {
            "text": "I would be okay with that. I can't believe Jaden Smith wasn't in this movie at all. The only references to him period were the jacket on, jacket off, which was what Mr. Han kind of like learned from him to teach him. But then also he does quote Jaden Smith with the if you get knocked down, you get to choose to get back upline, which was Jaden Smith. I'm like, that's kind of that's kind of sick. So, it is all canon. But I can't believe he wasn't here. I know he's not acting anymore, but like a cameo or something. Well, you imagine Dre is still in Beijing, right? still training with Jackie Chan probably for sure I thought there was gonna be a moment where he's like hey man have a good like you know you'll love New York or whatever that's where I'm from or actually I think they were from Detroit but still you're right yeah but maybe well they got to go here's what we got to do we got to we got to start a campaign for Will Smith to get involved in the next one so we can cast Jaden and",
            "start": 5006.56
        },
        {
            "text": "Detroit but still you're right yeah but maybe well they got to go here's what we got to do we got to we got to start a campaign for Will Smith to get involved in the next one so we can cast Jaden and rank and the why I said it that way for Ragu Bagu Ragu Bagu What's up everybody welcome to Rad guys talk bad guys a podcast within a podcast where we talk about the villains of the Karate Kid universe. Tim, take it away. So, here we are. Uh, we have four movies currently that we have bad guys for. We need to slide in Karate Kid 2010 and Karate Kid Legends. At number one, we have Terry Silver, Crease, and Mike Barnes from Karate Kid 3. We have Johnny Lawrence and Crease from Karate Kid 1. We have Chosen and Seaitto in Karate Kid 2. And then we have Dugan and Ned from the next Karate Kid. Walter Gogggins. These go to the bottom for me because like they were entertainingly bad, but Dugan and Ned being 40 year olds in in high school working for special ops, like it was hilarious. I will never",
            "start": 5044.56
        },
        {
            "text": "Gogggins. These go to the bottom for me because like they were entertainingly bad, but Dugan and Ned being 40 year olds in in high school working for special ops, like it was hilarious. I will never forget them dropping in from the ceiling. Yep. I'm kind of there, too. I think in terms of sheer martial arts quality, I'd put this guy pretty high, but uh it it's it was just a little too bare bones. Uh, and I don't think that we'd actually truly stand by it if we had to watch them back to back, Andy, of like if we watched Next Karate Kid last week, I think we would have been like, they're below this. But, but I'm with you because the this is a vibes thing. How iconic them coming down in the gym was, I'll never forget. This guy would be I mean, this squad would be a lot higher if the dad and the kid were even more assholeish, but they were just like they just kind of barely hit the threshold. I was going to put Trump's kids. Yeah. Yeah. Yeah. Karate Kid Legends. Where are we going to put",
            "start": 5092.6
        },
        {
            "text": "the kid were even more assholeish, but they were just like they just kind of barely hit the threshold. I was going to put Trump's kids. Yeah. Yeah. Yeah. Karate Kid Legends. Where are we going to put um The Karate Kid 2010? I think it's below that. No way. I think it's above it. It's definitely above these the mob of these young kids that were like very good at fighting and the their teacher being [ __ ] pure evil and then the moment that that the kid gets beat, all of the kids turn on the their seue. I thought that was awesome. But I mean I I would put them at uh number three uh underneath Swank above Chosen and Silto from I wouldn't put him above Chosen and Saito. All right. Well, there's all that back there's all that backstory with Silto and and and and Mr. Miyagi. I mean, there is at least back whatever. Yeah, whatever. Um All right. So, there we go. Karate Kid 2010. Um, the kids, the kids. Now it's time to rank the Karate Kid movies. Currently, number one is The Karate Kid,",
            "start": 5139.76
        },
        {
            "text": "at least back whatever. Yeah, whatever. Um All right. So, there we go. Karate Kid 2010. Um, the kids, the kids. Now it's time to rank the Karate Kid movies. Currently, number one is The Karate Kid, number two, Karate Kid 3, number three, Karate Kid 2, and number four, The Next Karate Kid. Let's start with Karate Kid 2010. I would say, if I may, that Karate Kid 2010 is marketkedly better than The Next Karate Kid. Um, but I can't in good faith put it above G, The Karate Kid 2. Are you sure? I don't I easily think it is. Karate Kid 2 not that good. Yes, but neither was this. This was just sort of derivative. It was It's It's got all the makings of a good movie, but I would much rather watch The Karate Kid 2 right now than that movie ever again. It's him and it's him in Japan. It's expanding the the relationship between him and Miyagi. It's you know, it's another fish out of water story. It's I for I always thought it was a fun continuation of the Karate Kid movie and not just doing the",
            "start": 5189.6
        },
        {
            "text": "the the relationship between him and Miyagi. It's you know, it's another fish out of water story. It's I for I always thought it was a fun continuation of the Karate Kid movie and not just doing the exact same thing which we eventually got back to with Kate Kid part three. Although they found a good fun dimension of having him actually train with Harry Silver. Um again if I had watched Karate Kid 2 last week and then this maybe I would feel differently but I have such a soft spot in in my heart for Karate Kid part two specifically for the soundtrack that I can't put anything above it. Like a night in shining armor. I'm with Nick, but from a long time ago from I just I love Karate Kid, Joey. I I'm on your side. Okay. I don't think I would put it above two. I put it below two. I do love Karate Kid too so much. I love them being in Japan. I love the Oone Festival. I love all of that stuff. And I like all the backstory we get about Yagi. And I like Chosen mostly because of Also, how how",
            "start": 5246.48
        },
        {
            "text": "Kid too so much. I love them being in Japan. I love the Oone Festival. I love all of that stuff. And I like all the backstory we get about Yagi. And I like Chosen mostly because of Also, how how long is a Karate Kid too? It wasn't two and a half two hours and 10 minutes, right? probably like 52 minutes. So, I would put it and like des I wasn't here for the next Karate Kid. I don't know how I missed that one. I do love that movie, but I I'm an adult enough to understand it's probably not has not held up well. So, now it's time to rank Karate Kid Legends. Uh we put Karate Kid 2010 at fourth place, uh with only the next Karate Kid behind it. Andy, where would you put Legends? Legends for me would be above the next Karate Kid and I can't really base it against the 2010 one because but it would be fourth. It would it would be below the OG three for sure. I put it above two. Um and I would have also put it above 2010 in my own rankings. I would also put this right underneath the core three",
            "start": 5290.16
        },
        {
            "text": "be fourth. It would it would be below the OG three for sure. I put it above two. Um and I would have also put it above 2010 in my own rankings. I would also put this right underneath the core three and with Andy. And so with you guys, I need Nick and uh Joey to How would you rank it against 2010? I put it above 2010. Yes. Yeah. In my opinion, I think it's got I think the story between the two main characters goes a lot farther than Oh [ __ ] Would I would you would you put Would you I I liked this. So yes, I would. No, actually better than 2010. Yeah. It gets the half star bump for also being 90 minutes. Okay. Okay. I'll put it above 2010. Just right above 2010 in my list. Uh so the rankings are number one, The Karate Kid. Number two, Karate Kid 3. Number three, Karate Kid 2. Number four, Karate Kid Legends. Five, Karate Kid 2010. And six, The Next Karate Kid with the Swank. Uh let us know in the comments below how you would rank these movies. Like I was saying, next week we got",
            "start": 5341.68
        },
        {
            "text": "four, Karate Kid Legends. Five, Karate Kid 2010. And six, The Next Karate Kid with the Swank. Uh let us know in the comments below how you would rank these movies. Like I was saying, next week we got Ballerina in review from The World of John Wick. And then the week after that we start Superman. uh as we head into Superman James Gun. Till next time, stay tuned. Watch the Elder Ring giant bomb cross. Kind of funny. Uh and I love you all. Bye bye everybody.",
            "start": 5392.72
        }
    ]
}