{
    "id": 14036,
    "video_id": "k0UH1UG12nY",
    "show_name": "Screencast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "The Last of Us Season 2 Episode 5 SPOILERCAST",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nThank you for the support! \n\nTime Stamps -\n00:00:00 - Start\n00:02:00 - Housekeeping\n00:03:18 - Our thoughts! \n00:20:15 - Future days\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747081400,
    "duration": 2229,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] Welcome back to kind of funny spoiler. cast breakdown of The Last of Us season 2 on HBO. Today we are talking about episode 5, Feel Her Love, directed by Steven Williams, uh who did many, many, many episodes of Lost, as well as the HBO Watchman show. Um you know that Sawyer is coming back now. He's got a new HBO show. What's Sawyer's new show? I don't know. It's an ice duster. I think it was I saw a preview for it on the uh before this episode. Oh, really? Yeah. Oh, we got the Peacemaker trailer was awesome. Peacemaker also. Oh, see I only pay for one. I guess I only get one ad. Well, to get Tim's credit card and let's make this thing happen. God damn it, everybody. But more importantly, he directed episodes of Space Cases on Nickelodeon, which I was obsessed with, Greg. It was essentially Star Trek for like Nickelodeon. I'm sorry that we cut him out of the podcast. Not We learned our lesson years ago. I mean, Space Cases in review when everybody. Uh, but this is kind",
            "start": 0.87
        },
        {
            "text": "was essentially Star Trek for like Nickelodeon. I'm sorry that we cut him out of the podcast. Not We learned our lesson years ago. I mean, Space Cases in review when everybody. Uh, but this is kind of funny breakdown of Last of Us. Each and every week, we're going to totally spoil everything we thought about the episode that we saw in relation to our experience with playing Last of Us 2, the video game. So, this will be full spoilers for all things Last of Us, whether it's the show, the games, or anything in between. Um, you can get this each and every Monday. We're running out of them, though. We only have two left. So, the next two weeks, we will be doing the reviews of this and then it will be all over. Um, of course, if you love what we do, you can support us with the Kind Funny membership. It gets you the show's ad free and you also get a daily exclusive Gregway. I didn't introduce ourselves but you probably know I'm Tim that's Greg and that's Nick everyone. Um if you do get the",
            "start": 72.08
        },
        {
            "text": "It gets you the show's ad free and you also get a daily exclusive Gregway. I didn't introduce ourselves but you probably know I'm Tim that's Greg and that's Nick everyone. Um if you do get the kind of funny membership you get today's Gregway which is yet to be recorded. I had to drive Jen to the airport so I didn't have I didn't have my faculties about me. It probably be about giant bomb. Yeah probably giant bomb is in the air. And speaking of giant bomb we've had a great day with them already. Uh you can check out uh the kind of funny games daily episode with Greg and Jeff Grub and then you can check out the Death Stranding 2 games cast that I just did with Blessing and Dan Riker. So awesome stuff all around and our day is just beginning. After this, we will be doing a gameplay stream. That is Andy hanging out with Nick as he starts up Expedition 33 for the first time. I am so excited, Nick. I am obsessed with this game. I saw I'm obsessed with the world, the story, all of it. I",
            "start": 109.92
        },
        {
            "text": "That is Andy hanging out with Nick as he starts up Expedition 33 for the first time. I am so excited, Nick. I am obsessed with this game. I saw I'm obsessed with the world, the story, all of it. I don't know that the gameplay is going to grab you necessarily, but the story will. And I'm very excited to see you start the game up and then and see how the the performances and how they present everything cuz like it's some some real special [ __ ] Yeah. I'm looking forward to jumping in. Yeah. Uh we'll see how that all goes. Um but enough about all of that. I need to tell you about our very very amazing and very very special Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by Shady Rays, R of Frames and Rocking Money, but we'll tell you all about that later. Let's get into it. Feel her love episode five. Greg Miller, I want to start with you. What' you think of this one? I liked it when the credits rolled. I think in the middle of it, I was",
            "start": 150.24
        },
        {
            "text": "that later. Let's get into it. Feel her love episode five. Greg Miller, I want to start with you. What' you think of this one? I liked it when the credits rolled. I think in the middle of it, I was like, I want to get going a bit more. I I there's nothing like there's no cardinal sin they did that alienated me or did something from it, but I was just more of like ready for more movement action. I don't really know if I can put a an actual pin on what I'm trying to say, you know what I mean? But it was like by the end of it, I was satisfied. But in the middle, I was like, I'm ready to get to this or that, get to that or where are we going to go? But I think they did a good job of, like I said, getting me there in the end, right? It's it's not about the journey, right? It's about the destination. And I like where I was going. It's all part of I think it was a slow burn to get me there. I think they introduced, you know, the inner deck. We're already in spoilers if you didn't know.",
            "start": 190.0
        },
        {
            "text": "And I like where I was going. It's all part of I think it was a slow burn to get me there. I think they introduced, you know, the inner deck. We're already in spoilers if you didn't know. Spoilers, spoilers, spoilers. Uh, the stalker scene was so good, right? Of just like, all right, there's one. We got it. Oh, there's two. Oh, oh, [ __ ] And they look around. There's so many. That was cool. Getting the Sarah fights the way we did, right? Of interrupting that scene. Dena taking a arrow to the knee. I was like, hell yeah. All right, cool. Like, I like where we're going. I like we're mixed up. Let alone to have um Ellie break off and get to that Norah scene that we've been waiting for and wanting for so long, right? Let alone the, you know, the intrigue. if you're not uh maybe you're a Josh Makuga if you're not someone who played the games right who text me and Tim every Monday morning to ask what the hell's going on like you know to have them ask that question of wait she knew and this",
            "start": 233.92
        },
        {
            "text": "Makuga if you're not someone who played the games right who text me and Tim every Monday morning to ask what the hell's going on like you know to have them ask that question of wait she knew and this that and the other like I liked all that and I thought in the it was a powerful setup in the beginning too with the actress that I only know from waiting remember and she's the mom in Euphoria too but she walks in was this woman who sent was smoking the cigarette and sent her son to die was she also from Daredevil is she the cop in Daredevil too. Maybe. Yeah, she did look familiar. Maybe you're right there. Is Dena one of the lanterns? Yeah. Yeah, that was true because I saw that preview. I was like, wait, is she in every HBO show? Hell yeah. Come on, Peacemaker. Jen said those [ __ ] magic words when we were watching that Peacemaker trailer. She goes, I re I really got to watch season one. And I said, yes, you do. She still hasn't watched it. I'm like, we have to watch season one. We got",
            "start": 266.88
        },
        {
            "text": "when we were watching that Peacemaker trailer. She goes, I re I really got to watch season one. And I said, yes, you do. She still hasn't watched it. I'm like, we have to watch season one. We got to watch that trailer. Yes. Yes. Yes. Nick, what did you think? Uh, I liked it. I liked the ending of it. I thought I'm with Greg a I think the last couple episodes had a bit of a slow burn. Um, I'm still catching up because I didn't get a chance to talk to you guys about the fourth episode which introduced Jeffrey Wright. Uh, which is always always good. It's always good when you have his character I'm absolutely fascinated with. We can talk about later. Ultimately, by the time we got to the end of this, by the time we got to basement level two, uh, I was pretty enthralled with where we were. Um, leading up to it, you know, these are the parts in the games where you're actually playing. So, I think the mechanic does a lot of the heavy lifting there. Uh, and the storytelling is a little thin",
            "start": 309.04
        },
        {
            "text": "leading up to it, you know, these are the parts in the games where you're actually playing. So, I think the mechanic does a lot of the heavy lifting there. Uh, and the storytelling is a little thin with those moments, but I I enjoyed it through and through. Yeah. I I feel like I am on a different planet when it comes to this show, this season, and even like this episode, just from the discourse that I've seen of like how upset people seem to be or just how like eh they seem to be. I really thoroughly enjoyed this episode for kind of uh the counter to what Nick's even saying here of like I enjoyed how it um portrayed the gameplay elements where you are kind of just walking around Seattle, walking through the the bushes with the the Sarapites attacking the whole um hospital sequence. Like I think that they did a really good job of taking the elements of what the storytelling has to do in those gameplay bits but translating it to the medium of TV. Like I was really just kind of",
            "start": 344.72
        },
        {
            "text": "Like I think that they did a really good job of taking the elements of what the storytelling has to do in those gameplay bits but translating it to the medium of TV. Like I was really just kind of captivated and um loving the kind of journey we went on with Ellie and Dina and their relationship of she's the smart one, she's the shoot first, ask questions later and you're crazy. Don't get offended. I love you for that. I was like a so it's just good stuff and like I think that they introduced the stalkers in the perfect way and they introduced the um the dark side of the Sarafites. Like we we saw the torture scene last week which obviously is very messed up but we've seen torture before. We've seen Joel do it. Our hero do that, right? or antagonist at the very or at the very least and the way that we see them like stealth mode actually hiding now they're as a group together and seeing this like essentially public execution for this religion I think it just really like raised the stakes",
            "start": 382.8
        },
        {
            "text": "that we see them like stealth mode actually hiding now they're as a group together and seeing this like essentially public execution for this religion I think it just really like raised the stakes and the the fear of the like the whistles and surround sound was an insane experience but like that stuff was I think very well presented and like looked beautiful. I loved the the set and um the not a perfect episode. I do think the the hospital stuff went a little fast um in terms of like the chasing down Nora part of it. Like her the getting into the hospital and chasing down Norah like in the game I think felt a little bit more well paced, I guess. Um, but I think that the introduction of Jesse made up for all of that to me where I thought they did such a good job of making him seem like, oh [ __ ] like he came and saved the day and like it was one of those TV moments where Gia next to me who does not know what's going on uh in the story that happened. She's like like thank god someone",
            "start": 423.76
        },
        {
            "text": "[ __ ] like he came and saved the day and like it was one of those TV moments where Gia next to me who does not know what's going on uh in the story that happened. She's like like thank god someone saved them cuz it really felt like they weren't going to get out of this and it makes sense who it was and how they did it, right? Um, so I was really really into all of that stuff and uh I just think that the the way that they they get to the the end of this episode and and this portrayal of Ellie and Nora and how that all goes down and the introduction of the spores I've been so concerned about. We've been talking about this like last couple months of like seems like from the trailer they're introducing spores. They didn't do that in the first season. Definitely a clear choice to get rid of them. Why would they add them back now? And more importantly, how are they going to make that make sense and make that feel like a good choice? I feel like it was an amazing choice. I think it adds so",
            "start": 472.64
        },
        {
            "text": "Why would they add them back now? And more importantly, how are they going to make that make sense and make that feel like a good choice? I feel like it was an amazing choice. I think it adds so much like layers of tension to Seattle itself. And the way that these characters know about the spores and that Norah is talking like realizing what's happening and thinking Ellie's [ __ ] but realizing that she's the the immune one. Like all that stuff was so great because of the opening of this episode of the woman smoking the cigarette and getting that hands-on experience of like I was there and I saw what happened to my son. Yeah, they did such a great job of making the spores terrifying. And I know that sounds stupid because of course that would be terrifying in real life, but the way like the person who over here they were saying the person isn't the cop from Daredevil. She was in Hung, which I maybe I watched a couple episodes of Hung, but I don't remember that well enough. Maybe that's",
            "start": 513.92
        },
        {
            "text": "person who over here they were saying the person isn't the cop from Daredevil. She was in Hung, which I maybe I watched a couple episodes of Hung, but I don't remember that well enough. Maybe that's why it's nebulously in my brain. And somebody said, \"Wait, was that woman a waitress?\" I meant I thought I said waiting. I mean waiting. The Ryan Reynolds waiting to say waiting. Okay, just make sure. Anyways, um they do such a great job of introducing a brand new concept and then showing two characters who shouldn't be scared of [ __ ] Let alone like when she's smoking right and the woman walks in like I thought they send Isaac and Isaac's going to come if you get killed, right? Like I'm here. He's going to be there to execute you. Like okay, cool. They're both unsure of what's going on. when they establish the stuff and then it's like the sealed it up that was the thing my son they it's such a great like holy [ __ ] moment of like yeah that would be terrifying what does it actually mean",
            "start": 554.52
        },
        {
            "text": "they establish the stuff and then it's like the sealed it up that was the thing my son they it's such a great like holy [ __ ] moment of like yeah that would be terrifying what does it actually mean what does it actually mean to have spores out there yeah and I I think that in addition to the spores like the stalkers I think the show's done a good job separately from the game and I think better than the game of making these new things not just feel like a new gameplay threat but like a actual story be threat of like like and seeing the like we've had so much more of the Jackson in the show so like getting just like the people's reaction and conversation of like, yo, one of them was smarter and then having the ramifications of like, do people believe Ellie about that? And and is that true? And if it is true, that's scary as hell that some of these things can be smarter, you know? And to see that stuff and then also then like the wait, it's in the air now. Like that realization, that's",
            "start": 592.08
        },
        {
            "text": "And if it is true, that's scary as hell that some of these things can be smarter, you know? And to see that stuff and then also then like the wait, it's in the air now. Like that realization, that's absolutely terrifying. And I think just kind of I don't know if grounds is the right word, but I think centers uh the actual threats of the Cortiseps in the show in a way that I think really enhances this version of the plot. Right. Because I think this is something the conversation I've had with multiple people now of like this discrepancy of what we would do in these scenarios versus what these characters who are literally born into this world would do in these scenarios to to see in their eyes through their eyes I should say both the infected themselves and the spores the the threat level up to a place of oh [ __ ] we've never been here before. Yeah, we've had 20ome years of it like this but we've never had this. This is a brand new thing to deal with. That's interesting. Well, she even",
            "start": 630.16
        },
        {
            "text": "to a place of oh [ __ ] we've never been here before. Yeah, we've had 20ome years of it like this but we've never had this. This is a brand new thing to deal with. That's interesting. Well, she even has that line too. I think there's a line where Ellie's like, \"What what is this thing that they're they're staying away from, right? This big rectangular thing that we have to sneak away from.\" And she's like, \"Well, you know, there be some clickers and well, whatever. We'll figure it out.\" And then we have that crazy I think it might have been actually the episode prior where you have Dena counting. Yeah. And then she gets to five and by the time she gets to three, she's like, \"We're screwed.\" Yeah. So, I like that they have those baked in escalations, but I do think the I think the spores really do have it. It takes that tension to another level cuz now there's a bigger threat out there, which is the air. And there's nothing scarier than an airborne parasite, right? Um, and I just, you",
            "start": 674.0
        },
        {
            "text": "do have it. It takes that tension to another level cuz now there's a bigger threat out there, which is the air. And there's nothing scarier than an airborne parasite, right? Um, and I just, you know, even having played the game, but see, you go when she goes down to the basement and you see, and you know it's coming, you see L. Parker or whatever, like, uh, I forget the kid's name. That was the woman's the smoking woman's, uh, son. And he's like, and all of them that were trapped down there are just like in the wall like goofing out, vaping out for us. That That was That is a visually terrifying and grotesque thing to put on screen. Stolen right from Alien Covenant. Yeah. You hate to see it. You hate to see an effect copied. There it is. Way to go, Neil. Well, I mean, to be fair, Alien Covenant copied from Methus, but I digress. Um, yeah, I thought this Predator interview. Come check it out. Yeah. Yeah. We We'll be back in a couple weeks. Uh it was good. It was really good. Yeah. Uh I",
            "start": 708.16
        },
        {
            "text": "copied from Methus, but I digress. Um, yeah, I thought this Predator interview. Come check it out. Yeah. Yeah. We We'll be back in a couple weeks. Uh it was good. It was really good. Yeah. Uh I also loved the deepening of the the wolf lore, too, from the perspective of Dina and Ellie. Yeah. Well, that was what I was going to say. I love I love that they're really sort of fleshing out the wolves, like the actual sex that you're getting to see. I think that's a really smart move, and I think you have to do that because I think I'm I'm fascinated by the wolves now. I want to know more about them. And I know we got to see we got to see Abby more in the game, but still like this could be Jeffrey Wright's story and I would watch another seven episodes of it. Yeah. Uh I was going to say the the radio stuff like the the storytelling of them being like, \"Hey, they're just so overconfident that they're just on open radios like saying all this stuff like that I think is such a a cool detail uh",
            "start": 754.16
        },
        {
            "text": "radio stuff like the the storytelling of them being like, \"Hey, they're just so overconfident that they're just on open radios like saying all this stuff like that I think is such a a cool detail uh to add to this.\" And like it gives a lot of context to the end of last episode. I think it was of them it must have been Yeah. looking out and seeing this war happening and like the two of them making the commitment of we're doing this together and it's like how are you gonna do it? They're should they're making it believable of how they're going to do it. Like they are tactically getting the information and they're the information is being given to them because of the overconfidence in uh the WLF. Like I think that's great. One of your when you kicked off you were talking about being on another planet it feels like or universe in terms of the reaction to this show. One of the things that I didn't have a problem with last week that I've seen so much discourse about, right, is the decision",
            "start": 796.32
        },
        {
            "text": "planet it feels like or universe in terms of the reaction to this show. One of the things that I didn't have a problem with last week that I've seen so much discourse about, right, is the decision by both Ellie, but mainly Dena to still go on this revenge quest with the baby. I think they did a great job in this episode of having Dena be like, \"Shut the [ __ ] up, Ellie. Life sucks. It's always sucked. This 8-year-old had to kill this guy. My parent my sister and mom got killed. What I would It doesn't matter. We We don't live in this that world slash this world. our world where you would be weighing everything like they're could die at any second of every day. Like why are they worried about this? And another thing I loved about it is I I loved last week how it was different that it wasn't an immediate fight between the two of them but it was more of a a moment an opportunity for love between the two characters and like a commitment to hey we are a thing together. Um and the like I'm",
            "start": 833.52
        },
        {
            "text": "an immediate fight between the two of them but it was more of a a moment an opportunity for love between the two characters and like a commitment to hey we are a thing together. Um and the like I'm going to be a dad moment like all that stuff. Like I think that that was like very cool and different from the game. But I appreciate that in this episode we did get some of that fight and it was a bit less of like antagonistic and more let's talk this out. But I think it was really really well back up backup by Jesse returning and how the dynamic shifted there where this episode kind of being like all right um I'm with you and like Dina kind of putting it in Ellie's hands of just like you get to choose if I'm coming with you or not and like that's like a very very like hard thing to put on somebody both ways, right? But they're I think proving to each other that they are in this together, including putting the the baby at risk in all of this and Jesse coming to save them. Immediately that",
            "start": 874.96
        },
        {
            "text": "both ways, right? But they're I think proving to each other that they are in this together, including putting the the baby at risk in all of this and Jesse coming to save them. Immediately that shifts a lot of things cuz first off, it is physically Jesse's baby, right? So I think that that dynamic is very interesting. But on top of that, immediately Ellie trusts Jesse to take care of Dena. And when Ellie has the opportunity to leave them and go after her target Nora in the hospital, she does that immediately. And that feels very like what the hell? That's not what this entire episode just builds up to of we're in this together and all this stuff. But also, it just shows she trusts Jesse that way. And I think that it there's a lot there that I I'm going to be fascinated with knowing how the rest of the game goes and Dena's uh story with Ellie. I feel like getting this bit here how and how different it was from the the game is potentially more interesting to get to the end of the game",
            "start": 912.8
        },
        {
            "text": "rest of the game goes and Dena's uh story with Ellie. I feel like getting this bit here how and how different it was from the the game is potentially more interesting to get to the end of the game with how Dena feels about Elliot and the kid and everything. Sure. Sure. Yeah, I agree. I think, you know, to go back to Greg's point, I I it's the dynamics are interesting because they think they both know they're set out on this thing that's completely reckless to begin with. And so the idea is how far into the void do we want to go with this? And I liked that scene where she's like, \"Yeah, we're already in for a penny, in for a pound here, right?\" Like, and they had they had that conversation. And then Jesse has that a good moment where, you know, Ellie tries to kind of being the crazy one, being the more brash one, say, \"Hey, we had it covered.\" And he goes, \"Until?\" Until you didn't. And she goes, and then she has to even she has to give and she goes, \"Yeah, until we didn't.\" Right. So,",
            "start": 958.64
        },
        {
            "text": "the more brash one, say, \"Hey, we had it covered.\" And he goes, \"Until?\" Until you didn't. And she goes, and then she has to even she has to give and she goes, \"Yeah, until we didn't.\" Right. So, I think she knows she's on a fool's errand. It's just how how far into it is she willing to go? She's crazy. Jeez, crazy. Uh, everybody, super chat in your thoughts on this episode. If you want to get uh your questions answered or anything, please send them in. We're about to take a quick word from our sponsors, but we'll be right back. This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have",
            "start": 1000.64
        },
        {
            "text": "offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys, who rocks his shady rays every day, going on Pokémon Go walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support. Exclusively for our listeners, Shadyra is giving out their best deal. Head to shadyra.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com, promo code funny. This episode is brought to you by Auraframes. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all",
            "start": 1038.8
        },
        {
            "text": "people. That's shady.com, promo code funny. This episode is brought to you by Auraframes. Every day we're taking photos from big events to silly moments. But doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Aura Frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to",
            "start": 1083.52
        },
        {
            "text": "and videos and invite as many people as you want to an Aura Frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aura.com to get $20 off plus free shipping on their bestselling Carver matte frame. That's afra. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your",
            "start": 1125.6
        },
        {
            "text": "still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts, and then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindafoney today. That's rocketmoney.com/kindfunn. Rocketmoney.com/kindafoney. Greg, we were going back and forth. Future days. We sure were. We sure were. There it is. What a nice and what a nice tease of it. You know what I mean? Again, I think for us",
            "start": 1168.96
        },
        {
            "text": "Greg, we were going back and forth. Future days. We sure were. We sure were. There it is. What a nice and what a nice tease of it. You know what I mean? Again, I think for us as the gamers who have done all this and do it, it's so nice to see these things and these like things that people don't understand how important they're going to be or what it's going to play or how it's going to go. You know what I mean? Of like even the cliffhanger to this episode of what you're about to get into. Kevin, your mic's open. Uh it's just this idea of like, damn, that's such a nice little setup and such a nice answer to us of like when are they going to introduce this song because they got to the idea that Ellie starts it and then it's just too painful to continue. It's good stuff, man. I I really I got chills watching it. I thought it was so fun to see like in the game you get to that point you can actually play the guitar and gameplay and stuff in the theater. I thought that was really a cool",
            "start": 1216.48
        },
        {
            "text": "got chills watching it. I thought it was so fun to see like in the game you get to that point you can actually play the guitar and gameplay and stuff in the theater. I thought that was really a cool little nod and the way they shot it was just so awesome. Like even just seeing her stand on the stage and like look at all the instruments and look at all the seats and there's this like weirdly hopeful moment in such a dark world of The Last of Us seeing this girl who only knows all of this but does love music because of Joel and loves guitar and all that. imagining like you they don't say this but you just see it on her face. It's like a kid for a second. She's imagining like can you imagine being here and people cheering for me. As we all know how cool it is to be in a theater like even for us it's cool to go to a a venue, a concert, a stage performance of any kind, right? And so to when she walks in and it has that wa like again I think Bella Ramsey does such a great job in my mind of",
            "start": 1250.72
        },
        {
            "text": "us it's cool to go to a a venue, a concert, a stage performance of any kind, right? And so to when she walks in and it has that wa like again I think Bella Ramsey does such a great job in my mind of portraying things with little nuanced touches. Like I said, I've said throughout this Abby, like the way she says Abby, the way she walks in there and the way her eyes light up and like, yeah, they don't say that she is in her head pretending, imagining, you know, she's up there performing. You just know by watching it, let alone how cool the theater is and she looks up at the glass as she walks in. Really dumb idea to turn on all the lights in this theater that I don't think I ever in the game would have clocked cuz you're in the video game, you do the objective, you move on here. I was like, \"What the [ __ ] are you doing? Why are you turning these on?\" Did she turn them on or were they just on? Cuz that was everywhere they go. I'm like, man, Seattle has a lot of power. She makes a whole",
            "start": 1290.4
        },
        {
            "text": "\"What the [ __ ] are you doing? Why are you turning these on?\" Did she turn them on or were they just on? Cuz that was everywhere they go. I'm like, man, Seattle has a lot of power. She makes a whole comment about how she turned it. She comes up like, \"Tada.\" And Dina's like, \"What? The lights?\" Yeah. She's like, \"Oh, it's propane, natural gas down there.\" Ah. Oh, okay. Jeez, I missed that whole I missed that whole section. That's what you were doing. You're on your own. I liked uh Dena like making the maps uh in the beginning of the episode. And she being a huge nerd is great. Wanting a protractor is great. Using the straight edge of a magazine for your pistol. That's dope. Yeah, super is. But I I just love that again from the the translating gameplay stuff too. It's like the the map of Seattle and like filling it out was like such a big part of that open world section that I thought that was a very cool thing and again really enhances Dena's character. Like I'm enjoying Isabella",
            "start": 1327.36
        },
        {
            "text": "of Seattle and like filling it out was like such a big part of that open world section that I thought that was a very cool thing and again really enhances Dena's character. Like I'm enjoying Isabella Merrced is my favorite thing about season 2 of the show. Like she continues to crush it. I mean Superman everybody don't forget July that's coming. Superman. Is that how you say it? These [ __ ] clowns at Marvel somehow getting Fantastic 4 to sponsor the goddamn iMac screen. I'll let you know. There's a movie before then called Superman you need to be ready for. Also shot for IMAX. No big deal. And that's the one that's like that builds into Peacemaker. Yes, that's right. He's got a big S on his chest. It's like Sentry but not as used to mean hope. We'll see what it means. Oh, cool. Calvin Pro super chats in saying, \"I think the big thing lost in the adaptations. The overwhelming burden of pursuing Abby. The game has small things that remind us that's why you're in Seattle for the first",
            "start": 1362.96
        },
        {
            "text": "super chats in saying, \"I think the big thing lost in the adaptations. The overwhelming burden of pursuing Abby. The game has small things that remind us that's why you're in Seattle for the first two days.\" I do think that that is a tough thing, right? Like I I don't disagree with that where this needs to handle so much of setting up location location of the Sarapites forest and the the hospital and like getting to the hospital and all of that that I think that the a lot of the in the game I don't even think needs to be explicitly said over and over just because you're out there shooting things that feels more violent and feels more vengeful than the the story in the show has. Especially when there's an anger to Ellie the entire way through in the game. Like she fights with Dina when she finds out she's pregnant. She's angry. She gets to Nora. She kills so many people in the hospital. The show instead having it be she gets to Nora and that moment I thought hits not harder but",
            "start": 1400.0
        },
        {
            "text": "she finds out she's pregnant. She's angry. She gets to Nora. She kills so many people in the hospital. The show instead having it be she gets to Nora and that moment I thought hits not harder but differently very hard because it goes from zero to 60. Right. Yes. I think you're 100% correct. And I think again this is us maybe the downside of being a gamer watching this is that we come in with our preconceived notions of what our journey as Ellie was. Uh I think this is a different journey for Ellie. I think uh Bella Ramsey's Ellie as we've talked about multiple times is a different version of Ellie in general. And so I think what they're trying to do and I don't know Nick you are more trained in the craft of screenwriting and making things but it's the idea here that okay we want you the viewer to almost forget at times why you're on this journey so that when we make a turn like this with Nora and we see Ellie go off the deep end and whail on her legs just like we saw Joel do in season",
            "start": 1442.56
        },
        {
            "text": "to almost forget at times why you're on this journey so that when we make a turn like this with Nora and we see Ellie go off the deep end and whail on her legs just like we saw Joel do in season one where for so many people that was like whoa I didn't expect Joel to do that right I think in the video game it But whoa, I didn't expect Joel to do that. Right. You need to be reminded of what is at stake here. And again, I think for what we've now set off on now, I feel like now, much like the Xbox dominoes, the domino on the revenge Ellie has fallen. And so, I think when she goes back to Dena, she's going to be a different Ellie, like she was in the game, if you remember when she came back after finding Nora. Like, I think that's important. And I think we keep week to week questioning motivations that'll make more sense when it's an entire season, let alone another season on top of that. Yeah, I do think it's hard though. I do think it feels like it's going by at such a fast clip. And",
            "start": 1490.08
        },
        {
            "text": "that'll make more sense when it's an entire season, let alone another season on top of that. Yeah, I do think it's hard though. I do think it feels like it's going by at such a fast clip. And then there are moments where the two of them are just legitimately having fun that I don't remember in the game. And again, my memory of the game is very very very like loose. So I'm sure there were those moments of levity. Um, but I do feel like I think the story I think you get more to to the commenter's point. I do think it is more belabored and more of a a sort of albatross at a certain point than it is being than it is here. Here it just seems like there I mean it's day two and we it almost feels like the season I mean season's almost done, right? So I don't know where we're going to end up or where we're going to where they're going to be. But I just remember specifically even the game the the the moment in the park where you have to sort of sneak around to all the SAP fights being so much",
            "start": 1531.72
        },
        {
            "text": "we're going to where they're going to be. But I just remember specifically even the game the the the moment in the park where you have to sort of sneak around to all the SAP fights being so much more like tedious and scary. And I think we're just, this is just the nature again of the of the medium of we got to tell the story. We have to tell it in such a way where we don't have the person able to literally physically pick up a controller and play through these moments and get the enjoyment out of that. So, we do have to have those other, you know, we have to sandwich in a lot of other moments with other characters here. But um I don't I think that I will I will be happy if Bella plays it more quiet rage from here on out or building rage from here on out because I do think there was there's there elements of of the show that I don't love and those elements are when I feel like they should just have when they have those moments of hey we're just kicking it and they look how beautiful we",
            "start": 1574.16
        },
        {
            "text": "there elements of of the show that I don't love and those elements are when I feel like they should just have when they have those moments of hey we're just kicking it and they look how beautiful we are and someone made it noise but it's fine we're in downtown jail of like two normal people obviously not in the post-apocalyptic like what the hell are we doing? we got to get the [ __ ] out of here. Like, why are we doing this? Right? And so, I always felt like in the game they did such a great job of being like the second they could have those those feelings, something would interrupt, there'd be a big thing or this and this and this. Um, but yeah, I mean, overall where this episode ended, I want to I definitely want to pick up with these characters and see where they end up. So, we get the next time on thing. We get the end of this episode. I didn't watch it. I hate those. Are we supposed to watch those? God damn it. I hate this so much. Yes. Uh, we get the end of this episode thing",
            "start": 1615.12
        },
        {
            "text": "next time on thing. We get the end of this episode. I didn't watch it. I hate those. Are we supposed to watch those? God damn it. I hate this so much. Yes. Uh, we get the end of this episode thing with uh, we see we see Joel and he's back, baby. Um, and he's a lot younger and then we see the the thing next week of like, all right, cool. We're getting the rocket ship stuff. We know next week will be directed by Neil Duckman. Um, so that's very exciting. What What do we get next week, Greg? Is there any any predictions you have? Yeah, I mean, we get the flashback to the thing and I you're going to get the you'll get the answer to how did Ellie know, right? of like when Ellie rolls up on Norah and Nor's like she you know Joel deserved this he killed that entire he killed Aby's dad and she goes I know like I think for a lot of people that was meant to be a what the [ __ ] right and then this is supposed to set you off on finding that out I think even in the teaser right or not even the",
            "start": 1650.4
        },
        {
            "text": "goes I know like I think for a lot of people that was meant to be a what the [ __ ] right and then this is supposed to set you off on finding that out I think even in the teaser right or not even the teaser I'm sorry the cliffhanger here at the end right they specifically go out of their way to show Joel waking her up in her bed in his house right so like you if you've been paying attention and you didn't play the game you'd still get of like oh right she moved out and that was a whole thing like I think we're going to get the conflict here to break them up and show what happened. Do you think next week is all flashbacks, like at least 98% or whatever, and maybe we catch up at the very end? Cuz I can see them doing all of the flashbacks from the game minus the important end ones, like the the porch stuff. I could see them doing the museum stuff. The um I forget what city they went to where they were like where Tommy like is teaching them how to use the gun. Teaching her how to use the",
            "start": 1691.2
        },
        {
            "text": "the porch stuff. I could see them doing the museum stuff. The um I forget what city they went to where they were like where Tommy like is teaching them how to use the gun. Teaching her how to use the gun and I feel like that's where outside of that once they get through that situations where he tells her what Yeah, I remember I remember them. It obviously wasn't the spaceman scene where we then had the eventual revelation scene. I do think they bundle those together. I think it happens organically here where they go out on this perfect day and then Oh, really? I do. I see. I You think they're going to bring that? Yeah. I think we're going to get I think that the structure of next episode is going to be like vignetti flashbacks and then it's just like, you know, four months later, eight months later, like whatever it is, cuz I also think from seeing the trailer um for the season, like the overall this season on thing, like we see the Eugene character. So, I think that at some point,",
            "start": 1731.52
        },
        {
            "text": "months later, like whatever it is, cuz I also think from seeing the trailer um for the season, like the overall this season on thing, like we see the Eugene character. So, I think that at some point, tie that in. I can't figure out where they're tying that in though. Oh, that's got to be this episode, right? I think it'll be this episode, but like what's what's that going to to look like? Like, is there a way they tie that his flashback force the Eugene whatever happened between Joel and Eugene then somehow triggers the actual conversation between him and Ellie? Yeah, probably. Right. Yeah. Get Tommy involved though. Like I feel that would be with the the shooting stuff. I think that they they're going to do something with that. Although maybe the shooting stuff they already handled in Jackson. I forget. I It's It's such a blur of the show and the game. We have seen in Did we see in the We saw in the teaser for or for this season of The Last of Us Joel cleaning the guitar and telling",
            "start": 1775.28
        },
        {
            "text": "I forget. I It's It's such a blur of the show and the game. We have seen in Did we see in the We saw in the teaser for or for this season of The Last of Us Joel cleaning the guitar and telling Tommy about how he saved or am I am I just totally complaining that we saw that already and that was in the premiere or was it [ __ ] I'm pretty sure. Yeah. Okay. Yeah, it was. Yeah. Okay. The premiere episode two, but I'm pretty sure you're right. You're I think it might have even been the very very opening opening of it. Yeah, exactly. That's what it was. Okay. Yeah. I'm interested though. I feel like they can do something really cool with that and like add even more layers to the is Joel the good guy, bad guy cuz like from what we know from the therapist, it's like he Joel was the one to kill Eugene. Yeah. And it's like but the town understands she understands to a degree. Her head understand we're assuming he was turning so he had to be shot. But like is it that clearcut? You know, I don't",
            "start": 1817.2
        },
        {
            "text": "Yeah. And it's like but the town understands she understands to a degree. Her head understand we're assuming he was turning so he had to be shot. But like is it that clearcut? You know, I don't know. Find out. Did he find out that Ellie is immune? Did he have to die? We don't know. Oh, interesting. Yeah. Oh [ __ ] That happens and they just lie and say he was infected. Holy [ __ ] Who knows, right? Because that's such a big That would definitely solve my problem of trying to make you all understand that he's the bad guy if he was just the bad guy. We'll see. I don't know. That's my That's where my head went first time. Maybe he's just a hamburger though and they kill him that way. I want you to touch Tim more. I don't know why you don't touch him as much. That was a very subtle touch. Don't call it out. He hated it. I hate it. crew neck boys for life. Yeah, buddy. I like when you touch my crew neck for no reason. Getting worse and worse every 10 years, Kevin. Uh, for all of us. I've",
            "start": 1859.76
        },
        {
            "text": "call it out. He hated it. I hate it. crew neck boys for life. Yeah, buddy. I like when you touch my crew neck for no reason. Getting worse and worse every 10 years, Kevin. Uh, for all of us. I've been here though over there, though. You're sequestered now. All right. You don't know what it's like over there. You You brought this up, Greg, but the Joel being a bad guy, like the the concept of uh him not sacrificing for the greater community and all that stuff in the little post show breakdown behind the scenes thing. Like something that I thought was really cool that I didn't put together myself was them talking about the uh opening cigarette woman, how she did the opposite of Joel was she did sacrifice for the greater uh good of the community and she listened to the her child, her real child too, not just a child she imprinted on. Yeah. Didn't actually listen to Yeah. So it's just like a there's some great stuff here, dude. That even that one moment where the lady from waiting is just",
            "start": 1898.16
        },
        {
            "text": "too, not just a child she imprinted on. Yeah. Didn't actually listen to Yeah. So it's just like a there's some great stuff here, dude. That even that one moment where the lady from waiting is just staring at the basement. Yeah. and staring at the and just knowing that it's not going to be enough. Like you get that that what a great bit of just non like visual storytelling and and and just emoting from this character who's just literally dead inside and just seeing this and being like that's the sc the scariest thing ever is behind that door and no matter how much you weld that [ __ ] shut, it's going to get through. And then I honestly think the scene between her and the the the mom, the sergeant who was smoking a cigarette, arguably one of the best scenes that's that's been in the show. I loved that. I could watch those two actors just sit across the table and talk to each other the entire time. Also, it really made me want a cigarette. Oh my god, can you imagine how great that would",
            "start": 1941.04
        },
        {
            "text": "loved that. I could watch those two actors just sit across the table and talk to each other the entire time. Also, it really made me want a cigarette. Oh my god, can you imagine how great that would be? The the performance of the the the cigarette woman I thought was so good and what she was saying. It's like it felt real. And I said this earlier, but like it it makes this show feel a lot more important than just an adaptation. It's like, oh, there there's writing here to try to like make this make sense on a TV level um to people and having like all the the parallels and everything going into it and it raises the stakes of the sports, makes them make sense and makes them scary and it makes it feel like even though they they have cities and they have groups like their civilization's not back, we're not we're not prepared for everything that's going to be thrown at us because there's still new things and new elements to this fear, right? And it also it and it makes them it makes the",
            "start": 1982.8
        },
        {
            "text": "back, we're not we're not prepared for everything that's going to be thrown at us because there's still new things and new elements to this fear, right? And it also it and it makes them it makes the bad guys sympathetic, which I think is what the game was good at doing to begin with, right? like there's a perspective shift at some point where you you do empathize and you're you're forced to to play as Abby and that's done on purpose because then when you get to those gut-wrenching moments where people have to be killed or or kill or be killed, it means something. It matters. You you as the player, you as the audience, like me as the audience, I'm looking at this woman who had to make this horrible choice and then let her son just basically die in this basement. And I'm thinking that's a very vulnerable and sympathetic like I can empathize with this person. Maybe she's done horrible stuff, but I get it. And just going back to last week because I I wanted to kind of spot out. I'm sure",
            "start": 2018.96
        },
        {
            "text": "very vulnerable and sympathetic like I can empathize with this person. Maybe she's done horrible stuff, but I get it. And just going back to last week because I I wanted to kind of spot out. I'm sure you guys talked about it all, but the way we introduced Jeffrey, right? And the fact that he's like, \"You're so and so.\" And she's like, \"Yeah, you're Isaac.\" He's okay. And he walks back to the the SWAT car, the the troop transport, taking out two grenades, just throws them in. Just so like just throws them in like it's a matter of fact, just like matter of course. And they all die. It's just such a horrifying thing to do. But then the conversation happening right before that where you're you're all Greenbergs or whatever it was. Like you're all [ __ ] Greenbergs. Yeah. Like you're all just done. You're gone. You're wastes. We have that one guy. God, that was so good. So good. Hetian Park is uh Lieutenant or Sergeant Park that we keep talking about in the show. And more importantly for",
            "start": 2056.64
        },
        {
            "text": "done. You're gone. You're wastes. We have that one guy. God, that was so good. So good. Hetian Park is uh Lieutenant or Sergeant Park that we keep talking about in the show. And more importantly for me, why I'm so hung up on the Daredevil thing. She was a cop and the outsider. So, thank you very much everybody. We got there in the end chat. You did nothing. You kept talking about hung and that didn't help me. So, you need to look yourself in the mirror. Hey, look yourself in the mirror, CJ. Look yourself in the mirror, everyone. Look yourself in the mirror. Thank you so much for joining us for this breakdown of Last of Us. The next two weeks, we will return. Of course, we're also doing our weekly Andor screencasts. Uh, next week is this week is the final one. That's crazy. The end of Andor forever. I am very sad to see it go. But come hang out with us on Friday as me, Carboni, Sage, and Barrett, Courtney all get together to give our thoughts on that. Or I thought for a second I",
            "start": 2093.52
        },
        {
            "text": "Andor forever. I am very sad to see it go. But come hang out with us on Friday as me, Carboni, Sage, and Barrett, Courtney all get together to give our thoughts on that. Or I thought for a second I thought he was saying and or a screencast. I was like which one is it and or? Let us know in the comments which one it is everybody. And make every choice which is it going to be. Make up your [ __ ] choice. Look yourself in the mirror Tim. Stay tuned. We're about to have Nick play Expedition 33 for the first time. I'm excited to see it, but I'm sick of him. So I don't know that I'm gonna watch it right now. Uh but you probably aren't sick of him. So please check it out. If you're on Twitch, stay where you are. If you're on YouTube, make the jump over to another video. Till next time, I love you all. A goodbye. [Music] Hey, hey. [Music]",
            "start": 2133.2
        }
    ]
}