{
    "id": 13996,
    "video_id": "KqZ3sHA4vE4",
    "show_name": "Game Showdown",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Karl Jacobs"
    ],
    "title": "The Season 3 Champion is DECIDED - Game Showdown",
    "description": "In this season finale, it's still anybody's game. Greg, Tim, and Andy battle to finish the season.\n\nSeason 3, Episode 12.\n\nWishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nIn this season finale, it's still anybody's game. Greg, Tim, and Andy battle to finish the season.\n\nSeason 3, Episode 12\n\nTime Stamps:\n00:00:00 - Start\n00:11:54 - Housekeeping & First Question\n00:14:47 - Round Robbin’\n00:31:46 - Bonus Stars!\n00:46:45 - Final Feudy\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746222364,
    "duration": 4015,
    "transcript_chunks": [
        {
            "text": "Congratulations, Greg. You are the Stars in the Bank contract holder. You won Stars in the Bank, which means at some point during this season, you'll be able to cash in your contract to challenge either Andy or Tim to steal one of their stars. And we know who it's going to be. Tim. There's an S right there. Plural. Don't put plural agenda. We had the announcement that we wanted to announce. Yes, of course. Go for it. So, you you co-signed this announcement? I I did. Yeah. Okay, sweet. Uh, I'm not sure if Greg's still in the building, but the announcement was I'm excited to announce that stars plural does indeed mean three stars. Three stars. Three. That's more than Greg even was asking or pushing for. Timothy, as I said, you're the biggest Oni Musha fan I know. Mhm. We got an email that was, \"Hey, the one, the only is going to be in the office. He's going to be in San Francisco. do you guys want to interview him? And you said yes, of course. [Music] Um, by the way, Tim, um, heard from",
            "start": 12.96
        },
        {
            "text": "\"Hey, the one, the only is going to be in the office. He's going to be in San Francisco. do you guys want to interview him? And you said yes, of course. [Music] Um, by the way, Tim, um, heard from Greg that Greg would like to Greg would like you to give him the three stars you owe him. So, yeah. Thanks, Greg. Thanks, Greg. Oh, no. Not the music. Not the music. Thank you so much, Odusha. Oh my god. Right now it's not happening right now. It's not happening now. Right now. Are you serious? I'm cashing it in. I'm cashing it in. I'm cashing his right now. Can Can I ask him to sign by on Musha too? Hold on. Hold on. Take off the slipase. This I hate Greg so much. Bless. Oh man. I love you, but this is questionable. Yeah. Oh, it has to happen just like this, doesn't it? Yes. Thank you so much. Thank you so much. Thank you so much. Thank you so much. Thank you. Thank you, man. All right. Well, interview, thank you. I'm so sorry, PR team. I'm cashing in. Sorry, legend. Oh, you think they",
            "start": 72.08
        },
        {
            "text": "Thank you so much. Thank you so much. Thank you so much. Thank you. Thank you, man. All right. Well, interview, thank you. I'm so sorry, PR team. I'm cashing in. Sorry, legend. Oh, you think they weren't in on it? Oh, they were in on it. What do you want me to do? Sit over there. Go to your assigned seat. Team orange. It is now kind of funny game showdown. Now coming into this, Greg, of course, you're coming off of a fresh win last week. That brings you closer to to Tim. I believe right now Tim is still sitting at six stars for the season. Greg, you're sitting at four stars to of the season. Uh coming into this, of course. Yo, what's up? Welcome to the game showdown. Stars in the bank passion. I'm your host, Blessing Addy Jr. I'm joined by two contestants representing two teams. We got Tim Getty's representing team orange. We sure do. And we have Greg Miller representing team How do you think the interview went, Tim? It went great. It went great, Greg. Now, the rules are simple. I",
            "start": 157.2
        },
        {
            "text": "Tim Getty's representing team orange. We sure do. And we have Greg Miller representing team How do you think the interview went, Tim? It went great. It went great, Greg. Now, the rules are simple. I have a trivia question worth one of Tim's stars. Yes. If Greg gets the question right, he gets to take one of Tim's stars. If Tim gets it right, he gets to keep all of his stars. One star. He can buzz in to answer contestants. Are you ready? Yes. Yes. The popular movie franchise Ghostbusters has been adapted into many video games over the years. What was the name of the 2023 VR Ghost? Ghostbusters Rise of the Ghost Lord. Ghostbusters Rise of the Ghost Lord is the correct answer. Greg, that's the worst day of my life. It was the best day and that just changed. You have just won one of Tim Stars, I believe, tying us up for this season. Now, here's the thing, Greg. M I want to give you the one time option of triple or nothing. Greg, since you got the question right, I want to give you the",
            "start": 204.8
        },
        {
            "text": "I believe, tying us up for this season. Now, here's the thing, Greg. M I want to give you the one time option of triple or nothing. Greg, since you got the question right, I want to give you the option to go triple or nothing. All right. If you say yes, here are the rules. I can ask one more question for a chance for Greg to steal two more stars from Tim for a total of three stars. However, no. If Tim gets this next one right, not only does he take back his star, he gets to take back team blue forever. Team blue will then trade their star total with team orange. Greg, wait, the arithmetic. I It makes sense. It makes sense. It makes sense. You're basically trading back to team. Keeping the stars that you've earned is what Okay. Okay. Okay. I get blue and I win. Yes. Okay. Yeah. Yeah. You would take the stars you currently have and you would become team blue and then I would take the stars I currently have and become team orange. Correct. But the so to make So the the deal here is you",
            "start": 256.64
        },
        {
            "text": "would take the stars you currently have and you would become team blue and then I would take the stars I currently have and become team orange. Correct. But the so to make So the the deal here is you ask Tim a question. No, this is going for both of you. This is the same scenario. Greg, you can earn two. You've been asking for it the whole season. I was promised it. I was promised. Well, there was this is me fulfilling it. You can earn the three right here. But if you get it wrong, Tim gets my money back. But what if neither of us get it? Then nobody get it. What happens then? Well, I guess it's jumping or nothing, right? So, yeah. I'm going to make sure somebody wins. Can I What kind of game is it? I'm going to tell you. What? Can I have something of your freaking heroes? Can I have something done? Oh, man. Here we go. Do it. Andy, what should I do? Andy, do it. Andy says, \"Do it.\" I don't know. All right, we're going for it. Triple or nothing. I didn't say yes. Let's do it. We're",
            "start": 309.92
        },
        {
            "text": "done? Oh, man. Here we go. Do it. Andy, what should I do? Andy, do it. Andy says, \"Do it.\" I don't know. All right, we're going for it. Triple or nothing. I didn't say yes. Let's do it. We're going to do it. Now, this is going to be a one round kind of feudy. You each will get two chances to guess the top answers for the prompt. Because he's the challenger, Greg will go first. The prompt is name a game with a lot of climbing. For this one, I'll accept franchise answers. And also for context, this is from a spring 2024 poll. you're not getting answers from after spring of this of last year. We're gonna start off with Greg Miller. Uncharted. Greg says Uncharted. Uncharted is our 50 point answer. Tim, of course, this is regular kind of rule, so you each get two guesses here. Tim, you're up. Legend of Zelda. Tim says Legend of Zelda. Legend of Zelda. Yeah. Okay. Is our 40 point. Yeah. I thought it was 50 answer. Greg, we're back to you. Name a game with a lot of climbing. Oh man, there's",
            "start": 358.48
        },
        {
            "text": "Legend of Zelda. Tim says Legend of Zelda. Legend of Zelda. Yeah. Okay. Is our 40 point. Yeah. I thought it was 50 answer. Greg, we're back to you. Name a game with a lot of climbing. Oh man, there's a lot. This is This is really bad now. This is rough now. And you are accepting franchises. Franchises. I'm going to risk it for the biscuit here. I'm going to go with the audience being more recent duckies. All right. Mhm. I'm going to say Star Wars Jedi. Fall in order, you know, throw it all together. Greg says Star Wars Star Wars is not on the list. Doors wide open. Doors wide open. So bad, man. You just need You need the 30 or 20 point answer. I want to let y'all know how bad I am right now. That all I have in my head. All that I have in my head is Kevin's dong. Just swinging around and mount your friends. Okay. But that's a great answer. I know, but it's not. You No. All right. All right. All right, I need Can we get the timer up? Can we get the timer up, Barrett? Can we get the",
            "start": 412.08
        },
        {
            "text": "mount your friends. Okay. But that's a great answer. I know, but it's not. You No. All right. All right. All right, I need Can we get the timer up? Can we get the timer up, Barrett? Can we get the timer up, Barrett? I have enslaved Odyssey to the West on my mind. Like, that's where I'm at right now. No. Can we get the timer, Barrett? That's not how Fudy works. Yeah, man. Usually I'm the one the timer. You also You also took your sweet times. Tim says Tomb Raider. I like the smile. That means you got it. Tomb Raider is not on the list. Greg just won. Oh my god. Two more of Tim Stars. Yes. Come on. Fun fact, Tomb Raider was our sixth place answer. No. Our 10point answer that nobody got was Horizon. The Horizon Zero Dawn and Horizon Forbidden West games. Oh my god. Our 20 point answer, Assassin's Creed, which I'm shocked right on the table for you, Assassin's Creed. And then our 30 point answer was just if you wanted to go with Rey bias, of course. came out a couple years ago, but last",
            "start": 468.16
        },
        {
            "text": "Creed, which I'm shocked right on the table for you, Assassin's Creed. And then our 30 point answer was just if you wanted to go with Rey bias, of course. came out a couple years ago, but last spring it was still on our audience members minds there. Uh, of course, bring up the Star Trek if you're able to bear it because coming into this, Greg was sitting at four stars with team blue. Tim was sitting at six stars with team orange because Greg just stole three. Oh, we did it. And we did it. Team, we finally writed some wrongs. Greg and team blue are now at seven stars total. Meanwhile, team orange is now back competing with team purple. Three. We got three stars for team orange. Team purple's still sitting at one star. Until next time. [Music] It's been our pleasure to serve you. I did it. I won. Today we end the season. Get ready for game showdown. [Music] Yo, what's up? Welcome to Game Showdown. I'm your host, blessing Addie Jr. and I'm joined by three contestants representing three",
            "start": 524.72
        },
        {
            "text": "I won. Today we end the season. Get ready for game showdown. [Music] Yo, what's up? Welcome to Game Showdown. I'm your host, blessing Addie Jr. and I'm joined by three contestants representing three teams. We have Tim Getty's representing team orange with the title on his shoulder. Still mine and it will be after this somehow someway. I see some stars over there. They will be mine. We got Andy Cortez representing team purple. Happy to be here everybody. You know, it's my last episode on Game Showdown, but how good is kind of feudy, right? Bring it back full time, right? Like the good time. And we have Greg Miller, the Stars in the Bank winner of the season representing team blue. Uh the team that's about to repeat. All right. Team blue unstoppable out here. Corrected because season one, we're not going to worry about that. That's photoshopped. I'm surprised you're buying into the fake news. The other thing we do need to address though is with Andy's retirement. That was a deal him and",
            "start": 576.88
        },
        {
            "text": "not going to worry about that. That's photoshopped. I'm surprised you're buying into the fake news. The other thing we do need to address though is with Andy's retirement. That was a deal him and I brokered. Not again as contestants, but as manager, CEO, and employee. And so Andy said he would trade me as one star if Snowike Mike could replace him on the next season. And so that's a done deal. I need to throw me that star. You're a manager, but you still have to funnel this down to the producers of the No. No. This is not sanctioned. I'm not sanctioning this. No, this is not happening. I'm not agreeing to that. Contestants, we're going to start off with a trivia question worth an entire star. You can buzz in to answer. Now, this is going to be a round of bullet points. I'm going to read to you details about a game, one bullet point at a time. It is your job to buzz in and guess what this game is. You can buzz in once per bullet point. Contestants, are you ready? Yes. So good. Bullet",
            "start": 633.6
        },
        {
            "text": "to you details about a game, one bullet point at a time. It is your job to buzz in and guess what this game is. You can buzz in once per bullet point. Contestants, are you ready? Yes. So good. Bullet point number one. This game's director was chosen by IGN as one of the top 100 game creators of all time. Talking about the game or the director? Yeah, he's it's bullet points on the back of the box for the game. So, I'm going to say Sid Myers Pirates. Sid Myers Pirates is incorrect. Thank you. Happy to be here. Remember, you can buzz in once per bullet point. So, there's no risk. Tim Getty's Uncharted 2. Uncharted 2 is incorrect. Andy, Metal Gear Solid 2. Metal Gear Solid 2 is incorrect. Bullet point number two. This game spawned two sequels and has another title currently in development. It spawned two sequels. Tim Getty's Ninja Giden. Ninja Gaiden is incorrect. Great poll though. Great poll. And has another title currently in development. If nobody has a guess, I'll move on to bullet",
            "start": 678.64
        },
        {
            "text": "spawned two sequels. Tim Getty's Ninja Giden. Ninja Gaiden is incorrect. Great poll though. Great poll. And has another title currently in development. If nobody has a guess, I'll move on to bullet point number three. This game came out the same year as Crisis and Stranglehold. This game came out the same year as Crisis and Strangleold. That is bullet point number three. Andy Cortez, Elder Scrolls Mororrowind. Elder Scrolls Mororrowind is incorrect. Greg, um, Gears of War. I know that's not right. That doesn't add up. Gears of War is incorrect. Bullet point number four. This game is published by the same company as Duke Nukem Forever. Greg Miller. Borderlands. Borderlands is incorrect. Dang, dude. There's another one where I cleared it and as I'm saying, I'm like, well, there's been more than two sequels, but yeah, I had to do the damn thing. I had to say it. Bullet point number five. This game is first person and has a heck Andy Cortez. Bioshock. Bioshock is the correct answer. Oh,",
            "start": 735.4
        },
        {
            "text": "than two sequels, but yeah, I had to do the damn thing. I had to say it. Bullet point number five. This game is first person and has a heck Andy Cortez. Bioshock. Bioshock is the correct answer. Oh, what? That was great. Great set of bullet points. Blast. Thank you. That was good. Very good. I worked hard on that one. Of course, Team Purple came into this episode sitting on only one star because of that correct answer. Team Purple is now up to two stars total. Great work. Great work, team purple. I tied Roger for the amount of stars earned this. The last bullet point was going to well to finish that fifth bullet point, right? Of course, this game is first person and has a hacking system. And then the final bullet point was going to be that this game allows you to biologically modify your body for upgrades such as spewing fire or hornets. And so there you go. That is Bioshock for you. Remember, this is Game Showdown, Kind of Funny's nerdy game show that you can watch live right here on",
            "start": 800.8
        },
        {
            "text": "for upgrades such as spewing fire or hornets. And so there you go. That is Bioshock for you. Remember, this is Game Showdown, Kind of Funny's nerdy game show that you can watch live right here on Twitch and on YouTube. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us support them live and get a daily exclusive show. Big our Patreon producers Anatoli Ast, Delaney Twining, Carl Jacobs, and Omega Buster. Today, brought to you by Imperial and Aura Frames, but we'll tell you about that later. For now, let's play round robin. [Music] The rules are simple. Round robin is a pretty straightforward question and answer game about video games. I'll give you a question. You have your buzzers that you'll use to buzz in and answer said question. You can buzz in once per round. If you give the correct answer, that is 10 points. Whoever gets the most points by the end of round robin receives a star. However, today's",
            "start": 849.36
        },
        {
            "text": "and answer said question. You can buzz in once per round. If you give the correct answer, that is 10 points. Whoever gets the most points by the end of round robin receives a star. However, today's round robin is a bit different from normal. On this round, Robin, I'm only asking questions that you've heard before in this season. Most of which you have all answered incorrectly. That's brilliant. That's brilliant. Are you ready? Oh, yeah. Why not? You're about to look real stupid. If you thought I didn't remember things before. Round number one. In The Witcher 3: The Wild Hunt, Sasha is the alias of which character. This was asked in the first episode of the season. I do remember that. I remember the question. Yeah. Is this the one where we get multiple choice if we don't? No. Get it. Drag. Yennefer. Yennefer is incorrect. Andy and Tim look like they don't have the other one for you. I remember that. If nobody has the answer, the correct answer is Karthia Vancen aka Canthorella. Right",
            "start": 901.92
        },
        {
            "text": "Yennefer. Yennefer is incorrect. Andy and Tim look like they don't have the other one for you. I remember that. If nobody has the answer, the correct answer is Karthia Vancen aka Canthorella. Right in there. Of course, I told you guys this answer about 10 weeks ago. You should have remembered it. No, no, don't know who that is. Round two. The Orange Box released in 2007 is a video game compilation containing five games developed and published by Valve. What were the five games, Greg Miller? Damn it. So, it was Portal, Halfife 2, HalfLife 2 episode 1, Halfife 2 episode 2, and then Team Fortress. That is incorrect. Tim Gettys. That's [ __ ] It is. Yeah. Portal, Team Fortress 2, HalfLife 2, HalfLife 2 episode 1, and Halfife 2 episode 2. Tim, that is the correct answer. That is 10 points for Tim as you go into round number three. The WWE wrestling games are known for many things. One of those things is their creation suite, allowing you to create a wrestler, create an entrance, and more.",
            "start": 960.0
        },
        {
            "text": "Tim as you go into round number three. The WWE wrestling games are known for many things. One of those things is their creation suite, allowing you to create a wrestler, create an entrance, and more. In WWE Smackdown versus Raw 2009, which popular creative feature was added to the franchise, which Greg Miller in his review says doesn't feel fleshed out? Greg Miller. Create a finisher. Create a finisher is the correct answer. That is 10 points to Greg Miller. Round number four. In an earlier episode of Game Showdown, I claimed that since 2009, From Software has released two games published by PlayStation, excuse me, as platform exclusives. When asking what the two games were, the answer of Bloodborne and Demon Souls was rewarded as the correct answer. However, I was actually incorrect. There was a third from software platform exclusive published by PlayStation during this time. Andy Derosene Derosene is the correct answer. Andy Cortez tying this up to 10 points each for for our",
            "start": 1026.04
        },
        {
            "text": "There was a third from software platform exclusive published by PlayStation during this time. Andy Derosene Derosene is the correct answer. Andy Cortez tying this up to 10 points each for for our contestants. Round number five. This is a list countdown. I'm going to list entries in a top 10 list from 10 to one. It is your job to buzz in and guess what the top 10 topic is. is a piece of [ __ ] You're such a piece of [ __ ] And I even like next time around if we were to listen to all the episodes and he'll never do this again. You can buzz in once per entry. Contestants, are you ready? Yeah. At number 10 on this list, you have The Witcher 3: Wild Hunt. We could buzz after every Yeah. So hung up on the one that I should have gotten back in the day. Nobody has a buzz in. We'll move on to number nine on the list, which is Terraria. Andy, best games of the like 2010 to 2019. That is incorrect. If nobody has a buzzing, we'll move on to our number eight entry, The Elder Scrolls 5, Skyrim. Rag",
            "start": 1081.28
        },
        {
            "text": "nine on the list, which is Terraria. Andy, best games of the like 2010 to 2019. That is incorrect. If nobody has a buzzing, we'll move on to our number eight entry, The Elder Scrolls 5, Skyrim. Rag Miller, best mining in games. That is incorrect. That was some [ __ ] like that. I can't believe this is going the exact same way as it did last time. Did you smile cuz I answered that? I Yes. At number seven, Andy. Best games of the century. That is incorrect. At number seven, we got Red Dead Redemption 2. So, so far we have The Witcher 3: The Wild Hunt, Terraria, The Elder Scrolls 5, Skyrim, and Red Dead Redemption 2. Greg Miller, best open world games. That is incorrect. At number six, we have Mario Kart 8 Deluxe. I must have not been on this episode. Tim Gettys, bestselling games of the last 10 years. That is incorrect. Greg Miller. Best DLC's. That is incorrect. Andy. Um, dang. No, I got another. I was going to go with a variation of Tim Snarman. At number five, you got PUBG. Andy,",
            "start": 1140.4
        },
        {
            "text": "last 10 years. That is incorrect. Greg Miller. Best DLC's. That is incorrect. Andy. Um, dang. No, I got another. I was going to go with a variation of Tim Snarman. At number five, you got PUBG. Andy, most concurrent players. That is incorrect. And number four, you got Wii Sports. [ __ ] Nobody's buzzing in, we'll move on to number three, which is Grand Theft Auto 5. If nobody's going to buzz in, we're going to move on to number two. Andy, most revenue. That is incorrect, Tim. Best selling games of all time. That is the correct answer. My [ __ ] god. the 10 best the 10 bestselling video games of all time uh from IGN in a 2024 uh article. Uh number two would have been Minecraft. Number one would have been Tetris. Yeah, you guys struggled on this one the last time we did it as well. That's why I was going to go off a variation of Tim's cuz Blessing paused when you said your answer. I was like, \"Oh, that was close.\" Let's move on to round number six. Tip of the hat for me. No. Alikard is",
            "start": 1215.04
        },
        {
            "text": "I was going to go off a variation of Tim's cuz Blessing paused when you said your answer. I was like, \"Oh, that was close.\" Let's move on to round number six. Tip of the hat for me. No. Alikard is a character from the Castlevania series. First introduced Tim Getty's half human, half vampire. That is the correct answer that question. Not a day walker. Not a day. Different. Half human half vampire is the correct name. Oh, what's the real name? Dude, could you imagine? Oh, I should have done that. You should have done that. I should have flipped the question cuz it would have been Damn Fear. Damn. Yeah, Dan Fear is what I was asking what that was. Uh, let's move on to round number seven. This is the return of publisher puns. I'm going to I'm going to give you short puns/clu. Each of the answers to these clues is a video game publisher. These are all new answers for this special round. Each correct answer is worth 10 points. You buzz into answer. Contestants, are you ready? Yeah. First",
            "start": 1291.2
        },
        {
            "text": "to these clues is a video game publisher. These are all new answers for this special round. Each correct answer is worth 10 points. You buzz into answer. Contestants, are you ready? Yeah. First one. This is another way to call a laughing flounder. Chucklefish. Chucklefish is the correct answer. That is 10 points for Greg. Next. This publisher has technology so good that it brings tears to my eyes. Andy Krytek. Yep. Krytek is the correct answer. That is 10 points. Next up, never say yes. Avoid confir. Tim, I got real antsy cuz Greg keeps beating me and I got scared. I would say never soft. The massage is not the answer. That was a good pick for not having take your hand off the buzzer. You don't get conf I'm just getting ready for next time. Yeah, he's getting ready for round number four. But to continue on with round number three, never say yes. Avoid confirming. And if I were to put it non-verbbally, this Greg, don't nod. Don't nod is the correct answer. Next one. He's good. I like",
            "start": 1344.28
        },
        {
            "text": "But to continue on with round number three, never say yes. Avoid confirming. And if I were to put it non-verbbally, this Greg, don't nod. Don't nod is the correct answer. Next one. He's good. I like this one. Thank you. I appreciate it. I prefer this publisher over Shallow Gold. Craig. Deep Silver. Deep Silver is correct. Damn, Greg's good at this. Next up, this indie label is no longer in the public sector. Greg, private division. Private division is the correct answer. Next. Another way to say uncooked rage, Tim. Raw fury. Raw fury is the correct answer. Neck and neck here with Tim and Greg. Next one. Another way to say uncooked delight. Tim. Raw passion. Raw passion. Raw passion is incorrect. Another way to say uncooked delight. Looks like nobody else has it. The answer there would Give me a second. Give me a second. Give Greg wants a second. Greg wants a second. Give you 10 seconds. So happy enjoyment [ __ ] you killed that at last time in this game. I didn't delight you. Five",
            "start": 1402.32
        },
        {
            "text": "Give me a second. Give me a second. Give Greg wants a second. Greg wants a second. Give you 10 seconds. So happy enjoyment [ __ ] you killed that at last time in this game. I didn't delight you. Five more seconds. I understand. Three, two, the correct answer is Raw Thrills. Thrills. What do they make? Is it? Yeah, Cruis and Blast. Yeah, they do a lot of arcade games. Got it. Uh, next one. When you put something into a knot and the opposite of finger. It's a tough one. When you put something into a knot and the opposite of finger. Nobody has it. I'll reveal the answer. The answer I Is it Can I just start guess? I You want to guess? Yeah. I mean, I don't Well, yeah. I don't want to talk it out. Are we done? Yeah, we're done here. Okay, good. I'm not trying to get the point. like idle thumbs. Uh, I don't know. I stretched this one a little bit. Tido would be it. Uh, tie toe. Okay. Sure. Where I was going. Sure. Okay. Taitoe. Okay. Our last one for this round. Pay attention. Amusement.",
            "start": 1475.6
        },
        {
            "text": "Uh, I don't know. I stretched this one a little bit. Tido would be it. Uh, tie toe. Okay. Sure. Where I was going. Sure. Okay. Taitoe. Okay. Our last one for this round. Pay attention. Amusement. Tim. Focus entertainment. Focus entertainment is the correct answer. And that will tie Tim and team orange with team blue. Now, from here on, correct answers are worth 20 points. And I'm not asking questions to the group. These are tailored questions for each contestant, and you only have 15 seconds to answer. Starting with Greg Miller. Greg. Sid is a cranky villager in the Animal Crossing series. He first appeared in Animal Crossing New Horizons and was added to Animal Crossing: Pocket Camp. What type of animal is Sid? I've asked you this this one directly before. Yeah. And I think I've answered the exact same way I'm being pulled again. Because I want to say wolf, but I feel like toad or frog. Frog. Frog. Greg says frog of that version. Frog is incorrect. Now, since Greg got this wrong,",
            "start": 1536.64
        },
        {
            "text": "the exact same way I'm being pulled again. Because I want to say wolf, but I feel like toad or frog. Frog. Frog. Greg says frog of that version. Frog is incorrect. Now, since Greg got this wrong, Andy and Tim, you guys have the opportunity to rob this round from Greg. I'm going to ask you the question again, and I will give you multiple choice answers. Of course, Sid is a cranky villager in the Animal Crossing series. First appeared in New Horizons and and was added to Pocket Camp. What type of animal is Sid? Is Sid A a tortoise, B a bear, or C an elephant? Andy C elephant. C elephant is the correct answer. That is 20 points for Andy putting him back in the game. I stole that one last time. Andy, it's on you now. What year did the first Call of Duty game release? [ __ ] this. I wrote this. You got 10 more seconds. 2003. Andy says 2003. 2003 is the correct answer. It came out October 29th, 2003 on PC. That's 20 more points for Andy, putting him in the lead. I'd love to see him. Tim,",
            "start": 1599.12
        },
        {
            "text": "You got 10 more seconds. 2003. Andy says 2003. 2003 is the correct answer. It came out October 29th, 2003 on PC. That's 20 more points for Andy, putting him in the lead. I'd love to see him. Tim, you're our final one here. In 2022, the Game Awards introduced a new category called best adaptation to recognize media adapted from video games, including films, TV, and more. The inaugural nominees were Arcane, Cyberpunk Edgeunners, Sonic 2 or Sonic the Hedgehog 2, Uncharted, and a Netflix animated series based on which video game? Cuphead. Damn it. It says Cuphead. Cuphead is the correct answer. Getting Tim 20 points and getting him the victory here. J get a score recap. Oh man, feels like beating Cuphead all over again. Of course, uh getting the win there will bring team orange and Tim uh from three stars to a total of four stars, putting him back in the game just a little bit. Just a little bit. Just a little bit. Keep sniffing at them heels. Keep stiff arming. Yeah, Andy, I need you to",
            "start": 1658.84
        },
        {
            "text": "three stars to a total of four stars, putting him back in the game just a little bit. Just a little bit. Just a little bit. Keep sniffing at them heels. Keep stiff arming. Yeah, Andy, I need you to turn it up. That was a great performance out there. Thank you. I try my best. Now, we got more game showdown for you. That publisher game. I was like, I'm [ __ ] Before we get to it, I want to tell you about patreon.com/conf and youtube.com/conf funny games where you can get the kind of funny membership which allows you to get shows adree. And speaking of ads, let us tell you about our sponsors. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an enormous imposing monolith. As",
            "start": 1721.44
        },
        {
            "text": "it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardiggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder cardigrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses and",
            "start": 1762.0
        },
        {
            "text": "gear to take on the harder cardigrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wish list now. It helps so much. Wishlist Imperial. This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond, beyond. Mother's Day is coming up and I have the perfect gift idea. Ora frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app,",
            "start": 1807.2
        },
        {
            "text": "easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura frames. It takes about 2 minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's auraframes.com. promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. And we're back. And now it is time for the awarding of the bonus stars. My favorite part of the finale every single season.",
            "start": 1853.04
        },
        {
            "text": "Support the show by mentioning us at checkout. Terms and conditions apply. And we're back. And now it is time for the awarding of the bonus stars. My favorite part of the finale every single season. Uh the idea is simple. At the start of the season, I I hit up our Game Showdown stat tracker KDG to keep track of a few key stats throughout the season. Whoever led in these stats by the end of episode 11 is awarded a bonus star today. Now, we have five bonus stars to give out. Oh my god. Let's start with a bonus star for the high score. Uh this is for the team that got the highest score in a single episode. The winner of the high score is team orange aka Tim. That was where we all had like 300 something I think, right? Or two something. I don't know. Yes, this would have been uh so for context, right? Greg doesn't want to pass it off. Keep sliding it over. Not going to help. Not going to help. As always, Katie G doing the devil's work. Uh the highest score this season was fake news. It",
            "start": 1899.6
        },
        {
            "text": "right? Greg doesn't want to pass it off. Keep sliding it over. Not going to help. Not going to help. As always, Katie G doing the devil's work. Uh the highest score this season was fake news. It was 310 points uh from Tim and team orange in week seven. Uh that is that was the uh Mario Party miniame or hit rap song episode. So we had like three different games that we played in one episode there. Uh, this is also the highest score ever on Game Showdown. It's 310 points. So, congratulations, Tim Gettys. Next up is the hate to see it award for the worst performance in a season. Oh, that's that's Greg for Carl. [ __ ] Let's see. Barrett, roll a clip. We got Andy Cortez representing team purple. I'm going to win this three weeks in a row. Name a game with force in the title. Roger will appreciate this one. GeForce the game with the little gerbles that are in secret agents. Remember that the movie the movie movie tying Andy um Returnals [ __ ] lady. I need the full I need the first name of",
            "start": 1952.56
        },
        {
            "text": "this one. GeForce the game with the little gerbles that are in secret agents. Remember that the movie the movie movie tying Andy um Returnals [ __ ] lady. I need the full I need the first name of this character. How how sure are you that you need that? I'm pretty sure I need the name. Oh man. Cuz um you got 5 seconds to answer. Eve. And he says Eve. Eve is incorrect. Dang. Uh Tetus. Tetus is incorrect. The only one I've known out of any of these contests was Acrobat. And I still lost that one. I don't know what Slumber is. You're wasting time right now. Yeah. It's interesting. He's just complaining instead of actually playing the game because he knows he's bad at the game. So you just slumber. I'm sorry. Andy's talking like he hasn't been losing every other episode. Name a Crash Bandicoot character that isn't Crash. Brandy Bandicoot. Blonde hair. Not bad. Not bad. Is that your answer? Brandy. Brandy. Blonde hair. You know, I had a great time on Game Showdown and I'm happy that this is",
            "start": 2010.24
        },
        {
            "text": "character that isn't Crash. Brandy Bandicoot. Blonde hair. Not bad. Not bad. Is that your answer? Brandy. Brandy. Blonde hair. You know, I had a great time on Game Showdown and I'm happy that this is my final season. Oh, is that something you're announcing? I'm happy that Sonic Mike Mike will be replacing me. The way that I look at it, Roger, it's like kind of Futy is my game. Was it aim a game with comedy that makes your eyes roll? Leisure Suit Larry. Hey. All right. Thank you. Okay. Leisure Suit Larry is not on the list. Our 20point answer. Wish nobody got conquer. I thought about it. God damn it. Didn't you go You went twice. Yeah, you went first. What did I say? The first one you said Borderlands. Yeah. And then I said conquer. Did I not say conquer? No, I'm pretty sure you did not. I forget what you said, but you did not say conquer. He said leaders Larry. What did he say? I said Larry. I [ __ ] score the whole time. Andy Cortez representing team purple. I'm going to get a win",
            "start": 2071.04
        },
        {
            "text": "I forget what you said, but you did not say conquer. He said leaders Larry. What did he say? I said Larry. I [ __ ] score the whole time. Andy Cortez representing team purple. I'm going to get a win today. I decided I will. Yeah. 20 minutes later. Just look at the scores right now and understand the importance of moving day because I will end up in last place today. Taking away my earlier prediction I was going to win. I will end up in last place and I need you to just look at the score right now. Last place. We were wondering if he could keep up the lead. Turns out no he could not. He fumbled the bag. It was Andy the night rifle Cortez for Team Purple with 200 points. I didn't fumble anything. I just answered last. What are you [ __ ] talking about? I'm representing team purple and this is the perfect position I want to be in. Right. Zero stars, zero expectations, zero rules for the win. Roger says freaky Friday. Freaky Friday is our 40 point. Andy, I did what you couldn't do. I want",
            "start": 2129.44
        },
        {
            "text": "the perfect position I want to be in. Right. Zero stars, zero expectations, zero rules for the win. Roger says freaky Friday. Freaky Friday is our 40 point. Andy, I did what you couldn't do. I want you guys to draw Chris P. Bacon. Andy again, guys. Chris Bac and white world. Oh, I did a little got a little buck. He's like, \"Yeah, is he a pig guy or is he fading into I don't know the head circle. Is this DC Comics hit event zero hour where everybody got whited out at the end of the comic book?\" All right, come on now. Have a go. Uh, let's see. Tim, it's just a classic. Tim, show me Gregs. Let me tell you guys, Chris Bacon is the coolest pig on the block. All right, Barrett. Show me crisp bacon. Yeah. So, this is crispy bacon. Which one actually matches the energy of this picture? Call it down the middle. No, hold on. Hold on. Falling down the [ __ ] middle. Let's be honest. We know who doesn't have it. So, it's between the two middle. Let's Let's say who doesn't have it. One, two,",
            "start": 2176.4
        },
        {
            "text": "it down the middle. No, hold on. Hold on. Falling down the [ __ ] middle. Let's be honest. We know who doesn't have it. So, it's between the two middle. Let's Let's say who doesn't have it. One, two, three. Andy. Congratulations, Andy. You've earned yourself another star. Thank you. Another fun song for my final season. What a song. I hate to see it. I hate to see it go, but I love to give that. You're giving that stuff. Of course, that should say eight Barrett and two. Mhm. Uh, next up we have the biggest loser. Uh, this is for the total this is for the total most lost points in Rogue Robin. Oh, give me give it to me. Just give it to me. You know it does go to Greg team million ways. I I'm with you Reddit and commenters. I see you. I I don't know why he doesn't read them that there's better ways to do rogue. You agree about the Dom fear thing. So across two games, he'd played two games of Rogue Robin this season. Greg and team blue lost 240 points total. Uh Andy/P purple lost 200 and",
            "start": 2232.56
        },
        {
            "text": "ways to do rogue. You agree about the Dom fear thing. So across two games, he'd played two games of Rogue Robin this season. Greg and team blue lost 240 points total. Uh Andy/P purple lost 200 and Tim/te team orange have lost 90 points. So congratulations reward. You know what I mean? That's great. These are also kind of make goods. You know what I mean? Socialism. Make goods. God. The next one is for the most tips of the hats this season. Thank you. Team purple tied a [ __ ] with team blue. Wow, look at that. Which tied with team orange. Therefore, everybody gets a star. Everybody gets a star. You guys can share this. And this is what's wrong with this goddamn generation participation trophies. You know what I mean? Uh Greg and team blue had three tips of hats. Uh which team purple had as well, which team orange had as well. I gave out three tips of the hats. Uh, team orange though did get some hobnobs, which I don't I don't remember what that was. So, that doesn't count as me",
            "start": 2284.64
        },
        {
            "text": "had as well, which team orange had as well. I gave out three tips of the hats. Uh, team orange though did get some hobnobs, which I don't I don't remember what that was. So, that doesn't count as me winning this. Sure. Some hobnobs. Makes a lot of sense. Just some hobnobs. I'll tell you what, it makes a lot of sense why he didn't give me tip of the hat earlier when I when I glad you understand that cuz that is why I was like, I can't [ __ ] with the numbers. Makes a lot of sense. Uh, we have God, imagine if you had forgotten you were able to call him. We have one more bonus star to give out here and it is for most improved guest. Barrett, roll the clip. We have very special guest Carl Jacobs representing team blue. One more time. You forgot something. Oh, sorry. Sorry. Sorry. Uh Carl Jacobs representing twotime season champions. Team blue or whatever. Order of what? The Stars in the Bank briefcase. Stars in the Bank, everybody. That's what it is. Tim's worst [ __ ] nightmare. Isn't",
            "start": 2337.6
        },
        {
            "text": "representing twotime season champions. Team blue or whatever. Order of what? The Stars in the Bank briefcase. Stars in the Bank, everybody. That's what it is. Tim's worst [ __ ] nightmare. Isn't that right, Gia? Try to sleep now. Try to go on vacation. We got Carl. Name a video game character who lives in a house. Dude, I got a good one. For some reason, I have Nathan Drake in my head. That's a good one. You know what? I'm going to go Spongebob. Carl says Spongebob. Spongebob is not It should have been It should have been Carl had the first one that I was thinking of. Nathan Drake. Andy says Nathaniel Drake. Nathan Drake is our 50 point. You had it answer. You had it. You had it. You totally had it. You had it. You totally had it. Name a popular flash game. Game over, dumb asses. We're going to start off with Carl Jacobs. [ __ ] Cuz I confidence cuz it hit me that everybody that's answering these watch you guys, so they're probably also don't know. I'm I'm locking in run the game run",
            "start": 2382.48
        },
        {
            "text": "to start off with Carl Jacobs. [ __ ] Cuz I confidence cuz it hit me that everybody that's answering these watch you guys, so they're probably also don't know. I'm I'm locking in run the game run on cool math games. It's run and that's getting 50 points. Carl Jacobs is locking in Run on cool math games.com. Run is not on the list. Wait, wait, wait. You laughed at me? Run is the most popular game that's ever released on cool math games. I need to look that up cuz I I remember bringing the cool math games bonafide here. Why am I saying that like it's not cool math games? [ __ ] He thought of it. [ __ ] There's one more turn. Nope. No, you answered twice. Game over, dumbass. Things aren't going. [ __ ] loser. This is why you'll never be Mrs. Beast. Name a yellow video game character. Dude. Dude, it's my chance, baby. He's back. I'm back. Hold on, dumb ass. What is Spongebob Squarepants? That's locked. You're the best. You're the best guy. You're not the best one. You're the best. You're",
            "start": 2440.24
        },
        {
            "text": "it's my chance, baby. He's back. I'm back. Hold on, dumb ass. What is Spongebob Squarepants? That's locked. You're the best. You're the best guy. You're not the best one. You're the best. You're the best. What's the best one? You're the best. Did you just mean to give the points to Andy Carl? You're the best. Did you really do that? What's the other yellow one? You're the best. Holy [ __ ] You're welcome, man. I did it first. Let's go, Big D. Let's go, Big D. Spongebob is our 10point answer. Okay. Points on the board. There's points on the board there. Pikachu. Andy says, \"Pikachu.\" Can I tell you that wasn't even the one that I had a realization about? I don't know if we've seen a double- digit game in a long time. There is a conflict of interest. Yeah. Patreon producers, list them. Uh, Delaney Twining, Carl Jacobs, and Omega. You You produce this show? No. You know what? We're not sure if that's me. No. I'm not the only Carl Jacobs. I have an uncle named Carl Jacobs. I have a",
            "start": 2496.96
        },
        {
            "text": "Uh, Delaney Twining, Carl Jacobs, and Omega. You You produce this show? No. You know what? We're not sure if that's me. No. I'm not the only Carl Jacobs. I have an uncle named Carl Jacobs. I have a grandpa named Carl Jacobs. This is wild. He passed away. Maybe he never stopped renewing though. He was a fan back in 2015. He kept going. Maybe he never stopped renewing. We don't know. Name a battle royale game that is not Fortnite, War Zone, or Apex Legends. Carl, it's a tax that I have to pay. He has to pay it. What is PlayStation Allstars Battle Royale? Carl says, \"PlayStation Allstars Battle Royale.\" PlayStation Allstars Battle Royale is not on. Oh, I was really I truly believed it. Yeah, I truly believed it. It's a Okay. Tetris 99. Tetris 99 is our 30 point answer, ladies and gentlemen. God, I'm doing it. [Music] Congratulations, Carl Jacobs. Uh, now because he's our most improved guest of the season, it is Carl's star to give. So, let's see who's it who it's going to be. Oh, Lord.",
            "start": 2554.8
        },
        {
            "text": "God, I'm doing it. [Music] Congratulations, Carl Jacobs. Uh, now because he's our most improved guest of the season, it is Carl's star to give. So, let's see who's it who it's going to be. Oh, Lord. Hey, what's going on guys? Kind of funny Nation here. I just want to say thank you so much for choosing me to be the guest of the year for Kind of Funny Game Showdown. And because of that honor, I get to award a bonus star. And uh it should be no surprise who this bonus star is going to Greg Miller. Give a round of applause for Andy Cortez, the winner of this prize. Yeah. Thanks for letting me be a part of this goofy old game that we play. And uh I'll see you guys next time. Thanks, Carl. Wow. There you go. That's amazing. If we can bring up the Star Trek, our finest a final bonus star here. Of course, now we have comeback season. Team purple, aka Andy Cortez, sitting at five stars. Team orange is now up to six stars. Team blue is up to nine stars. Uh before we move on to our final",
            "start": 2617.76
        },
        {
            "text": "here. Of course, now we have comeback season. Team purple, aka Andy Cortez, sitting at five stars. Team orange is now up to six stars. Team blue is up to nine stars. Uh before we move on to our final segment, I got some more fun stats for you. Brought to you by the one and only KDG. Um, no one has guessed the warm-up question in episode 1. In all three seasons, fun fact, uh, but someone has got the answer in every single other episode across all seasons. Tim/or has the highest cumulative score and the fewest wrong answers. Um although Tim before they switch. No, this is for the season. That's that's still current. Yeah. Still my name. He doesn't own that yet. KG is always going to find some way to [ __ ] me over. That's all she does. It's the team It's the team orange version of Tim. Uh and then although Tim has the most commulative points, Greg has given the most right answers uh this season. Greg/te team blue has also answered the most questions total. um and has passed the least as",
            "start": 2675.44
        },
        {
            "text": "then although Tim has the most commulative points, Greg has given the most right answers uh this season. Greg/te team blue has also answered the most questions total. um and has passed the least as well. Um Andy was right that he's come come in second the most. Um Andy, Team Purple has come second six times this season. Team Blue got the most 10-point answers in in kind of feudy, but none were from Greg. It was all Carl and Nick Scarpino. Oh, okay. That's an interesting set this [ __ ] show. In week six's uh kind of feudy, we saw the only clean sweep of the season in round two. This meant that Andy didn't get a second guess that round as all five answers were found in the first five guesses. There are also two full wipes in week seven, rounds one and five, which meant that all answers were guessed, but it took all six guesses. Uh, in week six, team blue, aka Carl, officially got the lowest ever kind of feud score with just 50 points. Before that, it had been it had been team orange",
            "start": 2722.16
        },
        {
            "text": "guessed, but it took all six guesses. Uh, in week six, team blue, aka Carl, officially got the lowest ever kind of feud score with just 50 points. Before that, it had been it had been team orange with 70 points in season 2, episode 9. Finally, Tim, that was you. That was you. Oh my god. Team orange sticking up the joint. Our final bullet point here. The lowest winning score was from Greg in week 11 with 80 points. That is it for the awarding of the bonus stars. Now it's time. Where do you go Katie? For final feud. [Music] Barrett, do me a favor. Reset the scores. Thank you. Cuz the rules are simple. In September of 2024, Maline Stanley surveyed over 700 members of the kind of funny audience on a number of prompts. She then proceeded to not use answers from her survey and opted to quiz us on Stokeike Mike's answers for a special episode of Game Showdown. Today, we finally used the actual answers to her poll with a couple of returning questions and some new ones as well. Each round, I'm",
            "start": 2770.48
        },
        {
            "text": "Stokeike Mike's answers for a special episode of Game Showdown. Today, we finally used the actual answers to her poll with a couple of returning questions and some new ones as well. Each round, I'm going to read to you a prompt and we'll ask each of you which answer you think the kind of funny best friends gave the most. I've narrowed down to five answers per prompt. If you give the correct answer, the more popular the answer, the more points you'll receive. However, Final Futy is different from Kind of Futy. Final Futury is only two rounds in a bonus round and you get a star for every 50 points. So, if you end the game with 100 points, that is two stars. Contestants, are you ready? Ready? Yes. I believe I am blessing. Thank you for asking me. round. What is he on? What's up with the I think he won. That's the I know. I think he already won. No, no, no, no, no, no. You know how this goes. Round number one. What is the best video game movie? We're going to start off with the person",
            "start": 2827.2
        },
        {
            "text": "think he won. That's the I know. I think he already won. No, no, no, no, no, no. You know how this goes. Round number one. What is the best video game movie? We're going to start off with the person with the lowest amount of stars currently, Andy Cortez. Um, the best video game movie. Correct. What is the best video game movie? Not franchise. not franchise. What is the best video game movie? I believe Mike when we did the um fun episode last year with Maline Stanley. His answer was something that we were we were like you don't talk about. I think it was Tomb Raiders. Oh, that's right. That's right. That's where he said Chiotto as one of the music acts. I was like what? Uh best video game movie. Um I'm going to go with the Super Mario Brothers movie. Andy says the Super Mario Brothers movie. Super Mario Brothers is our 50 point answer. That is an entire star right there. Thank you for Andy Cortez. We'll tabulate that later. Next up, Tim Getty's. Detective Pikachu. Tim says Detective",
            "start": 2875.16
        },
        {
            "text": "Super Mario Brothers is our 50 point answer. That is an entire star right there. Thank you for Andy Cortez. We'll tabulate that later. Next up, Tim Getty's. Detective Pikachu. Tim says Detective Pikachu. Detective Pikachu is our 30 point answer. Greg Miller. Sonic the Hedgehog. Greg says Sonic the Hedgehog. Sonic the Hedgehog is our 20 point answer. We're back to Andy. When was this done? September 2024. September 2024. Maline Stanley was here. You had pizza for lunch. We did have pizza. Was that the day where Mike ordered the pepperoni pizza? I think that was the day he had no one to blame even though he really wanted to blame Roger. Uh, I'll go with Sonic the Hedgehog 2. Andy says Sonic 2. Sonic 2 is our 10 point answer. Tim, you're up. Can you quickly say the question again? Yes. What is the best video game movie? We only have our 40 point answer left. Yeah, I know. Oh, wow. We're close to a full wipe sweep clean. Pokemon the first movie. Says Pokemon the first movie. Pokemon the",
            "start": 2929.56
        },
        {
            "text": "is the best video game movie? We only have our 40 point answer left. Yeah, I know. Oh, wow. We're close to a full wipe sweep clean. Pokemon the first movie. Says Pokemon the first movie. Pokemon the first movie is not on the list. Uncharted. Greg Miller. Sonic the Hedgehog 3. Oh, [ __ ] me. Greg says Sonic 3 Greg. Unfortunately, Sonic 3 came out months after Oh, yeah. Mattlin was here and it's all new to me. I watched him at home with Ben. These are great flicks. It is not on the list. the 40point answer, which nobody got. Mortal Kombat. Mortal Kombat, the original Mortal Kombat movie. With that, Andy got the 10-point answer with Sonic 2. Greg got the 20 point answer with Sonic 1. Tim got Detective Pikachu, which was 30 points. And Andy got our 50 point answer with Super Mario Brothers. Everybody say uh Uncharted. I think a few people said Un. It's not bad. This is not a great Uncharted movie. You know what I mean? I'll say what the Warcraft movie underrated. Next up. Didn't mean to",
            "start": 3004.4
        },
        {
            "text": "Everybody say uh Uncharted. I think a few people said Un. It's not bad. This is not a great Uncharted movie. You know what I mean? I'll say what the Warcraft movie underrated. Next up. Didn't mean to actually hit it. Got to be real. I mean, I would dock a pointer. It's a full star. Round number two. Which game has the best character creation system? [ __ ] Now, [ __ ] Because of a tie, there are two 20 point answers. We're going to start off with team blue as Greg Miller. [ __ ] I remember this one. I remember when Mike ran in and had a bunch of [ __ ] [ __ ] Wait, are these these are the real answers? real answers. These are audience answers. Oh, I remember Mike's answer pissed me off. But I remember he gave one that there was one that made sense that he said that we that I was like I want to but I that's where it's in my head now. And I feel like that's not our audience, but our audience also knows things. But then do they know this is September 2024? [ __ ] Never forget. Never",
            "start": 3054.16
        },
        {
            "text": "I want to but I that's where it's in my head now. And I feel like that's not our audience, but our audience also knows things. But then do they know this is September 2024? [ __ ] Never forget. Never forget. The day the earth sits still. Yeah, I know. We had pepperoni pizza. Pepperoni less. That was such a sad day, too. We were all so sad. Everybody was so upset. And he was like just like you could tell he was like, I [ __ ] this up. He ruined you ruined the day for us. We were just like, man, we you really underrate how heavy the pepperoni carries the experience. I was trying to bread pepper. I was like, you have the 30 second timer. I'll I'll go if you want. I it's I'm gonna say it. It is a good one, but it's the NBA 2K series. Greg says NBA I can't remember if that was Mike's and we were like that's a great answer and got nowhere or what. NBA 2K is not on the list. Tim Getty's Black Desert. Tim Gettys says Black Desert. Black Desert is our 10point answer. Andy. Um, best character",
            "start": 3107.28
        },
        {
            "text": "like that's a great answer and got nowhere or what. NBA 2K is not on the list. Tim Getty's Black Desert. Tim Gettys says Black Desert. Black Desert is our 10point answer. Andy. Um, best character creator. I'm gonna go with I remember one of the answers and it pissed me off, but those weren't the real answers. Yeah, I know. Yeah. Not the same answers today. Yeah. And that's why I was so quizzical that day. Great work. Why would they say that? you know, while you eat your pepperoni pepperoni. So dry. Um, I'm going to go with uh The Sims 4. Okay, Andy says The Sims 4. The Sims and it's packaged as a franchise is our 20 point answer. It's one of our 20 point answers. We have two 2020 answers. As a reminder, he's got it. We're back to Greg Miller. Dragon's Dogma 2. Greg says, \"Dragon's Dogma 2.\" Dragons Dogma 2 is our 40. I was like, I knew it. I remember it being there and me like, \"Oh, wow.\" Tim, I'm going to say Miis. Nintendo Mi. Tim says Nintendo Miis. Nintendo Mi are not on the list.",
            "start": 3163.04
        },
        {
            "text": "Dragons Dogma 2 is our 40. I was like, I knew it. I remember it being there and me like, \"Oh, wow.\" Tim, I'm going to say Miis. Nintendo Mi. Tim says Nintendo Miis. Nintendo Mi are not on the list. Andy, Dragon Age the Veil Guard. If only, man. Andy says Dragon Age the Veilgard. Dragon Age the Veilgard is not on the list. I think you mistimed that. I think Dragon Age the Veilgard might have been an October game or at least the poll probably went out before that game came out. Oh, I thought that was a February game. Why am I thinking that was an early game? Whoops. We went to that preview event somewhere in there. Oh, that may have been You spent all the time in the pre character. We did. I remember [ __ ] Mike, one of Mike's answer being World of Warcraft. I was like, \"What?\" There's like five hairstyles. Uh, unfortunately, this could have been a big round for you, Andy, because yeah, our our 20point answer, which nobody got, or one of the 20 point answers, which nobody got, was WWE",
            "start": 3241.44
        },
        {
            "text": "five hairstyles. Uh, unfortunately, this could have been a big round for you, Andy, because yeah, our our 20point answer, which nobody got, or one of the 20 point answers, which nobody got, was WWE 2K, which I thought Greg would do, but he went to with NBA instead. Our 30-point answer, Cyberpunk 2077. Um, and then our 50point answer, which I thought would would have been Andy's bag, was Balders's Gate 3. Oh. Oh, I thought Balders Gate three and Dragons Dogma 2 being the top two might have put you in in contention for maybe a huge comeback. I've always thought that was an overrated character grade to be honest with you. Dragons Dogma Dragons Dragon Age of Veilgar clears, but wrong date with that. Tim got the 10 point with Black Desert. Andy got the 20 point with the Sims. Greg got the 40 point with Dragons Dogma 2. It's now time for our bonus round. I have three categories left on the board. Each of you has one shot to choose a category and clean up the answers on the board for those",
            "start": 3294.0
        },
        {
            "text": "point with Dragons Dogma 2. It's now time for our bonus round. I have three categories left on the board. Each of you has one shot to choose a category and clean up the answers on the board for those amount of points. If you get one strike, you're done. And we end your run there. We'll start with the person who has the least stars, Andy Cortez. Can you explain the rules one more time? We kind of just phased out there. Yeah. So, I got three categories that I'm going to put up, right, that you get to choose from. Uh, you have you have one shot to clean up the answers on that category. Guess what all those answers are. If you make a mistake, that's where it ends. Okay? and we just give you the points that that you already got. Our three categories are Barrett can pull them up. You got trophy hunter, aged like milk, and goish. Andy, it's your choice on which one you want to tackle here. Aged like milk. Andy is going with aged like milk. The prompt read like reads like this. Name a game",
            "start": 3334.0
        },
        {
            "text": "hunter, aged like milk, and goish. Andy, it's your choice on which one you want to tackle here. Aged like milk. Andy is going with aged like milk. The prompt read like reads like this. Name a game that is not as good as you remember it. Oh, dang. That's [ __ ] tough. Um, franchises. No. Okay. Name a game that is not as good as you remember it. Uh, god damn. I'll go I don't know. Super Mario Sunshine. Mario Sunshine is our 40point answer. Holy [ __ ] What's your next guess? Um, this one's a little too meta, so I don't want to go for that yet, but I'm going to say uh [ __ ] after a little bit. I will add a timer. Ocarina of time. Ocran of time is not on the list. So that is where your run ends. Next up, can I ask the 50 point answer just for fun? Yeah, go for it. Golden Eye. Golden Eye would have been the 50 point answer. Uh the 30 point answer would have been Mario 64. The 20 point answer would have been Uncharted 1. And then the 10-point answer would have been GTA 3. Tim, we got two",
            "start": 3376.48
        },
        {
            "text": "have been the 50 point answer. Uh the 30 point answer would have been Mario 64. The 20 point answer would have been Uncharted 1. And then the 10-point answer would have been GTA 3. Tim, we got two categories left for you to choose from. Do you want to go with trophy hunter or go fish? Of course, it's a big decision cuz Greg Miller is the trophy guy. Yeah, it's it's you can already you know how this is going to go. I just we pulled the people of the best thing or the best trophy. Yeah. Okay. I just don't know fish. That's fair. That's just my big thing, man. Fishing games like Oh, man. Uh like even like fishing mini games like that. I don't know. I'm going [ __ ] it. Go fish. Why not? Tim is going fishing. Let's let Craig [ __ ] win even more. Tim, what game has the best fishing mechanic? Oh, [ __ ] it. Yeah, Final Fantasy 15. Yep, that's on there. That's our 20 point answer. Now, do I want to help out just to make it close? No. Our whole [ __ ] thing is trying to defeat him all season",
            "start": 3467.44
        },
        {
            "text": "[ __ ] it. Yeah, Final Fantasy 15. Yep, that's on there. That's our 20 point answer. Now, do I want to help out just to make it close? No. Our whole [ __ ] thing is trying to defeat him all season long. No, you don't want to have He's so far behind already. No, this is [ __ ] Don't do it. He's so Even if you're not on the show, next time I'll [ __ ] I'll torture you if you do this right now. This is a big round, too. Cuz like if Tim Let's say Tim gets all of these and Greg [ __ ] up one, we're aware how important this is. [ __ ] I was unaware. I was unaware. I thought he won no matter what. I [ __ ] that up. I should have went trophy. It's fine. It's fine. I'm playing the game here. He's playing the game. Um, is it game or is it franchise? We're going Legend of Zelda. Is it a franchise? Uh, I need a game. Okay. Legend of Zelda. Just Legend of Zelda. No, Twin Snakes. [ __ ] man. Twilight Princess. Tim says Zelda Twilight Princess. Zelda Twilight Princess is not on the list. Uh, of",
            "start": 3524.24
        },
        {
            "text": "Uh, I need a game. Okay. Legend of Zelda. Just Legend of Zelda. No, Twin Snakes. [ __ ] man. Twilight Princess. Tim says Zelda Twilight Princess. Zelda Twilight Princess is not on the list. Uh, of course, you got the 20 point answer with FF Animal Crossing. Yeah, that's what I was going to tell you. Our 40point answer would have been Animal Crossing. And I would have taken the franchise answer for that one. Uh our 50 point answer, Stardy Valley. Our 30point answer, uh Red Dead Redemption 2. Uh our 10point answer would have been Pokemon as a franchise. Yeah, they got fishing. I wouldn't have got Red Dead. Yeah, that's how you get rod. Good rod. Rod. I just think of that as like catching. I don't think of that as like a mini game in a It's just fishing mechanic. You're just fishing mechanic. Yeah. Uh, Greg, I'm pretty sure you have the season in the bag by the way that math works, but we'll try not to we'll try to act like we don't for just for a victory round. Of course, now you're",
            "start": 3567.68
        },
        {
            "text": "Yeah. Uh, Greg, I'm pretty sure you have the season in the bag by the way that math works, but we'll try not to we'll try to act like we don't for just for a victory round. Of course, now you're you're you've ended up with trophy hunter as your prompt, which reads like this. Name an embarrassing trophy/achchievement that you have. Oh, sure. For this one, I will accept the name of the game that the trophy is from. If you can describe to me how to get the trophy. Okay. Yeah. Oh, what you got for me? I mean, my name is Mayo would be right at the top of the list where you're just tapping on the main HRs. The platinum. Yeah. I'm going to give that to you. That is the 40 point answer. You really [ __ ] up, too. Well, he wouldn't have had any of these. I would at least had I would had I had Final Fantasy for the fishing. So, I didn't So, then just an embarrassing trophy. Yeah, there's that one God of War II one that's very like I would have [ __ ] her if I hadn't let her get ripped in half",
            "start": 3620.48
        },
        {
            "text": "Fantasy for the fishing. So, I didn't So, then just an embarrassing trophy. Yeah, there's that one God of War II one that's very like I would have [ __ ] her if I hadn't let her get ripped in half or some [ __ ] like that. I forget what it's called. That one is not on the list. Okay. Our 10-point answer, the ZJ the Ball Platinum. Ah, okay. Our 20 point answer is called I swear I did it by mistake. It's from Lollipop Chainsaw. Uh and it's that you skirt. Yeah, you peeped under Juliet's skirt once. I read about that. Our 30 point answer is dot dot dot. I did it for the achievement. Uh this is from Yakuza Zero. It is uh you watch a racy video. Oh, nice. Um and then our you got the 40.1 which is the my name is Mayo Platinum. Uh and then our 50point answer is what are you doing from Near Automa? uh where you it's it the description just reads Tuby's secret discovered 10 times. I'm pretty sure you look up her skirt 10 times for this. Sure. Fair. Fair secret. Uh with that, it's now time for",
            "start": 3658.64
        },
        {
            "text": "uh where you it's it the description just reads Tuby's secret discovered 10 times. I'm pretty sure you look up her skirt 10 times for this. Sure. Fair. Fair secret. Uh with that, it's now time for the tabulations. Uh if I'm looking at this correctly, right, team blue, Greg Miller would have got I don't know where I wrote down Barrett in my document. Uh Greg Miller would have gotten two stars uh for that uh round. Uh team purple aka Andy also would have gotten two stars for that round. and Tim would have gotten one star for that round. Barrett, if we can bring up the star standings. Doing the math here. Team blue from 9 to 11. Went from nine. [Music] Some things are just a little too perfect. Team blue went from 9 to 11. Team purple went from seven to 9. 5 to seven or sorry, 5 to 7. Uh, and then team orange went from six to seven. Look at us just side by side, too. Feels good. We're equals in every way. Yeah. I mean, that's big. Andy Cortez was able to catch up to second place. But, of",
            "start": 3705.92
        },
        {
            "text": "then team orange went from six to seven. Look at us just side by side, too. Feels good. We're equals in every way. Yeah. I mean, that's big. Andy Cortez was able to catch up to second place. But, of course, we have our one true champion of the season. Congratulations, Greg Miller. What the hell has Rob and team blue? At least it's those three stars really became pivotal. It's back home as you would think they would. You know what I mean? And as one man thought they would and his name was Greg Miller. Oh god, what a I've been waiting a long time to break this out. What is this? Andy, I'm going to need your help. All right, I need you to read this email. All right, you can read everything that's highlighted. Okay, everything that's highlighted. Kind of funny podcast interview with Guy Fiery. Hey Sarah and then redacted. Don't worry that I redacted. Okay. If we couldn't get guy in the office, I'd morph the idea into something else. I think a funny bit would be that out of the blue on an",
            "start": 3758.88
        },
        {
            "text": "Hey Sarah and then redacted. Don't worry that I redacted. Okay. If we couldn't get guy in the office, I'd morph the idea into something else. I think a funny bit would be that out of the blue on an episode, I announced that the amount I'm winning this season has turned heads. And I'm happy to announce my first personal sponsor, Santos Spirits, and reveal that I'm wearing a Santos Spirits shirt. Midway through the episode, I say I need some inspiration to answer, and I pour myself a splash of Santos Spirit. Then in the last round I say I need a pep talk and I play a video from guy telling me I can do it. Thoughts? And what's the date? February 4th, 2025. Guyarious people never got back to me. They sent me the alcohol when they thought I was going to do an interview with Guy and then when they were like, \"Well, he can't come in.\" I was like, \"Well, what if he calls into our game? Should they stop talking to me?\" I'm a champion. Oh [ __ ] You know, Greg told me about this bit months and",
            "start": 3813.36
        },
        {
            "text": "were like, \"Well, he can't come in.\" I was like, \"Well, what if he calls into our game? Should they stop talking to me?\" I'm a champion. Oh [ __ ] You know, Greg told me about this bit months and months ago and I forgot that [ __ ] has happened under my desk for so long. Roger, come get some delicious Santa spirit to celebrate my victory. That's the saint spirit. Everybody put put it together. Of course, for team blue, the three Pete the three Pete champions here. Andy, you want to be a part of it? No. Okay. Andy want to be a part of it. The three Pete champions. Tim, you [ __ ] off. Nobody's choosing you. And what I need everyone to understand is I heard I heard all the feedback about Stars in the Bank. Maybe it went on too long. Maybe it should have infected content as much as it did. You have no [ __ ] idea how annoying I'm going to be about this championship. Do you want to know what's happening very soon? I'm throwing a championship parade in San Francisco, everyone. He told me",
            "start": 3861.84
        },
        {
            "text": "You have no [ __ ] idea how annoying I'm going to be about this championship. Do you want to know what's happening very soon? I'm throwing a championship parade in San Francisco, everyone. He told me that on Games Daily. He told me. Follow me on Blue Sky to find out when and where. [Laughter] Oh, that is good. Oh, that's really good. That's actually really clean. Yeah, that that goes smooth. Oh, man. Yo, shout out Santos. Of course the show. Not sponsored though. It could have been Guy. Yeah. Where you at? Guy, man. Yeah, Guy Fury popped off. Oh man, that's [ __ ] more of that. Send more of that, please. Bear, come get a poll. Yeah, Bear, come get some after the after I after I wrap the show cuz I'm about to do the outro, of course. This has been Game Showdown season 3. We'll be back more this year with more Game Showdown cuz we promised you two seasons plus a Nick Scarpino special mini season thing that we're still trying to figure out. It's been on the It's been on the books on the",
            "start": 3909.72
        },
        {
            "text": "this year with more Game Showdown cuz we promised you two seasons plus a Nick Scarpino special mini season thing that we're still trying to figure out. It's been on the It's been on the books on the calendar to meet about it for a while and things get keep happening. I went to Japan. It's a whole thing. Uh, but we will be back with more Game Showdown in the future. Thank you guys so much for supporting this season of Game Showdown. Uh, thank you, Greg, for all all of your shenanigans. Great farewell celebration for me. Andy Cortez, everybody. I'll make sure Andy comes back. I'll try at least. Uh, this has been Game Showdown season 3. We'll be back with another season 2. Until next time, it's been our pleasure to serve you.",
            "start": 3970.16
        }
    ]
}