{
    "id": 14168,
    "video_id": "m_OOvP6ZW5s",
    "show_name": "Highlights",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "It's Time to Bring Back Battlefront!",
    "description": "From KFGD: https://youtu.be/lEY3D3o0QEU?list=PLy3mMHt2i7RIl9pkdvrA98kN-RD4yoRhv \n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1748552455,
    "duration": 1138,
    "transcript_chunks": [
        {
            "text": "to story number two. Star Wars Battlefront 2 smashes all-time Steam numbers, bolstered by social media campaign. This is Jordan Midler at Video Games Chronicle. Star Wars Battlefront 2 has beaten its all-time Steam concurrent player numbers 5 years after the game was released on the platform. The game, which has seen a spike in popularity over the last week due to a social media campaign from fans attempting to revitalize interest in the series, saw 18,635 players on Steam on Monday. The highest number of concurrent players achieved on the platform since it was released. Before this week, the highest the peak had ever reached on Steam was 10,489 back in January 2021, meaning the new record has nearly doubled that. The game also reappeared on the list of Steam's 25 top selling titles, suggesting that the social media campaign has recruited new players as opposed to simply sparking a resurgence from existing ones. Mike, how you feel about that? Yeah, here's a fun one for you, Bless. This",
            "start": 0.08
        },
        {
            "text": "that the social media campaign has recruited new players as opposed to simply sparking a resurgence from existing ones. Mike, how you feel about that? Yeah, here's a fun one for you, Bless. This is a cool one coming out of the weekend. I know a couple of my friends have jumped back in and are riding the high off of whatever this Star Wars fever is. I mean, of course, we know May the 4th is always kind of the pump up of more Star Wars in your life as you go through no matter where you're at. It's like May the 4th happens. You put the movies back in theaters. You get some sort of Star Wars content on video games and people want to jump back into the fun. But I mean, this is something I didn't think would ever happen. Bless, but at the core of it, it's like the Battlefront games are great games. They're fun times with your friends. There's something easy to jump in and jump out of, right? You can break free of Fortnite when you've already been playing a bunch of Star Wars content. And if",
            "start": 47.28
        },
        {
            "text": "They're fun times with your friends. There's something easy to jump in and jump out of, right? You can break free of Fortnite when you've already been playing a bunch of Star Wars content. And if you want more, here's a good game for you to play, right? And so if we rewound time and we talked about the microtransactions and all of that when the fir when the game first came out, it'd be something. But like Battlefront at its core is still a very good game. Yeah. Have you been watching Star Wars Andor? No, cuz the streets are [ __ ] with it. Let me The streets [ __ ] with season one. Of course. I mean, you build off of Andor as well for the hype. You want to play a video game? There you go. Yeah. I I think part of it is that too. Like I don't Indoor doesn't strike me. Andor strikes me as more of a critical darling than a commercial like everybody's watching uh Andor sort of thing. But I wouldn't be surprised if there's like a snowball effect where of course um I don't know maybe",
            "start": 86.08
        },
        {
            "text": "as more of a critical darling than a commercial like everybody's watching uh Andor sort of thing. But I wouldn't be surprised if there's like a snowball effect where of course um I don't know maybe streamers watched Andor and then like started streaming Battlefront game and then you see the audience like pick up alongside this campaign that's happening from the audience to get more people in. Either way, good for y'all, right? Like do you I are you somebody first of all, how much Battlefront did you play? And then also, do you think this leads into possibly a resurgence enough for us to get a Battlefront 3? No, I don't think we will have enough. Now, when I say that, I am someone who rides or dies for Battlefront, right? Like, I'm talking OG Battlefront 1 and two on your PlayStation 2os. I love those games, right? I am someone that was there day one and beyond for the recent Battlefronts. And I even put up with the craziness that was what it was recently. But I like this game a lot,",
            "start": 124.4
        },
        {
            "text": "I love those games, right? I am someone that was there day one and beyond for the recent Battlefronts. And I even put up with the craziness that was what it was recently. But I like this game a lot, Bless. And I do want another one. I think the Star Wars universe, I think the Battlefront concept is just such an easy, perfect win, right? Like that is a fun time for anyone, whether it be the hardcore firstperson audience, first-person shooter audience, or just the casual audience that wants a Star Wars experience. It's awesome, right? You get to be a Stormtrooper running around with hundreds of other players. There's X-wings flying over your head. You're on this giant behemoth of a map running around. They have conquest mode just like back in the day with Battlefield where you take one point then you go to the next point. It's like you have this long battle that can last up to like 30 to 45 minutes and it's just a fun time of Star Wars. And so when I think about that, yes, I want more",
            "start": 165.2
        },
        {
            "text": "then you go to the next point. It's like you have this long battle that can last up to like 30 to 45 minutes and it's just a fun time of Star Wars. And so when I think about that, yes, I want more Star Wars in my life with a Battlefront 3. Do I think that is in the cards in the next 5 years? No. Right. I don't think five years even. I I don't think Is it an EA thing? Yeah. I mean, well, they got to figure out Battlefield first, right? like Battlefield's got to come first and then yeah, licensing out with Disney and figuring out where we can come back with that. I think Disney has done a really good job letting others play in the Star Wars universe and letting people get their hands on this IP and other IPs that like have done well. But I mean, it would be hard not for Disney to be like, \"Yeah, you can make another Battlefront, right?\" But EA is also in a spot where it's like EA's like Ubisoft trying to pick a winner here and stick with that right now. That's my thing is I think from",
            "start": 206.0
        },
        {
            "text": "\"Yeah, you can make another Battlefront, right?\" But EA is also in a spot where it's like EA's like Ubisoft trying to pick a winner here and stick with that right now. That's my thing is I think from the Disney side, Disney seems to always be down for Star Wars games, right? They always want that to be out in the ether. Like, you know, I a few years ago I put up a blessing show that was all about Star Wars video games and how there's a lineage, right? Like Star Wars as a as is like Star Wars is practically a video game franchise in a lot of ways when you look at like all the different games that have come out. We've had two different Battlefront series over the years come out, right? So, like I think like Disney is always like looking for what's next for that and what makes sense for that. And then from the EA side, right, like I think if there's money in it, I don't see why not. I I understand the thing of, you know, the last I think especially Battlefront 2, you had that rough",
            "start": 250.4
        },
        {
            "text": "that. And then from the EA side, right, like I think if there's money in it, I don't see why not. I I understand the thing of, you know, the last I think especially Battlefront 2, you had that rough beginning there with the microtransactions and the loot boxes. And I totally understand the idea of Disney being like, \"Fuck that. We're not working with them anymore on this thing.\" Like, you know, this is trash. But I think the recover the recovery has been so good, you know, like I I think seeing these player numbers still resurge, right? It reminds me of see of of seeing Skate 3 over time where streamers will play it and then, you know, their audiences will hop in and then you see those Skate 3 numbers sustain so much and then you see the audiences demand for Skate 3 like month after month, year after year to then finally EA's like, \"Fine, we're going to give you we're going to give you the next Skate game. We're going to give you the Skate 4.\" I think Battlefront obviously like",
            "start": 287.28
        },
        {
            "text": "month, year after year to then finally EA's like, \"Fine, we're going to give you we're going to give you the next Skate game. We're going to give you the Skate 4.\" I think Battlefront obviously like there's there's the audience that's hopping into to two. I would be so fascinated to see if that turns into people being like, \"Yeah, where's three at?\" Like, \"Give us three. Like, we want Battlefront 3.\" And how much of that then can translate into EA and Disney talking being like, \"The numbers speak for themselves. Like, we got to give them what they want.\" Cuz do you what all a question I'll ask you, right? What is the potential for the next Battlefield numbers versus the next Battlefront numbers? Like is is Battlefield is Battlefield like a given that is always going to sell more than a Battlefront or be more popular? No, I think they're pretty close. Bless, right? I I I would love to side on the side of Battlefield, but I think both of those are going to probably get me the end result",
            "start": 328.08
        },
        {
            "text": "or be more popular? No, I think they're pretty close. Bless, right? I I I would love to side on the side of Battlefield, but I think both of those are going to probably get me the end result if I'm EA either way. Right. And so what I was going to pitch you on is like why don't we focus on the battlefield right now and try to nail that in this next one to two years and then after that have the next cycle of hey let's switch the battlefront right kind of have that on andoff situation going on right now because I do think both are bringing in the exact same if you really look at it right my question to you would be like do you really think all these companies have proven they want one thing and they want that reoccurring bill they want people to come in and give them more money each and every day they want you to come in and give them your time. And I just don't see Battlefield and Battlefront at this moment right now being the big winners. They're going to win, but they're not going to",
            "start": 370.88
        },
        {
            "text": "day they want you to come in and give them your time. And I just don't see Battlefield and Battlefront at this moment right now being the big winners. They're going to win, but they're not going to get you five years success. They're going to get you one to two years success and then it falls off, right? And so I don't think EA right now is looking at that going, we're greenlighting a one to twoyear winner. We want something bigger. We want that, right? And everybody points to Fortnite and all those other games. And so I think you live in a world where they're probably hesitant to do that, especially after the ba last reception of Battlefield, which wasn't positive. And so it's probably like, hey, nail that and then we probably should lean on Star Wars because I think they're both going to get you the same end result here. Maybe Star Wars a little bit better just because of the IP and the name. But I mean, at the end of the day, two years later, we're going to be on to the next thing.",
            "start": 410.0
        },
        {
            "text": "get you the same end result here. Maybe Star Wars a little bit better just because of the IP and the name. But I mean, at the end of the day, two years later, we're going to be on to the next thing. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep, and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and I'm loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get",
            "start": 448.32
        },
        {
            "text": "you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com promo code kind of funny for 20% off. Story number five, Netherrealm is on to their next game. This comes from a post from Mortal Kombat on Twitter where they write, \"We're hearing players request for continued game support of Mortal Kombat 1. And while we will continue to support Mortal Kombat 1 through balance adjustments and fixes, there will be there will not be additional DLC characters or story chapters released from this point on. We understand this will be disappointing for fans,",
            "start": 493.04
        },
        {
            "text": "1 through balance adjustments and fixes, there will be there will not be additional DLC characters or story chapters released from this point on. We understand this will be disappointing for fans, but our team at Netherrem needs to shift focus to the next project in order to make it as great as we possibly can.\" I mean, sounds about right. Right. Bless, we're going to talk about fighting games and like the longevity of them, but looking at it, right, it's 2025. Game came out in 20 or 2023, so it's hitting its 2-year lifespan here and moving on to the next one, right? And so, yeah, I mean, for me, I really liked Mortal Kombat 1. I always tell you, Mortal Kombat is my fighting game. That's the one I kind of gravitate towards because I know the characters. I know the world over all the years. And I really liked this one with the recent campaign, which I thought was fun. Right. fun, wacky, wild, all these different characters coming in on the finale was really, really dope. But I enjoyed",
            "start": 541.2
        },
        {
            "text": "And I really liked this one with the recent campaign, which I thought was fun. Right. fun, wacky, wild, all these different characters coming in on the finale was really, really dope. But I enjoyed Mortal Kombat 1 when I think of fighting games. Bless, this is what I look at, right, of like, hey, we gave you probably a good solid year of content. Then the second half for the next year is like kind of getting on the lighter side. Then it's like, hey, the money spout is slowly drying up here. It's time to move on. Game's still live. you're going to play it. But contentwise, we're not going to keep adding a bunch of character packs for a smaller audience when we know the way to get back into the the green is putting out a new game. Yeah, I'm just I'm fascinated by what their next game is and if we see them redefine a little bit. I think MK1, I'm with you, that I enjoyed it when I played it for review, especially the the single player mode. But I'm somebody I would describe myself as,",
            "start": 584.8
        },
        {
            "text": "and if we see them redefine a little bit. I think MK1, I'm with you, that I enjoyed it when I played it for review, especially the the single player mode. But I'm somebody I would describe myself as, yeah, Mortal Kombat was my fighting game, and now it's not really anymore. Like, I'd rather play a Tekken. I'd rather play a Street Fighter when you're talking about the the modern iterations. And I saw a lot of that sentiment from other people as well. Like a lot of the fighting game community seems to have left Mortal Kombat behind a little bit. I was surprised when I went to EVO and the Mortal Kombat section was so thin. Like the um the amount of competitors competing for MK1 was so thin compared to Tekken, compared to Street Fighter, compared to Guilt, like even Guilty Gear and stuff like that. Um, and I I think that might be a sign that maybe people are getting a bit tired of what Mortal Kombat is. Uh, I think the game feel I think the there's a bit of a stiffness when it comes to",
            "start": 624.0
        },
        {
            "text": "that. Um, and I I think that might be a sign that maybe people are getting a bit tired of what Mortal Kombat is. Uh, I think the game feel I think the there's a bit of a stiffness when it comes to modern Mortal Kombat that I think worked well when uh MK9 came out back in the day now. I guess PS3 generation. Um, and they had that for for three entries in a row. Um, but I think we're starting to get to the point now where it's like you might have to remix how this feels a bit. We might have to like look towards some of these other fighting games to like make it feel a bit more smooth. Space is getting a lot more crowded as you know, Bless. There's more games being entered into the frey. 2KX or 2X KO is coming soon from Riot, right? And it's like you I I'm totally there with you. I was really surprised as that Mortal Kombat like I'm the casual fighting game guy. Mortal Kombat's my game, right? And to see you talk more about other games and I'm like, \"Oh, I thought Mortal Kombat was a the",
            "start": 663.44
        },
        {
            "text": "surprised as that Mortal Kombat like I'm the casual fighting game guy. Mortal Kombat's my game, right? And to see you talk more about other games and I'm like, \"Oh, I thought Mortal Kombat was a the pillar.\" And I think the name is still a pillar, but it seems like yeah, the game itself, there's others now kind of taking that shine and that space away. But yeah, the interesting one here, Bless, is you would think they go to Injustice, right? Ride the high off the superheroes again. DC with Superman the movie. Maybe we can build off of that, get that kind of excitement and juice going. But at the core of it all, it's still the gameplay, right? And Netherrem, they're great, right? But is it something blessed where people are looking at Nether Realm going, \"Hey, it's time to maybe add something or reinvent just a little bit.\" Yeah, I think so. Like you brought up the stiffness, right, of the feel. What are others doing that is better than Mortal Kombat? That would be the reason why",
            "start": 709.6
        },
        {
            "text": "or reinvent just a little bit.\" Yeah, I think so. Like you brought up the stiffness, right, of the feel. What are others doing that is better than Mortal Kombat? That would be the reason why people are leaving those games. I mean, I think the games just feel better to play. And then also, I think with Mortal Kombat, it's it might also just be a content issue of how you how do you support this game, right? Like I saw people in chat like listing off like you know monetized fatalities and things like that, right? Like I I think fighting games are kind of tough as far as what that postlaunch support looks like because times have evolved so much and I think fighting games have kind of stayed the same. That's why I'm very fascinated for 2x being developed by Riot and being a free to I think they announced it as free to play, right? Like I wonder how that shakes up the formula. multiveres we saw we saw came out and was free to play and that's already been like well not canceled but it's it's",
            "start": 750.32
        },
        {
            "text": "announced it as free to play, right? Like I wonder how that shakes up the formula. multiveres we saw we saw came out and was free to play and that's already been like well not canceled but it's it's done right it's been finished um and I don't believe you can play multiverses anymore right like I think somebody's going to have to figure out what the modern mold for that looks like I think for Mortal Kombat or for Netherrealm I think a switch to Injustice would benefit them a lot um you had two backto-back Mortal Kombat games for the first time in a while with MK11 going into MK1 and I think that was that might have a lot for people. You didn't have that swerve to Injustice kind of like, you know, give give you that pallet cleanser. So, I think that alone will do a lot, especially going into the DCU. If you can, you know, give us like those maybe interpretations of what those characters look like, you know, maybe lean into that slate of what the DCU Batman or Superman is, what the",
            "start": 792.88
        },
        {
            "text": "into the DCU. If you can, you know, give us like those maybe interpretations of what those characters look like, you know, maybe lean into that slate of what the DCU Batman or Superman is, what the other characters are being introduced in those films. Maybe that gives you a level of freshness to then when you return to Mortal Kombat, you might be able to make it a bit, I don't know, faster in gameplay, maybe f I don't I don't want them Here's my thing. I think the the question is tough cuz I don't want them to go to look at um Street Fighter and go, \"Oh, let's just do that.\" Because I don't think that's the answer. I don't think the answer is to look at Tekken and go, \"Let's do that.\" Cuz like that's those games sort of have that space down, right? Right. When you're talking about 2D fighters, it is Street Fighter, it is Guilty Gear and what Arc System Works do with those games. I think Nether Realm has had the special thing of, you know, being unique and being kind of one of a kind,",
            "start": 834.0
        },
        {
            "text": "it is Street Fighter, it is Guilty Gear and what Arc System Works do with those games. I think Nether Realm has had the special thing of, you know, being unique and being kind of one of a kind, but they've just given us a lot of that a lot of what they do. So, I don't know. It's a tough one, Bless, right? Cuz yeah, you Mortal Kombat, you can't come out with you come out with another one, it's just the same Mortal Kombat, right? Injustice is great, but are people going to say, \"Hey, I've been there with the superheroes before. I want something new.\" But really, what is that third option? Is there even something something new with characters that you could even do world building wise or do you have to stick with the two? You know, when you're under WB, I think you have to stick with the two, unfortunately, cuz that's how WB operates. Like, they're all about the IP unless you want unless you want to make a Harry Potter fighting game or some [ __ ] right? Like, is there other IP under WB",
            "start": 874.4
        },
        {
            "text": "unfortunately, cuz that's how WB operates. Like, they're all about the IP unless you want unless you want to make a Harry Potter fighting game or some [ __ ] right? Like, is there other IP under WB that makes sense to do a fighting game with? Maybe that's maybe that's the thing. But I do think that there's probably a demand for Injustice. I wouldn't be surprised if we looked at the numbers in the audience and people are like, \"No, we just want uh superheroes are still hot. Always going to be hot. Could you also make a like like a single player Mortal Kombat like action game? Well, I mean, that's what I was going to get to you with you. It's like Mortal Kombat to me has always been great because of that single player campaign, right? I don't see many others doing it like that, right, with the big time over-the-top story. I think others do a good single player campaign, but Mortal Kombat for the casual audience is the one to go jump into and get lost in. Is there something where you",
            "start": 912.96
        },
        {
            "text": "the big time over-the-top story. I think others do a good single player campaign, but Mortal Kombat for the casual audience is the one to go jump into and get lost in. Is there something where you could What was the one bless that we all played way back in the day? Monks. Yes, that was like it but not it wasn't the true campaign that we're thinking of right now was a little bit of a switch up a little more fun on that. Could you do something like that again? Maybe. But also like is Nether Realm the studio to do it or do you look at one of your other studios or like look at a third party studio to make a Mortal Kombat single player thing? I think that would be fascinating. I don't I I I don't know if it's a good idea, like if I'm being honest, but I think it's a really interesting one that you could if you nail it, you could really nail it because the thing that I like most about Mortal Kombat still, and this is even compared to other fighting games, is that I think the world of Mortal",
            "start": 947.92
        },
        {
            "text": "you could if you nail it, you could really nail it because the thing that I like most about Mortal Kombat still, and this is even compared to other fighting games, is that I think the world of Mortal Kombat is still really cool, and it has a lot of you have a lot of characters, you have a lot of lore, and I I think that stuff is more approachable, accessible, and a lot of times more interesting than a lot of other fighting games. Like I'm sure if I dig deep into the lore of Tekken, Tekken is probably not even a great example of like Street Fighter or like Guilty Gear might be a better example. I'm sure if I dig deep into the lore, there's probably really really good [ __ ] there. But Mortal Kombat's world and story and [ __ ] is just like I don't there's something about it that just hits. That's why we've had so many Mortal Kombat movies. That's why we're still That's why they're about to get Mortal Kombat 2 coming up in what, a year or so? Yeah. Yeah. Like there's something about",
            "start": 987.2
        },
        {
            "text": "That's why we've had so many Mortal Kombat movies. That's why we're still That's why they're about to get Mortal Kombat 2 coming up in what, a year or so? Yeah. Yeah. Like there's something about those characters that really work. And I think that translates to if you wanted to make an action adventure game, let me play as Scorpion or Subzero or Johnny Cage or whoever and just go through a campaign and it's a really violent like third person action thing. Yeah. Almost like a Sefue maybe even like an assassin. Not like big but like Yeah. I want that third person feel running around a Scorpion. Get over here. Dude, you bring up Sefue. You give Slow Clap a Liu Kang game. Oh my god. Would that be cool? That would be cool. I can just go just look at Slap and be like, \"Yo, make Sefue, but make it really violent and bloody and make Liu King the main character.\" You bring up content really quick before we go. It's like, what more do you want contentwise out of these games? Right. I think",
            "start": 1025.36
        },
        {
            "text": "it really violent and bloody and make Liu King the main character.\" You bring up content really quick before we go. It's like, what more do you want contentwise out of these games? Right. I think they've kind of nailed down after all the years of what they want. Do you think maybe a small couple level campaign year two would be helpful to one of these, sell it for $10 to $20 and say, \"Hey, here's a compact campaign to maybe give you more.\" Cuz when you bring up the content, right, it's like it will always be character pack one through four. Yeah, we're probably going to sell fatalities cuz we know people will buy those for X, Y, and Z, but like there's not much we're really playing with from costumes to new characters to fatalities that you're really bringing to the game. They did do that with Mortal Kombat 11. They made they put out Mortal Kombat Aftermath, which kind of gave you Oh, yeah. I remember that one. Okay. It gave you more of the resolution to that story and added some",
            "start": 1065.36
        },
        {
            "text": "that with Mortal Kombat 11. They made they put out Mortal Kombat Aftermath, which kind of gave you Oh, yeah. I remember that one. Okay. It gave you more of the resolution to that story and added some extra chapters and then led into Mortal Kombat 1. Did they Did they do that for Mortal Kombat 1 chat? Because MK1's story ended on a weird note where it's like, \"Okay, you guys are obviously going to do DLC for this.\" Um Oh, people are saying they did it with MK1. Let me tell you, I missed it. I didn't miss it. Totally missed out on that. So, like, I wonder if that's a marketing thing or I wonder if that's just like a lack of interest thing. Yeah. Who knows?",
            "start": 1104.72
        }
    ]
}