{
    "id": 14124,
    "video_id": "NN08tixNxaY",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Naughty Dog is Working on ANOTHER Game - Kinda Funny Games Daily 05.20.25",
    "description": "Go tohttps://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\nGAMESCAST - Tim and Blessing’s Clair Obscur: Expedition 33 Reviews\nThen the STREAM is Mike and Roger finishing Death Stranding\nIf you’re a Kinda Funny Member:\nToday’s Gregway is 24 minutes about the best – and worst – feedback he’s gotten from mentors.\nThis afternoon is the May happy hour for $25 supporters on Patreon.\nThank you to our Patreon Producers: Karl Jacobs,OmegaBuster, & Delaney Twining\n\n00:00:00 - Start\n00:09:08 - Housekeeping\nThe Roper Report   -\n00:10:35 - The Last of Us Developer Naughty Dog Working on a Second, Unannounced Game Other Than Intergalactic: The Heretic Prophet, Neil Druckmann Confirms - Wesley Yin-Poole @ IGN\n00:31:56 - Microsoft confirm they've supplied AI tech to the Israeli military for use in Gaza, following BDS Xbox boycott - Edwin Evans-Thirlwell @ Rock Paper Shotgun\n00:47:45 - Switch 2 Reportedly Using Samsung Chips As Nintendo Tries To Meet Demand - Darryn Bothuys @ Gamespot\n00:55:15 - SAG-AFTRA Slaps ‘Fortnite’ With Unfair Labor Practice Complaint Over James Earl Jones’ AI-Recreated Voice of Darth Vader - Todd Spangler @ Variety\n00:58:50 - Wee News!\n01:04:00 - SuperChats & You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747765407,
    "duration": 4308,
    "transcript_chunks": [
        {
            "text": "[Music] Today in the nerdy news you need to know about. Neil Drman confirms another unannounced game from Naughty Dog. Microsoft finally speaks on BDS boycott. And Nintendo is turning to Samsung to ramp up the Switch 2. We'll have all this and more because this is Kind of funny games [Music] daily. What's up everybody? Welcome to kind of funny games daily for Tuesday May 20th 2025. I'm one of your hosts Greg Miller alongside Forbes 30 under 30 aka the second best baby blues in San Francisco aka Games Showdown season 3. Yeah, runner up. Runner up everybody. Tim Gettys, that's me. How are you? I am uh going through a lot of emotions at this point. Oh dear. Oh dear, we are two weeks away from the Switch 2. My excitement reaching fever pitch. I have hit the point of my hype cycle where I am hopelessly just watching YouTube video after YouTube video of different people talking about the exact same thing. You know what I mean? My drives to work, I'm just throwing on Nintendo Life podcasts.",
            "start": 1.92
        },
        {
            "text": "just watching YouTube video after YouTube video of different people talking about the exact same thing. You know what I mean? My drives to work, I'm just throwing on Nintendo Life podcasts. My drive back from work, I'm still throwing I'm listening to everything out there. Anything your hands on. any I can get my hands on all these Nintendo YouTubers out there. I've learned about so many. One's called Switch Stop. One's called Nintendo Land. Oh, you know what I mean? Okay. And like I don't know. I don't know the quality of these YouTube channels. I'm watching the video. I'm I'm listening to these things. Yeah. This is how easy. Do you have a Nintendo podcast or YouTube channel? Go to Blue Sky. I'll tell you right now. I am listening. And yeah, it's just it's I I I have that new console excitement, you know, and it's like it's right. I'm thinking about all the accessories. I'm I'm planning out my room, all the changes I'm going to make, all the cables I get to buy. I don't need to",
            "start": 67.2
        },
        {
            "text": "excitement, you know, and it's like it's right. I'm thinking about all the accessories. I'm I'm planning out my room, all the changes I'm going to make, all the cables I get to buy. I don't need to cable, but maybe I do, you know. Yeah, it's exciting times. I know. I know that you are also excited. I know you're not traditionally the biggest Nintendo guy, but I feel like this one is kind of coming in the right place time for you in your life. This is a very interesting one here on the on on the eve so to speak of Switch 2, right? Where yeah, I am not the Nintendo guy. I am excited about Mario Kart World Tour. I am excited about new hardware, but I'm not listening to every podcast. Can't wait. I've been there this year with Monster Hunter World and whole or wilds and a whole bunch of different stuff. Like I feel the vibe the next time. I'm not there. But I am in two ways, right? Number one, us getting to do launch coverage, getting to come out here and be like, \"All right, cool. We are",
            "start": 116.24
        },
        {
            "text": "stuff. Like I feel the vibe the next time. I'm not there. But I am in two ways, right? Number one, us getting to do launch coverage, getting to come out here and be like, \"All right, cool. We are in this amazing studio. We have this amazing team. What are we doing?\" You know, are we going to Best Buy at 9:00? What do we do? We want to try to camp out in the Nintendo store on or what? Okay, so many options. On Thursday, we're streaming all day long. What does that look like? Do I put What does Friday look like? What does Saturday look like? Well, Friday looks like SGF and then I fly there. There's a lot of times around SGF. You don't play all Saturday while I'm seeing We're on the street. We're We're hanging out. We all we had a big conversation. You weren't here. Am I pulling Ben out of school? Am I bringing him in here for Switch 2 launch day and he can just sit around and play stuff here? That would change the tenor of it. But if I think my day is going to be more about him to begin",
            "start": 162.96
        },
        {
            "text": "Am I bringing him in here for Switch 2 launch day and he can just sit around and play stuff here? That would change the tenor of it. But if I think my day is going to be more about him to begin with, but then as Ben has been playing so much Switch, you know, we I introduced him before this trip we just took to the one, the only Captain America, right? To the MCU. You know that I showed off all that stuff to him. To go and watch all that to get him excited and then be like, well, he's like, I want a Captain America game. And I'm like, \"Well, Marvel Ultimate Alliance 3, right?\" And like I dropped him and I was looking I'm like, \"Damn, I didn't really put a lot of time into these expansion packs.\" I think Ben's going to be really upset when uh we don't get the Switch 2 edition of this one. So, I don't know if we're getting the FPS boost that we need that I don't care about. As much as like I think of me in Switch 2 and I'm like, well, I think my Switch 2 is going to be marked by, okay,",
            "start": 199.84
        },
        {
            "text": "So, I don't know if we're getting the FPS boost that we need that I don't care about. As much as like I think of me in Switch 2 and I'm like, well, I think my Switch 2 is going to be marked by, okay, I'm jumping into Tears of Kingdom again, starting from scratch. Let's go. Let's Let's get into this. Let's do the goddamn thing, right? Am I tinkering with Marvel Ultimate Alliance again? What is this going to bring me back just to check in on my Animal Cross island ever? So that's where I'm at. Give me all the things that aren't even getting anything new though. I Well, [ __ ] you Nintendo. What do you want me to say? What do you want me to say to Nintendo? [ __ ] you Nintendo. Plethora of other games. Kevin, give me the one. [ __ ] you, Nintendo. Those are the three games I care a lot about. Do more for him. What the [ __ ] You know what I mean? Also, Marvel, just make Ultimate Alliance elsewhere. Just port Ultimate Alliance 3 or Mega Four or [ __ ] Phil Spencer. Give us one and two",
            "start": 236.8
        },
        {
            "text": "Do more for him. What the [ __ ] You know what I mean? Also, Marvel, just make Ultimate Alliance elsewhere. Just port Ultimate Alliance 3 or Mega Four or [ __ ] Phil Spencer. Give us one and two already. It's kind of bizarre that they didn't port it. That feels like the type of game that's exclusive for a while, but then definitely makes its way to the other consoles, right? Yeah. Like I I understand business and blah blah blah, but like at the same time, Marvel Ultimate Alliance does feel like a multiplatform title. It does. I agree 100% with that. I'm shocked they didn't do that, but you know, who we're just over here. We're just buying it all up, eating up the slop. And then I'm I am of course, you know, I love Mario Kart, so I am hopeful that I will jump into Mario Kart and be wowed and impressed and just only play that. Just no life that. Yeah, we'll see. I'm stoked, man. I just want 4K menus and I'm getting them. Going to be really nice. Nice. That'll be big for you. I hate how",
            "start": 270.32
        },
        {
            "text": "impressed and just only play that. Just no life that. Yeah, we'll see. I'm stoked, man. I just want 4K menus and I'm getting them. Going to be really nice. Nice. That'll be big for you. I hate how blurry it is. I hear you. My little eyes. What are the conversations I missed? What do we Are we announcing stuff? What are we doing? Are we announcing stuff? You said we missed stuff. We missed convers I missed conversations about streaming. Oh, we were just doing like in our production meeting. We were just like, well, hey, we're all going to be playing Switch. We all play Switch together. And I feel like that's the vibe. So, okay. No conf confirmation yet, but I do think there will be in some form. Okay. some like differently timed streams than used to the weekend of I like that a lot SGF/SW switch 2 Ultimate Alliance. IC Weiner says, \"I convinced myself last year that Microsoft was going to shadow drop X-Men Legends and Ultimate Alliance 1 and two at last SGF.\" Let's be real. Like",
            "start": 307.44
        },
        {
            "text": "switch 2 Ultimate Alliance. IC Weiner says, \"I convinced myself last year that Microsoft was going to shadow drop X-Men Legends and Ultimate Alliance 1 and two at last SGF.\" Let's be real. Like there's a conversation that needs to be had. What is going on with Xbox and the Activision games? Like I again I understand timing and all that and they have a lot of Dominoes falling, Greg. They do legitimately no jokes at all at this point, but like they have this treasure trove of back catalog stuff and like I don't know. It's just it's eventually going to hit a point where it's like not fun to even speculate about it coming anymore. You know what I mean? And like I don't know that we're past that point yet, but we're getting real close. And like it's a weird one where I'm like last year I was like, \"Oh yeah, it'll definitely be a big SGF announcement.\" And then it wasn't. And now here we are going to this SGF and I'm like, \"Will it be?\" No, I don't know. I think it's just so tied up in who",
            "start": 344.0
        },
        {
            "text": "\"Oh yeah, it'll definitely be a big SGF announcement.\" And then it wasn't. And now here we are going to this SGF and I'm like, \"Will it be?\" No, I don't know. I think it's just so tied up in who has the rights and this that the other and that was an old Marvel games and Marvel games one and this and the other and blah blah blah. Yeah. But like I mean they have so many games that they clearly do have the rights to that aren't there yet. And I know the only ones that matter. No, they're not. Once they I mean Activision was like, you know what, we don't want Ghostbusters because we can't annualize that. And then of course they have the the X-Men and the Ultimate Alliance. That was it. That was all Activision really had outside of it. Yeah. I can name him another thing or two, but we'll get him eventually. I mean, they have been drip feeding them, and I do understand the drip feed mentality to an extent, but I also really question how exciting the Xbox announcements of like these games",
            "start": 383.12
        },
        {
            "text": "him eventually. I mean, they have been drip feeding them, and I do understand the drip feed mentality to an extent, but I also really question how exciting the Xbox announcements of like these games are coming to the to Game Pass now when it when it is not the new stuff. You know what I mean? I feel like I wonder how much more exciting it could be if they were to package it in ways that kind of feel like they make sense. Like we really thought they were going to do a big hey here's the Call of Duty drop that's like we're focusing on like these let's get it let's get the community back together one last ride you know what I mean themed things just get the money just get the money they don't care they're getting the money and if they keep doing play anywhere in Raw Allies I'll be happy but that's a conversation for a different time. Uh we're going to talk about all this and more because this is kind of funny games daily each and every week down a variety of platforms we run you through",
            "start": 419.36
        },
        {
            "text": "that's a conversation for a different time. Uh we're going to talk about all this and more because this is kind of funny games daily each and every week down a variety of platforms we run you through the nerdy video game news you need to know about live on twitch.tv/ind TV/confunnames, youtube.com/confunname uh and podcast services around the globe. If you like that, we'd love you to pick up the kind of funny membership. Of course, $10 gets you each and every episode of our content ad free. It gets you the ability to listen to me, Greg Miller, talk each and every weekday for 15 to 20 minutes about whatever it is I want to talk about, a series we call Gregway. And of course, you get good karma for supporting a company that gives you more than 80 episodes of content a month. all ad free and all the jazz I already said. Uh, no bucks, toss away, no big deal. Of course, uh, you can pick it up and do this thing and get it for free in a million places, the podcast, the YouTube, the Twitch,",
            "start": 461.76
        },
        {
            "text": "all the jazz I already said. Uh, no bucks, toss away, no big deal. Of course, uh, you can pick it up and do this thing and get it for free in a million places, the podcast, the YouTube, the Twitch, but you can get that membership over on patreon.com/kindfunny. youtube.com/kindfunnygame, Apple, and Spotify. If you're watching live right now, of course, we invite you to super chat uh, as you hear us read about the news, get in with your thoughts, opinions, more your takes uh, on the old news and so we can get you in here and have a whole bunch of different stuff going on here. like Joshua Mitchell who super chats and says, \"Holding on to my delusional hope for a Jack and Daxter reboot or a Crash Spyro style remaster as he begins to worry about what Naughty Dog's next game will be.\" We'll talk about that soon. We'll talk about that soon. Uh, of course, there's a lot more in there. We'll get to him as we go. Uh, thank you. Remember, we are an 11 person business all about live talk shows.",
            "start": 500.24
        },
        {
            "text": "about that soon. We'll talk about that soon. Uh, of course, there's a lot more in there. We'll get to him as we go. Uh, thank you. Remember, we are an 11 person business all about live talk shows. We kick off your programming day with kind of funny games daily and move into games cast. Today's games cast will be Tim and Blessings Clare Obscure Expedition 33 reviews. Very big. Very very excited to talk about this game. I little by little done it on a lot of shows cuz I am absolutely obsessed with it. But uh I'm very excited to have a full hour dedicated to just talking about the game. We're going to talk our reviews of it and then also get into some spoiler stuff as well, but we'll clearly delineate for it for those that care. I love that. Uh then the stream after that is going to be Mike and Roger finishing their Death Stranding playthrough. Uh if you are a Kind of funny member, momentarily you'll be able to get today's Gregway, which is 24 minutes of me talking about the best and",
            "start": 539.12
        },
        {
            "text": "and Roger finishing their Death Stranding playthrough. Uh if you are a Kind of funny member, momentarily you'll be able to get today's Gregway, which is 24 minutes of me talking about the best and worst feedback I've ever gotten from mentors. And then this afternoon is the happy hour for May. Uh $25 uh $25 and above. Supporters on patreon.com/kondfunny, of course, can call in to talk to us live in an exclusive show we do just for them. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Subway Surfers, and Factor, but we'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. Five items on the Roper Report. You kept it. That was impressive, Kevin. I know you're fighting through a coffin. That was dangerous territory. You know, it hurts so bad. I'm sure. I appreciate you, sir. Uh, number one, The Last of Us developer Naughty Dog is working on a second",
            "start": 577.28
        },
        {
            "text": "you're fighting through a coffin. That was dangerous territory. You know, it hurts so bad. I'm sure. I appreciate you, sir. Uh, number one, The Last of Us developer Naughty Dog is working on a second unannounced game other than Intergalactic: The Heretic Profit. Neil Duckman confirms this is WYP at IGN. Uh, Naughty Dog Chief Neil Duckman has revealed the studio has a secret unannounced second game in the works other than Intergalactic: The Heretic Profit. In an interview with the press X to continue podcast, Drman discussed his ongoing roles at Sony owned Naughty Dog on Intergalactic: The Heretic Profit, uh, Duck Drman works with two game directors, uh, Matthew Glant and Kurt Maggan. Sorry, Kurt. I've known you how many years and I [ __ ] up your name the first time I is co-writing the game with narrative director Claire K or Kerry. Maybe Drman did not say which director is working on the second game. However, quote, \"There's another game that's being worked on at Naughty Dog where I",
            "start": 629.44
        },
        {
            "text": "with narrative director Claire K or Kerry. Maybe Drman did not say which director is working on the second game. However, quote, \"There's another game that's being worked on at Naughty Dog where I am more of a more of a producer role and I get to mentor and watch this other team and give feedback and be like the executive in the room.\" He said, \"I enjoy all these roles and the fact I jump between one to the next, it makes my job very exciting and always feeling fresh. I'm never bored.\" End quote. Hell yeah. You love to hear that. Did you watch Last of Us yet, Greg? I have not. No, of course. I was in Canada. HBO Max isn't even there, so that's a whole [ __ ] thing. Yeah, I could use a VPN, but we're also going to bed when Ben goes to bed. So, it's a whole thing. Well, you have you have a banger ahead. Um, and this one directed by Neil Duckman, so he's definitely having a a little whirlwind week. I'm sure that's why some of these interviews are happening. Um, but this is exciting news,",
            "start": 676.16
        },
        {
            "text": "ahead. Um, and this one directed by Neil Duckman, so he's definitely having a a little whirlwind week. I'm sure that's why some of these interviews are happening. Um, but this is exciting news, uh, for many reasons. I'm a Naughty Dog fan. I'm a fan of them working on multiple projects because last and we were just talking a couple days ago, maybe it was yesterday, just about the generations and PS4 going to PS5 and how generations mean less than they ever did because the games are what matters and always have and we're kind of just seeing all the biggest games on PS5 mostly being games that are also playable on PS4. But at a certain point, I think that might end up changing once we get to Sony Santa Monica's next game, potentially multiple new Naughty Dog, whether it's the big IP of um uh Intergalactic um or the Heretic Prophecy or whatever this other thing is. Prophet, God damn it, man. Whatever. What What was the little like uh thing to remember? IHOP. Yeah. No, it I'm just We have",
            "start": 718.08
        },
        {
            "text": "Intergalactic um or the Heretic Prophecy or whatever this other thing is. Prophet, God damn it, man. Whatever. What What was the little like uh thing to remember? IHOP. Yeah. No, it I'm just We have to say it all the time. HP. HP. You drunk when I hear talking about the itp. Yeah, I'm talking about a brand new IP. It's not going to stick. It's not going to stick. Uh, but yeah, another project. I'm very excited about that because I do think that that leads to a very promising PS5 end of life cycle kind of backto-back roll out of bangers like we saw. You think this new IP is a PS5 game, too? Yeah, I do. Um, I also think that it's probably a PS6 game as well. The same we're talking about Miles Morale. Um, yeah, it is. Also, we don't know what this is, right? And like it'd be interesting to see how big or small the project is. I don't think this is a smaller thing though. I think that this I think Naughty Dog does smaller things. And I know what about Uncharted with Chloe and Names",
            "start": 761.48
        },
        {
            "text": "to see how big or small the project is. I don't think this is a smaller thing though. I think that this I think Naughty Dog does smaller things. And I know what about Uncharted with Chloe and Names escaping me. You know what I mean? Thieves. No, something about thieves. There's something about thieves. Oh, no. Thieves. Uncharted. The space lost legacy. Uh, anyways, that's smaller, but I wouldn't even I mean when I'm thinking of a small game from Naughty Dog, I'm not even thinking of that. I think that's still the right size for I mean, I would [ __ ] pray for that. Like, god, I've I said this on the review of Lost Legacy. I would literally take one of those Uncharted side stories once a year. Sure. Add some fun mechanic. Here's rope swinging. Here's some [ __ ] I haven't even thought about cuz they're better than me. Like, every year, every other year, whatever it is. I get that at a certain point annual does get tired. But if it was a smaller experience, I think everyone would be,",
            "start": 805.44
        },
        {
            "text": "cuz they're better than me. Like, every year, every other year, whatever it is. I get that at a certain point annual does get tired. But if it was a smaller experience, I think everyone would be, not everybody, enough people and I would be super into it. So, to swing in here then have this conversation. What do you think it is? CJ splits on super chat and says possibility of Naughty Dog doing two new IPs. I mean, that's possible. I look, we're getting Last of Us 3. I think there's no way. Joey Radstone pops in. So, Last So, Last of Us 3 definitely not happening, right? In terms of this one, because Neil would be the one to direct that game again, right? And you got to imagine Neil would be the one to direct that game. But maybe not. Maybe it's a co-director situation. I wouldn't be surprised. Co Neil does seem very collaborative when it comes to his projects. Kurt's been there forever, too. Exactly. Yeah. So, I do feel like Last of Us doesn't necessarily need to be directed by Neil.",
            "start": 847.68
        },
        {
            "text": "Co Neil does seem very collaborative when it comes to his projects. Kurt's been there forever, too. Exactly. Yeah. So, I do feel like Last of Us doesn't necessarily need to be directed by Neil. Um, but he could be an overseer on that doing the little rubber stamps, all that stuff. So, um, especially with the amount of projects that he is working on at this point, whether it's movies, TV, or I guess TV, video games, movies, who knows, right? Yeah. Um, so yeah, I I do feel like Last of Us 3 is inevitable. um on the not sooner side necessarily like next year but like within the next couple years like I would not be shocked if a Last of Us 3 is playable on a PlayStation 5. Interesting. I don't think it's a guarantee. Wow. I don't think it's a guarantee but I guess it's not. I go wow and then I'm like well again with how their work generations work now that doesn't sound as crazy. I think Last of Us 3 is going to come out either at launch with PlayStation 6 or into the PlayStation 6 life",
            "start": 886.64
        },
        {
            "text": "I'm like well again with how their work generations work now that doesn't sound as crazy. I think Last of Us 3 is going to come out either at launch with PlayStation 6 or into the PlayStation 6 life cycle. I don't and I it could be playable on PS5. Yeah, I'm not against that. Yeah, but I don't think it's imminent like that. Then otherwise, if it's Uncharted, I think is something we need to at least talk about. And I think that an Uncharted game made by uh a director that Neil gets to be a bit more of a mentor over and the executive in the room. That could make a lot of sense, right? But I also kind of feel like that's what Lost Legacy was already. Last legacy was also a decade ago almost. Yeah, exactly right. That and that is the thing of whatever it's more of the interesting thing. Am I misreading this? When we talk about what's going on here on Intergalactic, the heretic profit, again, we will now call it HP. Dman works with two game directors. Uh Matthew Galant and Kurt Marganau uh",
            "start": 932.88
        },
        {
            "text": "this? When we talk about what's going on here on Intergalactic, the heretic profit, again, we will now call it HP. Dman works with two game directors. Uh Matthew Galant and Kurt Marganau uh and is co-writing the game with narrative director uh Claire Kerry. Dman did not say which director is working on the second game. However, quote, \"There's another game that's being worked on.\" No, I am more of a producer. I see. I see. I was confusing myself. Thank you very much. And I get to mentor it. I could see this being an Uncharted. Again, there are so many rumors and and thoughts we always start with of, well, is it an Uncharted and is it spoiler for Uncharted 4? Spoilers for Uncharted 4. Spoilers for Uncharted 4. Picking up with Nate and Nolina's daughter. Is that where we're going to do? Which would be banger and would be fun. It would be great and it would be a good time to pass that torch, especially considering I think of Uncharted as a collaborative effort. When you look around at",
            "start": 979.04
        },
        {
            "text": "would be banger and would be fun. It would be great and it would be a good time to pass that torch, especially considering I think of Uncharted as a collaborative effort. When you look around at the hands that have touched that, obviously all due respect to Amy who, you know, championed Uncharted for so long, obviously was working on Uncharted uh for uh got left came, you know, blah blah. And this whole thing changes and evolved into what it became with, uh Neil and Bruce being on top of that after doing that. But that's not never to take away from what Neil and Bruce had done for Uncharted beforehand, which is where I originally met Neil way back in the day. Let alone Kurt, let alone Shawn, let alone everybody who's touching Uncharted. Uncharted more people have had their hands on the ball than Last of Us, which I think of is so personal to Neil Duckman. Yeah. Where I wouldn't see Neil Duckman. Yeah. Being on not being Neil Duckman. Last part three is a Neil Drman game period. I",
            "start": 1018.88
        },
        {
            "text": "ball than Last of Us, which I think of is so personal to Neil Duckman. Yeah. Where I wouldn't see Neil Duckman. Yeah. Being on not being Neil Duckman. Last part three is a Neil Drman game period. I think then I think you look at an Uncharted it would be interesting to see all right young dogs. Even though if it's a Kurt, you've been there forever and so many other people have been there forever, right? You're and Sean's back, right? Like you're there. You're working on this thing. It isn't Uncharted, but it's your Uncharted. Well, it sounds like Kurt's working on intergalactic. Sure, I know. But I'm just saying like I think there has to be some I think there's other people like Kurt that I'm just not on a firstn name basis with or know that well enough to insult that the last of his party every time I see him and call his car the wrong car. Uh I think there's other people like that that have a lineage at So I don't want to make it sound like Young Dogs like you just got here.",
            "start": 1058.24
        },
        {
            "text": "party every time I see him and call his car the wrong car. Uh I think there's other people like that that have a lineage at So I don't want to make it sound like Young Dogs like you just got here. Somebody's hearing that like Greg I've been here eight nine years. Yeah. Um either way I'm excited. Like I feel like whatever it is that they put out I'm I'm going to be here for it. Like I was excited for Last of Us Factions even though that is like the antithesis of the type of game I want to play. I just have that level of trust in Naughty Dog. They make experiences that I like and yeah, go for it. Vulk Dasher super chats in. It says the multiplayer game was a Last of Us 2 add-on first. A lot was done and the team was largely new hires and a third team, hence team all being let go after. My bet is Uncharted reboot and IG for main two teams. Intergalactic for the main two teams. Gotcha. Gotcha. Gotcha. I thought we were going more with the last of a multiplayer vibe there. I was just a",
            "start": 1093.6
        },
        {
            "text": "bet is Uncharted reboot and IG for main two teams. Intergalactic for the main two teams. Gotcha. Gotcha. Gotcha. I thought we were going more with the last of a multiplayer vibe there. I was just a giant run on sentence that I lost my place in. Uh, Killian C says, \"Personally, uh, I'm at a point where I'd love Naughty Dog just to do new things from here on out. New directors, let's do new things. I don't expect The Last of Us 3. You're silly not to expect The Last of Us 3 with the success of the show, the success of the game, the way people love The Last of Us, right? Even though I know people love to hate The Last of Us, but I think the new directors, let's do new things.\" I think that's where again it gets super exciting to do an Uncharted, whatever you call this, Uncharted, whatever this trilogy, legacy, whatever it's going to be. And if it is Nate's daughter and Nate is Sully, it's Nate's daughter and Nate's never in it except the final [ __ ] thing or maybe never in it. Like I",
            "start": 1129.28
        },
        {
            "text": "this trilogy, legacy, whatever it's going to be. And if it is Nate's daughter and Nate is Sully, it's Nate's daughter and Nate's never in it except the final [ __ ] thing or maybe never in it. Like I think there's a lot of fun you could have with it of like, all right, new directors go make this new thing that people love. Yeah, Uncharted is a tough one just because I they really kind of have done it all when it comes to that format and you could always go back to it and do new things. I'm again the same person that is saying I'd take this thing annualized, but that is also coming with the expectation of knowing what that would look like. Um, I definitely think they could make it. I'm not necessarily the most ecstatic about playing as the daughter from the little bit we got of her in the the end of the game. Um, but also, do I need to play as Nathan Drake again? No, not necessarily. So, yeah, it's it's a weird one. I feel like Uncharted is just such a known quantity, but that known",
            "start": 1166.08
        },
        {
            "text": "the end of the game. Um, but also, do I need to play as Nathan Drake again? No, not necessarily. So, yeah, it's it's a weird one. I feel like Uncharted is just such a known quantity, but that known quantity is fun. Like, I understand the desire for new things and we obviously need new things to have everything continue, but like I also don't vibe with the always wanting new things and not being cool with sequels and stuff. I'm a big sequel guy. I'm a franchise guy. And I feel like Naughty Dog thrives within that and iterating on the different um stories of it all. And I think that again, you can do Uncharted and have that be new but old. And it is new directors, new take, new character. You know, CJ Splitzon steals the word from my mouth, right? Caitlyn de right there as Cassie Drake again. Remember, she played Cassie Drake in Uncharted 4. Now she of course is starring as Abby in the last of a season 2. We already see this with Intergalactic, right? Uh, I forget always forget the",
            "start": 1200.48
        },
        {
            "text": "again. Remember, she played Cassie Drake in Uncharted 4. Now she of course is starring as Abby in the last of a season 2. We already see this with Intergalactic, right? Uh, I forget always forget the actress's name. Thank you very much. Who? No, that's also true now. That's also true now. But anyways, people from Naughty Dog TV projects being pulled into the game and vice versa. I feel like again they like working with Caitlyn Clearly so much that she'd be excited to continue on with that and get in there and do that thing. Uh, Alex Taylor writes in and says, \"Would super chats in. It would be real interesting to see if Nate's daughter her is the ones for a new Uncharted game since Okay, you're just coming in late on the conversation. Thank you. Sometimes I jump. You know what I mean? I just jump. I'm like, there it's coming in live and it's perfect. And then I look at it and Alec Taylor not only had a stroke writing it. It's just old news. You're in a mood today, aren't I always? I'm",
            "start": 1245.28
        },
        {
            "text": "jump. I'm like, there it's coming in live and it's perfect. And then I look at it and Alec Taylor not only had a stroke writing it. It's just old news. You're in a mood today, aren't I always? I'm back, everybody. All right. Speaking of Speaking of being [ __ ] back, by the way, Christian JPEG super chat at the beginning of the show. Welcome back from your summer solstice break, Greg. No grievances were aired at all. You [ __ ] God [ __ ] forbid. God [ __ ] forbid. Oh man, that was good. Look at his little little coffee cup. He spilled all over the place. The reality for me there there's no project that we can imagine Naughty Dog working on that I'm not excited for. And I mean that in the sense of like if it goes back all the way to Crash, yeah, I'd be stoked that ain't going to happen. Jack and Daxter, I'm not the biggest Jack and Daxter guy. I would love to see what this Naughty Dog team can do uh working on this and and it's I understand that that seems like such a giant jump, but",
            "start": 1287.52
        },
        {
            "text": "and Daxter, I'm not the biggest Jack and Daxter guy. I would love to see what this Naughty Dog team can do uh working on this and and it's I understand that that seems like such a giant jump, but there's a level of love and creativity and passion for video games that Naughty Dog has that imagine them applying that to a different skill set could be so so cool. Like I think of Retro who made the Metroid Prime games and then the Donkey Kong Country Returns uh 2D platforms. They're some of the best ever. And it's like I can't believe those are both made by the same team. Except I can because I see the vision and I feel like with Naughty Dog it's the same thing of like everything they know now going back to uh a Jack and Daxter like property could be very interesting. I think it's incredibly unlikely. Kabs writes in and says super chats in and says reboot Jack and Daxter after finishing the story please. To which I would say just don't go back. It's over. Nobody cares except you kebabs.",
            "start": 1329.04
        },
        {
            "text": "unlikely. Kabs writes in and says super chats in and says reboot Jack and Daxter after finishing the story please. To which I would say just don't go back. It's over. Nobody cares except you kebabs. Okay. It's over. Naughty Dog learned they can make things for grown-ups not chibi [ __ ] weirdo cartoons. All right, we're done with it. I love Jack and Daxter when I was a child, too. And I say that when I was what, junior high, moving into high school. I was in high school, actually. I was pretty I was pretty late in high school. I love Jack and Daxter. But I'm saying we're done. All right, we don't need more Jack and [ __ ] Daxter. All right, y'all had it with the Lost Frontier. You didn't even play it. Remember that PSP game? You didn't even [ __ ] play it. Game of the Year last year. What was game of the year last year? Uh, Persona. No, some other cartoony weirdass game. I don't [ __ ] know. Little ugly little guy. Astrobot. Well, that's a grown-up platformer. That's a far different",
            "start": 1369.12
        },
        {
            "text": "was game of the year last year? Uh, Persona. No, some other cartoony weirdass game. I don't [ __ ] know. Little ugly little guy. Astrobot. Well, that's a grown-up platformer. That's a far different thing. No, it's a grown-up. It's not a man who got turned into an asel and then was just like, I'm fine being anel. Yeah. He wasn't at all times going, why? Save me. Help me. I don't want to be a Marma. You know, he never said that. He never said that. He was cool. He was fine. I just live in this guy's shoulder. He doesn't talk for the entire first game. Cool. Let me get my own PSP game. Reboot Sly Cooper. Billy, you and Kebab should get together as a company that just loves to lose money, cuz that's what you're pitching over here. All right. That's what you're pitching over here. Everyone said that about Crash Bandicoot, Greg, when back in the day when I was just like, \"Save the goddamn Bandicoot.\" And then he came back and made millions upon millions of dollars. Some say it's why",
            "start": 1406.64
        },
        {
            "text": "said that about Crash Bandicoot, Greg, when back in the day when I was just like, \"Save the goddamn Bandicoot.\" And then he came back and made millions upon millions of dollars. Some say it's why Microsoft bought Activision for the billions they did. And while that's not true, everything I said before, that is. You're not wrong. But again, they starved us. They starved us for so long of Crash. We've been starved of Jack even longer. Not Sly. Y'all didn't support Sly when he came back. Y'all act like you did. You didn't though, did you? Y'all act like you did. You didn't though. Remember it was crossplay on your your VA and your PlayStation. You didn't support that though, did you? You didn't. No, you didn't. No, you didn't. You all act like you did. But you didn't. You should have convinced your little mainstream friends with their Walmart inserts in the Sunday paper to go buy it, but you didn't. And look where you are now. Do you enjoy your Fortnite skins and AI? It's your [ __ ]",
            "start": 1450.72
        },
        {
            "text": "your little mainstream friends with their Walmart inserts in the Sunday paper to go buy it, but you didn't. And look where you are now. Do you enjoy your Fortnite skins and AI? It's your [ __ ] fault. You should have bought the Vita. always comes back. I mean, it's just pretty. It's simple arithmetic. It's simple [ __ ] arithmetic. You bought the VA. If gamers would have supported the VA, then we'd have a [ __ ] amazing landscape right now. Instead, you're all a bunch of pigs in the trough and they're just tossing this [ __ ] slop in there. And you're freedom wars is back. I wonder how that sold. We almost had a second one. Yeah, we almost had a second one. You didn't support it, though. There you go. Jim C wrote in. Said, \"I've heard a lot of people complain. Don't even try to [ __ ] bismerch Freedom Wars name right now. All right. Tens of people playing that. Tension. I didn't say to green light it. I didn't say [ __ ] remaster. Jimc super chats. I've heard a lot of people complain",
            "start": 1491.04
        },
        {
            "text": "Freedom Wars name right now. All right. Tens of people playing that. Tension. I didn't say to green light it. I didn't say [ __ ] remaster. Jimc super chats. I've heard a lot of people complain that we might only get one new Naughty Dog game for the PlayStation 5 generation. But am I crazy to think we might see the same case for Sony Santa Monica, Sucker Punch, and Ben Studio? Uh Jim, you're only crazy because I would predict you get zero Ben games. I don't think you're gonna see. I mean, other than Days Gone Remaster, which we're not counting, I don't think you're going to see a Ben game for this generation. Um, and then Sony Santa Monica, whatever the [ __ ] going on with Cory's game, his space game, rumored space game, right? Uh, and then Sucker Punch. Yeah, you're going to get Ghost of Yote, and that'll be the end of that. But I think so, no, you're not crazy, Jim. I think it's just the expectation and people wanting Naughty Dog, the crown jewel of the Sony library, to be putting",
            "start": 1531.28
        },
        {
            "text": "Yote, and that'll be the end of that. But I think so, no, you're not crazy, Jim. I think it's just the expectation and people wanting Naughty Dog, the crown jewel of the Sony library, to be putting out, to be publishing way more than they are. Yeah. I also think like I keep saying that uh we probably will. They just also will be PS6 games. Yeah. Yeah. Again, I think that again those first few years of the PS, all the games they're promoting as PS6 games. Yeah. I imagine you're going to have a PS5 version backwards compatibility, whatever you want to call it. I digress. I'm fired up. Digressing. I'm almost out of coffee. We're going to clear the air with a good news super chat. Then we're going to go to commercial and we're gonna come back and we're going to reset. You and I aren't going to be fighting anymore. I don't want to fight with you anymore. No fights between us. Kebabs, whoever had the bad idea for Sly Cooper, I don't want you fighting in the chat with me anymore. All right.",
            "start": 1572.4
        },
        {
            "text": "be fighting anymore. I don't want to fight with you anymore. No fights between us. Kebabs, whoever had the bad idea for Sly Cooper, I don't want you fighting in the chat with me anymore. All right. Just look in the mirror and admit you did this to yourself by not buying the Vita and not telling your friends to buy the Veto. Did you understand you you could have been passing near game goods with them? Mara super chats in and says, \"After nine years of being out as a trans woman, I have finally seen a doctor and I'm officially on hormones. Hell yeah. I could not have gone through with transitioning without the endless support of all y'all in the community. Thank you so much. Congratulations, Mara. I'm glad you're happy and you're moving to happier place. Uh, everyone, if you love this happy place that is kind of funny, why not support it? Of course, you could get a kind of funny membership either on patreon.com/kindfunny, youtube.com/kindfunname, Apple or Spotify to get all of our",
            "start": 1617.36
        },
        {
            "text": "happy place that is kind of funny, why not support it? Of course, you could get a kind of funny membership either on patreon.com/kindfunny, youtube.com/kindfunname, Apple or Spotify to get all of our shows. That's more than 20 a week, 80 a month ad free. Of course, you'd also get your daily dose of me, Greg Miller, in a 15 to 20 minute podcast. Today's 24 minutes. Come on. You know what I mean? I'm trying out there. It's a really good one, too. I had to cut it short cuz I stopped to get an oil change and forgot about it. I digress. I'm digressing. Of course, you're just getting good karma for supporting us. And if you picked up a membership on Patreon today, you of course could join the kind of funny happy hour for May. Hang out with us as we talk to you and take your calls live on the air. But I digress once again. You're not using your benefits right now. So, here's a word from our sponsor. This episode is sponsored by Subway Servers. The goated endless runner that carried me",
            "start": 1655.2
        },
        {
            "text": "the air. But I digress once again. You're not using your benefits right now. So, here's a word from our sponsor. This episode is sponsored by Subway Servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway Surfers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. It's kind of funny as Resident Zoomer, I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start",
            "start": 1693.68
        },
        {
            "text": "Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to kind offunny.com/subways or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart,",
            "start": 1735.84
        },
        {
            "text": "has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. Truths from Calorie Smart, Protein Plus, Keto, and more. We at Kind of Funny Love Factor Meals. Blessed Greg love it for a quick lunch in between shows, and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindafoney5050 off and use code kind of funny50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindfunny5050 off for 50% off plus free shipping. factormeals.com/kindfunny5050 off. And we're back. Uh, as you know, I don't like to give trolls air time. You know what I mean? That's that's not what we're about here. But Flying Penguins did in fact super chat in their troll comment. That has to be a lie. And it says, \"I got a veto off",
            "start": 1781.92
        },
        {
            "text": "trolls air time. You know what I mean? That's that's not what we're about here. But Flying Penguins did in fact super chat in their troll comment. That has to be a lie. And it says, \"I got a veto off your recommendation. Was ass. Thanks. You got me flying penguins.\" That's a good one. I like that. That's good. Kebabs Sly Cooper idiot. You could you could learn a thing or two. You know, they like get roughed up. They like to rough house, Tim. What? They like to rough housey on this show. Oh, the audience and me. God. Okay. They miss it when I'm not here. Okay. Okay. Yeah. Yeah. Why isn't blessing insulting us? That's what they want. You know, that's what they want. God, this is this is your segue to story number two. These 35 year olds are all watching this show. They come up from the basement to go have dinner with mom. They're like, \"I had a great connection with Greg Miller today.\" You're so mean. I had a great connection with Greg Viller. 18 years and running strong. You know what",
            "start": 1835.2
        },
        {
            "text": "to go have dinner with mom. They're like, \"I had a great connection with Greg Miller today.\" You're so mean. I had a great connection with Greg Viller. 18 years and running strong. You know what I mean? And I like how you say, \"Oh, this is your transition to story number two.\" Yeah. I'm sorry everybody. This is a video game show. I'm kind of funny. Kind of funny. It's called kind of funny. All right. I won't let the atrocities of the world we live in ruin my vibe. All right. I'm still going to deliver insults to you while moving on to story number two. Microsoft confirmed they've supplied AI tech to the Israeli military for use in Gaza following BDS Xbox boycott. Now there was a transition. You know what I mean? The laughing during the headline. Why? Why? Why is this the world we have so bad? Why can I not just talk about toys and insult the people who pay me to talk about the toys? Why why Eddie Pitchford right now? Huh? We could be talking about We will. That'll happen in Wii News.",
            "start": 1880.08
        },
        {
            "text": "bad? Why can I not just talk about toys and insult the people who pay me to talk about the toys? Why why Eddie Pitchford right now? Huh? We could be talking about We will. That'll happen in Wii News. Don't worry about that. We got to talk about this. We go to a rock paper shotgun. This is Edwin Evans Thorwell, which is a fantastic name. Microsoft has finally broken their silence over reports about the use of Azour, and that's how you say it. Azur Azur Azur and Microsoft Genitative AI tech by the Israeli military during the latter's ongoing invasion and bombardment of Gaza, which has led to the deaths of tens of thousands of Palestinians. In an unsigned statement published May 15th, 2025, Microsoft confirmed that they have supplied technology to the Israeli armed forces during the assault on Gaza, which began following the killing and abduction of Israeli civilians on October 7th, 2023. They contend, however, that their own internal reporting has found quote, \"no evidence to date that",
            "start": 1933.28
        },
        {
            "text": "on Gaza, which began following the killing and abduction of Israeli civilians on October 7th, 2023. They contend, however, that their own internal reporting has found quote, \"no evidence to date that Microsoft's Azour and AI technologies have been used to target or harm people in conflict in I'm sorry, in the conflict in Gaza.\" End quote. The news comes a few weeks after the boycott, divevest, and sanctions movement called on people to avoid Microsoft games and gaming services in protest at the company's dealings with the Isra Israel Defense Forces. Uh, according to several investigations earlier this year, including a sizable February report from the Associated Press, the IDF have made use of Microsoft's generative AI services extensively for combat and intelligence activities since October 2023. This includes the use uh the alleged use of Gen AI models to analyze and prepare data for the purpose of targeting air strikes. The AP investigation, which is based on interviews with",
            "start": 1979.2
        },
        {
            "text": "October 2023. This includes the use uh the alleged use of Gen AI models to analyze and prepare data for the purpose of targeting air strikes. The AP investigation, which is based on interviews with current and former members of Microsoft and the Israeli armed forces, uh together with internal company data and documents, also discusses the Israeli military's relationship uh with big tech companies including Google, Amazon, uh Palant, Palanteer, Palanter, I've never heard of them, Cisco, and Oracle. These reports have intensified uh fears among many Microsoft staff that their work is being used as an instrument of war and oppression. Uh Blessing of course pulled this all together and makes this note. This article goes into this article goes long into details about the investigation and Microsoft's claims. Therefore, Blessing is making the it required reading. For people who want the full breakdown, go to rockpotgun.com. Pet uh Palunteer is a uh Peter Thealbacked um big data analytics.",
            "start": 2024.72
        },
        {
            "text": "claims. Therefore, Blessing is making the it required reading. For people who want the full breakdown, go to rockpotgun.com. Pet uh Palunteer is a uh Peter Thealbacked um big data analytics. Okay. Company. uh blessing polls, four big bullet points. Microsoft says that based on quote both our internal assessments and external review, they found no evidence that the Israeli armed forces have failed to comply uh with the policies of their standard commercial relationship. Number two, Microsoft also caveats that they do not have full awareness of how the Israeli military may use any uh Microsoft technology that runs on their own servers. Number three, Microsoft's blog does not include the full text of Microsoft's internal and external assessments, nor does it respond uh to the detail of the allegations made by the Associated Press and other publications. And then number four, no Azour or uh Aparthed movement. I always screw this up. Apartthead, yeah, thank you. Uh have already called on",
            "start": 2072.0
        },
        {
            "text": "allegations made by the Associated Press and other publications. And then number four, no Azour or uh Aparthed movement. I always screw this up. Apartthead, yeah, thank you. Uh have already called on Microsoft uh to release a full copy of their internal review. Boom. Yeah. And in addition to this, I was seeing that multiple people that are within the company of Microsoft like have in various forms stood up and been like, hey, this is wrong uh stood up for the Noer for apartheid movement and got fired and there's a lot of internal struggle with all of this obviously because we are talking about genocide. We are talking about horrible things going on and how the companies systems that these people are working on are creating these these problems and it's it's just so rough. Like obviously my biggest touchstone is entertainment because that is the type of stuff that I consume and I feel like I've learned a lot about just the way that people work and the world can work and coming fresh",
            "start": 2119.52
        },
        {
            "text": "my biggest touchstone is entertainment because that is the type of stuff that I consume and I feel like I've learned a lot about just the way that people work and the world can work and coming fresh off of andor season 2 in particular. It's rough to hear this and see that like in real life like obviously all the dumb cartoons and shows that I'm watching are based off of real life struggles that people are going through and this is just it's so unfortunate to I mean to really make this some basic ass [ __ ] This is Iron Man one stuff of like there should be a realization that hey the things we're working on are for bad. This is this is bad. They're being used for bad. Sure they might be being made for good but they're being used for bad and we're kind of just allowing it to happen and that is resulting in the death of so many people and it's going to continue that way. And it's like this just it sucks and it does feel like that the normal thing of like who the [ __ ] this guy talking",
            "start": 2161.92
        },
        {
            "text": "is resulting in the death of so many people and it's going to continue that way. And it's like this just it sucks and it does feel like that the normal thing of like who the [ __ ] this guy talking about it? And I know I'm nobody and you are too. with different types of nobodyies, but it's like we should at least be aware that this is happening. I mean, this goes all the way to the top of me not pulling a joke punch to come into the story, right, of like we are, I would say, not this is this is not the usual story we would cover on kind of funny games daily. Not the serious n well, yeah, the serious nature of it, right? If Microsoft's [ __ ] up or doing whatever, we would talk about that here. But to come in here and have to deal with yes this uh Palestinian Israeli conflict that's been raging on for decades upon decades upon decades, right? To come in here and have to do this and then sort it out to your point of like we're nobody. We're nobody in this argument. We've had this",
            "start": 2202.48
        },
        {
            "text": "been raging on for decades upon decades upon decades, right? To come in here and have to do this and then sort it out to your point of like we're nobody. We're nobody in this argument. We've had this conversation blah blah. I already saw it going up there, right? The conversation of like there it is, Matthew. Where do our cell phones come again? Where do our cell phones come from again? This is the whole like problem with the entire world we live in of what aboutism where it's like you we can identify this as a problem and then well what about this and what about that and yes the world is completely [ __ ] up and back to your point of are I'm illquipped to fix the world. I try my best by being a good person or trying to be a good person and chase this down and like you know what I mean like try to make educated decisions and choices but like there's so much tied up in here that makes you feel so small and so insignificant right where it's like I mean if you want to go from the giant",
            "start": 2244.88
        },
        {
            "text": "try to make educated decisions and choices but like there's so much tied up in here that makes you feel so small and so insignificant right where it's like I mean if you want to go from the giant like top level of it all right in this whole thing of like there's so many things that can be true all at once where I can sit here and be like yes of course the Hamas attack on October 7th 2023 was horrendous horrendous period full stop. Right? This Israeli attack on the Palestinians and Gaza for the past year and a half is horrendous. Right? The fact that they just got uh the IDF to back down on this block blockade against food trucks. Miss Rachel, Miss [ __ ] Rachel in her bib jeans has to be out there getting [ __ ] on and death threats for saying, \"Hey, can we feed the Palestinian children?\" Like everything is [ __ ] You know what I mean? Free Palestine, everything is [ __ ] And so it's like to go into how little, small, insignificant we all feel on all this stuff to get here. I read",
            "start": 2282.24
        },
        {
            "text": "Like everything is [ __ ] You know what I mean? Free Palestine, everything is [ __ ] And so it's like to go into how little, small, insignificant we all feel on all this stuff to get here. I read this news this morning and it was like one of those things of just like how do I find the outrage for this? I Yes. Google and Amazon and Microsoft and X Corporation and Apple and X whenever the rubble rubble rubber meets the road, these companies let us down. You know, this and maybe that's how I just feel after uh this last election and seeing them all bend the knee to Trump and how it's all gone and stuff. I you know what I mean? Like I don't the bar is so low and none of them can [ __ ] deal with it. Like I don't like I'm This is horrible. This is [ __ ] up. the people but the then the people are there are like I can't believe my to dial it all back to our literal vein of work and I'm so happy you made it to superheroes first because in the when I was doing this car again who we are we're",
            "start": 2332.96
        },
        {
            "text": "are there are like I can't believe my to dial it all back to our literal vein of work and I'm so happy you made it to superheroes first because in the when I was doing this car again who we are we're kind of funny how are we going to talk about stuff like this we're going to talk about the same way we talk about everything right and for me it was Superman right like we again the trailer the newest trailer right is him getting interviewed by Lois he stops a [ __ ] war right but that gets him in trouble with the government right and he's like people would would have died right people were going to die Like that's what's at the heart of all of this to jump to your point of like the people who have been as many times as we have been screaming from the sidelines that AI doesn't seem like a great idea. Tech seems like it's kind of going unchecked. We've been screaming and now the people at Microsoft are standing up like, \"Oh, I got fire. Oh, like you didn't know that was happen. You didn't",
            "start": 2388.08
        },
        {
            "text": "idea. Tech seems like it's kind of going unchecked. We've been screaming and now the people at Microsoft are standing up like, \"Oh, I got fire. Oh, like you didn't know that was happen. You didn't know. You didn't know this was going to go. You don't know the robots and the AIs are going to replace us and there's not going to be any jobs and we're not going to do this.\" Like I don't and I don't know what to do with that. And I'm sorry to be a downer. Like I I I'd love to be more uplifting on everything in this show. I'd love to have a clear-cut this is how we hold everyone to account. But I don't know at what point like everyone's doing something [ __ ] stupid. I don't know what to do with any of that information. Yeah. And it sucks. I wish I didn't feel like there's nothing I can [ __ ] do about it. And if I'm offending you if you aren't on this side of the argument, I'm sorry I guess to that degree. Like I mean this this is a weird one, right? Where there's so much going back and",
            "start": 2427.36
        },
        {
            "text": "do about it. And if I'm offending you if you aren't on this side of the argument, I'm sorry I guess to that degree. Like I mean this this is a weird one, right? Where there's so much going back and forth. Like kind of funny as a community where we are supposed to be able to talk about all this stuff and stuff. So I don't think I've done the normal thing of [ __ ] you and I mean and I've talked about several [ __ ] different things here. So yeah, give me the grace there to take but you know what I mean? Like what are we doing? I don't know what we're doing anymore. I don't know what to do. We keep trying though. Yep. Just keep trying. That's all we can do. Uh in the super chats, a lot of quests super chat and says, \"Demand that people in power do better. That's how individuals can help.\" Is it? Cuz there's so many other people demanding that they just don't pay their taxes and everything goes the same. I don't know. I don't know. I don't know what to do about it. Still got to do that.",
            "start": 2468.96
        },
        {
            "text": "it? Cuz there's so many other people demanding that they just don't pay their taxes and everything goes the same. I don't know. I don't know. I don't know what to do about it. Still got to do that. I'm drinking out of a Nintendo mug that I got at the store and that was pretty cool. I don't know what to do about that. And that's again, as I'm sure you all know, but as I'm sure you also know, people love to snip it things out and make I'm not saying don't care about this stuff. I'm not saying don't go to protest. I'm not saying you, it's all a wash, don't do anything. I'm just saying this is one of those days where you hear about this and then the 13 things surrounding it and the 15 things on top of those and it just feels overwhelming to where what the [ __ ] do you do with this information and what the [ __ ] do you do in this world, this hellscape that we're in? And I think, you know, I want for um a Gregway up and cominging again, we're still just kind of funny. We can only be",
            "start": 2510.04
        },
        {
            "text": "and what the [ __ ] do you do in this world, this hellscape that we're in? And I think, you know, I want for um a Gregway up and cominging again, we're still just kind of funny. We can only be ourselves. Uh in the leadup to uh Superman, maybe on the day of my Gregway, I think is going to be me reading I am Superman, which is that Brad Meltzer uh book that I love so much. It's a children's book that I read to Ben all the time. He loves it. And again, I think it's like the best here's what Superman is kind of thing, right? And of course, you know, the whole point and the the kicker at the end, right, is like, you know, but if you help one person, just one person, you can change the world. And I think that's still for all the majority of us, the easiest way to try to do good is to think about the personal connections, the things you can do in your life, the direct thing you can do on a day-to-day basis to make someone else lives better. So hopefully they do something to make it better",
            "start": 2545.68
        },
        {
            "text": "the personal connections, the things you can do in your life, the direct thing you can do on a day-to-day basis to make someone else lives better. So hopefully they do something to make it better and da da. And that can include, I'm not talking about just helping someone change a tire. I mean, donating to the, you know, we've done so many um not so many, we've done streams before for the Palestinian Children's Foundation, right, of like there are just children who are [ __ ] emaciated and dying and have no parents over there and can't get the [ __ ] food trucks in because of what uh the IDF is doing. Like, that can be that. But I don't know. I'm I'm ranting and raving now about a subject where it's just like I think so many of us feel this way. I don't know. I don't know. I don't know. Anyways, uh super chats I want to get through here. They're serious ones now. Uh Dylan says, \"Free Palestine. Love you all.\" Uh Matt says, \"Well said. Appreciate y'all acknowledging acknowledging it's",
            "start": 2588.0
        },
        {
            "text": "uh super chats I want to get through here. They're serious ones now. Uh Dylan says, \"Free Palestine. Love you all.\" Uh Matt says, \"Well said. Appreciate y'all acknowledging acknowledging it's genocide and comprehending all of this in a way that you and the general audience understands.\" Um and so yeah, the Portland Kevin Greg Greg was asking what do we do? Uh what about can would you guys consider asking people to boycott playing Xbox and Microsoft's products for a week? You guys have an influence. Do do we I don't I may and again like you might get mad at me for this answer and that's totally you're right. Again I don't I don't want to tell you how to feel anything. I just want you to remember that I'm a human being as well. I don't think that would do anything. I don't think the kind of funny sway is big enough to do that. Nor do I think that like Phil Spencer's like I'm glad generative AI from my parent company like you know what I mean? I don't I don't know. Yeah. I don't know is",
            "start": 2628.96
        },
        {
            "text": "funny sway is big enough to do that. Nor do I think that like Phil Spencer's like I'm glad generative AI from my parent company like you know what I mean? I don't I don't know. Yeah. I don't know is the answer to that one. Again it's complicated stuff. Mobile is a joke. We ain't buying Xbox regardless. That's funny. I think that uh boycott as always I do feel like have co can cause results. I don't think that they do cause results and I think that even talking about boycots and if you are the type of person that is inspired by that and do you believe in that? I think that that is how that stuff happens. Personally, I don't. I never have. So that's kind of not my vibe. But go get them and I'm happy to talk about it cuz if you hear that and you're like, \"Yeah, that sounds like the right way for me to have my voice heard.\" Cool. And I feel that's the answer here, right? Where it's like I don't know what the right move is. I don't know. I don't think there is a right move. I mean for us",
            "start": 2674.2
        },
        {
            "text": "for me to have my voice heard.\" Cool. And I feel that's the answer here, right? Where it's like I don't know what the right move is. I don't know. I don't think there is a right move. I mean for us obviously killing innocent people probably that's the right move, right? Not killing innocent people is the right move. Uh but it's that like Herby over in the chat's like we're you're we're in the Twitch chat. He's like we're using Twitch right now which is owned by Amazon which is participating in the war in the exact same way. And that's the whole thing of like this is the webs are all so [ __ ] connected that I think all we can do is talk about it. I don't know and I don't know if that's enough. I think you being educated, you following this stuff, you know, you know, our chats are amazing right now. If you're coming in later and you see a YouTube comment that is get politics out of games or some other dumbass [ __ ] take, right? Like we have to be educated. We have to do this. We have",
            "start": 2716.88
        },
        {
            "text": "right now. If you're coming in later and you see a YouTube comment that is get politics out of games or some other dumbass [ __ ] take, right? Like we have to be educated. We have to do this. We have to get behind the movements that we think are going to change some stuff. Like, but again, it's like I am not shocked that Microsoft's generative AI cloud-based whatever is being licensed out. You know what I mean? Like again, how much [ __ ] money in weapons is the US military, even under Biden giving? You know what I mean? Like, what are we talking about? Yeah. Flying penguins. Oh, this is a [ __ ] It was about Sly. No, no. Flying penguins was funny. That wasn't He wasn't the Sly Cooper guy. I take it back. Flying Penguins. As a father and a business owner with employees, all you can do is take care of your own. You're doing great. We love you, Greg. Not Tim, though. We hate Tim. I mean, Flying Penguin's on it today, Kevin. Give him a gold star. Everybody toss a gold star up there. And",
            "start": 2754.32
        },
        {
            "text": "take care of your own. You're doing great. We love you, Greg. Not Tim, though. We hate Tim. I mean, Flying Penguin's on it today, Kevin. Give him a gold star. Everybody toss a gold star up there. And again, we're making light in a very serious thing because that's what we do on this show. You know what I mean? We're trying our best to be good people. I'm trying to live as best I can as Superman. Thank you very much, Kevin, for the gold star right there. That's for you, Flying Penguins. Uh, it's a shitty situation. And guess what? That is not the only shitty situation. You can open up any news source you want and you will find another shitty situation to look at and be mortified by. I thought that was your segway to story number two. Like end on this. I mean it's just Yeah. Yeah. But yeah, I don't know. All every day we can all try to be good people and do what it is. And I don't think if you're watching live right now or being a part of this, you're a bad person probably. So like it's",
            "start": 2798.0
        },
        {
            "text": "I don't know. All every day we can all try to be good people and do what it is. And I don't think if you're watching live right now or being a part of this, you're a bad person probably. So like it's all we can do is keep trying. Why do we fall? So we can learn to pick ourselves back up. And so continue to watch this, continue to figure this out, continue to be outspoken that we don't want this, I guess. Wow, lots of gold stars. I appreciate that. We will move on to story number three as I am done ranting. Switch 2 reportedly using Samsung chips as Nintendo tries to meet demand. This is Darren over at GameSpot. The Switch 2 could be one of the must-have gaming consoles of 2025. And in an effort to ensure and that supply meets demand, Nintendo is reportedly working with Samsung to increase its production efforts. While Nintendo had previously predicted that 15 million Switch 2 consoles would be sold during its current fiscal year financial year, uh it has been reported that some",
            "start": 2838.32
        },
        {
            "text": "its production efforts. While Nintendo had previously predicted that 15 million Switch 2 consoles would be sold during its current fiscal year financial year, uh it has been reported that some Samsung may may be able to significantly increase the number. According to Bloomberg, 20 million Switch 2 consoles could be sold by March 2026 if Samsung is manufacturing chips for it. Samsung was competing with Taiwan Semiconductor Manufacturing Co. to secure the Nintendo contract and the Korean company will reportedly produce a customized Nvidia chip for the Switch 2. Samsung has worked with Nintendo in the past to supply it with memory chips and displays and the company has or can reportedly ramp up production further if necessary. Sources told Bloomberg that Samsung is also pushing for OLED panels OLED panels Tim to be used for a potential switch to hardware refresh in the future. How's that sit with you? Really well. Uh, obviously I do think we'll eventually get an OLED screen. I'm hearing",
            "start": 2876.32
        },
        {
            "text": "OLED panels Tim to be used for a potential switch to hardware refresh in the future. How's that sit with you? Really well. Uh, obviously I do think we'll eventually get an OLED screen. I'm hearing a lot of stuff, a lot of excuses and why we're not getting one right now. I'm not loving them. Um, apparently a lot of it does just have to do with tech and the quality of variable refresh rate and things like that with OLED on a screen that size um to get it to be the right price for where they want it to be for the Switch to launch. Very upset by that. I don't need to repeat myself. You understand my feelings. However, I will repeat the fact that in my experience with the Switch 2, I've been very impressed by the screen that it does have. And I actually don't think this is going to be so much of a detriment as much as uh [ __ ] it would have been nice. It would have been that much more perfect. Um but what I am more interested in talking about is this 20 million Switch 2 consoles could be",
            "start": 2920.88
        },
        {
            "text": "of a detriment as much as uh [ __ ] it would have been nice. It would have been that much more perfect. Um but what I am more interested in talking about is this 20 million Switch 2 consoles could be sold by March 2026 if Samsung is manufacturing chips for it. Um I think this is going to happen from everything Doug Bowser's been saying that he feels like they should be able to uh match the high demand better than they have in previous console generations for people wanting the Switch 2. And if they can manage to do that, I think they're going to be in a very good spot where obviously a lot's going on in the world. At any moment, things can take a horrible turn for an even worse uh existence than we're currently in. But uh when we look at the year one, this not even year one, this 2025 calendar year uh for the Switch 2, they have a really nice cadence of like monthly releases and reasons to get people in. And I think that they're clearly looking at this as a strategy of like, all",
            "start": 2960.96
        },
        {
            "text": "calendar year uh for the Switch 2, they have a really nice cadence of like monthly releases and reasons to get people in. And I think that they're clearly looking at this as a strategy of like, all right, cool. Mario Kart's the biggest thing ever. Let's launch with that. But Donkey Kong being the month after that, it kind of gives that like second jump on points. Um it allows people to have a little bit more time to either save up money to buy the game because they just spent $80 in Mario Kart World or um just continue to have new jump on points for the Switch 2 as we go on throughout the year. And a lot of them are double dipping, triple dipping it back into Nintendo's catalog. But they've always done that and Nintendo's proven time and time again that people are willing to go back and pay again for a game that they loved. But then also it's going to be a whole generation's first time playing some of these games. Like they're going to be millions of new people playing Breath of the",
            "start": 3001.28
        },
        {
            "text": "pay again for a game that they loved. But then also it's going to be a whole generation's first time playing some of these games. Like they're going to be millions of new people playing Breath of the Wild for the first time uh on the Switch 2. And so I think that having the lineup that they do, whether it's the Kirby and Mario Party and Switch to enhance games, but then the big new games coming out later like Metroid Prime 4 and um Pokemon ZA later in the year, those are going to be very big to different audiences. And I do think that they're going to continue to sell this thing out. My question is, is it going to be Wii Satis sold out, impossible to get where it's like kind of bad? Because this is the time for Nintendo to get these things in households. you know, if they can get 20 million in the first year, that is like such a nice base to be able to count on uh and having the the adoption rates of games and they've continued to show that they have that and every generation's gotten",
            "start": 3042.96
        },
        {
            "text": "in the first year, that is like such a nice base to be able to count on uh and having the the adoption rates of games and they've continued to show that they have that and every generation's gotten stronger and stronger in terms of man, they put out the banger first party games, people are going to buy them in droves to the tune of 10 million. Like I was even looking at sales numbers a couple days ago as I often do and uh Mario 3D Allstars when you're done with your podcast about the same thing over and over again. I mean we're coming up on the Mario Mario 40th I I got Switch on the mic, Greg. More than more than I was going to say is that and it's like 40th anniversary of Mario is coming up this year that for the 35th anniversary they made a whole bunch of announcements back in uh five years ago. Um, and that was where they announced Mario 3D Allstars with the very bizarre release strategy of, hey, it's only going to be out in stores for less than a year. It sold almost 10 million",
            "start": 3084.56
        },
        {
            "text": "years ago. Um, and that was where they announced Mario 3D Allstars with the very bizarre release strategy of, hey, it's only going to be out in stores for less than a year. It sold almost 10 million copies. God damn. You know, and that was a halfass freaking collection, like by any metrics. Didn't include Galaxy 2. No widescreen support for uh Mario 64, which would require tinkering, but it could be done. We've seen it done on PC. Uh, legally or illegally, I'm not exactly sure. Allegedly. Who knows? Um, and then yeah, Mario Sunshine, there's just like a bunch of weirdass little quirks about this thing, 10 million copies sold. If that's the case for a game like that, the way that it was released, come on. If you have 20 million in your first year, you could just get that thing going. Like, I might sound crazy right now, and I might be crazy. Like, we just did our 10-year time cap. Like, I truly believe that the Switch was lightning in a bottle, and I don't know that we'll ever see",
            "start": 3126.72
        },
        {
            "text": "I might sound crazy right now, and I might be crazy. Like, we just did our 10-year time cap. Like, I truly believe that the Switch was lightning in a bottle, and I don't know that we'll ever see success quite like that again. But I remember saying that about the Wii, you know, and the Wii U was the worst followup to that possible. The Switch 2, I think, is in such a different place. Like, I honestly believe that if Nintendo just makes enough right moves in a row, and I don't think this they're that far off from accomplishing this, I think the Switch 2 is going to undeniably win this console generation from whatever metric that actually matters. Uh, and I think that it it has the potential to redefine what video games are to the majority of people playing video games. Maybe not the people listening to this show, but the majority of people playing games when the new like when a Witcher 4 comes out, if it's on Switch 2, where are people going to play it? I don't know. I do know Switch 2.",
            "start": 3173.44
        },
        {
            "text": "to this show, but the majority of people playing games when the new like when a Witcher 4 comes out, if it's on Switch 2, where are people going to play it? I don't know. I do know Switch 2. You think so? I think they will. I think that the mainstream understanding of this thing, there's potential. I I'm talking about they need to line up to make this happen. But, and I'm using The Witcher just as an example of a big multiplayer game. Obviously, that is a very big graphically intensive game that's probably going to be very, very high-end. I also think that we're at a point that games need to run on a lot lower-end things to be able to make their money back. And let's with the support that CD Project Red's already shown for Switch 2 and how we'll see what the reviews are. We'll see how Cyberpunk Ultimate Edition actually shakes out, but every single preview, every single thing about it sounds glowing as [ __ ] It is not the best way to play it, but I do think it'll be the place the",
            "start": 3214.08
        },
        {
            "text": "Cyberpunk Ultimate Edition actually shakes out, but every single preview, every single thing about it sounds glowing as [ __ ] It is not the best way to play it, but I do think it'll be the place the majority of people play many games going forward. Be good enough. Okay. Well, I look forward to that. Uh, you know, again, the Switch 2 is very exciting from me as an industry person. Both obviously in terms of, okay, what's it going to do for coverage for us, but what will it do for the industry? What are the games going to be on? All these different things. I like that a lot. I didn't like Mike walking in in his anorak hood up, grinning at me like he was going to run out here and then just going to get a Coke. That was weird. I didn't like that one bit. He's coming. He's on the way. He's on his way. Hood up. Hood up, everybody. These aren't waterproof, right? Craig. Yeah. Just wanted to say I really missed you. I miss you, too. Yeah. Ah, he got his ears pierced, too. Just like Roger. He",
            "start": 3255.04
        },
        {
            "text": "his way. Hood up. Hood up, everybody. These aren't waterproof, right? Craig. Yeah. Just wanted to say I really missed you. I miss you, too. Yeah. Ah, he got his ears pierced, too. Just like Roger. He did it. He did it. He went to Claire's boutique. God damn. I never thought saw that coming. I never saw that coming. Do I need to get my ears pierced? Yeah, absolutely. I love you so much, Mike. Uh, number four on the Roper Report. Sag after slaps Fortnite with unfair labor practice complaint over James Earl Jones's AI recreated voice of Darth Vader. This is Todd Spangler over at Variety. SAG After is objecting to the use of AI to recreate the late James Earl Jones's base inonations of Darth Vader in Epic Games's Fortnite. The Actors Union said Epicowned Llama Productions quote chose to replace the work of human performers with AI technology for the Star Wars themed Fortnite Battle Royale mini season that launched last week. Quote, \"Unfortunately, they did so without providing any notice",
            "start": 3289.44
        },
        {
            "text": "the work of human performers with AI technology for the Star Wars themed Fortnite Battle Royale mini season that launched last week. Quote, \"Unfortunately, they did so without providing any notice of their intent to do this and without bargaining with us over appropriate terms.\" End quote. As such, SAG After filed an unfair labor practice charge with the National Labor Relations Board against Llama Productions. Jones, who died in 2024 at age 93, had signed off an agreement to allow his archival voice recordings to be used to recreate his younger voice from Star Wars films for future Lucasfilm projects. In addition, Jones's family had granted permission for the use of his voice in Fortnite. According to Disney, uh, Lucasfilm and Epic Games, quote, James Earl felt that the voice of Darth Vader was inseparable from the story of Star Wars, and he always wanted fans of all ages to continue to experience, his family said in a statement. We hope that this collaboration with Fortnite will",
            "start": 3337.92
        },
        {
            "text": "Vader was inseparable from the story of Star Wars, and he always wanted fans of all ages to continue to experience, his family said in a statement. We hope that this collaboration with Fortnite will allow both longtime fans of Darth Vader and newer generations to share in the enjoyment of his this iconic character. End quote. But SAG Astra said Fortnite's use of Jones's AI generated voice was not cleared by the union. God, what a time we live in, though. Like, these are stories we're talking about. It's like even when it's like, all right, he's cool with it. It's still there's still so many factors that don't just make that okay. Yeah. Was he cool with it going and like Yeah. morphing and being able to say stuff and I, you know, I don't trust anything I see. I mean, let's assume he was, right? Like, I don't think that we should should assume he wasn't. Like, he he signed off on this. And if you don't know what that means, then you shouldn't be signing off on things like that. But I'm",
            "start": 3384.32
        },
        {
            "text": "Like, I don't think that we should should assume he wasn't. Like, he he signed off on this. And if you don't know what that means, then you shouldn't be signing off on things like that. But I'm I'm saying all of this just from the perspective of like yeah individuals though do not get to just make these like decisions without it affecting other people. So it's like even though you are cool with it and your family's cool with it and you want that cash money I get that but also it's going to really affect so many people losing jobs not having jobs having to deal with the stuff and then also have you seen the videos of this Craig? That was what I was where I was going with to to my point was he it sounds like they were okay with using the archival stuff and this that the other. Were they okay with him getting put into an AI factory to say all sorts of heinous horrible [ __ ] Cuz that's what I've seen on TikTok is people and I don't know how I don't know how many of them are real. I'm not",
            "start": 3424.48
        },
        {
            "text": "with him getting put into an AI factory to say all sorts of heinous horrible [ __ ] Cuz that's what I've seen on TikTok is people and I don't know how I don't know how many of them are real. I'm not actually investigating. There's that problem, too. Yeah. Exactly. Right. Yeah. But it's like I don't like this what they is this what they wanted or they want you know look into your heart and you know it to be true whatever the [ __ ] he says to Luke on. Yeah, you know, I know he doesn't say Luke father. I know that's the big thing. Spoilers, everybody. It's just a dystopian time. And where's the [ __ ] Watt? You know what I mean? Where's the W content? And I'll tell you right now, Epic, if you tried to put Wad in the game and you used AI for his voice and you just hire me to do it, we'd have a big problem. But anyways, back to AI. Who would have thought this be a problem? Tim, I don't know, man. I'm sick of AI. I know. I'm sick of everything being horrible. Yeah. I'm sick of not having a",
            "start": 3463.84
        },
        {
            "text": "a big problem. But anyways, back to AI. Who would have thought this be a problem? Tim, I don't know, man. I'm sick of AI. I know. I'm sick of everything being horrible. Yeah. I'm sick of not having a Nintendo Switch, too. Me, too. All that big news. So big. If I wanted little news, where would I go? You'd go to Wat. He's so small. He's the smallest guy that ever existed. Then you go to the Wii News channel where we cover all the small news items that you need to know about. Number five, the Wii News. Developer Shift Up has confirmed a sequel to Steller Blade is coming. From game developer, good stuff. Uh, the AIAS has asked donors for their support of the Strong Museum of Play after funds were cut by the Trump administration. Uh, from Eurogamer, joining Netflix's growing catalog of animated adaptations is a series based on Supercell's mobile strategy games Clash of Clans and Clash Royale. Okay, interesting. Why not? From VGC, the director of Final Fantasy 11 says the game was planned",
            "start": 3502.56
        },
        {
            "text": "adaptations is a series based on Supercell's mobile strategy games Clash of Clans and Clash Royale. Okay, interesting. Why not? From VGC, the director of Final Fantasy 11 says the game was planned to end last year, parenthesis, and possibly shut down altogether, but fan support kept it alive. Nobody Mike's mom's still paying for his account in 2001. Uh to a te demo is now available on Steam. Very excited for that. It's why it's on my fantasy critic. Then Randy Pitchford has responded to a fan inquiring about an $80 price point for Borderlands. It's a tweet if you could bring it up, Kevin. Uh Randy says, \"A, not my call. B, if you're a real fan, you'll find a way to make it happen. My local game store had Starflight for Sega Genesis for $80 in 1991 when I was just out of high school working minimum wage at an ice cream parlor in Pismo Beach and I found a way to make it happen. End [Music] quote. You just hit a point where you can't just say whatever you're thinking. And Randy, you hit",
            "start": 3550.4
        },
        {
            "text": "minimum wage at an ice cream parlor in Pismo Beach and I found a way to make it happen. End [Music] quote. You just hit a point where you can't just say whatever you're thinking. And Randy, you hit that a long time ago. And then you kept saying things and people were like, \"Hey, hey, hey, hey, you shouldn't say that stuff.\" I'm going to keep saying handsome stuff. And you know how it is. Like I just ranted about how bad the world is. I talked about Israel and Palestine, which I am by no means an expert on, right? You know what I mean? And the entire time I'm like, \"Just give me grace though if I'm wrong or if I'm stepping on your toes. Like I'm not trying to offend. I'm just trying.\" And it's like then you get an answer like like after he said to Game Informer, I can't believe he tweeted at Game Informer, I can't believe you'd [ __ ] me like this after the Borderlands 3 reveal when everything was sunshine and roses. Game Informer just put out a statement or an article being like Randy",
            "start": 3598.16
        },
        {
            "text": "Game Informer, I can't believe you'd [ __ ] me like this after the Borderlands 3 reveal when everything was sunshine and roses. Game Informer just put out a statement or an article being like Randy Fincher said there aren't microtransactions, but then it sounds like there are. So, it's just and he I can't believe you at that point. the fact that he was so above reproach that no one was able to grab his phone and be like, \"We got to talk. We got someone doing that one.\" Like I can just think of like if I was just if I tweeted whatever blue sky it like I would come home and Jen would be like, \"All right, like I understand you have free will, but we need to talk about like why that was not the move and maybe we should talk about it here.\" And as the industry hurdles towards recession and everything else and everyone's worried about [ __ ] being able to pay for goddamn eggs and the stock market and just the tariffs and like it's just I understand that Borderlands makes a lot of money. You",
            "start": 3651.2
        },
        {
            "text": "else and everyone's worried about [ __ ] being able to pay for goddamn eggs and the stock market and just the tariffs and like it's just I understand that Borderlands makes a lot of money. You know what I mean? So I don't think Randy Pitchford is is is that do this is just not the way to talk to the audience. You know that's it. It's that it's just not the way to talk to the audience. And you can do whatever you want. This is I've had this conversation in the the kind of funny podcast last week, right, for my Ben Star thing. You can say whatever you want. Just deal you got to deal with the repercussions, the consequences of your actions. So, I'm not like but like it's just not a good look. You know what I mean? It's not a good look. It's not. Then another required reading for you. Meet the man who designed Pokemon's iconic logo. This is Rebecca Valentine at IGN. Uh, you can go read it right now, but Tim's gonna break it down for us. Uh, I was just checking this out. It's pretty cool.",
            "start": 3696.96
        },
        {
            "text": "man who designed Pokemon's iconic logo. This is Rebecca Valentine at IGN. Uh, you can go read it right now, but Tim's gonna break it down for us. Uh, I was just checking this out. It's pretty cool. If you scroll down, Kev, there's just like a lot of different designs on what the Pokemon logo could be, and it's wild that Pokemon's become obviously one of the most iconic brands of all time. Uh, but even like the logo is spent on countless products, right? So, made so much damn money. But, it's just cool to see the the sketches that kind of eventually got there. It reminds me a lot of sitting in Nick's uh apartment back in the day coming up with the smiley, you know, it had to have the exact right proportions. And then Andy eventually saw it was like, I don't like these proportions. And so we fix do whatever you want. And he fixed it. Or I mean Nick walking out with you smoking. Yep. I'm just there's no [ __ ] way I'm calling the company kind of funny. You flick the cigarette and walked",
            "start": 3744.24
        },
        {
            "text": "fix do whatever you want. And he fixed it. Or I mean Nick walking out with you smoking. Yep. I'm just there's no [ __ ] way I'm calling the company kind of funny. You flick the cigarette and walked away. Here we are. Here we are 10 years later. 10 years later, everybody. Uh that's the end of Wii News. Let's uh jump in to your super chats. You all have been here giving us so many super chats. Thank you so much. You know, when I worked at a ice cream parlor in Pismo Beach, I couldn't afford a super chat, but I did it. I [ __ ] made up. Uh Jeff Bull Jr. super chat and says, \"The squids have reached Super Earth. All hell divers to hell pods.\" Hell divers is popping off. If you aren't aware, get out there. Demon Hacker said, \"I heard you ain't a real fan if you can't afford Borderlands 4.\" Uh Nitro 39 says, \"Graduation tax. Thanks for getting me through college. You're welcome, Nitro. Thank you for supporting us. Happy graduation. Hell yeah. Congratulations. It's the funniest [ __ ] thing",
            "start": 3784.24
        },
        {
            "text": "Nitro 39 says, \"Graduation tax. Thanks for getting me through college. You're welcome, Nitro. Thank you for supporting us. Happy graduation. Hell yeah. Congratulations. It's the funniest [ __ ] thing to me. Like happy graduation. I still won't say that. Just real quick, birthday tax. I won't say happy birthday. Graduation text will say happy birthday. The birthday thing I think is so funny because like first off, I don't know who they're talking about saying that. This came up a couple months ago of like oh they don't it's so rude they don't say happy birthday. It's like we do. We do. And it sometimes some super chats get missed. That's just how things go. But I think that's funny that anyone would call that out because it's like we do like majority of the time. Guarantee. Yeah. And now it's leveled up that we're not giving enough. We're not singing the whole [ __ ] song. I refuse to. I refuse to. I sing the goddamn song. I don't know why we're singing the song at all. We should stop",
            "start": 3826.8
        },
        {
            "text": "leveled up that we're not giving enough. We're not singing the whole [ __ ] song. I refuse to. I refuse to. I sing the goddamn song. I don't know why we're singing the song at all. We should stop singing the song. Period. I don't ever want to [ __ ] hear the song again. I'll be goddamn damned if I sing the song. I'll be standing in the back mouthing it baking that [ __ ] Hear me out on this. All right, we solve the problem, right? Where we pick an arbitrary day that's a weekday. Okay, I'm going to throw out September 13th. Check if September 13th's an actual weekday for me, Kevin. And we just say that's the day where we acknowledge all the birthday taxes throughout the year. And so we just sing happy birthday on that one day. And that way if you do it before after the next one you're there, you're done. September 13th is a Saturday. [ __ ] me. You know what I mean? Dumb [ __ ] I I just there's another iconic September teens day. Oh god. Oh man. So [ __ ] laugh. No, my thing is if",
            "start": 3865.28
        },
        {
            "text": "there, you're done. September 13th is a Saturday. [ __ ] me. You know what I mean? Dumb [ __ ] I I just there's another iconic September teens day. Oh god. Oh man. So [ __ ] laugh. No, my thing is if somebody like says birthday tax, I'm going to look at that and say happy birthday whoever. And that's it. We don't That's it. That's what you're getting. That is me acknowledging that it's your birthday. You You're sending us money to acknowledge it's your birthday. We acknowledge it. This is all a thing. This is We're acknowledging it now. But what if we all just stop singing? What if we all it's about to be time to sing the song and none of us actually do it. We're all just mouthing it. Then it's a bunch of [ __ ] in a circle. Mouth will get I lost you on the narrative, but I like it. I like it still. Christian JPEG super chatted, but it was also here. Uh Greg, I'm 32 and that's what I say to my 35-year-old partner when when he's talking about, you know, he comes up from the basement",
            "start": 3907.52
        },
        {
            "text": "it still. Christian JPEG super chatted, but it was also here. Uh Greg, I'm 32 and that's what I say to my 35-year-old partner when when he's talking about, you know, he comes up from the basement and says, \"I had a good interaction with Greg Miller.\" Remember I said that? I said, \"Say it to your mom.\" I see. We weren immediately super chated well and said, \"My mom's dead, Greg.\" Call me a river. A lot of moms are dead. All right. My dog's dead. You know that f that's a that's a pain you won't understand. Nightlife says sorry I got myself out. I'm funny. I'm [ __ ] funny guys. I don't know why you if I was anybody else I' turn on the show it's like oh it's blessing and be like oh peace. This ain't going to be they ain't going to they ain't going to get out of pocket on this one. Yeah I just out of pocket. I'm new man. I'm from Canada. I'm new man. Oh night nightife says whoa whoa whoa whoa whoa. You guys don't think Nvidia is putting chips into certain weaponry or AI that helps",
            "start": 3948.48
        },
        {
            "text": "I just out of pocket. I'm new man. I'm from Canada. I'm new man. Oh night nightife says whoa whoa whoa whoa whoa. You guys don't think Nvidia is putting chips into certain weaponry or AI that helps military. Back to it. Back. Just go back to everything's off. Uh oh, Scott C says, \"Greg, you're wrong. I'm 36 and our connection is real. Any recommendation for stuff to do in Los Angeles? I'm here for a while doing fire debris cleanup.\" Oh, that's interesting. My neighbor went down and did that. Scott, if you see my neighbor, say hi. Um, well, Los Angeles we talk a lot about. Uh, if you can go see uh James Williams wrestle, go do that. Yeah, for sure. Uh, Millennium Wrestling. They do it every Friday, even if James isn't part of it. It's very fun. Very, very cool. Every Friday. I didn't know that. Uh, it the the show's every Friday. Oh, nice. Um, yeah. Um, James has only been doing it like once a month or so, but he's one of these guys. He's a part-timer. I hate that. Yeah. Uh, married to",
            "start": 3986.24
        },
        {
            "text": "Uh, it the the show's every Friday. Oh, nice. Um, yeah. Um, James has only been doing it like once a month or so, but he's one of these guys. He's a part-timer. I hate that. Yeah. Uh, married to a woman who, you know, works with the Muppets now. He thinks he's big time. Comedy store is great. It's actually worth going to. Super fun. Great way to spend a night. No matter what night it is, there's always fun shows going on. And even if you just go down and like buy tickets for like the later show just hanging out in the little front area, you're going to see a bunch of like people, oh, I saw them in this sitcom and that sitcom. It's pretty cool. They're everywhere. Uh, go to Mouso and Franks. I love that restaurant. Sorry, Foxy. Steve got me said, Greg is the definition of hurt people hurt. Nightlife says, \"Kind of funny never lets us down.\" Thank you. No, thank you, Nightlife. Uh, Cozy Bear says, \"Hey folks, sadly I won't be on happy hour because I have an alumni choir practice.\" So, a",
            "start": 4033.36
        },
        {
            "text": "Nightlife says, \"Kind of funny never lets us down.\" Thank you. No, thank you, Nightlife. Uh, Cozy Bear says, \"Hey folks, sadly I won't be on happy hour because I have an alumni choir practice.\" So, a question instead for Greg. What is your interest in Metroid Prime 4? No, I'm not. I Here's the thing. I If it was a, you know, we're doing a patented PlayStation game then. No, even then, I think. But I I would be in the same place of stick with me. Not on the review scale, right? But I'd be a five where I'm like I'm not against it, but I'm not like I can't wait for it, but I'm hoping I'll see it and I'm like, \"Oh, I can't wait to play it and jump in on that thing. I'm gonna have to play something on this thing other than old games are not updating. Uh Ples says, \"I think the major draw of OLED that many people overlook is the impact on battery life. A better battery life along with a beautiful screen I believe is a strong selling point. IMO #avetheong.\" I agree, man. OLED on everything.",
            "start": 4073.32
        },
        {
            "text": "that many people overlook is the impact on battery life. A better battery life along with a beautiful screen I believe is a strong selling point. IMO #avetheong.\" I agree, man. OLED on everything. Uh Cameron comes back to the James Earl Jones story. The issue isn't that it's AI or the intent of James Earl Jones's estate. It's that Llama Productions didn't give SAG after a proper notice per their agreement. Correct. Uh, Quel I think it's like Kelsey but Quelsey deal. It's like a Quesadilla merged with Kelsey, but I can't say it. I mean, you're right, dude. I'm on today. [ __ ] What about every program? We're already We've already seen how devs have worked to make their games run well on Steam Deck. Imagine how they'll support a system that'll sell infinitely better. That honestly that is my argument and that we've seen them time and time again now really push for things to be uh deck verified day one and we're talking about a piece of hardware that even if you combine all of the Steam",
            "start": 4112.56
        },
        {
            "text": "argument and that we've seen them time and time again now really push for things to be uh deck verified day one and we're talking about a piece of hardware that even if you combine all of the Steam Deck likes with the RG Ally and Lenovo Legion and all that stuff we are talking well under 10 million in sales and that's just hardware out there period and these teams are working for this because they know that there's an audience that cares about that. Yeah. If the Switch just works and the games actually are playable and you don't need to worry about any PC gaming stuff, any Steam Deck garbage stuff, just boom, it just actually works. And not in a, oh, Mortal Kombat looks like absolute [ __ ] on the Switch way, but in a oh [ __ ] Cyberpunk actually looks pretty good. Final Fantasy 7 remake actually looks good. Like that's all you need. And I think that the recipe for success is there. A lot of factors have to uh happen in order for it to all go down that way, but I think that there is a",
            "start": 4163.12
        },
        {
            "text": "looks good. Like that's all you need. And I think that the recipe for success is there. A lot of factors have to uh happen in order for it to all go down that way, but I think that there is a higher likelihood than not that that is the future. Hell yeah. And then the final super chat, there's a bunch of other ones, but they're jokes and we're hanging out and I love you. Mr. Hawk says, \"Tim, I tagged you in a few story modders podcast episodes on Blue Sky, all of our Nintendo topics. Hope you watch and listen.\" Appreciate you. I need more. We appreciate all of you watching and listening to this episode of Kind of Funny Games Daily. Of course, we have a thing called You're Wrong. Nobody submitted anything. We crushed it. Oh, [ __ ] No, it filled in after I said that. Ah, [ __ ] No, here we go. It's kebabs. No, no, we're not dealing with this. Uh everybody, of course, uh if you didn't know, this has been an episode of kind of funny games daily. Each and every weekday, a variety of",
            "start": 4203.2
        },
        {
            "text": "we go. It's kebabs. No, no, we're not dealing with this. Uh everybody, of course, uh if you didn't know, this has been an episode of kind of funny games daily. Each and every weekday, a variety of platforms, we run you through the nerdy video game news you need to know about live on twitch.tv/kindfunny games, youtube.com/kind of funny games, and podcast services around the globe. If you like that, pick up a kind of funny membership. $10 gets you all of our shows for the month adree. It gets you the ability to watch your daily dose of me in a series we call Gregway. And of course, you get good karma for supporting a small business. If you're a patreon.com/kindfunny member at the $25 or above level, of course, you could join us for a live happy hour today where you call in, we answer your questions. And if you're not calling in, you could just listen later because it'll be up for you like all the other happy hours are later over on Patreon. But I digress. For now, it's time to go to the",
            "start": 4240.4
        },
        {
            "text": "And if you're not calling in, you could just listen later because it'll be up for you like all the other happy hours are later over on Patreon. But I digress. For now, it's time to go to the games cast and review through the eyes of one Tim Gettys and blessing at oay expedition 33. But until next time, it's been our pleasure to serve you. [Music]",
            "start": 4279.36
        }
    ]
}