{
    "id": 14161,
    "video_id": "rBfzvh6m3F8",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Elden Ring Nightreign Review - Kinda Funny Gamescast",
    "description": "Go to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nTime Stamps:\n00:00:00 - Start\n00:01:20 - Housekeeping\n00:02:31 - Elden Ring Nightreign Review\n00:36:41 - The Magic of the Game\n00:43:23 - Will This Game Find Success?\n00:47:05 - SuperChats\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748456484,
    "duration": 3668,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Wednesday, May 28th, 2025 at a very special time. Today we're starting before Games Daily. Normally games daily is at 10. Games cast is at 11 Pacific time, but we're switching that around. Why blessing out a Yo-Yo Junior? cuz I got to scadaddle. I'm going to LA on a flight. I'm hopping on a flight to go to LA to attend Riot. I'm going to Riot. Um I'm going to see their new card game. Okay. Riftbound. Card Game Poppy. Blessing out of your age. That's what they're calling me nowadays. Uh Riftbound is essentially like their version of Magic the Gathering and they're doing like a big event for it. And so uh I'm peace now around noon to actually go to that. Cool, cool, cool. So that's why we're doing games daily after this though. Everybody, I see the chat getting all riled up. Don't worry, it's going to be a great day full of content. I'm Tim Getty's over there. We have Andy Cortez. Hello. With such a cool sweater. Ah,",
            "start": 5.59
        },
        {
            "text": "Everybody, I see the chat getting all riled up. Don't worry, it's going to be a great day full of content. I'm Tim Getty's over there. We have Andy Cortez. Hello. With such a cool sweater. Ah, a young tarnished. They They don't say tarnish in the game, I don't think. Yeah. No, cuz we're nightfares. Yeah. We're different. We're different people. We're night far in reality. We're going to learn all about that because this, of course, is our Elden Ring Night Rain review. And this, of course, is the kind of funny games cast where each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership. It gets you the show's ad free, and you get a daily video/audio from Greg Miller called Greg Way. For a chance to be part of this show, submit your thoughts and opinions as YouTube super chats as we go. If you have",
            "start": 53.36
        },
        {
            "text": "show's ad free, and you get a daily video/audio from Greg Miller called Greg Way. For a chance to be part of this show, submit your thoughts and opinions as YouTube super chats as we go. If you have any questions about Night Rain or Elden Ring in general, please send them through and one of these two beautiful bastards will answer the questions for you. Remember, we are an 11person business all about live talk shows. After this, we're doing games daily talking all about how Apple is jumping into games even deeper. Uh then the stream's going to be Doom the Dark Ages with Nicholas Scarpino. If you're a kind of funny member, today's Gregway is 15 minutes about what triggers Greg and two parenting questions. [Music] I wonder if they're involved. Are they connected? Yeah. Yeah, I I do wonder. Uh, thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Mood, but we'll tell you about that later. For now, let's start with the topic of",
            "start": 91.76
        },
        {
            "text": "Uh, thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Mood, but we'll tell you about that later. For now, let's start with the topic of the show. Tots, Tim, I got my TomT like the other one, but like this one. This is one of them. So, this Okay, this is for the Switch 2. Yeah, switch two. Okay, you're all ready. You're all ready. Switch to TomT. So, this isn't the one that we that I was telling you about because they haven't even officially announced it. So far, they've only announced the hard case for not announced, they've released the hard case for uh the Steam Deck is what I've been using it for, which is just just the slightest bit thinner than this. But still, you're getting pretty thin there. This is pretty damn thin for a freaking cushion case. I like that. And it's like I don't give a damn about like how much support it's providing. I just don't want the JoyCons to be the JoyCons. But then you bringing up just",
            "start": 138.56
        },
        {
            "text": "for a freaking cushion case. I like that. And it's like I don't give a damn about like how much support it's providing. I just don't want the JoyCons to be the JoyCons. But then you bringing up just wrapping up the screen. Uhhuh. And bringing a controller like you're totally set. Now, if you want to get real crazy, not so much for the Switch, because for that, you should just do what I said, uh, Pro Controller, and then just the the tablet part of the Switch, too, bubble wrap, but for a Steam Deck or Asus RO or any of the other type of handhelds, they sell these little things you can get on Etsy that just kind of wrap around the analog sticks so the sticks don't move. Ah, that's what I want. Throw in the bag. I don't want them to get snagged in there with a on a on a bottle of vitamins or whatever I got on a trip. What the drift, you I'm very fascinated on the things that you take on on trips cuz remember last last time you had your bag cuz we I think it was me and you were going to",
            "start": 175.04
        },
        {
            "text": "whatever I got on a trip. What the drift, you I'm very fascinated on the things that you take on on trips cuz remember last last time you had your bag cuz we I think it was me and you were going to LA and it was slightly opened and we could see the drugs in there and me and Greg were like yo what's he what's he doing? So um I always got my prescription meds but then the other bottle is usually me getting a bottle that is like empty and I'll throw a leave zereek and just like r you know vitamin C is chewables very important. He's been backpack boys since day one. You put it all in the same container? Uh, without a label? Yeah, for those. Yeah, for like I know what they look like. Do you do that internationally? Yeah. Do you get worried that you'll get stopped at customs and they're like, \"What are these drugs? These unlabelled drugs.\" Yeah. The the scary time that I accidentally brought a [ __ ] weed gummy in my hoodie pocket and it was still there when I when I was on the plane. I was",
            "start": 213.76
        },
        {
            "text": "are these drugs? These unlabelled drugs.\" Yeah. The the scary time that I accidentally brought a [ __ ] weed gummy in my hoodie pocket and it was still there when I when I was on the plane. I was like, \"Oh my god, I'm a drug smuggler. I'm smuggling.\" Well, it's the topic of the show. everybody else in rig night rain review. Uh it's out tomorrow. The developer of course is from software. The publisher is Bandai Namco. This is a $40 title on the Steam description is as follows. Elden Ring Night Reigns. A standalone adventure within the Elden Ring universe crafted to offer players a new gaming experience by reimagining the game's core design. Uh we got some current critic things going on. Currently at 78 on Metacritic. Wesley Leblanc, the homie at Game Informer, gave it an eight, uh, saying, \"Night reign is at its best when I'm at my best, which means From Software's take on the rogue light genre needs to meet me halfway, leaving its frustrating misgivings at the round table hold. When",
            "start": 255.44
        },
        {
            "text": "\"Night reign is at its best when I'm at my best, which means From Software's take on the rogue light genre needs to meet me halfway, leaving its frustrating misgivings at the round table hold. When the matchmaking works, when the map randomness gives you gives my trio a fighting chance, and when the storm doesn't punishingly throw an unfair wrench into the expedition, I'm excited to rise to the challenge. The reward for my efforts is the mastery, knowledge, and adrenaline I spent dozens of hours building in Elden Ring condensed into a single run. And every success is as visceral and glorious as the last. And then Mitchell Saltzman, the homie at IGN, gave it a seven, saying, \"When Elden Ring Night Reign is played exactly as it was designed to be played, it's one of the finest examples of a three-player co-op game around. The eight character classes are each fun to use and feature a surprising amount of depth despite their limited move sets. The new Night Lord boss battles are among the",
            "start": 305.04
        },
        {
            "text": "three-player co-op game around. The eight character classes are each fun to use and feature a surprising amount of depth despite their limited move sets. The new Night Lord boss battles are among the best From Software has ever created and make the most of the three-player dynamic and the fast-paced race against the clock nature of each run leads to exciting moments of split-second decision-making and frantic rushes to try and finish up a fight before the circle closes in. But a lack of crossplay, duo matchmaking, and built-in communication tools makes it hard to create the conditions needed to have this kind of experience unless you're bringing two real life friends on every run. And if you want to just play by yourself, I can't recommend it because of the poor solo mode balancing. All of this amounts to an ambitious spin-off that's exhilarating when you're able to create the proper conditions and one that quickly flips to incredibly frustrating when you're not. Sounds a lot like The",
            "start": 345.68
        },
        {
            "text": "this amounts to an ambitious spin-off that's exhilarating when you're able to create the proper conditions and one that quickly flips to incredibly frustrating when you're not. Sounds a lot like The Legend of Zelda: Four Swords Adventures, boys. Oh, damn. Oh, I was expecting that. I haven't experienced a game experience like this. This is a game showdown chat. That was actually a review for Four Swords. Let's get into your thoughts on this. Andy Cortez, you are the biggest Elden Ring fan that I know. What do you think about Elden Ring Night Re? A lot of what Mitchell Sawsman said there. I kind of I echo for sure. I think that it's a really fun game. I' If I were to give it a score right now, which I shouldn't because I haven't beat all the bosses, I'd give it uh I'd give it like an eight. I think it's a great time. recommend the hell out of it. If you are trying to play solo, don't uh it's going to be a bad time for you. Uh [ __ ] refund refund that [ __ ] if you're only looking to",
            "start": 386.32
        },
        {
            "text": "I think it's a great time. recommend the hell out of it. If you are trying to play solo, don't uh it's going to be a bad time for you. Uh [ __ ] refund refund that [ __ ] if you're only looking to play solo. It's, you know, whenever people ask me, would you recommend Valerant to somebody who doesn't really have like a squad to play with? It's like, no, that's a [ __ ] nightmare. Why would I wish that evil upon you? And I think for a solo player hoping to hop in, you are kind of I think your mileage may vary because as reviewers that were playing with other reviewers and other streamers and other people that know what they're doing and largely quickly get the formula of what to do. a lot easier for people like me to hop in solo to match up with other people, right, with randos cuz you hop in and right off the rip, somebody's showing that they're going to be the shot caller and they're going to be bringing up the map and they're going to be pinging the places you need to go. And if that",
            "start": 433.68
        },
        {
            "text": "and right off the rip, somebody's showing that they're going to be the shot caller and they're going to be bringing up the map and they're going to be pinging the places you need to go. And if that doesn't happen, then I was doing the shot calling for my other two randos when I wasn't playing with Bless to Snowike Mike. Um, and that and that's all great and fun, but that's probably not going to happen a whole lot. I think that it may be really really rough for people hopping in with the general public for looking for two randos because what suddenly one It's like when you drop in Fortnite uh alone and one squadmate goes somewhere else. You're like, \"Ah, [ __ ] Where are they going, dude? Why aren't they following the squad? Ah, they died over there. Oh, they left the game. Fuck.\" you know, like that can quickly snowball into a really frustrating experience. And um I think From Software will always just be behind enough to frustrate you. They lack of the lack of crossplay really really",
            "start": 486.24
        },
        {
            "text": "like that can quickly snowball into a really frustrating experience. And um I think From Software will always just be behind enough to frustrate you. They lack of the lack of crossplay really really bad. Really awful. And I I hope that they can maybe find a way to implement that. I doubt that that happens. Um, I'm praying that the the mod gods out there get some solo offline mods going because when you're with your squad and you die, you always have the hope that somebody can res you. When you're playing solo, you die, your run is over. And it's it it's really shitty and it sucks cuz in Elder Ring, when you die, it's like, \"All right, let me go give that boss another chance. I wish I had three chances to come back as a solo player or something like that.\" or and maybe it's a different sort of a vibe whenever you're in a boss fight. I don't know. There's better ways to balance it. But for everybody wondering where's duos, why can't we squad as duos? I totally understand your uh",
            "start": 529.04
        },
        {
            "text": "sort of a vibe whenever you're in a boss fight. I don't know. There's better ways to balance it. But for everybody wondering where's duos, why can't we squad as duos? I totally understand your uh question because I it doesn't feel like solo is even tuned for solo when you it feels like they just said, \"Hey, fuck.\" I'm sure the numbers they could show us the numbers and say like, \"Oh, the bosses are less healthy. the bosses do less damage. I didn't [ __ ] notice a difference when I played solo versus in trio. So, it's like it really just felt like they said, \"All right, you can hop in solo and you're playing against, you know, what a trio mode would feel like. So, why not just do duos at that point?\" Cuz [ __ ] it, cuz it doesn't really feel like this is balanced anyway. Um, a lot of frustrations there. I'm talking a lot of [ __ ] about this game. And then it will still deliver those magical From Software moments where you take on a big boss and the music is, you know, hype as hell and",
            "start": 578.56
        },
        {
            "text": "there. I'm talking a lot of [ __ ] about this game. And then it will still deliver those magical From Software moments where you take on a big boss and the music is, you know, hype as hell and um and then you take an eagle out and you're right into the next spot and the vistas are insane and the way that the world changes is really cool and imaginative. Um and uh and I also one of the most shocking things in Night Rain. Uh I walked up to the big bird guy. You got a bird head, Tim. He's a big big guy. big knight. He's got a bird. He's just like that dude. He's a bird with armor. Yeah. And you walk up to him and his talk to him. His accent, he's a Middle Eastern dude from the UK with an accent. I'm like, whoa. I'm just used to like [ __ ] more. I'm I'm used to Yeah. Like, holy [ __ ] This is crazy. Walk up to the arrow guy who looks like uh the one archer uh Pokemon, the bird archer in Pokemon. You know what's wrong? this Hujai this walk up to that dude who reminds me of that Pokemon",
            "start": 626.72
        },
        {
            "text": "is crazy. Walk up to the arrow guy who looks like uh the one archer uh Pokemon, the bird archer in Pokemon. You know what's wrong? this Hujai this walk up to that dude who reminds me of that Pokemon and he's like we're going to do great here what the you're an American in a from software it was crazy Tim like like armored core has different it was it blew my mind I'm just welcome what's up in a good way or that was awesome it was awesome it was cool to like just hear a normal ass American dude let's sound like Solid Snake out here it was great um I think the great game's a lot of fun I think that uh highly recommend it if you have a lot of people that you want to play with. Don't really recommend it right now. If you are hoping to hop in solo cuz you're kind of rolling the dice on I hope my squad is good or I'm going to play solo offline which is a nightmare and just it doesn't feel balanced at all. And I hope that one nice thing is you could play solo offline. And when you play solo",
            "start": 676.64
        },
        {
            "text": "my squad is good or I'm going to play solo offline which is a nightmare and just it doesn't feel balanced at all. And I hope that one nice thing is you could play solo offline. And when you play solo offline, I hope that the that's where the modding community comes in and says, \"All right, let's download a mod that allows me to die three times at the at the the the nightly bosses or whatever.\" Um, game's great. Sorry, I've been yapping a lot. How much uh have you played? You haven't beat it, you said, but over 20 hours. How much of it do you feel like you've like, do you have a sense of how much you've completed? Oh, I haven't [ __ ] done a damn thing in this game. I've seen a lot of bosses. I have beat one. I've had about four other bosses down to oh just the smallest amounts. And when your homies go down, one really really frustrating thing that I also hope that they can kind of tune is uh the way that you res your homies, Tim, is by attacking your teammates. you attack them, which",
            "start": 723.44
        },
        {
            "text": "homies go down, one really really frustrating thing that I also hope that they can kind of tune is uh the way that you res your homies, Tim, is by attacking your teammates. you attack them, which requires stamina. But when you have a big ass [ __ ] you know, hulking building sized monster running at you, what do I how do I prioritize my stamina right now? And when your teammate dies once, um, you get a circle with a third of a notch filled in. And when you damage them, the third goes away and then they come back. If they get downed again, it's now 2/3. So you have to break them down. And it takes longer. Obviously, when you get knocked down a third time, it's three notches. I really, really, really wish that they're I hope that they're listening right now. And it's like, if I take off one notch, let it stop there. Cuz if you get one notch down, enemy comes at you, you roll away, maybe you get hit, you got to heal, it goes all the way back up to three. And it's like, this is such a",
            "start": 766.76
        },
        {
            "text": "one notch, let it stop there. Cuz if you get one notch down, enemy comes at you, you roll away, maybe you get hit, you got to heal, it goes all the way back up to three. And it's like, this is such a [ __ ] nightmare right now. I I'd like to say that I'm better than the average Souls player, but I'm not great or anything. I'm not Mitchell Saltzman, which felt like whenever we had success, we had Mitchell Saltzman in our party. Like whenever we had the homie Mitchell Saltzman from IG and Hop in, that was when we're like, \"Oh [ __ ] we're we're oh, we beat that boss.\" And then I think I only beat the first I beat the first boss three times cuz I needed to help other friends do it. Uh like tomorrow and Snowike Mike. And there was only two times that we did it without Mitchell. And but when we had him, we dominated and it was like, \"Oh, great.\" But you may not always have that fortune. I think the game's really [ __ ] hard. Oh my god. And can be really frustrating at moments. And uh and",
            "start": 818.64
        },
        {
            "text": "we had him, we dominated and it was like, \"Oh, great.\" But you may not always have that fortune. I think the game's really [ __ ] hard. Oh my god. And can be really frustrating at moments. And uh and that may come as a big surprise to people who beat Elder Ring like, \"Oh [ __ ] I beat it. I had to, you know, I used my mimic or whatever. You played with the tools the game gives you, but the game is like can be really, really, really frustrating and and difficult. And I think it's awesome, but that may push people away who already felt like Elder Ring was a little too hard for what they want to deal with right now. This is pushing it even further. Bless. What did you think of Elden Ring Night Rain? Um, so I played 23 hours. Uh, I'm going to give it a 7.5 uh out of 10. I have beaten four of the bosses out of I believe eight overall and a lot of that is due to the help of Mitchell Saltzman. I played a lot with Mitchell and he helped me get through some tough times. Um, 7.5 I've landed on",
            "start": 859.04
        },
        {
            "text": "the bosses out of I believe eight overall and a lot of that is due to the help of Mitchell Saltzman. I played a lot with Mitchell and he helped me get through some tough times. Um, 7.5 I've landed on mainly because I think what saves this game is that it is from software and it has so much of the quality of Elden Ring. The boss fights for each of the runs are some of the some of my favorite from soft bosses I think I've encountered, right? And they're all tuned toward um multiplayer. like it feels more tuned toward all right, you got threeperson parties as opposed to being like, you know, like one-on-one like you're typically playing or one and a companion, which feels like you're bowling the bosses sometimes in Elder Ring. Here there it feels like there's a bit more strategy as far as all right, this boss is going to split into three and so now it is 3v3 and like each of us have to manage like one part of this boss or like all right, it is uh we need two people that are doing long",
            "start": 908.48
        },
        {
            "text": "all right, this boss is going to split into three and so now it is 3v3 and like each of us have to manage like one part of this boss or like all right, it is uh we need two people that are doing long range to like you know uh pull an aggro while you have one other person come in and do melee damage, right? Like I think there's you have like parts where the bosses are charging up for a big attack and it is all about us like going in and doing as much uh damage as possible and they feel kind of like raid bosses in that way. And I think that stuff is [ __ ] awesome. I think the bosses the boss designs were really cool even though I think that I wish the final boss arenas were more are more varied, right? Cuz like you're kind of in the same arena when you get to the end uh of the run as oppo except for like the sky boxes which have like different colors and [ __ ] Yeah, that was super disappointing for me. But I think still at the end of the day, the times that I find myself really loving",
            "start": 955.52
        },
        {
            "text": "for like the sky boxes which have like different colors and [ __ ] Yeah, that was super disappointing for me. But I think still at the end of the day, the times that I find myself really loving this game are the times where I'm like, \"Oh yeah, this is Elder Ring.\" And then the other times where I'm not enjoying this game as much is when I'm like, \"Oh man, this is From Soft.\" essentially trying to make a Fortnite like experience. And I don't say Fortnite as in it's the same genre cuz it's not, right? This is it's a weirdass game, right? It is Elder Ring, but it is a rogike and it is a three-player co-op game. So when Andy says this game is hard, think about those three things because Elder Ring already by itself is a [ __ ] hard game. You add in a rogike element to it to where you know Andy's talking about and I'm talking about like we're not we've not beaten all the bosses yet. Think about the fact that these runs are 45 minutes long and you get to a boss and like these are Elder Ring",
            "start": 995.36
        },
        {
            "text": "talking about and I'm talking about like we're not we've not beaten all the bosses yet. Think about the fact that these runs are 45 minutes long and you get to a boss and like these are Elder Ring bosses, right? And so they have the different phases and that last phase is always a doozy. And so you get, oh man, I had one yesterday where a sliver of health left on this guy and I'm like my both my teammates go down and I'm like, [ __ ] I have to make a choice here. And my health is a sliver. I can either try and dodge, like use my last stamina to dodge and then try to get a heal or I panic and I heal immediately. And what did I do? I panicked and I healed immediately. Got hit down and guess what? Like that run is just done. It's not like Elden Ring where it's like, \"All right, cool. I died. I'm just going to go back again and try that boss over and over again.\" And like this [ __ ] is actually like really really tough when you think about the fact that yeah, you have to rely on two",
            "start": 1034.8
        },
        {
            "text": "I'm just going to go back again and try that boss over and over again.\" And like this [ __ ] is actually like really really tough when you think about the fact that yeah, you have to rely on two other people also to be as good as you are or to be even better than you are, right? You had to rely on other people. It's rogue light. It's Elder Ring. So this [ __ ] is tough. Um but when I think about the the the ways in which I don't love this game as much, it is the ways that they try to adapt this into multiplayer. It is the fact that there's no crossplay. And I think it's even more deeming to when you think about sort of the ven diagram that this game hits because in a weird way when I think about who this game is for I think it's a really specific audience. Like I think this game is for me and Andy and not really anybody else that's not me or Andy. Like you have to like one you have to be a fan of Elder Ring. Like you have to love Elder Ring. But then at the same time, you kind of have",
            "start": 1073.36
        },
        {
            "text": "and Andy and not really anybody else that's not me or Andy. Like you have to like one you have to be a fan of Elder Ring. Like you have to love Elder Ring. But then at the same time, you kind of have to be into the multiplayer, drop in a map, mark points of interest. All right, go here, loot. Go here, loot. Take out this big enemy. Go here. Like, you kind of want to have a PUBG. You want to have a PUBG type experience in terms of like gameplay loop and flow. And that is Andy Cortez to a tea. And that is like that's me to some extent, right? Like I like that experience and I like the moment to moment here. But at the same time, there are things like the wall jump where because this game is way more fast-paced and way more about like getting around the map pretty quickly and going from place to place. Uh they've added in a wall jump where it's exactly how it sounds, right? If you jump against the wall, you can kind of like climb up. It is very janky and it doesn't work the way that you",
            "start": 1113.76
        },
        {
            "text": "to place. Uh they've added in a wall jump where it's exactly how it sounds, right? If you jump against the wall, you can kind of like climb up. It is very janky and it doesn't work the way that you want it to work all the time, right? Like there are times where I'm like, \"Please get me up this hill.\" And then I almost get up, but then the geometry doesn't land in the way that I think it's going to land. And so I'm like, \"Fuck. All right, now I'm losing time and now the wall's coming in and the wall is very aggressive and so I'm taking damage, right? Like you have things like that. Um, yeah, you have and going back to what I was saying about the crossplay, right? You want to have a big player base to matchmake with cuz like there are so many factors into play. You want to have some you want to find good people. You want to find people that are also queuing for the same boss that you are and that's not always the case at the same time that you are as well. At the same time that you are,",
            "start": 1159.44
        },
        {
            "text": "to find good people. You want to find people that are also queuing for the same boss that you are and that's not always the case at the same time that you are as well. At the same time that you are, right? Like there's there's a lot of I think weirdness in terms of how they've tried to turn this into a multiplayer thing. And when it works, it works so well, but when it doesn't work, it's like, oh man, yeah, this is it feels like this is your first time making a thing that is this type of multiplayer game. Um, that said, right, like there there are so many things that I still still do love. I love the character classes. I think the the there's a class here um called Oh, it's not Iron Eye. Iron Eye. Well, Ironize the long range. I'm thinking of the exeutor. The executor because we can talk about this, right? Yeah. The exeutor class is essentially a second class that has a parry ability that works exactly the same way as it does in secur. And so when you pull out your second sword",
            "start": 1195.76
        },
        {
            "text": "talk about this, right? Yeah. The exeutor class is essentially a second class that has a parry ability that works exactly the same way as it does in secur. And so when you pull out your second sword essentially, you tap L1, it like builds up power in that sword. It also staggers the enemy. So So then you can do a super attack with it. And it is it is definitely the class where it's like this [ __ ] is not useful. It's for if you want to be flashy and if you want to have a fun time, which is me half the time, right? I had such fun with that class. But then for me, it was like, all right, when I want to lock in, I switch over to Iron Eye, which is the ranged class, which is a class that I never use in Elder Ring. I am not a range person. I want katanas all day. Um, but I think this game does a really good job uh for getting you out of your comfort zone and making you try different things because you're at the mercy of what you have. All right, we need somebody that has range. I guess",
            "start": 1239.44
        },
        {
            "text": "a really good job uh for getting you out of your comfort zone and making you try different things because you're at the mercy of what you have. All right, we need somebody that has range. I guess I'm going to be our iron eye. And as I'm running from spot to spot, I am finding different arrows. I'm finding different um abilities. It is very much a rog light as far as the amount of element stuff that's going on. Each of the big bosses has an element that they're weak to. So if I'm going to fight tricphilos, I am like, \"All right, I need lightning.\" And so I'm going to get a lightning sword and I'm going to like be looking for lightning type items or items that are going to boost that element. And it is in times it it's making me feel the the the the way that I love when I'm playing Hades, right? It's making me feel the way that I love when I'm playing a Returnal. you are looking for those in the moment. Oh, I want this so I can boost this ability kind of thing. And it gets very",
            "start": 1280.4
        },
        {
            "text": "Hades, right? It's making me feel the way that I love when I'm playing a Returnal. you are looking for those in the moment. Oh, I want this so I can boost this ability kind of thing. And it gets very satisfying. Like this is a bizarre game. We I feel like we can talk about this game for a while because like I there is as many things that I [ __ ] love about this game for as many things that also frustrate me quite a bit about this game. So I land at a 7.5. That's where I'm at. With the two of you, I feel like you are in the very luxurious position that you have multiple squads at your disposal. Do you see yourselves playing this game a lot in the future or are you Andy, I mean, let me ask you, are you going to complete all the bosses in this? Oh, yeah. Are you planning to play past that much? Yeah, I think so. I think also a lot of it goes to me wanting to Well, the the cross the no crossplay nature of it kind of makes me go, oh, if I have any friends on PlayStation that are buying it",
            "start": 1317.28
        },
        {
            "text": "Yeah, I think so. I think also a lot of it goes to me wanting to Well, the the cross the no crossplay nature of it kind of makes me go, oh, if I have any friends on PlayStation that are buying it on PlayStation, maybe they already pre-ordered it. What are you guys playing on, by the way? PC. PC. Both of you. Okay. Yeah. Um, and yeah, so I I definitely see myself playing it past beating all of the bosses because you still have that it has that that rogike feel or even like Metroid Vania field when you go back to an earlier level and now you're you have stronger things equipped, you go, \"Oh [ __ ] we are look at how we're r, you know, doing a new game plus run. Look at how we're rinsing these dudes now. Like this feels great.\" I I totally see the appeal to want to go back for sure. And it's at its core, it's it's still something that I love. It's Elden Ring. It's the combat. It's the movement. It's the risk, the reward, the abilities, and how not just not just the abilities that you can",
            "start": 1355.52
        },
        {
            "text": "at its core, it's it's still something that I love. It's Elden Ring. It's the combat. It's the movement. It's the risk, the reward, the abilities, and how not just not just the abilities that you can use in game, whether you find like different spells or wands or weapons or whatever, but it's your your character's abilities, your your Night Ray Nightfarer abilities. um where they have one ability and one ultimate and finding different relics after runs that you get every time you complete a run. You are gifted a couple of relics and they're these little colorful stones that have different um traits tied to them. And the bigger the stone, it might have three traits and you go, \"Oh [ __ ] that would be perfect for this class that I've been running. Oh my god, this is going to like change the way I like.\" It has those rogike hooks that I feel all of the damn time after you beat any sort of mini boss in this game and they drop their little loot crate or I don't even know what what it's",
            "start": 1402.16
        },
        {
            "text": "the way I like.\" It has those rogike hooks that I feel all of the damn time after you beat any sort of mini boss in this game and they drop their little loot crate or I don't even know what what it's called. I saw people in the Discord. By the way, shout out to all the Band Dynamo employees who were like helping out people through this experience because there'd be people like, \"I need one for this boss and people were hopping in and it's like probably the best Discord experience I've seen in a in a preview period where people were able to just create their own voice channel in the Discord. you would generate like your own discord and it would say kind of funny Andy and a voice channel and then Mike would join and we played with um uh shout out to Will Nef out there. Shout out to Will Nef. We play it cool. Um that's cool. Unfortunately, his game disconnected. We were on like a we were on a run that was like feeling special. His game disconnected. He couldn't reconnect and it Oh, man.",
            "start": 1451.52
        },
        {
            "text": "We play it cool. Um that's cool. Unfortunately, his game disconnected. We were on like a we were on a run that was like feeling special. His game disconnected. He couldn't reconnect and it Oh, man. We were like [ __ ] me and Mike took it to the [ __ ] limit still with just us two because we were like all right. We're like, \"It's 1:43 a.m. We keep this run going, right?\" He was like, \"Hell yeah, dude. We feel we're we're too good right now.\" And we got to the we got to the very very end and unfortunately did not uh we did not beat the boss with just us two. But it it has all those hooks that you like. I agree with Blessing that it's a lot of different mechanics and genres that are meshing that may clash in ways that don't feel like sometimes the the the music and the harmonies aren't perfect because you are not only implement you're you're dealing with the difficulty of a From Software game with RNG and and sometimes that's tough where you know on on one night you may get a certain",
            "start": 1498.72
        },
        {
            "text": "because you are not only implement you're you're dealing with the difficulty of a From Software game with RNG and and sometimes that's tough where you know on on one night you may get a certain boss you're like ah [ __ ] man I picked the wrong thing to upgrade. I shouldn't have gone for that weapon. I should have gone for this ability cuz again, after every mini boss you beat, the smaller ones will give you two perks. And a perk may be gain 10,000 runes right now, which means, oh [ __ ] I can probably level up one time. Or the other one, the other perk may be have your stamina refill faster. And you make that choice and it's like, oh, do I want these gains right now or do is am I playing like the long game? uh am I so confident that my build is good enough for stamina regeneration that I can skip on that right now? You have all those sort of um split decisions or those quick decisions you have to make. I think my biggest problem with it though is while you're playing Night Rain, the",
            "start": 1545.84
        },
        {
            "text": "can skip on that right now? You have all those sort of um split decisions or those quick decisions you have to make. I think my biggest problem with it though is while you're playing Night Rain, the way that we are playing it, the the way that you play it to have the most success possible, if there were a difficulty mode, it feels like we are playing the play style we're using is meant for the hardest difficulty possible. Wow. And what I mean by that is there is no exploration. There is no time to look around and go, \"Oh, you should we check out that? Oh, that might have a cool boss. Let's go. There's no time for any of that. The ideal way to play this game is to essentially speedrun to all the POIs, all the points of interest and go not all of them, but like to as many as you can and say, \"Fuck the mobs. [ __ ] the like anything that might be distracting or anything that might be about exploring. [ __ ] all that. We are going to point A and then we're going to point B and then we're",
            "start": 1592.56
        },
        {
            "text": "\"Fuck the mobs. [ __ ] the like anything that might be distracting or anything that might be about exploring. [ __ ] all that. We are going to point A and then we're going to point B and then we're going to point C and getting as many runes and like collecting as many perks as possible and then going to the first day boss and then defeating that and like it's cool to get in that flow. Yeah, but so much about Elder Ring is the beauty of this world and how cool the that area looks and oh, I want to like check that zone out now. But the way that you are forced to play it, which again, you're not forced to do anything, right? uh the the old classic Doom to it. You control the buttons you press, but the way that you are playing it is if I want maximum success, those the three wolves are running by on the way. [ __ ] it. If you try to kill them, that's like 3 seconds lost on this run. It feels like everything is a speedrun. And it while you're having fun, it's still taking away that sort of",
            "start": 1642.24
        },
        {
            "text": "by on the way. [ __ ] it. If you try to kill them, that's like 3 seconds lost on this run. It feels like everything is a speedrun. And it while you're having fun, it's still taking away that sort of the the the sense of exploration and the the sense of like wonder and magic of an Elder Ring world. This might be a a big question, but do you think obviously that them designing their their first real multiplayer game, like there's been modes and stuff before, but this being from the ground up a multiplayer essentially only product, do you think that them adding the different the Rogide stuff and the more speedrunny type things or necessity, do you think that overall that was the right call or do you think that there is potentially a better game if it were to lean away from that and more into what Elden Ring is more traditionally known for? I think that there's a way to balance it to where you are not always against the clock because that is that's just an extra added element that I don't",
            "start": 1685.28
        },
        {
            "text": "what Elden Ring is more traditionally known for? I think that there's a way to balance it to where you are not always against the clock because that is that's just an extra added element that I don't know if it adds a whole it it doesn't it adds to some tense moments, but that's not the fun I'm getting. The fun I'm getting is fighting a boss feeling like I'm prepared. That's where I get my satisfaction knowing that like, all right, you're going to you're going to bring your [ __ ] agame. And so am I because I made to I made sure to check every damn place on this map to try to find the best thing possible. And I think there's a better formula here. We've It sounds like I've just been [ __ ] on all the time. Again, uh probably an eight out of 10. It's a great game. Really, really fun. Still has all the magic that I want, but I think that there's a better game here if you try to take a different approach to maybe it isn't the the ring is closing in Fortnite style. Maybe it is. All right,",
            "start": 1728.08
        },
        {
            "text": "has all the magic that I want, but I think that there's a better game here if you try to take a different approach to maybe it isn't the the ring is closing in Fortnite style. Maybe it is. All right, we could pick, you know, similar to Hades, when you get to the end of a room and you go, \"Ah, do I want to go through that door with that boon or do I want to go through this door with the health upgrade? I wish there was I wish it was more conventional in that sense.\" See, funny enough, right, you mentioned that it feels like we're going in at like a the most difficult like difficulty level almost in a game. I do wonder if a lot of that is fixed if they have if they add in a difficulty level, which I know is very non from software and like not going to happen, right? But like if you had a and you I wouldn't even if I'm if I'm working at FromSoft, right? I wouldn't even pitch it as a difficulty level. I would pitch it as like the experience we're having right now is like the I don't know,",
            "start": 1777.68
        },
        {
            "text": "you I wouldn't even if I'm if I'm working at FromSoft, right? I wouldn't even pitch it as a difficulty level. I would pitch it as like the experience we're having right now is like the I don't know, you find a cool word for it. You find like a you find like an Elden Ring word for it, right? Like you know, you're doing like the locked in mode or whatever, which is like the ultimate insane edition. Yeah. Like Yeah. in insanity on or something like that and then the default mode is like all right the ring doesn't do as much damage and you have a bit more time to explore cuz I do think this game is such a weird one mirror like night fair nightmare see that's why we pay you the big bucks like you have a nightmare mode that is yeah the hey speedrun to every POI and like [ __ ] lock in like you need to you you need to do the meta like you need to like you know be locked into every single thing that you need to face this boss that's going to kick your ass because I do think that's a",
            "start": 1817.04
        },
        {
            "text": "like you need to you you need to do the meta like you need to like you know be locked into every single thing that you need to face this boss that's going to kick your ass because I do think that's a worthwhile experience I think when you beat the boss, it feels [ __ ] good. Like when I have Mitchell Saltzman that's coached me through like, \"All right, go here. Go here. We're going to pick up this sword.\" Like, and we're fully kitted out and ready to go. There's nothing like it. But also, yeah, that [ __ ] is [ __ ] brutal. Um, and I think that then contrasts with one of the favorite one of my favorite experiences that I've had playing this game. Um, which are the shifting I believe it's called shifting worlds, right? I believe so. Yeah. Where? Shifting lands. Shifting lands. Thank you. There was a run that me and Andy were doing. It was me and me, Andy, and we matched with a random. His name was Zant. Never forget him. Zant with an X. Like Giant with an X. You know what I mean? Shout",
            "start": 1854.72
        },
        {
            "text": "was a run that me and Andy were doing. It was me and me, Andy, and we matched with a random. His name was Zant. Never forget him. Zant with an X. Like Giant with an X. You know what I mean? Shout out Z. Our freaking guy. Let's go. This was such a cool one cuz it's me and Andy. We're still, I think, a bit earlier on uh in our runs with this game. And we get the map, which I don't know if we did a great job of explaining at the beginning of the show, right? Like the map that we're dropping into is essentially Battle World for Elder Ring where it's a bunch of different Elder Ring style locations, procedurally generated, but like essentially remixed on uh as far as where where they land on the map. Uh and so we land and there's usually somebody who we are like, \"All right, who's going to be point person?\" I always look at Andy or whatever. If I'm playing with randoms, I just pray one of them wants to be the point person. And it is you mark where you're going on the map and then we",
            "start": 1892.64
        },
        {
            "text": "to be point person?\" I always look at Andy or whatever. If I'm playing with randoms, I just pray one of them wants to be the point person. And it is you mark where you're going on the map and then we immediately run to these places. And some of the places will have a mini boss that you kill, get a bunch of runes, and then get get an upgrade. So, you might go to a church that uh allows you to get an extra health flask so you can heal an extra time. Uh but you're essentially going from location to location. In the shifting lands maps, they have one big special POI that in the cases that I've I've had, right, are either it's been a volcano, it's been a um a big uh frost mountain. And when me and Andrew were playing, it was the volcano and Zant sort of leads us there. Zant leads the way. It's the first time we'd ever seen the the sort of shifting lands thing happened, by the way, because like we're used to the normal map. Suddenly, we look at the map and it's like there's this big red",
            "start": 1933.76
        },
        {
            "text": "the first time we'd ever seen the the sort of shifting lands thing happened, by the way, because like we're used to the normal map. Suddenly, we look at the map and it's like there's this big red area looking like [ __ ] Mount Doom out there or or Death Mountain and you're just like, \"Oh [ __ ] what is that? That's really really cool.\" Nearer the start of the run, suddenly the screen starts shaking and you see just like massive fire and plume of smoke. You're like, \"Whoa, that [ __ ] looks [ __ ] magic.\" Like, this is the [ __ ] I love. And this is the Elder Ring visual. So, that [ __ ] looks [ __ ] off the chain. And so, we go there and like Zion drops us into this mount in this volcanoy area and we're like, \"Oh, damn. Where's Zion taking us?\" Right? and we go we get led through a bunch of different paths and we're taking out enemies. We come across this uh door like this fog door they have in these games, right? that always like kind of marks a boss. And we take out three big",
            "start": 1973.36
        },
        {
            "text": "bunch of different paths and we're taking out enemies. We come across this uh door like this fog door they have in these games, right? that always like kind of marks a boss. And we take out three big enemies that are in front of it. And once we take out those enemies, we get the rewards and then the door fades away. And we're like, yo, where the [ __ ] is Zion? We're going deeper. We're going deep into this volcano. And me and Andy are freaking out a little bit because we're like, yo, the the the circle is going to close in. Like, do we we are you are leading us further and further into the depths and we don't know where we're going. But Zion and Zion's not on voice chat. We're not in a Discord call with Zion. He's just a random. It's a journey-like experience. And who did who who did Zion remind you of? Who's that? You said Addison. Oh yeah, Zion remind me of cuz No. What if it is Addison? Cuz like Addison was that friend where he he's always leading me to some like place where it's",
            "start": 2010.24
        },
        {
            "text": "remind you of? Who's that? You said Addison. Oh yeah, Zion remind me of cuz No. What if it is Addison? Cuz like Addison was that friend where he he's always leading me to some like place where it's like where are you taking me? And it's like always like you know some cool spot in like the woods and I'm like a damn that's [ __ ] dope ass. We were saying Aian was like the junior or the senior that like you were a freshman you got in the car and you're like man I don't know where we're going. I was so excited. He's got a cigarette. Like this is crazy. Yeah. Like Yeah. He smokes and you're like, \"Oh, I don't smoke. That's really cool.\" Yeah. Zant was that homie that's like, \"I don't know where you're taking us, but I'm excited to see.\" And so we go down another path. We drop down some ledges that are kind of obscure. We drop down a final ledge, and it's like this big boss. It's the magma worm. And we're like, \"A [ __ ] All right. We're going to fight this thing that seems way too strong",
            "start": 2046.64
        },
        {
            "text": "that are kind of obscure. We drop down a final ledge, and it's like this big boss. It's the magma worm. And we're like, \"A [ __ ] All right. We're going to fight this thing that seems way too strong for us.\" Uh, and I think that first time we weren't able to beat it. We ran out of time. We ran out of time. The zone was already closing in. Yeah. So, we had to escape. Then the next time he and Andy played, we were like, \"Yo, we were with Mike. We were with Mike.\" Yeah, we were with Mike Mike. And we were like, \"All right, we know that we ran out of time. It seems like on day two, we got a fast track to the volcano. [ __ ] everything else. That's the priority.\" And I was like, I think I remember the path. I remember the path to go down. I need to know if you guys ended up beating this boss. But we'll have to wait till after a word from our sponsor. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's",
            "start": 2085.12
        },
        {
            "text": "But we'll have to wait till after a word from our sponsor. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep. And you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and I'm loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the",
            "start": 2124.08
        },
        {
            "text": "satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com, promo code kind of funny for 20% off. So, you got Mike. You think you remember how to get in there? Andy's leading us to victory this time. Running down the path and I'm just like, I think we dropped down here. Oh [ __ ] we did. We dropped down to this here. Yeah, we fought these these three dudes. I remember. And then we run past on that little bridge. We take out those fire ladies. Holy [ __ ] Oh my god. The big golden door is there. We're on the right path. This is great. Take on that squad. They're they they're tough, right? It's Chad, if you know, if you ever play Elder Ring, it's the dude with the big like uh the",
            "start": 2173.36
        },
        {
            "text": "is there. We're on the right path. This is great. Take on that squad. They're they they're tough, right? It's Chad, if you know, if you ever play Elder Ring, it's the dude with the big like uh the three big fire guys, right? The fire preler. I forgot how to pronounce him. Prelatees. I don't know what you know what sort of accent it is, but one of them has the big sort of like uh goblet on his head and he shoots fire out of it. Kill three those three guys. Nice dude. They drop loot. We level up. The door opens. We run down and it's the big skull men with the do. No, the skull men on the cars. You got to take out the skull on the car. You know the big, you know, cars in this game. Well, it's like it's like a guy controlling a car, but it's like a big skull that spits out. You got to jump on top and like kill. We got American. We got a Mustang. Kill those guys. Drop down. Holy [ __ ] We are on the right path. Run past the big hands. The big hands will get you. The big hands are also",
            "start": 2218.64
        },
        {
            "text": "on top and like kill. We got American. We got a Mustang. Kill those guys. Drop down. Holy [ __ ] We are on the right path. Run past the big hands. The big hands will get you. The big hands are also down. I've had a brave through so many big hands. Yeah, a lot of big hands. I'm proud of you. A lot of big hands. Then it's like, holy [ __ ] I Oh my god. I I made the right calls. I I was shocked Colin. I made the right calls. We drop down. Magma worm time. Take on this big dude. You've seen him before, Chad. He's big like lizard. Is he one of the eight or is this like a secret boss? No, this is like a secret boss. It's like one of the nor one of the many mini bosses in the game. There's a lot of mini bosses you take on along the way to try to get to the night three boss. Uh which is like the ones that were made specifically for this video game. They were they haven't been seen anymore. That's another fascinating thing is that yeah, all the night three bosses like the final bosses of the",
            "start": 2260.24
        },
        {
            "text": "ones that were made specifically for this video game. They were they haven't been seen anymore. That's another fascinating thing is that yeah, all the night three bosses like the final bosses of the runs are all new for this game. All the other bosses are just pic picked from other from soft games. It's like 90% Elder Ring enemies and then sometimes you'll fight a boss from Dark Souls 2 and it's like, \"Oh [ __ ] I just [ __ ] fought you.\" Like the other day when I when I was playing Dark Souls 2, we take on the Magma Worm. B. Holy [ __ ] we did it, dude. And then we walk up to this big uh like a like a smithing stone table. And it's a it's more epic than all the other ones we've seen. We walk up and it's like upgrade any of your weapons to legendary. It's like we're like [ __ ] Holy [ __ ] We upgraded. Get the little steam machine and put them in. It's like legend secured. I forgot what the hell. Upgraded one of our like whatever weapon you wanted to the gold. You're like, \"Holy",
            "start": 2297.2
        },
        {
            "text": "[ __ ] We upgraded. Get the little steam machine and put them in. It's like legend secured. I forgot what the hell. Upgraded one of our like whatever weapon you wanted to the gold. You're like, \"Holy [ __ ] dude. This is insane. This is awesome.\" And that's where this game sings. [ __ ] Zant, dude. And then you're like, \"How do we get out of here?\" And then you see the little bird with the tree and you're like, or or there's a tree that you summon a spectral hawk. Then it's a spectral hawk. You summon the spectral hawk flies you out and you're just like flying over this amazing volcanic landscape. Like, dude, this is the From Software is just so good at this [ __ ] Like, giving you that awe and that wonder and you fly all the way out and like, oh man, it was it's it it's those moments that make this game magical. Um, yeah. And I wish like and I' that comes all the way back around to I Yeah, I wish the game gave you more time for or at least like I don't know. I feel like the",
            "start": 2341.2
        },
        {
            "text": "that make this game magical. Um, yeah. And I wish like and I' that comes all the way back around to I Yeah, I wish the game gave you more time for or at least like I don't know. I feel like the fast-paced nature that the game is ideally played with kind of conflicts with the exploration a bit of finding things like that, right? Of being like, \"Oh [ __ ] where does this go? Oh [ __ ] we found like this cool legendary thing.\" And I don't know how to balance it because I think part of that is them wanting people with knowledge to kind of spread the knowledge. Like that feels like one of those playground conversations that I would have with people going to school and being like, \"Yo, I played Elder Ring Nighting last night. Yo, have you tried like going up here?\" It's like, \"Ah, no. like a guy kept, you know, fighting the dragon. It's like, \"No, if you go past the dragon, you'll find a thing that'll help you kill the dragon.\" It's like it it was made even more insane because prior to me",
            "start": 2378.24
        },
        {
            "text": "kept, you know, fighting the dragon. It's like, \"No, if you go past the dragon, you'll find a thing that'll help you kill the dragon.\" It's like it it was made even more insane because prior to me to us doing that, us playing with Mitchell Sausman and him going, \"Oh no, don't go down there to hell.\" Like that that place is like off limits. And and so when we actually did it, it was like, \"Oh my god, this felt even more epic.\" Right. And I I I totally agree with Bless where I think that those those are at odds with each other because coming up very very soon is going to be this big Elden Ring influencer tournament where different From Software streamers and different just streamers in general and content creators are doing this big Elder Ring Night Rein race where squads of three are going to be competing against each other and it's going to be like a really really big deal. And the way that you're going to watch these people play is how all of us were playing more than halfway into",
            "start": 2421.12
        },
        {
            "text": "to be competing against each other and it's going to be like a really really big deal. And the way that you're going to watch these people play is how all of us were playing more than halfway into this review period where you're not going to it's those you know get don't worry about those small those short games gains right now. We're going for the big gains in the future and like and that that takes away so much of it. And I I I hope that maybe the RNG is is raised in some spots where it's like, no, those guy those little mobs are worth fighting because they do drop this and these items that could be worth it. But for the most part, you are zipping past 70% of the map to get to that boss in that little area, this boss in this encampment, this boss in this encampment. And when the world, you know, when you start a game, you see all the different spots on the map that it's like, \"All right, well, maybe there's a church here. We can get a healing flask. Maybe we can take on those camps",
            "start": 2465.36
        },
        {
            "text": "you know, when you start a game, you see all the different spots on the map that it's like, \"All right, well, maybe there's a church here. We can get a healing flask. Maybe we can take on those camps first.\" And you see that's poison. That camp is mainly poison enemies. This camp is mainly uh death blight enemies. We should maybe skip that one, go to that. And it it just feels like you are esports minmaxing this game, but I feel like it's owed more. Yeah. You know what I And it's it's it's kind of a bummer that that you are sort of at odds with that. Um but I think if if things can be balanced a little bit better, maybe more time is given to you. Um maybe that will will lead to more successes. But um for the most part, I feel like we were failing for a lot of it. As somebody who thinks like I think I'm I think I'm pretty good at these games. Like I'm not amazing. I'm not that sort of level. Like I feel like a team of me, you and Mike should be pretty good. I'm pretty confident at",
            "start": 2516.08
        },
        {
            "text": "like I think I'm I think I'm pretty good at these games. Like I'm not amazing. I'm not that sort of level. Like I feel like a team of me, you and Mike should be pretty good. I'm pretty confident at these games and it really sucks that like man they was just getting beat down, but I love that challenge, you know. So, so having said that, you guys are you have the friends to play. You have this review period that you're kind of given the best case scenario to play at least this version of the game with the balance it's at currently. Do you see with no crossplay and with everything you guys have been talking about, do you see this game finding success or do you think that this is going to be all things considered kind of a hey that was a nice experiment they tried but they're probably not going to go back into this cuz it didn't really work. I think this will be a cons a success because of the amount of content there is. I think because there's a lot of different bosses you can go try",
            "start": 2568.16
        },
        {
            "text": "going to go back into this cuz it didn't really work. I think this will be a cons a success because of the amount of content there is. I think because there's a lot of different bosses you can go try and go see when you know once you beat that first boss, the rest of the bosses unlock and then you can queue up for certain ones. You can queue up only for these two cuz maybe those are the only two you need. Or maybe it's like [ __ ] it, I'll queue up for all of them because I'm going to get good rewards and good relics to then equip to my my heroes in the future. Um, I I do I think this game will be a success just based off of 26 million sold of Elden Ring and people discovering that, oh [ __ ] I I do like this challenge and this is a lot of fun. Now, you know how many of those get refunded? I don't think that that is necessarily going to happen on Steam or something like that. I don't think there will be a big massive backlash of like, oh, this is way harder than I thought it'd be. But",
            "start": 2608.08
        },
        {
            "text": "I don't think that that is necessarily going to happen on Steam or something like that. I don't think there will be a big massive backlash of like, oh, this is way harder than I thought it'd be. But I I do think this game will be a success and will at the end of the you know I don't know maybe by the end of the year hit like 5 to 6 million or something like that. I the thing is I don't know how to quantify a success for this game. I do think that it's going to do well for what it is. But also I come back to what I was talking about with the ven diagram as far as who is this game for? Like I was thinking about it as I was playing this game where I'm like, man, my friend Re would [ __ ] love this game. Just from the fact of how when I play games with Re, right? She loves playing a PUBG. She loves playing a Fortnite. She loves playing games that are drop in, go to point of interest, you know, loot items, build your character, and try to go for the win. Like that is what this game is. But",
            "start": 2656.96
        },
        {
            "text": "loves playing a Fortnite. She loves playing games that are drop in, go to point of interest, you know, loot items, build your character, and try to go for the win. Like that is what this game is. But Re never played Elen Ring, right? Or at least she didn't. She didn't really like get far in Elen Ring. She like played a little bit and then dropped off. And I can't recommend this game for to anybody who hasn't played much of Elder Ring. Like you need the Elder Ring knowledge going into this. This is almost like it's this is this has made me reflect a little bit. Elen Ring on crack. It's Elon Crack. It it's made me reflect a little bit on Ghost of Sushima Legends cuz Ghost of Tsushima Legends when that came out, it was the multiplayer mode that they added in to Ghost of Sushima that came with a lot of you in the world of it. I was the biggest fan of legitimately that game deserved better, right? So they packaged it in with Ghost of Sushima and I always viewed that as weird. I was always",
            "start": 2697.6
        },
        {
            "text": "a lot of you in the world of it. I was the biggest fan of legitimately that game deserved better, right? So they packaged it in with Ghost of Sushima and I always viewed that as weird. I was always like, man, this game deserves so much better and it doesn't feel like it's going to get the audience and and attention that it deserves because it feels good enough to be a standalone thing. Elen Ring Nightm would put in the exact same conversation, but as I'm playing this, I am like, you kind of need Elder Ring. Like you kind of have to play Elden Ring in order to fully enjoy this cuz you're going to be so [ __ ] confused if you don't really know the language of this game, the feel of this game. like how to move in this game and Elden Ring is in a weird way the tutorial for this game. Um, so I think with that like you're looking at a very specific audience, right? Again, I come back to I think this game is for me and Andy, but like I don't think this game is for every or even most Elder",
            "start": 2737.6
        },
        {
            "text": "I think with that like you're looking at a very specific audience, right? Again, I come back to I think this game is for me and Andy, but like I don't think this game is for every or even most Elder Ring fans. I think this game is for a specific Elden Ring fan who also likes multiplayer co-op and like not battle royale but kind of battle royale style games as far as like what that gameplay loop is. So I actually don't I wouldn't I'm not for me it's not a foregone conclusion that this game is going to be successful necessarily or at least like the talk of the town for for a long time. I think in when we get further down the line and look back, it's going to be like a thing of, \"Oh yeah, remember Night Rain? That was a really cool thing.\" And I but I think the conversation is going to move on from it. I got a lot of super chats that I want to get to and uh some of them come back to this question a little bit, but Guitar Hero Arrow says, \"Please tell me that From Soft pulled the ultimate",
            "start": 2776.96
        },
        {
            "text": "from it. I got a lot of super chats that I want to get to and uh some of them come back to this question a little bit, but Guitar Hero Arrow says, \"Please tell me that From Soft pulled the ultimate move and has Night Train by Guns and Roses blasting in the background during the final boss.\" No spoilers. No spoilers. No spoilers. Never got there. Well, GNR. Uh, and then Croninberg says, \"Hey guys, now that you played a more multiplayer focused FromSoft game, how do you think Dusk Bloods will play?\" Like, dude, I was thinking about this just from the sense of when when I think about this being From Software uh um uh like shot at multiplayer and how much from doesn't want to let go of the fromisms and making this game and how sometimes that can make it feel archaic for a multiplayer thing. I was thinking about Dust Bloods and the fact that not only is that FromSoft, it's also Nintendo. So that is as a multiplayer experience. I'm so fascinated to see what they come down on as far as that",
            "start": 2820.8
        },
        {
            "text": "was thinking about Dust Bloods and the fact that not only is that FromSoft, it's also Nintendo. So that is as a multiplayer experience. I'm so fascinated to see what they come down on as far as that being cuz like those are two companies that I don't really look at as far as like how they approach multiplayer. Like I think the game's probably going to be good because it's from software, but I don't know. Andy, have you thought about like what actually Dust Bloods is going to be? Well, I mean, we know that Dust Bloods is going to be a PvP focused game that you can, you know, make friends with somebody else on this PvP run. Uh, you know, Miyazaki said that he was just really um really enthralled by the uh go the um Tarov sort of experience and finding somebody that becomes an ally and then suddenly they are on this journey with you. Even though at first you were clashing heads, I think a lot of that stuff I think a lot of those game mechanics he mentions about dust blood seem super",
            "start": 2863.84
        },
        {
            "text": "suddenly they are on this journey with you. Even though at first you were clashing heads, I think a lot of that stuff I think a lot of those game mechanics he mentions about dust blood seem super fascinating in a in the ideal situation where it's like now imagine if your teammate did this and and it's like oh cool that sounds amazing but I don't really know if I got huh I got Mike I don't know yeah I don't I don't think that this experience may actually end up that way. Um, but um, like at the end of the day, I still feel like it's probably going to be good because they're going to find some hook that, you know, keeps people there. Um, yeah, I think I think a lot of our complaints so far can be tuned with sliders. Aside from the crossplay thing when it comes to Night Raiden, Dust Bloods is a whole different beast. That seems a lot tougher. And that is exclusive, correct, to Nintendo to Switch to. Yeah. Uh, Lewis Legs says, \"New Mandela effect unlocked. I swear Night Rain was coming",
            "start": 2912.96
        },
        {
            "text": "is a whole different beast. That seems a lot tougher. And that is exclusive, correct, to Nintendo to Switch to. Yeah. Uh, Lewis Legs says, \"New Mandela effect unlocked. I swear Night Rain was coming out on the 29th.\" No. No. 28th. You were thinking of uh Lost Soul. Lost Soul. I think today, too. I don't know. When is this out? Irene. Um, it's available to play today at 300 p.m. Pacific time, 6:00 p.m. Eastern. Tomorrow in some places. It's like a It's like a early release. Midnight release. No Mandela effect. You're correct. pull up now says, \"Does the pursuer from Dark Souls 2 hunt you like Morgot?\" Um, I've only ever been invaded by the fellow omen, which is like it's pretty much Morgot/Marget who Yeah. ends up just ruining a run. Oh my god. So, I saw a question from Lucid Dream in the chat who who asked question for uh Blessed Andy. Will you all be playing this outside of a stream? like is it do you think you'll go back to it? And yeah, the servers went down last night because you",
            "start": 2963.76
        },
        {
            "text": "chat who who asked question for uh Blessed Andy. Will you all be playing this outside of a stream? like is it do you think you'll go back to it? And yeah, the servers went down last night because you know for maintenance to prep for the big launch and I was hopping into solo matches offline um getting my [ __ ] kicked in, not having a great time because I just kept on dying, kept on trying to find who is the right character for one of these solo runs since you can't res. I don't know if there's a great answer to that, but I did have a decent amount of fun with the Revenant, who is the brand new character. The a character, by the way, that we can't talk about their ultimate power. That's embargoed. I don't It's kind of odd. Um, we can't talk about what their ultimate does, but their other their main ability is it's a little girl. She's like possessed a doll. It's like a dead girl who like possessed a doll. And she summons three different spirits. three different like either a fast",
            "start": 3017.68
        },
        {
            "text": "their main ability is it's a little girl. She's like possessed a doll. It's like a dead girl who like possessed a doll. And she summons three different spirits. three different like either a fast little guy, a more medium kind of hitting dude with a hammer, or a gigantic skeleton that like does really really big damage, has a lot of health. You could summon either one of those three and whenever you kill somebody, their ghost comes back and fights for you. Um, and that seems to maybe be the best character to play as if you're doing like solo runs because you have different friends that can friends like spirit friends that can kind of like get aggro from you. Feel like that may be the best one. So, yes, I will be playing this offline, not only just for streams, but this is a game that I enjoy enough to keep playing because it's Elder Ring and it's I like seeing new things. Uh, Senugi says, \"Happy PreSGF. Did you guys have any favorite combos with characters? Like, if you were the",
            "start": 3071.04
        },
        {
            "text": "I enjoy enough to keep playing because it's Elder Ring and it's I like seeing new things. Uh, Senugi says, \"Happy PreSGF. Did you guys have any favorite combos with characters? Like, if you were the Birdman, who did you hope to squad up with?\" I I like this question because I don't I don't think I had any specific metas as far as like the three characters, but there were times where pre-going into a a boss um there was one that was like a flying uh flying boss like was one flying and then like another on the ground like you're fighting two creatures at the same time and they're weak to a specific element and like I'm talking to it might have been Mitchell, it might have been somebody else but we were like all right, how should we go in this? All right, let's maybe do let's do two iron eye actually. Like let's do two range and then one melee because like that see like having range on like a flying enemy is going to be ideal, right? All right, cool. And we're gonna have the range be the",
            "start": 3116.64
        },
        {
            "text": "actually. Like let's do two range and then one melee because like that see like having range on like a flying enemy is going to be ideal, right? All right, cool. And we're gonna have the range be the weaknesses and like we organized it in a way that actually worked extremely well for us and that was very satisfying the fact that like we could do it that way and kind of have have that uh pre-run planning conversation uh to make that work. But like I for me there wasn't a go-to because I do think that different bosses are going to require different strategies. The Discord seemed pretty unanimous on Iron Eye being the goated of them all. Who's the archer? Yeah, the Discord seemed like you're [ __ ] up if you don't have at least an Iron Eye on your squad. Um the squad the Yeah, you always want to have one dude who could uh who's more tanky like the raider class or the guardian class who's the the bird guy. uh you have either like the raider and the guardian along with at least one or two",
            "start": 3156.48
        },
        {
            "text": "to have one dude who could uh who's more tanky like the raider class or the guardian class who's the the bird guy. uh you have either like the raider and the guardian along with at least one or two ranged whether it's Mike likes Mike uh good news for those in chat who are wondering because I know you know snowike Mike Mike is uh he has his um oh gosh his uh Steve's the source character who's the sorcerer but he spelled source like the word source thinking that it was short for sorcerer I don't know um but Steve's you know he was really worried about this because he didn't really vibe with the magic character during the first couple of betas. She has a very weird way of doing magic. She isn't just like her abilities are if blessing burns an enemy and if blessing is burning an enemy and they're kind of caught on fire, she can absorb the fire into like this trinity thing on the bottom of her screen. And then if I hit them with ice, you can absorb that ice and that joins the second part",
            "start": 3197.68
        },
        {
            "text": "kind of caught on fire, she can absorb the fire into like this trinity thing on the bottom of her screen. And then if I hit them with ice, you can absorb that ice and that joins the second part of the trinity, right? And then Lun with the stains. Yeah, exactly. That's exactly what it reminded me of. And then the magic, if somebody just uses normal magic, if she if Mike uses normal magic on the enemy, he can then absorb that magic and then you kind of let that blast go and it's like this floating orb of depending on the elements you're using. You see the the different colors in this orb and it kind of like rotates around the charact the enemies and it hurts them a lot. It's a weird kind of mechanic and it's definitely not straightforward that as your usual just Mike spamming the pebble ability which is just like a kind of like spell uh thing. But once he started kind of getting into flow, he was like, \"Oh, like I I'm feeling this [ __ ] now.\" And I I think as long as you have like",
            "start": 3251.12
        },
        {
            "text": "ability which is just like a kind of like spell uh thing. But once he started kind of getting into flow, he was like, \"Oh, like I I'm feeling this [ __ ] now.\" And I I think as long as you have like either a recluse and an iron eye along with a larger tanky sort of character, then you'll uh you'll end up feeling like you're formidable enough for most of the enemies. CJ Splitz on says, \"Uh, would this be more user friendly if it was designed more like Monster Hunter with a big hub world and character customization?\" I mean, I haven't you played more Monster Hunter than I have. Um, I mean that you're asking for a different game, I guess, at that point. You know, that takes away the the rog light roundbased sort of structure of all of it, which, you know, it's it's why we love the seamless co-op, just kind of running up to and exploring the game at your own pace. Um, I really do look forward to see what sort of mods will come out for this and what the community will be asking for once",
            "start": 3298.0
        },
        {
            "text": "co-op, just kind of running up to and exploring the game at your own pace. Um, I really do look forward to see what sort of mods will come out for this and what the community will be asking for once the game comes out to see what the PC modders will kind of how they'll change make the nights longer, make the, you know, give you three reses or whatever. If you're playing solo, I think there will be a lot of different ways to kind of change the the way the game is played. This would be a different game also, but I was thinking about this as I was like I was just watching videos of Night Rain before this. And as I was watching one of the boss fights, I was like, man, I would just love for this to be a boss rush game. Like just let me do like let me in a in a um a crew of three just do like boss after boss and just like almost do more of a traditional linear kind of rogike experience as opposed to like the run and the storm closing all and and all that stuff. Again, be different be a",
            "start": 3349.76
        },
        {
            "text": "boss after boss and just like almost do more of a traditional linear kind of rogike experience as opposed to like the run and the storm closing all and and all that stuff. Again, be different be a different game, but like I don't know. I I do like the core of what this is. Me too. Me too. I I also kind of wish that it it was more of the traditional rogike Hades structure as opposed to the free exploration kind of battle royale R. I prefer the rog light RNG as opposed to the battle royale RNG where with the battle royale RNG when the world summons in different elemental camps that you can go take down will pop up and it's like ah [ __ ] we didn't get any fire camps this time around. that sucks. We got to like deal with these other ones or whatever. Um I I would have preferred more of a sort of room based lighting, but then that takes away the open nature of all of it. I don't know. There's a lot of different ways you can go with that. Uh Johnny Ba says, \"Do you think Night Rain will",
            "start": 3394.56
        },
        {
            "text": "of room based lighting, but then that takes away the open nature of all of it. I don't know. There's a lot of different ways you can go with that. Uh Johnny Ba says, \"Do you think Night Rain will get you to go back to original Elden Ring, or is Night Rain what you'll stick with when you want some FromSoft?\" No, I'll always go back to original Elen Ring. like you won't have the that sprint or the double jump which works like 70% of the time. But no, Elder Ring is Elden Ring. Like I still have a a no summons run that from last year that I plan on getting back to sometime. Um yeah, I I definitely think that um like I saw somebody in chat asked, \"Will this be a success if will you consider it a success if people stop playing a month from now?\" Yeah, because there's eight bosses and when you beat the eight bosses, I don't blame anybody for moving on. like this isn't a they've not sold it or pitched it as like an ongoing live thing. Correct. Yeah, I don't expect them to add more bosses over",
            "start": 3440.8
        },
        {
            "text": "the eight bosses, I don't blame anybody for moving on. like this isn't a they've not sold it or pitched it as like an ongoing live thing. Correct. Yeah, I don't expect them to add more bosses over time. Bam Bam in the chat says, \"Is this a contender? It's a really really tough year.\" It might be it it it will probably will be a contender by the end of it. By by the end of me seeing all these bosses and having as much fun as I do. It It was always kind of like that's going to be a shorefire win for me. I'm a little bit more down on it as I was during the betas. But I at its core, it's like with the beta and with this sort of like preview period, I'm at 46 hours. Like I' I've played the [ __ ] out of this game. I plan on putting in at least like twice or three times this hour count by the end of the year. Yeah, I don't really see it being a contender for me, but I think I'm also on like the other side of I don't know how much of this game I'm going to play beyond this review. Like I",
            "start": 3486.4
        },
        {
            "text": "end of the year. Yeah, I don't really see it being a contender for me, but I think I'm also on like the other side of I don't know how much of this game I'm going to play beyond this review. Like I would love to actually like go and beat the other bosses, right? But like one is the thing of it's busy time for video games. Like just this morning, I think I've talked about like three different codes that are coming in of games I want to check out. But even even beyond that, like I then had to ask myself, how much enjoyment am I getting for the like difficulty of this game? And one of the the boss that I'm on right now, even though you can tackle them in any order, but I'm trying to go them go in order. The boss that I'm stuck on right now, I got to it and it's like this big statue dude that's [ __ ] brolic as [ __ ] and beat the [ __ ] out of me. He's a word. That's [ __ ] brolic statue that beat the [ __ ] out of me. I don't think I've ever heard someone say that in real life. I'll go",
            "start": 3536.24
        },
        {
            "text": "[ __ ] brolic as [ __ ] and beat the [ __ ] out of me. He's a word. That's [ __ ] brolic statue that beat the [ __ ] out of me. I don't think I've ever heard someone say that in real life. I'll go to New York. But yeah, no, that [ __ ] is like I know. Yeah, that guy's tough, dude. After that fight, I was like, I don't think I'm going to beat this game, dude. I've I've seen every boss except for one and the final boss and uh No, wait. Yeah, ex one and the final boss. Um yeah, I plan on playing this to the end of it. I plan on beating it and especially because that Discord was popping off when people were beating the final boss and saying that is one of the best From Software bosses ever. Like just straight up ever. that that final final boss is like the one that takes a crown for like the coolest of all. Really? Okay. I might do that then. And then on the final super chat of the episode, Arturotron says, \"Addison's with a Y and it's not what you think.\" Good. I like that. That is good.",
            "start": 3576.4
        },
        {
            "text": "of all. Really? Okay. I might do that then. And then on the final super chat of the episode, Arturotron says, \"Addison's with a Y and it's not what you think.\" Good. I like that. That is good. I like that. Let us know in the comments below if you're hyped for Elden Ring Night Rain. If you're going to be trying to take down these eight bosses, and if you have the squad to do it, or if you're going to try it solo and fail. Uh after this we're about to do kind of funny games daily with me and Greg Miller. And then after that it'll be Nick playing some of that sweet sweet Doom the Dark Ages. Until next time though. Love you all. Goodbye.",
            "start": 3624.24
        }
    ]
}