{
    "id": 14154,
    "video_id": "RzqzHXw1EBk",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino"
    ],
    "title": "Can Nick CONQUER Doom: The Dark Ages?!",
    "description": "Go to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748560388,
    "duration": 7382,
    "transcript_chunks": [
        {
            "text": "[Music] two. Yo, what the heck is going on, ladies and gentlemen? Welcome back to my continued playthrough of Doom the Dark Ages or Doom the Old Country as Greg likes to refer to this to. Maybe that's what they're calling it in Italy. Doom the Old Country. Uh, as you guys know, we're here. We're live. We're hanging out for a couple hours probably. And then daddy's got to go see a movie that I'm very excited about. Ooh. If you guys were around for the podcast, let me know what you guys thought about it. Let me know what you think the title of that podcast should be because I floated what I thought my title should be. Don't say it again. And people didn't think it was a good idea. Do not say it again. Hold on a sec. Uh, I'm going to bring the chat up actually. Give me one second. Also, I need to change the title and game. I will do that now. Sorry, chat. I get all mad. Nah, you can get mad. It's fine. go either way. Nick been struggling struggling with audio issues that we have here at",
            "start": 0.35
        },
        {
            "text": "to change the title and game. I will do that now. Sorry, chat. I get all mad. Nah, you can get mad. It's fine. go either way. Nick been struggling struggling with audio issues that we have here at the studio that we're always struggling with audio issues. Correct. You know, we are keep chipping away at it. There we go. I got the chat up right now. I don't understand. Shako says, \"I I would like to I would like to hear the title. I would like to tell you to, but Kevin is our legal team, so he told me not to say it.\" Yeah. Don't say it. I'll just float the idea to you guys, though. Hypothetically speaking, if I came out of the bathroom when they were trying to figure out what the title is, and I titled the video, when is 911 funny? Is that a bad thing? What if Oh my god, look at this. There was there was a group of devs that came out of that same Yeah, but they came out right before it was perfectly timed and Joey spit a diet coke out. They know what they're getting themselves into.",
            "start": 50.4
        },
        {
            "text": "was there was a group of devs that came out of that same Yeah, but they came out right before it was perfectly timed and Joey spit a diet coke out. They know what they're getting themselves into. Look at this. I don't think so. I'm in the One of them dropped their thing they were holding. Are you seeing this, Kevin? Look at this heart. Oh [ __ ] That's nasty. Stick it with a knife like he did to Jesus. CK Jr. said that he's laughing at me. That was fun. Yeah. Notice he said he's laughing at you. Laughing with me. That's not what he said though. Let's see here. Oh, I got an upgrade. Let's see here. Where are we at? See if I can upgrade some cool [ __ ] for Ken Jr. I don't want that. Okay. Name's been updated on that. Did I not upgrade the flail? So, as much research as I can do now, Nick, these little switchboards should be able to do stereo. Cool. But they don't. And I don't understand why. And then Do you know where the zoom is? The zoom. Yeah. Uh, yes. But I have Yeah. H6. The H6. I",
            "start": 93.2
        },
        {
            "text": "little switchboards should be able to do stereo. Cool. But they don't. And I don't understand why. And then Do you know where the zoom is? The zoom. Yeah. Uh, yes. But I have Yeah. H6. The H6. I think I have it at home. Yeah. Figured as much at some point. Just for my like testing purpose. I'd if could you bring in so I can sure cuz what I'd like to do is plug in the XLR 3.5 mm to XLR into the zoom so that I can at least verify am I actually getting different levels? Is the Mi Mix 5 just somehow squashing it all down? Squashing it all down. Sure. Sure. I'm just going to get this cuz I want it. Get it, dude. You earned it. But I don't know if you've noticed everything sounding good in your headphones. Um, I don't like the response. Let me play the game. Hold on. Let me come back to the game. Chad, I don't like the response. Yeah, I think so. I think we lowered the I'm going to increase the sound effects a little bit more in this actually. Uh, cuz we lowered it last time I played cuz",
            "start": 136.8
        },
        {
            "text": "Chad, I don't like the response. Yeah, I think so. I think we lowered the I'm going to increase the sound effects a little bit more in this actually. Uh, cuz we lowered it last time I played cuz Andy just wanted to hear the music. Well, because we're going line level, it the the value like everything's lower. Oh, wait. No. Yeah. Yeah, it's fine. So, yeah, you can actually bring up now. We can bring up all like I brought brought up the uh what is that? gain up to unity there. Mhm. Which I don't know if you remember, our gain used to be all the way down to get rid of that static. The gain was all all the way down to get rid of the static. Yeah. From coming from the computer to the board. Yes. So, it should have been up to get rid of the static. You you know, you would think that, but as soon as you start to cranking up the game, doesn't work. God, I'm mimicking mimicking that pretty well. Okay, let's get into this, guys. We make shirts that say tomorrow warriors. Yoshi, I don't think",
            "start": 198.64
        },
        {
            "text": "as you start to cranking up the game, doesn't work. God, I'm mimicking mimicking that pretty well. Okay, let's get into this, guys. We make shirts that say tomorrow warriors. Yoshi, I don't think that tomorrow warriors shirt is going to sell very well, but you know what? I was wrong about the Tim Getty shirt that sold excellently. Never underestimate how much you guys want to dunk on Tim Getty's. It's messed up. It is what it is. God, that feels good. Flailed. You just got flailed. It's really good. It was vaping. It did sound like vaping. I can't do it anymore. I lost it. I had it for a moment and it's gone now. Sorry, Kevin. The shirt was dunking on Tim and I support. I had to support. That's wild. I get it though. He's got one of those faces, you know. Like John James Marson. Who? James Marston. James Marston. Did I say it wrong? Yeah, I know you did. You did. I just didn't hear you. You know, he was on the first episode of The Nanny with Fran Dresser. Yeah, that's that's that's",
            "start": 239.2
        },
        {
            "text": "Marston. James Marston. Did I say it wrong? Yeah, I know you did. You did. I just didn't hear you. You know, he was on the first episode of The Nanny with Fran Dresser. Yeah, that's that's that's The Nanny. Great show. That's always one of the interesting things about watching shows like Law and Order or like a Grey's Anatomy or stuff like that. You just see all these actors that are wellknown now, but that's where they got their start. The show's been on for so long. Like I was a I think I watched the episode of um Grey's Anatomy where they had this like really young girl that was the patient and it was Millie Bobby Brown. Oh wow. Yeah. Like before like well before uh Stranger Things. Yeah. She was so young but like still a good actor. Yeah. Yeah. Recently I was thinking, \"Oh, maybe I should watch that with Paul.\" And then I was like, \"No, no.\" Which one? Stranger Things. No, no, the uh The Nanny. Oh, why not? Cuz uh what's his face? Uh God, man. I look at this guy. Holy [ __ ] He's",
            "start": 322.8
        },
        {
            "text": "watch that with Paul.\" And then I was like, \"No, no.\" Which one? Stranger Things. No, no, the uh The Nanny. Oh, why not? Cuz uh what's his face? Uh God, man. I look at this guy. Holy [ __ ] He's got a lot of armor on. The dad ends up getting with the nanny. I don't want to put ideas in anyone's head, you know. Oh, you think Paul's going to leave you for the nanny? No, that's not what I'm saying. Mr. Sheffield, that's it. God dang music in this [ __ ] rocks. If you want more of a challenge, turn up enemy aggression and projectile speed. I sure don't. Lower the parody window. Unique technique. That is the opposite of weed. Yeah, you need You weren't here for yesterday's stream where I was like, \"This shit's too [ __ ] hard.\" Maxwell, that's a good name, Maxwell. Douchy. You know, I need to change my weapons. So, Nick, let's say you're friends with your wife's cousin, right? Sure. And you like the husband a lot. when you refer to them, do do you say, \"Oh, yes, my cousin-in-law.\" Uh, I",
            "start": 373.12
        },
        {
            "text": "change my weapons. So, Nick, let's say you're friends with your wife's cousin, right? Sure. And you like the husband a lot. when you refer to them, do do you say, \"Oh, yes, my cousin-in-law.\" Uh, I thought you could. I don't think he's going to take offense to it, you know. Paul's always taking offense to me adding Well, I mean, it's not a it's not a traditionally used term. It's not legally binding, you know. But I think it's a term of endearment. Mhm. Mhm. [ __ ] I'm getting eaten alive here. Give me some help, bro. Can you just call him your friend? No, that would be weird, you know. I don't think anyone would want that. I don't feel comfortable with it. I don't think he [Music] will. God damn. Ah, [ __ ] Oh, yes. I'd like to use my sigil. Oh, you ever think about Mike Howard's middle name and just think that's a wild middle name. What's his middle name? Roxford. I did not know that. I think you did being that you handle all the paperwork in this company. I don't really listen his",
            "start": 439.64
        },
        {
            "text": "name and just think that's a wild middle name. What's his middle name? Roxford. I did not know that. I think you did being that you handle all the paperwork in this company. I don't really listen his middle name on it. Really? Oh, you didn't take his ID for anything. I mean, yeah, but years ago. That's like Maxwell. It is. And his cousin Ruxford Michael Howard. I think that's cool. That's some George Michael [ __ ] Uh, not the singer, the Bluth family member. [Music] He mentioned on stream I think recently. Oh, Rexford. Thank you, Creed. You're right. Not Ruxford. You know me. That makes it better. Ruxford. Rexford way better than Ruxford. No, I'm joking. I'm being facicious. Vowels are hard is all I'm saying. I wonder if I can make that. Yeah, you can make one. Oh, I wonder if he ever went by Rex. I think his cousin goes by Rex. That's cool. Two more switches left. That' be cool. Ah, well, that sucked. A, you were so close. Oh, no. I hit it. It just bounced me off of it. Maybe you",
            "start": 537.28
        },
        {
            "text": "went by Rex. I think his cousin goes by Rex. That's cool. Two more switches left. That' be cool. Ah, well, that sucked. A, you were so close. Oh, no. I hit it. It just bounced me off of it. Maybe you say something. I got the freaking key. You ever think about middle names you just go crazy with if you wanted to? Yeah, you can do whatever you want. You can go crazy with names. Mhm. Remember the the great Seinfeld episode where they wanted to name the kid soda? Mhm. That happened. People do that now. Don't name your kid soda. It's a bad name. You You think Palver She named her kid Apple or something? Yeah, Apple's not terrible. No, it is. It's not the worst thing ever. It's just as bad as soda. Yeah, but there's some weirdass celebrity names, right? Like Yep. I can't think of right now, but Oh, was it Seven? Oh, well, Seven was the the joke in uh Seinfeld. where Costanza wanted to name his kid seven. Oh, I thought it was Soda. Oops. No, I mean it also might have been Soda. No, no, I",
            "start": 620.0
        },
        {
            "text": "but Oh, was it Seven? Oh, well, Seven was the the joke in uh Seinfeld. where Costanza wanted to name his kid seven. Oh, I thought it was Soda. Oops. No, I mean it also might have been Soda. No, no, I think it was seven. I think you're right. I misremembered it. And then someone No, cuz I think they had a name that was bad and and they stole his name. Yeah. Well, no. And then he says seven and instead of going with soda, they go with seven. Yeah, I think that's what h and then he gets all mad of like you stole my name. Snipel's great. One person in the chat has confirmed it was also Soda, not Lzander. And I trust them implicitly. Well, Lzander has been with us since the beginning. I don't know if that's true. There's no way. There's no way to find out. God damn it. No. What was up there? I don't know. You better [ __ ] go get it or I'm going to be pissed. Well, I need whatever it is. Something over here is happening. Oh, and then it was up to your right. Yeah. I wonder if I can get",
            "start": 687.28
        },
        {
            "text": "I don't know. You better [ __ ] go get it or I'm going to be pissed. Well, I need whatever it is. Something over here is happening. Oh, and then it was up to your right. Yeah. I wonder if I can get back up there. Looks like I can. What's up with that lion right next to you? Why are you not breaking that one? Uh, that thing is No, not the pink one. The one on the left that's not glowing pink. Oh, I think that's just there. That's just set dressing. [ __ ] Usually there's a light key that tells me what I'm supposed to be doing around these things. Okay, so this is where I started, right? How do I get all the way up there then? What's the matter with soda? It's bubbly. It's fizzy. People like soda. Oh, okay. Oh, I got to start these things to get this to pump the heart. That makes sense. Oh, [ __ ] We'll just keep going at a linear fashion. I don't need all the rubies. A bad name is whatever Elon is names his kids. Yeah. Like he I mean I think a couple of the first ones were named",
            "start": 738.88
        },
        {
            "text": "Oh, [ __ ] We'll just keep going at a linear fashion. I don't need all the rubies. A bad name is whatever Elon is names his kids. Yeah. Like he I mean I think a couple of the first ones were named normally and like then he got I think once you pass like nine kids, you know. What's he got? 14 now. I think legitimately I think it might be 12 or 13 cuz like didn't someone recently just announce out of nowhere like oh I just had another one of them Elon kids. Yeah. There was some sort of paternity thing happening with uh some Instagram lady he found and it's like I can't blame you for it, right? Like I probably I would probably have one of his kids who pay me a million dollars. I think it's more than that. You think he gets more? How much would you how what's the little le like the least amount of money chat you would take for to have Elon Musk's baby? Now remember, he's a piece of [ __ ] Exactly. That's what I'm saying. What does it say about you if you would say yes to this? Me? $5",
            "start": 789.52
        },
        {
            "text": "amount of money chat you would take for to have Elon Musk's baby? Now remember, he's a piece of [ __ ] Exactly. That's what I'm saying. What does it say about you if you would say yes to this? Me? $5 million. That's how much I'd have to pay. You do it for way less. I do it for a million. I do it for like 200,000. 500 million. [ __ ] You do it for way less. So less. That's so low. Yeah, but like it's also so much spicy milk. 5 million. Yeah. Oh, it's enough. That's enough. No, no. I Yeah. Spicy milk water said that's so low. Plus, you know, the kid might turn out smart and nice depending on how you raise him. Like, he's probably going to have good intelligence cuz I mean, you're going to you're going to get a send him to good schools. Yeah, he's got $5 million. He's sending him to Stanford. None of this public school [ __ ] [ __ ] you public school. Are you kidding me? My kid's not taking the bus. I got $5 million. Or opposite. You make the kid do all that [ __ ] Don't tell him you",
            "start": 834.0
        },
        {
            "text": "None of this public school [ __ ] [ __ ] you public school. Are you kidding me? My kid's not taking the bus. I got $5 million. Or opposite. You make the kid do all that [ __ ] Don't tell him you have any money. And then when he goes, \"Dad, how are you getting all these cool Porsches?\" You go, \"I don't know, son. I worked hard for it. I worked hard for it. I once got $5 million. For an undisclosed reason. Uhhuh. Yeah. I ever tell you I was once accidentally put in a remedial math class for two weeks. Why? Uh I mean the school just [ __ ] up. I I should have taken remedial math. Really? Yeah. I wasn't good at math. I had to try real hard to get like B's and I should have just gone to a normal math class and taken A's and like gotten A's. This would have been the same. Probably would have been like easier for me. Yeah. You know what I mean? Yeah. I just I had no I had no desire to progress in math, so I should have just done the normal math jet. Were you in like AP classes? Yeah. Oh,",
            "start": 880.72
        },
        {
            "text": "been like easier for me. Yeah. You know what I mean? Yeah. I just I had no I had no desire to progress in math, so I should have just done the normal math jet. Were you in like AP classes? Yeah. Oh, okay. I was in AP and IB classes and I hated them and I didn't do well. It really made me not believe in our school system. being in the rememato class for two weeks. Why? Because they it was just so easy. Oh, it was like seventh grade and like there were kids that did not know basic math. Like I taught I taught a lot of kids actually like math. It was crazy and then they put me in the advanced math class. That was fun. That's fun. How far in math did you get up to? I got 5 years at the end of high school. Five years at the end of high school. Yeah. So, uh, well, with college, I I mean, I made it up to ah, calculus 2. I mean, I dropped out though my sophomore year of college. Yeah. But I was a junior standing. I think the last class I did was statistics. And boy, I [ __ ] muddled my way",
            "start": 924.24
        },
        {
            "text": "it up to ah, calculus 2. I mean, I dropped out though my sophomore year of college. Yeah. But I was a junior standing. I think the last class I did was statistics. And boy, I [ __ ] muddled my way through that class. I think got a C or a D, whatever the passing grade was at the time. It's probably a C. I was like, Jesus Christ. And they were like, \"Get at it.\" Like I think I swear to God the professor was like, \"Look, I'm going to pass you. Just you got to promise never to take a math class.\" I I was like, \"That's a promise I can keep, sir.\" I think it must have been calc 2 cuz I was two classes away from minoring in math. That's cool. Yeah. You ever think about going back? No. Never. What for? You know? Yeah. Just a dude. I want to go back to college so bad. That's crazy. Not in like a like now like I would stop doing what we're doing. Maybe. But like, can I get through here? Oh, yes. But like I just want to go back because I didn't really like know how to learn back then. So, it",
            "start": 986.56
        },
        {
            "text": "a like now like I would stop doing what we're doing. Maybe. But like, can I get through here? Oh, yes. But like I just want to go back because I didn't really like know how to learn back then. So, it would be so cool to like go and actually try. Yeah. Yeah. A lot of und diagnosed issues that I had, right? Like might be easier now. Jesus. Also, I was super bored in school all the time. Super what? Bored. Yeah. I mean, I wasn't bored. I just I I think I was just a lot of really confused and didn't really know that I was confused. It was just like I guess this is what everyone feels and it wasn't cuz all my friends are like no it's just easy to us and I was like oh it's really not easy for me. Yay squeeze. Oh that was so cute. Pon says I graduated in 2021. I'm thinking about going for a masters now. You should. Why not? Oh look at that. Masters in what? Debating. It's a bastard. Yeah. No, I got it. I got it. You didn't have to stop. I've asked you not to do that anymore. Hold on. I have",
            "start": 1036.48
        },
        {
            "text": "now. You should. Why not? Oh look at that. Masters in what? Debating. It's a bastard. Yeah. No, I got it. I got it. You didn't have to stop. I've asked you not to do that anymore. Hold on. I have to do this. You get the chat all worked up. I have to do this. There you go. You did it. Weren't you going to be a scientist? I wanted to be a a doctor. Surgeon. You would have been a great surgeon. I think so. You should have seen me with a scalpel. Oh, I know. I bet. I I bet I'm so good at skinning people. And that's not something, you know, can come up all the time. You don't have a lot of medical need to skin someone, but you know, it's cool that you have that in your back the anatomy class, right? Sure. You know, where they're like, okay, we're going to expose the arm muscles. Does anyone want to skin this? You're like, I'll skin it. I'd like to skin it, sir. It's like, well, yeah, I'd raise my hand. I'd be like, sure. No one else was raising their hand. Yeah, why not? God, I was good",
            "start": 1089.68
        },
        {
            "text": "want to skin this? You're like, I'll skin it. I'd like to skin it, sir. It's like, well, yeah, I'd raise my hand. I'd be like, sure. No one else was raising their hand. Yeah, why not? God, I was good with the scalpel. Oh, big guy. I'm actually a behavior research scientist with a PhD in psychology. Oh, that sounds fun. You shocking people. You getting people to shock other people? Let me know. I watch a lot of Grey's Anatomy, as you know, Kevin. I think I would have made a horrible surgeon. I can honestly, truthfully, and honestly say I would not be able to be in the medical field. I'm dying. I have a degree in math every day. Really? Funky Guda. What would you rather have gotten? Do you regret it every day? Mhm. And then Ponton says, \"Masters in architecture.\" That's cool. Is architecture working in architecture as competitive as people say? Having kids dissect a dead preserved baby pig is weird, but cool at the same time. I [ __ ] up with my dead baby pig. It was still a little",
            "start": 1142.32
        },
        {
            "text": "working in architecture as competitive as people say? Having kids dissect a dead preserved baby pig is weird, but cool at the same time. I [ __ ] up with my dead baby pig. It was still a little frozen and I kind of rolled it and it crunched. I mean, all its organs were mashed. Ew. But it was like seventh grade. You know, what are they doing giving us little dead baby pigs? What does that do? What did I just do with that thing? Was that high school? Seventh grade might have been the eyeball cow eye. a masters in. It is. It is. That's cool. That's cool, Pon. When I was a When I was a real little kid, I wanted to be an architect. I think it's cool, man. There's a Every time I see an Here's why. I think every time I see an architectural firm, like Smothers and Smothers or whatever it is, you know, like the cool cool firms, they always look cool inside cuz you can't have an architectural firm. Oh, yeah. And not like this. What is this? This is a box. Yeah. Wait, what are we doing? I",
            "start": 1240.64
        },
        {
            "text": "you know, like the cool cool firms, they always look cool inside cuz you can't have an architectural firm. Oh, yeah. And not like this. What is this? This is a box. Yeah. Wait, what are we doing? I watched The Brutalists finally. Oh, how was it? Uh, very good. And then I hated it. Is all the jerking off? No, the jerking off part was great. It's obviously the highlight of the movie, seeing Adrian Brody's. Oh. Uh, no. It was very, very good. And then it's very punishing. There's a lot of dark, deep stuff that happens in it. And uh, I think it was just it's difficult to watch. Difficult to watch movie. Which one's harder? That or the pianist? Uh, I haven't seen The Pist in a long time. Yeah. Oh, in a long time. Okay. You have seen. Yeah. But I remember it being thick. I didn't know where we were going for that. I mean, you said, \"Which one's harder, the penis?\" And I was like, \"Well, I don't know if Kevin's what he's doing with this.\" [Music] Uh, yeah. But I've always I've always been",
            "start": 1309.76
        },
        {
            "text": "were going for that. I mean, you said, \"Which one's harder, the penis?\" And I was like, \"Well, I don't know if Kevin's what he's doing with this.\" [Music] Uh, yeah. But I've always I've always been really like in love with the idea of architecture and uh I've drawn many a floor plan from houses on open houses I've gone to. It's cool. Yeah. Yeah, it's very fun. I had to do the floor plans for this building. You did? Yeah. That was cool. That was cool. I got dual anth bio degrees. Ew [ __ ] And ended up working in gamedev. Oh, that's cool. What a ride. Oh my god. Kevin plays the Sims stream. I love the Sims. You should do that. Although there are limitations where you can't like do certain things and you can't make them do each other. No, that didn't I was talking about building. Oh, I thought that's what you meant. Cuz like when you're trying to build your house, you know, that's like, oh, I wanted a slightly more ovalshaped table. You went ovular. Digital Dun says, \"I'm work I'm",
            "start": 1351.16
        },
        {
            "text": "thought that's what you meant. Cuz like when you're trying to build your house, you know, that's like, oh, I wanted a slightly more ovalshaped table. You went ovular. Digital Dun says, \"I'm work I'm actually working on architectural drawings right now.\" Oh, of what? 3D. That's cool. Isn't it always in 3D now? Architects now sometimes they do like handdrafting, right? Maybe. Like, don't they all use CAD now and then CAD just like you hit one button and it's like, \"Oh, let me see the 3D part.\" Yeah. I mean, it's I mean, we'll just call it what it is. Being an architect these days is super easy. Oh man, I can't. I forgot. I'm chat. Chad, I don't know. I'm glad you brought this slide of questioning up, Kevin. I was going to let it go, but you of course among us are the most honest. They're mean. So, we do get to talk about how it's so weird. The things you guys bully. It's just bought the house and then some poor contractor has to figure out how to make it. You know what I mean? Yep.",
            "start": 1425.36
        },
        {
            "text": "mean. So, we do get to talk about how it's so weird. The things you guys bully. It's just bought the house and then some poor contractor has to figure out how to make it. You know what I mean? Yep. Totally. It was cool when you guys sent the plans that I made to an architect and then like rendered them and added all the like cool features. It's definitely a fun process. How do I get up there? I think you type it in GPT chat GP. Oh yeah, GG. That can make anything. Just say hey Groank and something just does something. Is it Grock or Gro? Grock. Grock. That's the one on Twitter, right? Yeah, Grock. That shit's fascinating, man. Hey, Grock, is this real? And Grock just goes, \"Nope, unless it's full of shit.\" And you know, that has to piss him off that there someone's using an AI bot to disprove everything that's happening. But, you know, he doesn't work for the American government anymore, apparently. So, it's fine. He fixed it. So, is that real? He fixed it. Is he out? I saw a bunch of",
            "start": 1476.8
        },
        {
            "text": "everything that's happening. But, you know, he doesn't work for the American government anymore, apparently. So, it's fine. He fixed it. So, is that real? He fixed it. Is he out? I saw a bunch of headlines saying insiders say he's out, and he hasn't really been saying anything in a while. Oh, but like he has it hasn't been officially announced that he's no longer working with uh Yeah, but are they going to officially announce that? They're not going to officially announce that. They're just going to let it die. They're going to do what they always do when something doesn't work. Just don't talk about it anymore and then claim it was a huge success when he tries to get reelected. You know, politics. What a world. What a world in which we live. I guess we can all agree like if you like Elon Musk, look, it's fine. If you like him, that's your opinion. If you don't like him, that's your opinion. We can all agree that architects suck. No, no one said architects suck. Elon Musk suck. Sorry",
            "start": 1527.12
        },
        {
            "text": "Musk, look, it's fine. If you like him, that's your opinion. If you don't like him, that's your opinion. We can all agree that architects suck. No, no one said architects suck. Elon Musk suck. Sorry you love him so much. [ __ ] who, man? He's got 13 kids, right? I'm Where are you at? You only got one kid. Like, oh, what are you doing with your life? Greg, you with one kid being responsible, you know? Like, go try to be a good dad. So, so 2020, Gronk is some sort of football player. Grank N. Grank is Gronowski. And I have him on the brain cuz I saw an old Tik Tok that said that he never he didn't spend a dollar of his uh NFL earnings. He just invested him. That's smart. Yeah, it it was interesting. And I'm sure this is old and everyone's heard this already, but someone asked him that question like, \"Is this real?\" And he's like, \"Yeah, it's actually like he's like, you know, within reason like he spent a little bit here and there, but you got it right. You got a house. You got to",
            "start": 1564.16
        },
        {
            "text": "question like, \"Is this real?\" And he's like, \"Yeah, it's actually like he's like, you know, within reason like he spent a little bit here and there, but you got it right. You got a house. You got to live.\" Apparently, he was like I was he was very pragmatic about, you know, his career cuz he was like a second round draft pick or something like that, which is bad or good. It's not as good as a first round, I guess. Okay. Okay. All right. Um, so he was basically like, \"Yeah, you know, I got in the NFL and I had like a three-year contract or something and I was like, I'll just I'm going to try to He's like, I calculated it if I didn't spend any money and I, you know, got injured after I maybe was like a Yeah, I guess it was. Yeah. And but I played every game. He would have walked away with like $5 million. And he was like, I can make that work for the rest of my life. Yeah. So he just took every cent of it and and invested it. And then of course now he's gone on to be I think he played",
            "start": 1609.12
        },
        {
            "text": "like $5 million. And he was like, I can make that work for the rest of my life. Yeah. So he just took every cent of it and and invested it. And then of course now he's gone on to be I think he played for quite a long time, got paid hella, but he was like, I just got in the habit of just investing in the money. That's that's exactly what you should do. I know, but that's not what most people do, you know. Oh, City I love City Skylines, Darth. I just saw your your message there of I should play City Skylines. Um, it I had a lot of fun, but the PCs that I played on like all melted, so it stopped working. Hit hit him with a [ __ ] thing. Oh, they're not quite there yet. God, the the physical torment that you have to go through if you're an athlete, it's tough. That's why, do you know, honestly, that's why when they asked, I was like, \"No, I'm good.\" Okay. Yeah, that why you couldn't fit in your little suit. I couldn't. I had to have him make me a new one. I know. They were so mad about my",
            "start": 1648.64
        },
        {
            "text": "that's why when they asked, I was like, \"No, I'm good.\" Okay. Yeah, that why you couldn't fit in your little suit. I couldn't. I had to have him make me a new one. I know. They were so mad about my band director was so salty about that. He was like, \"You're a good trumpet player. Why do you want to beat drum major?\" And I was like, \"I want to get into a good college.\" And he was like, \"That's stupid.\" It worked out all right. Yeah, I went to Irvine. It wasn't the best. Whatever. You know, it's fine. Is it UC? It's great now, apparently. Is it? Yeah. Apparently, everyone's like, \"Oh, it's real. Really wellrespected school now.\" But what do I know? I graduated 74 years ago. Average John, I've never played Calling Sim games. Now, my problem with sim like like city sim builder games is like there's just mechanics that I don't understand and it always like everyone starts getting sick. No matter how many hospitals I put down, everyone just dies. You ever dabble in those kind of games? Uh",
            "start": 1707.44
        },
        {
            "text": "there's just mechanics that I don't understand and it always like everyone starts getting sick. No matter how many hospitals I put down, everyone just dies. You ever dabble in those kind of games? Uh I've only played Sims like a handful of times. I just uh yeah, never got into them. The [ __ ] a euphonium? I had to do some good. That was sweet. I crushed that. I never got into the Sims. Oh. Oh, it's like a big trumpet. What's this? Ephonium. I don't know if I'm saying that right. E U P H. Yeah. Yeah. The heart has been primed. I want to say the forge now. Similar to a baritone. I don't know what that means. Is that a big saxophone? No, there was a name. I'm getting my I'm getting my uh brass instruments mixed up here. Cooper says, \"I played the euphonium and I tried trombone. Teacher told me if I I'd have a better career if I switched.\" He was right. Ended up going to Berkeley. Oh, but like not spelled the way you would think. No, maybe it's a cosmo cosmetology school. Oh [ __ ] Is",
            "start": 1760.48
        },
        {
            "text": "me if I I'd have a better career if I switched.\" He was right. Ended up going to Berkeley. Oh, but like not spelled the way you would think. No, maybe it's a cosmo cosmetology school. Oh [ __ ] Is that like a music school? No, that's for makeup. No, I know what cosmetology school is. I'm I'm looking up the Berkeley Oh, yeah. Berkeley College of Music. It's confusing. Uh, Cooper, cuz we We have a Berkeley out here. UC Berkeley and it's just Someone would say it's more respected than the Berkeley College of Music. Although, I have heard of the Berkeley College of Music. So, now that I'm thinking about that, it does sound pretty cool. How many Novalorates they got there? About 10 at least. No, you're just making [ __ ] up. A minimum 10 15. Who doesn't have a no? You throw a stone in this office, you get a noette. Talk to me when you're a road scholar. It's cool, isn't it? Road scholar. You went to Oxford for free. All right. Nick's trumpet solo in the Twitch Prime sub song lives in my",
            "start": 1843.44
        },
        {
            "text": "you get a noette. Talk to me when you're a road scholar. It's cool, isn't it? Road scholar. You went to Oxford for free. All right. Nick's trumpet solo in the Twitch Prime sub song lives in my head. rent free and I'm the greatest. He did in one take, too. Sure. Yeah. Recorded 60 more takes just for fun. Well, you got to get it right. You got to [ __ ] you know, and you have a tendency when you're doing something like that that you're stressed about to just get a little angrier and a little angry take. And it's like you're not getting angry at anyone but yourself. Yeah. It's just tough. And it's just like we're all like, \"It's okay. We like we're here all day. Just keep going.\" Uh, fun times. We got to do more stuff like that. You got one of them off. Yeah. I don't know how I did that, though. I upstairs. It was that pink thing where you put the key in. Probably that, right? Yeah, maybe. There's an arrow pointing up in the middle. Is that Is that what that is? No, it wants me to go to",
            "start": 1900.32
        },
        {
            "text": "I upstairs. It was that pink thing where you put the key in. Probably that, right? Yeah, maybe. There's an arrow pointing up in the middle. Is that Is that what that is? No, it wants me to go to the objective there, but I think these are side objectives. I got to get into here. Um, and I think that'll unlock whatever this thing I just don't know what this thing is. It must be another collectible like shard upgrade thing. I'm also trying to get all the gold cuz I want these dope upgrades right there. Oh, pig pygmy monkey. Yeah, says huge band nerd. I have 95% of a degree in music education. I now make signs and put up murals. That's a big change. So, you have a band. You You could be teaching marching band, but you you make murals. He didn't finish the degree, though. That's okay. That happens. Oh, yeah. We've all been there. I didn't finish. UC Berkeley discovered 16 elements. Yeah. Like, after you discovered one, okay, you guys figured out how to do it. You know what I mean? You",
            "start": 1960.24
        },
        {
            "text": "happens. Oh, yeah. We've all been there. I didn't finish. UC Berkeley discovered 16 elements. Yeah. Like, after you discovered one, okay, you guys figured out how to do it. You know what I mean? You can't brag about, oh yeah, there was another 15. Like, okay, cool. You know what they did, too? You know what? Can I be real? Mhm. Cuz this smacks with the kind of like strategic [ __ ] where they go like we discovered all 16 of them, but we just said, \"Oh, we got the first one and it's really hard.\" And then what year after year they just keep rolling them out and it's like you guys knew about them beforehand, right? They didn't even give them cool names. What do they barkleium? You know what's fun about that? It's nothing, dude. You're so right. I graduated medical school this month. Going to family medicine. Come see me in about a year. Y'all need an aderal plug? Oh, okay. Yeah, I'd like some aderall. That's street value is still good. Name it something cool. Like iron. That's metal,",
            "start": 2017.04
        },
        {
            "text": "to family medicine. Come see me in about a year. Y'all need an aderal plug? Oh, okay. Yeah, I'd like some aderall. That's street value is still good. Name it something cool. Like iron. That's metal, bro. Iron's [ __ ] sick, dude. That's sick, though. Yeah, let's co-op that heavy metal. Let's call it iron. You see, I can't make that jump. I guess I don't need to be up there. Good [ __ ] jokes that I just made. It's also glowing pink. I think you do have to be up there. Yeah, but I already smashed it. Chad, how do I get this last pink thing? Chat, help him out. Oh, look at that. You got a little thing you shoot out. Yeah, it's a little tongue. Yeah, one of them uh what alien things? Xenomorph tongues. Krabby Patty says, \"My favorite is the element of surprise.\" Oh, that's a good one. That is a good one. See, like that's what I would name my element if I've discovered an element. Surprise. That'd be cool. That's smart. Mhm. And that's just going to bring a smile to everyone's face when",
            "start": 2066.8
        },
        {
            "text": "is a good one. See, like that's what I would name my element if I've discovered an element. Surprise. That'd be cool. That's smart. Mhm. And that's just going to bring a smile to everyone's face when they have to work with that element from now on. Mhm. Well, what do we want to do? We're going to build this out of steel and surprise. Yeah. I can't get it, [ __ ] I don't think it wants me up there. There is a side tunnel. There is a side tunnel. I think the last statue is close to the start of the level. There is a side tunnel. That's what he said. I read last statue. Okay, just the second message the first time. Well, I think All right, let me go back to where this was. I got the key. Uh, Pygmy Monkey says, \"I taught in a few high schools while at college, but I got burned out. I was an assistant percussionist director.\" Oh, nice. Then he says, \"And got paid.\" Got paid. What does that mean? He got paid, dog. The perussionist director gets paid. Well, sure. You think he's wearing a lot",
            "start": 2126.48
        },
        {
            "text": "percussionist director.\" Oh, nice. Then he says, \"And got paid.\" Got paid. What does that mean? He got paid, dog. The perussionist director gets paid. Well, sure. You think he's wearing a lot of like ear protection? No. Probably not. Really? I guarantee he's not. No disrespect, but I guar none of y'all have I guarantee it. I guarantee it's not there. What is this? Okay. Is this a loud? It is loud. Yeah. Omega Buster just out of nowhere says we should watch we should watch along the fifth element. I don't disagree. Chuck your shield up there just in case. Average John. But he already broke it. Average John. If running a drum line, you better hit a demon with shield throw, shield charge, or parry. Oh, paid was in quotations. It was. It was in quotations. Oh, okay. I'll take that. Why not? Uh, Evan Irv says, \"Nick, you parry.\" Well, thank you. His impaler. Thank you. I'm using the impaler right now, dog. Kevin ask what Nick would carry for his EDC. Is that a concert for his EDC? It's",
            "start": 2172.96
        },
        {
            "text": "Uh, Evan Irv says, \"Nick, you parry.\" Well, thank you. His impaler. Thank you. I'm using the impaler right now, dog. Kevin ask what Nick would carry for his EDC. Is that a concert for his EDC? It's like uh Yeah, it's the big like Isn't EDC that big? It is. I was making a joke cuz I think EDC the way they mean it is everyday carry. Oh, so it's like what do you got in your pockets? Oh, like right now? Yeah. Credit cards, a chapstick. But severed finger. Those credit cards. You have them all in your wallet. Yeah, I rod dog it. He rod dogs it. He has his credit cards loose. Yeah, I put in my pocket right next to the severed finger. Okay. So, I don't want to exit yet. I want that stupid statue. That's always upset me. you and your loose cards. Well, it's only bit me ass three times. Oh, yeah. Mhm. Yeah. I've only lost the card three times. That's not a small amount of times. It's not insignificant. I don't like the silhouette. I get it. Just get one of these thin little wallets. Look at my",
            "start": 2255.12
        },
        {
            "text": "Yeah. I've only lost the card three times. That's not a small amount of times. It's not insignificant. I don't like the silhouette. I get it. Just get one of these thin little wallets. Look at my wallet. And then it's like a square in your pocket. When I'm on stage, I hate seeing silhouettes in my pockets. Take it off when you go on stage. My pants. Like, they cancel you for things like that. This is It's not 2015 anymore. Yeah. I mean, that's pretty thin. It's got a little thing of cash in it, so it's thicker than it normally. I carry my cash in my other pocket. How much cash you got on you right now? Oh, good question. And play. Who's got more cash? Cuz I recently went to Tahoe and I had extra cash. Five, 10, I would say 15 bucks. 120. So, a little bit more than me. Yeah, I keep cash just to tip bartenders. I don't like them reporting things to the IRS. I like that. I don't think they should have to, personally speaking. Okay, that's one thing I got to improve. carry cash for that",
            "start": 2309.68
        },
        {
            "text": "to tip bartenders. I don't like them reporting things to the IRS. I like that. I don't think they should have to, personally speaking. Okay, that's one thing I got to improve. carry cash for that sort of thing. I always tip I always tip in cash. Plus, you can get away with like you don't have the awkwardness of like who, you know, like I'll tip you here. Don't worry about, you know. Mhm. Then the [ __ ] weird machine thing where they turn it to you and pretend like they don't know you're going to go. I'll get, you know, I might tip the cash. Cameron Ken asked an important question. Do you raw dog the cash too? The Oh, yeah. Oh, yeah. Is it Is it just folded together? goes into the pocket. I make sure everything's lined up because I'm obsessivempulsive, right? I like that. It's like small. So, it has to be It has to be big bells in the back, of course. Small bells up front. Y and then every all the heads have to be facing the right way. Absolutely. Right. And that way, if you want to",
            "start": 2354.24
        },
        {
            "text": "So, it has to be It has to be big bells in the back, of course. Small bells up front. Y and then every all the heads have to be facing the right way. Absolutely. Right. And that way, if you want to cash it count it, you flip it over. You count it from the big down to the small. Mhm. Mhm. Or you just go like this. 15. Right. You get a sense for it. Where is this stupid statue? Uh somebody in the chat and it it went away. I mean, it's right there, maybe. I don't know. They were saying, \"What about uh like a one of those wallets that attach to your phone?\" Uh, no. I don't I feel like that's a really easy solution. The wallet that attaches to the phone. Yeah, it's a little magnet. Just don't make my phone bigger. Maybe it's up that way by a sliver. Where are we? What's this thing? Did I not have this? Tim used to do the same thing with his keys where he didn't have a key ring. I got to get this thing. He would just have three keys in his pocket. Okay. And it made me feel sick. Yeah, I",
            "start": 2400.88
        },
        {
            "text": "have this? Tim used to do the same thing with his keys where he didn't have a key ring. I got to get this thing. He would just have three keys in his pocket. Okay. And it made me feel sick. Yeah, I hate that. And then Tim was like, \"It never problem.\" Remember the old studio? Every [ __ ] time he'd be like, \"Can somebody let me in? I don't have the key.\" Oh, somebody sent me own this business. Somebody sent me a tutorial if you want me to. Uh, I got one more avenue that I got to go down that I haven't explored yet. But yeah, if I can't find it, then you might want to I'll have it. Tell me where it is. Yeah, just scrub through it real quick and tell me where it is. Oh, so actually Okay, might as well. Might as well. I'm going that way. You just be better at the game. You know, if you thought I mean, it's a puzzle, you know. Let's see here. Is it a puzzle? Yeah, it's like, you know, it's puzzle. Oh, I see. I found it. Oh [ __ ] The codeex part. Oh, look at that. There's [ __ ] over",
            "start": 2452.4
        },
        {
            "text": "I mean, it's a puzzle, you know. Let's see here. Is it a puzzle? Yeah, it's like, you know, it's puzzle. Oh, I see. I found it. Oh [ __ ] The codeex part. Oh, look at that. There's [ __ ] over there, too. [ __ ] yeah, dude. Let me the [ __ ] back up. Is that piss? Is this your in town? I've never seen your in town. Really? You know what it's about? Uh people that pee on the ground. Uh you got to pay to use the bathroom. Oh, that sucks. Yep. [ __ ] I'm not going to lie. It seems like there's a lot more tongue in this one cuz that dude crushed this stone just like like I mean from the floor. He threw the thing up and it broke it. So, I don't know. Maybe you broke the game. Looked like it worked. Maybe. I do like the maps in this though. They did a good job with them. Okay, so something up on that hill. So, let's get up there. And if I can't find it, I'll just move on. Let's be honest. Yeah, it's a really weird cut. He throws his thing up there. It breaks the line, which you've already",
            "start": 2490.24
        },
        {
            "text": "on that hill. So, let's get up there. And if I can't find it, I'll just move on. Let's be honest. Yeah, it's a really weird cut. He throws his thing up there. It breaks the line, which you've already done. Mhm. And then it just cuts to him being in front of the gate as if it but it just like why wouldn't it show us the pink gate? Yeah. Thanks John for doing that. That's how it is in Mexico. I don't know what he said. Sorry ugly link, but it's a short video. Go to the 40 second mark. I think that's the one he's missing. Average John, I just want you to know that it makes me sad to find out you weren't watching. Oh, wait. No, no, no, no. You're right. I'm wrong. You He's He's uh walking to another one. Ian, what is he Christopher Walkan? You need to work on that. You know, you loved it. Yeah, I mean, I did enjoy it. I did enjoy it. I love it so much when I do that joke. I don't know how to describe this to you, Nick. Yeah, there's another one. Hold on. Oh, wait, wait. Pull up the map.",
            "start": 2547.16
        },
        {
            "text": "I mean, I did enjoy it. I did enjoy it. I love it so much when I do that joke. I don't know how to describe this to you, Nick. Yeah, there's another one. Hold on. Oh, wait, wait. Pull up the map. I'm trying to get this thing, too. Zoom out a little. Trying to figure out where you're at. [ __ ] So, this where I came in. Oh, I think I think I think you're in the right area. I think you're going for the right one. Okay. Well, I mean, it's the only thing that's unchecked still. So, I imagine that's the only thing that's going to get it for me. I don't even know where that [ __ ] shrine is, though. cuz Oh, it's right there. Okay, that's what I need. That's what I'm looking for right there. This thing that doohickey. So, let me try to get up here. How do I get up here? Give me the B boy. Play that song. Want to get Go to the beginning of the map, not the exit. I don't know where the [ __ ] beginning of the map is, bro. Do you think I pay attention like that? Average John says pause. Pause.",
            "start": 2616.08
        },
        {
            "text": "song. Want to get Go to the beginning of the map, not the exit. I don't know where the [ __ ] beginning of the map is, bro. Do you think I pay attention like that? Average John says pause. Pause. John and paused. Yeah, I mean, real hard to tell how the the map lines up to this guy's map, right? I kind of go up this [ __ ] hill, but I don't know. Let me see. Let me see it again. Let me see it one more time. Let me get up the hill real quick. How do I jump down here? Oh. Oh, okay. Now I'm paused. [ __ ] Okay, it's over to the right there. Hold on. Okay. Well, let me try one thing real quick. Yeah, dude. Do whatever you want. So, Oh, no. No, this is somewhere else. Okay, so this is the right way for Pull up that map. Pull up that map. Let me see. Let me see the map one more time. One sec. Let me make that jump real quick. You did it, dude. Okay. Oh, yeah. It's right down here. Ah, here's this thing. That's just gold. [ __ ] [ __ ] me. That's the other statue. Pull up. Pull up the map.",
            "start": 2659.08
        },
        {
            "text": "Let me make that jump real quick. You did it, dude. Okay. Oh, yeah. It's right down here. Ah, here's this thing. That's just gold. [ __ ] [ __ ] me. That's the other statue. Pull up. Pull up the map. Okay. Map is pulled up. Okay. So, let me Let's orient. Uh, ro. Give me a rotate. Let me hold it there. Hold it there. Hold. No, there's a delay. Yeah. Um, you're still not holding though. I was just incrementing. I don't know why. I was incrementing. Yeah. Um, north of the green shrine. Okay. Creed says A says north of the green shrine. Okay. Well, that Okay, that's the green shrine. How do I know it's north, though? Do you want to just come over here for a second and look at this? I'll talk to the kids. So, he pulls up the map here. I hate YouTube. There it is. All right. So, that's the one you already broke. Then he pulls up the map and does this whole thing. I don't know what that means. Oh, I haven't been there. And then there's that one. Yeah, I don't think I've been there yet. Where",
            "start": 2703.2
        },
        {
            "text": "already broke. Then he pulls up the map and does this whole thing. I don't know what that means. Oh, I haven't been there. And then there's that one. Yeah, I don't think I've been there yet. Where is that? I don't know, dude. That's what I'm asking. Where's the gate? North is correct. You reoriented the map again. All right. [ __ ] my life. Chad, be cool, dude. This is hard for all of us. Hold on. What's Oh, wait. What's over here? There's more question marks over there. Oh, I haven't gotten those yet. I'll go get those real quick. These ones right here. I can't see. Oh. Oh, yeah. Okay. See those little the little Sure. I mean, I don't think those are the right place to go, but that's something though. At least it gives you purpose something. I mean, you know, so where North is correct again. Oh, okay. I see. North straight ahead from where you're looking in relative. Is it? I don't know. Why is there I'm not seeing you seeing a I'm going for those little things first. Cardinal",
            "start": 2752.0
        },
        {
            "text": "again. Oh, okay. I see. North straight ahead from where you're looking in relative. Is it? I don't know. Why is there I'm not seeing you seeing a I'm going for those little things first. Cardinal whatever. Uh the the compass. Yeah. No compass. I don't think there is one. I don't think there is a north in in this game at all. Look at the green shine. Go green shine. I'm going to the green shrine. Go the opposite way from the exit. Okay. Here's the green shrine. Okay. And the exit is over that way. Okay. So, it's turned right around. So, now I'm going down that way. Yes, there's the beginning of the level. Chad, let me know if I'm wrong. This feels right. There it is. You're right. Oh, look at you guys. I feel like Evan was getting mad. Like, Evan, dude, we're just Oh, [ __ ] Oh, you saw it in the video. There was a secret guy there. I don't pay attention that closely. Why you good? Sick. Woohoo. Woohoo. Did I miss anything over here? No, this is my entrance. Okay. Of course you did",
            "start": 2799.36
        },
        {
            "text": "it in the video. There was a secret guy there. I don't pay attention that closely. Why you good? Sick. Woohoo. Woohoo. Did I miss anything over here? No, this is my entrance. Okay. Of course you did great. I just punked that dude. All right, cool. Thank you for that, guys. That was great. I feel good about this. Use the second gun from this gun. Second gun from this gun. I feel like Evan's trying to mess with us now. The second gun? This one? The Cycler? I mean, I guess you can go either way as the second gun from this gun, right? Well, the other one's the shotgun, which I love using. Or does he want me to use this the pulverizer? Evan, if you want to use a new I haven't used the pulverizer. He says no. What the hell? Use the second gun from this gun. Great for parry after upgrading. No. Press F. F. Oh, second upgrade, I think. Oh, F to switch subg gun sub weapon. Oh god, I don't think I have a sub weapon of this yet, but I got the shard. Okay, so I take this. It's an arrow head.",
            "start": 2858.16
        },
        {
            "text": "No. Press F. F. Oh, second upgrade, I think. Oh, F to switch subg gun sub weapon. Oh god, I don't think I have a sub weapon of this yet, but I got the shard. Okay, so I take this. It's an arrow head. That's really cool. Mhm. Okay, cool. But it's like inflated stone. Purchase upgrades at Oh, let's go purchase an upgrade. Why the heck not? Evan, you gota calm down, man. What did Evan say at? He just says press F. F to switch sub weapon of that weapon. Not this one. The nail gun. He's all worked up. The alt skull crusher is sick as [ __ ] It is. Oh yeah, this is sick. This like a one shot like sniper rifle basically. Not sniper like one shot. Shooting stakes. Yeah, they're shooting steak. Oh, not the kind you eat though. So, what can I do? Oh, cool. Okay, so this gets me like a Do I Okay, Chad. Do I need to hold on to this thing, though? Is this going to get me a better thing for the shield later or what? Yeah, let him go. Like, should I spend this now? Should he should he stacks his",
            "start": 2942.92
        },
        {
            "text": "Chad. Do I need to hold on to this thing, though? Is this going to get me a better thing for the shield later or what? Yeah, let him go. Like, should I spend this now? Should he should he stacks his stack his points or stack it and back? Waste them. So, oh, I guess Evan says upgrade the impaler. Okay. Evan really likes the impaler. Evan Oh, it upgrades the full gun. That's cool. Oh, I really should have been looking for these to begin with. Okay, cool. Rad. I did the wrong one. Shock cho. Are you [ __ ] serious? Mhm. I did the wrong one. I did the sher instead. Not the impaler. Uh Evan, was that Oh, he says no. You upgrade the nail gun. God damn it. I'm I'm going go back. I'm go back. Oh, you can go back. I'm going to go back and reload, maybe. I don't think that's Let's try it. Okay. [ __ ] Evan, he's doing this. Well, you know, cuz I got confused cuz the impaler and the nail gun are It's the alt. [Music] Okay. You go back too far now. Yeah, I went back way too far. No, but you know",
            "start": 3015.52
        },
        {
            "text": "Evan, he's doing this. Well, you know, cuz I got confused cuz the impaler and the nail gun are It's the alt. [Music] Okay. You go back too far now. Yeah, I went back way too far. No, but you know the secrets now. You know, you've been to the other side of the shrine. Yeah, I know where I'm going now, but I wanted to see if I got everything. No, everything. Did I not get it? Evan has a couple more messages. What did Evan say? He says, \"Godamn it in all caps. I'm done.\" Oh, Evan. Evan, chillax. He He reset the game for you. I reset it for you, Evan. Yeah, literally no one else is asking him to do that. He all triggered. Also, I I Oh, God. Every time he might be gone. Oh, he's back. He said, \"No, you can't.\" Oh, I can't. Wait, you can't. What do you mean you can't? Oh, I already eat. Oh, it did auto save. It did auto save. Yeah. Oh, well. Reset doesn't work with upgrades. Oh, [ __ ] So you went back. Oops. Stuck. No, I think it just I think that checkpoint just put me cuz I don't have to",
            "start": 3076.96
        },
        {
            "text": "auto save. It did auto save. Yeah. Oh, well. Reset doesn't work with upgrades. Oh, [ __ ] So you went back. Oops. Stuck. No, I think it just I think that checkpoint just put me cuz I don't have to fight in the people I just fought. And I think I have everything. So did I get the Did I get that last piece of You just wasted another five minutes. Sorry, Evan. If it's to be fair though, I really do like this whatever this one gun is. This is the one he wasn't. Oh, the impal. This is the one I've been using. The shredder. So, I'm glad I upgraded it, but I do apologize that uh I didn't do the one you wanted me to do. But the next raid soon I get I will upgrade the impaler. I promise. This is too funny. Well, I thought I would think that you upgrade the whole thing, but you don't. You'll get one next level probably, says average John. Let's see here. Who are those questions? Evan, to apologize. Allow me to uh give you 10% off our merchandise. Yeah, let's get his money, too. You know what I",
            "start": 3145.2
        },
        {
            "text": "next level probably, says average John. Let's see here. Who are those questions? Evan, to apologize. Allow me to uh give you 10% off our merchandise. Yeah, let's get his money, too. You know what I mean? And to apologize as well. Allow me to give you Tim Tim's credit card information. Don't tell anyone, though. Did I get those? He says, \"Lol, no worries. I love you guys.\" Maybe I did get that. I must have gotten it already. Where the [ __ ] were those questions? Oh well, [ __ ] it. Are you guys going to be part of the Switch marathon? Probably not. Probably not. Yeah, maybe a little bit. I might I might stop by like on the Thursday night, but Oh, don't tell them. Surprise. We'll see. Chad, be cool about it. Doesn't surprise you. I got a kid I'm hanging out with. You know, I have no excuse. I just don't care about the Switch. He falls asleep at 7:30, 8, let's say. Me or the kid? No. Well, no. My kid, you stay up late. I stay up pretty late. Yeah. I love the camera while it gets his",
            "start": 3188.56
        },
        {
            "text": "I just don't care about the Switch. He falls asleep at 7:30, 8, let's say. Me or the kid? No. Well, no. My kid, you stay up late. I stay up pretty late. Yeah. I love the camera while it gets his money, too. Oh, we have a good time. Henry's been great. Back to normal. I don't I'm just murdering things. Yes, I want you, Ruby. Dear Ruby. All right, what do we got going on here? Does Henry have a furry friend he likes more? Um, he really likes uh he gets very excited with the cat. Oh, in fact, he gets so excited with the cat that he can't pet the cat because of it cuz he starts crawling to him and he starts yelling as he's crawling. Yeah. He'll just be like, \"Ah, that's very exciting.\" And the cat's like, \"Oh, [ __ ] this.\" That's very exciting. I've been there. Yeah. He uh he's he's most comfortable with uh Cecil who's just kind of doesn't give a [ __ ] about anything. Just lays there. Uh Ram, he's getting close to petting Ram, but Ram still is in a place where he like freaks out a",
            "start": 3249.36
        },
        {
            "text": "comfortable with uh Cecil who's just kind of doesn't give a [ __ ] about anything. Just lays there. Uh Ram, he's getting close to petting Ram, but Ram still is in a place where he like freaks out a little bit. He's like, \"Oh god. [Music] That's mkingly. That's not funny. First warning. He didn't say [ __ ] He didn't say [ __ ] What did Murkingly [ __ ] say? He said he's a milk mommy yet. The mommies. Two mommies. Eat two mommies. Tommy ends. That has a graphic movie, you know. They [ __ ] a lot in that. Yeah, I liked it. Oh yeah, I loved it. What was it? Must have been like 14 when that came out. Oh, probably 200 like I don't know question. I'll look it up. is the name of the movie. Unique technique for those of you that like your andor. Who's the woman in that? I can't remember actually. I can't either. Man, that's a reveal. You know, when they bang each other. No, when it's like when he says he told him about that being I I'll be real I don't remember the movie that well. He [ __ ]",
            "start": 3386.24
        },
        {
            "text": "I can't either. Man, that's a reveal. You know, when they bang each other. No, when it's like when he says he told him about that being I I'll be real I don't remember the movie that well. He [ __ ] his mom. Oh, that was that's what that's the name of the movie. And your mom, too. Yep. acquired. Dark S. That woman was in Pan's Labyrinth. Equipping dossier. I never put that together before. Wait, who's mom? [Music] Nightmare. Yes. Oh, I'm a nightmare skin guy. Sick. Let's take it for a spin. Sick. All right. So, I got to go forward here. Oh, down below me. Ah. I don't like the TV. Every time I open up YouTube to watch like a little clip or something. Yeah, it it's like, \"Oh, do you want to connect to the living room TV?\" It's like, \"No, this is I'm trying to see this video Cool Greg sent me.\" You know, Kevin told Tim told me a great story about you yesterday. Yeah. That with your PSP going into your PSP to fix people's TVs. I love doing I miss that Kevin story. So guys, as you know,",
            "start": 3471.12
        },
        {
            "text": "me.\" You know, Kevin told Tim told me a great story about you yesterday. Yeah. That with your PSP going into your PSP to fix people's TVs. I love doing I miss that Kevin story. So guys, as you know, the PlayStation Portable was a a hack device, you know, like you could custom firmware was all the rave. It also had an IR blaster on the top, which means with the right program, you could you you could install a universal TV remote. Uh, and I would I I loved going to restaurants and being like, \"Hold on a second. Let me pull on my PSP. What is that? What is that?\" That's Sony. Okay, put it in the PSP and then just fixing all the settings on the TV that like someone just put up and never even thought about it, you know? Like who just buys a TV and then like doesn't think about? So many people. Those settings. So many. Oh my god. That's what restaurants do. It should just be illegal. It really should be. But I would go in there, change the aspect ratio so it looked right. Remove the",
            "start": 3581.68
        },
        {
            "text": "people. Those settings. So many. Oh my god. That's what restaurants do. It should just be illegal. It really should be. But I would go in there, change the aspect ratio so it looked right. Remove the cropping if it was there. Motion smoothing wasn't a thing at the time. It was one of my favorite things to do. Set the time on there. Oh, I'd have such a blast. Did he just tell you that off hand? I forget why we were talking about it. I think it was on the like when we did the Subway Surfer podcast where we played Subway Surfers but then kind of just did a podcast. Uh I don't know how we got on that subject but of True Motion. Oh no. Uh, Greg was talking about the PSPs. He wanted to know where all of his past PSPs were that he left at IGN and um he texted P. Pair respond. Um, yeah, it was a very negative response. Oh, no. In the best possible way. They threw them all out. Probably made Alexio do it, too. Well, you got to make your you got to make the sweetest boy do the worst [ __ ] to",
            "start": 3634.8
        },
        {
            "text": "very negative response. Oh, no. In the best possible way. They threw them all out. Probably made Alexio do it, too. Well, you got to make your you got to make the sweetest boy do the worst [ __ ] to corrupt him. God, I miss him. This makes so much more sense. They just said you were fixing TVs with PSPs. Oh, I mean, but that is what I was doing. Yeah, the IR blaster allowed you to I mean, it was fun cuz it was a little bit of a mini game where you'd be like, \"All right, it's a Magnavox, but let's see which one of these versions of controllers is the right one.\" Mhm. And you'd kind of cycle through them and then like tab to see if you could change the volume. And once you got that, you were like menu button, hit the settings. It's thankless work, but it needs to be done. Someone had to do it. I heard I heard before Tim was an intern at IG, he was on the side of good. Uh, he was I corrupted him. I made him drink. I remember that. He really didn't want to. No, he did not want to. He'd",
            "start": 3691.36
        },
        {
            "text": "it. I heard I heard before Tim was an intern at IG, he was on the side of good. Uh, he was I corrupted him. I made him drink. I remember that. He really didn't want to. No, he did not want to. He'd he'd come to hang out with me and be like, \"This Nick guy, I don't know.\" He says, \"I have to lose my virginity, too.\" Yeah. I was like, \"You have to touch your vagina at one point in your life.\" Mhm. And he was like, \"I don't know, man. I don't think so.\" People He's like, \"Nick, people don't do that anymore.\" I was like, \"I think they do.\" Yeah. I kept I think people still enjoy touching vaginas and peees. And he's like, \"No, dude. I don't think we're going to do that anymore. And then he laughed. Yeah. And I I mean, jokes on me, birth rates are down. Tim was right. Nobody touches vaginas anymore. Mercury Lee, when's the last vagina you touched? Jesus Christ. Please don't answer in the chat. Immediately or you're bad. You made me drink something and it made me forget. Oh, nobody said",
            "start": 3748.56
        },
        {
            "text": "anymore. Mercury Lee, when's the last vagina you touched? Jesus Christ. Please don't answer in the chat. Immediately or you're bad. You made me drink something and it made me forget. Oh, nobody said that. Yeah, the bad times. To the revolution. Look at my Doomslayer costume. Sick. I hate that. I'm like, you know, I bet you they have a dongle that I could buy to stick on the bottom of my phone to make it an IR blaster. Probably. And then there's probably a universal remote app. Are they supposed to be saying stuff? Probably. But you also couldn't hear anything. No, I can't hear [ __ ] I think some of the sound effects are just like off. Cuz even the menu sound effects aren't working. Like when I upgrade stuff, it's not giving me anything. Oh man. Two years ago. Two years now. I don't know what that means. Ah. That might have been why we didn't use those cables. What do you Oh, really? Cuz well, no, cuz then No, cuz then you would you would hear it. Yeah, maybe. Although I am also I",
            "start": 3798.4
        },
        {
            "text": "what that means. Ah. That might have been why we didn't use those cables. What do you Oh, really? Cuz well, no, cuz then No, cuz then you would you would hear it. Yeah, maybe. Although I am also I swapped my cable out. Swap back. I'm going to swap. Swap it back and see if it fixes it. Dad, it I'm going to try the same thing. Well, no. Why? Why? Like, we'll both try it. We'll both try it together. No, cuz then I'm going to come back and I'm going have to wait for you. We'll both try it together. Why are you moving the screen? Cuz my cable's right here. Right here. I don't know. Did I clear it? Didn't work. [Music] Where's this come from? That's interesting. Chad, did you hear the talking? You guys are also There's definitely supposed to be sound effects here. Well, it just got way louder. Holy [ __ ] it's so loud. They're here. Yeah, they're supposed to be talking here. Oh, yeah. They're definitely talking. Yeah, I can hear them talking now with that. Yeah, so that's why we swapped",
            "start": 3861.16
        },
        {
            "text": "Holy [ __ ] it's so loud. They're here. Yeah, they're supposed to be talking here. Oh, yeah. They're definitely talking. Yeah, I can hear them talking now with that. Yeah, so that's why we swapped those cables to That makes total sense. Yeah, cuz one of the channels isn't coming through. You're going to have to lower the gain before you do that. So loud. I don't think it worked, though. That's not Didn't I do this? It's this cable that's right here, right? Uh let me see. This XLR cable is Yeah, it should be right there. It didn't work though. Did you plug in the other side? Uh it's still It looks like it's still plugged in. No, it's definitely not. Uh where would it be? Where does it have come from? Just lay Yeah. See? Oh, I see. Yeah, you swap them. That's a bummer, guys. The audio sounds so much better. I'm back to static now. I can hear in the background. Sounds exactly the same to me. That's just your machine doing something weird cuz it sounds fine here. Like there's doesn't seem",
            "start": 3919.44
        },
        {
            "text": "so much better. I'm back to static now. I can hear in the background. Sounds exactly the same to me. That's just your machine doing something weird cuz it sounds fine here. Like there's doesn't seem to be a dist. Me and Mike are crazy. Yeah, but mine and Andy's machines don't do that. I don't get that weird static. Like his static's really bad on there. And I think it's just because something between the computer and that board is not correct as far as level. You should check the levels on this versus that cuz this sounds fine. I'll look into that. Look into it. Oh, I'm about to [ __ ] these guys up. I mean, it's it's not bad. It's just that that's much better. I can hear the gun sound effects now. I was like, \"Wow, this game got real quiet.\" I love Why would you have told me? Well, I didn't It didn't really occur to me until purple bar first until they started talking. But I think chat could hear it. Yeah, they could hear it cuz it's streaming to them. It's just we lost a channel.",
            "start": 3962.96
        },
        {
            "text": "It didn't really occur to me until purple bar first until they started talking. But I think chat could hear it. Yeah, they could hear it cuz it's streaming to them. It's just we lost a channel. Yeah. Yeah. Yeah. Yeah. So, it's just Oh, it's so much better. Maybe it's just not stereo. No, I mean cuz now it's combining the stereo, right? It was just missing a channel. This doesn't make any sense. This [ __ ] makes me mad. Yeah, chat, we know you heard the sound effects. Chat, did you hear the sound? You know, they're always asking. They're always asking for us. They heard everything. You know, why do they Why can't they help us out? I know we're here to entertain them, but also like like help us out. Kevin, are you redlining your headset? No, I would never do that. I have I mean, I have an issue with hearing. So, yeah, it's a little bit louder. If only Kevin still had his PSP to fix this. God, it was so bad. A Google IR blaster for USBC U S C I R. I just get one of the little dolphin",
            "start": 4010.72
        },
        {
            "text": "issue with hearing. So, yeah, it's a little bit louder. If only Kevin still had his PSP to fix this. God, it was so bad. A Google IR blaster for USBC U S C I R. I just get one of the little dolphin things like you know what I what I'm talking about when I say one of them dolphin things. Whoa. IR remote app that supports USBC IR blaster. something. The flipper. Yes, I meant the flipper. I figured you I mean like that's what it's for, right? Stuff like this. Oh, that's why we switched them. That's pretty funny. Oh, and I bet so much better with this audio. I bet you that's also why we're not hearing the static. That channel is just not being included. Maybe. Yeah, that makes sense, actually. It's funny you say I can run the whole studio with a PSP. Like I there's a lot of the studio that can be controlled from an iPad. Like I think you would think a shocking [Music] amount. It does look like Nick's wearing a chain. You know what I often fantasize about? Nick, give me your [ __ ] heart.",
            "start": 4060.84
        },
        {
            "text": "be controlled from an iPad. Like I think you would think a shocking [Music] amount. It does look like Nick's wearing a chain. You know what I often fantasize about? Nick, give me your [ __ ] heart. Yeah, rip that [ __ ] out. Yes, maximum ammo. I didn't know that was a thing. Oh, look at that. Sick. Look at that gold. Shutting down the studio for a week and redoing all the wiring. Think about it so often. Do it. I'll take a week off. I'll go to Bora Bora. Yeah, my buddy's going to Bora Bora soon. Where is Bora Bora? other side of the world. Cool. That's too far. Yeah. I missed one [ __ ] secret [ __ ] You stupid son of a [ __ ] [ __ ] And a lot of gold. [ __ ] Thanks. Yeah, Trey. That was a fun one. That was fun. You know what, Kevin? This is a perfect time for me to take a break to go evacuate my bladder. Jesus Christ. All right. Thank you. Please run an ad for that. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we",
            "start": 4206.32
        },
        {
            "text": "my bladder. Jesus Christ. All right. Thank you. Please run an ad for that. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep, and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and I'm loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional",
            "start": 4313.28
        },
        {
            "text": "100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com, promo code kind of funny for 20% off. I tell you what, I had a big old drink of water right as the counter was going down to zero, and it's like I knew I was going to be talking. Why wouldn't I just have had the water immediately after? You know, welcome to You're in town. You got to pay to pee just like average John. And if you if you're if you're hiding Do I get this? How do I get this cool skin? If you're hiding your pee, they throw you off the cliff. You go to you're in town, which is off the cliff. Oh, that's so sad. That's why you were on a cliff and then there was what looked like a just lake of pee. That's",
            "start": 4361.6
        },
        {
            "text": "pee, they throw you off the cliff. You go to you're in town, which is off the cliff. Oh, that's so sad. That's why you were on a cliff and then there was what looked like a just lake of pee. That's where my joke was. It's a good joke. Yeah. I don't quite get it, but I'm excited that thoroughly, dude. The best jokes are like that. Welcome to my world. Yeah. Oh, man. Had a fun night last night. Um Oh, yeah. My one of uh That's right. Yeah. Comic hit me up last minute to go film for Frankie Kenyonz um who is a headliner who is getting ready for his a special that he's filming with uh produced by Ali Wong next week. Oh, that's cool. And so it was cool to see him work. He just wanted me he just wanted someone to come like so just quickly get it so we could review some jokes he was doing. I was like I'm happy to do that. It's super fun. But getting to watch him work as he's like at the tail end of sharpening like that last little tweaking on the special I was like damn this is [ __ ] good.",
            "start": 4415.12
        },
        {
            "text": "like I'm happy to do that. It's super fun. But getting to watch him work as he's like at the tail end of sharpening like that last little tweaking on the special I was like damn this is [ __ ] good. So, if you guys have never heard of Frankie, follow him on Instagram. He's really, really good. And his new special will come out hopefully in the next month. It's [ __ ] hilarious. See, now I have some issue with the game. Yeah. Why don't I just keep playing? Why do I have to go back to this thing? I didn't know that. Okay. I thought that was going to be your issue. I was going to agree with you. No, no. I mean, I agree with you. That seems dumb. What the [ __ ] It's like they're trying to like, you know, have you take breaks? No. Uh, Cameron Kennedy is his last name was King Kingon. Yonis. Q U I N. Yeah. O N E S, I believe is how you spell it. I'm bad at that. You show me one of these good spellers. No, no, no. I just uh I typed his name a bunch of times last night. Huh? In the files",
            "start": 4465.84
        },
        {
            "text": "Q U I N. Yeah. O N E S, I believe is how you spell it. I'm bad at that. You show me one of these good spellers. No, no, no. I just uh I typed his name a bunch of times last night. Huh? In the files that I sent. Look, they got a bunch of little swords on the walls. Pretty cool. My name is Andy Cortez. I will dress like this for Halloween. And Nick will dress like this. Yeah, he's [ __ ] funny. Jimmy Buffett did his own sound checks, which is what's interesting. Did his own sound checks? Why wouldn't he do his own sound checks? Well, usually I think you can send an underling, right? Yeah, but if you want to like hear [ __ ] I would do my own sound checks if I was a musician. I always get scared when musicians are doing sound checks cuz they're going to electrocute themselves. What? No, because like you're sitting there and you know you get levels and stuff and like sometimes your musician friend's like louder. You're like it's as high as it goes. I got no more gain. I got no more gain.",
            "start": 4507.36
        },
        {
            "text": "like you're sitting there and you know you get levels and stuff and like sometimes your musician friend's like louder. You're like it's as high as it goes. I got no more gain. I got no more gain. Oh. Uh, so Stone 420 says he's funny AF. That's good. I'm glad I'm I'm It's funny because I don't know who people know, but Frankie's been on TV and he's a really nice guy. He's just so [ __ ] funny. And you know he's funny cuz I was sitting in the room with like two other comics. It was cops. It's a big room. And I was like he was crushing. But I was watching the comics too and they were laughing their asses off and I was like yeah it's fun to watch someone who's that good like 20 years into the game or however long he's been doing it for. It was usually the PA that did that. Only the indie dudes and the humble dudes that ever did the sound checks. What's this? I was just reading more of Demon Hacker's comments about sound checks. Sound is always so elusive to me. I've never been into it",
            "start": 4555.04
        },
        {
            "text": "and the humble dudes that ever did the sound checks. What's this? I was just reading more of Demon Hacker's comments about sound checks. Sound is always so elusive to me. I've never been into it enough to really try to get good at sound stuff. I'll say it pisses me the [ __ ] off. I hate it. Great. You change one cable, suddenly you don't get any of the dialogue. Why? Why is that? What the [ __ ] is that about? The [ __ ] dialogue. God damn it. It makes me mad. So angry. and you plug in an XLR cable into a mini mix board and it just doesn't do stereo and it's like why? Why? I'm getting so worked up, Nick. I get worked up. I'm all heated. Oh, Kevin. No, Kevin. I know. God, my hands are burn. Sweaty. No, they get hot when I get mad sometimes. And it's like, okay, so is the solution maybe do I get a 3.5 mm cord that splits into two uh quarter inch? Is does that work like that? You know, maybe it's great, Chad. The thing is most like audio people are just weird, you know? Like you're",
            "start": 4608.88
        },
        {
            "text": "do I get a 3.5 mm cord that splits into two uh quarter inch? Is does that work like that? You know, maybe it's great, Chad. The thing is most like audio people are just weird, you know? Like you're really into pro audio, you're just a weirdo. I've had to learn so much pro audio stuff, I hate it. and then replicating it like two years later. It's like, \"Oh, cool, cool, cool, cool.\" Oh, what is this thing? This is new. I don't think that thing on the top. I mean, this hit me a lot. I like that you're like, \"Oh, if it's behind me, it can't hurt me.\" Yeah, exactly. I don't think that's on this game. Well, you I It's interesting cuz I didn't realize that you could increase the projectile speed without without the like the damage that it would create. So, that would be interesting cuz everything feels like it's a little slow right now, which I kind of like cuz it's not overwhelming. Mhm. But it's it's cool that you can tweak the game to that degree. Yeah. Yeah. It's really cool. Uh, Cooper,",
            "start": 4661.04
        },
        {
            "text": "feels like it's a little slow right now, which I kind of like cuz it's not overwhelming. Mhm. But it's it's cool that you can tweak the game to that degree. Yeah. Yeah. It's really cool. Uh, Cooper, I have a Mackie Mix 5 and for whatever reason, we got a Mackie Mix 5 10 or ner. The uh what quarter inch audio cable on channel 2 is not getting stereo and it's been an issue for a long time and it's like can can you get a 3.5 mm that like goes to I don't know two quarter inch that doesn't make any sense, right? It just makes me mad. Cooper, why why wouldn't it work? Cooper, let it work. Let that man work. That was a That was ballsy. What did I just do? Oh, I get up there. We're going to try to make it. Yeah, it's an audio splitter. I want to know if there's any like um pro video guys in the chat. I wonder if anyone has saw the FX2 announcement and what your thoughts are about that. I'm trying to figure out sound issues. Why are you moving over to video? We got to do it. Oh, I got a new",
            "start": 4718.32
        },
        {
            "text": "chat. I wonder if anyone has saw the FX2 announcement and what your thoughts are about that. I'm trying to figure out sound issues. Why are you moving over to video? We got to do it. Oh, I got a new gun. Kevin, look. Look, Kevin. Look. You haven't even upgraded the impaler yet. Yeah. Who was it that was pissing me? Evan. I'm sorry, Evan. I'm sorry, Miss Evan. Oh, this makes more sense. Oh, that looks nice. Cool. Shoot a big old slug. Yeah, use it. Close range could be risky. Cool. [ __ ] me. [ __ ] me. [ __ ] me. That's what this So, Cooper, I'm trying to learn about balanced and unbalanced. TRS versus TRRS. Is that what we're talking about? Sure. You know, sound. I'll never hear the end of it. Oh, this looks [ __ ] cool. Or is it TS versus TRF? I've heard uh neither of these terms, so I am useless. It's the, you know, Yeah. TRS versus TS. Should I be using a TRS cable, Team Hacker? I don't know. That's what I'm saying. And like googling it doesn't just give me the answer. Oh [ __ ]",
            "start": 4780.32
        },
        {
            "text": "am useless. It's the, you know, Yeah. TRS versus TS. Should I be using a TRS cable, Team Hacker? I don't know. That's what I'm saying. And like googling it doesn't just give me the answer. Oh [ __ ] Two cal. No [ __ ] So stone. That's awesome. Two black rings. All right. Hooper's confirming everything that I think I know. TS usually for mono TRS for stereo. Great. And that's what we have here. the Wave XLR 3.5 millimeter into our little Mackie Mix 5. Why? Why am I losing my stereo? You Google it to find out for me, Cooper. Cuz I've been googling all morning. I thought TRS cable was war balance. Yeah, that's what we said, right? TRSK was Roblox. Yep, Robux. After you take those out, we'll be clear to get one of those. and TR RS that carries the input signal too, right? So that's the one with the mic. So on like 3.5 mm, the TRRS is the ones with three stripes. Two stripes. Two stripes. No, three. One of those. We've lost Nick. No, no. I'm listening. I'm trying to I'm trying to It's",
            "start": 4855.28
        },
        {
            "text": "with the mic. So on like 3.5 mm, the TRRS is the ones with three stripes. Two stripes. Two stripes. No, three. One of those. We've lost Nick. No, no. I'm listening. I'm trying to I'm trying to It's interesting. It's cool. He sounds like Mike. You fix it. I'm just at a lot. What does GP chat GPT say? That's How often you using CH GTB these days? Uh trying to build that thing that I was trying to build for a while. Oh, you using that? Yeah, I think I got to a good place, but it turns out the one we use seems to work fine as long as you don't close it. But I like it. I I mostly use it for coding though. Kool was saying he was using it to plan a trip to Ireland and he really liked it. He was like he was great. That's really cool. He would like look up places to eat while he was there. That's pretty rad, man. Chad GP, you know, I have become a little addicted, I will say, to the AI summary on Google lately. Oh, I never look at it. Really? I scares me. You know, it's it's weird to say, but",
            "start": 4925.28
        },
        {
            "text": "pretty rad, man. Chad GP, you know, I have become a little addicted, I will say, to the AI summary on Google lately. Oh, I never look at it. Really? I scares me. You know, it's it's weird to say, but it's just like, you know what it is? It's the language of how they how they broach it cuz it's not it's it's not trying to be egotistical. It's like, you know, some people say this. And I was like, you know what? if you say that, I trust you more as opposed to that's crazy. They're like the consensus is this. And I was like, oh, okay. So, you're not telling me like fake news. This is just kind of what a bunch of sites have said. Yeah, exactly. You know, my buddy Rod says, well, this one guy, it's like reading a Reddit throw where like you just scroll through until you find the answer you want and then that's that's the fact. Actually, it's the opposite of what I just said. I love I love finding an obscure thing that I'm trying to work on on like Reddit. I'm so obsessed with Reddit. It's",
            "start": 4981.36
        },
        {
            "text": "and then that's that's the fact. Actually, it's the opposite of what I just said. I love I love finding an obscure thing that I'm trying to work on on like Reddit. I'm so obsessed with Reddit. It's It's the best. I'm so obsessed with one specific community like two specific communities on Reddit. The watch community. Uh one of them is a watch community. Yeah, that's I don't go to Reddit for that. I go to like old school forums for for any watch talk cuz I if you're if you're reading about a watch and you can actually understand the website you're reading it on, are you really a watch fan? It has to be some [ __ ] like forum that was made in like 2002 that doesn't really work well on mobile. Uh, no. I I like Sony cameras. There's a Sony camera forum that I read that specifically the FX3. That's really really interesting. I've never really been a part of a community like that before. I don't really post, but but reading over and over again, it's really cool to see kind of people's",
            "start": 5026.4
        },
        {
            "text": "That's really really interesting. I've never really been a part of a community like that before. I don't really post, but but reading over and over again, it's really cool to see kind of people's thought processes and actually being on the cutting edge and then getting alerts for [ __ ] like new cameras and stuff like that. That's pretty fun. So, have you seen any footage from that camera? Uh, yeah. It's it's it's Sony's in an interesting space right now with some of their Yes, I got it. Yeah. With their uh like pro entry- level pro cinema lines where people are criticizing a lot. They were very much on cutting edge about four years ago with the FX3. Everyone's like this is one of the greatest cameras ever made and they haven't really in they haven't really upgraded that in a while cuz I haven't needed to. Um don't don't pick what's fix ain't broke. But go back up there actually. Um, but now they've been doing an interesting thing where they've been recycling parts into new cameras,",
            "start": 5070.16
        },
        {
            "text": "haven't needed to. Um don't don't pick what's fix ain't broke. But go back up there actually. Um, but now they've been doing an interesting thing where they've been recycling parts into new cameras, which I'm not used to. So, they just came out with the FX2, which is an older sensor with a newer body, and everyone's like they're calling them uh sort of like uh part bin cameras where like you looked at the the the extra parts he had left over like, we can cobble a camera out of this, but now they're selling it for $2,700. You're like, oh, kind of crazy to do that. So, people are giving them a lot of [ __ ] because they used to be cutting edge. Now, Lumix apparently is pulling ahead with everything, which is pretty cool to see. I'm I don't really have a I just go for this. I don't really have a um you know, an allegiance to one or the other. I used to be a cannon guy and then when Blackmagic's when we kicked over to Blackmagics and I really kind of fell in love with them, I was like,",
            "start": 5108.4
        },
        {
            "text": "have a um you know, an allegiance to one or the other. I used to be a cannon guy and then when Blackmagic's when we kicked over to Blackmagics and I really kind of fell in love with them, I was like, \"Oh, this has really opened my world to just use the right camera for the right tool, like for the right job.\" Right. Wow, that fire really [ __ ] me up. Yeah. Um the color balance issue with the cannons always upset me. Oh, you got a big bad boy here. Like we were never able to get the C100 and C, you know. I think I figured that out eventually all too late. Yeah. Yeah. It was a It was a 10 bit versus an 8 bit color color profile. Oh, that I just didn't know enough about cameras to really understand that that would be that big of a difference between 10 and 8 bit look. Long story short, folks, if you're going to shoot in a studio, buy all the same camera. All the same cameras. It's going to make your life way easier every way. I should have gone with honestly if I had the two or I would",
            "start": 5147.28
        },
        {
            "text": "if you're going to shoot in a studio, buy all the same camera. All the same cameras. It's going to make your life way easier every way. I should have gone with honestly if I had the two or I would have gone with all like original C300's. Yeah. I mean that's really expensive though. No, no, no. The original ones before the the twos we bought a two for the old studio. I should have gone with the cuz I wanted a 4K camera to shoot like stuff around which is nice. It ended up working out. But if I had to do over again, I would have just bought used C300's original and just use those for the studio cuz that's I I still to this day I think that's one of my favorite looking cameras ever made. I never liked the two. I just like the first iteration of it. But you won't buy something that ain't new. Uh I will now. Not cameras, cuz who the hell know? Like a camera could be on its like last like death throws and you would never know it, right? Um I guess you can sort of look at the uh you can't",
            "start": 5191.52
        },
        {
            "text": "Uh I will now. Not cameras, cuz who the hell know? Like a camera could be on its like last like death throws and you would never know it, right? Um I guess you can sort of look at the uh you can't actually look at the like, you know, the life cycle of how long it's been filming for, but um lenses I will buy used now. I trust the used lenses now. I bought a few lenses used from like uh some of the reputable sites. It's pretty nice actually. It's not bad. But I don't we don't do a lot of client work anymore, so it's not you don't really need [ __ ] that's like 100 100%. Not that we ever really did, but you know, Kevin, what channel are you taking out of the Mackie mixer? That's having trouble. Channel out of the Mackie. No, no, no. All right. So, I messed up. I'm going Wave XLR 3.5 millimeter to input one XLR and I'm plugged into the phone. The headphones [Music] jack. God, audio is such a crazy science. Sucks. It really does. Video codecs are so much easier to understand. I mean, just",
            "start": 5233.44
        },
        {
            "text": "to input one XLR and I'm plugged into the phone. The headphones [Music] jack. God, audio is such a crazy science. Sucks. It really does. Video codecs are so much easier to understand. I mean, just for the most part, you don't have to, you know, anymore. Cuz like that's a premier problem. They'll figure it out eventually. Uhhuh. That's not a me problem. They got a plug in that'll just make it work. Figure it out. Where is the XLR coming out of that goes into the mix? That goes the Wave XLR. It's a That's a little box Elgato makes. Wave XLR. I love that I'm now taking advice. Yesterday me I was given technical advice. Now I'm just taking it. That's how it goes. Sometimes you're the giver, sometimes you're the taker. Indeed. Have you heard of the Nubia Z70s? The phone that has a 35 mm lens. What? What the [ __ ] That's awesome. I'm googling it. It's just a camera. It's just like an old school point. Yeah. Kind of with a phone just attached to it. Doing recall. One second. Oh, I see you.",
            "start": 5284.44
        },
        {
            "text": "What? What the [ __ ] That's awesome. I'm googling it. It's just a camera. It's just like an old school point. Yeah. Kind of with a phone just attached to it. Doing recall. One second. Oh, I see you. I was like, where's this other guy? I mean, is that really a 35 mm lens on there? It looks adorable. That's cute as [ __ ] Oh, wait. No, maybe I'm looking at the wrong one. It's the Ultra. God, that flail. Oh, me fle. Oh man, this classic look with the silver and black is so adorable. Nick, one of my biggest regrets is buying my X-T2 camera Fujifilm. Uhhuh. And not getting the silver and black instead of the all black. No, you got to go all black. Oh, the silver and black is so classy looking, especially for that camera. That's so nostalgic. Okay, so now Cooper's doing bad research, you know what I mean? And I don't want to get mad at him. I don't want to get mad at him. According to the Elgato website, Brennon's really into Leica cameras now. Oh, yeah. I mean, yeah, I know. He's got",
            "start": 5359.84
        },
        {
            "text": "what I mean? And I don't want to get mad at him. I don't want to get mad at him. According to the Elgato website, Brennon's really into Leica cameras now. Oh, yeah. I mean, yeah, I know. He's got They've gotten a little bit cheaper recently. No, he's he's not the one he's looking at. He tells me what he Well, he doesn't have like the top line. Top of line. Yeah. I mean, let's be But he was like, \"These things are dope.\" And I was like, \"Oh man, that would be I'd have to know how to actually use the camera then if that was You really do. You can't buy a camera that although they shoot raw, right? It's less that and more the actual like photos are is not video. It's hard. It's it's a whole different discipline. And you have to spend as much time doing video as you do doing photos to like or vice versa to really master it. I can't take a good picture to save my life.\" I had a lot of fun. So, uh, right before I got married, I bought the X-T2. Yeah. And I had a lot of fun cuz I like just",
            "start": 5453.6
        },
        {
            "text": "vice versa to really master it. I can't take a good picture to save my life.\" I had a lot of fun. So, uh, right before I got married, I bought the X-T2. Yeah. And I had a lot of fun cuz I like just was like, I'm going to commit to like taking this everywhere I go, taking photos and stuff so that when I go on my honeymoon, I'll know how to use the camera and be really comfortable. And you took all the pictures on your phone. No. No. No. I I did them all on my camera. It was fun. And that was that was a fun little like exercise that I did. See, I've always wanted to learn like Sony cameras, for instance. I've always wanted to get like, you know, an alpha, something decent that takes good pictures and try to force myself to learn the workflow and I always get frustrated and just end up taking pictures on my phone cuz I wanted to do like um you know slightly more high-end pictures when I do comedy shows. It's kind of fun. Um and I just go it's just too frustrating. Um I go back to my",
            "start": 5496.88
        },
        {
            "text": "pictures on my phone cuz I wanted to do like um you know slightly more high-end pictures when I do comedy shows. It's kind of fun. Um and I just go it's just too frustrating. Um I go back to my comfort zone which is like video which sounds crazy but I mean that makes sense. The image on the Elgato site says XLR input. Connect your microphone. Yeah. So, there's an XLR input. There's a USB type-C for power. And then in the middle of both of those guys, there's a little 3.5 mm uh audio jack. Yeah. Some more shields. Yeah. Get it, Nick. Maximum armor increase. So, yeah, we go Wave XLR out with that little 3.5 mm headphone jack. I really didn't get into our Mac Mackie input one via 3.5 mm XLR and then we add our audio XR 18 ox outs. The usage of the XLR was confusing me. That makes sense, man. That makes sense. It's not confusing. It's quart inch. I'd say that's I don't either. I don't either. I don't get it. TR RS TS TR RS not used in professional video. I don't trust it. Actually, it is",
            "start": 5539.12
        },
        {
            "text": "That makes sense. It's not confusing. It's quart inch. I'd say that's I don't either. I don't either. I don't get it. TR RS TS TR RS not used in professional video. I don't trust it. Actually, it is in like studios. A lot of professional audio but not video. Well, I mean, yeah, if you're a cameraman, you you got you plug it into the camera, right? XLR. Is it XLR? Yeah, you're using XLR on cameras. Yeah, you're right. Yeah. Well, I'll be right back. This whole thing. Yeah, go for it. Cooper, I'll be right back. Cooper. Oh, there's like a king up there. Uh, Cooper, just to add more confusion to this, I am saying there's a 3.5 mm XL 2 XLR that we use from the Wave XLR to the thing. Uh, Cooper, not to add more confusion to, but when I said I was going to pee earlier, I didn't actually pee. You got to be [ __ ] me. You just went out there and had fun. You want to run the ad one more time? Nah, you're fine. I don't pee. I'm good. I'll be right back. I feel great. Bang. Oh, I should have not",
            "start": 5605.12
        },
        {
            "text": "got to be [ __ ] me. You just went out there and had fun. You want to run the ad one more time? Nah, you're fine. I don't pee. I'm good. I'll be right back. I feel great. Bang. Oh, I should have not have done that. There was something above that. I swear to God. Oh well. Updating local map. Destroy hell cannons. Destroyed. There was nothing about that. Thank you, Evan. I thought I saw something green. I didn't want you to get disappointed with me again, girl. I don't use your impaler. Impaler. I barely knew her. Twitch Prime. Sick. Give me my dossier. What was that for? See? X. Oh. Oh. Ow. Sick. Who wants to party? Is it me? Does daddy want to party? Ah, I'm a god in this game. A god. Ah. Ah. Oh, I hate this. Oh man. Oh no, no, no. Negative. That's so cool. That's so fun. I don't think I have a key for this yet. Nope. Secret key required. You Uh, Doom Slayer. What I do? Wow. already been here. Let's go this way. Yes. This is for you, chat. This is for you, Evan. It sucked. I sucked.",
            "start": 5665.12
        },
        {
            "text": "have a key for this yet. Nope. Secret key required. You Uh, Doom Slayer. What I do? Wow. already been here. Let's go this way. Yes. This is for you, chat. This is for you, Evan. It sucked. I sucked. Cannonball. Oh, BB's my toy. Where's my key? How do I get you? Jump. Nope. It's right there. Got it. Okay, cool. So, we're in the right space, guys. I'm feeling great about this. Couldn't feel better. Nothing bad can come of this right here. Oh, I don't even need it. Oh, man. I want more shields. Puzzle time. The green goo. That's such a cool I love that. I love how simple and yet oddly satisfying all of the [ __ ] you can do with the shield is. It's just very very smart that they're like, \"Your shield can do this, but let me you know you we don't want to give you too many buttons.\" Very very cool. Ah. [Music] Break yourself, son. I just broke that dude. I didn't even think I hit. God, I'm good at this video game. Ah, there's guys I got lit on by fire. Well, clearly that was [Music] wrong.",
            "start": 5796.0
        },
        {
            "text": "Ah. [Music] Break yourself, son. I just broke that dude. I didn't even think I hit. God, I'm good at this video game. Ah, there's guys I got lit on by fire. Well, clearly that was [Music] wrong. What the What the deuce did that do? I guess. Oh, there it is. Okay, cool. I was like, it's got to be here. I was like, this is good level design. It's got to be here. Just making sure there's nothing else up here. Let's get a quick little look on the map. Ah, there is. Look at that, Evan. See, you've trained me well. Get those upgrades. Oh, he just died. Did he just jump? Where did he go? Oh, he's right there. Look, he's a fast mover. We got a fast mover, Zeke. Yes. Let me into your hallway. Bubble bubble bubble bubble bubble. Something's going to go down in here. It's going to be nasty. They're going to be lots of [ __ ] Gearing up for a [Music] fight. Oh, what is it? Oh, it's this guy. Let's have some fun. Heat. Heat. Cooper's gone down a rabbit hole. Oh my god, there's so much happening",
            "start": 5973.4
        },
        {
            "text": "going to be lots of [ __ ] Gearing up for a [Music] fight. Oh, what is it? Oh, it's this guy. Let's have some fun. Heat. Heat. Cooper's gone down a rabbit hole. Oh my god, there's so much happening from here. Yeah, it's a lot. It's a lot. You're doing great, though. I'm [ __ ] crushing this. Nope. This guy's fast. Furious, if it was easy, I would have solved it. You know what I [Applause] mean? The core issue I could see would be the 1/8 in connector isn't balanced. Oh [ __ ] Big boy. It definitely is balanced. It's got two lines on it. Yeah, it would be much harder to tell if the XLR is in balance. I wish it set it on there. Uh, professional audio video cable. Did we Kevin's review on Tomorrow War? What the hell is Tomorrow War? Why you guys talking about that so much? Is it the movie Tomorrow War? Yeah, we were talking about earlier. It's the hot new thing from 5 years ago. H Where's the now? Cooper saying e in 1/8 in which is 3.5 mm but like I don't I don't like that we're",
            "start": 6147.72
        },
        {
            "text": "movie Tomorrow War? Yeah, we were talking about earlier. It's the hot new thing from 5 years ago. H Where's the now? Cooper saying e in 1/8 in which is 3.5 mm but like I don't I don't like that we're converting it to I get it. See we we tried a/4 in to 1/8 in. Both are balanced XL or C. Ignore the XLR. Both are balanced but when we use that we lose I don't know channels. We we couldn't hear the dialogue. So, I guess I should just order more 3.5 mm 2 XLR. Make sure that they're balanced. Let me go to Amazon and see what I bought a long time ago. Woo! He did it. He killed it all. Crushing it, Nick. Just destroyed that. 12 minutes left on the stream. Fantastic. Time to beat the game. I'm not signing. I'm not going to. Just time to beat the game. You got it. Come on, Ruby. For Nick's headphones, it should be 3.5 mm connect, right? So, what we do is the Mackie Mix 5 headphone jack out has a converter that goes 1/4 in to 1/8 inch. And they're both balanced as far as I could tell.",
            "start": 6339.6
        },
        {
            "text": "headphones, it should be 3.5 mm connect, right? So, what we do is the Mackie Mix 5 headphone jack out has a converter that goes 1/4 in to 1/8 inch. And they're both balanced as far as I could tell. authentication. Now we go to past orders. I'm going to type in 3.5 [Music] mm. See what we get. That'd be funny if that was just the issue. Just not a balanced cable. Oh yeah, there it is. Unbalanced X TRS. Oh man. Why is this in XLR? Huh? That's our issue. I just got to buy a balanced cable. God damn it. This is why I hate audio, Nick. Me as well. Cooper, you helped Uh yeah, I'll try to see if I can buy uh here. Let me see. Mini Jack TRS. Let's go to a micro center together, Kevin. I would love that. How fun would that be? Would you rather go to a micro center or a fries electronic? Fries electronic. Really? Hands down. I don't But I don't know that I've ever been to a microenter. Although I think they're opening one up here soon somewhere. I saw Yeah, that's why it's it's on the It's on",
            "start": 6415.48
        },
        {
            "text": "Really? Hands down. I don't But I don't know that I've ever been to a microenter. Although I think they're opening one up here soon somewhere. I saw Yeah, that's why it's it's on the It's on my brain cuz I think I saw it was like San Jose or something. Yeah. here. We're balanced. Cable unbalanced. No, I need it balanced. I need balanced. There you go. $10 3.5 mm two balanced cable XLR male to 1/8 and it says mono audio. Why does it say mono audio? It should be stereo male plug. See, that's a tricky thing, Nick. It's hard to see if the XLR cable is balanced or not. That's You got to look. I like to You want to go take it harder? Is it shielded or not shielded? Oh, it has to be shielded with all these cables that we've got. We've got little power lines everywhere. It's going to plug in right next to a type-C USB that's not shielded. It's got to come up a little bit. Let's keep going up. Fud rucker. Do I get up there? This is going to make Andy so happy. This solves it. Unbalanced. Okay,",
            "start": 6541.2
        },
        {
            "text": "next to a type-C USB that's not shielded. It's got to come up a little bit. Let's keep going up. Fud rucker. Do I get up there? This is going to make Andy so happy. This solves it. Unbalanced. Okay, I got those. What do I got over here? Where do I go? Mono audio. Got to get over there still. I got to go up and in and over. Okay. So, I'm looking straight. Got to go to the left. I got to go up. Oh, I see. I see. I knew I was supposed to climb this dude. Immediately climbed him wrong. No, maybe up this way. I also don't need a 6ft cable. One foot would be fine. Mono again. Interesting. Maybe over there. I don't think we can get up there though. Sorry, Kev. Which? Let's try the other. You say wasn't balanced. I mean, they should both be balanced, right? That's why we That would keep the stereo up there. Maybe it's just up here. Don't worry about that chestn says average chuck. Don't worry about Yeah, I'm trying to get to it. How the [ __ ] He's saying don't worry about it. I'm going to",
            "start": 6618.08
        },
        {
            "text": "up there. Maybe it's just up here. Don't worry about that chestn says average chuck. Don't worry about Yeah, I'm trying to get to it. How the [ __ ] He's saying don't worry about it. I'm going to worry about it. You should worry about it. I'm angry. I think you got hit from the other side. Yeah, I thought I did too, but I couldn't get through. But it's all grayed out, right? No. Yeah, it's on the other side. How the deuce do I get up there? We're going to get this chest or die trying or just end 6 minutes left on the stream. Oh, let's upgrade something. Let's get a [ __ ] cool Oh, a shield upgrade. I don't understand. Average John says it's locked for now. Oh, it's locked for now. Yeah. This place opens up after you get the battery. That was Evan. I mean, that's cool as [ __ ] I want this. Cooper, if you send me a DM with the right cable, that'd be great. Like everything says balanced and then I read into it and it says XLR may mono audio and I don't want mono. I want stereo. I want",
            "start": 6738.76
        },
        {
            "text": "Cooper, if you send me a DM with the right cable, that'd be great. Like everything says balanced and then I read into it and it says XLR may mono audio and I don't want mono. I want stereo. I want stereo. Nick stereo. And they have ones that are dual XLR and it's like I don't want a dual XLR. I want a single XLR. Oh, that's sick. Supposed to be male. Yeah, male. You've purchased a tier that contains two upgrades. You can change which upgrade in the tier is active in the time in the dossia. Oh, that's cool as [ __ ] Yeah, there you go, Evan. I upgraded it for you. Nice. Nice. Hot potato. Use it once for us. That's cool. Uh, let me see. Hey, you have so many guns now. I know. I don't use the chain shot that much. It's too slow. Chrono spied. Use the other, says Evan. Use the other. So use this one. This the pick up impellar ammo empowers your next shot cuz chronospike sounds cool. He's saying don't use that one. Don't use it. He's saying that one's bad. I mean he didn't say that but he",
            "start": 6794.08
        },
        {
            "text": "one. This the pick up impellar ammo empowers your next shot cuz chronospike sounds cool. He's saying don't use that one. Don't use it. He's saying that one's bad. I mean he didn't say that but he did just say yes. Sounds cool though. Upgrade lock rocket launcher for sure. Oh. Oh yeah. Yeah. Apparently working. So that Oh, the launcher. All right. Well, you know what? Seems like let's let's try that real quick. So, I want this thing. Oh, that's cool. Come on. I You don't like that? You don't like this thing? Are you using the one he said not to use? Yeah. I've done the opposite of everything you'd want me to do. Yeah, you certainly have. Every single time. You certainly have. Why don't you let Kronos spike? What's the other one do? What am I dossier? You already slow down time when you parry. You can. Yeah, but I want to slow down. And then he says again, you already slow down time when you parry. Okay. Well, okay. You just asked him what it does. I was just reading the message he",
            "start": 6851.44
        },
        {
            "text": "parry. You can. Yeah, but I want to slow down. And then he says again, you already slow down time when you parry. Okay. Well, okay. You just asked him what it does. I was just reading the message he already said. He said more damage is better. Okay. More damage is better. So, how do I switch that now? Oh, [ __ ] Switch. Yeah. How do I switch that? Do I got to go back? Do I go to go to the shield to switch it? The the shrine. It said I could do it my dossier. It's just a French word. It's sexy. Go to your gun. Okay, I'm at it. How do I switch now? That switch is the gun. God, this is sick. Look how sick this looks. Go to your gun and and Uhhuh. And Evan, gun on the dossier, I think. Okay, this is the dossier, right? It's got to be here somewhere. But how am I What am I Oh, there it is. Look at that. Now go. So, this just kills. But what does it do now? So it just kills people. It just kills harder. Kills harder. That seems cool. Oh, shoot. Pick up an impaler ammo. Empowers your next",
            "start": 6902.16
        },
        {
            "text": "at that. Now go. So, this just kills. But what does it do now? So it just kills people. It just kills harder. Kills harder. That seems cool. Oh, shoot. Pick up an impaler ammo. Empowers your next shot. Oh, well that's But I'm not going to pick up the ammo too much. You know, I'm going to play around with this. The chronospike nickname impaler. Sick nickname. I'm going to play around with this. And if I'm wrong, I'll apologize to you on Monday. Evan, what's tomorrow? Friday. I'll apologize to you tomorrow. You playing more of this tomorrow? No, I don't think so, actually. Oh, okay. I think I misspoke. Um I don't know when I'm playing this game. I might never play this game again. Mhm. Wouldn't that be fun for Wouldn't that be great for Evan though if it's like, \"Dude, you never knew how cool the other thing was.\" Cuz all you have is this cool like Look at that. Come on, dude. I want that. I'm Let me get Let me get into one little scrub with someone real quick. I love that shot. Show is",
            "start": 6960.16
        },
        {
            "text": "the other thing was.\" Cuz all you have is this cool like Look at that. Come on, dude. I want that. I'm Let me get Let me get into one little scrub with someone real quick. I love that shot. Show is like, \"Tomorrow is a giant bump stream.\" It sure is. It sure is. Yeah. Uh what are we doing with them? I have no idea. But you want me to look at Cho's comments to see if he knows? Yeah, that'd be fun. Cho probably knows. I But he calendar. They're definitely right. Chacho. Chacho. Elden ring. Oh. Oh, I'm not doing that. Yeah, you're not participating that. Thank god it's too hard. There we go. I was like, where the [ __ ] am I supposed to go downtown? town. I love how much you know about your own town. That makes me happy. I think I saw it. I don't remember though. Maybe I read it. I don't like reading it. Is it probably It's a musical. No, I must have seen it. Oh [ __ ] The leader. Oh [ __ ] That was Come on. That was so nasty. You playing with the the gun the way Evan said not. Yeah, I",
            "start": 7001.44
        },
        {
            "text": "reading it. Is it probably It's a musical. No, I must have seen it. Oh [ __ ] The leader. Oh [ __ ] That was Come on. That was so nasty. You playing with the the gun the way Evan said not. Yeah, I am. You can just go into the settings right now and switch it and feel the difference. Yeah, but watch this. He likes slowing down time, Evan, cuz he's old. Okay. Well, that didn't work. In a piss play is an awful way to talk about that. [ __ ] Heat. Heat. Average John on asked, \"Will Mike be streaming from an amusement park today after this?\" Only one way to know. Keep watching this channel. Really? That'd be awesome. He did that yesterday, did you? No. Did he really? Yeah. Yeah. He went to the uh I think it was Epic the the new Universal. That's all I know. I don't know how it went. I don't know if he was just waiting in line all day, but you know, I'm sure it was a fun surprise for everyone involved. The gun is the best with the attack power mod, and you won't have ammo issues if you",
            "start": 7060.24
        },
        {
            "text": "know if he was just waiting in line all day, but you know, I'm sure it was a fun surprise for everyone involved. The gun is the best with the attack power mod, and you won't have ammo issues if you parry. Oh. Oh, okay. So, I should use that. I get you. I think you based all that off of the fact that you were good at pairing. I'm pretty okay at it. Oh, shoot. Come on, bro. Get away from me. Who did Mike go to Florida with? Uh, himself. Yeah, I think he went for a game for a game. Yeah. Evan says you're pretty good at pairing. I think it might suit your play style better. Oh. Oh, I thought I died. There's another guy. Where the [ __ ] did you come from, homie? How long you been here for? Is that the boss? Uh, there's like five bosses here. Oh. [Music] The boss is technically down there. What the [ __ ] dude? He hit him with like 40% damage already. Oh, I got his ass. It's also 4:00. We're almost there. I'm fine with it if you're fine. You don't want to go to a movie. But it's it's not a",
            "start": 7187.04
        },
        {
            "text": "the [ __ ] dude? He hit him with like 40% damage already. Oh, I got his ass. It's also 4:00. We're almost there. I'm fine with it if you're fine. You don't want to go to a movie. But it's it's not a movie you need to get early, too. So, you're good. Oh, that was sick. Oh, I cut his leg off with my shield. Yeah. Smash his heart. Give it to me. Yes. Yes. And with that chat, thank you guys so much for joining us today. Hey Evan, thank you for all your help with the game. And uh thank you to everyone else who's helping Kevin with his audio issues. We appreciate you guys so much. We appreciate the community that we've all built here together. Enjoy the rest of your evening. I'll see you guys tomorrow. A good day. Bye. Into the [Music]",
            "start": 7314.92
        }
    ]
}