{
    "id": 14153,
    "video_id": "sFVT8cqtjug",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Stephen Totilo"
    ],
    "title": "RIP Xbox Handheld (For Now) - Kinda Funny Games Daily 05.27.25",
    "description": "Go to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\nGAMESCAST - Hell Is Us\nAfter Gamescast is Karate Kid In Review\nToday, after In Review, the best souls gamers at Kinda Funny that are currently not out of town are taking on Giant Bomb in an Elden Ring Nightreign showdown. Who will score the most points? How will they score points? Tune in for some chaos at 1:30 pm PT.\nIf you’re a Kinda Funny Member:\nToday’s Gregway is about if YOU should go to SGF in person, but I’ll be recording it on the way home, so who know how long it will be.\nThank you to our Patreon Producers: Karl Jacobs, OmegaBuster, & Delaney Twining\n\n00:00:00 - Start\n00:07:00 - Housekeeping\nThe Roper Report   -\n00:09:25 - Xbox’s Handheld Is DEAD (For Now), Jez Corden @ Windows Central\n00:26:55 - Speaking of Microsoft: Video Game Workers Reach Historic Tentative Contract Agreement with Microsoft, CWA Union Site\n00:37:49 - Ad  \n00:39:05 - Elden Ring Nightreign NEWS!\n00:50:04 - Wait. Are We Getting Worked By The Persona 4 Cast Members?\n00:51:40 - Game Informer’s Archive Just got Bigger, Matt Miller @ GI\n00:52:30 - Wee News!\n00:55:30 - SuperChats & You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748628502,
    "duration": 3537,
    "transcript_chunks": [
        {
            "text": "Today in the nerdy news you need to know about Microsoft has apparently killed the Xbox handheld in its crib. Are we getting worked by these Persona 4 voice actors? And Game Informer keeps on winning. We'll have all this and more because this is kind of funny games [Music] daily. What's up everybody? Welcome to kind of funny games daily for Friday May 30th 2025. I'm one of your hosts Greg Miller alongside gamefile.newses Steven Tatillo. Hello Stephen. Hello Greg. Thank you for making the time. It's rare that we have a real journalist on the show. We talk about the news a lot but you know sometimes Shrier he drags himself in here. But to have Stephen Totillo in here I'm very excited. How are you? Uh I'm feeling good. Uh, am I your first New Jersey based guest? That is even more important. Oh my god, what a question. I mean, Kevin Smith's been on the show a bunch, but not Games Daily, I guess. And I can't representing the Garden State here. Yeah, I know. I can't think of anybody else",
            "start": 2.48
        },
        {
            "text": "Oh my god, what a question. I mean, Kevin Smith's been on the show a bunch, but not Games Daily, I guess. And I can't representing the Garden State here. Yeah, I know. I can't think of anybody else who's come through to rep New Jersey. No one definitely no one's ever made a big deal about. It's like the first thing they've said of the show. So, congratulations. Proud of it to our first New Jersey guest, Stephen. Right. Uh, Stephen, I believe you need no introduction because you are one of those names that's been reporting on video games forever. In fact, you're celebrating 20 years as a video game reporter right now. But if people don't know you, how do you introduce yourself? Uh, first of all, where's my watch and nobody got me anything from? Well, you keep leaving companies. That's on you. That's on you. Do 20 years at one place. What? You got MTV News, Kotaku, Axios? You know what I mean? Come on now. Oh, I don't think that's a lot of change, but yes. So, I've I've been covering",
            "start": 57.12
        },
        {
            "text": "you. That's on you. Do 20 years at one place. What? You got MTV News, Kotaku, Axios? You know what I mean? Come on now. Oh, I don't think that's a lot of change, but yes. So, I've I've been covering video games as a reporter full-time basically my whole career. I have I have a semi-secret uh previous life where I created Hulk Hogan's reality show, but I try not to talk about that too much. Yes, I did. I did not know that life. I did not know. Yeah, Hogan Knows Best is the show in my idea. Yeah. Wow. Co-created. Sorry. Really? That's what that what? How did I never know that? I don't know. I don't know. It happened. It's It's part of It's part of the lore. God damn, dude. And then yeah, I I joined MTV News and covered games for the first time. Uh their first ever games reporter. Sat on the other side of the wall from Kurt Loader. Yeah. Uh to date to date things a bit. Uh and did that for four years. And then I joined Kotaku. And people may know me as the EIC of Kotaku, which I ran for",
            "start": 95.04
        },
        {
            "text": "other side of the wall from Kurt Loader. Yeah. Uh to date to date things a bit. Uh and did that for four years. And then I joined Kotaku. And people may know me as the EIC of Kotaku, which I ran for about a decade with an awesome crew of reporters and critics and video producers. Then I went and I covered games for Axios, big mainstream outlet that does a lot of writing in bullet points and what have you. And now I'm doing GameFile, which is a newsletter you can read or get emailed yourself, uh, read online. And the whole time just try to dig up interesting stuff for people to find out about video games. Maybe the things you're not going to be told by companies through a press release, maybe something I can get out of an interview, but just doing my best for the finding scoops and original angles on things. How does it feel to be independent? Of course, gamefile.news. Everybody go there right now, subscribe, put in your email address, get in there like I have. Uh, are you enjoying the",
            "start": 142.16
        },
        {
            "text": "angles on things. How does it feel to be independent? Of course, gamefile.news. Everybody go there right now, subscribe, put in your email address, get in there like I have. Uh, are you enjoying the freedom to be out on your own? Yeah, it's good. I mean, I've always had uh been fortunate to have good a lot of editorial freedom. So, I know some people they leave the, you know, the the media business and it's like, I can finally write what I want to write about. Well, I had the good fortune of, you know, MTV was like, we don't know how to cover games, so whatever you want to. Yeah. Yeah. We sort of play music videos, but uh maybe we'll do these other things, too. Um, I remember them telling me they're like, \"Well, we've had like Snoop Dogg come in and play video games, and people aren't really into that, so maybe there's something else we can do with games coverage.\" I'm like, \"I have some ideas.\" What I love about it, what I love about GameFile is that you, like you said, are breaking",
            "start": 183.92
        },
        {
            "text": "into that, so maybe there's something else we can do with games coverage.\" I'm like, \"I have some ideas.\" What I love about it, what I love about GameFile is that you, like you said, are breaking out interesting things, but the fact that it comes in my email box and I see it right there and I It's like you had one this past week. Yeah, I'm looking through here of like, you may have you may have missed a terrific new Katamari Damasi. And I was like, I did. I remember the day it came out being like, I got to resubscribe for Apple Arcade and I forgot all about it until your headline. There you go. I'm I'm here to haunt you, to remind you, to nag you. Yeah. For all the people out there who love email, subscribe to GameFile and you can get more email. If you're sick of not being inundated by the news, you know, every other place, why not let it infect your inbox? Look at this before and after contrast now. Yes, that is younger me. uh more hair on the head than than now from my from my MTV",
            "start": 220.96
        },
        {
            "text": "news, you know, every other place, why not let it infect your inbox? Look at this before and after contrast now. Yes, that is younger me. uh more hair on the head than than now from my from my MTV news era. But yeah, you can you can get GameFile through um through uh the app uh Substack app. You can read it uh through email. You can read it at gamefile.news. But you know, I mean, how how exciting is that? The stories are what's interesting and and hopefully people will find what what they stumbled across there. You read it for free. Yesterday, a good one, too, about the Nintendo's most useful news. Statistically speaking, I did not even realize that the Nintendo app let you uh rate it from useful, funny, cool, or cute. So, I loved this breakdown. And I'm sorry, I stepped out of it. You can get it for free, but you can also subscribe. Yes. Yes. Yes. If you pay if you pay uh extra, you'll be able to read all three editions every week in full, but even the free readers will be able to",
            "start": 258.64
        },
        {
            "text": "can get it for free, but you can also subscribe. Yes. Yes. Yes. If you pay if you pay uh extra, you'll be able to read all three editions every week in full, but even the free readers will be able to read a hefty amount of the paid editions, plus uh the uh the free editions. And yeah, one one of my weaknesses is just weird statistics, particularly from Nintendo. So like they used to put out charts listing uh the number of games they released every month or every year or something like that. And on that for like their whole history. So I made charts of like how often how many games that they released per year. And lo and behold, the number of games released has reduced significantly since they stopped having both handhelds and home consoles. Turns out that consolidating didn't lead to them making double the games for the Switch. It led to them making slightly more games than they made for any one platform before, but the games are bigger. So, I like finding weird stats and stuff, and I",
            "start": 300.24
        },
        {
            "text": "making double the games for the Switch. It led to them making slightly more games than they made for any one platform before, but the games are bigger. So, I like finding weird stats and stuff, and I noticed the Nintendo Today app, uh, which people may have checked out since it launched in late March, lets you, as you said, put an emotional score rating on every news article. And so, I thought it would be funny to find out which ones were rated the the coolest, the cutest, the most useful, and and what have you. The most useful article actually I found useful. So, the system works. Apparently, the Switch will have a Yeah, the Switch 2 has a setting where you can tell it only charge the battery to 90%. Yep. And they say, \"Look, the system won't run as long when it's at if it only maxes out at 90%.\" But batteries tend to uh keep a a greater capacity long term if they're not maxed out when you charge. So, the trade-off is that it'll be good for a longer battery existence and life and and",
            "start": 340.8
        },
        {
            "text": "at 90%.\" But batteries tend to uh keep a a greater capacity long term if they're not maxed out when you charge. So, the trade-off is that it'll be good for a longer battery existence and life and and time span in the future. Okay. Useful. Definitely not cute. That's definitely not cute. Not cute at all. Not cute at all. There's enough cute stuff happening over there. Uh well, I'm excited as we go through all the new stories today, Stephen, for you to rate them if they're cute or useful. Uh because this is kind of funny Games Daily. Remember, each and every weekday on a variety of platforms, we run you through the nerdy video game news need to know about live. YouTube.com/kindfunny games, twitch.tv/kindfunny games, and of course, podcast services around the globe. No matter where you get the show, please consider like, subscribe, share, tell your friends, leave a review, and if you think we did a nice job, why not pick up a kind of funny membership? Remember, $10 a month gets you all",
            "start": 382.96
        },
        {
            "text": "the show, please consider like, subscribe, share, tell your friends, leave a review, and if you think we did a nice job, why not pick up a kind of funny membership? Remember, $10 a month gets you all of our shows ad free. That's more than 80 a month, and it gets you a daily dose of me, Greg Miller, and a Greg series. That's 15 to 20 minutes each and every weekday, adding up to four hours of exclusive podcasting, all for you. If you're watching live right now, of course, you should be YouTube super chatting. You can be part of the show with your questions, your comments, your concerns. Are you sad that Xbox is turning their back on this handheld already? We'll get to it, but you could start getting your super chats in right now, just like Cognitive Clips did, who said, \"Birthday birthday tax. Glad to have met so many awesome kind of funny people because of our shared love of kind of funny.\" Well, there you go, Cognitive Clips. Happy birthday. And of course, congratulations to the",
            "start": 423.6
        },
        {
            "text": "tax. Glad to have met so many awesome kind of funny people because of our shared love of kind of funny.\" Well, there you go, Cognitive Clips. Happy birthday. And of course, congratulations to the community for being so good to each other. Housekeeping for you. Remember, we are an 11 person small business all about live talk shows. After Kind of funny games daily today, you are getting the Kind of funny games cast. It is my preview of Hell is Us. I went up to Montreal to play it and I will tell you something. I don't think anyone else is in the office yet because I'll tell them because they don't know. It is now my most anticipated game of the year. So, I'm very excited for Hell is Us and very excited to finally be able to talk about it. Uh, after the games cast is Karate Kid in Review and then after that, let me read Andy's official thing today after in review. The best souls gamers at Kind of funny that are currently not out of time out of town. Demon are taking on Giant Bomb in an",
            "start": 459.76
        },
        {
            "text": "then after that, let me read Andy's official thing today after in review. The best souls gamers at Kind of funny that are currently not out of time out of town. Demon are taking on Giant Bomb in an Elden Ring Night Reign showdown. Who will score the most points? How will they score points? Tune in for some chaos at 1:30 p.m. Pacific time today. Twitch and YouTube. Of course, you can watch later on YouTube as well. If you're a Kind of funny member, today's Greg Way is going to be about if you should go to SGF in person, but I'll be recording it on the way home, so who knows how long it'll be, but you'll get it. Uh, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by Mood, but we'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. Six items on the Roper [Music] Report. Number one, and it didn't even deserve any fog, let alone just one, but I like",
            "start": 496.16
        },
        {
            "text": "the show with what is and forever will be the Roper Report. Time for some news. Six items on the Roper [Music] Report. Number one, and it didn't even deserve any fog, let alone just one, but I like that it's not two. Number one, Xbox's handheld is dead. es for now. We go over to Jez Cordon at Windows Central. Super chat, I need to know. Are you affected? Are you upset? Are you I'm angry? Stephen Totillo, are you angry? Did you need an Xbox handheld? I'm okay. God damn it, Stephen. [ __ ] We go to Jez and we'll get back to you in a second, Totillo. Uh, I come to you today with some fresh news about Xbox's handheld plans. Previously, I reported that Microsoft was working on a native Xbox handheld alongside an Xbox Series X successor planned to launch somewhere around 2027. It now seems that Microsoft's priorities have shifted somewhat. Just to emphasize here, this is not Xbox's Asus device Kennon uh that is being pushed back. Oh, that is being pushed back. Uh it's Microsoft's own",
            "start": 538.72
        },
        {
            "text": "that Microsoft's priorities have shifted somewhat. Just to emphasize here, this is not Xbox's Asus device Kennon uh that is being pushed back. Oh, that is being pushed back. Uh it's Microsoft's own internal Xbox handheld that has been shelved. For now, I have a variety of code names for this unseen device, but it's unclear as of writing which exactly is the correct one. At the moment, it seems there are three prototype devices in development for Microsoft's Gen 10 effort with the handheld being parked for now. Indeed, Microsoft still Microsoft still wants to build its own Xbox handheld in the future. Uh but Microsoft has decided to prioritize its teams to improve Windows 11 gaming performance especially especially for devices like the ASUS partner device project Kennedon. Uh it's possible that the existential threat from Steam OS which on paper delivers better gaming performance than Windows 11 itself has informed these decisions. Our sources have indicated to us that Microsoft is",
            "start": 595.04
        },
        {
            "text": "that the existential threat from Steam OS which on paper delivers better gaming performance than Windows 11 itself has informed these decisions. Our sources have indicated to us that Microsoft is still deeply investing in investing in developing its own Xbox handheld technology in the future. But it was announced internally today that the priorities are moving more deeply towards third-party OEM handhelds in the interimm. Project Kennon is the code name for Microsoft's partner Xbox handheld with ASUS. Uh we understand that Kenon is still targeting a launch later this year. The hardware side is essentially finished. Tentative tentatively we believe this device to be among the first using the AMD Z2 Extreme, but we are still working on solid confirmation for that. There's a significantly boosted effort between Xbox and Windows teams to improve the experience on the software side. Devices like the Asus Rag Ally and the Lenovo Legion Go uh already run on regular Windows 11 and the Xbox",
            "start": 642.64
        },
        {
            "text": "boosted effort between Xbox and Windows teams to improve the experience on the software side. Devices like the Asus Rag Ally and the Lenovo Legion Go uh already run on regular Windows 11 and the Xbox Layers and apps have gotten better, but there's still a lot of improvements that could be made. It is always unclear uh if Microsoft's handheld was designed to be a native Windows 11 PC gaming style handheld or a more native Xbox console style experience, but we potentially now have an answer. It seems that it was indeed meant to be a device that could run full Xbox games, but Microsoft has decided to prioritize its teams on the partner opportunity around devices like Kenon, at least for now. Uh, I've been told that Microsoft uh still has big ambitions and investing heavily to deliver a native Xbox handheld, but the shift is about prioritizing and allocating resources right now. There have been no layoffs or anything like that as a result of this repprioritization. Stephen, how could you",
            "start": 690.64
        },
        {
            "text": "Xbox handheld, but the shift is about prioritizing and allocating resources right now. There have been no layoffs or anything like that as a result of this repprioritization. Stephen, how could you not want an Xbox handheld? What are you talking about? I've got a Steam Deck and I have a Switch and I hope to have a How many handles do I need to carry? How many hands do I have? You need to just come down on one. All right. You just got to figure out the one that would be the one to rule them all and then you'd be fine. And that's where I'm at with my ROG right now. I love my ROG too much, Stephen. Yeah. I mean I mean the signal that Microsoft is sending with all their games is that they're going to be on everything. Yeah. So it be weird to think that an Xbox handheld would have anything exclusive to it. So it it then therefore becomes the same question to me as what they think the appeal of their next console will be which is that in a Microsoft games are on every platform world what is",
            "start": 734.72
        },
        {
            "text": "to it. So it it then therefore becomes the same question to me as what they think the appeal of their next console will be which is that in a Microsoft games are on every platform world what is the advantage of buying and playing on Microsoft hardware and there may well be advantages they may have they may figure things out technologically that make it so that oh that's the box or the handheld I'd rather have but just the like the the theory or the concept of oh an Xbox handheld it doesn't have the same punch as it would have if we were in the world of Halo, you're only going to play it portably on the Xbox handheld, Gears of War, and so on. And it just doesn't feel like the world we're in anymore. Yeah. And that's been a weird march uh as we've set off on what Xbox's vision is. And it seems like the dominoes are finally starting to fall. An Xbox handheld has always been exciting for me, somebody who is allergic to PC gaming because of all the hoops you have to jump through to get it",
            "start": 778.8
        },
        {
            "text": "like the dominoes are finally starting to fall. An Xbox handheld has always been exciting for me, somebody who is allergic to PC gaming because of all the hoops you have to jump through to get it on a big screen and have it running at max best settings and stuff like that and cards and whatever and drivers and I hate it all. But so I mean even before the butt I get my thing had always been like I would I just want I I I like my Xbox games. I like my console games and I'd love to be able to take those with me and have the same saves back and forth and everything works great and yay, we're all off to the races. So when the rumors of the Xbox handheld started, I was so excited about that. But at the same time, I was already playing my Steam Deck. And then I got the ROG Ally X and then started booting into Windows and then started using Xbox Game Anywhere and using the Xbox app so that my Oblivion remastered save is on the ROG and I'm playing it here and then I go home and I turn on the",
            "start": 823.92
        },
        {
            "text": "booting into Windows and then started using Xbox Game Anywhere and using the Xbox app so that my Oblivion remastered save is on the ROG and I'm playing it here and then I go home and I turn on the Series X and it's on the TV in glorious 4K and looking amazing. And as that has happened, my excitement for the Xbox handheld has dampened because I'm already living the future I want to a degree. We're still in that era of I, you know, I we just re-reviewed Outer Worlds yesterday, sat down, played four hours to when I started a new save on the Series X, I was like, great, now I'm going to put that Game Anywhere to the my handheld and went in and realized they were two different versions of the game. That game was not Game Anywhere. I did not have the ability to do that. And that sucked, right? And for me it was like, well, this is what I'm talking about. Xbox handheld would fix this problem. But I also feel like that's archaic, right? I'm talking about Outer Worlds having that problem, but",
            "start": 862.56
        },
        {
            "text": "And for me it was like, well, this is what I'm talking about. Xbox handheld would fix this problem. But I also feel like that's archaic, right? I'm talking about Outer Worlds having that problem, but that was a private division game. There was so much different uh hoops to jump through for that. Whereas with Outer Worlds 2, that's not going to be an issue, right? That's going to be a Game Anywhere title because it's Xbox first party. And so then you get into this really interesting conversation of, well, do I need an Xbox handheld anymore if this thing is killing it for me? And again, I will remind you all the ROG Ally X is killing it for me. I'm so gosh darn happy with this thing. It's replacing everything for me. Stephen, I I I interviewed uh Phil Spencer last November, I think it was, and uh we were talking about the maybe it was October. We're talking about what the fall lineup of games was going to be, and he volunteered almost an apology to for some of the lack of Play Anywhere",
            "start": 905.52
        },
        {
            "text": "and uh we were talking about the maybe it was October. We're talking about what the fall lineup of games was going to be, and he volunteered almost an apology to for some of the lack of Play Anywhere support for certain titles. So, Vessel of Hatred had just come out for Diablo II for in that case it was a honor the purchase everywhere kind of thing which I think they have another term for that one and it and he was own it everywhere. I I don't remember what it is but um but he was he was preemptively apologetic like of course we don't have that you know whatever it is term for it. Um but I'll be emailing Rod Ferguson about that right now the exact producer of all things uh Diablo over at Blizzard. And um you know then I I was interviewing Rod at uh the DICE convention in in Vegas in February and he was like yeah well look partially that's because that Diablo I was built through the battleet ecosystem and at a time before you know the the the you know the acquisition and everything",
            "start": 944.08
        },
        {
            "text": "and he was like yeah well look partially that's because that Diablo I was built through the battleet ecosystem and at a time before you know the the the you know the acquisition and everything where things weren't quite all synced up. And so the sort of thing you can infer from that is that some of the stuff that you're talking about, Greg, and some of the stuff that, you know, Spencer and Ferguson were talking about are vestages of a time when these groups were not all unified. And you know, for better or worse, the the the the swelling size of Microsoft's gaming empire and the fact that they own more and more, you know, studios and have things on the platform level will allow them to create more seamless experiences. And yes, once all that is working in sync, it it becomes harder to imagine. Well, if like if everything you read from Jez's article happens and then all these other handhelds are working great, then really what do you I mean, maybe they're going to save uh for the Xbox",
            "start": 990.08
        },
        {
            "text": "Well, if like if everything you read from Jez's article happens and then all these other handhelds are working great, then really what do you I mean, maybe they're going to save uh for the Xbox handheld like the special Xbox green color. They will not allow the like patent that color, trademark that color. And so if you really want like a acid green glow-in-the-dark kind of a thing, you know, you know, translucent like an old GameCube, you know, or N64, take the old Duke controller, the famously large controller, and split it apart almost uh think about what the what is that the the the oh man, the the streamable PS5 thing. What is that one called? Oh, I know. The Portal. Show some respect. The PlayStation Portal, Stephen. All right. Hey, if the first ever re interview with the creators of the PlayStation Portal, where did that get published? Who had the scoop on the exact game? Don't worry about it, everybody. You knew the answer. Yeah. And I think that's, you know, we're talking",
            "start": 1035.28
        },
        {
            "text": "of the PlayStation Portal, where did that get published? Who had the scoop on the exact game? Don't worry about it, everybody. You knew the answer. Yeah. And I think that's, you know, we're talking about old games and trying to figure it out. And I think, yeah, especially if this is true, like, and that's something we should have called out. Obviously, Jez is rumors and speculation on something that we don't know much about. If that's the case internally, then I'd imagine these conversations are happening there as well. Like, all right, cool. We got to make sure this all works from here on out. How do we do that? How do we expand it? How do we get more partners involved with it? Because again, that's the same thing of like, you know, where you're at now where, you know, the the big game comes in for review and it's like, where do I want to play it? And I'm like, well, I'd want to be able to play it on the handheld, but I don't it's not going to be I'd have to get two codes and is it",
            "start": 1081.2
        },
        {
            "text": "comes in for review and it's like, where do I want to play it? And I'm like, well, I'd want to be able to play it on the handheld, but I don't it's not going to be I'd have to get two codes and is it cross save and X Y and Z and D. I will also point out, by the way, that to the extent that this is viewed as bad news and that it's it's Microsoft saying they're going to do something and then retreating from it, this is the kind of news that tends to break the week ahead of a showcase or an event. And we know that Microsoft's doing a showcase because you have communications happening within the division, um potentially conversations happening with reporters. I'm not suggesting, you know, one way or the other about what JZ sources are, but um you tend to have this kind of reporting and these kinds of stories emerge ahead of whatever is planned to be announced. And so it'll be interesting to sort of think about this reporting and this kind of status update of where the handheld development",
            "start": 1116.4
        },
        {
            "text": "of stories emerge ahead of whatever is planned to be announced. And so it'll be interesting to sort of think about this reporting and this kind of status update of where the handheld development is in light of whatever we learn a week from now when Microsoft is doing it showcases which they've presented as being more software ccentric. Um, but we'll sort of see, you know, we'll maybe maybe they'll be talking about a vast partnership with a bunch of, you know, handheld makers, including whatever. The, you know, the Xbox crossover with the Asus division and them making their own ROG and stuff like that. Like that's we've seen so many leaked images of it with which is basically this device with like more of controller grips on the side. Like I think it's a foregone conclusion and an easy layup prediction on next week's Games Cast that yes, it's going to be revealed there. I think he gets more interesting of when is it coming out? What does it do? Is it way more powerful than the Raw Ally",
            "start": 1156.56
        },
        {
            "text": "prediction on next week's Games Cast that yes, it's going to be revealed there. I think he gets more interesting of when is it coming out? What does it do? Is it way more powerful than the Raw Ally X or is it basically that? That's where I'm at of like is it going to be enough to make me want to upgrade? I'm in love with this device. Like my Steam Deck was my OG Steam Deck and I was I was ready before this one of like I'm ready for the Steam Deck, not OLED, but sequel. Like what does Steam Deck 2 look like? When I got this, I was like, I'm so satisfied and happy and everything works so well on this right now. I'd be interested to see what this Xbox version is going to bring that I can't just I'm sure I'll be able to get the Xbox OS or whatever they're working on onto this and then be off to the races, right? And if they're announcing something like this internally about clarifying where they are in their different road maps, you know, that then helps put, you know, as they anticipate",
            "start": 1200.8
        },
        {
            "text": "to the races, right? And if they're announcing something like this internally about clarifying where they are in their different road maps, you know, that then helps put, you know, as they anticipate that that they may leak out to the press, that then helps answer the question preemptively if that is in fact, you know, that this this this ASUS handheld is revealed next week. Nobody's then wondering. Well, wait. I thought you were also working on an original, you know, get the bad news out of the way. The exciting news. That's sort of how it works. Uh, super chats are all on your side. Nobody cares. RVB Jeeps super chats and says, \"I don't care.\" No. Daily Xbox user here. There's nothing they can get me excited for with a handheld. Never been a mobile handheld gamer, though, so my opinion is moot. Machine XP says, \"I'm glad Microsoft is allowing the Xbox team to work on the OS for Windows gaming. The Xbox engineers are brilliant and will help get closer to that PC hybrid. Uh Jake",
            "start": 1235.2
        },
        {
            "text": "is moot. Machine XP says, \"I'm glad Microsoft is allowing the Xbox team to work on the OS for Windows gaming. The Xbox engineers are brilliant and will help get closer to that PC hybrid. Uh Jake writes in and says, \"Honestly, if the Asus handheld runs well, I don't need it. Uh but the next Xbox running Steam is way more interesting.\" And I think that is something another rumor we've heard, right, of what they're doing of what the next Xbox would be that it might be able to boot not only Xbox games, but Steam, and you'd imagine Epic, and you'd imagine any other launcher along the way. That makes me excited. Does that make you excited, Stephen? Are you fine with your PC? I I don't think I'm much more of a PC gamer than you are. I think we both have an allergy to drivers and all that stuff. I mean I mean hey anytime I can think back to all all the config.cis.bat whatever updates. I mean those are fond fond memories but you know don't don't need to relive them anytime. I also just point",
            "start": 1276.72
        },
        {
            "text": "I mean I mean hey anytime I can think back to all all the config.cis.bat whatever updates. I mean those are fond fond memories but you know don't don't need to relive them anytime. I also just point out if you think about Xboxes in in Microsoft's gaming business overall I mean it is a software and services centric business. Microsoft has sent every, you know, signal possible that that hardware is not a priority for the corporation overall. And to the extent to which the gaming division still talks about hardware, sometimes I sense that it's just them kind of swimming upstream against the currents of what the rest of the company seems to be aiming toward. Uh, a couple more super chats before we get out of here. Machine XP says, \"Ally with an a more Xbox experience would be goated.\" Uh, Lucid Dream says, \"Greg, are you really turning your back on trophies?\" Lucid, I've been very clear about this from the jump. When the rumor, the the very first rumor of an Xbox handheld started, I was",
            "start": 1321.76
        },
        {
            "text": "Dream says, \"Greg, are you really turning your back on trophies?\" Lucid, I've been very clear about this from the jump. When the rumor, the the very first rumor of an Xbox handheld started, I was like, this could be the thing that actually would sway me away from playing PlayStation all the time. And it has happened where multiple I I had a PR person yesterday hit me up for, hey, do you want code for this game? And I was like, yeah, can I get it on PC? And he's like, when it's on this platform like no, no, PC. He's like, when did you become a PC gamer? And I was like, when they made it easy and they made it work. Now, eventually the ROG will get in my way and become evoluted and, you know, I'll need an actual PC or whatever. But like for all the indie games and small things I'm playing, this is great. Like the next giant big thing, I'd like it to I it would it would draw me to play on Xbox cuz I don't want to hook a PC up to my TV and worry about it for the 4K whatever giant",
            "start": 1364.16
        },
        {
            "text": "this is great. Like the next giant big thing, I'd like it to I it would it would draw me to play on Xbox cuz I don't want to hook a PC up to my TV and worry about it for the 4K whatever giant experience. I'd rather the Xbox speak right to it. But if that's going to be now, if we get to the situation where well, it's not connected. is Xbox is it own platform and the P PC I'm playing on is its own platform, then of course I'm going to go PlayStation and forget about it. Remember you you the other solution to this is for the publisher or the developer to have some sort of unified kind of access point. So when I reviewed Assassin's Creed Syndicate a couple of months ago, I reviewed it across six or seven different devices. Yep. Not because I wanted to, but because I took advantage of the fact that Ubisoft Connect kind of unifies your save files and puts them in the cloud. And so you can go from playing on GeForce Now streaming, which is what I initially did because they weren't sending",
            "start": 1401.12
        },
        {
            "text": "that Ubisoft Connect kind of unifies your save files and puts them in the cloud. And so you can go from playing on GeForce Now streaming, which is what I initially did because they weren't sending out downloadable codes. And then I went, well, I think they did that to give people more time to play the game ahead of them having the console codes available. So I went from GeForce Now streaming to then move the save file to my PS5 and I continued it there. But then I was traveling to Game Developers Conference in San Francisco and I wasn't going to lug my PS5. My Series S is smaller. So I was going to bring that. Um so I was then able to switch over to have my progress continue there. And so you know Hideo Khjima of course was on top of all this with transferring right that Metal Gear. Was it Metal Gear Portable Ops? Was that the one where it was supposed to supposed to connect from November? I believe something was after Peace Walker. It was the collection. And it was the first",
            "start": 1443.76
        },
        {
            "text": "Was it Metal Gear Portable Ops? Was that the one where it was supposed to supposed to connect from November? I believe something was after Peace Walker. It was the collection. And it was the first collection they put out where you could transfer all your stuff back and forth. Your PSP, your save progress would would transfer into uh into the console. Time to be alive. Remember that. Mega 64 had to explain it. A great time. Uh but you bring up something. This is something we're seeing more and more of cross progression, whatever. But it's slowly rolling. You're not seeing everyone adapt it. But I was shocked last night when I listened to you, the kind of funny audience who said, \"Greg, don't sleep on Fantasy Life. I the girl who steals time. if you like Animal Crossing and these Sims things. So, I started it on my Steam Deck, but or my ROG and I was of course immediately greeted with remember this is cross this is cross save. So, if you want to pick up on Switch later and I know it's",
            "start": 1484.88
        },
        {
            "text": "So, I started it on my Steam Deck, but or my ROG and I was of course immediately greeted with remember this is cross this is cross save. So, if you want to pick up on Switch later and I know it's coming out with the Switch 2 edition or whatever, I was like, \"Oh, okay. That's a very nice feature to be able to send it there to PlayStation or whatever.\" Like I it's we're getting there where everybody's moving to get there, but there still are these Yeah. I'm not sure level five does the crossplatform save though. So they do I I mean that you can move your PC progress to switch. Yeah, unless chat keep me unless keep me wrong. There was a whole thing last night about like you can send your Yeah, it does. Okay, they're with me. Yeah. Yeah, you can. You can. Yeah. Oh, I didn't investigate. Doing great. Oh yeah. You know what I mean? That's my thing. Worried about them for a while. When I get when I get the Switch next week, I try it out over there. Kick it over there. So yeah, we're moving.",
            "start": 1525.52
        },
        {
            "text": "great. Oh yeah. You know what I mean? That's my thing. Worried about them for a while. When I get when I get the Switch next week, I try it out over there. Kick it over there. So yeah, we're moving. We're doing it. So I like that. You don't have a Switch, too, Greg. Kind of funny. Didn't get the exclusive. You know what I mean? I Well, it's funny. I we had one in super chat here and they all know obviously that none of us no one has it but injetream super chatted early in the beginning of the show and said got to hold multiple Nintendo Switch 2 systems today. Granted they were in shipping boxes and I was delivering them to my local Walmart. So hyped. So now start looking for your Walmarts though to break street dates. See who screws that up because that'll be out there. And then you have a a brick until the day one update. But you want to Yeah, there's a guy in Russia who has one. He's been putting posting videos and they keep taking them down as fast as you can put them up. Like get",
            "start": 1564.32
        },
        {
            "text": "a a brick until the day one update. But you want to Yeah, there's a guy in Russia who has one. He's been putting posting videos and they keep taking them down as fast as you can put them up. Like get out of here. We don't want that at all. Uh let's move on to story number two. It is another Xbox story. Uh speaking of Microsoft, video game workers reach historic tentative contract agreement with Microsoft. I'm getting this from the CWA Union site. In a first for the video game industry, over 300 quality assurance workers working at Microsoft subsidiary Zenamax Media, represented by Communications Workers of America, locals 2100, 21108, and 6215, announced that they have reached a tentative contract agreement with the company. Zenamax Workers United-CWA and Microsoft have been negotiating for a first contract for nearly 2 years. Quote, \"Qua workers from across the country continue to lead the charge for industrywide change,\" said Paige Branson, senior 2 QA tester and Zenac Workers Union",
            "start": 1599.44
        },
        {
            "text": "a first contract for nearly 2 years. Quote, \"Qua workers from across the country continue to lead the charge for industrywide change,\" said Paige Branson, senior 2 QA tester and Zenac Workers Union CWA bargaining committee me member. Quote, \"Going toe-to-toe with one of the largest corporations in the world isn't a small feat. This is a monumental victory for all current video game workers and for those that come after.\" End quote. For those that come after. A nice little expedition 33 reference snuck in there. I appreciate that. Quote, \"Workers in the video game industry are demonstrating once again that collective power works. This agreement shows what's possible when workers stand together and refuse to accept the status quo,\" said CWA President Claude Cummings Jr. quote. \"Whether it's having a say about the use of AI in the workplace, fighting for significant wage increases in fair crediting policies, or protecting workers from retaliation, our members have raised the bar. We're",
            "start": 1646.64
        },
        {
            "text": "having a say about the use of AI in the workplace, fighting for significant wage increases in fair crediting policies, or protecting workers from retaliation, our members have raised the bar. We're proud to support them every step of the way. The new contract sets new standards for the industry and includes substantial acrosstheboard wage increases as well as new minimum salaries for workers. The agreement also includes protections against arbitrary dismissal, grievance procedures, and a crediting policy that clearly acknowledges a QA workers contributions to the video games they help create. It also incorporates a previously announced agreement on how to artificial intelligence is introduced and implemented into the workplace. Contract explanation meetings uh will be held for members over the next few weeks uh with a ratification vote expected to be concluded by June 20th. Uh over 2,000 Microsoft uh video game workers have joined CWA under a groundbreaking neutrality agreement that",
            "start": 1692.72
        },
        {
            "text": "the next few weeks uh with a ratification vote expected to be concluded by June 20th. Uh over 2,000 Microsoft uh video game workers have joined CWA under a groundbreaking neutrality agreement that enables them to freely and fairly make a choice about the union representation. Hell yeah. Unions are great. Uh I'd like to see everybody credited and not abused in the video game industry. Stephen, you asked for so much. Uh, thank you. Stephen, you called this out when we when we were getting the show together. Like, you see this breaking news? And I'm like, I didn't. Did you say you were talking to people over there? Uh, well, I I didn't I had I didn't talk to the unionized people yet, but I did get a statement from Microsoft, so I'll do some reading as well. Um, they said they appreciate the dedication and engagement of the ZenMx QA team and the bargaining committee throughout the process. tenative agreement represents a meaningful step forward and reflects a shared commitment to",
            "start": 1734.24
        },
        {
            "text": "the dedication and engagement of the ZenMx QA team and the bargaining committee throughout the process. tenative agreement represents a meaningful step forward and reflects a shared commitment to constructive dialogue and a common goal of fostering a positive workplace. They said they look forward to the outcome of the ratification process. So the reason that this is such a key step in all this is that people have probably seen a lot of headlines and recall you reading out you know news for years now about game studios unionizing. Famously, there were barely any unions in gaming even just a couple years ago, particularly in the United States. And there had been some unionized efforts in France, in Sweden, in some countries where unionization is just more common and widespread amongst the population. And one of the consequences of the kind of 2020 workplace reckonings that were happening a lot of studios was particularly a lot with Activision and Blizzard was a rising up of workers to",
            "start": 1780.48
        },
        {
            "text": "population. And one of the consequences of the kind of 2020 workplace reckonings that were happening a lot of studios was particularly a lot with Activision and Blizzard was a rising up of workers to say we need to be stronger together. A union is the answer to that to push back against management to protect each other in various ways. And you first started seeing uh developers form these unions in 20 late 2020 or or maybe it was 2021. And so it's been a long time coming. The ZenMax union was not officially the QA union wasn't they didn't vote on on a union until I think January of 2023. So as you read it's then been over two years of negotiations. On April 1st of this year they voted to authorize a strike. So what happens is you have a group of workers, they vote to have a union and then just a select number of people are sitting down at the table with the company in this case Microsoft and Zenamax to try to hammer out a contract and if they don't like didn't like the way the",
            "start": 1824.16
        },
        {
            "text": "then just a select number of people are sitting down at the table with the company in this case Microsoft and Zenamax to try to hammer out a contract and if they don't like didn't like the way the negotiations were going then the the heads of the the union were going to be able to say we're going to go on strike. The the rest of the the the union group was agreeing on that by voting for that. And so the threat of a strike was now there in, you know, for Microsoft and Zenamax to reckon with since April 1st. And is that what finally got them to this point? Pos possibly. And that's one power of a union is the the threat of pulling your labor. But of course, the other important value of a union is what guarantees it can secure workers. And you just read through a bunch of those that include the the crediting guarantee agreements over the usage of AI. It sounded like there was something in there about pay um not the full details and that's obviously a key thing and those are you know those",
            "start": 1879.28
        },
        {
            "text": "the crediting guarantee agreements over the usage of AI. It sounded like there was something in there about pay um not the full details and that's obviously a key thing and those are you know those are the elements that ultimately stand to benefit workers long term um with all these unionization efforts. So if this gets ratified then we will have one union a big one 300 plus people at Zenamax with hundreds possibly up to 2,000 just through the CWA as you read sort of coming next into unionization and having they have a union but in ter terms of having a bargaining agreement with Microsoft Zenomax Activision uh you name it and really largely that's where a lot of this has happened. We've seen some unions crop up with other studios and publishers, but largely it's happening within the Microsoft family of studios and hopefully this will lead to uh better situation for for workers who certainly get the short end of the stick a lot of the times. 100%. Yeah. Uh do you see that happening? It",
            "start": 1922.56
        },
        {
            "text": "family of studios and hopefully this will lead to uh better situation for for workers who certainly get the short end of the stick a lot of the times. 100%. Yeah. Uh do you see that happening? It seems like you know I remember when the initial calls for unionization started and there were so many naysayers that it would just be oh it' be impossible. It's too this it's too fractured. Da da da. Do you see this? Are we 5 10 years you think from this being a more accepted viable reality for video game developers? I think when when people get a sense of what's in the contract and what the union secured they will either be impressed or they will say oh that doesn't seem you know worth it right and so you you have some of the vague contours there. I mean a union is not a panacea and it doesn't stop companies from you know making decisions to shut the entire operation down because they can't you know you if all the workers are unionized as we see this happen in many industries including media",
            "start": 1972.4
        },
        {
            "text": "companies from you know making decisions to shut the entire operation down because they can't you know you if all the workers are unionized as we see this happen in many industries including media industry they'll be like oh well we can't lay off three people because the union bars that so we're just going to shut the whole thing down right so you know it can be treacherous in a whole other way and then people have their their their feelings about a union but if you have a good contract if they try to do that and and and shut the whole operation down you in theory are at least guaranteed a high amount of severance if that's been bargained into your contract. So I think we'll we'll see but certainly over the last couple of years all you had was people voting to form a union and you weren't seeing any of the benefits or drawbacks to contracts manifest at all. So this is the beginning of the next phase of it where and I I my guess is that people will say well this is better than what the",
            "start": 2016.08
        },
        {
            "text": "seeing any of the benefits or drawbacks to contracts manifest at all. So this is the beginning of the next phase of it where and I I my guess is that people will say well this is better than what the workers had without being unionized. Sure. So therefore it is it is better and they'll go through the the same process. Well we wish them luck. Congratulations uh CWA and Zenamax over here. Of course I know IGN uh currently their IGN Union is trying to expand as well. uh IGN Union uh blue sky. I'm gonna start calling it BST yesterday and said it's been one week since we asked IGN Entertainment to recognize our friends on the product engineering and humble bundle teams as part of the IGN's creat IGN creators guild. Uh the sooner that happens, the sooner we can start working with management to build towards a stronger future for all of us. So lots of good moves happening out there right now. But the best Yeah, it's good. No, go ahead. I at Kotaku, you know, we were part of Gawker Media and",
            "start": 2056.48
        },
        {
            "text": "build towards a stronger future for all of us. So lots of good moves happening out there right now. But the best Yeah, it's good. No, go ahead. I at Kotaku, you know, we were part of Gawker Media and uh we were the first digital media company in in the United States to unionize and that's the dominoes to a lot of other other companies. At the time, the only reason that it seemed to sort of get a blessing from our owner, Nick Denton, because usually the owners are completely against the workers unionizing is that he thought that this was going to be contagious and that the writers, editors, reporters at other digital media companies like BuzzFeed were then also going to try to unionize. And he assumed it was going to annoy the owners of those companies. So, he's like, I'll tolerate whatever discomfort I have because it'll just drive my competitors crazy when this happens. And similarly, if you look at the genesis of this, like it comes from Microsoft announcing in early 2021 that they",
            "start": 2099.2
        },
        {
            "text": "discomfort I have because it'll just drive my competitors crazy when this happens. And similarly, if you look at the genesis of this, like it comes from Microsoft announcing in early 2021 that they wanted to buy Activision Blizzard. And initially, several US senators, including Elizabeth Warren, were against the deal because they were hearing from unions that this was going to be bad for labor. And the way that Microsoft was able to get the unions on board and the senators off their back was to make a pledge, this neutrality pack that was referenced in what you read, where Microsoft said, \"We will not stand in the way. We will not push back against any of our worker groups trying to unionize. I mean, they're allowed to try to unionize, but companies are able to go through a lot of processes that slow the process down.\" They said, \"We won't do any of that.\" They they honored that. And in exchange, the CWA said, \"We approve of this mega merger,\" which which was itself unusual because",
            "start": 2142.8
        },
        {
            "text": "that slow the process down.\" They said, \"We won't do any of that.\" They they honored that. And in exchange, the CWA said, \"We approve of this mega merger,\" which which was itself unusual because usually labor unions and workers are not in favor of large corporations getting larger their $69 billion acquisition. So make what you will the deal. But one of the seemingly positive outcomes of that is that Microsoft, which for 48 years or whatever before that had never had a union and in fact they tried to break up unions um that were forming has now had unions and it's the gaming developers of all the constituencies and workers at Microsoft who were the ones who were able to sort of get the camel's nose under the tent as it were and begin to spread unionization I guess through the through the company. So, it's a it's a weird how these things happen and in this case ultimately the byproduct of Microsoft wanting to buy another company and own Call of Duty and Candy Crush, but it gets us a",
            "start": 2187.04
        },
        {
            "text": "company. So, it's a it's a weird how these things happen and in this case ultimately the byproduct of Microsoft wanting to buy another company and own Call of Duty and Candy Crush, but it gets us a unionization movement that's showing some signs of success. Well, awesome and congratulations everybody involved. Uh, of course, there's more news to talk about, but I'll remind you that we couldn't do this without your support. Uh, you can pick up a kind of funny membership on patreon.com/kindfunny, youtube.com/kindfunname, Apple or Spotify. Uh, it would get you, of course, all of our shows ad free. That's more than 80 a month. And of course, your daily dose of me, Greg Miller, in a 15 to 20 minute podcast I do in my car for you that adds up to a 4-hour podcast each and every month. But you're not using your benefits right now. So, here's a word from our sponsor. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with",
            "start": 2229.36
        },
        {
            "text": "not using your benefits right now. So, here's a word from our sponsor. This episode's brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep. And you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out their different gummies and am loving how each one feels. Their Sleepy Time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess. Not only does Mood stand behind everything with an industry-leading 100day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and",
            "start": 2266.88
        },
        {
            "text": "100day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And please remember to use promo code kind of funny at checkout to save 20% on your first order. Again, that's mood.com promo code kind of funny for 20% off. And we're back with story number three. It's a rock of Elden Ring news. Stephen, are you a night rain person? No. Good. Me neither. So, it's fine. Don't worry. We're in good company. We can report the news and get the hell out of here. Of course, it's officially out today for everyone. You can go get it. You can do the dang thing. Uh, but IGN reports over there from Wesley Yinpool. That's right. WP at IGN. Uh, Elden Ring Night Rings Night Rain sells 2 million units on its first day. Elden Ring Night Rain sold 2 million copies on its first day. Quote, \"Pre-orders and early sales",
            "start": 2315.04
        },
        {
            "text": "That's right. WP at IGN. Uh, Elden Ring Night Rings Night Rain sells 2 million units on its first day. Elden Ring Night Rain sold 2 million copies on its first day. Quote, \"Pre-orders and early sales have pushed the game beyond the incredible 2 million unit sales uh, milestone.\" Publisher Bandai Namco announced the multiplayer co-op spin-off released overnight and soon shot up the Steam most played chart with an impressive 313,593 peak concurrent users. That doesn't tell the whole story, of course, with both Microsoft and Sony withholding Xbox and PlayStation player numbers. But From Software has now given an idea of just how big Elder Ring Night Reign is with the announcement of 2 million copies sold already. But it's not all great news. In a separate IGN article, they had this one paragraph. Uh, but it also came with a number of negative reviews. 67% of the reviews are positive so far. Uh, most of which point out uh, so that was in parenthesis. So, it also came with a bunch of",
            "start": 2364.24
        },
        {
            "text": "paragraph. Uh, but it also came with a number of negative reviews. 67% of the reviews are positive so far. Uh, most of which point out uh, so that was in parenthesis. So, it also came with a bunch of negative reviews. Most of which point out that Elder Ring's uh, Night Ring lacks duos or two-player co-op and voice chat. So, they're just being whiny babies as always. Stephen, I I just pulled up the press release. I just want to I want to share this because it's amusing. If I may, please. Of course. This is what Bandai Namco said. They said, \"Elder Ring Night Reign, the standalone multiplayer co-op action survival game from by from Software Inc. and publisher Bamco Entertainment Inc. is now available to players having already surpassed the milestone of 2 million units.\" Having already surpassed the milestone of 2 million units. Notice notice word they're not using there. Sold. They didn't say sold. Like what? And yet I don't think this game is on any subscription service. So I don't",
            "start": 2409.92
        },
        {
            "text": "the milestone of 2 million units. Notice notice word they're not using there. Sold. They didn't say sold. Like what? And yet I don't think this game is on any subscription service. So I don't know why they're avoiding using that word. But it's interesting or not. I mean, they copy. Yeah. Yeah, you're right. I guess they would have shipped more than 2 million. Pass the milestone of two million units. I don't know. It's just a weird way that companies, game companies talk. They want to do everything they can to avoid just telling you. They don't want to give you an actual fact. They don't want to give you a hard fact. They want to give you a little bit. This is what's happening over there. What's happened over there? We surpassed it. We surpassed two million units. Maybe people looked at the box art two million times. Uh, yeah. Interesting one on that one uh to say the least. Good numbers obviously. Uh of course review bombing. I'm so over review bombing. You're not doing it anymore.",
            "start": 2452.04
        },
        {
            "text": "the box art two million times. Uh, yeah. Interesting one on that one uh to say the least. Good numbers obviously. Uh of course review bombing. I'm so over review bombing. You're not doing it anymore. You retired from reviewing. It didn't do anything I wanted it to do, it turns out. So I was like, I don't got time for this. It's just like come on, do your thing. Uh let's move on to another Elder Ring Night story. Uh Elden Ring Night Reigns next patch will improve the experience of playing alone. This is uh Thomas over at GameSpot. Bandai, Namco Entertainment, and From Software have just released Elden Ring Night and are already teasing its first post-launch update. Patch 1.02 is scheduled to release sometime next week and will improve the solo experience of playing this co-op game. Quote, \"Next week, patch 1.02 will be released and will include several bug fixes as well as improvements for solo expeditions, the official Elden Ring account on X explained. While the full patch notes",
            "start": 2487.36
        },
        {
            "text": "\"Next week, patch 1.02 will be released and will include several bug fixes as well as improvements for solo expeditions, the official Elden Ring account on X explained. While the full patch notes won't be released until next week, the account did tease some important updates coming to solo expeditions in Night Rain. After patch 1.02, solo players will be able to revive themselves once, I'm sorry, once per night boss battle, and gain more runes, a form of in-game currency while playing. This has been uh a ongoing conversation here at Kind of Funny. Of course, Roger uh was one of the folks who picked up Night Rain during the review period, but he kept trying to jump in and play it solo, and he disliked it so much he's like, I'm just going to stop. So, I'm glad to see they're trying to fix that. I guess it's this is the second straight Elden Ring related release where so quickly after release, what seemed to be the prime design element about it seems to now be getting walked back a",
            "start": 2535.52
        },
        {
            "text": "fix that. I guess it's this is the second straight Elden Ring related release where so quickly after release, what seemed to be the prime design element about it seems to now be getting walked back a little bit through almost immediate patches, right? Um, Elden Ring was uncompromising as were from Software's prior games. Pardon me if I'm ignorant of a rapid kind of course correction patches, but I it does not ring a bell. By contrast, Shadow of the Tree comes out, reviewers are are are crushed by its difficulty, and very quickly you have From saying, \"Okay, we'll make it easier.\" And now you have a game that is ostensibly a co-op game. It's how it's been promoted. It's how it's been designed. Reviewers have noted this game is very difficult to play solo and you have almost you know this is ready to go for the next week patch or at least small elements that will make it easier for solo players. You know, there's been a kind of a meta discussion around game difficulty and From Software",
            "start": 2580.72
        },
        {
            "text": "ready to go for the next week patch or at least small elements that will make it easier for solo players. You know, there's been a kind of a meta discussion around game difficulty and From Software has been at the forefront of that discussion about developers vision versus player demands and requests and desires and where should the two meet and how uncompromising should either side be. Um, formerly the the the exemplar of don't change it make people kind of meet you where where they are now is becoming the exemplar of change it and and and meet the customer demand. it seems, which is good. And I think again, launching an online game, a multiplayer game is such a different beast than a giant single player open world, which I know there was a little bit of co-op, but you know what I mean, in terms of like you need to be Johnny on the spot with patches, updates, this, that, and the other. Tuning it. Yeah. Yeah. Yeah. Yeah. Yeah. You got Marathon coming. You got to be ready. Oh, man.",
            "start": 2633.36
        },
        {
            "text": "in terms of like you need to be Johnny on the spot with patches, updates, this, that, and the other. Tuning it. Yeah. Yeah. Yeah. Yeah. Yeah. You got Marathon coming. You got to be ready. Oh, man. Marathon is going to swing in here and just be a huge success. I'm sure it's not going to be another colossal PlayStation failure. Uh, and moving on to another Elden Ring Night Rain one for you. Uh, this is actually I'm I lied. It's an Elder Ring movie one. Uh, it could reportedly star a Warframe actor. This is Justin Crow over at Deadline. The highly anticipated Elder Ring movie movie at A24 and video game company Bandai Namco Entertainment is gaining momentum as director Alex Garland may be zeroing in on a familiar face to lead the epic adaptation. While it is unknown where things stand in negotiations or if a formal offer has been offered, sources tell Deadline that the director has talks with Kit Connor, who recently appeared in his war pick Warframe to star in the adaptation. Sources",
            "start": 2676.88
        },
        {
            "text": "or if a formal offer has been offered, sources tell Deadline that the director has talks with Kit Connor, who recently appeared in his war pick Warframe to star in the adaptation. Sources stress several factors still need to be worked out, including scheduling, but both Garlin and Connor want this to happen. It is Warfare. Thank you. Demon Hacker said it's Warfare, not Warframe. He made a movie about Warframe already. Here's what's so funny is like when I read it I was like oh the headline on GameSpot was warfare but I read Warframe and I was like I never knew they made a Warframe movie or you or that Hollywood or that Hollywood stole the name Warframe and now you're telling me it was a war picture called Warfare and I've never heard of this mo motion picture in my life. Never. But I'm not a big movie guy but I don't know what's going on. Yeah. Yeah. We're we're we're we're hauntingly similar people um in that regard. I gotta say, I mean, I I I guess I'm just a hater in this episode",
            "start": 2717.52
        },
        {
            "text": "a big movie guy but I don't know what's going on. Yeah. Yeah. We're we're we're we're hauntingly similar people um in that regard. I gotta say, I mean, I I I guess I'm just a hater in this episode and unimpressed with so much of the the news that's being shared. Uh I'm weird and that I do not get excited about the games that I like being turned into movies. Like, okay, I'm going to still play the game. I don't But you I mean you I'm not I'm not I'm not psyched for the Zelda movie. It's like it's a game. I want to play play it as a game. So, I don't But again, that's that's I probably lost the entire audience. Did you What about Last of Us? You care about that? Is that working for you? No. Okay. No. I mean I mean look, The Godfather's a great movie and and it's like hypocritical to say because like uh for me to make this position because it would suggest that I think it should have just stayed a novel, right? It never become a movie. But overall like people are like kind of lose it",
            "start": 2763.36
        },
        {
            "text": "because like uh for me to make this position because it would suggest that I think it should have just stayed a novel, right? It never become a movie. But overall like people are like kind of lose it when it's like it's almost like a status symbol like oh this thing has made it. And so I I always feel like there's there's kind of a baked in inferiority complex that like oh game this game wasn't good enough or major enough until it became a movie or it became something else. That's it's awesome as a game. I like getting into new audiences. I guess I like seeing, you know, I mean, in a world where so many things are being snuffed out because it didn't make make enough money for the shareholders. The idea that yeah, we're getting more people into it and you're seeing it like I hate the idea of a trans media property, but like the idea that you can expand it beyond the art group. I'm like, okay, cool. Like whatever. Hey, look, we praise transferring. We've played praised now trans media.",
            "start": 2807.04
        },
        {
            "text": "of a trans media property, but like the idea that you can expand it beyond the art group. I'm like, okay, cool. Like whatever. Hey, look, we praise transferring. We've played praised now trans media. This is a trans positive uh show overall. I hope so. It is. It is. Oh, no. Overall, we are transositive. Don't worry about that. Uh, Demon Hacker agrees with you with the super chat. Elden Ring has a promising crew as a movie, but I agree. Not excited. Don't need a Don't need a movie version of this. I'm still interested to see what they do with it. Like, obviously people creating movies are a lot more creative than me, so I'll be interested to see, but I just like I don't want you fighting. Have you seen some some movies are not created by people more creative than you, Greg? Sure. Thank I appreciate that. Uh, but we're just fighting. We're just What's the narrative of this? What's this? What's this, dude? These games are so weird about their stories. How you going to put that in there?",
            "start": 2838.8
        },
        {
            "text": "that. Uh, but we're just fighting. We're just What's the narrative of this? What's this? What's this, dude? These games are so weird about their stories. How you going to put that in there? I don't know. I mean, like, should it be a movie where like people who watch the the first like run of the movie can put messages into the movie for the people who go see it the next day? Be cool. Jump here. Uh, and a final Elder Ring rock story for you is just a stupid fun one. Uh, this comes from Eric Van Allen at IGN. Some Elden Ring Night Reign players are fighting their muscle memory from the original Elder Ring controls and chugging flasks by mistake. Elden Ring Night Reign is out and players are already diving into the shifting lands to fight the Night Lord. If they warmed up a bit on the original Elden Ring though, they might be finding themselves a little turned around by some control changes. While the controls in Elden Ring Night Reign are mostly the same as the original Elden Ring, a",
            "start": 2877.52
        },
        {
            "text": "Elden Ring though, they might be finding themselves a little turned around by some control changes. While the controls in Elden Ring Night Reign are mostly the same as the original Elden Ring, a few changes have been made, either to accommodate new abilities or simply move things around a bit. Some of these are just for new moves or updated versions of old tools. One in particular, though, seems to be causing at least a little confusion, the flask. And from Software's Souls games and Elden Ring, the flask is a mainstay of your kit, a refillable potion holder that acts as your main source of healing in combat. Usually, the flask is one of several consumables, and you'd cycle through them and use them mid combat. In Elden Ring Night Reign, the fl the flask is a static element. Uh, you hit the leftmost face button, X or square, depending on your controller, drink it by default, while up on the D-pad becomes your use item option. And so, everyone right now is confused apparently. And",
            "start": 2915.68
        },
        {
            "text": "the leftmost face button, X or square, depending on your controller, drink it by default, while up on the D-pad becomes your use item option. And so, everyone right now is confused apparently. And there's a million things they had in this IGN article of people accidentally drinking flasks. And I thought that was very funny. I like that. Yeah. Eric Van Allen's a terrific reporter as well. Um for Kotaka once he did a whole story about how somebody had duct taped themselves to a ceiling. It's like a famous photo from like a Counter-Strike land party. I remember that. He found the guy who was duct taped to the ceiling. Like I remember stuff. Good stuff. Uh moving on to number four. Okay. Are we getting worked by the Persona 4 cast members? Uh, if you've been following us all week, you've got Yuri Loenthal coming out be like, \"Hey, everybody's asking, but I'm not the voice of Yasuke in the game.\" Yoske, sorry. Uh, Aaron Fitzgerald yesterday, hey everybody, I'm not the voice of Chia in the",
            "start": 2953.76
        },
        {
            "text": "Yuri Loenthal coming out be like, \"Hey, everybody's asking, but I'm not the voice of Yasuke in the game.\" Yoske, sorry. Uh, Aaron Fitzgerald yesterday, hey everybody, I'm not the voice of Chia in the game. And then today, Amanda Win Lee, uh, blue sky BS since I've had several people ask me, \"No, I wasn't asked to voice Yuko in the P P4 remake.\" To which there was a quote tweet from Oscar Explosion who said, well, there's a third. Interestingly enough, the way these announcements are being made is weird because it's been done in the same order that your characters are added to your party. First Yoske, then Chia, now Yuko. Uh, I'm going to call shenanigans on this if Matt Mercer makes an announcement next. It could also be Troy Baker, but I digress. To Mike Minady, of course, surfaced this to me, who said, \"Oh my god, they're doing it in the order their characters join your party.\" Stephen, is this all [ __ ] fake? Are they all back for the Persona 4 remake? I mean, you're you're a",
            "start": 2997.2
        },
        {
            "text": "to me, who said, \"Oh my god, they're doing it in the order their characters join your party.\" Stephen, is this all [ __ ] fake? Are they all back for the Persona 4 remake? I mean, you're you're a wrestling guy. You know how this is. I am. But it seems odd for Atlas, for Sega Atlas to do this, for Persona, one of their big and why make the audience mad, I guess, just to make them then be happy. But like, you're going to take a week of getting hit over the head with the the your stupid bar. Like, what's going on? I mean, how many uh consecutive uh installments of this show have they now been mentioned in? God damn it. They played us like a fiddle. Keep your eyes peeled everybody because if this if it is Mercer or Troy on Monday then you're going to get somebody each and every day till the Xbox showcase or SGF I guess when they announce it. But that would be such a weird but fun I guess in the long run low-key way to do this. It would be kind of funny. We'll figure it out. Uh number",
            "start": 3037.76
        },
        {
            "text": "Xbox showcase or SGF I guess when they announce it. But that would be such a weird but fun I guess in the long run low-key way to do this. It would be kind of funny. We'll figure it out. Uh number five, uh good news, which is always nice, especially about Game Informer. Game Informer's archive just got bigger. This is Matt Miller over at Game Informer. Today, we're happy to reveal an expansion to an already exciting perk we provide to Game Informer account holders. Since Game Informer's return in March, we've offered a backlog archive of all of our magazine issues going back to 2012. With today's expansion of that archive, we're now growing that archive to include all Game Informer magazine issues going all the way back to issue number one, first published in 1991. The expanded archive was put together with the help of the video game history foundation, the preeminent organization chronicling, celebrating, and teaching about the history of video the video game medium. In particular,",
            "start": 3083.44
        },
        {
            "text": "put together with the help of the video game history foundation, the preeminent organization chronicling, celebrating, and teaching about the history of video the video game medium. In particular, special thanks are due to the website Retro Mags and fan scanner Bogus Frank, whose efforts to track down issues and preserve gaming magazine history now help us access our own company's history and share it with you. In the coming months, we plan to surface specific legacy articles we believe are worth exploring. In the meantime, enjoy this new level of free access to the rich history of gaming we've covered over the last 34 years. And thank you for signing up for an account. New print and digital magazine subscriptions are coming very soon. And a game informer account opted in to receive our newsletter is your best window into securing early bird pricing. So much bad news usually, Stephen. This is great news. the whole Game Informer story um and just some of the struggles we've seen in",
            "start": 3128.48
        },
        {
            "text": "newsletter is your best window into securing early bird pricing. So much bad news usually, Stephen. This is great news. the whole Game Informer story um and just some of the struggles we've seen in games media overall have been having these kind of happy twists or at least not as bad as you feared it was going to be elements to them. And it's good to see that the that Game Informer team that got a raw deal when GameStop shot the magazine down has been able to pick themselves back up and you know not just do new things but as you said just you know they've been able to preserve the heritage and the history of their magazine which I know meant a lot to a lot of people. So and I hope the numbers are huge for them when they go. I'm I'm waiting with baited breath to get my Game Informer subscription and admittedly had let mine lapse years and years ago cuz I stopped going to GameStops and it was one of those like ah I I wish them well and I love it but then have it taken away and be like",
            "start": 3169.44
        },
        {
            "text": "and admittedly had let mine lapse years and years ago cuz I stopped going to GameStops and it was one of those like ah I I wish them well and I love it but then have it taken away and be like oh that sucks. I'm all in for a physical subscription when we get back up and running. But Stephen good game Informer having a magazine again and putting every issue back to number one up as a digital thing is big news. If I wanted something smaller say the tiniest news I needed to know about where should I go? Uh, I think you'd go to our last story, which is the Wii News Channel, where kind of funny covers all the small items that you need to know about. That's right. Number six, Wii News. Uh, the Concord plaque is now over $3,000 in that Goodwill auction we've been talking about for a while. There's still 4 days and 9 hours to go, though, if you want to get in there and get that. Uh, New World: Aternum Season 8 is live uh via Steam. Nine Souls has sold 800,000 copies across all platforms. From",
            "start": 3211.76
        },
        {
            "text": "still 4 days and 9 hours to go, though, if you want to get in there and get that. Uh, New World: Aternum Season 8 is live uh via Steam. Nine Souls has sold 800,000 copies across all platforms. From IGN, Atomic Heart has hit 10 million players two years after its 2023 release. From GameSpot, Rebellion Developments has revealed the release date of Atom Falls Wicked Isle expansion dropping June 3rd. This story-based DLC will send players to a new location called Midsummer Island. And then your final piece of Wii news for the week is from Blair Marnell over at GameSpot reporting. Team Folon's Fallout 4 mod, Fallout London, is one of the most impressive fan-made creations in recent memory. Now, fans of Fallout London have taken it even further with a new mod that brings the game into virtual reality. Fallout London VR is now available on Nexus Mods. And while it wasn't created by Team Folon, uh it builds upon the creation and allows PC VR players to experience the mod in a brand new way.",
            "start": 3252.8
        },
        {
            "text": "reality. Fallout London VR is now available on Nexus Mods. And while it wasn't created by Team Folon, uh it builds upon the creation and allows PC VR players to experience the mod in a brand new way. Unfortunately, it is not playable on Quest VR because Fallout 4 isn't on that platform. But as noted by Video Gamer, Quest owners who have gaming PCs can use their Quest headsets to play Fallout London VR on Windows. And that's it. That was it for the Wii News. But I was happy to have that. I Fallout London is still getting more stuff. It's pretty cool. It's good. I got two puffs of smoke. Two puffs of smoke cuz we like that one so much. Thank you, Kevin. Thank you. Double the Xbox handheld. Don't It's still a sore subject for me. Don't bring it up, please. Uh, I'm going to jump into the super chats before we get out of here. See what's going on. If there's anything more handheld talk, we did all that. Michael James says, \"Stephen, can we get an opinion on the classic moonwalker game?",
            "start": 3300.24
        },
        {
            "text": "chats before we get out of here. See what's going on. If there's anything more handheld talk, we did all that. Michael James says, \"Stephen, can we get an opinion on the classic moonwalker game? Where's emu or night dive to figure that out?\" Well, again, the unnecessary adaptation of a great work of art from one medium to the other. Fair enough. Fair enough. I mean, it's already out there. You could go get Moonwalker and just play it and have your thing, you know, allegedly. Well, I'm saying just like the Yeah. Yeah. Go ahead. Fair enough. Uh Kab says, \"Big Brain, there is no P uh Persona 4 remake. It's a remaster.\" But again, I mean, yeah, still a weird roll out. Oh, it's a little weird. Yeah, that would be that would be weird if it's a semantics technicality like that. Yeah, gotcha. And the final one I'm going to read here before I go to your wrong comes from Motor World Hype. Yo, where's Paris at? Feels like it's been too long since he popped in. Love to the kind of funny crew. Uh",
            "start": 3343.36
        },
        {
            "text": "the final one I'm going to read here before I go to your wrong comes from Motor World Hype. Yo, where's Paris at? Feels like it's been too long since he popped in. Love to the kind of funny crew. Uh we of course love Paris, but if you didn't know, he digitized himself and became No. Uh Paris has been has a real job as you know. And so at like the beginning of May, he was like, \"Yo, I can't be on any shows this month pretty much because I'm all over for work.\" But post SGF, we should have Paris back on a pretty regular clip. Uh I know next or no, yeah, post week, not next week, the week after SGF, I have him booked at least on one reaction thing. So you'll hear from Paris. He'll come in with some I have Paris's hairline. Does that count? No. No. You're you're trouncing Paris in hair. You got way more hair. I got a little bit. There's a little bit of embarrassing that guy. How bald he is. Uh we ask people watching live to go to kind of funny.com/you wrong and tell us what we screw up as",
            "start": 3392.8
        },
        {
            "text": "way more hair. I got a little bit. There's a little bit of embarrassing that guy. How bald he is. Uh we ask people watching live to go to kind of funny.com/you wrong and tell us what we screw up as we screw it up. Kbabs wrote in with just one and said a simple one. Uh Steven said he reviewed Assassin's Creed Syndicate a few months ago. He meant shadows. And yes, he did. I did. I did. Thank you for keeping us honest, Keabs. And of course, thank you Stephen Totillo for joining us today. Uh, people can keep up with you at gamefile.news. Right. Indeed. I love it. I really do. You're doing great work over there, Stephen. I hope you know that. I hope I hope you're seeing the fruits of that labor and people are telling you that. I appreciate it and I appreciate all the support. Anybody checking it out, whether you're a paid reader or even a free subscriber, uh, free reader, it's awesome. It It really means a lot. You know, journalism overall is in a precarious state. and any support you can",
            "start": 3429.76
        },
        {
            "text": "it out, whether you're a paid reader or even a free subscriber, uh, free reader, it's awesome. It It really means a lot. You know, journalism overall is in a precarious state. and any support you can give to anybody who's reporting news that you care about, whether it's here kind of funny, whether it's gamefile or when any aftermath, any of the great outlets that are out there. Um, it's awesome. You know, just pay attention to the bylines and who's telling you the truth about things and and give them your support if you can. Hell yeah. Uh, am I going to see you at SGF next week? Indeed. Sure. Fantastic. Of course, everybody, there's so much coverage next week on Kind of Funny for the Switch 2 for SGF. You've heard us rant and rave about it. And if you haven't, you won't be able to escape it on Monday. For now, you can't escape the games cast, which is hurdling at you next. It of course is our preview slmy preview of Hell is Us. So, strap in for that. Stephen, thank you so much for",
            "start": 3468.8
        },
        {
            "text": "it on Monday. For now, you can't escape the games cast, which is hurdling at you next. It of course is our preview slmy preview of Hell is Us. So, strap in for that. Stephen, thank you so much for your time today. Thanks, Greg. It's great. Everybody, thank you for watching. Uh, until next time, it's been our pleasure to serve you. [Music]",
            "start": 3505.04
        }
    ]
}