{
    "id": 14113,
    "video_id": "V41D7o9h-9Y",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Mike Howard",
        "Rich Lambert",
        "Matt Firor"
    ],
    "title": "When's Crossplay Coming to Elder Scrolls Online? - A Kinda Funny Gamescast Limited Series",
    "description": "Go to https://bit.ly/m/KindaFunnyXSubwaySurfers?r=qr to get special rewards and download it now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748028303,
    "duration": 3832,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to the final episode of The Elder Scrolls Online Podcast. A kind of funny Games Cast limited series. I'm one of your hosts, Greg Miller, alongside the master of hype, Snowike Mike. Hi, Greg. Uh not too happy that you're saying the final episode because I've been having so much fun with these been way too fast getting to spend time with these two guys has been pretty great and uh talking all things Elder Scrolls Online has been pretty amazing. Of course these two guys none other than Rich Lambert of course game director of the Elder Scrolls Online. Hello. How are you? I am fantastic today. Are you going to miss us? Yes, actually. Oh you I'm looking forward to going home but yeah this was fun. Maybe we can maybe we can share you know our characters. Maybe we get to play with a great idea. How many characters do you have, Rich? Too many. Are they on every platform as well? Just everywhere? Uh, I mean technically yes, but I really only play on PC on the",
            "start": 17.28
        },
        {
            "text": "we get to play with a great idea. How many characters do you have, Rich? Too many. Are they on every platform as well? Just everywhere? Uh, I mean technically yes, but I really only play on PC on the regular. Sure. Okay. Okay, fair enough. Okay. And then of course it's Matt Fyro. Of course he is the big cheese. All right. He is the big cheese studio director. Studio director. Zenamax online studios. Yeah. And actually after the after the last episode, uh, Rich and I were talking a little bit about the Robert segment. We were talking about when we were talking about Robert Alman and it's like it's really hard to get across kind of the culture that that we have that results from that. But we were we were trying to figure out a way to say it so that people would understand that that are listening to this. But I I think it comes down to loyalty, right? It's like he was loyal to us, right? It was not a traditional, you know, CEO uh relationship where if he believed in what you were doing,",
            "start": 58.16
        },
        {
            "text": "to this. But I I think it comes down to loyalty, right? It's like he was loyal to us, right? It was not a traditional, you know, CEO uh relationship where if he believed in what you were doing, like he he would literally go to war for you, right? and and we knew that and he knew we would do that for him, right? And we were all pointed in the right direction. Yeah. I mean, one of the reasons I'm here is because of him. You know, I when I started here, Robert had just opened up a small satellite office in the Hunt Valley area to keep a small number of engineers and artists u because they lived in Pennsylvania and they had to drive to Rockville every day and they just that's like what two hours each way, something like that. And they were like, \"We can't do this and he's like, \"What would it take? What if I open something closer?\" And they were like, \"Yeah.\" And he's like, \"Okay, done.\" And he did. That's awesome. Yeah. That's kind of And then Rich was the manager of that office, right?",
            "start": 100.32
        },
        {
            "text": "take? What if I open something closer?\" And they were like, \"Yeah.\" And he's like, \"Okay, done.\" And he did. That's awesome. Yeah. That's kind of And then Rich was the manager of that office, right? And it's all because he wanted to make things work for the team, right? And it's that it just if he believed in something, it it was going to happen, right? Yeah. Thank you for sharing that. It actually leads me to something, but I'll get to that one second. Remember everybody, this is the Elder Scrolls Online podcast, a fourpart series between The Elder Scrolls Online and us here at Kind of Funny. Of course, if you like The Elder Scrolls Online, uh, play the game. Uh, go get the other episodes that are up on their channels. If you like Kind of funny, come get the episodes that are up on our channel under the Games Cast feed. You can get as a podcast, you can get as a YouTube video. You can have a great time. And no matter where you're getting it, please like, subscribe, and share because",
            "start": 145.52
        },
        {
            "text": "under the Games Cast feed. You can get as a podcast, you can get as a YouTube video. You can have a great time. And no matter where you're getting it, please like, subscribe, and share because we couldn't do this without you. Just like The Elder Scrolls Online wouldn't be anything without you. It's community. But before we get to the community, which is what this episode's all about in the future and the cool stuff you're doing, I want to come back to this uh leadership question, uh we haven't talked at all about Xbox buying y'all. What's that been like? Cuz from the outside, I think they've done such a great job of keeping it like, no, you are Zenamax Online Studios. That's Bethesda. That's it's its own thing. It's a brand still. Yeah. They bought Zenamax for great games, right? And a great game publisher. So, um, it's in their best interest and our best interest to keep doing what we're doing, right? And so, they they facilitate that. Um, I will say that happened in 2020 and it's",
            "start": 182.8
        },
        {
            "text": "great game publisher. So, um, it's in their best interest and our best interest to keep doing what we're doing, right? And so, they they facilitate that. Um, I will say that happened in 2020 and it's like that was right as the pandemic happened and then Robert passed away right then. So, a lot of change happened very quickly and um, you know, it was it was the pandemic was was tough, right? It was it was it was really hard. We haven't gotten into what that did to ESO and and maybe where our numbers just exploded and our servers melted, but uh, Right. But that changeover happened then and that was the least problematic by far of all the other things that were happening, right? It was literally just smooth, seamless to, you know, we got support from Zenamax and now now it's now it's Xbox, right? So they just let us do what we do. I was going to say, yeah, I I know again this is a new relationship. Obviously, we're about to talk about these COVID numbers and what it did for the game, but",
            "start": 222.32
        },
        {
            "text": "So they just let us do what we do. I was going to say, yeah, I I know again this is a new relationship. Obviously, we're about to talk about these COVID numbers and what it did for the game, but it is that thing of, you know, when we've been talking about Robert Alman and him telling you like, is this going to is this going to be a great video game? This is going to be the best RPG of all time. Go do it. Go do it. Does that seem to be the same case here? Like obviously different. This is an established product that's been running for 10 years live. So, like basically, are they staying out of the way of what you want to do? Yeah, I mean I mean yeah, absolutely. It's like you tell us what what you need. Uh there are a few wrinkles like uh it's more fiscal year based. It's a It's a public company, right? So, the the meetings are a little different, but the goals are the same. And that's Phil Spencer's always begging you for t-shirts to wear. Yeah. I mean, I love working with those guys",
            "start": 266.8
        },
        {
            "text": "right? So, the the meetings are a little different, but the goals are the same. And that's Phil Spencer's always begging you for t-shirts to wear. Yeah. I mean, I love working with those guys because, you know, especially Phil, he's a gamer, right? He understands exactly what we're trying to do in the sense of we're delivering an experience to a group of gamers and we've proven that we can do it, right? And and so as long as we keep doing that, that that that's what he's looking for. Is there anything that interests you that Xbox and Microsoft have done? I think about cloud gaming, right? and having your game just so readily available at a click of a button. Has that impressed you guys? Is that something you take advantage of and think about for the future? Yeah. Well, we did have Stadia. We did. We did have a Stadia client, so we were actually ahead of the curve. Poor one out. But but uh No, no. So, but again, now that we're working with giant companies, right, these things become",
            "start": 303.2
        },
        {
            "text": "We did. We did have a Stadia client, so we were actually ahead of the curve. Poor one out. But but uh No, no. So, but again, now that we're working with giant companies, right, these things become possible, right? We, you know, obviously the Google thing was more of a publishing deal, but with with with Xbox, yeah, we're on XCloud and uh we're on Game Pass and uh right, we didn't have to do really anything to make those things happen. And it's great. Like it's uh that's the cool part of working with a with a giant company that's technology forward thinking. They said the word loyalty and it's really stuck with me, Greg, you know, and I think it's really impressive, right? You talk about loyalty and what Robert meant to all of you and what he kind of brought to it all and what you guys have done with your community and the community right back that loyalty of hey this is 10 years plus of course with you guys on the back end but it's wild I think loyalty is a big one with MMOs of",
            "start": 340.48
        },
        {
            "text": "have done with your community and the community right back that loyalty of hey this is 10 years plus of course with you guys on the back end but it's wild I think loyalty is a big one with MMOs of loyalty from the developers for the fans of hey we you know we expect you guys to deliver and you guys have and on the flip side the loyalty of the fans of hey we're here through thick and thin it could be bad we we're ready for the good stuff but it it it is interesting when you think of 10 years in the word loyalty. It really stands out to me. Yeah, it it's a relationship, right? It's like, you know, they have lots of options, right? And uh a lot of the developer virtual world developer community relationship is trust and and loyalty, right? And and they they trust that we'll do the right things, mostly the right things, right? Because we go back and change things constantly, right? But uh they trust that we're the people that are going to deliver the experience that they want. Yep. When",
            "start": 383.6
        },
        {
            "text": "mostly the right things, right? Because we go back and change things constantly, right? But uh they trust that we're the people that are going to deliver the experience that they want. Yep. When we're talking about this community and this obviously is all about him today on this episode we obviously talked about launch this the giant explosion you're melting servers there the learnings then we talked about console launch in previous episodes okay there's this giant influx you just touched on it is COVID and work from home and everybody being on lockdown is that the next big explosion yeah I mean the chap chapters happened with more wind and somerset and that was a steady increase right nice gentle uh you know like you're talking about with that them coming on over the rolling right and we were successful right we had a lot of players and and and and it was good like but then COVID happened and like every other live service game and game our numbers just o overnight blew up because",
            "start": 424.56
        },
        {
            "text": "we were successful right we had a lot of players and and and and it was good like but then COVID happened and like every other live service game and game our numbers just o overnight blew up because what else are you going to do when you're stuck at home and you can't go out you're going to jump into a virtual world right and uh we we had lots of server issues because this was at that point a six seveny old came and we weren't prepared for an influx like that. So, Greymore launched uh in June of 2020, which is like 6 weeks after we all went home. Yeah. And so, that meant the content was in the can pretty much. We were in testing, you know, for that bug fixing, but the live services aspect of of Greymore when all these players came in and we had, you know, you can go back and look on the message boards and social media, right? It was a it was a time when we had to put a lot of work into server stability and and and bringing more stuff online and uh it was again a good problem to have",
            "start": 469.52
        },
        {
            "text": "message boards and social media, right? It was a it was a time when we had to put a lot of work into server stability and and and bringing more stuff online and uh it was again a good problem to have but it was happening against a backdrop of just you know everything happening in the world. I mean and not to mention I think it's so easy for even the way you're talking about it to us as players to think about we're on lockdown we're at home we just want to play this game you're also developers who have now been forced home and I imagine the entire pipeline is completely screwed up. Well, fortunately, we're a live service game and because we're a live service game, we have the concept of remote access to things and and so we had some of the technology VPNs and everything already built out so that we could access uh stuff from home. So, also we already had a somewhat distributed development environment um um for ESO. So, you could work on one part of the game and another p person could",
            "start": 517.44
        },
        {
            "text": "so that we could access uh stuff from home. So, also we already had a somewhat distributed development environment um um for ESO. So, you could work on one part of the game and another p person could work on the same part of the game and then you checked it in. And so, so you really didn't have an excuse then. I mean we I think we were 3 days off of our original launch date. Amazing. So right but it was the human interaction of course you know the decision-m was slower the being able to identify problems was slower identifying solutions was slower that that's where that's where it really affected us. It was really eye opening to because we always took it for granted. All of those water cooler talks, right? The random wandering around, you see something, you ask a question. Like all of that went away because everybody was now at home and you had to book a meeting in order to get somebody, you know, attention because they're off in their own little world doing things. And so all of that",
            "start": 559.76
        },
        {
            "text": "went away because everybody was now at home and you had to book a meeting in order to get somebody, you know, attention because they're off in their own little world doing things. And so all of that collaborative stuff we had to relearn how to do remotely. And you'd be shocked at how many game development problems get solved by just happen stance when you just walk by somebody's desk and see something or you're in the cafeteria getting lunch and you talk about this problem and you're like, \"Oh, we got a solution.\" And you they solve it there before it becomes a problem. We had to learn, like I said, how to do all of that all over again. And it was it was tough. Yeah, for sure. So then you get that pipeline down. Not that long after, what is almost, correct me if I'm wrong, a year later, you launched the Xbox Series X/S and the PlayStation 5 client, right? We totally forgot about that. Yeah. Yeah. We've done a few things in this decade of this game being live. Yeah, we did that in the",
            "start": 603.0
        },
        {
            "text": "launched the Xbox Series X/S and the PlayStation 5 client, right? We totally forgot about that. Yeah. Yeah. We've done a few things in this decade of this game being live. Yeah, we did that in the middle of the pandemic and that was again we we have our own engine. So, uh it's very scalable and we spent some time and resources to make it support the modern shaders and DLSS and you know all the Yeah. All the the new occlusion system. Uh our graphics guys love that. Yeah. Just love that. As they should. Yeah. Yeah. And it's uh it Yeah. And it looks fantastic. Like it basically brought our PC ultra uh spec to console. Um, and it and it runs great. And it also we could do performance modes. We could do uh 60 frames a second or you could do do fidelity mode at 4K. And so it's just we know it's 60. That's 60. Yeah. Everybody does. It's Yeah. But uh fidelity mode is great if you're doing screenshots and and stuff like that, but you can but you can switch back and forth so easily that that",
            "start": 645.52
        },
        {
            "text": "60. That's 60. Yeah. Everybody does. It's Yeah. But uh fidelity mode is great if you're doing screenshots and and stuff like that, but you can but you can switch back and forth so easily that that you can actually uh choose which one pretty much on the fly. So then start bringing me let's get I want to start bringing you I guess back to community. We're talking about back uh in episode two when we talked about the console launch. Uh one of the things that we celebrated there was 500,000 concurrence across all platforms. Did what did those numbers compare when we're talking to co we got we didn't get quite that much but it was in the ballpark. Okay. Um and again we had launched so much content between 2015 and and 2020 that we couldn't support the concurrency that we did in in 2020. So we did have cues in 2020 for the first time since 2015 and that was to again to preserve the stability of the people that were playing over over people waiting. So and then I want to bring it to as we",
            "start": 693.36
        },
        {
            "text": "did have cues in 2020 for the first time since 2015 and that was to again to preserve the stability of the people that were playing over over people waiting. So and then I want to bring it to as we move fully to the community conversation nowadays. What are you seeing? I know you've tal we talked on the show uh Matt about the player the different types of players and the players who do check in once every 11 months. There's the big drop. I'm good. It's different this year. It's different this year. We're changing it all up. Uh, but like if not, where are we at in terms of what the Elder Scrolls online audience looks like on a day-to-day basis? And I know that's really impossible to put a number on, nor would you probably want to, but like however you want to answer that question. Yeah, I think I'll go right back to the to the pandemic to start with, which is um the mood of the community kind of changed at at that point where it went from being a great game and virtual world to a place",
            "start": 741.12
        },
        {
            "text": "I'll go right back to the to the pandemic to start with, which is um the mood of the community kind of changed at at that point where it went from being a great game and virtual world to a place where I can go where things make sense because the outside world doesn't, right? And we got a lot of feedback from our players that just like other games kind of like this, you know, like uh Animal Crossing and, you know, where you can just go and live a virtual life that's not part of your your normal day-to-day routine was very important to a lot of people. And we saw an explosion in housing videos because a lot of people are literally virtually nesting and making a and making a place again that made sense that they could outfit that made them feel better about about what was happening. And that was uh you know that's that's almost a responsibility at this point for for us to to do that because we know it was so important to people maintaining their sanity for uh for that time. So the mood",
            "start": 780.32
        },
        {
            "text": "was uh you know that's that's almost a responsibility at this point for for us to to do that because we know it was so important to people maintaining their sanity for uh for that time. So the mood kind of changed at that point from you know to people that literally were doing housing more than than than a lot of other players were doing questing or PVP. Sure. And uh it was really cool. Right. It's like they took the tools that we gave them and started, if you look at housing videos on YouTube for ESO, it's not houses, man. They make animated robots and and uh balloons. I It's just crazy. Uh uh somebody did a Japanese medieval village in uh in our housing system and it's it's crazy stuff we would never would have would have thought of and it's it's amazing and we're really happy that we can support that. Right. So coming out of the pandemic that stayed, right? that that that that concept of like it's a it's a place now, not a game. And so a lot of people come and come into the game",
            "start": 826.32
        },
        {
            "text": "can support that. Right. So coming out of the pandemic that stayed, right? that that that that concept of like it's a it's a place now, not a game. And so a lot of people come and come into the game not understanding that and then they see YouTube and everything and and and it's it's a different vibe than you're expecting if you're used to Call of Duty or or Diablo or That was true. Yeah. Right. And so that's kind of where the community is now, which is like it it grew in not just in size, but it grew in understanding of what the virtual world that they're in is. Is that I was just going to say the community now, you know, when they're talking like FPS, you know, high FPS and things like that, it's not like performance of the game. It's it's fashion per second now, right? Like that's that's their thing. I love it. I love it. That's their thing now, right? So that as Matt said like that conversation kind of changed from kind of power gaming traditional to that I can do whatever I want,",
            "start": 868.4
        },
        {
            "text": "their thing. I love it. I love it. That's their thing now, right? So that as Matt said like that conversation kind of changed from kind of power gaming traditional to that I can do whatever I want, be whatever I want and look as cool as I want. So then back for to something we've talked about on this show. There's no right or wrong way to play this the you know the do you feel like that's really where that message comes from and took off like before that but when it was just was it just questing and it was guilds and it was traditional in quotes MMO. No, no. I I Well, at launch it was at launch it was, but once we did one Tamriel and got and got Yeah. it turned into a you can play the game many different ways and all of them are fine. And I think the pandemic just added one more of those things to do which is you don't even have to do combat just go in and do the housing system and uh you know and you don't have to do any of this stuff and just show off your house and invite friends",
            "start": 914.4
        },
        {
            "text": "things to do which is you don't even have to do combat just go in and do the housing system and uh you know and you don't have to do any of this stuff and just show off your house and invite friends over if right and it just added another activity that is now very important and central to the experience. And I guess that's the big question I would ask you is like why is community so necessary essential to your game? Like obviously players equals money. Yeah. I mean, I we know the financial, but I mean, it's that idea again that I've said on this show throughout all of these episodes of like I could talk your ear off about the games that haven't made it, that didn't do the thing, that even had a community and still didn't make it, but somehow 10 years later, you are all still rolling and still pushing giant updates and making changes. Yeah, I mean that's a that's a really good question and and I think ultimately what it comes down to is the game draws the community. Um, and I this is",
            "start": 958.64
        },
        {
            "text": "still pushing giant updates and making changes. Yeah, I mean that's a that's a really good question and and I think ultimately what it comes down to is the game draws the community. Um, and I this is one of the things you like to say is is it's their game or like we created it. It's it's our game initially and then after launch it becomes their game and we do what essentially what they want us to do with some caveats in there. Otherwise you get like Bodie McBoat Face and stuff like that. But um but yeah, like you have to listen to them. You have to look at what they're doing and and we try really hard to be a part of that community. You know, we do a lot of different um community events. You know, the tavern is one of our favorites that we do, which is coming up in July in German. Know what that is? It's a big It's an event. We started in 2013. 13 or 14. Yeah, something like that. Um, and it's just a community get together for, you know, anybody that's in the in the German area. So,",
            "start": 1004.16
        },
        {
            "text": "that is? It's a big It's an event. We started in 2013. 13 or 14. Yeah, something like that. Um, and it's just a community get together for, you know, anybody that's in the in the German area. So, it's usually traditionally has been around Gamescom. Sure. We do it a month earlier now because we can get cooler venues and stuff like that in around there. Last year, we did in a castle. Oh, wow. It was awesome. Um, and they get players from all all over Europe. all over Europe. Mike, let's go. Yeah, let's go. You should absolutely go. It's it's it's just it's the best group of people and it's uh they look forward to it cuz they get to see their their friend their virtual friends in person, right? Relationships are are made like we can make that happen. Talk to me about that and blow it up from just not just Germany, but like what are the what do you remember the first story from the community that made you go, \"Wow.\" And then like other crazy ones that have happened since then. There's so",
            "start": 1046.76
        },
        {
            "text": "just not just Germany, but like what are the what do you remember the first story from the community that made you go, \"Wow.\" And then like other crazy ones that have happened since then. There's so many. There's there's so many and they're all they're all good. Some of them are pretty heartbreaking. Some of them are uplifting, right? It's like, you know, we all when a when a when we lose community members, it's always a big deal. And there's, you know, in-game remembrances and things, and that happens far too often, frankly. Um and we help wherever we can with those. But um certainly couples have met in the game, met then met in real life, gotten married and are now now have kids and bring them to the community events and you know and it's like it's hard not to just get emotional when you see that because it's like that wouldn't have happened without without what we did for sure. Right. And that's what the game is, right? It's not it's not waving swords around and and damaging",
            "start": 1092.8
        },
        {
            "text": "you see that because it's like that wouldn't have happened without without what we did for sure. Right. And that's what the game is, right? It's not it's not waving swords around and and damaging monsters, right? It's about connecting with people virtually and then you know in real life if if you meet them and that that's the magic. Yeah. One of my favorite stories is actually from the tavern. So, one of our first taverns, we're in this little basement dungeon thing. There's about 100 100 people there and we did a bunch of cool events and whatnot. Um, but we met a few of the content creators and a few people in the community and then the following year more came and there was this one, you know, really nervous young lady who, you know, brought me this this she said her English wasn't good, but it was fabulous. It was it was perfect. Um, and she wanted to show me a bug, right? Like about this particular item, you know, show me this bug. And I was, \"Okay, cool. Thanks.\" We took it back",
            "start": 1130.0
        },
        {
            "text": "but it was fabulous. It was it was perfect. Um, and she wanted to show me a bug, right? Like about this particular item, you know, show me this bug. And I was, \"Okay, cool. Thanks.\" We took it back to the team, we got it fixed. The next year, she came to the tavern again. But this time, she had met somebody at the tavern previously. Nice. They were now a couple. Fast forward a few years, they missed last year's tavern because they were having a baby and they were together. And when we went back for Gamescom, um, we ended up having dinner with them. I brought the the the kid out to for us to meet and all that other stuff. So that's incredible. Like yeah, they would have never have met if it wasn't for ESO and that's just super super cool. What about uh developers on the team? I assume I like I I mentioned it earlier and from the direct a few weeks ago, months ago. Uh the fact that one of them is talking about the starter area I'm working on, but I of course started like how many of the",
            "start": 1172.0
        },
        {
            "text": "I I mentioned it earlier and from the direct a few weeks ago, months ago. Uh the fact that one of them is talking about the starter area I'm working on, but I of course started like how many of the How old do you feel? Everyone out there was like, \"Oh, I've been listening to you, Greg, since I was in junior high and they weren't for me.\" And I'm like, \"Ah.\" Yeah. Yeah. 17 years, 18 years is a long time, right? A lot of uh you know, it's in in that sense like when we've been here for so long and have had a studio where so many people worked and some have left and gone off to do great things, right? And it's it's it's hard not to feel pride at right almost parental, you know, that the people that you mentored that were interns that then went into the team and now go off and start companies and make great games, right? You know, we're recording this during GDC, right? So this I'm seeing a lot of them now because, you know, we all get together, you run into them, you know, in a hallway",
            "start": 1215.68
        },
        {
            "text": "and make great games, right? You know, we're recording this during GDC, right? So this I'm seeing a lot of them now because, you know, we all get together, you run into them, you know, in a hallway and it's like it's it's a really really really good feeling. Yeah. It's it's so so much fun to watch people grow. Yeah. especially, you know, like Lauren was the one that you were talking about. She before she was on the team, she was a a player, you know, a player that was really enthusiastic and really passionate. Um, and we ended up hiring her. We have a number of people on the team who was also in the Carrie came from that, you know, Alec came from that, right? Where, you know, they were just they were vocal people in the community that we were able to, you know, work with and hire and they turned into these juggernauts, which is awesome, right? See, watching people grow is just so cool. Yeah. The the best part of management is hiring people that are better than you and uh that and we",
            "start": 1258.24
        },
        {
            "text": "turned into these juggernauts, which is awesome, right? See, watching people grow is just so cool. Yeah. The the best part of management is hiring people that are better than you and uh that and we are definitely at that point. If you saw the direct, right, you'll see the result of that, right? They're amazingly good people that are that are very good at what they do. Talk to me about how you listen to the community. Again, you know, we've talked so much throughout this series about how great the community is, how you, you know, strive to drive out toxicity and that's not what it's about. But then there's also been an underlying current from both of you of like, oh well, the community requested this or they wanted this or two weeks after, you know, all the bad YouTube videos people were making for no reason, we had this core group that's like, hey, we agree there's problems, but we're here for the right reasons. Where do you go to find them or do they find you? Everywhere. So I I",
            "start": 1299.52
        },
        {
            "text": "making for no reason, we had this core group that's like, hey, we agree there's problems, but we're here for the right reasons. Where do you go to find them or do they find you? Everywhere. So I I spent a lot of time on Twitch, spent a lot of time on social media. You know, one of my favorite things to do is to just lurk. A poorly kept secret is Rich and I are both in guilds in game and and we're with people who have no idea who we are. Sure. And I've been in I've been in guilds since since day one that I'm an active member in and they have no idea who I am. And and Rich is the same. And we get a shockingly really good amount of information from just playing with people in the game. Even if they're not talking, just seeing what they're doing. Like uh I can complete this dungeon in 30 seconds if you do this exploit. You know, it won't be tomorrow. Yeah, we'll fix that. Right. And and that that literally happened. And and so it's it's fun a just to play your own game. And Rich and I",
            "start": 1339.12
        },
        {
            "text": "if you do this exploit. You know, it won't be tomorrow. Yeah, we'll fix that. Right. And and that that literally happened. And and so it's it's fun a just to play your own game. And Rich and I probably played this game more than any other people because we have to play it before on the on the dev server and then we play it on PTS when it's being tested and then we play it on live when it's live on on all the Right. So, uh it it's it's a commitment, right? But when you're in it with a community and you're seeing it from their eyes is when is when you can actually see the things that need to be done. And we're not perfect at it obviously, right? But but it really gives us a the right perspective. Yeah. And we get to experience the same pain. We get to see the same things. You know, I during COVID got bored and started streaming ESO for a while. So I did that for a while and and that was cool. I got to see that side of things and understand what, you know, a lot of the streamers go",
            "start": 1379.04
        },
        {
            "text": "COVID got bored and started streaming ESO for a while. So I did that for a while and and that was cool. I got to see that side of things and understand what, you know, a lot of the streamers go through. So, that was a new perspective for me and I got to see that stuff and and um we do community night trials with a number of folks where we used to call it tipsy trials um where we might get a little uh we might drink a little might indulge. We might indulge. That's the word I was looking for. And just have fun, right? We go and we we do the thing and you know it's a once a week commitment, but it's it's tons of fun and people love it. Have you been surprised uh by the community, the PC side, the console side, the Xbox to PlayStation side? Like is there if I've learned one thing from this entire thing, it's that there are hardcore console players and there are very very very not hardcore PC players, right? It's there it's that is not a thing, right? We have super hardcore console",
            "start": 1422.0
        },
        {
            "text": "this entire thing, it's that there are hardcore console players and there are very very very not hardcore PC players, right? It's there it's that is not a thing, right? We have super hardcore console players, right? And and a lot of our housing community is on is on PC. It's just it's just what it is. And right at this point, the device you're playing on is just a a door into your world. And it really doesn't matter how you get there. Once you're there, you do what you do. Yeah. Gamers are gamers. Yeah. It's funny you say about the door. Once you're there, you're there. It's just a device. You know, you all put out a call for questions for this show. Oh, boy. Did we? You did. I was not aware. You opened You open the net on the open net on that one and like every other question was crossplay. Oh. Oh. I know you. I I I know you gentlemen very well. Now, I know that there's been a lot of whiteboards. I'd imagine this is something that's come up a lot probably for a very probably since",
            "start": 1463.76
        },
        {
            "text": "Oh. Oh. I know you. I I I know you gentlemen very well. Now, I know that there's been a lot of whiteboards. I'd imagine this is something that's come up a lot probably for a very probably since console launch, if not right before it. Yeah, we get that question a lot. Why is it not possible? Anything is possible. We're we're working on doing some underlining underlying tech changes that would make it possible. Okay. Like uh we know how important it is. again started working on this game in 2007. Didn't even think about two platforms, much less uh six or whatever whatever we support now. And everything's an Xbox if you didn't know. So yeah, I mean the 2007 version that actually makes it easier now. That whole concept, right? the the this is an Xbox thing because that philosophy now comes from the top and that makes it easier to get the agreements done to do right to do what you need to do to do crossplay which is an extremely long GDC presentation of of technology uh you know",
            "start": 1508.56
        },
        {
            "text": "comes from the top and that makes it easier to get the agreements done to do right to do what you need to do to do crossplay which is an extremely long GDC presentation of of technology uh you know handshaking other technology you don't just flip the switch you don't just flip the switch but it's not just a technology problem either yeah oh yeah stakeholders yeah platform owners yeah so it's something we know about it's something we really want to do we're working on the underlying tech for it and we'll see if we can make it happen. That's awesome. Yeah, I can only imagine building a 2007 game, you know what I mean? And not how do you ever future proof think about this and stuff? So, even having that answer is good enough. So, there you go. Everybody got asked. You don't have to ask it every time on every other question about it. But again, that's what we're talking about is your commitment to this community. And honestly, again, even as an outsider for the most part, right? uh who's",
            "start": 1558.72
        },
        {
            "text": "time on every other question about it. But again, that's what we're talking about is your commitment to this community. And honestly, again, even as an outsider for the most part, right? uh who's watched your presentations or listened to podcasts or done these things like the way you talk to them. I appreciate that you have answers. So many people will dodge things and not not and dodge is actually too that's too negative of a word. You know what I mean? But find a way to cleverly get out of the question. Yeah. Just not dodging. We really want to do crossplay. Like that's we really want to do it. I I I swear we this is something that we understand is very important to players. We want to do it and we're trying to figure out a way to do it and we're working on that right now. Okay, good. Thank you for that and thank you for watching it. Remember, of course, this is the Elder Scrolls Online podcast, a 4 episode limited series from us at the Kind of Funny Games Cast. If you like it, why",
            "start": 1599.76
        },
        {
            "text": "you for that and thank you for watching it. Remember, of course, this is the Elder Scrolls Online podcast, a 4 episode limited series from us at the Kind of Funny Games Cast. If you like it, why don't you like, subscribe, share, uh follow, tell your friends, do whatever it is for the platform of choice that you're on, whether it's over on the Elder Scrolls Online's channels or if it's over on the Kind of funny channels. Uh no matter where you're getting the show, thank you for your support. And for now, here's a word from our sponsors. This episode is brought to you by The Elder Scrolls Online. Every legend starts somewhere, and in ESO, it starts with you. Join the millions of players in the awardwinning online fantasy RPG. Write your story into a vibrant chapter of Tamreel's distant past and discover a world steeped in adventure and possibility. ESO is more than a game. It's a virtual world where you belong. This year, ESO is breaking the mold, and introducing the content pass,",
            "start": 1638.56
        },
        {
            "text": "past and discover a world steeped in adventure and possibility. ESO is more than a game. It's a virtual world where you belong. This year, ESO is breaking the mold, and introducing the content pass, complete with two new dungeon packs, two-part story content, a brand new zone to explore, and a worldchanging in-game event, all released throughout the year. And talking about story, 2025 brings us the Seasons of the Worm Cult, a direct sequel to ESO's main story. Travel to the never-before explored island of Solstice, where worm cult activity is surging. It's up to you to unite the three alliances against this old foe that has mysteriously returned. Pick up The Elder Scrolls Online now on PlayStation, Xbox, and PC. This episode is sponsored by Subway servers. The goated endless runner that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway",
            "start": 1679.04
        },
        {
            "text": "that carried me through middle school, high school, college, and now adulthood is celebrating their 13th birthday, which also marks their 200th World Tour update. And they're going big because Subway servers decided to travel to not one, not two, but 21 different locations in their 200th World Tour special event. It's kind of funny as Resident Zoomer. I can seriously say that I adore Subway Surfers. It's one of my favorite comfort games. Grabbing items, completing challenges, and pulling out a hoverboard right as I'm about to hit a train feels just as good now as it did when I was sitting in the back of Mr. Coburn's Spanish class. Play through all 21 destinations to unlock amazing rewards such as characters, hoverboards, and in-game currency. Just tap the 200th World Tour button on the screen to start playing. And exclusively for best friends, head over to kind offunny.com/subwayers or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so",
            "start": 1725.44
        },
        {
            "text": "to start playing. And exclusively for best friends, head over to kind offunny.com/subwayers or scan the QR code on screen to get a ton of special in-game rewards. The update ends on June 1st, so scan that QR code, download Subway Surfers, and start running if you don't want to miss out on all the rewards. I already did. This episode is brought to you by Factor. When life gets busy, food can sometimes feel like a chore. And the fast food trips can go from a weekly to daily occurrence very, very fast. So, buck those trends and make this season your best with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. With 45 weekly menu options, you can pick gourmet meals that fit your goals. truths from calorie smart protein plus keto and more. We at Kind of funny love factor meals. Bless and Greg love it for a quick lunch in between shows and I adore it as a healthier alternative instead of the dreaded",
            "start": 1768.64
        },
        {
            "text": "smart protein plus keto and more. We at Kind of funny love factor meals. Bless and Greg love it for a quick lunch in between shows and I adore it as a healthier alternative instead of the dreaded hump day too tired to cook drive-thru run helping me to get on track with my goals. Get started at factormeals.com/kindafoney5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.comkindfunn5050 off for 50% off plus free shipping. factormeals.comkindofunn50 off. Michael. Yeah, I want to talk a little bit about the community cuz we've talked a lot about PvP, but we haven't really dove into it and that is something that brought me on. I can remember watching Twitch streams of the giant scale battles of three different factions colliding in the middle and I thought that is some of the coolest stuff around. What is PvP like now in 2025 and beyond? What are some of the steps that you've taken to really make",
            "start": 1816.4
        },
        {
            "text": "different factions colliding in the middle and I thought that is some of the coolest stuff around. What is PvP like now in 2025 and beyond? What are some of the steps that you've taken to really make sure it is kind of futurep proofing it? Constantly evolving and getting better. Well, we just went through a series of pretty pretty crazy tests on live towards the end of March and and we're recording this before the test happen. So So literally they're experimental tests. So So we don't know how they'll turn out, but we're confident that information will come from them that we can use. The whole goal of doing this test is to prove out performance, some of the performance problems that we've had in in Ciridol and in the larger scale battles. Um, and it's it's focused really on the abilities, the combat, how much we can jam through kind of that pipe. You think of a fire hose. Yeah. It's only so big. You only get so much water through there. That's basically what what we're we're testing",
            "start": 1865.28
        },
        {
            "text": "the combat, how much we can jam through kind of that pipe. You think of a fire hose. Yeah. It's only so big. You only get so much water through there. That's basically what what we're we're testing right now. And and on the ability side of things, if that goes well, we have a direction. And if it doesn't go well, well then we're going to go and have a think about what we do next. In Siridil, um, but outside of Ciridil, we've got Battlegrounds. Those came in in in Morwind in 2017. Um, we've got Imperial City, which is this hybrid PvE PvP thing, which is tons and tons and tons of fun. And the story line is phenomenal in there. You know, the Drake of Blades is awesome. That whole story line is really cool. So, there's and then dueling, right? So, those are kind of the the avenues for our PVPers to to uh to get their thing on. Yeah. Going back to the beginning of the project, obviously the original mandate for the product was Dark Age of Camelots PvP, WoW's PvE, Elder Scrolls IP, right?",
            "start": 1910.88
        },
        {
            "text": "to to uh to get their thing on. Yeah. Going back to the beginning of the project, obviously the original mandate for the product was Dark Age of Camelots PvP, WoW's PvE, Elder Scrolls IP, right? Uh we've gotten away from many of those in for business reasons, right? Uh you know, that we talked about in episode one, but the PvP thing is is is still there. It's just that it happened that our user base, the massive numbers of users came in and were not interested in PvP. However, a very important part of the community is massively interested in PvP and uh by by giving the PvE questing uh people abilities um all of the armor sets doing the champion system, right? uh doing the PV gear chase that adds items literally to to the game and each one needs to be a little unique and special and each one requires some CPU uh when when the player does it in the game and when you add that to a PVP system where 900 players are in are in game at one time it's stopped being able to work basically so",
            "start": 1952.08
        },
        {
            "text": "one requires some CPU uh when when the player does it in the game and when you add that to a PVP system where 900 players are in are in game at one time it's stopped being able to work basically so instead of instead of taking away over historically instead of taking away a lot of the abilities and and and that sort of thing we actually just scaled down the number of people that were allowed in in a serial campaign at once. And the point of these tests is to redo the ability system just in Ciridil, just in the PvP part of the game and get back up to the 900 that uh that we had, which was 300, 300, 300. So, it's it's a three-sided PvP game. So, it's a natural evolution of the game. And and I know our PVP players that really want to go back to that have been very frustrated with us. But there are four or five other groups of players that also want content that are massively frustrated at us for not giving them uh you know stuff faster. So you know we did do battlegrounds. We did things",
            "start": 2007.6
        },
        {
            "text": "are four or five other groups of players that also want content that are massively frustrated at us for not giving them uh you know stuff faster. So you know we did do battlegrounds. We did things that we that we do were smaller sided PVP to try to alleviate some of that um in the interim. But now it's time to go back and actually look at the PVP system and and make it performant. And it's going to come if this test works. It'll be you have a separate set of abilities in PvP than you do in PvE. They're named the same they are in PvE. It's not that. It's just they just act a little differently in PvP to be much more performant. Gotcha. How Thank you for coming to my TED talk. No, I thank you for open up the door. I love you. Like we're testing it. We're trying. The question I would be out of that one is how maddening is it to have a game that has all these different types of players. We're talking about PvE, we're talking about PvP, we're talking about people who are just designing",
            "start": 2056.56
        },
        {
            "text": "of that one is how maddening is it to have a game that has all these different types of players. We're talking about PvE, we're talking about PvP, we're talking about people who are just designing homes. And you just said, you know, we hear the PVP people yelling at us, but we also have these five other groups yelling at us. First off, what what when you look at it, what are the groups? And then how do you keep them all happy without losing them? It's you have to do what you think is right at the time. Right. Right. It it's a constant weighing you know resources versus pandemic versus uh you know servers melting because too many people are like right all these take resources to deal with and so which is why we haven't been able to do PvP for a long time because the servers melting as part of uh part of the pandemic was directly would have directly affected the number of people in Siridil because it was a CPU too many people on the servers problem. Yeah. So, right, there's always",
            "start": 2094.96
        },
        {
            "text": "part of uh part of the pandemic was directly would have directly affected the number of people in Siridil because it was a CPU too many people on the servers problem. Yeah. So, right, there's always reasons, and I know they sound like excuses of the players, and frankly, I understand that because I I love the PVP system, too. And I would really love to go in like it was on launch day. You know, it was just swarms of players like, you know, everywhere, which is which is awesome. It was wild. It was cool. Do you remember this? You remember this very well. There's nothing like that. Like that feeling of just massive numbers of players like, you know, Braveheart style running into battle and it's it's awesome. There's literally my my favorite part of of of the game. And uh so this experiment that we're doing is kind of this new when we're talking about seasons and changing things. This is something we could not have done in the chapter model because we were forced to launch something",
            "start": 2138.32
        },
        {
            "text": "that we're doing is kind of this new when we're talking about seasons and changing things. This is something we could not have done in the chapter model because we were forced to launch something every June 1st and we just didn't have the resources to to do things like this that took obviously engineers away, designers away. So now that we're stretching the the motto out so we're not launching content quite so big content quite so often and definitely not on the same calendar day every year it gives us the chance to pry out these six 8w week tests that the time to develop them 3 months whatever it takes that we can do these experiments right and now if this works right we have the basis for a system that then we can flesh out into a real real new seridil that has its own kind of gear orability chase that's much more performant yeah and the the part to that as well is there's just some problems that are much harder to diagnose than others. And with with Ciridil in general, all of that",
            "start": 2178.56
        },
        {
            "text": "chase that's much more performant yeah and the the part to that as well is there's just some problems that are much harder to diagnose than others. And with with Ciridil in general, all of that happens because of load. And so trying to reproduce that amount of load on a full server internally for us is super hard. Like we use bots and things like that, but a bot can't replicate what a player does. And so like trying to track that stuff down and we've done a ton of these types of tests over the years like Ed Tofo and Brian Wheeler, you know, Brian Wheeler is our lead combat and PvP designer and Ed TFO is [Music] CT tech director now studio tech director um who did a lot of the server stuff. They worked hand in hand for like 3 years working on the servers trying to get the performance better and it helped significantly but it still didn't bring us over the that threshold where players stopped feeling that that input lag that lag. So then we started doing tests like well let's turn the",
            "start": 2223.04
        },
        {
            "text": "and it helped significantly but it still didn't bring us over the that threshold where players stopped feeling that that input lag that lag. So then we started doing tests like well let's turn the champion system off in siridol. Let's turn proxets off in siridol. Let's turn group healing you know on so no NPCs no wonder right drop a bomb on it. We went through a ton of different things. And so this this serial test that we're doing um or have done by the time this goes goes live um is that next evolution in there to kind of go through and incrementally test where the problem is and it's maddening to us because we can't fix it. We can't right like it's it's really really hard to do. So that's again that probably sounds like an excuse. No. Yeah. Well, well, to illustrate and and this is a uh a very live service game design story like so there are you know every every gamer knows uh FPS frames per second course. So that 98% of the time that's that's your client and that's how how many",
            "start": 2269.36
        },
        {
            "text": "uh a very live service game design story like so there are you know every every gamer knows uh FPS frames per second course. So that 98% of the time that's that's your client and that's how how many frames it's displaying on your screen you know per second. There's also server frames per second which is how which is how how many how many cycles a server can perform every frame. And so, uh, the problem with our PVP system is it just like on a client, our server gets bogged down when too much stuff goes through it and the FPS goes way down. So, uh, we actually over over time when our players were thinking we weren't doing anything about PvP, we actually got our server frames for for Siridil from like 700 down to 300, right? You know, which is like half, which which is a miracle that we did that. But the problem is anything over like 70 was unacceptable to the players. Right. Right. And so we cut it down by literally literally we doubled the the number of frames and yet it it wasn't",
            "start": 2315.52
        },
        {
            "text": "did that. But the problem is anything over like 70 was unacceptable to the players. Right. Right. And so we cut it down by literally literally we doubled the the number of frames and yet it it wasn't enough for the players to notice. And that's why we're now doing this when we realized that hey we had done everything. We actually made it so much better on the server yet it's still not discernible to the players and now we know we need to Yeah. And for the vast majority of the time like the server frames are really really good. They're below that threshold. But prime time, right, full pop campaigns, then yeah, there's these hiccups occasionally in there. That's what we're trying to solve. Yeah, video games are hard to make. I feel like in general, let alone this that you're always on the treadmill. Uhhuh. Something's always happening. Yeah. But I guess you know, every day is different. I feel like that's got to be something that again we talked for our very first episode the first",
            "start": 2365.84
        },
        {
            "text": "treadmill. Uhhuh. Something's always happening. Yeah. But I guess you know, every day is different. I feel like that's got to be something that again we talked for our very first episode the first thing we talked about was the you know unspoken synergies right between oh Elder Scrolls Online is 10 kind of funny is 10 this that the blah blah blah the other one I think that I've talked to so many developers about is that it took me a long time but there was a developer friend of mine who released a game that was very wellreceived but she was having a terrible time at lunch because she was reading the comments from the people who didn't like it and I had this moment of clarity talking to her. I'm like, \"Oh man, like you in my world would get to publish a YouTube video once every six years and then look at those comments and do it.\" Whereas for us in kind of funny, there is this joy and pain and everything else of we do this every day and when you don't like it or don't connect with it,",
            "start": 2407.28
        },
        {
            "text": "then look at those comments and do it.\" Whereas for us in kind of funny, there is this joy and pain and everything else of we do this every day and when you don't like it or don't connect with it, we see that comment and we want to iterate on it immediately. And it might not be something we can immediately change, but if it comes to the next big, you know, Patreon push or anniversary or whatever, you see us constantly revising what we're doing to get there. And I feel like your type of game development is so much more like that where you have this line to the community that's there and you see them every day and you see the peaks and you see the valleys and you see the feedback that's got to be again powerful, but again, yeah, 100%. It's that same boat, right? You know, you put your blood, sweat, and tears into something and you release it and then some people love it and some people hate it and some people really hate it and right, you just you you got to deal deal with it and people",
            "start": 2452.0
        },
        {
            "text": "sweat, and tears into something and you release it and then some people love it and some people hate it and some people really hate it and right, you just you you got to deal deal with it and people generally don't complain unless they're really passionate. Great point. And I think I said that said that earlier and so you got to you got to dig into that and see what they're really upset about. Yeah. And and something that I am sure you will you you will agree with because you get it every day too. You definitely after a certain point, we've all been here long enough to with with that internet thing, is that you you can look at a comment and pretty easily tell if it's in good faith. Yes. Right. And even if it's it's full of things you don't want to hear, if it's in good faith, there's something there that you should probably take account. And then there are some that's just whatever. Like life goes on. So again, talking about this, what I think is interesting and and very similar to us",
            "start": 2492.72
        },
        {
            "text": "there that you should probably take account. And then there are some that's just whatever. Like life goes on. So again, talking about this, what I think is interesting and and very similar to us is you're saying, you know, there's people who really hate a thing. I assume that like us when that happens they're giving you the good faith to fix it though or to listen to them orally. Yeah. Obviously there's always going to be atrophy people leaving coming and going but like the majority of this audience I feel like would probably be there with you through all of it. Yeah. I mean again it's all about trust. Yeah. And and so you know we have to we have to show up you know with with with the changes. And so as long as long as we keep doing that, I I I think we'll be on the right trajectory. I I've heard you uh both talk about it and and Elder Scrolls Online in general talk about it, but like how the ESO community is the best one in gaming and how toxicity has been cut not out because that's",
            "start": 2533.84
        },
        {
            "text": "heard you uh both talk about it and and Elder Scrolls Online in general talk about it, but like how the ESO community is the best one in gaming and how toxicity has been cut not out because that's impossible, but to such a low level. I want to know from both of you why why do you think that's the case, Matt? Well, we've we've talked about this a lot. Uh we all have our own theories. First of all, the it's a and I I I I say this all the time and I know it it sounds like a shtick, but we are a virtual world as much as we are a game. So, we attract people that aren't necessarily in it to dominate. And whenever you're in a game that's about domination or winning or or competing, right, you get a totally different type of person. Not they sure do, Mike. Yeah. You want to tell your stories of playing Fall Guys and just stopping to throw people off? But but I I think there's something and I know Rich Rich will probably have a completely different answer, but there's something about a game",
            "start": 2578.32
        },
        {
            "text": "playing Fall Guys and just stopping to throw people off? But but I I think there's something and I know Rich Rich will probably have a completely different answer, but there's something about a game that came out of the gate not sprinting that had a group of people that believed in it that then actually started sprinting and those people are there and they're your evangelists and they're like the no these developers, this company, what whatever, right? Stick with them because they're going to do the right thing. And I think there's something to that there like the the lack of immediate giant success meant that we had to fight for it and our community we did have a lot of very supportive community even back when we were a meme right of of and and there were people that were fighting back against that and those are the people I think that are the core of the community that when you log into the game as a new player and they're playing and they ask a question like it's in their best",
            "start": 2627.28
        },
        {
            "text": "against that and those are the people I think that are the core of the community that when you log into the game as a new player and they're playing and they ask a question like it's in their best interest to get a new player in and and teach them how awesome the game is because they want the game to to succeed. And so I think the pay it forward part of that has been a big big big part of our success. Something we haven't talked about that's an interesting call back to you Matt of course is that you wanted to do an MMO for Fallout. Then it that of course didn't happen. You came over here this happens. But then Fallout 76 does happen and Fallout 76 has such a similar story of stumbling out of the gate but having an audience and finding it to it to where of course they have this giant explosion with the Fallout TV show let alone I'm sure CO numbers going up. Did you reach out to them at their launch? Did you How does that relationship work? Yeah. First of all, I love that game. I'm",
            "start": 2670.56
        },
        {
            "text": "with the Fallout TV show let alone I'm sure CO numbers going up. Did you reach out to them at their launch? Did you How does that relationship work? Yeah. First of all, I love that game. I'm actually I actually grew up in West Virginia, so Oh, nice. Like I'm I'm literally I know the map and uh so uh Yeah. Yeah. Yeah. Yeah. So I wasn't part of the team by any means, but but there were there were ideas being bounced off, especially after launch, which is like, you know, how how do you you know, respond to feedback? Uh that kind of thing. But they they're good at what they do, right? You know, it was like anything that I added would have just cemented something that they were already thinking about. So sure, you know, it's not like I had a magic bullet or anything. It's like listen to the community and look at the look at the what people are playing that actually play all the time and do more of add more of what they're doing and less of what they're not. And it's it's just, you know,",
            "start": 2710.0
        },
        {
            "text": "community and look at the look at the what people are playing that actually play all the time and do more of add more of what they're doing and less of what they're not. And it's it's just, you know, basic stuff. But they were already already on that path. Yeah. I I got to have a few really good sit downs with them when they were talking about doing their their version of one Tamreel. or whatever they just kind of give them here's the issues we ran into you know some knowledge sharing and stuff like that but as Matt said they know their game they know what they're doing um we were just there to kind of help when they needed questions answered speaking of knowing your game knowing what you're doing and of course your community again the direct happens you come out you talk about this and again your messaging was so great and even the ad read in this episode I like so much right because it's about you. You keep putting it on the player, right, of like this is your world to go do it in",
            "start": 2750.64
        },
        {
            "text": "again your messaging was so great and even the ad read in this episode I like so much right because it's about you. You keep putting it on the player, right, of like this is your world to go do it in to before we end this podcast, this amazing series, and before Mike and I stream the game today, of course. twitch.tv/configgames, youtube.com/confunny games, it'll be up there forever. Uh, and I'm sure we'll be playing more of it. Uh, my question really becomes then, let's talk about now that we have all this information, what we're about to set off on, what we have set off on, and then even beyond that, where we're going with it. So I guess recapping what's going on right now. Yeah, I'll do the the the bullet point top down. Yeah, the high level and then of course Rich is actually winning all but I I I think the the theme of this like people are focusing on seasons and what that means in other games and uh and you know having either a positive or a negative uh uh opinion based on that.",
            "start": 2794.48
        },
        {
            "text": "but I I I think the the theme of this like people are focusing on seasons and what that means in other games and uh and you know having either a positive or a negative uh uh opinion based on that. It's important that what we're actually doing now is changing the model so we have more time to do things that we need to do that we've been putting off for a long time, right? And chapters were awesome, but the community was starting to send us very clear messages that doing the same thing every year was a little too cyclical. And even though the content was fun, right, hey, maybe you should fix these things. And we literally didn't have the time to fix those things, whatever they were pointing out. So, we could go back to doing one large thing a year, right? that would fit into what we're doing eventually. But what we're doing right now is kind of un unplugging the chapter so that we can free up the teams to do things that we've wanted to do for a long time like continue story guild story",
            "start": 2835.52
        },
        {
            "text": "eventually. But what we're doing right now is kind of un unplugging the chapter so that we can free up the teams to do things that we've wanted to do for a long time like continue story guild story lines like uh you know fix problems in uh in Rivenspire. I don't want to is going to punch me now because we've redone that zone but you know uh fix siridil right uh like all these things have been stacking up and we haven't had the time to do them. This model gives us the time to do those things while delivering great content. It's just it's going to be delivered either a little less often or or it's going to be targeted at a at a specific zone to fix something or to add something. And uh but we're still going to tell great stories, but now we get to react a little more to problems that need to be solved. I think that's the key. It lets us be a little bit more flexible in how quickly we can react to things and do more unexpected things, right? Like that's that's definitely a big piece of",
            "start": 2880.32
        },
        {
            "text": "to be solved. I think that's the key. It lets us be a little bit more flexible in how quickly we can react to things and do more unexpected things, right? Like that's that's definitely a big piece of feedback is yeah this stuff is good but it's starting to feel formulaic. So we want to break that break that mold and and do something different. And why aren't you doing crossplay? Right. This gives us the chance to actually delve into the very difficult technical problems that need to be solved. We could never do that with the chapter model. No. I think you know I think you've made the case for in this episode before we even got to this part of it. Like okay cool. Well here's we can do we're going to go focus on PvP because that community needs it. We're looking into crossplay. What are the other and I'm nobody's holding you to it but you communicate so well. What are the other pain points you see with ESO right now that you'd love to touch on and hopefully get the time, bandwidth,",
            "start": 2925.52
        },
        {
            "text": "the other and I'm nobody's holding you to it but you communicate so well. What are the other pain points you see with ESO right now that you'd love to touch on and hopefully get the time, bandwidth, whatever? We call it modernizing. Okay. Like uh in many ways we've modernized every year. We have a you know ne current gen console client. We have like we are always adding new graphical stuff, right? But there there are still things like we've heard since 2014 that combat is feels very MMO and not very first person Elder Scroll. Interesting. Right. and to make it a little make it a little more visceral and we've never had the time to do that. Like our animations are a little 2014. Our zones are the older ones are a little 2014. Our UI, our PC UI especially, right? It it it's not fantastic and it needs to be updated. We've already announced that we're going to redo that, right? The we have a list of these things and I just picked the top five or six there, right? That's what we're looking",
            "start": 2962.16
        },
        {
            "text": "it needs to be updated. We've already announced that we're going to redo that, right? The we have a list of these things and I just picked the top five or six there, right? That's what we're looking at. There's the the new and returning player experience, right? We've been so focused on putting new stuff in and adding new stuff for the veterans. We kind of lost sight of what's that like for a new player when they come in. Like, holy cow, there's 10 years of stuff. Where do I start? What's the right order? Right. We get that question all the time. And PS, there is no right order, but go build your house. Houses are big. Yeah. Well, you just said this at the uh before we started filming, which was, you know, hey, I'm jumping back in after a while. And holy [ __ ] Right. That's the thing. It's like it's it's overwhelming because the game is so large that especially a returning player that has an idea of what the game was like in 2018 or whenever the last time they played were, it's it's",
            "start": 3006.56
        },
        {
            "text": "like it's it's overwhelming because the game is so large that especially a returning player that has an idea of what the game was like in 2018 or whenever the last time they played were, it's it's a lot different now. And we don't do a good job of reintroducing a player into the back into the world. And my my reaction when you said that was you should just roll a new character. Right. Right. But I'm committed and I got to I like this. And that's the right answer. Right. And I had I had the wrong answer there because I wanted you to see the new tutorial and everything. You don't want that. You want to play the character that you that you played before. Diana, we as developers need to make that experience better. 100%. Yeah. Michael, we're winding down. Uh it's very special. This was a lot of fun, these four episodes. Uh you know, MMOs growing up as a kid, that was my bread and butter. I loved MMOs. I loved this shared world, this experience I got to experience with my friends, and ESO",
            "start": 3048.64
        },
        {
            "text": "of fun, these four episodes. Uh you know, MMOs growing up as a kid, that was my bread and butter. I loved MMOs. I loved this shared world, this experience I got to experience with my friends, and ESO was a really special one for me. So getting to go behind the scenes with you two was a moment I'll never forget and I'm sure the audience will share the same of this was a lot of fun to get to learn uh see the future and just talk which has been great. Thanks you two. This has been a blast for us. We could Matt and I could talk literally talk about ESO for days. Yeah. That's what we do, right? Yeah. But rarely in this depth like this it's it's great to kind of stretch it out and actually explain like a lot of times we're announcing things and players like why are you doing that? You just announce something, right? This gives us the chance to actually explain why we're doing it, right? And and I and even though I know we've left a lot of questions unanswered with some of the things we've",
            "start": 3089.12
        },
        {
            "text": "something, right? This gives us the chance to actually explain why we're doing it, right? And and I and even though I know we've left a lot of questions unanswered with some of the things we've said, right? We're we're trying to get across in this format, which is great, which is we get a chance to explain things a little more and not just announce them. I guess, you know, my big question for both of you, and this is, you know, way back to journalism school at Missou is what didn't we ask you? We got to talk this entire time. We've done these four episodes. cuz you know it's 4 hours of content we've done on ESO but I feel like there's always something that is in the back of your head of I wish we would have gotten to that. I wish we would have done that. Is there something Matt that stands out to you, Rich that stands out to you? And I want it from both of you of whatever it would be. But like I never I you know it's that thing that would when we set set off to do this show it's that",
            "start": 3127.76
        },
        {
            "text": "out to you, Rich that stands out to you? And I want it from both of you of whatever it would be. But like I never I you know it's that thing that would when we set set off to do this show it's that idea of like I want the kind of funny audience to find game development information here and I want the ESO audience to find ESO information here and I don't want to alienate one or the other. So, I don't know if I skewed away from a topic you wanted to get into. No, I didn't have an agenda coming in, but I think the the question, and we might have answered it unsuccinctly over the last four hours or whatever, is is why should you play this game? Oh, yeah. That's a great question. Right. Right. Thought of that. That's a good one. Why should you Hey, cut it out. Put it back. Uh, guys, Matt specifically, why should you play this game? Why should you play ESO right now? Yeah. I well I mean the answer is for if you listen if you get listened to this far into the podcast right you get a pretty",
            "start": 3164.48
        },
        {
            "text": "why should you play this game? Why should you play ESO right now? Yeah. I well I mean the answer is for if you listen if you get listened to this far into the podcast right you get a pretty good idea but it's a game that has a community that will welcome you that doesn't enforce a play style on you that gives you a virtual world to explore based on one of the best known IPs in the world and you can kind of carve your own path in that. Is it perfect? No. But but it's a it's a great game and a great world with a great community. Nailed it. I can't do better than that. Do you have a different question though that you wish I would ask you? Uh I mean you want to talk more about your wife for me I think story of meeting I think I do that enough u no I mean I think that the thing actually maybe I will cuz she she imparted this bit of wisdom to me when I first took on the the creative director role because I was really worried right like if I make a mistake I make the wrong call people lose",
            "start": 3202.88
        },
        {
            "text": "I will cuz she she imparted this bit of wisdom to me when I first took on the the creative director role because I was really worried right like if I make a mistake I make the wrong call people lose their jobs right that was always kind of in the back of my head and she's just like you got to do what you think is right and think about our family just our family dynamic as it She's like, \"When I'm planning meals, we have four, well, technically we have five people at home. She can't make a meal that satisfies all five people. How are you going to make a decision that satisfies millions of people, like all of them at the same time? So, don't worry about it. Do what you think is right.\" And that that really hit hard for me. And it's something that I think about all the time whenever I do stuff is, yeah, we're going to make the wrong call sometimes, but there's going to be people that are going to support it. They're going to love it. And they're they're going to keep playing, right? And",
            "start": 3247.04
        },
        {
            "text": "is, yeah, we're going to make the wrong call sometimes, but there's going to be people that are going to support it. They're going to love it. And they're they're going to keep playing, right? And those that are upset, we will try to hit them. Well, not hit them, we will try to satisfy them, you know, at some point over the course of of the year. That's a fantastic question and answer. Uh, Michael, you what what didn't you get the chance to ask? What do you about it? You know, it's just been so much fun to celebrate and these moments where you have those big announcements. We get to see the wowing trailers and as fans, it is always cool of, wow, oh my gosh, I'm blown away. the hard work that goes behind it and the decision- making of what those are, those characters that may or may not return. What is the excitement level for the team when it is, hey, this is the moment we're going to share this big thing. Who makes those decisions? What kind of fun do you have? Yeah, I mean you Rich",
            "start": 3290.08
        },
        {
            "text": "What is the excitement level for the team when it is, hey, this is the moment we're going to share this big thing. Who makes those decisions? What kind of fun do you have? Yeah, I mean you Rich does too, but you know that with a game like this, with a team this big, with a game that's been around, right, the whole team needs a very clear direction of of where they're going. And so that's what we try to do. You know, both of us are now uh at the point where we're not and we can't get involved so much in the day-to-day decision-m because there's so much of it. But we really try to keep the team pointed at the at the place we're trying to get to. Yeah. And and the team the team loves making new stuff, but they also love going back and bringing back those beloved characters, right? You know, the the razomars of the of the game and so on and so forth. So, they are really excited about what's coming this year and the stories that we're telling and the big event that we're doing and with the",
            "start": 3329.92
        },
        {
            "text": "the razomars of the of the game and so on and so forth. So, they are really excited about what's coming this year and the stories that we're telling and the big event that we're doing and with the the wall and and whatnot. So, yeah, like the team's really really excited about this. They should be. Uh, congratulations. Uh, you know, I think again like you guys have built something so special, but again, even to go watch that direct or hear you talk about it for four hours and the passion and the love and the care and the, you know, this is 10 years of the game. Sure, like we said, but since 2007, right, like it's such a healthy chunk of your lives, your professional careers, and the fact that you've been given this opportunity to grow it and you have and you've changed it like I hope you both are incredibly proud of what you've made and everybody obviously uh back home working on it or and their homes working on it, you know what I mean? how separated the company is. Yeah, it's a great",
            "start": 3374.0
        },
        {
            "text": "are incredibly proud of what you've made and everybody obviously uh back home working on it or and their homes working on it, you know what I mean? how separated the company is. Yeah, it's a great team. You know, it's a it's really a great team that that that allows us to do this and so can't can't speak highly enough of of them. Like we try to set the direction, but but you know, there's a lot of people. It takes a village to do a game like this and we have a good village. Yeah. And and it's it really isn't it's going to sound cliche, but it is really an honor to be able to represent the team. Sure. Right. Like obviously Matt and I don't do all the work. Um, there's a lot of really smart people that are really really passionate about the game and we get to talk about this thing that, you know, they have put their lives into. So, it's it's it's a big honor. Okay. So, two things before we get out of here. Back to you. I need to have you tell me what is everybody excited for? It is",
            "start": 3415.52
        },
        {
            "text": "you know, they have put their lives into. So, it's it's it's a big honor. Okay. So, two things before we get out of here. Back to you. I need to have you tell me what is everybody excited for? It is Friday, May 23rd right now. What is going on? What is coming? What is the big push this year? This is a new way for us to tell stories in ESO, right? This year is focused on the worm cult. You know, this is a continuation of the base game story. There's a brand new way for you to build your characters with our subclassing. So now you can, like I said earlier, you can be a necromancer wardenist if you want, right? Like you you have all of these abilities. I think it's over 3,000 combinations of class abilities that get added to your your repertoire if you want. Um, we've got uh Solstice, which is a brand new island with um some very cool stories um focused mainly around the Argonians and the high elves. Sounds weird, but it makes makes a lot of sense. When you get in there, you start to dig",
            "start": 3452.88
        },
        {
            "text": "a brand new island with um some very cool stories um focused mainly around the Argonians and the high elves. Sounds weird, but it makes makes a lot of sense. When you get in there, you start to dig into there. You start to learn more about, you know, the this outcast group that's there and and kind of doing their thing. Um, and then of course we've got the the big soulwall event which is the first time we've ever done this that's based on servers. So each server will progress their own way. Um, and then we we cap that all off with all kinds of cool quality life improvements um and and whatnot which we didn't really talk too much about um comes under modernization. Right. Right. Comes under comes under modernization. But I think one of the things and um that I will say is our housing community has been really really patient with us in terms of like all the cool things we've we've built, but one of the the pain points for them is just inventory pressure. You know, they have all these",
            "start": 3510.72
        },
        {
            "text": "has been really really patient with us in terms of like all the cool things we've we've built, but one of the the pain points for them is just inventory pressure. You know, they have all these furnishings, all this crazy stuff that they have to kind of manage. A lot of people have storage homes where they store just toss it all in just Yeah. They just Right. And it's like the warehouse in in Indiana Jones% like literally you walk in and you see just rows of top multiple houses that have this, right? And and so we implemented a a furnishing vault or are implementing a furnishing vault where they're going to be able to store some number of these in in their in the vault and clear up a whole crap ton of inventory space. So just lots of things like that. This is a question for you. Lay it on me and then it's going to be a question. I was thinking obviously we're talking so much about returning players, all these different changes, modernization, blah blah blah, but like we're going to",
            "start": 3557.92
        },
        {
            "text": "on me and then it's going to be a question. I was thinking obviously we're talking so much about returning players, all these different changes, modernization, blah blah blah, but like we're going to stream it right now basically, right? Are we rolling new characters? I really would love you to see the new opening area and the tutorial and how they they've redone this cuz I remember day one of what it really looked like and recently I have rerolled a character and I I think it's a great job. But uh Greg, I would love for you to be the most comfortable. So, we're going to stick with our normal characters and we'll find our way and we'll look north and we're just going to go straight to the map. We could cuz like I was thinking the the we have new people watching obviously hopefully they're excited they want to go play it. My question to you guys is what is your advice for a new player on how to start how to play ESO? It's a good one. Yeah. I mean that answer would be colored by the way",
            "start": 3599.6
        },
        {
            "text": "excited they want to go play it. My question to you guys is what is your advice for a new player on how to start how to play ESO? It's a good one. Yeah. I mean that answer would be colored by the way that we play the game but I would which we play very different. We play very different. All right. space in this Camelot game. Yeah. Yeah. But but but when I play Yes. I I do PvP a fair amount, but but I very much like the exploration also. So what I would do is go through the original tutorial, create a new character, and then go to Orsinium, which is my favorite place in the game, which again, it was the one zone that we had two years to make and and it just feels right. and it has some of the best quests in the game that aren't even the main story in that zone is great, but the some of the side quests are unbelievable. But that's what I would do. My advice, and and this is me as a power gamer, but what I would do is just take your time and go slow. And I think the biggest thing that",
            "start": 3638.48
        },
        {
            "text": "side quests are unbelievable. But that's what I would do. My advice, and and this is me as a power gamer, but what I would do is just take your time and go slow. And I think the biggest thing that players need to understand is you're never behind. So you can always play with whomever. So you can just come in and play whenever. Love that. But the biggest one is there is nothing you can do to your character that you can't undo later on easily. So just experiment and make choices and try something. If you want to pick up a destruction staff and shoot fireballs, go do that, right? If you want to sword and board it, you can do that. Like just just experiment and see what sticks with you because you can always undo it later on. If you want to pickpocket guards, you can do that. You can do that. There's a whole thriving criminal enterprise system that that literally exists on you stealing stuff and fencing it, right? There's so many things in the game that that that you can do that are that",
            "start": 3682.64
        },
        {
            "text": "There's a whole thriving criminal enterprise system that that literally exists on you stealing stuff and fencing it, right? There's so many things in the game that that that you can do that are that are amazing and you don't know until you go and and try it. Yep. Just go slow, explore, learn the world, learn the lore, and try stuff. I'm going to work on my house. I'm very excited about it this whole time. I'm very excited. PS, the guards don't like it when you pickpocket, so you better be good at yourself up. Get out of here. Yeah. Yeah. Matt and Rich, thank you so much for letting us be part of your story for the past four episodes of this to celebrate your 10 year anniversary. It's been incredible. Yeah, thanks for having us. This is a big thrill to be able to go in this depth with this. Yeah, it was a lot of fun. Really enjoyed it. Good. I'm glad you had fun. And Mike, thank you for hanging out with me. Thanks, Greg. Uh, thank you to everybody. An experience of a lifetime. Another",
            "start": 3728.48
        },
        {
            "text": "Yeah, it was a lot of fun. Really enjoyed it. Good. I'm glad you had fun. And Mike, thank you for hanging out with me. Thanks, Greg. Uh, thank you to everybody. An experience of a lifetime. Another one we get to share together and one I'll never forget. Thanks, homie. Remember everybody, this has been the Elder Scrolls Online podcast. A kind of funny Games C special. There's been four episodes. So, if you're just tuning into this one, go ahead and get back to it. Whether it be over on the ESO uh YouTube, whether it's over on the Kind of Funny YouTube or our podcast service, Gamescast, you could find it there. Of course, we are going to be streaming this one. And I want to do a long one. All right. We're doing a long stream today. None of this three-hour business. We're going longer than that. You can catch it live on twitch.tv/kindfunnygames. YouTube.com/kindfunnygames. Obviously, later you get it on YouTube whenever you want to. Uh, but for now, we will bid you a do and remind you",
            "start": 3767.52
        },
        {
            "text": "that. You can catch it live on twitch.tv/kindfunnygames. YouTube.com/kindfunnygames. Obviously, later you get it on YouTube whenever you want to. Uh, but for now, we will bid you a do and remind you that you can go play The Elder Scrolls right now on Xbox, PlayStation, and PC. Go ahead and do it. Give them some feedback. And remember, until next time, it's been our pleasure to serve you.",
            "start": 3804.64
        }
    ]
}