{
    "id": 14086,
    "video_id": "y9F_npNkKEI",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Jake Baldino",
        "Stuart-Kimball"
    ],
    "title": "We Played Tony Hawk's Pro Skater 3 + 4! - Kinda Funny Gamescast",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on\ntheir best-selling Carver Mat frame.\n\nGo to http://rocketmoney.com/KINDAFUNNY to cancel your unwanted subscriptions and reach your financial goals faster with Rocket Money.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1747423578,
    "duration": 3441,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Friday May 16th 2025. Of course I am your host Tim Gettys. I am joined today by you know him from game ranks and before you buy and the friends per second podcast and just being one of my favorite people on the internet. It's Jake Baldino. Hello boys. What's up? Thanks for having me. Very excited to have you here dude. And I'm also very excited to have for the very first time in the studio. We have Stu Kimble who is the editor of Skillup and the editor of the Friends for Seconds podcast. Yeah, thank you so much. Happy to be here. Very happy to be here with you. I met you last week. I've met Jake a million times. I know Jake very, very well. Uh, but I met you for the first time in Los Angeles. And immediately I'm like, I [ __ ] love this guy. This is my guy. This is absolutely my guy. I feel the exact same way. Born and raised Bay Area kid. Loved that. You love Tony Hawk. I'm like, what what more what more could you",
            "start": 8.58
        },
        {
            "text": "[ __ ] love this guy. This is my guy. This is absolutely my guy. I feel the exact same way. Born and raised Bay Area kid. Loved that. You love Tony Hawk. I'm like, what what more what more could you do to win me over? And then yesterday, I'm at the the ribbon cutting ceremony of the Nintendo store and who do I see? St. It's literally been the week of Tim. That's exactly it. I love it. I'm so excited. I'm very excited to have this group of gentlemen here to talk about uh one of my favorite things in life, Tony Hawks Pros Skater. Uh the three of us, as well as a handful of other people, got to go down to Los Angeles and play Tony Hawks Pros Skater 3 and 4 remake um by Iron Galaxy. We got to play for a couple hours and then in addition to that, we just had a kind of wild week. They they they get gave us tickets to THPS Fest, uh which was essentially a insane concert of a bunch of the the bands and artists featured in the Tony Hawk games. So, we're going to be talking about all of that",
            "start": 62.56
        },
        {
            "text": "get gave us tickets to THPS Fest, uh which was essentially a insane concert of a bunch of the the bands and artists featured in the Tony Hawk games. So, we're going to be talking about all of that stuff. Uh cuz this is the kind of funny games cast where each and every weekday we get together to talk about video games, all the things that we love about them. If you like that, you should get the kind of funny membership. It gets you the shows ad free. You can get the daily exclusive Greg way. Normally done by Greg, but today done by Andy cuz Greg is out. What's Andy gonna talk about? I'm not sure, but I'm sure it's going to be hilarious because he's a very funny guy. Little housekeeping for you. We're in 11 business all about live talk shows. You already got an episode of Games Daily. Now you're getting the Games Cast. After this, you are getting our Star Wars andor finale review spoiler cast. I cannot wait for you to see that. I don't want it to be over, Stu. The show's too good. I",
            "start": 103.2
        },
        {
            "text": "you're getting the Games Cast. After this, you are getting our Star Wars andor finale review spoiler cast. I cannot wait for you to see that. I don't want it to be over, Stu. The show's too good. I haven't started yet and I'm like scared because I don't want it to be over and I haven't started. Yeah, it's fantastic stuff. But get our details later on that. Uh, thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Shady Rays, R of Frames, and Rocket Money, but we'll tell you all about that later. We got to get into the topic of the show. Tots, before we get into Tony Hawk, though, there's something else I want to bring up. This is not sponsored. We have in the past been sponsored by XReal AR Glasses. Um, but me and Jake both had this moment last week when we were in LA where we both realized we had the same epiphany. Is that correct? Oh, straight up. Straight up. Like it it changed our lives. I'm using the competitor one, the",
            "start": 143.04
        },
        {
            "text": "moment last week when we were in LA where we both realized we had the same epiphany. Is that correct? Oh, straight up. Straight up. Like it it changed our lives. I'm using the competitor one, the Ver glasses. Essentially, either way, they are glasses. They look like I guess you call them like Ray-B bands, like wayfairers, right? Pretty standard sunglass model. But it has a screen in it. And that screen technically acts as a display. So, an external display to anything you plug it into USBC into your phone, your laptop, your Switch, or most importantly, uh, a Roger Ally or a Steam Deck, which really, really changes the game, man. Right? Like, I feel like now all of a sudden I can like on a train, on a plane, anywhere, I can get gaming really good cuz I mean like handheld portable gaming, we all do it. It's great. But after a while, you get fatigued. And I know this sounds like an ad, but I swear to God, it's not. It's literally just old man complaining. You get fatigued. And now, like",
            "start": 186.72
        },
        {
            "text": "all do it. It's great. But after a while, you get fatigued. And I know this sounds like an ad, but I swear to God, it's not. It's literally just old man complaining. You get fatigued. And now, like on an airplane, like you can have a coach seat, like the shittiest, worst seat next to a baby in the back of the plane, right by the bathroom. But if you have these things on your face, you can have it plugged into your Steam Deck and you just look straight ahead and you have a giant TV screen. So, I've been able to just like completely go balls deep on flights into games. And that's it's probably not the right phrase. Sorry. But hey, it's right though, man. No, real talk though. This is uh one of those things where for years we've had XR real used many of the different iterations as they've kind of uh uh advanced and you know infamously the Kevin stories of him being addicted to these things. But that made sense because Kevin loves the pushing tech further than it's supposed to be going. I",
            "start": 233.52
        },
        {
            "text": "of uh uh advanced and you know infamously the Kevin stories of him being addicted to these things. But that made sense because Kevin loves the pushing tech further than it's supposed to be going. I like tech where it is where it's supposed to be at. You know what I mean? Uh so for me it's like I wanted to wait till it had less of a a gimmick need and more of an actual use case need for me personally. And um I've been going on a lot of trips recently, whether it was to New York for the Switch 2 event or Wrestlemania or down to LA for this Tony Hawk thing. And a lot of those times I was trying to play games for review. So I was trying to play Expedition 33. I forget what the other ones were, but I was like, I'm on the Steam Deck. I want to give these things a shot cuz why not? I'm going to be on a like 8 hour flight or whatever it was to New York on the way back. So let's see what this is all about. And I tried it out and I was immediately blown away where I'm like all the things that I",
            "start": 273.12
        },
        {
            "text": "on a like 8 hour flight or whatever it was to New York on the way back. So let's see what this is all about. And I tried it out and I was immediately blown away where I'm like all the things that I thought were a problem with these before are gone. I thought, \"Oh, I'm going to have to connect it to like a a power brick or like something to then connect. There's just going to be too many cables and dongles and stuff.\" I also thought that it was going to just not look that good or whatever. And here I am now blown. I am a convert full on for these things. Like I just want to show you guys how easy this is. It is one USBC cable, not even proprietary. It's just a USBC cable that goes onto these glasses and it plugs in to whatever device you want. It could be your phone, it could be your Steam Deck, like anything that has USBC and you plug it in and it powers from the device. So, you don't even need to power the glasses themselves and it gives you a insanely large screen like from 117 in",
            "start": 314.24
        },
        {
            "text": "Deck, like anything that has USBC and you plug it in and it powers from the device. So, you don't even need to power the glasses themselves and it gives you a insanely large screen like from 117 in up to like I forgot what it was like 200 in. And it's OLED. Like there's an OLED screen in there. And like do these look like perfectly Ray-B band glasses? No. But they're pretty damn close. He's so cool. To the point to the point that for me, I like that they don't clearly look just like real glasses. Cuz when I'm sitting on the plane, I don't want to be like a weirdo that's sitting there like uh you know, like first off, I don't want the big ass headset, right? Cuz then you're too weird. But this at least there's a cable coming down. They know something's going on. Also, I can see you right now while there's a big screen in front of me. Here's the thing. I'm I'm saying this sounds like an ad. This is a a legitimate ad from Tim Getty's of saying these these are something that forever more",
            "start": 357.28
        },
        {
            "text": "while there's a big screen in front of me. Here's the thing. I'm I'm saying this sounds like an ad. This is a a legitimate ad from Tim Getty's of saying these these are something that forever more now. The tech is there. They're going to be in my backpack always. I am blown away by how amazing they are. Um and they they're just they it's here, guys. Like the time is now. These things are awesome. We've arrived. It's at a good point. They figured it out. Like I feel like now the fun stuff happens where it's like over time the form factor will only get better. The price will start to go down cuz I think the price is still a little high. I just think like if you're someone that sits around a lot or you travel a lot or or anything, it's good cuz it's like you fit it in a sunglass case, throw it in your bag and then you're good. I've used them I did sponsors for them and I was like, \"This is very cool.\" But it was until exactly like what Tim said where I was like, \"Oh man, this might work",
            "start": 399.6
        },
        {
            "text": "it in your bag and then you're good. I've used them I did sponsors for them and I was like, \"This is very cool.\" But it was until exactly like what Tim said where I was like, \"Oh man, this might work for this.\" And you try it and it clicks. It's good. It's good. And as someone who also uses like or used the Apple Vision Pro like a goofus, uh, this is just so much better. So much better than having a giant $3,000 computer strapped to your face made out of glass. You can just wear cool sunglasses that make you look cool and then you can Yeah, that's looking at them in person. It's baffling how sleek and I I am so damn impressed with these things. Yeah. The reason I'm bringing up now is cuz me and Jake were having breakfast and we're just talking about it and we're talking about traveling a lot and I was like, \"Dude, I have a device that's going to change your life.\" And he was just like, \"Are they like AR glasses?\" I'm like, \"What the hell? Are we the same person?\" I like I was going to",
            "start": 438.4
        },
        {
            "text": "and I was like, \"Dude, I have a device that's going to change your life.\" And he was just like, \"Are they like AR glasses?\" I'm like, \"What the hell? Are we the same person?\" I like I was going to pitch you on it. Crazy. So, anyways, I I highly recommend them. I think they're awesome. Check them out. But that's not what we're talking about today. We're talking about Tony Hawks Pro Skater 3+ 4. Uh, we all got to play so much of it. I want top level thoughts. Actually, first off, what's your history with the Tony Hawk franchise, Ste? Uh, I started with Tony Hawk's Underground 2, actually, so probably the ziest entry in the franchise. Um, claps for that. Thank you. Uh, and and then went actually went back and, uh, have played all of them uh, and up to one and two remake and now three and four remake and I love them. They're some of my favorite game series of all time. Yeah, Jake. I started with Tony Hawk's Pros Skater 1. Uh I believe I first touched it uh on I think I first touched the",
            "start": 483.84
        },
        {
            "text": "remake and I love them. They're some of my favorite game series of all time. Yeah, Jake. I started with Tony Hawk's Pros Skater 1. Uh I believe I first touched it uh on I think I first touched the Nintendo 64 version. We're the same person, Jake. This it keeps getting weirder and weirder, man. Also, by the way, it the person that officiated your wedding. Can I talk about that? Yeah, Josh. Yeah, Josh Makuga officiated his wedding. This makes no sense. It's the most small world how did this happen [ __ ] I've ever experienced. What? It's insane. It's like it's all also the fact that you're wearing a Metal Gear shirt and for once I'm not. Yeah. It's like crazy. We're just like time warping. This is weird. This is so funny. So, okay. You started with Tony Hawk 1 on the N64. That beautiful cartridge. Yeah. And I uh then I loved it. So, I got it. I was a PlayStation gamer, PlayStation. So, I got Tony Hawk 1. And from there, I've played every single one. They are all my children. the ones",
            "start": 527.2
        },
        {
            "text": "Yeah. And I uh then I loved it. So, I got it. I was a PlayStation gamer, PlayStation. So, I got Tony Hawk 1. And from there, I've played every single one. They are all my children. the ones that people talk [ __ ] about but it's not deserved like uh like uh Project 8 or like Proven Ground. The one where everybody finally lost interest, everybody fell off. But Proving Ground, I was there for it, man. Uh the Game Boy ones which were like whatever. But you played them. The GBA, the isometric stuff, those were great. It was pretty, you know. Yeah, to be fair, it was kind of cool. But yeah, I I've been there from the beginning and uh I've I've really enjoyed all of them because it's like the one game I'm capable at. I wouldn't say I'm like prolevel at, but it's the one game where like I feel like I can sit down and like maybe beat my friends, you know, and that that's that's been something. But also just in terms of like right time, right place, right? You've heard it all before, but like",
            "start": 571.92
        },
        {
            "text": "I can sit down and like maybe beat my friends, you know, and that that's that's been something. But also just in terms of like right time, right place, right? You've heard it all before, but like the culture uh it it as a cultural movement for skateboarding, but also getting into different types of music, influencing uh introducing me to a lot of hip-hop that I otherwise wouldn't have been exposed to. Um, it's just it's such an important franchise to me for so many reasons. Like right up there with Metal Gear and Max Payne, but this is just a random sports game dropped in there. Yeah, I mean, I'm I'm right there with you. I don't need to go too long. The people listening know my history with this, but I also started with Tony 1 on the N64, became absolutely addicted after that and would 100% each and every entry after. right there with Jake where I played far too long uh past the quality of the original Never Soft titles kind of dipping but still find a lot of love even if you know uh",
            "start": 617.52
        },
        {
            "text": "each and every entry after. right there with Jake where I played far too long uh past the quality of the original Never Soft titles kind of dipping but still find a lot of love even if you know uh Project 8 was like 30 frames per second and not great like all that stuff it's like I I pushed through I still found the fun five was the only one that broke me like Tony Hawk's Pro Skater 5 was like absolutely even Tony Hawk remastered or whatever it was HD uh that they put out in 360 the the shitty um downloadable one that was like mostly that my brain Yeah, it wasn't great. It really wasn't great, but it wasn't the worst thing ever. And then Five really was the worst thing of all time. So, when One and Two came out, it it kind of blew my mind. Like, I didn't think it was possible for Tony Hawk games to still be good and like for a new one to come out and or even a remake and to feel correct. And not only did it, it added all of the move set that you need from three and four back into the",
            "start": 660.0
        },
        {
            "text": "games to still be good and like for a new one to come out and or even a remake and to feel correct. And not only did it, it added all of the move set that you need from three and four back into the one and two levels, which I just think was like that's that's my dream Tony Hawk, right? And so to continue that with three and four, I have been incredibly excited to play through this stuff. So now I want to get into initial impressions of what we got to play. Jake, let's start with you. Yeah. Yeah. I think top level uh really really enjoyed it. It plays exactly like I expected it to. Uh then the levels are recreated well like in one and two but actually feel like a little bit more uh like a lot more particle effects, a lot more like just crazy [ __ ] going on. So they like it feels like more effort even put into recreating the levels. Uh the new level we got to experience the water park is really cool. All that stuff you expect is here. Uh the only thing is I still kind of have questions",
            "start": 702.8
        },
        {
            "text": "effort even put into recreating the levels. Uh the new level we got to experience the water park is really cool. All that stuff you expect is here. Uh the only thing is I still kind of have questions about the career mode. The lack of career mode is something that I think is a point of contention. If you look at comments, right, everybody's talking about it, and I do find myself going back and forth, having played original four so much. There are a lot of duds within that career mode, and what they've done here is kind of tried to just match four to feel like three as a cohesive package. I get it from a philosophy standpoint sometimes. Some people think it's them cutting corners. I don't know if it is, but I do think I miss some of the objectives from career mode more than the career mode structure itself. Some of the object objectives and like the the rapid pace weird stuff I I am going to miss. There is some of that like flavor-wise, right? like some of the objectives or the goals",
            "start": 749.76
        },
        {
            "text": "structure itself. Some of the object objectives and like the the rapid pace weird stuff I I am going to miss. There is some of that like flavor-wise, right? like some of the objectives or the goals are uh are things from like you know San Francisco like you're still knocking the boulder over and hitting the shark but all of that is now condensed into a two-minute mode and I'm still kind of 50/50 on whether or not I like that specifically because what is this called? This is called these are called Tony Hawk 3 and four remastered technically is what they call them. It's just 3 plus 4. 3+ 4. Yeah. So, I still look at it as like a a representation or a preservation or of the originals. And I do feel like for the sake of it being complete, I think I would have ultimately liked more career stuff. I don't I don't know if I'm the only one, but yeah. Ste, what your top level thoughts on it all? I just to go into that, I um playing it, I didn't I didn't feel like I was missing out on anything.",
            "start": 797.52
        },
        {
            "text": "I don't I don't know if I'm the only one, but yeah. Ste, what your top level thoughts on it all? I just to go into that, I um playing it, I didn't I didn't feel like I was missing out on anything. I do personally love the the twominut timer uh and how the goals are more streamlined to fit that two-minute timer. And you can now uh set the timer up to 60 minutes, which I think is a good compromise for people to be able to take, you know, the levels at their own pace, see what's happening, uh complete the goals as they will, um but not have the career motives, uh specifically, which I understand is a point of contention again, like NPC dialogue is so iconic, like all of that stuff. Um but I didn't find myself missing it that much. And I yeah, that that was my like impression of the the changes to Tony Hawk's Pros Skater 4. But I I really do want to talk about this new level uh to Water Water Park cuz they like I was I described it as being like ripped out of the source code of one of",
            "start": 842.16
        },
        {
            "text": "to Tony Hawk's Pros Skater 4. But I I really do want to talk about this new level uh to Water Water Park cuz they like I was I described it as being like ripped out of the source code of one of those original games as some secret level that they never used. Um, and it just feels so right, like as a as a place you're, you know, all those old levels are like places you're not really allowed to skate in real life. And that's the fun of it, kind of the absurdity of it. And Water Park taps into that so well. And I had a blast just like cannons firing, pipes bursting, like doing combos and tricks in the pools and all of that stuff. I absolutely loved it. Yeah. So that's what I took away was I'm excited for their new levels. Absolutely. Yeah. I mean, I uh going into this, I I almost didn't even need to get my hands on the sticks for this game because just looking at it, you can tell, oh, it's one and two, but three and four. And that's really all that I needed. I remember leading into Tony",
            "start": 893.68
        },
        {
            "text": "need to get my hands on the sticks for this game because just looking at it, you can tell, oh, it's one and two, but three and four. And that's really all that I needed. I remember leading into Tony Hawk 5, every time I'd see gameplay of it, I'm like, I need to get my hands on the controller. Like, that'll be the moment that I can tell, is this good or not? Like, that's literally all I need to know. So, and it wasn't. Uh but here, it's like getting our hands on the the game. And unfortunately for me, we had to play on Xbox controllers uh for the event. Oh man, I know you guys were. Which which is like I mean the PlayStation controller and Tony Hawk is like the Gamecube controller in Smash Brothers. It's like it's just the D-pad and the way it all feels. It's like it is perfect. And that again come from someone that played on N64 back in the day. Like the PlayStation controller was like a godsend. Um but not that bad honestly. Uh the playing on the Xbox controller like it totally",
            "start": 942.64
        },
        {
            "text": "again come from someone that played on N64 back in the day. Like the PlayStation controller was like a godsend. Um but not that bad honestly. Uh the playing on the Xbox controller like it totally totally worked. Um, and everything I thought going in was correct. This game, in my opinion, is perfect. From a gameplay level, this feels exactly like I would want it to feel. Um, and Jake was uh saying this, but like it's surprisingly gorgeous. Like one and two ran incredibly well and they kept once the next gen came out and then even PS5 Pro and all that stuff, like once the enhancers started coming out, like they just kept going back and being like, \"And now there's 120 frames per second and now there's HDR and now there's all this stuff.\" Seeing what they have here kind of from the jump is just so impressive. There's so many particles and things going around like uh in the college level, the the parade floats going by and there's just confetti everywhere. Uh in the foundry, there's just",
            "start": 980.96
        },
        {
            "text": "so impressive. There's so many particles and things going around like uh in the college level, the the parade floats going by and there's just confetti everywhere. Uh in the foundry, there's just fire and just like all of these effects, smoke and stuff and it it just looks and feels awesome and it doesn't hinder the performance of the game at all. No, not at all. Um so yeah, I was very very impressed with all that stuff. Um, and the thing for me about the the career mode is I love all of these games. I love all of the [ __ ] I love the good and the bad. And in Tony Hawk 4, it's like real talk, at certain points in my life, I would have said that was my favorite of the Tony Hawk games. Then as I got older and played them more and more, I realized like, oh, it's definitely not. Um, there's things I think it's my favorite move set of the games. And that's why I'm happy that they're continuing to use that from one and two onwards here. Um, but I recently played through the entire career",
            "start": 1022.72
        },
        {
            "text": "things I think it's my favorite move set of the games. And that's why I'm happy that they're continuing to use that from one and two onwards here. Um, but I recently played through the entire career again in four, and I personally am not gonna miss it at all whatsoever. Um, I've always been a fan of the two-minute timer stuff. Um, and the fact that they can change it up to 60 and all that, it's like that seems like a a concession. I don't think it's really going to make the people that are upset happy. Um, but I was worried they were going to get rid of the character of these goals and the little cut scenes and the the the weird dialogue and stuff, the actually entertaining stuff, and they didn't. It's at least so far a lot of it's there. Maybe not every single thing. Um, but I've been I feel very served uh in terms of having these levels have interesting things for me to do and not just have more stuff just to have more stuff. And I do think in Tony Hawk 4 some of the things were",
            "start": 1064.64
        },
        {
            "text": "I feel very served uh in terms of having these levels have interesting things for me to do and not just have more stuff just to have more stuff. And I do think in Tony Hawk 4 some of the things were just, hey, this is content for content sake. Having said that, I do think it's a valid criticism and I am a little concerned. There are a bunch of goals that we didn't get to play through. I don't think we did any of the combo stuff. I don't know if that's in the game. Oh, yeah. I hope it is. And I hope it is. And I think that there's a lot of different goals that can't work within a two-minute structure. So, we're just not going to have based on like where they're trying to take you around all the level. They could change it up. We saw a couple examples of that already in the college level with how the professor's car skitching goal works. Um, but I I have full faith in it. I I I believe in it. And on top of that, they had to be ky about stuff. Um, and they, you know, we interviewed the",
            "start": 1104.48
        },
        {
            "text": "how the professor's car skitching goal works. Um, but I I have full faith in it. I I I believe in it. And on top of that, they had to be ky about stuff. Um, and they, you know, we interviewed the developers in different, uh, ways and talked to them and I've read like every single interview I've seen from any of the people that we were there with. And like I'm getting the vibes that there's goals that are like Tony Hawk 4. One of my favorite things was it had pro goals, like pro objectives tied to each of the characters. And that's kind of like in my opinion what we're thinking about when we're like, \"Oh man, we're going to miss out on these like bigger event type things.\" And I'm getting the vibe that while we may not get pro individual goals back, I think that there was there's going to be a second series of goals after like a new game plus type thing. I'm just saying that I don't know that that's going to be true. I don't need it one way or another, but I think it's going to be",
            "start": 1146.64
        },
        {
            "text": "to be a second series of goals after like a new game plus type thing. I'm just saying that I don't know that that's going to be true. I don't need it one way or another, but I think it's going to be there. And I know I'm rambling, but real quick, I want to say this cuz I think it that I haven't seen anybody talk about this enough. I one and two one of my favorite games of all time and I platinum it recently. That was a grind that took me years and the majority of it was fun and then it got really really really not fun because some of the final trophies were just get to that level 100 which is just grindy [ __ ] [ __ ] It felt very battle passy in a way that was not fun. All that stuff's gone. All the battle pass stuff is gone. You're not leveling up anymore. Instead, it's all challenge based and the challenges from the limited that we could see. I'm like this seems like the perfect experience for this game. Yes, I agree. They've they've stripped back that that battle passy because I",
            "start": 1190.16
        },
        {
            "text": "and the challenges from the limited that we could see. I'm like this seems like the perfect experience for this game. Yes, I agree. They've they've stripped back that that battle passy because I was just playing one and two yesterday and I was like the the pro the the pro challenges in that one are I think linked to that kind of battle pass too and if they get rid of that and just bring in them as like an actual challenge mode. Perfect. I think that's going to be the best balance of the two games. Exactly. Yeah, I think there's definitely some potential there. I feel like I've seen a lot of like like running theories on like the subreddit and stuff that there's going to be more stuff that they haven't shown. But what we did see I did really enjoy in terms of I was happy to see uh it's like a silly thing, but I was happy to see the maps and see money floating in the air and collecting those currency. I was like, \"Okay, cool.\" Cuz I like the currency system from four. and we didn't get",
            "start": 1230.08
        },
        {
            "text": "a silly thing, but I was happy to see the maps and see money floating in the air and collecting those currency. I was like, \"Okay, cool.\" Cuz I like the currency system from four. and we didn't get to see what that shop entails and what you're going to be purchasing. But the fact that there is that extra stuff to collect and like you know that persistent over the two-minute modes like you know you miss one try the mode again get it. Uh there's a lot of that. There's also the um collectible skate decks that you can find. They pointed this out to me first but the art on the decks is really cool. Right. Yeah. The art on the each level has a hidden deck in it somewhere. And the deck is the original kind of like level select art from the original three or the original four. So on four kind of looks like a film strip like for San Francisco or Alcatraz or whatever on the deck. And I'm like that's just that's awesome, right? Yeah. And I think that speaks to the level of detail that Iron",
            "start": 1270.4
        },
        {
            "text": "of looks like a film strip like for San Francisco or Alcatraz or whatever on the deck. And I'm like that's just that's awesome, right? Yeah. And I think that speaks to the level of detail that Iron Galaxy is going for and like the level of respect that they have. Uh because like we all interviewed again the games director and just talking to him was just like you know the the maps themselves are taken even like collisions are taken directly from the original games and put back in. They've added uh Tony Hawk's froggy grind which wasn't in the one and two remake. Like little things that they they are trying to hone in on that keeps this fresh and also like the ultimate experience. Yeah. And you know, something that I I really loved about one and two remake was how much they clearly cared about the original games, but didn't just want to be like, \"All right, cool. We're just remaking it, and uh here's the skaters, the ones we can get back and whatever.\" The skaters from the original",
            "start": 1315.68
        },
        {
            "text": "about the original games, but didn't just want to be like, \"All right, cool. We're just remaking it, and uh here's the skaters, the ones we can get back and whatever.\" The skaters from the original games were older now. Like, they're they're like time appropriate of like the ages they are. But then there's also this entire new generation of the the the later the skaters of today. Um, and I feel like that's so important for the culture of this game and skateboarding that we all care about so much. And even the music choices and all that stuff, it reflects like the new and the old and the levels. I feel like did that as well. Like the the mall being this like abandoned mall, which it wasn't abandoned in the first game. I thought that little take was so interesting. And I feel like three and four are really doubling down on that where showing a lot of love to what came before, but the skater roster in this game is kind of wild. It's crazy. Yeah. Yeah. Could we talk about how it looks",
            "start": 1361.36
        },
        {
            "text": "and four are really doubling down on that where showing a lot of love to what came before, but the skater roster in this game is kind of wild. It's crazy. Yeah. Yeah. Could we talk about how it looks like a fighter select screen? It does. There are so many skaters that you see all these tiles of every character portrait and I was like, \"Wow, holy [ __ ] I I've never felt that in a Tony Hawk game.\" It's cool. They really understand that like new and old. And the music choices really are the biggest thing. And I think they did that so well in one and two. The music was so perfectly curated, adding in new stuff. And it feels like with three and four, that's the approach again, but this time they're doubling down on that with the skaters themselves and the skate culture, which is really cool to see. I want to talk about the music just for a second cuz uh the second night we got to see a bunch of the bands, rappers and bands play. And I think it was really special for me because I found",
            "start": 1399.2
        },
        {
            "text": "to see. I want to talk about the music just for a second cuz uh the second night we got to see a bunch of the bands, rappers and bands play. And I think it was really special for me because I found out about Lupe Fiasco from Tony Hawk's Downhill Jam. Oh my god. When Kick Push was in that originally and I was like, this is such a full circle moment. And then I was standing with Jake and Jake had not heard Danny Brown before and was freaking out. I'm like, \"Oh my god, this is so cool.\" And I was like, \"This is awesome. This is what these games sort of are for in a lot of ways.\" Uh is such an introduction to that culture, like we've been talking about and such a um just such a lovely celebration of that. And I I feel like the music selection and the skate selection, like you said, is such a celebration. It really felt like a celebration. Yeah. And uh we didn't get to experience the entire soundtrack uh in in our game. There was a lot of songs. Then the day that we um played the game,",
            "start": 1441.2
        },
        {
            "text": "a celebration. It really felt like a celebration. Yeah. And uh we didn't get to experience the entire soundtrack uh in in our game. There was a lot of songs. Then the day that we um played the game, there was a lot of embargos of like different information was dropped throughout the day. It was a little bizarre if I'm being honest, but uh it was like wave three of the soundtrack was announced and then it was like, \"All right, cool. Bam is in the game. That was announced and a couple different things uh one after another.\" But now that we know the entire soundtrack is officially posted at the very least uh and from playing the game, there's a streamer mode um which they they wanted to have us in for recording that Jake was in and then I wasn't in that. I was just like recording it just normally, right? Um, and so I just got to hear all the songs. Jake, you want to talk about the streamer mode for a second? So miserable. Yeah. Like I I understand why it exists, but essentially it was",
            "start": 1484.56
        },
        {
            "text": "right? Um, and so I just got to hear all the songs. Jake, you want to talk about the streamer mode for a second? So miserable. Yeah. Like I I understand why it exists, but essentially it was like, you know, for streamer mode, for copyright reasons, like it will just play generic music that like kind of sounds like here's kind of a rap song. Here's kind of like a punk like a pop punk song. Here's kind of a SCA song. So I was just like skating to like the most generic sky I've ever heard. And I'm like, \"Oh man, this sucks.\" And then I was like, \"Oh, I could turn this off.\" off. So halfway through I turned it off and I was able to experience the soundtrack. But I went over to Tim and I was like, \"Do you have the streamer remote on? This is this is killing me.\" And he's like, \"No, I just have it off.\" I was like, \"Oh, okay.\" So I switched mine off and way better. And and yeah, the soundtrack it it's awesome. it it's good old Tony Hawk uh classic stuff where I do think that uh compared to",
            "start": 1520.72
        },
        {
            "text": "it off.\" I was like, \"Oh, okay.\" So I switched mine off and way better. And and yeah, the soundtrack it it's awesome. it it's good old Tony Hawk uh classic stuff where I do think that uh compared to one and two there's more of a shift towards newer songs um than that because and even just not necessarily new as in coming out in 2025 but new and as in not in Tony Hawk previously many of the songs um from one and two were directly in one and two remake right for this um I would say that half of the songs that are returning or artist returning from the original three and four the artists are there, but it's a different song, which I love. It's kind of Yeah, it's a fresh new new uh take on it, which is is interesting. And like there's certain groups that like um man, I don't even I'm blanking on their name right now, but they have that song. Oh, Toy Doll, I think is the name of the the band. And they have that song Dig That Groove Baby in Tony Hawk 4 original. And now they have this like",
            "start": 1556.4
        },
        {
            "text": "on their name right now, but they have that song. Oh, Toy Doll, I think is the name of the the band. And they have that song Dig That Groove Baby in Tony Hawk 4 original. And now they have this like a new song, but it's identifiably them just from the voice and sound and style. And I'm like, I love that. like I'm getting this feeling of playing Tony Hawk 4 for the first time again. Which is so cool. And re rediscovering it in that way. And what I love about those games is they usually take kind of deep cuts from those tracks. Maybe because they're cheaper, maybe easier to license, I don't know. But uh then I really become fans of like those albums, you know, like you were like, \"Oh, this is track number seven on this.\" You know, it's not the aside or whatever of of whatever album you're listening to. And I think the the new soundtrack does a really good job of that as well with those kind of deeper cuts. Yeah, I think it was the right move because Tony Hawk's Pros Skater 1 and two uh",
            "start": 1601.6
        },
        {
            "text": "to. And I think the the new soundtrack does a really good job of that as well with those kind of deeper cuts. Yeah, I think it was the right move because Tony Hawk's Pros Skater 1 and two uh like the soundtrack for that is like a temple. I don't know. There's something about that that's like you can only [ __ ] with it so much. Yeah. That with three and four and then and so on and so on. I think there's a little more wiggle room, but I think the like what you said, they're absolutely doing it right with like oh well like how about you know this artist and here try a different song. The only question is if they ever do Thug, are they gonna keep Kiss? They need the level, right? Yeah, exactly. Very integral to the ending of that game. It is. Yeah. Oh, man. I love it. I want to keep talking about Tony Hawk 3 and 4 and our adventures in Los Angeles. But we're going to do that right after a quick word from our sponsors. This episode is brought to you by Shady Rays. Get ready for the season",
            "start": 1644.96
        },
        {
            "text": "Tony Hawk 3 and 4 and our adventures in Los Angeles. But we're going to do that right after a quick word from our sponsors. This episode is brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized sunglasses that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. Their shades have durable frames and crystal clear optics, making them the perfect choice for all outdoor adventures. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. Take it from Tim Gettys who rocks his shady rays every day going on Pokemon Go walks out and about SF looking dope. If you don't love your shades, exchange for a new pair or return worry-free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support exclusively",
            "start": 1688.24
        },
        {
            "text": "If you don't love your shades, exchange for a new pair or return worry-free within 30 days. There's no risk when you shop. Their team always has your back with personal and fast support exclusively for our listeners. Shadyra is giving out their best deal. Head to shadyra.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. That's shady.com promo code funny. This episode is brought to you by Auraf Frames. Every day we're taking photos from big events to silly moments, but doesn't it sometimes feel like all of your favorite photos are just stuck on your camera roll? Wouldn't it be great to have an easy way to share and enjoy them with friends and family? That's where Aura comes in. Aura makes it effortless to upload unlimited photos and videos directly from your phone, so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura",
            "start": 1734.64
        },
        {
            "text": "unlimited photos and videos directly from your phone, so your favorite memories are always within view. Plus, you can personalize and preload an Aura frame for a unique and special gift. We love Aura Frames in this office. Roger has one at home he got for his fiance's birthday, and she absolutely loves it. It takes about 2 minutes to set up the frame using the Aura app. Add unlimited photos and videos and invite as many people as you want to an Aura Frame. There are absolutely no hidden fees or subscriptions. And for a limited time, listeners can save on the perfect gift by going to aura.com to get $20 off plus free shipping on their bestselling Carver matte frame. That's auraframes.com, promo code aura 20. Support the show by mentioning us at checkout. Terms and conditions apply. This episode's brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking",
            "start": 1776.0
        },
        {
            "text": "brought to you by Rocket Money. With prices going up on just about everything lately, being smart with your money isn't just a good idea. It's essential. But managing subscriptions, tracking spending, and cutting costs can feel overwhelming. Lucky for you, Rocket Money takes the guesswork out of it so you can easily make smart decisions. Rocket Money has helped multiple members of Kind of Funny learn they were still paying for things they totally didn't even realize. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money's dashboard gives you a clear view of your expenses across all of your accounts. And then you get alerts if bills increase in price, there's unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a",
            "start": 1822.0
        },
        {
            "text": "unusual spending activity, or if you're close to going over budget. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year while using the app's premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunny today. That's rocketmoney.com/kindfunn.ro rocketmoney.com/kindafoney. I want to talk more about our actual gameplay experience here. We got to play a a handful of levels from uh both three and four. We got Foundry, Canada, Rio, Los Angeles, and Suburbia from three. And we had off the dome. Yes. Impressive. And let's see if I can keep it up for four. Here we go. We had college San Francisco. Come on now. Did we play now that he's on the spot? We did play Alcatraz. We did play Alcatraz. Um that's it. No, no, the new one. The new one. Oh, and then water park. Water park. Yeah, which I guess they are putting into into the for",
            "start": 1858.8
        },
        {
            "text": "on the spot? We did play Alcatraz. We did play Alcatraz. Um that's it. No, no, the new one. The new one. Oh, and then water park. Water park. Yeah, which I guess they are putting into into the for that was it though, right? From before. Yeah. Yeah. Yeah. Um interesting. Um, we also did see just going around the menus and stuff, Jake and I noticed like you could see uh the zoo and you could see London um and you could see Tokyo. So like most levels are in some way confirmed to be back. It seems like the only ones that um we're probably not going to get are uh Chicago, which was in four, but technically that was a level from Matt Hoffman's Probex 2. Um so we're not getting that. We're not getting um Carnival was four, correct? Oh, am I wrong? Was it? Was that the game? Yeah. Yeah, I believe that was No, it was four. Okay, then. Yeah, we have not seen Carnival yet. Yeah, it was only on certain platforms, I think. Something like that. Um, but what what did you what did you think about",
            "start": 1917.6
        },
        {
            "text": "that was No, it was four. Okay, then. Yeah, we have not seen Carnival yet. Yeah, it was only on certain platforms, I think. Something like that. Um, but what what did you what did you think about Jake? I know you're a big Suburbia guy. What was it like playing Suburbia in full HD? It was crazy. It was weird. Um, it's it's a level that actually like it it felt very weird to see that level like fleshed out. That and Canada just cuz like they were so vague in the old one because because of the visuals and everything like that. To see it fully fleshed out was pretty wild. And I actually with Suburbia I had a harder time like connecting some of my lines. I guess cuz I'm like so rusty. But, you know, having the thin man there and like doing all that stuff and smashing the pumpkins, it it it totally totally hit like exactly like how I was hoping. The thin man like when you help him, he gets like a cut scene and he's like, \"Yeah, like he he like explodes or whatever.\" Uh, it it was cool.",
            "start": 1969.92
        },
        {
            "text": "totally totally hit like exactly like how I was hoping. The thin man like when you help him, he gets like a cut scene and he's like, \"Yeah, like he he like explodes or whatever.\" Uh, it it was cool. Yeah, the the charm still being there is like to me really what like matters and that's why it's like, \"All right, cool.\" Like I'm I They easily could have took that stuff out because like I don't think we got any of that in one and two, but that's because one and two didn't have those things. Like we had a couple little little moments of like, yo, if you hit this thing, it'll like create a new like line or whatever, but there's a lot more of that in four specifically. Yeah. Four was huge on that. Yeah. What were some of your highlights, too? Um, Alcatraz is one of my favorite levels in the entire series. And Yeah. And and like uh you can still sketch the the tour guide and you know, they give the whole like spiel and everything. Uh the prisoner like let out the prisoner is there. uh all",
            "start": 2013.68
        },
        {
            "text": "series. And Yeah. And and like uh you can still sketch the the tour guide and you know, they give the whole like spiel and everything. Uh the prisoner like let out the prisoner is there. uh all the secret entrances that like link you to the and combining your lines that way. Fogghorn and it just like it really I mean as Bay Area people four is such a like celebration of Bay Area skateboarding cuz like college is in Berkeley. It's bizarre. Yeah. College is Berkeley. There's a San Francisco level again which is like we had San Francisco before and one it's a completely different level. There's Alcatraz and then the shipyard is like debatably Hunter Point like kind of weird man. Oh it's great. And I just loved that. And to see Alcatraz and like the sun is setting and like you know the beautiful the bridges and the city and I was like this is awesome. Biased for me but just awesome. It was so good. Very very cool stuff. Yeah. Um you mentioned the kind of uh all the little entrances and",
            "start": 2054.0
        },
        {
            "text": "the bridges and the city and I was like this is awesome. Biased for me but just awesome. It was so good. Very very cool stuff. Yeah. Um you mentioned the kind of uh all the little entrances and hidden things on Alcatraz which some Tony Hawk levels do it but I do feel like Alcatraz is the shining star example of it. We have a new competitor in Water Park. Water is so Alcatrazcoated and like that is the greatest compliment I can give it. Um, but it also has a bit more of a kind of condensed uh like obstacle park of like more like traditional. I'd say it kind of feels like a perfect blend of a Tony Hawk 3 level and a Tony Hawk 4 level. Yes, I I completely agree. Yeah. Yeah. It's uh I the finding those secret entrances that lead to the top of the water slides and then like going down the water slide to to link to, you know, the pipes and the pools and all of that stuff. It does feel like I'm trying to think of a It kind of feels like like Tokyo or the Japan level in three with all the",
            "start": 2101.52
        },
        {
            "text": "slide to to link to, you know, the pipes and the pools and all of that stuff. It does feel like I'm trying to think of a It kind of feels like like Tokyo or the Japan level in three with all the flashy like lines and links and stuff and then Alcatraz on four. That's a perfect combination. Yeah. Yeah. It's get it's got that like whimsy to it that I really appreciate where it's like you're going down a million slides and you're like whoa. But then also there's a couple spots where you can hit and a water spout will like blast you up into the air. So it kind of has that like goofy fun factor to it. And I also like that it still carries over a little bit of like the transformative stuff if you complete certain objectives like uh very much like uh the downhill level from Tony Hawk 1 where you got to grind all the little nozzle hoses or whatever. You do that here around the park and then it lowers the water in this like pool and then you have access to more ramps. So stuff like that I just",
            "start": 2149.28
        },
        {
            "text": "got to grind all the little nozzle hoses or whatever. You do that here around the park and then it lowers the water in this like pool and then you have access to more ramps. So stuff like that I just I always appreciate from this game and the fact that they took that the fact that it has like the Alcatraz entrances that style. I just made me feel really good. I was like, I feel very confident now about the new levels because when this was announced, they were like, oh, and introducing we're putting new levels in it. And it's like exciting, but it's also like, well, who are you? You know, exactly. Yeah. Yeah. That's so So, after playing this, I immediately I So, I played Water Park and then I got to interview the developers and I like walked in and I was like, dude, you guys are [ __ ] cooking with this. Like, holy [ __ ] Um, yeah. I I I love it. Yeah. And the water park was definitely I'm right there with you. like I I was surprised at how great of a level it was. And it does get me",
            "start": 2194.0
        },
        {
            "text": "with this. Like, holy [ __ ] Um, yeah. I I I love it. Yeah. And the water park was definitely I'm right there with you. like I I was surprised at how great of a level it was. And it does get me excited. We know we're getting three new levels. Um they haven't officially talked about the ones besides Water Park, but there was a leaked image of a pinball machine where you're like skating in pin. I'm like, how have we not done that before? That sounds perfect. Like a giant pinball machine just grinding around everything. Like that's going to be awesome. And that's what I tried to get some hints, too. I tried to get like uh I was like, \"Hey, can you just like tell me like can you tell me a little bit like about like can you give me a hint or some other levels?\" Didn't get anything. But what what uh what they did say was that the philosophy was kind of like looking at level looking at secret levels and just levels from the past and like what are they right? A lot of the times they're places",
            "start": 2238.32
        },
        {
            "text": "uh what they did say was that the philosophy was kind of like looking at level looking at secret levels and just levels from the past and like what are they right? A lot of the times they're places you can't go or they're places that are shut down. So they they're kind of carrying that same philosophy over which is good. They're not just like let's do this cuz it's cool. Right. Yeah. Yeah. I love how kind of absurd they are. Like a pinball machine. Like it's kind of crazy, but you're like, \"Of course, that works so perfectly within everything.\" Yeah. Yeah. We didn't get to play as uh the Doom characters, but I do like that to some extent we are getting secret skaters back. Like that was something or like secret skaters that aren't just like Tony Hawk originals back. Uh cuz one and two I'd say one of the bigger let downs is that we got Officer Dick and we got the the skeleton, but like we we didn't get any of the we didn't get Spider-Man. We didn't get like a lot of the the classics",
            "start": 2277.76
        },
        {
            "text": "say one of the bigger let downs is that we got Officer Dick and we got the the skeleton, but like we we didn't get any of the we didn't get Spider-Man. We didn't get like a lot of the the classics from those games. Um but beyond that, I thought that it was going to be a slam dunk of sure we might not get what we got before because of licensing. I thought we were going to get Crash Bandicoot it being made by Activision like all that. Like we didn't get any of that stuff. So now Microsoft's involved. Getting Doom uh Slayer I think is good. And we know that Bam and Andy Anderson are also secret skaters. I wonder if we'll get more. I know. Where's Django at? You know what I mean? Where is Django? Come on. What a time though that they were they just had they were just like, \"Hey, Django Fett's in the game.\" Now I could never even imagine that. Oh no. I've never thought about Crash Bandicoot being in But that would have made total sense. Too much sense knowing what they could have had.",
            "start": 2321.92
        },
        {
            "text": "in the game.\" Now I could never even imagine that. Oh no. I've never thought about Crash Bandicoot being in But that would have made total sense. Too much sense knowing what they could have had. Yeah, because they have the new one coming out. Yeah, that's exactly it. Oh my god. Uh dude, and then thug we had Iron Man. Iron Man. which is crazy to think about. And like prec Yeah. Such a weird thing. But yeah, really. And those two, three and four were the Star Wars ones cuz it was Darth Maul, right? In three and Wolverine, too, though. Like it wasn't just Star Wars or Marvel. We got both. So awesome. Yeah. I hope. God, what a time, man. Doom Guy is a good compromise. Doom guy, I think, is a good fit. Yeah. That that totally works. I think it's And also, we're getting Doom music and uh Doom tricks and Doom deck. Like that stuff's cool. I was going to say, yeah. Isn't Doom Guy? Yeah, it is returning from from the PC version of Tony Hawk 3. That's so I did not know that. That's awesome. I",
            "start": 2362.48
        },
        {
            "text": "tricks and Doom deck. Like that stuff's cool. I was going to say, yeah. Isn't Doom Guy? Yeah, it is returning from from the PC version of Tony Hawk 3. That's so I did not know that. That's awesome. I didn't know that either. Yeah, cuz he's playable in Thug Pro. So, I was like, \"Oh, they must have either added him in or modded or whatever.\" But yeah, he was in the PC version. That's cool. Uh, so then moving on from our our gameplay experience, we had a we went to THPS Fest. Jake, what was that like for you? That was cool. I uh you know, there was a stream, there was a live stream, so people got to see it. Essentially, it was a a pretty small intimate concert uh with like uh fans uh some like journalists and influencers and then just like legends walking around just like skaters walking around like a lot of people from Tony Hawks Pro Skater like the various games like Bones Brigade guys like really cool [ __ ] and then a good concert to boot. Also, it was catered by Taco Bell which",
            "start": 2404.56
        },
        {
            "text": "around like a lot of people from Tony Hawks Pro Skater like the various games like Bones Brigade guys like really cool [ __ ] and then a good concert to boot. Also, it was catered by Taco Bell which that's just cool. Like it was literally like you walk past like buffet stations with the trays open and it was just stacks and stacks and stacks of soft tacos and and you know supremes and stuff like that. It was it was something else. It was it was quite the event, right? Like this this is definitely old school game marketing events taken to the nth degree. But it also came from a place of love of like if we're going to celebrate a Tony Hawk game like let's celebrate it culturally. And in a weird way Taco Bell's part of that culture, right? But like the music and all that stuff like it it was fun and it was at the Elray Theater which is a location from the Los Angeles level of Tony Hawk 3 which I'm like that's kind of we got to skate by that earlier in the day. Yeah. Exactly. Yeah. Also",
            "start": 2448.72
        },
        {
            "text": "fun and it was at the Elray Theater which is a location from the Los Angeles level of Tony Hawk 3 which I'm like that's kind of we got to skate by that earlier in the day. Yeah. Exactly. Yeah. Also there's like a good there was a good thing the whole time like of like every everybody who was on stage presenting or performing like everybody kind of had this thankfulness to be there and almost like a thankfulness direct like a gratefulness directly to Tony Hawk. Every single person was like, \"Thank you, Tony Hawk, for putting me in the game cuz that's crazy.\" Danny Brown was like, \"Thank you, Tony Hawk, for inspiring me to be a musician.\" I was like, \"That's awesome.\" He was like, \"Yeah, I listen to ASOP Rock on uh on Tony Pro Skater 4 and that, you know, this weird rap that I do is directly from that.\" And so I thought that was such a cool connection. Yeah. And you alluded to this earlier, Steu, but like um I also am not a I I don't know Danny Brown that well. I I I know him from",
            "start": 2492.64
        },
        {
            "text": "from that.\" And so I thought that was such a cool connection. Yeah. And you alluded to this earlier, Steu, but like um I also am not a I I don't know Danny Brown that well. I I I know him from features on certain songs. I've always enjoyed it, but I've never heard enough to be like, I'm going to do a deep dive on this guy. And hearing him here in the context of he's a Tony Hawk guy. Guess what I've been listening to all week, right? It's just like that's it's very cool. And that is the power of putting these things all together where it's just like it introduces you to like entirely new things. And I can't believe that's still happening 25 years later. I'm still getting new music from Tony Hawk. Right. Honestly, it was as someone who's listened to Danny Brown for a long time now, it was really awesome to stand next to Jake and with each song that came on, Jake was like, \"What? This is awesome.\" And I was like, \"Yeah, yes, this is what it's all about.\" Like, it felt really nice. It was",
            "start": 2536.08
        },
        {
            "text": "awesome to stand next to Jake and with each song that came on, Jake was like, \"What? This is awesome.\" And I was like, \"Yeah, yes, this is what it's all about.\" Like, it felt really nice. It was really cool. Yeah. I mean, we got to see Steve Cabalo's band. Like, we got to see Steve Cabo perform on stage wearing his outfit from Tony Hawk 4. Yes. The fit. The Come on, man. Like, this is this it was so so cool. The Freddy Krueger drip. Uh, and yeah, Jake, you were saying it, but like everyone was just so excited to to be part of this and like it really did feel like, hey, like there's a history here, right? So, uh, I I loved that. And yeah, being around all the skaters was cool. We got to see Bam Marger. We got to meet him, which was wild. Yeah. You know, that's obviously some like lifetime legendary childhood. Like, I can't believe I'm meeting. So bizarre. So weird. I The way it worked is like like Tim clocked him and he was like, \"He's there. He's just there. Like we should just go",
            "start": 2573.76
        },
        {
            "text": "legendary childhood. Like, I can't believe I'm meeting. So bizarre. So weird. I The way it worked is like like Tim clocked him and he was like, \"He's there. He's just there. Like we should just go talk to him. He's just standing there.\" And I was like, \"Okay.\" And I literally was like, \"Okay, Tim, Mr. Kind of funny, talking to celebrities.\" I was like, \"You can take the lead. I'm nervous.\" And then Tim was like, \"I have no [ __ ] idea what I'm doing.\" I was like, \"Oh, dude.\" And so me and my dad can't do it. Me and Jake both together. We literally just like, \"Let's do it together. Let's do it together.\" We start like muppet shuffling over and as I'm going, I have this giant beer in my hand. This group walks towards me, knocks it out, and like I'm literally about to say hi to Bam Margera. Beer [ __ ] everywhere. And I'm just like, \"Jake, hold on.\" Wait, wait, wait, wait. It's like you're running into battle and it's like the soldier next to you gets like taken out and you're like, \"Oh",
            "start": 2617.84
        },
        {
            "text": "Beer [ __ ] everywhere. And I'm just like, \"Jake, hold on.\" Wait, wait, wait, wait. It's like you're running into battle and it's like the soldier next to you gets like taken out and you're like, \"Oh man, I got to keep going.\" It was cool. He was very nice. He was very gracious. I just told him I was like, \"Hey, big fan. Glad you're in the game.\" He's like, \"Oh yeah, am I like a secret character?\" I was like, \"I don't know, dude.\" He's like, \"Am I hard to unlock?\" I was like, \"I don't know, but you should be cuz you're worth it.\" You saved that for sure. That was that was a good save of the conversation. Uh, but no, it was great. Like Tony Hawk's walking around like a lot of our just kind of like industry friends were there, too. Like just good vibes. But like what was crazy is we were all front row of this concert. Yeah. Yeah. We were up against the barricade. It was awesome. Yeah. It's like I am an old ass man. I have not been front row to a concert in decades. Oh my god. Next you",
            "start": 2652.88
        },
        {
            "text": "front row of this concert. Yeah. Yeah. We were up against the barricade. It was awesome. Yeah. It's like I am an old ass man. I have not been front row to a concert in decades. Oh my god. Next you next to what looks like Jesse Patelli. Yeah. And Gio. Ton of great people there. Uh yeah. I'm like front row of Lupe Fiasco which was like absolutely just insane. Like I am a Lupe fanboy. Um I've seen him. This is my 10th time now seeing him. Uh, and that was a fun surprise. So, anyway, never saw front row. Um, incredible, incredible stuff and like a very, very, very cool experience. But, um, I definitely regret a couple things. Um, I am a 35-year-old man and um, I don't got it like I used to, even when it they make it easy. Even when there's not hell of people uh, pushing against you. This was kind of like a nice relatively chill environment. Um, but like the first couple songs that um, Steve Cavalo's band, which I uh, um, my ears were blown out within 20 seconds of them playing. And we",
            "start": 2687.04
        },
        {
            "text": "kind of like a nice relatively chill environment. Um, but like the first couple songs that um, Steve Cavalo's band, which I uh, um, my ears were blown out within 20 seconds of them playing. And we were so close to the stage that the speakers playing the vocals were behind us. So, all we heard was the music and no vocals at all. And it was kind of a weird experience. They fixed that throughout the night. Um, at a certain point the two of you were like, \"Hey, we're going to go enjoy the the rap portion of this show up in seats like adults.\" And I was like, \"You know what? I'm rocking. I'm standing here the whole time.\" I still hear it. I still hear it. It was horrible. You got you got to bring those uh you know the earbuds. You know, Brian Shay had AirPods in the whole time he was a kid. What we'll do is we'll get you to some smaller shows, some smaller really loud punk shows, and we'll kind of we'll we'll build you back up, Tim, to be prepared for moments like these. I just don't know,",
            "start": 2738.96
        },
        {
            "text": "we'll do is we'll get you to some smaller shows, some smaller really loud punk shows, and we'll kind of we'll we'll build you back up, Tim, to be prepared for moments like these. I just don't know, man. My ears are out. I think my They're gone. Like I think what happened to me that night changed me forever. You were not the same after this. He's broken. I was happy there was a pit, though. So, the Adolescence came out and they played and they were like they were like an old like legacy like like California skate punk band like and it was great. And then when they when they got into Amoeba, the big song from you know the original Tony Hawk games kind of a pit like a threeperson little pit. It was like a swimming pool. Honestly, it was more it was like 15 people. Okay. It was kind of popping off a little bit. Yeah. You were right next to it. I was like, \"Yeah, I was right next to it.\" And then I got a lot of [ __ ] for not actually like joining. Uh, which I understand, but I also was",
            "start": 2791.92
        },
        {
            "text": "off a little bit. Yeah. You were right next to it. I was like, \"Yeah, I was right next to it.\" And then I got a lot of [ __ ] for not actually like joining. Uh, which I understand, but I also was like, \"Hey, I'm trying to like I wanted to support them doing their thing.\" It's always that weird thing where I'm like, \"God, I really am an old ass man.\" It's just like back in the day I would have been. You got to pick and choose. Like sometimes you got to help people out, sometimes you got to join. And you know, that was just your moment to help people out. I didn't I didn't join either, but I really enjoyed watching it because it was kind of like, you know, when you get in like a hot tub or a swimming pool and they all do the uh, you know, make a whirl pool. That's kind of what it was. It was great. It was awesome. Yeah. Uh yeah, Tony Hawk's uh THPS Fest. Definitely an experience I will never forget. Wait a minute. We we did bury the lead here. Stu talked about this on the Skill Up uh",
            "start": 2835.12
        },
        {
            "text": "was great. It was awesome. Yeah. Uh yeah, Tony Hawk's uh THPS Fest. Definitely an experience I will never forget. Wait a minute. We we did bury the lead here. Stu talked about this on the Skill Up uh weekly news show, but Stu, you know, got to at least briefly meet the man himself. Yes, I did meet Tony Hawk. It was I I say meet and it was really just me shaking hands and, you know, being like, \"Thank you for your service. Uh I love your games. uh here's my copy of Tony Hawk's Pros Skater 4. Could you sign that? And he's like, \"Yeah, man. Of course.\" Like, \"I'm I'm fine.\" Like, \"Whatever.\" And then other people were mobbing him to come in, so I had to I had to back away. But it it was kind of a once in a-lifetime thing of like, \"Yeah, that thank you for my childhood and my introduction to games and skateboarding and like all that.\" I wanted to say all that to him, but all I could say was thank you and then walked away. I mean, you got your game signed. I did. I got my skater platinum",
            "start": 2866.08
        },
        {
            "text": "games and skateboarding and like all that.\" I wanted to say all that to him, but all I could say was thank you and then walked away. I mean, you got your game signed. I did. I got my skater platinum hits on Xbox sign that you may or may not have bought that day, but that's okay. Uh I had another copy of it. Yeah. Um but it was really I mean he was he was kind of sick. I felt like he I felt bad. He was coughing a little bit and people were mobbing him, but I think he got his time in. Everybody got to see him and then he you know went up and introduced all the bands and stuff. So it was cool. Yeah. Jake, I thought you were uh leading into the the most important lead that we uh buried here. Uh we didn't just meet Tony Hawk. We also met Tony the Tiger. Oh. Um because apparently there's some cross marketing thing going on with uh Kelloggs. Yeah. And uh like when we left they gave us Skate Decks which was super cool, but then they also gave us like a a box of Frosted Flakes that was like a",
            "start": 2910.0
        },
        {
            "text": "marketing thing going on with uh Kelloggs. Yeah. And uh like when we left they gave us Skate Decks which was super cool, but then they also gave us like a a box of Frosted Flakes that was like a Tony Cross Tony thing. And I'm like what's going on here? We I'm not going to lie, that was all I ate for like the 30 days I was there. I was like I'm not trying to spend money. Let me just dig into my frosted flakes. We walk into the THPS fest into the theater. The first thing we see is this man in a giant uh Tony the Tiger costume. Incredible. And like you could just tell this guy was jacked. You know what I mean? Like this guy was immediately intimidated by his alpha male energy. I was just like, \"Oh man, that's a big boy right there.\" And we had this whole group of games journalists just or media, whatever the [ __ ] you want to call us, losers. Uh we're just all standing in a circle next to this giant uh Tony the Tiger and all of us, of course, and he's just mugging. He's just doing all",
            "start": 2949.12
        },
        {
            "text": "whatever the [ __ ] you want to call us, losers. Uh we're just all standing in a circle next to this giant uh Tony the Tiger and all of us, of course, and he's just mugging. He's just doing all kind of bravo around like flexing on us and um we're all joking about it and just thought it was so funny. Uh his handler cuz he needed a handler. Uh eventually Tony was uh getting a little hot in there so he had to go um like like cool off. I don't know what he did but he walked away and like the way that this woman talked about Tony. Yes. She just it How would you describe? Can we talk about it? She came over. She was literally the same vibe as have some more sloppy joe's. She was like, \"But about Tony the Tiger,\" she's like, \"He was real hot in there, huh, boys?\" Yeah, that's crazy. She's like, \"Yeah, she's like slapping us on the back.\" Yeah, and then one of your replies, \"Stop it, lady. You're scared.\" Scared. That was It was very very funny. But yeah, God, we just had such a such awesome",
            "start": 2989.28
        },
        {
            "text": "\"Yeah, she's like slapping us on the back.\" Yeah, and then one of your replies, \"Stop it, lady. You're scared.\" Scared. That was It was very very funny. But yeah, God, we just had such a such awesome time. Gio had a Captain Crunch jacket on. I was worried they were going to get in a fight or something. Yeah, there was definitely some worries there, but everything ended up okay. I also got some extra game time in because like on the upstairs balcony they just had stations set up. So I was like, \"Oh [ __ ] I'm just going to go get some more game time in.\" So it's good. It was good to spend a lot of time with the game, even if it was like a work in progress version of the game to see a lot of it was good. Also, I want to give props where props are. Uh Tim and I both kind of like cleared out all the objectives during the during the play session pretty easily. And then we were kind of hanging around talking and then we played past the controller. We just did two-minute high scores. like we",
            "start": 3033.52
        },
        {
            "text": "the objectives during the during the play session pretty easily. And then we were kind of hanging around talking and then we played past the controller. We just did two-minute high scores. like we just ran it and uh Tim beat me. So, good job, Tim. But it was just it was just cuz I you started the show saying that Tony Hawk is like the only game that you're like good at and I'm right there with you. It's the only game that I'm like good at and the same way you said where I'm like I am not saying I'm the best. But if I had to play choose a game that I'm like there's a good chance I might beat you, it's Tony Hawk. And so we we had a nice little back and forth though. And I feel like both of us I could tell you were I was I kept looking at your screen and I was like he's definitely like we're like at the same we're at the same level you know which is you could watch someone see their style and you're like okay cool I get it I get where we're at here. But do you remember do you remember",
            "start": 3073.44
        },
        {
            "text": "like at the same we're at the same level you know which is you could watch someone see their style and you're like okay cool I get it I get where we're at here. But do you remember do you remember the scores? Do you remember what I didn't even like uh yeah it was sub a million almost a million. I was at like 900 something but like I didn't hit that million. I was in the 700s. Yeah we were close controller cuz I was on an Xbox controller. Xbox controller stats weren't fully updated at all. We had limited specials. like there was a lot of of factors around. But um anyway, it was uh definitely a fun time and I got to meet Andy THPS uh which was a very big deal to me because uh he was there um just uh to play the game and kind of talk about it cuz now he he streams. If you're into Tony Hawk, you should definitely follow him. He does awesome stuff. Um legend in the community. Yeah. Debatably the greatest Tony Hawk player of all time. And like I don't even think it's debate. Like I think he",
            "start": 3109.28
        },
        {
            "text": "should definitely follow him. He does awesome stuff. Um legend in the community. Yeah. Debatably the greatest Tony Hawk player of all time. And like I don't even think it's debate. Like I think he is like I used to download uh his gameplay videos just to try to learn from him back on like Kazah and Limewire back in the day when like the videos were like the smallest things in the world. That's awesome. Um but I mean he's he's incredible and he was so good at the games back in the day. Neveroft ended up hiring him. So he ended up working on most of the games uh in some way. So it was cool cool to actually meet him and he was a super cool guy and like getting his takes on everything was also like very fun. But yeah, he he's legit good. Yeah. knows what he's doing. Credit to his uh his coverage, too. Uh it's it's very in-depth. Like he gets very granular. So, if you're so into Tony Hawk where you you you care about the extremely minute details, he's done a lot of good coverage that's",
            "start": 3149.36
        },
        {
            "text": "too. Uh it's it's very in-depth. Like he gets very granular. So, if you're so into Tony Hawk where you you you care about the extremely minute details, he's done a lot of good coverage that's really kind of taken off in the community and uh big big props to him for that. His interviews were great, too. So, yeah, if you want more, highly recommend his stuff. Absolutely. Very very very cool. Andy THPS, check that out. Um, Stake Stakes Animation says, \"Do we know more about the secret Spongebob area?\" Oh. Um, yes and no. We didn't we didn't get to play the Skater Island level in um the the preview we did, but we did see that it's there. Like there there was a image that clearly was Skater Island. The Spongebob secret area isn't going to be a secret area like that. Like what we saw in that Switch trailer, that's going to be it. Like if you remember in the original Tony Hawk 3, you could jump off the pirate ship and you kind of go into this like area, but it kind of just resets you back.",
            "start": 3189.68
        },
        {
            "text": "trailer, that's going to be it. Like if you remember in the original Tony Hawk 3, you could jump off the pirate ship and you kind of go into this like area, but it kind of just resets you back. Like it's like just a quick little Easter egg, but now the Easter egg Spongebob instead of like whatever the hell it was before, like a shark or whatever. Yeah. Davy Jones lock or whatever. Yeah, exactly. Yeah. Um we're about to wrap up here. Is there any final things you guys want to say about our experience? No, I just had a great time. I was really not I was expecting something baseline good, but it came away with it much more excited than I expected to be, I think. Um, and yeah, I'm excited to play when it comes out in July. Yeah, Jake. Yeah, I think I'm excited to see, you know, if there are more career goals, like stuff like that kind of addressed, but otherwise, like it it I love going into a game preview where I'm like, \"Oh, okay. This is exactly what I was expecting. This is good.\" uh",
            "start": 3233.44
        },
        {
            "text": "career goals, like stuff like that kind of addressed, but otherwise, like it it I love going into a game preview where I'm like, \"Oh, okay. This is exactly what I was expecting. This is good.\" uh still looking for, you know, the conclusion of the multiplayer and how that's all going to work, but it is going to be crossplay now and they're they're really excited about that and I think that's good in terms of keeping a player a player pool tight for a longer period of time hopefully. Uh and then it's just launch Iron Galaxy. The Iron Galaxy has had a couple of little fumbles in the past, so I hope that doesn't happen with this, but so far, uh, all sign all signs are pointing to it being a pretty good representation of the original game, despite a couple little complaints here and there. So, honestly, it's going to be the same thing. I'm a sucker. I'm going to buy it on my PlayStation, and then I'm going to be like, \"Oh, I want it on Steam Deck.\" And I'm going to buy it there, and then",
            "start": 3274.64
        },
        {
            "text": "honestly, it's going to be the same thing. I'm a sucker. I'm going to buy it on my PlayStation, and then I'm going to be like, \"Oh, I want it on Steam Deck.\" And I'm going to buy it there, and then it's going to go on sale on Nintendo Switch or something, and I'm going to buy it there a couple months later. I'm a sucker. It's just how it it goes. But it's my testament to like me loving these games and the fact that it feels like three and four and I'm already predicting that I'm going to have it on all my devices. That's a win. Man, I am right there with everything you just said. Thank you boys so much for joining me. Stu, where can people find you? You can find me on the Skillup YouTube channel. Uh I'm not my voice, but I'm editing most of the time and editing the Friends for Second podcast. Uh where I get to listen to Jake's lovely voice bi-weekly. Um and that's it. He edits out all my slurs that I say Jake. No, not you. Horrible, horrible words. Jake, where can people find you? Uh,",
            "start": 3315.2
        },
        {
            "text": "Uh where I get to listen to Jake's lovely voice bi-weekly. Um and that's it. He edits out all my slurs that I say Jake. No, not you. Horrible, horrible words. Jake, where can people find you? Uh, people can find me everywhere by searching Jake Baldino. B A L D I N O. Uh, and I'm also on game ranks. I'm on the Friday news show there. I've never missed a Friday in like 10 years. Uh, the Before You Buy videos I do, and uh YouTube.com/Jakebaldino. Yeah, I'm all over the place. Of course, Friends per Second as well. the thing that Steu works very hard on. I talk with my friends and uh we have a great time on that podcast. You already know Friends per Second, but check it out if you don't. Of course, we're talking about Skill. We're talking about Jake. We're talking about Lucy. Godamn James. Legends. All right. We all already knew that. Thank you boys so much for hanging out with us. Thank you everyone for watching and allowing us to get so nerdy and nerd the hell out about something that",
            "start": 3349.84
        },
        {
            "text": "All right. We all already knew that. Thank you boys so much for hanging out with us. Thank you everyone for watching and allowing us to get so nerdy and nerd the hell out about something that we love so much in Tony Hawk's Pros Skater. I can't believe it's back. I can't believe we're still talking about it and that it's still this damn good. Uh stay tuned for our Andor screencast. That's not going to start for another 15 minutes cuz we have to wait for uh Carbon and Sage to join, but it's going to be a lot of fun. Uh and then after that will be the Nvidia sponsored Doom stream. Check out Nick and Andy playing Doom: The Dark Ages. Uh but until next time, love you all. Goodbye.",
            "start": 3397.2
        }
    ]
}