{
    "id": 1758,
    "video_id": "16NFMMa4ncs",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Casting The Uncharted Movie and Donald Trump - The GameOverGreggy Show Ep. 128",
    "description": "We discuss who we would cast in the Uncharted movie, Greg being single, Donald Trump, and tabloids. (Released to Patreon Supporters on 05.13.16)\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1463727600,
    "duration": 7001,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Life 2 is happening May 28th and 29th. It's a two-day event. The first day is going to be a completely ridiculous stage show. What we have planned this year completely blows last year on the water. I don't even know how that's possible because we were really stupid last year and this year's somehow even stupider. Day two, it's going to be full day of meet and greets. We're hanging out with all of us. A bunch of Rooster Teeth people are there. Fun House people are there. Achievement Hunter, it's going to be a grand old time. There's going to be some games to play. There's going to be signings. It's exciting. It's a really fun time. There's going to be exclusive merch. Oh yeah, there's definitely going to be exclusive merch. Go to kindoffunny.com slash tickets to get your tickets today. There's a couple of VIP tickets still available. So make sure if you want one of those, you act fast. What's up everybody. Welcome to the Game Over Greg show. I'm one of your hosts, Greg",
            "start": 0.0
        },
        {
            "text": "today. There's a couple of VIP tickets still available. So make sure if you want one of those, you act fast. What's up everybody. Welcome to the Game Over Greg show. I'm one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. Hi. Ballpark. How many Heather Gray shirts are in your closet? Five. Really? At least. Yeah, I agree. At least it depends. I have some charcoal gray shirts that count as Heather. Yeah. My wife's, it's kind of an inside joke to my wife because she likes it as well. So half of our closet is Heather Gray, but we have to separate them. Sure. Otherwise I might mix one up and wear her shirts and she's significantly smaller than me. It would be embarrassing. But it would look good because you have the ice cream scoops I'm always talking about. There they are. Oh, look at them go. Wow. Over there's the pure one, Tim Getty's. I like Rocky road. Oh wow. Okay. I'll take that. I was thinking pranings and cream. Rounding out the group, of course,",
            "start": 32.64
        },
        {
            "text": "they are. Oh, look at them go. Wow. Over there's the pure one, Tim Getty's. I like Rocky road. Oh wow. Okay. I'll take that. I was thinking pranings and cream. Rounding out the group, of course, the pride of Long Island, Colin Moriarty. It's good to be here today. Before we go, I'm going to make someone's day as I often do. Someone reached out to our Facebook group and I go through those messages and I usually just read them and then they'll respond. But what I did this time was, no, I respond. A lot of people say complimentary things. I always respond to those, but some people are just like asking, you know, I've got time for everything. No, but one young woman named Sarah Carpenter wrote us a message and she said she had a boyfriend who's turning 21 years old. His name is Prince Borutski. Now this was the thing. I was like, there's some joke here. Cause this man's certain name is certainly not Prince Borutski. So I went to her Facebook page and then I went to pictures of her. She",
            "start": 85.84
        },
        {
            "text": "Now this was the thing. I was like, there's some joke here. Cause this man's certain name is certainly not Prince Borutski. So I went to her Facebook page and then I went to pictures of her. She had a picture of her with a man. I click on it tagged Prince Borutski. That was good enough for me. So happy 21st birthday, Prince Borutski from your girlfriend, Sarah Carpenter. Do you think she's related to John Carpenter? No, probably not. The band, the carpenters. No, definitely. My boss, the Jewish carpenter. Everyone's related to him in some way. Do you think that he's related to Prince at all? That was really the time. That was really the time we named it. This of course is not the surname. So nonetheless, I don't always do this. A lot of people make a lot of requests. A lot of outlandish requests. You never do this. A lot of outlandish requests. This is the first time I ever remember you actually doing this, but for Prince Borutski. It's a historic day from Sarah Carpenter. Colin",
            "start": 126.4
        },
        {
            "text": "requests. You never do this. A lot of outlandish requests. This is the first time I ever remember you actually doing this, but for Prince Borutski. It's a historic day from Sarah Carpenter. Colin descending from his ivory tower to grace the people with his presence and wish them a happy birthday. I like your Olmec shirt by the way, Colin. Thanks. I don't know what the hell is it? What is this? What is this? Oh, is it? Get your shit together. You got a feta for a reason. I do. Play it. Play it, son. I visited the Axiom Verge booth. Who was it? What were the two games there? Kazim was there as well. And we said, what's up to Tom? And I noticed they had some other cool shirts. I'm kind of the OG supporter, but these two guys, there was three shirts. I already owned one of them and these guys bought the other two. Are you being serious? As you know, we have a problem here with a shirt redundancy issue is that Tim, Kevin, and I all own the exact like five shirts. So not true. Well, Kevin",
            "start": 168.64
        },
        {
            "text": "bought the other two. Are you being serious? As you know, we have a problem here with a shirt redundancy issue is that Tim, Kevin, and I all own the exact like five shirts. So not true. Well, Kevin has a producer's producer shirt. So do I. You two have the aerobic shirt. I have three other shirts that you have. So we all have to just kind of time it. It's a filthy casual. It's when we get to events where you have to text each other and ask what's everybody wearing. So I just, I wanted to alleviate that. And then it's a 50 50 if Kevin's just going to wear that shirt to annoy you. Right. Well, it's, he doesn't see texts. His phone doesn't work the way. It's also true. His android phone does not work the way it's supposed to. Very true. If you didn't know, ladies and gentlemen, this is the Game Over Gregi show each and every week. Four, sometimes five best friends gather on this table. He's bringing a random topic of discussion for your amusement. I want to slap a little slower today.",
            "start": 211.68
        },
        {
            "text": "Game Over Gregi show each and every week. Four, sometimes five best friends gather on this table. He's bringing a random topic of discussion for your amusement. I want to slap a little slower today. Sometimes you got to slow slap it so you can slow slide it in. Watch what the fuck Nick. Oh, that was, if you like that head over to patreon.com slash kind of funny where you can get each and every show early by tossing us a couple of bucks along with exclusive perks and goodies. Oh yeah. The goodies. If you don't want to toss us any bucks, you can head to youtube.com slash kind of funny. We're posting the entire show topic by topic day by day until it's one big video and MP3 released the following Friday. Beer amusement. You used to say that. Then you stopped saying it. We don't care if people are amused anymore. I'm not sure I ever cared. But here's the thing about it. They nonetheless are. It's true. It's true. We all have a role to play in this stage play of life. You know what I mean?",
            "start": 247.68
        },
        {
            "text": "are amused anymore. I'm not sure I ever cared. But here's the thing about it. They nonetheless are. It's true. It's true. We all have a role to play in this stage play of life. You know what I mean? Yeah. Yeah. Kevin, do me a huge favor. Can you do it for me? Go get me a piece of paper and a, or you'd rip one out of your book and a pen. You're just going to give him mail. You're just going to give him a doing something a little different moving forward. Greg queued up premiere for me today. I did. It's you guys are treating this like it's rocket science. Really not that never have never done that. It's very easy. I always begged you for help. I'm already doing left, right up and down kind of things on there. I'm cutting fucking videos that you wouldn't believe. I'm literally just using the razor blade tool. You wouldn't believe. Can you hand me a pen? Kevin, he stole off. Can I just get a marker or something? Anything? Any writing implement will do. It's a circus today. Those",
            "start": 293.6
        },
        {
            "text": "using the razor blade tool. You wouldn't believe. Can you hand me a pen? Kevin, he stole off. Can I just get a marker or something? Anything? Any writing implement will do. It's a circus today. Those goaltending reflexes. Amazing. Now what I want to do moving forward, because I went on Colin and Greg live today that Nick hosted with me. Just give him back his toy. This is going to go all show. That's fine. It's right there. Go get it. Is I cut out two funny clips from the show today. One show, one clip about the whole Pokemon then with the owl, which is pretty funny. And then the second clip was telling Kevin, you can't smoke cigarettes because you shouldn't Kevin. Now that would have been way easier for me. I had to go into my mind's eye, my mind's eyes memory. So my mind's memory and figure out where those were. And now I'm just going to write down timestamps when something that humors me happens. I like that. And then I can just go into the raw clip and use the razor blade tool and",
            "start": 338.4
        },
        {
            "text": "out where those were. And now I'm just going to write down timestamps when something that humors me happens. I like that. And then I can just go into the raw clip and use the razor blade tool and the plus and minus buttons and some other things that I do. And then I hit the export button and blah, blah, blah. I just have a video. Yeah. There's no bumpers on it. There's no name things on it. No lower thirds. No chyrons yet. Maybe ever. But I'm telling you right now, you're taking kind of another future. I love this idea. I love, I would just ask that we put some notification to the audience of what the show is and when they might be able to see the full version of that. No, no context. Don't need that. Those are my rules. He's going to post this on a Facebook. He's making up no, he already made up the name. It's like principal hot. Okay. Yeah. No, definitely have the paper. We're already set to go. Thank you, Kevin. I love that you're everything you do is now from now on with his",
            "start": 396.0
        },
        {
            "text": "made up the name. It's like principal hot. Okay. Yeah. No, definitely have the paper. We're already set to go. Thank you, Kevin. I love that you're everything you do is now from now on with his editing and seeing, but like, like when radio head drops an album, you don't know when it's going to come. You don't know what it is. You don't know how much it is. You pay your own room. It doesn't matter. It's just there one day. The dog literally thinks his toy is in the painting. Can you turn around and give it to him? It's the gingerbread man. The painting is going to fall on his head and kill him. He's like, give it to me. Nick. Yes. What's your topic? So we did this, uh, for metal gear, if you'll recall. And I, there already is of course, a movie in the works from most likely a reputable studio, probably Sony. If I had to guess, not really sure. I didn't really bother to look it up, but because I have you gentlemen here today and because I'm such a huge fan, as you know, of the uncharted",
            "start": 442.72
        },
        {
            "text": "probably Sony. If I had to guess, not really sure. I didn't really bother to look it up, but because I have you gentlemen here today and because I'm such a huge fan, as you know, of the uncharted series, I thought we would go through and cast the uncharted movie for them. So they don't have to worry about this anymore. This is going to be magical. I'm excited about this. I'm going to get out the old, my immediate thought. Are we making the uncharted one, two or three or four? We're making a fresh movie and what we're going to need here. All right. Well, these are your notes for clipping things out. Well, there's four sides of this piece of paper because I folded it. And there's so many notes. You're going to take so many time codes. Two or three a show. We're not that funny. All right. We're kind of fun. So we're going to need Drake. Well, hold on. We have to, I think we have to decide again where we're starting or what we're doing. What is the scope of the movie? I mean, it's",
            "start": 490.0
        },
        {
            "text": "We're kind of fun. So we're going to need Drake. Well, hold on. We have to, I think we have to decide again where we're starting or what we're doing. What is the scope of the movie? I mean, it's obviously a trilogy. We're making the trilogy or the quadrology. We're making a movie trilogy. That doesn't necessarily mean it's based on uncharted one, two, and three. It's just a trilogy of uncharted movies. All I'm saying is that there's, there's a few characters. It's very basic. You're going to need them. So you need Drake. You need Elena. You need Sully. I would say you also probably need Chloe. Yeah. And I would say you're even in a cutter. You need cutter. I want cutter in there. I want cutter for sure, but I don't know if you need them. So, and then when we have to, so that's really the core cast. Now you might want to, I don't want Sam in there. It's just awesome to see. No, no, hold on. He couldn't spell Elena. And then he just stopped at L. Is it Elena? Elena. You nailed it. I",
            "start": 528.16
        },
        {
            "text": "core cast. Now you might want to, I don't want Sam in there. It's just awesome to see. No, no, hold on. He couldn't spell Elena. And then he just stopped at L. Is it Elena? Elena. You nailed it. I thought it was Elaine. I just thought Elaine. E L a I N E. Almost had that. Okay. Drake, Elena, Sully, Chloe, cutter. That's good enough. You're not knowing he's a live stream in this. Chloe. How do you spell Chloe? Nick? C O O. Sully use the Adam E's dude. It's a circus today. And cutter, cutter. Okay. And then we need to, we need to identify the villain and that's the big problem. But we're doing a whole trilogy. We're doing the trilogy trilogy. Cause if we're doing the trilogy, then it's simple. Then we, yeah, we're I say we fold a lot of the elements of one into the story and it's LeVar, Lazarevich, Marlowe, and now a new guy, Nadine and Rafe. Thank you. I can remember his name for a second. So those are Marlowe, R. What about what's Marlowe's boy's name? Oh, Talbot. Talbot. Oh Lord. Do",
            "start": 569.76
        },
        {
            "text": "Marlowe, and now a new guy, Nadine and Rafe. Thank you. I can remember his name for a second. So those are Marlowe, R. What about what's Marlowe's boy's name? Oh, Talbot. Talbot. Oh Lord. Do we need him? I say we replace him with Rafe. All right. So yeah, that's okay. And Rafe. And I would, I'm going to say, I'm going to say, get rid of what's her name? Nadine. You don't like Nadine? Nadine doesn't serve a purpose. I think she does. That's covered in our spoiler cast and the review, but I'll allow it. I will allow you to read the world of Nadine. I want Sam though. Sam doesn't need to be there for the first movie, but I do. I know I think Sam should be a character from two on. I think that we should get more Sam, which then makes him more of a character. Okay. Okay. I feel like he deserves it. Sam. Now as usual, I'm just going to point out with what we're doing so far, not a lot of diversity in the cast. How do we get Steve Harvey in this picture? I'm going to play the part of the",
            "start": 622.0
        },
        {
            "text": "it. Sam. Now as usual, I'm just going to point out with what we're doing so far, not a lot of diversity in the cast. How do we get Steve Harvey in this picture? I'm going to play the part of the studio exec. Thank you. As always, we need, we need diversity and the diversity cannot be the bad guy. Okay. All right. So these are, make sure you have all those names. Those are all the names you need. Okay. I have, okay. I have all of these people. I spelled Lazarevich doesn't matter. Doesn't matter. Doesn't matter. Not even at Sam and young Drake. Okay. Sam and young Drake. Okay. Young Drake. Oh, Rafi. I have that. Okay. Rafi Sam. Who are these? Marlowe Lazarevich and Rafe are bad guys. Okay. Sam and young Drake. Yeah. Cool. Okay. Cool. Those are the good guys, right? It's only Chloe cutter, Sam young Drake. These are quasi good 90 bad care. We don't know. So I like the idea of in the first movie, the majority of these characters are at least introduced at least as an idea that they're",
            "start": 669.36
        },
        {
            "text": "Sam young Drake. These are quasi good 90 bad care. We don't know. So I like the idea of in the first movie, the majority of these characters are at least introduced at least as an idea that they're there. I don't want none of this fucking Spider-Man three Batman V Superman garbage where there's too much shit going on at once. But I want, well then I think you need to start, I think by the middle of the second movie, everybody has to be introduced. Yeah. But yeah, but I think that there should at least be cameos and hints. There should be like references to what's your, what's your hint for Chloe, a photo in his wallet. Huh? No, no, no. I don't know. I don't know. Maybe I can phone call me some nice text voicemail or something. Jesus. Maybe a little text message. Okay. Maybe a picture message. Now. Okay. Now can I ask this question? No. What ethnicity is Chloe? Can she be any ethnicity? Does any of these people can be any ethnicity? I guess. I mean, cool. Well, I mean, I'm just saying",
            "start": 718.32
        },
        {
            "text": "Now. Okay. Now can I ask this question? No. What ethnicity is Chloe? Can she be any ethnicity? Does any of these people can be any ethnicity? I guess. I mean, cool. Well, I mean, I'm just saying this goes back to the, well, this goes back to the thing we were talking about with what kind of agency we have over the characters. I mean, I'm not, I don't think it's a bad thing to say like these characters all exist. Sure. So I'm not so sure that you could mess around with that too much unless you're rebooting Uncharted. Jimmy Olsen black. Nobody cared. Well, all I'm saying is that like, it's, you know, hasn't been black since we have a vision of who these guys are. And I was gonna say, Chloe to me, I don't know what Chloe is. She's either like, Australian. I think Chloe's like Filipino or something. Okay. We can do that. But she has that accent. Yeah. I mean, she might be from the South, but I mean, I think she's like, or like some sort, some way. I think it's the middle Eastern. No, just",
            "start": 756.4
        },
        {
            "text": "Okay. We can do that. But she has that accent. Yeah. I mean, she might be from the South, but I mean, I think she's like, or like some sort, some way. I think it's the middle Eastern. No, just let them go. Something going on there. I'm sure there's an answer. She's PS3 graphics level ambiguous because I mean, out of all of them, Jesus Christ. So it depends. Are we talking about cut scene or we're talking about in game or Jesus Christ. I don't know. Nick searches. No, no, no, no, no, Nick's like, I need to find an image of Chloe from Uncharted. He puts into Google, Chloe, Filipino. Cause you guys were saying she might be Filipino, but Chloe, then I realized I can't listen to you guys in type at the same time. Open up her Wikipedia here. Tell me a little bit about it. She's she's she's this bad character is a fictional character in the series in 2009. I tried to among thieves phrase were designed to provoke. Let's look at the character design. No appearances. Maybe not Filipino. That's",
            "start": 792.64
        },
        {
            "text": "bad character is a fictional character in the series in 2009. I tried to among thieves phrase were designed to provoke. Let's look at the character design. No appearances. Maybe not Filipino. That's not true. What in the game? I think it's like she looks to me like she could be Persian to some degree. She's definitely let's call it ethnic. Is that, is that safe to assume Kevin? Now, but everyone, so she got to an inch, our Uncharted expert. Everyone else is actually white except well, his Arvish is white too. He's just Russian or Eastern European in some way, but everyone else is Western. Do we want to play around with the races and even the gender? You have to, I'm fine with that. Well, you gave Nadine the boot. So that's true because she has literally no purpose in the story. She's really good in the story. I like her on. Uh, so he could easily be Steve Harvey and I, he doesn't have to just be Steve Harvey. I'm just a big Steve Harvey fan. I was going to go, if you like the",
            "start": 838.4
        },
        {
            "text": "really good in the story. I like her on. Uh, so he could easily be Steve Harvey and I, he doesn't have to just be Steve Harvey. I'm just a big Steve Harvey fan. I was going to go, if you like the continuity that Steve Harvey is in everything we do, the Steve Harvey cinematic, you know, we're going to push the army down for this fucking can't be the bag. I feel like he'd be a dope desire of it, but I mean, he could, he's too nice. He's too nice. But imagine what the cigar cause he already smoked cigars and he's just like, Oh, God damn Dorado. We get more fun with silly though. I feel like slowly deserves sullies. One of those, like he deserves greatness. Not to say that Steve Harvey ain't great. Steve Harvey could be a bad guy, but we have to have another ethnic person on the other side to kind of balance him. So if you wanted to people in there that were ethnic, I would say, are we allowed to say ethnic like this? I'm just, I'm just saying you're Peruvian. Is that okay? We want to",
            "start": 885.84
        },
        {
            "text": "to kind of balance him. So if you wanted to people in there that were ethnic, I would say, are we allowed to say ethnic like this? I'm just, I'm just saying you're Peruvian. Is that okay? We want to make sure we need a minority to weigh in from my golden tower. We need a minority report. Yeah. Yeah, it's fine. It's fine. I think it's okay. Right. I think we can change implications. I'm just making sure it's okay. I think we can change cutter. We're doing it. Cutter's character. I think it could be any race. Okay. That's not bad. That's not anything. I want to black Jimmy Olsen from, I mean, cut her looks exactly like Jason's day at them though. Now look at the czar and bitch, just put uncharted and then start trying to spell it. It'll come up. Who literally right. The first thing. What's the other dude. The images didn't even change all that's amazing. Chloe and yeah, I think he's key to he's a side character, but he's like a little flip floppy going on. It's pretty quick that he flip",
            "start": 922.96
        },
        {
            "text": "other dude. The images didn't even change all that's amazing. Chloe and yeah, I think he's key to he's a side character, but he's like a little flip floppy going on. It's pretty quick that he flip flops, but he does. Yeah. So we stay, what does that count by that? Then we need Eddie Raj on here and we need Navarro. I don't know. And I also want that old man from one. We never remember the name of who serves some purpose, but we don't remember what you shot. So like this casting session's getting out of control. I'm going to rain it back in. Okay. Back to the leads. Okay. So our leads are Sully Elena and Drake, right? For Sully could be white. I see him as black for some reason. Steve Harvey. I want it. It could be Steve Harvey, but I see him more as Samuel L. Jackson. That's God. Awesome. Is it? Yeah. I was going to say God off naturally. Samuel Jackson's amazing. And he totally, totally do. He is amazing. I love Sammy Wells. You know, my friend from comic con talked to him twice. My",
            "start": 971.68
        },
        {
            "text": "Is it? Yeah. I was going to say God off naturally. Samuel Jackson's amazing. And he totally, totally do. He is amazing. I love Sammy Wells. You know, my friend from comic con talked to him twice. My problem with it is just that he's too intimidating. Sully is like, I mean, think about Uncharted four, right? Like Sully isn't intimidating. Like the glass gets slapped away from him. Imagine SLJ saying, Oh, God damn. I'm into that. Yeah. I'm sold. What about no Reynolds? That's good too. So you said happy go lucky. There's nothing better than smoking. That's true. That's true. He was in the cannonball run for Christ sake. 35 years ago. He was in the cannonball. He can still move. I feel like Sully would be a dope ass old Robert Downey Jr. Like we got to give it a lot of time, but Robert Downey Jr. Has that kind of like, he's the cool old guy. We got to get the guys. I think, I think, I think Steve Harvey, I'm not even being facetious. All right. Should we want a black man to play",
            "start": 1023.6
        },
        {
            "text": "Downey Jr. Has that kind of like, he's the cool old guy. We got to get the guys. I think, I think, I think Steve Harvey, I'm not even being facetious. All right. Should we want a black man to play Sullivan? I feel like Steve Harvey makes more sense than whatever we cast him in and metal gear solid. I don't even remember. I was thinking we cast him as like cyborg ninja or something like that. Cause we're a bunch of idiots. All right. Let's move on to Elena. Now again, here's the Emily Rose can play Elena. Right. Emily Rose could play. We'll put her down. Is this the cop out? She's a real actress though. She is a real actress. Great in Haven. You know, I love her and Jericho as well. But the problem is what are we trying? I think a lot of it comes down to Drake too. Are we trying to future proof for 10 years? And if so, are we saying fuck everybody we're making our move because then are we putting Nolan is on? No, see, here's my thing. I say we put a hard role that the voice actors",
            "start": 1067.28
        },
        {
            "text": "proof for 10 years? And if so, are we saying fuck everybody we're making our move because then are we putting Nolan is on? No, see, here's my thing. I say we put a hard role that the voice actors can't be it or else that's the obvious answer. I think that that's not that Hollywood ain't doing that shit. They just ain't doing it. But what the only reason I went to Emily Rose's name is cause it's no disrespect to Nolan North or these other guys. Emily Rose is a real actress. That does real shows and movies that later did this. Like this isn't her, what she does really as opposed to normal. North is a voice actor in mocap. I remember she came out of acting school. This was like first gig and then she got her TV show and everything else. I'm with you. My main, my main thing is like, and I love Emily. This isn't a knocking against Emily. What are, do we have to worry about the Hollywood ageism stuff? Are we worried at all about that in 10 years? Is she going to stay? Like how, what are we",
            "start": 1106.96
        },
        {
            "text": "Emily. This isn't a knocking against Emily. What are, do we have to worry about the Hollywood ageism stuff? Are we worried at all about that in 10 years? Is she going to stay? Like how, what are we casting? I'm not even going to let you answer that question. We need to worry about putting a huge lead in this that can sell the movie like Scarlett Johansson, always scar Joe. It's always scarred. She is. Emily Rose should be on table yet in terms of aging. I'm just saying this is a huge movie franchise. We're going to, we're producing this kind of funny co-production with whoever the fuck else owns the rights. So I assume at this point, is a PlayStation. So I assume Sony is going to produce it. Uh, movie theater there are the Sony doesn't matter studios. Um, they're going to want a big name for Drake. They're going to want a big name for Alina because they're going to want a trilogy. They're going to sign these people like five year deals or five movie deals. We've got to have a big day.",
            "start": 1145.44
        },
        {
            "text": "Drake. They're going to want a big name for Alina because they're going to want a trilogy. They're going to sign these people like five year deals or five movie deals. We've got to have a big day. Scarlett Johansson, first person that comes to mind. Why? Because I watched Lucy last night. Was it a good movie? It was interesting stuff happened during it. It was a movie that happened. She's great in it. Yeah. I'm gonna put scar Joe here. I'm going to say, and this is just based off of previous success stories that I've seen for Chloe and Alaina. I want Mila Kunis and Kristen Bell. Cause I feel like they'd, they have that nice dynamic together and they both kind of Mila Kunis was on my list here too. You want Kristen Bell as Alaina? Yeah. I think Mila Kunis can pull off a good Alaina. Just putting that out there as well. I don't think these girls are getting the movies made though, guys. I'm thinking more along the lines of like Kristen Bell, Mars two made single-handed. How about this?",
            "start": 1181.52
        },
        {
            "text": "that out there as well. I don't think these girls are getting the movies made though, guys. I'm thinking more along the lines of like Kristen Bell, Mars two made single-handed. How about this? How about this? How about this? How about this? How about this? How about this? How about this? Alaina, Olivia Wilde. Okay. Okay. Let's just get her on the list. Here's the thing. The blonde factor is an important factor with Alaina. But yeah, but like you can lighten anybody's hair these days. I get that. But I mean, like does it work? I'm going to say no, I don't like it. I love Ali Larder. I used to have such a crush on everyone. She could be a great, um, Chloe. I know I'm messing with the hair colors. I'm so sorry. That's the most important thing. Uncharted is all about good hair. You don't need to worry. Cause I watched the, the, the, the fantastic four movie and the one thing that bothered me at that movie. Otherwise it was phenomenal. Um, no, uh, no, not just could be, Jessica Alba. I was",
            "start": 1228.32
        },
        {
            "text": "to worry. Cause I watched the, the, the, the fantastic four movie and the one thing that bothered me at that movie. Otherwise it was phenomenal. Um, no, uh, no, not just could be, Jessica Alba. I was making a call back to the really bad or the other bad fantastic. Kate Mara's hair gets progressively more blonde as the movie goes. It's part of it's going invisible, distracting after a while. That's a perfect example though. Yeah. Jessica Alba and the fantastic four was no, no, but I'm saying don't bleach it. Just we lighten it up. And again, it doesn't need to be like, we don't need them to look exactly the same. I know, but making Sullivan into a black man, we can mess around with the hair color. I'm going to throw this on the table. Not for any particular role, but she's hot right now. Elizabeth Olson. Could she be later? Yeah, she's overused. And I don't, I don't think there's any good, any of these people. I don't want to tear you. I don't pay enough attention. Maybe that's what it",
            "start": 1268.56
        },
        {
            "text": "Olson. Could she be later? Yeah, she's overused. And I don't, I don't think there's any good, any of these people. I don't want to tear you. I don't pay enough attention. Maybe that's what it is. All right. So, so far then for my, for that role, I would say Scar Jo is my front runner. No way. Olivia wild. I love Olivia. Wilds doesn't have a star power of Scar Jo right now. I remember Scar Jo is going to be in really big movies for the next. It turns out she's she found the blue sap. She's a mortal. That's what Lazarevich is after Meryl Streep is Marla. I was going to say we can, we can nail that character. Yeah, I know. Yeah. Meryl Streep would be lots of old women and people, a lot of old people in this world that just won't die. I'm sick of Kristen Bell. I like it. I think she fits the role. She's that like that nice kind of just cool motherfucker. You know what I mean? Do you know what I mean? Colin? Yeah. I know. You know, I know you have random names that have no place in this",
            "start": 1307.76
        },
        {
            "text": "role. She's that like that nice kind of just cool motherfucker. You know what I mean? Do you know what I mean? Colin? Yeah. I know. You know, I know you have random names that have no place in this movie. All right. I'm going to say from Marlowe, just judging solely based on the picture. There's two actresses that come to mind, Holly Hunter. Ooh. Or Helen Mirren. Yeah. Helen Mirren is what I thought, but that's kind of a cop out. Here's one I want to float out. Awesome. Never a cop out. There's one I'll float out. It's a different direction for the character. Selma Hayek. She's older. I don't think it needs to be that you were an old lady. I think, you know what I mean? Like we're really playing with this now. Like I like Selma Hayek. Did you see how well playing with the Power Rangers is going over? How, how well playing with Ghostbusters is going over? Fucking people love it when you take something they know and love and you just tweak it a little bit. Just a little, just a little.",
            "start": 1350.64
        },
        {
            "text": "going over? How, how well playing with Ghostbusters is going over? Fucking people love it when you take something they know and love and you just tweak it a little bit. Just a little, just a little. Just take it and give them the exact opposite of what they expect. They love it. They love it. That's Hollywood right there. I spelled Selma Hayek's wrong. Just why do you care if you can read it? It's fun. Because you're making fun of me. You know how I spell Filipino every single time? With a P H. Oh, with a P H. Every single time. That makes sense. I mean, Philippines is spelled with a P H. It's annoying. It's annoying. No, he was, uh, who are you trying to put in for a landing? You're trying to put in a, Yvonne Strahovski. And you just put Evan Strahovski. He was like, oh, that's not our last name. Correct? To be fair, Nick, the Filipino, the Filipino thing gets really deeply confusing because it's the Philippines with a P Filipino with an F is the person. And then the language is what",
            "start": 1393.28
        },
        {
            "text": "name. Correct? To be fair, Nick, the Filipino, the Filipino thing gets really deeply confusing because it's the Philippines with a P Filipino with an F is the person. And then the language is what Tagalog. So it's like, all right, there's gotta be some sort of rule here where you're Filipino with a P from the Philippines and you speak Filipino, right? No, they, they, what do you mean by that? You're saying they spell the Philippines with an F. Yeah. We put the pH on there because we had to be fancy. Well, it's probably named after. How do you feel about this? Oh, Mary Elizabeth Winstead. I love her. Get her in this bridge. This is too confusing. Mary Elizabeth. She strikes me again as more of an Elena. I want her in everything. She would be a perfect Elena. Okay. There we all agree that she's a perfect Elena. Don't fucking bring up the hair. Mary Elizabeth Winstead. She's great. From field lane. She was great. Okay. Yeah, fine. That's fine. We're getting too hung up on this. This",
            "start": 1439.04
        },
        {
            "text": "she's a perfect Elena. Don't fucking bring up the hair. Mary Elizabeth Winstead. She's great. From field lane. She was great. Okay. Yeah, fine. That's fine. We're getting too hung up on this. This topic is going to take eight years. She would be good. Did you expect it not to? It doesn't matter how you spell it. What about Drake? We really should be talking about Drake. We usually double. I like when we double back to like, who's gonna, who's gonna submit this picture. So wait, who do we have? Who do we have firm right now? Do we have anyone firm? We have Steve Harvey as Sully firm. All right. If he for some whatever reason says, no, we're going to approach Samuel L. Jackson or Burt Reynolds. I also had Bruce Willis on this list. Just cause. He can be Lazarevich if you want it, but he's all hard to work with. I like that though. Bruce Willis is Lazarevich is a, that's a must. Okay. Okay. Also Jason Statham would be good. Cause he looks all like all these bad guys, bald white dudes.",
            "start": 1481.2
        },
        {
            "text": "all hard to work with. I like that though. Bruce Willis is Lazarevich is a, that's a must. Okay. Okay. Also Jason Statham would be good. Cause he looks all like all these bad guys, bald white dudes. Statham could be cutter though too. It's a very, it's a very insightful commentary on our current culture from not either. But can Bruce Willis do the, the, the, the accent? Does he need it though? Necessarily his name is Lazarevich. Tony, Tony Kukocz, his last name was Kukocz and he spoke fluent English perfectly. You had no idea. This guy was just not from Chicago. That's true. I just want to reiterate his name is Lazarevich and he's Russian. Well, I'm, I'm always fine casting someone who actually is of that background. So what about the dude, the only Russian guy I know, the crazy Russian dude from Armageddon. He can't, he's not bald, but he could do it. The guy's like, Russian parts, all made in China. He's also a bad Russian guy from bad boys and the bad Russian guy from any other",
            "start": 1524.16
        },
        {
            "text": "dude from Armageddon. He can't, he's not bald, but he could do it. The guy's like, Russian parts, all made in China. He's also a bad Russian guy from bad boys and the bad Russian guy from any other movie that needs a bad Russian guy. Isn't he in, he's in the big Lebowski too. Yes. And isn't he also the guy. We fuck you. He's in, he's in, he's in, he's in until dawn. Right. I'm thinking about the same guy. Yes. He is. He's a therapist and I told on great, great actor. None of us know his name. Oh, he's a character actor. Yeah. I'm going to, I'll, I'll, I'll search this. No, we don't. I mean, what are you getting him to be? Lazarevich? No, I'm just saying he's out there. We need him. Okay, sure. All right. So hold on. So we've got your, oh, I see what you're doing. Okay. I'm just putting down our, you know, the people. Okay. Okay. Lazarevich Bruce Willis. Are we locked on Bruce Willis for Lazarevich? No, no, no. He's not gonna be able to do the accent. I don't know. We're going to put",
            "start": 1567.68
        },
        {
            "text": "our, you know, the people. Okay. Okay. Lazarevich Bruce Willis. Are we locked on Bruce Willis for Lazarevich? No, no, no. He's not gonna be able to do the accent. I don't know. We're going to put him as two. Okay. Who are you putting as number one then? Telly Savas. Again, they don't need, you saw again with Lex Luthor and Kevin Spacey, how well it goes when you just take somebody to shave their head and say that character. I don't know anything about the character though. Is he the main bad guy? Guess what? He's the main bad guy. He really wants some blue sap and he shoots people. There you go. He wears a shotgun and body armor. Big bulky dude. John Cena. No, I was thinking the rock diesel. I think diesel is more obvious than the rock. Who's in every goddamn movie ever. You know what? Everybody likes, I'm not complaining. Yeah. I like the needing up the jungle. I like many too. I think Vin Diesel's good for Lazarevich and he could definitely do the accent. So well, he could do",
            "start": 1620.56
        },
        {
            "text": "Everybody likes, I'm not complaining. Yeah. I like the needing up the jungle. I like many too. I think Vin Diesel's good for Lazarevich and he could definitely do the accent. So well, he could do something. Not the best at accents Vin Diesel. Unless you talk about that shark commercial that he did. Remember that one? I do. I do. Yes. We all remember. So now what are you doing? Well, now I'm looking at wrath. Oh, right. Imagine Darren Brazil. There you go. Okay. Oh, this is Tom Hiddleston or whatever his name is. Oh, Loki. Yeah. Loki. Cool. Or Jake Gyllenhaal. I'm putting that out there. Jake Gyllenhaal. I like Nightcrawler so much. I mean, honestly, you don't want to give away. That role actually could be a big role. Jake Gyllenhaal is a really good pick. You give it to who's the pretty boy. Wow. Gosling. Gosling could do that. Here we go. But now Justin Timberlake. It's going to be Justin Timberlake. He'll do the theme song. I want him to do the theme song. It'll be a top 48. We're",
            "start": 1666.16
        },
        {
            "text": "boy. Wow. Gosling. Gosling could do that. Here we go. But now Justin Timberlake. It's going to be Justin Timberlake. He'll do the theme song. I want him to do the theme song. It'll be a top 48. We're not going to bring it into the second movie though. Yeah. Yeah. He's not going to be a bad guy. No, Justin would do JT would do it. Yeah. But he's not like that bad of a guy. I mean, it's kind of like he's, he's fine. Okay. Okay. So JT is our first. For Rafe. Jake Gyllenhaal for second. Tom Hiddleston. I don't even know how to spell Tom Hiddleston. You don't even need him. Because trust me, when Justin Timberlake turns this down, Jake Gyllenhaal comedy is going to deliver. You got to have your list because later when the like our notes get released, people will think it's cool. They'll be like, oh, they were going to approach Bruce Willis for the Russian guy. That would have been. All right. So now going back, we still needed a good one for Chloe. I thought we'd like Mila. No? All right.",
            "start": 1714.64
        },
        {
            "text": "oh, they were going to approach Bruce Willis for the Russian guy. That would have been. All right. So now going back, we still needed a good one for Chloe. I thought we'd like Mila. No? All right. I'm just putting that out there. Unknown like the, like my, my, she looks exactly like the actress who was a Elektra from Daredevil season two. Never got there. Didn't like her. Okay. No, I never got to it. I watched one episode. I was like, oh, it's more Daredevil and walked away. It's just, I've been busy. I mean, Mila, Chloe is very, is a very sex appeal driven character. So this is a shout out to Emily. Oh, that does look like, yeah. Okay. But she's like, you know, she's in that weird spot right now. That sounded wrong. That's not what I meant. You want Emily? I can be into that. Yes. I can. I'm into that. Yeah. I don't know, man. She might be like that choice. You think so? I don't think so. Emily. Yeah. Again, we need to get, Hey, I'm into it. Okay. All right. I'll put it down on the",
            "start": 1756.24
        },
        {
            "text": "I'm into that. Yeah. I don't know, man. She might be like that choice. You think so? I don't think so. Emily. Yeah. Again, we need to get, Hey, I'm into it. Okay. All right. I'll put it down on the list. Nick's still trying to figure out this daredevil. I don't know what her name is. It's also just fun to watch Nick. Try to use a computer. It's like watching Kevin try to do anything. It's the same way we all are. I feel like whenever somebody is watching over your shoulder and you have to do something on the car, I'm quite efficient on Google. Quite efficient. It was quite efficient. There she is right there. Uh, Elodie young, Elodie young, man, and Emily Radovski all fighting for this one role. She looks a lot like Chloe. I'm like, that's kind of on the nose. All right, fine. Do it. Sorry, Emily. Back on the line. Maybe you can gender Ben B cutter. I was putting her out there. Oh, that's really big. All right. All right. Now we got Sam. Yeah. We got young Drake. I feel like now",
            "start": 1803.36
        },
        {
            "text": "Sorry, Emily. Back on the line. Maybe you can gender Ben B cutter. I was putting her out there. Oh, that's really big. All right. All right. Now we got Sam. Yeah. We got young Drake. I feel like now maybe, uh, you said young Drake, young Drake. Would it be two on this? We actually cast Drake as Drake. I mean, I'm into it. Yeah. Yeah. Okay. We need one more backup. Well, I guess that works. Uh, who was Sam? It's Drake's brother. Oh, so we're bringing him in. Yeah. Yeah. He's a big part of the chart. We got to figure out who Drake is before we figure out the chemistry between. I agree with that. I agree with that. I agree with that. So I'm going to throw out my main, the person I always throw on this Ryan Gosling. He's the star of our metal gear movie. People are going to think he's just coming off hot off the fucking success that was metal gear. Come on, bro. Let's get him in another one. He could be the guy that brings back all that revitalizes the video game movie industry. He could",
            "start": 1855.28
        },
        {
            "text": "off hot off the fucking success that was metal gear. Come on, bro. Let's get him in another one. He could be the guy that brings back all that revitalizes the video game movie industry. He could be that guy. And by revitalize, I mean actually creates that industry because we haven't had that yet. Okay. And you're saying this has to be a huge movie star. You're saying the biggest star of the thing. I mean, this needs to be a Chris Pratt, Ryan Gosling, man. I think he has the action too much to use. I love Chris Pratt. I'm sorry if you're watching Chris, I think he'd be good. He has the, the shops. He has the action and the comedy combined, but is he rugged enough? I think he can be, you know, this guy, he could be the man that we deserve. He could be the Drake that we need, you know, just imagine him with a scarf on. Oh, I am. And it's good. He could do it. Oh, here's what I'll float. Just floating it. Oscar Isaac. Yeah. Poe Dameron. Ooh. Ex Machina. He's got the humor down. I feel",
            "start": 1914.4
        },
        {
            "text": "imagine him with a scarf on. Oh, I am. And it's good. He could do it. Oh, here's what I'll float. Just floating it. Oscar Isaac. Yeah. Poe Dameron. Ooh. Ex Machina. He's got the humor down. I feel like we could get him on one of the Marvel diets, not to get buffed. I guess he's already, he already is Poe Dameron. He's pretty good. I mean, he's got to be every man's half tucalypse. Yeah, no, I like this, but he's, he's in a lot of stuff. But he's good. That's a solid call. Thank you. I'm glad I'm here for you. So you guys are vetoing Ryan Gosling is what I'm hearing. Yeah, no Ryan Gosling. We've had enough of the Gos. Gos is in our other major motion picture. All right. All right. Fine. I mean, I have a good personal, I have an actual special relationship with Ryan Gosling. I'll explain to him that you guys don't want to. Do we want to consider Bradley Cooper? Too old? I think he's a bit too old. Too old. Okay. But we need a Sam. Ooh. And I think Bradley Cooper is the good guy. Ooh,",
            "start": 1956.56
        },
        {
            "text": "to him that you guys don't want to. Do we want to consider Bradley Cooper? Too old? I think he's a bit too old. Too old. Okay. But we need a Sam. Ooh. And I think Bradley Cooper is the good guy. Ooh, that got good. Yeah. Okay. I like that. I like that. Sorry. I like that. Bradley Cooper is Chris Pratt's older brother. Why are you trying to get the Pratt in this so much? That's fucking awesome. Oh, that is a good one. That was a good play. That was a really good play. Yeah. Yeah. I liked it a lot. Shit. We got a fucking hit movie on our hands. We do. We got to get in the horn to make this thing happen. Oh man. I'm liking this. All right. Go back to the cast. All right. It's the cast. We still need, we need our definitive Drake. I like Chris Pratt, but the problem with Chris Pratt is he's going to say no, he's not going to let it do it because he's going to, he already has guardians and he's already got Jurassic world, which I'm sure he'll do another one of those. Jurassic universe.",
            "start": 2001.28
        },
        {
            "text": "going to say no, he's not going to let it do it because he's going to, he already has guardians and he's already got Jurassic world, which I'm sure he'll do another one of those. Jurassic universe. Jurassic galaxy. Dinosaurs on Mars. That's crazy. You can't do that. Yes we can. We gene spliced him. Now the heat rocks for air. But no one can visit them. All right. Okay. Give me one more. We need one more person for Drake. Oh Jesus. Top 100 male actors in no particular order. Thanks IMDb. That'll help me. We're not putting Leo in it. Don't think about it. I know you're thinking about the dad from modern family. Which one? He's cool. He's too old. He would also be Ty Burrell. Ty Burrell could also be another Steve Buscemi. I'm saying like, I keep looking at the random ass people. You know who I just saw that I love? He's in Frankie and grace and he could make a really good Sully too. Frankie Menes? No, no. Yeah. I know. Yeah. The Netflix show. Yeah. No. Um, I'm sorry. I'm going back to",
            "start": 2052.96
        },
        {
            "text": "I just saw that I love? He's in Frankie and grace and he could make a really good Sully too. Frankie Menes? No, no. Yeah. I know. Yeah. The Netflix show. Yeah. No. Um, I'm sorry. I'm going back to Sully right now. Is uh, the fourth coast. Martin Sheen. No. Oh, Ernie Hudson. Ernie Hudson. I love Ernie Hudson. Ernie Hudson's great. Yeah. Steve Harvey is a way better comedic time. Sully. He'll say something funny. He'll have a cool plane. I like getting too intimidating. Young. Hold on. Young. Actors. What? Let's still, here we go. Do you like the second season or grand key for young Drake? How do we fill out the kid that played Spider-Man? Tom Hiddleston. No. The new Spider-Man. How young is young? I mean, young Drake is young. I mean, I guess there's multiple. He's like probably like 14. So he cast an 18 year old or maybe 12 to 14 year old. We cast a 34 year old as a 12 year old. Hollywood. Yeah. Hold on. I got the perfect one. Let me get a name for you though. Jesus. Greg. Y'all at",
            "start": 2096.88
        },
        {
            "text": "So he cast an 18 year old or maybe 12 to 14 year old. We cast a 34 year old as a 12 year old. Hollywood. Yeah. Hold on. I got the perfect one. Let me get a name for you though. Jesus. Greg. Y'all at me. It might skew a bit too young, but keep in mind, move time has passed since then. Jacob Tremblay from Room. Oh, okay. Yeah. Like that kid. Cause if we just play it a little bit, that he is, you know, I mean, it's all up to us. We're using the uncharted two young Drake or uncharted three young Drake moment. So we have it out there. He's just a little bit younger. He also showed some acrobatics in Room. So we know he's got it in there. Can we get the kids from the sixth sense? No, no. He's a 34 year old man. I feel like it'd be great. He's too busy starring in everything. Kevin Smith. No, I've seen him. He's in the entourage. He could not happen. What else do we, yes. Double. Uh, Jacob Tremblay I think is fantastic. I think we're good. I would like to slam one more person on our list to",
            "start": 2163.92
        },
        {
            "text": "seen him. He's in the entourage. He could not happen. What else do we, yes. Double. Uh, Jacob Tremblay I think is fantastic. I think we're good. I would like to slam one more person on our list to go through for Drake and then one more person for Chloe. But everyone else, I think we've got pretty much knocked in. And we said, we just have to figure out, is this an origin story? How does this work? Are we doing the trilogy of the games? Well, like we said, we're doing, I don't think we want to be presumptuous. Oh, I mean, that's how we're green-lined until we have to cancel it. We're committing this all the way until we have to completely back out and cancel it. It's Hollywood. We're going to commit $900 million or we'll give you $100 million if it tanks. And then we won't do the second and third one Hollywood. We'll film all at the same time. But you're set on this, the Drake has to be a movie star, correct? It can't be an unknown for that role. It could be an unknown because we",
            "start": 2211.68
        },
        {
            "text": "and third one Hollywood. We'll film all at the same time. But you're set on this, the Drake has to be a movie star, correct? It can't be an unknown for that role. It could be an unknown because we always talk about it. The guy in until Dawn who played the boyfriend who, you know, his whole thing where he was running, he was doing a, a uncharted, uh, uh, audition. We always joked around about it. Right. Anybody remember his name? No, you can find him. I know who you're talking about. He looks exactly like the character, but I don't think he's got the star power. Well, that's what I just, that's literally how I walked into this conversation. You might be too young to just don't think he has a star power. Sorry, Greg. Brett Dalton, Brett Dalton. Never heard of him. Yeah. Peter storm air. Peter storm air was the Russian guy. We all, we all know. Oh, that guy's perfect. Look, shave his head. He's in for what? Lazarevitch dude. See where he's our. We got a bull came up then. I was all I'm",
            "start": 2250.8
        },
        {
            "text": "storm air was the Russian guy. We all, we all know. Oh, that guy's perfect. Look, shave his head. He's in for what? Lazarevitch dude. See where he's our. We got a bull came up then. I was all I'm saying about it. Lazarevitch is Jack and he's like six, six. All right. He really says what he looks like. Body armor shotgun. Big arms, big Dick. Robbing cock. I mean, Colin, I know exactly why not. Kevin. It's a great word. Let's, let's wrap it up. Let's get some wrapping this up. So going down the line. Yeah. I'm going to go lowest to highest for Wraith. Yeah. Justin Timberlake. Number one choice. Second choice. Jake Dylan Hall. For Lazarevitch the rock. Number one choice. Second choice. Vin diesel. Third choice. If we can get him Bruce Willis, I know he's going to be cancer on the set. He's toxic. I don't want to just the rock and Vinny D it's fine. Now can we put Mark Wahlberg in anywhere? Cause I just like Mark Wahlberg. Wasn't he attached to the, he was supposed to be drunk at one",
            "start": 2297.44
        },
        {
            "text": "toxic. I don't want to just the rock and Vinny D it's fine. Now can we put Mark Wahlberg in anywhere? Cause I just like Mark Wahlberg. Wasn't he attached to the, he was supposed to be drunk at one point. That was when David O'Russell, I think was, was going to direct it. And I think he backed out. I don't think it's doing it. Did the assassin's creed trailer drop today? It was this week. Oh, this week. Okay. For Marlowe. We have Selma Hayek, Helen Miriam or Holly Hunter. All very strong choices for young Drake. Jacob. Young Drake's favorite. I could just, all I can do is hear him saying that in the Bunby intro on the trilogy out in 2010 when they introduced him for the first time. That's all he says on the Albre Drake grant, man. Get him in for Sam. We have Bradley Cooper done for cutter. We have Jason Statham. Yeah. I like that. Yeah. Okay. For Chloe, we have Mila Kunis or eat a loadie young. I like Mila, but I'll take your word. If you want to put a loadie in there, she's got the",
            "start": 2350.16
        },
        {
            "text": "We have Jason Statham. Yeah. I like that. Yeah. Okay. For Chloe, we have Mila Kunis or eat a loadie young. I like Mila, but I'll take your word. If you want to put a loadie in there, she's got the look, depending on how big the character is. We'll see, but I'll ID like Mila. Okay. For Sully, Steve Harvey. Oh yeah. We nailed it on that. I'm not even going to get out of the fucking park. That even going to, I'm not even going to lie about that. I'm dying. That's a fucking good list of women to go to for Elena. Top of the list. Scarjo top of your list. Top of my list. Top of Tim's list is Kristen Bell. I think we can all agree. Olivia while would be amazing for it. I put Elizabeth Olsen on there because she's doing great work and I put, and we bought, we all put Mary Elizabeth Winstead on there because she's also doing great work. True. All of them make very strong characters for Drake. We have Chris Pratt who I feel like we just pick as the main actor for the lead for every, every time",
            "start": 2394.64
        },
        {
            "text": "because she's also doing great work. True. All of them make very strong characters for Drake. We have Chris Pratt who I feel like we just pick as the main actor for the lead for every, every time we do this Oscar Isaac and I'm putting rising, rising, going gossing back on a goddamn list. You guys can't stop me. It's my computer. This is one day when this movie gets made, they're going to leak this and be like, what were they thinking? No, dude, this would be an awesome cast. This would be a great movie. If any combination of these actors were in this film with the right director and the right financing, this would be and the right script and the right production crew and the right locations. This would be just the, and the right costumer and the right soundtrack. It'd be fucking amazing. Just a few people. Just a key, few key roles we just need to get down, you know? Yeah. Good couple, good, get one or two or three or four script, right? Rewrites a couple, a couple more writers on it.",
            "start": 2438.16
        },
        {
            "text": "a few people. Just a key, few key roles we just need to get down, you know? Yeah. Good couple, good, get one or two or three or four script, right? Rewrites a couple, a couple more writers on it. It'd be great. Maybe bring back Amy Hennig. Locked in production hell forever. We'll bring Amy in and then we'll bring like eight other writers in. Oh sure. It'd be great. Okay. Yeah. Just that sounds like Hollywood's great. A lot of fun movies right there. We'll get Lawrence Kasdan to rewrite everything and then we'll rewrite him. It'll be good. That topic was brought to you by Gamefly. Are you ready to save money and play more games? Let me introduce you to our sponsor Gamefly. Gamefly is the best way to buy and rent all your favorite games. Just go to Gamefly.com, pick your favorite games from its library of 9,000 and have them mailed directly to your door. Try your favorite games and movies before you buy them. Keep the games as long as you want and cancel any time. Go to Gamefly.com",
            "start": 2475.28
        },
        {
            "text": "from its library of 9,000 and have them mailed directly to your door. Try your favorite games and movies before you buy them. Keep the games as long as you want and cancel any time. Go to Gamefly.com slash Kinda Funny and start your free premium 30 day trial today. The premium trial allows you to check out two games and or movies at a time. You can only get this offer by visiting Gamefly.com slash Kinda Funny. My topic. I'm gonna throw Zoe Saldana on the list for Elena as well just in case. Let me know when I can transition out of this. I have a special relationship with her. Which one is Zoe? She's from Star Trek. She plays Ohura. Oh she's great. No she's great. She's great. And she's gonna be an avatar too I think. Maybe not. She's not blonde enough. You fucks. It doesn't have to be just blonde. It does. That's all that matters. What are you gonna eat? Just part of his shoe? Nah his booger. His eye booger. I want him to eat his eye booger. He gets on the eye boogers. What's the",
            "start": 2508.56
        },
        {
            "text": "just blonde. It does. That's all that matters. What are you gonna eat? Just part of his shoe? Nah his booger. His eye booger. I want him to eat his eye booger. He gets on the eye boogers. What's the problem? What do you do with your eye boogers? I don't have eye boogers. Bullshit. You don't sleep. I don't have ass boogers. Not the same. Not the same. Eye boogers and ass boogers. Similar as far as I understand. My topic. I'm single again. I don't know. I don't know. How do you do this now? I haven't been single in a long time. What did you say? Christine and I broke up. It's kind of a couple weeks ago. Totally mutual. Everything's fine. Don't be mean to her of course. But it's a boring adult breakup like all ours are. We're living two separate lives. But here I am. 33. An 11 year old wiener dog on my own. I have not been out in quite some time. I don't know what life is like anymore. Well my first question to you is do you feel like dating? Not yet. No. You don't have to necessarily",
            "start": 2555.76
        },
        {
            "text": "dog on my own. I have not been out in quite some time. I don't know what life is like anymore. Well my first question to you is do you feel like dating? Not yet. No. You don't have to necessarily worry about this. I think you're a dynamic enough person. You meet enough people that it will probably take care of itself. Now you say that of course. I see the same four guys every day. That was the big thing. Granted if you want to really look at my timeline here of adulthood. I was single very briefly after my marriage failed. But then met Christine. And then we took a year off at one point and I was single there. And that was the first time where I was like holy shit. I'm single and an adult. That's awesome. I have money to do things and I can do whatever I want. And then I was with Christine again. And here I am though. But I'm back out. This is like my only second and a half time. Right. That counts. Yeah. Of being single. I don't know what to expect. Tim do I have to start using",
            "start": 2598.8
        },
        {
            "text": "again. And here I am though. But I'm back out. This is like my only second and a half time. Right. That counts. Yeah. Of being single. I don't know what to expect. Tim do I have to start using Tinder eventually? Because it seems like that happens all the time. I wasn't prepared for this topic. I would have definitely created a step by step process of all of this. To be honest it's a lot simpler than you're making it sound. You don't really need to do anything. Things will just happen. The moment you start trying to make things happen that's when nothing happens at all. You just need to let it shower over you and shower at will. The rains of the gods are about to descend upon you Greg. And I just want you to make sure that you're letting it in. I just want to make sure that you're not pushing things away. Now what this means is you just need to not cause issues. Did you just take off your socks? Yeah I did. I'm getting real cozy for this one. I was trying to wait for a break. A very",
            "start": 2641.6
        },
        {
            "text": "things away. Now what this means is you just need to not cause issues. Did you just take off your socks? Yeah I did. I'm getting real cozy for this one. I was trying to wait for a break. A very nice break in what you were saying to eyeball Colin and ask him if he knew what the rains of the gods but what he thought they might smell like. What do you think that smells like Colin? So what they smell like to let you know is all I'm telling you Greg there's a key hint and tip that I need to let you know here and that is you do not need to say anything to say a lot. And I mean this we've talked so many times about naked pictures right? I feel like naked pictures are a very key part of life in 2016 for modern people with modern day phones and shit. I'm sorry Colin one day you'll join us. Do I have a phone? I know but it's like two inches big like that's nothing. I'm not trying to compensate you. So here's the thing Snapchat you gotta get on Snapchat. I'm not getting on Snapchat. Come on. Why",
            "start": 2689.52
        },
        {
            "text": "a phone? I know but it's like two inches big like that's nothing. I'm not trying to compensate you. So here's the thing Snapchat you gotta get on Snapchat. I'm not getting on Snapchat. Come on. Why not? Because I'm already on Instagram. I know. Okay Instagram's good though. You want to know my big concerns. Do I have to in order right? Do I have to try to learn Tinder? Do I have to start using Facebook? Am I going to die alone? Like those are like trust me. The answer is Snapchat is not even doing it wrong. The answer to those is no. The answer to Snapchat is yes. The answer to Instagram direct messages you need to make sure that them shits is turned on. Make sure it's still private so you're not notified for every single time someone messages you. But you need it open. The avenues need to be open. That's what I'm saying. It's not that you're saying yes to everything. It's that you're not saying no to everything. And that's the key. I have never responded to a single solitary naked",
            "start": 2735.6
        },
        {
            "text": "to be open. That's what I'm saying. It's not that you're saying yes to everything. It's that you're not saying no to everything. And that's the key. I have never responded to a single solitary naked picture that was unsolicitedly sent to me. Is that a word unsolicitedly? Yeah I think so. Unsolicited. But I mean hey I'm getting stuff. This is what the fuck just snapshatted to I don't know. Do I know her? No I don't. This is this is Snapchat to me. Well what do I tell in the little icon? Oh yeah for those of you who screenshot the shit out of this. Yes I do. Do I have any shame? No and that's what I'm saying. If this shit's unsolicited. I'm a neck down. I didn't ask for it. That's what that means. Great. Well then so I'm going to say Snapchat in screenshot. Now this whole thing happening right? Yeah. Does this help you with dating? No. Yeah. But this is just proof of how easy it is. Things just happen. This is just thrown at you. And it's up to you to say yes or no. It's your choice",
            "start": 2778.32
        },
        {
            "text": "right? Yeah. Does this help you with dating? No. Yeah. But this is just proof of how easy it is. Things just happen. This is just thrown at you. And it's up to you to say yes or no. It's your choice Greg. It's your decision. The reigns of the gods descending upon you. Am I going to die alone? No. No you're not going to die alone. I'm old I'm 33 now. I'm here at the very least. Oh my god. You want to talk about it even now how much more devastated I'm going to be when this dog dies. Like that's oh my god. I've talked to someone about that recently actually about like the real talk about Greg when Portillo passes away. Was it before or after the breakup? Not going to be a good scene. I talked about it. I didn't even talk about it in the context of the breakup because obviously that's going to be way more devastating than breaking up with a girl for you. I'm sorry. So that's like no that's like the pen that's the ultimate maybe penultimate would be breaking up with someone you love but",
            "start": 2822.4
        },
        {
            "text": "to be way more devastating than breaking up with a girl for you. I'm sorry. So that's like no that's like the pen that's the ultimate maybe penultimate would be breaking up with someone you love but the ultimate heartbreak would be that dog dying. Sure but I mean now. I don't know like when I came home I'm starting to cry right now thinking about it on top of it. Well I mean I'm upset because the topic in general but I mean like oh my god. Like do I guess guys we're gonna have to do I get over with no no I don't. I want to go first. The real hope is that I go first. You bury Porty with me alive. Oh my god. Wow. He'll be happy. He'll be fine. Let me ask you this question Greg if you had your choices of facing Porty's death or having us Kevin and we hire someone else to help pull the weekend at Bernie's and we just fool you into believing that he's still alive for the rest of your life. Kevin's got like a little marionette thing bouncing his head around all sleeping. Which would you",
            "start": 2870.88
        },
        {
            "text": "at Bernie's and we just fool you into believing that he's still alive for the rest of your life. Kevin's got like a little marionette thing bouncing his head around all sleeping. Which would you prefer? I would I would rather him just be dead. I really think Portello is so stagnant that I think we could probably get away with it not for long but probably for about 12 hours. Oh I think 12 days. Like like like we could probably get away with it. Oh Portello's just sleeping under the covers. No big deal. All we need is we need to set up something and I'm sure Kevin can figure this out that every time the doorbell rings we just get a sound effect going. That would clear up a lot of things. You see I think we go the full Monty and we just get a beach house we have a party and people just keep passing him around so every time Greg catches a glimpse of him he's like in someone else's hands. He's like oh Porty's having a great time. He's enjoying his life. Alright so basically the best way to",
            "start": 2914.88
        },
        {
            "text": "him around so every time Greg catches a glimpse of him he's like in someone else's hands. He's like oh Porty's having a great time. He's enjoying his life. Alright so basically the best way to usher him out if it's already happened. Yeah. Back to the topic at hand. I guess. Greg's not gonna die alone. Greg's gonna be fine. I've not been more confident in anything that Greg's gonna be fine. I think this is good. I think this is gonna be good for you. I think this is gonna be great. And I think that you can't overthink it. I don't think you need to get on Tinder. That's you're 33 years old. I don't think you need to do that. I think that you need to focus on you know yourself and then I do agree with Tim that these things tend to happen when they're meaningful when you don't expect them. Sure I know and that's the whole thing is like my mindset right now as great as Tim's is it's not about getting laid getting in another relationship yada yada yada. It's just like I don't know it's",
            "start": 2950.88
        },
        {
            "text": "Sure I know and that's the whole thing is like my mindset right now as great as Tim's is it's not about getting laid getting in another relationship yada yada yada. It's just like I don't know it's still kind of funny which is the thing you know it's still the business of kind of funny. Sure. You know what I mean like that's still where we were before and one of the reasons like why it was time for us to do this because she's in LA with a great career and I'm in San Francisco with a great career so what happens next like if there's no timetable for it we're not gonna sit here and resent each other one day. Yeah jokes aside for all the things I'm saying and again to really boil down what I'm saying it's just shit it just happens you know what I mean. I know I know I know. I'm not like none of this is gonna turn into a relationship and I'm also I'm in a very committed relationship I'm fine. Yeah. But like before that like there was a brief period where I was single and like I didn't",
            "start": 2983.92
        },
        {
            "text": "of this is gonna turn into a relationship and I'm also I'm in a very committed relationship I'm fine. Yeah. But like before that like there was a brief period where I was single and like I didn't really take advantage of it necessarily in the way that like you think about. You just went to 50 shades of gray. Yeah well that yeah but exactly I didn't fucking expect that shit to happen it just fucking happened. Yeah you know and here I am and things are great but it's like I think that you you are like you say you're just around us all the time that's I think a good thing. I think that it is. I was gonna apologize about it. It is just the random times when it is something that's just fresh and like you you saying you're 33 it's like that's perfect because you're the person that you meet. Love and sex stuff right here. All we ever talk about is fucking communication and all this shit it's the same shit over and over. Yeah. That shit's so real. But motherfuckers like don't listen to that",
            "start": 3016.0
        },
        {
            "text": "and sex stuff right here. All we ever talk about is fucking communication and all this shit it's the same shit over and over. Yeah. That shit's so real. But motherfuckers like don't listen to that shit but that's really what it's about and really that comes you can't really communicate with somebody unless you know who you are and I think that's the key thing is it's just when you're 33 hopefully by then you know who you are and if you meet someone else they hopefully know who they are and that's what helped me so much is I met somebody that knows who the fuck she is and I know who the fuck I am and we like each other. So that's just like all right cool we're good whereas it's like it's not the your high school years college years or whatever where it's like trying to figure shit out and you're learning through your experiences to create who you are then it's just more about enhancing who you want to be and I think that's the the key part that you have to look forward to eventually",
            "start": 3054.24
        },
        {
            "text": "you're learning through your experiences to create who you are then it's just more about enhancing who you want to be and I think that's the the key part that you have to look forward to eventually who the fuck knows when but it doesn't matter because you're doing you and you're fucking cool so keep being cool great. Yeah I would say to back that up like you don't need to put that pressure on yourself right now you're fresh out of the relationship again that's yeah not where I'm at. No I know I just you will you're a dynamic person you're in enough dynamic settings and you meet enough people through the nature of what we do that you will eventually find someone who compliments you. Yeah. I'm not worried about that at all not at all. Oh yeah there's not I don't think there's anything to worry about for you at all I've never been more confident anything that you'll be fine. No I know. The the the thing that I want for you I think what's important in your life is balance you need to find",
            "start": 3088.8
        },
        {
            "text": "about for you at all I've never been more confident anything that you'll be fine. No I know. The the the thing that I want for you I think what's important in your life is balance you need to find balance and what I hope is that you it's going to happen randomly you're gonna be out at a restaurant or a bar one day you're gonna be out with friends you're gonna meet someone I want someone outside of all of this for you every all of this that's like what I want. Outside of the room. Outside of the room specifically hopefully sorry sorry Kevin you're out but outside of like of gaming youtube and gaming and all this stuff like I want you I want you to find someone that like brings you this amazing balance in your life that gets you out of this place that gets you out of that work mentality that gets you out of gaming that gets you out of all those kinds of things I think that's going to make you happy I think you're going to find that's my prediction is that that's what's going to happen",
            "start": 3126.56
        },
        {
            "text": "gets you out of gaming that gets you out of all those kinds of things I think that's going to make you happy I think you're going to find that's my prediction is that that's what's going to happen and that you are going to find that this particular matchup whatever it might be fits with you quite well because you're going to be you she's going to be her and then you guys will kind of meet somewhere in the middle and you'll add you know there'll be additive kind of things in both of each other's lives and I think that's going to be really key for you. I think it's gonna be the exact opposite I think it's going to be something that is totally in the exact exact same world predictions yeah and I think that it's play this it's not the weird snapchat naked thing he did but play this part future Greg at your wedding yeah no this this is this is the thing you know what I'm gonna say next knowing knowing you I think that you you thrive off the balance of doing you being you being Greg Miller",
            "start": 3162.72
        },
        {
            "text": "Greg at your wedding yeah no this this is this is the thing you know what I'm gonna say next knowing knowing you I think that you you thrive off the balance of doing you being you being Greg Miller all the fucking time and I think that having somebody that entirely supports that and compliments I think compliments is the the biggest thing there it's not just about supporting but it's about like really complementing getting you where you want to be and supporting you doing you because you are such a fucking thing yeah you know what I mean you're so defined of what it is that you enjoy doing and I think that it's the insider perspective what about you Nick I mean I can go either way honestly um as long as like predictions Jesus Christ no don't play this is the wedding feature Greg no honestly um you know I mean that's the thing the nature of the beast is that you're gonna you're gonna be attracted to someone that's got some understanding of who you are most likely right because it's I",
            "start": 3197.6
        },
        {
            "text": "um you know I mean that's the thing the nature of the beast is that you're gonna you're gonna be attracted to someone that's got some understanding of who you are most likely right because it's I think that's just kind of the nature of who you are that's the nature of who we all are um you know if you look at I guess it doesn't necessarily have to be that way but I feel like you're I see you with someone who has an understanding of the industry um maybe even works in the industry but doesn't necessarily work on our side of things um it's like Shuhei if you did Shuhei that'd be amazing but I would move to Japan with you yeah of course they're kind of funny Japan how about we just do it we could just do it and just show up on Shuhei's door yeah fuck that'd be amazing uh maybe he's got a daughter um that fulfills both of our requirements just stop right there okay just stop I know too much about Shuhei's family just stop um no I don't know I mean that's the thing too that that's the",
            "start": 3243.52
        },
        {
            "text": "daughter um that fulfills both of our requirements just stop right there okay just stop I know too much about Shuhei's family just stop um no I don't know I mean that's the thing too that that's the exciting part is that you have all opportunity ahead of you right you've got you can just choose to interact or not interact you can meet people you can see what's out there and then there's a lot out there for you there's a lot of great people out there it's weird I mean to think about it like just because I still feel like such a kid and so stupid right but to be 33 and single and not that it's a bad thing but just like I always talk about you know like when people are always like I forgot you were married and it's like well yeah but I was in the middle of the country and that's what you do you know oh we graduated college we get married eventually some fucking kids come out you get you ruin your life and you get everything but like like that was the thing is like I can't remember and I",
            "start": 3283.6
        },
        {
            "text": "you know oh we graduated college we get married eventually some fucking kids come out you get you ruin your life and you get everything but like like that was the thing is like I can't remember and I know they existed but I mean like you know growing up or whatever like my parents friends were all married granted this is like this isn't a scientific survey of any you know matter but the even better way to think about it right is like at this point right in my mother's life I'm three years old like you know like that that's weird that's always weird right like yeah my mom had me when she was 30 years yeah exactly so that's like that's crazy to think about how granted this is also like my fucking grandfather stormed the beaches of Normandy and I fucking sit in this room and talk like it's not like apples to apples anymore but it is the world evolving and changing but then being a part of it where it's like I don't think that I'm old but I am old and like I'm not married and I'm you know",
            "start": 3318.96
        },
        {
            "text": "like apples to apples anymore but it is the world evolving and changing but then being a part of it where it's like I don't think that I'm old but I am old and like I'm not married and I'm you know I've never I don't want kids and I'm probably never gonna have kids and that's well I mean it's a shitty thing to say also though because but you're a guy and you have a lot you know as you age you have more options I'm definitely getting better looking you are I like the silver my hair and I also like that I left this this little five o'clock exactly it's five o'clock shadow thing I left on today and that and that's the shitty thing to say is that like you know for it it gets harder for women as you get older but for you you you could date you have a broad range of ages you can date and if you know you've got a lot how low can I go Nick you can go to don't answer that question 18 years old but I wouldn't recommend it they're hard to talk to you honestly there's something there where I do",
            "start": 3355.12
        },
        {
            "text": "know you've got a lot how low can I go Nick you can go to don't answer that question 18 years old but I wouldn't recommend it they're hard to talk to you honestly there's something there where I do remember 9 11. I feel I feel like there's a lot to be said about the different phases of someone's life and being able to look at the people you were with at those times yeah and I think that kind of funny is a obvious next step for you oh sure and I think that I mean it has been but I think that you're a different person than you were working at IGN you know and I think that it's it's really kind of easy to fit into these things where it's like all right here's my high school relationship here's my college relationship here's my IGN relationship now and then there is a kind of funny relationship and what that means you know I can even look at my relationships time wise and it really does kind of add up where I'm like cool I learned a lot as I was learning a lot yeah and hopefully and I",
            "start": 3390.72
        },
        {
            "text": "and what that means you know I can even look at my relationships time wise and it really does kind of add up where I'm like cool I learned a lot as I was learning a lot yeah and hopefully and I assume this is the lot this is the end this is my last big career move you know I mean this is forever so it's like cool I want to find a girl that it's forever with and that kind of just aligns so I don't know I don't know I'm pulling for you because I feel like obviously I'm pulling for you but I'm pulling for you in the sense that that I hope I really want I want it to be whoever makes you happy whatever whatever person might be in whatever in whatever field I hope Tim is wrong like I really like in the sense of like I want to see you with someone random like I want to see what that Greg is like you know because I feel like you are you more than the nice of us are us like you live and breathe like it's it feeds in the ego thing I don't mean it so maybe you live and breathe like yourself you",
            "start": 3436.24
        },
        {
            "text": "you know because I feel like you are you more than the nice of us are us like you live and breathe like it's it feeds in the ego thing I don't mean it so maybe you live and breathe like yourself you made up the ego thing don't act like it's real we're trying to be nice well the ego thing is real I mean we can all see it we can't we can't see it but we can certainly feel it but uh smell it but I'm interested to see I'm interested to see I've known you for a long time I've known you for a very long time and I've lived with you for a long time we work together for a long time I know you very intimately not in a dirty way but I know I know you he's I'm gonna say I probably know you better than pretty much anyone and I am interested in the dynamic of Greg Miller when Greg Miller doesn't exist in this world all the time anymore and like I think that's going to be good for you I really do I really just do because you do have other interests you do have other things that you like you do have",
            "start": 3474.4
        },
        {
            "text": "in this world all the time anymore and like I think that's going to be good for you I really do I really just do because you do have other interests you do have other things that you like you do have other things that have nothing to do with nerd culture that you can that you can explore and like what is it like when when Greg like does other things and then comes back to do these things will he be better will he be happier will he be like you know we all often talk about how you really just don't burn out at all but I would love to see you have like an escape hatch you know and then be able to come back fresh and stuff like that so I think it's more likely than not that what Tim says is true because of the circles that we run in but I also think that it's it's my hope is that you know you're happy regardless but my hope is that you just date some school teacher or something like that and like and like you just see what that's like you know like you just don't she has her own friends",
            "start": 3510.88
        },
        {
            "text": "happy regardless but my hope is that you just date some school teacher or something like that and like and like you just see what that's like you know like you just don't she has her own friends yeah you're in you know you're in bed yourself with them a little bit you learn a little bit but from them you don't exist in this world I think that's totally fantastic you know that's sexual and dirty as everyone trying to make everything I say I think that that kind of balance I think is going to be essential for you and I think that's where you find like this long lasting love in this marriage in this in this relationship forever is someone that like that complements you but I find it hard to be complemented by someone who would be all up in my business all the time so that's what I'm saying is like I think that that's going to be really key for you that's my hope for you do you ever find it alarming Colin how in like you know how it's like when a group of girls are together their periods",
            "start": 3549.36
        },
        {
            "text": "like I think that that's going to be really key for you that's my hope for you do you ever find it alarming Colin how in like you know how it's like when a group of girls are together their periods will sync up that like our lives are in this weird sink we're like remember we both broke up with our girlfriends and moved in together then we both got together with those girlfriends while we were together then we both broke up with those girlfriends now now you're ahead of the curve now you've already got a new girlfriend right but it's very bizarre I feel yeah I mean like like you know and I guess that's the thing it was with with with Erin specifically like Erin's brought me a lot of like a lot of like I don't know good feelings in my life in terms of like I just feel like she like it was talking about finding someone that understands you right that's what I'm saying find someone that understands you Erin knows me from so long ago that she really knows me before any of this happened",
            "start": 3589.92
        },
        {
            "text": "talking about finding someone that understands you right that's what I'm saying find someone that understands you Erin knows me from so long ago that she really knows me before any of this happened before any of IGN happened before any of this kind of stuff happened so she knows me like that more embryonic state where it's like Colin at 18 you know as opposed to I don't mean embryonic is like coming out of the womb I mean like embryonic is like where I'm figuring myself out I'm learning who I am and all that kind of stuff I think that's part of our really close connection is that like we just know each other really well from a long time ago and have known each other all these years and grown together and so I feel like that's brought a lot of balance in my life I'm like I gotta get out of here for a little while I gotta go do something else I'm gonna go outside and go to the beach I'm gonna like walk the dog or just like go do something else as opposed because if it was just me and",
            "start": 3625.76
        },
        {
            "text": "of here for a little while I gotta go do something else I'm gonna go outside and go to the beach I'm gonna like walk the dog or just like go do something else as opposed because if it was just me and someone like me then I would just play games all day or I would just like sit in front of the TV or whatever I'm like I gotta get the fuck out of here like and it makes me more like I'll tell you the last and you guys have seen the change since I dated since I started dating Erin that like I'm like kind of like more in it now I'm like I'm more excited I wake up with a little bit more of a pep in my step I know it's hard to tell because I'm calling so I'm still calm but you know I feel like there's like a lot more positivity in my life because I've just found some sort of complementary balance in my life that gets me out of this world that otherwise I would always exist in because it's too hard for me to get out of it you know so yeah so I think that that's there's something to be said",
            "start": 3656.0
        },
        {
            "text": "in my life that gets me out of this world that otherwise I would always exist in because it's too hard for me to get out of it you know so yeah so I think that that's there's something to be said about that I think that's something really positive about that and I think that I I'm I have an additive kind of connection with Erin as well in the same sense where like I'm introducing her more of our kind of stuff and she's getting more into those kinds of things and you know so I think that I I'm interested to see what happens if you just meet Jane Doe that does random job I like the school teacher thing yeah like right like hot just like a hot Asian school teacher right we can all agree this is going to be Asian right why are you projecting everything onto me I gotta live vicariously this is the one downside of it of all the shit can't wait for you get married to all this shit best of all Nick and I gave Tim when he was single like VidCon and shit like every fucking time every single",
            "start": 3693.36
        },
        {
            "text": "is the one downside of it of all the shit can't wait for you get married to all this shit best of all Nick and I gave Tim when he was single like VidCon and shit like every fucking time every single girl every single one some guys too who cares anything that's there is going to be just presented to you on a silver platter we're just gonna have like a virgin of volcano we're gonna try to just throw them into you no mickey no I like that that's a good analogy thank you and also just don't just expect me and Kevin to be in the closet for the first three to four times captain pinky comes out jesus christ nick you know what you call him what do you call him my dick portillo too oh of course barely barely existing this is these are I think we can all agree though these are exciting times these are exciting times and I feel like these are going to turn into bold times great topics as a man who's been married for coming up on four years I thank you I need this I need for one of you to be",
            "start": 3729.12
        },
        {
            "text": "are exciting times and I feel like these are going to turn into bold times great topics as a man who's been married for coming up on four years I thank you I need this I need for one of you to be single again I need it I've never felt so alive as this conversation right now I can literally feel wind just hitting my hair my favorite was there was some conversation we had it was completely in jest but there was some conversation we had a long time ago and it was some hypothetical that if like and maybe Colin one of you weren't in a relationship and then but it was like one of those things like what if we all broke up with our girlfriend like we had that conversation nick was like I would I would divorce my wife but she'd understand she totally was she's like this is too this is like the perfect storm of happiness um on a real note though I will I will mirror Colin sentiment as well because my wife is completely opposite of me but that's great because we find common ground we need to",
            "start": 3779.2
        },
        {
            "text": "perfect storm of happiness um on a real note though I will I will mirror Colin sentiment as well because my wife is completely opposite of me but that's great because we find common ground we need to find common ground yeah and then her sort of opposing views on things or her opposing likes uh really kind of helped broaden my horizons a little bit so like she I know this city more I have way more life experiences because I'm with her sure like I know how to ski I would never have learned how to ski I wouldn't even go out in fucking mountains it's cold up there snow she drags you up there yeah she will she yeah we have family out there and she knows how to ski so it's just things like that where I think is be open to I'm not saying you have to but it's always great because like you know like Tim and Gia have very like uh they have some things they like together but Gia is very different than you she is very different but I think she's small she's very small she's tiny she's very tiny",
            "start": 3822.24
        },
        {
            "text": "Tim and Gia have very like uh they have some things they like together but Gia is very different than you she is very different but I think she's small she's very small she's tiny she's very tiny um but yeah no I think that in the core ways we are very similar in the sense of like what we like to do we like to talk yeah that's all we like to do right but those things those things are fundamental because I would agree with you with with with Erin being totally outside of nerd culture we still I've said in the past like we both love our families we both like have good friends we both like to talk we like to eat good food and drink like those are the kinds of things the core kind of things like you would say like your almost core constituency in terms of like the things that are most important to you but I would say that if I was Colin but I but I I agree in the sense but but I agree in the sense that you know the old adage is true like opposites attract that's not like something that",
            "start": 3864.72
        },
        {
            "text": "to you but I would say that if I was Colin but I but I I agree in the sense but but I agree in the sense that you know the old adage is true like opposites attract that's not like something that someone just made up one day it is true true you know like it is absolutely true and I think it can be true I think that's the thing I think that it's a person by person's basis and I'm just like what I personally think about what I imagine Greg needs isn't necessarily that just to boost his agenda but again I could be wrong but I'm just thinking like I know what I need I know I have an idea of what you need and what we all need just because I know you guys but I just think I feel like Greg doesn't need opposite he needs we'll see more we'll see we will see and also I don't think that it's one or the other I do think that both are good both have like valid things you know what I mean like I'm sure that there's other people out there that I could be with that I would be happy with you know what",
            "start": 3897.36
        },
        {
            "text": "other I do think that both are good both have like valid things you know what I mean like I'm sure that there's other people out there that I could be with that I would be happy with you know what I mean I'm very happy with what I have I can't I'm blown away and I can't imagine anything being better than this having said that though it's like I don't know what if she's a little bit taller that's done what if she was a baller she was a baller then that'll be good yeah you beat me to it yeah it's the idea I think it's just I think I think having a little bit of friction is actually good you just don't want you just don't want too much friction you don't want to go I don't want like I think there's such a thing as too easy too much too much gliding you know like that that makes the people complacent that makes people take each other for granted and do all those kinds of things so I think there's such a thing as too easy and I think there's such a thing as too hard and then I think that",
            "start": 3935.92
        },
        {
            "text": "that makes people take each other for granted and do all those kinds of things so I think there's such a thing as too easy and I think there's such a thing as too hard and then I think that like in the middle is probably exactly where you want to be and that often means that like I do think that like if you want like we were talking about in a previous topic like I need a smart girl like I need someone who's smart that can be you know smart in any different way but you need to have like a like a brain in your head you know that's important but that doesn't mean that you have to have a brain in your head about politics you know or like a brain in your head about whatever it just means like are you smart you know all the conversation are you interested in things so I think like you can kind of interpret these things in different ways and I think Greg will find that he'll find you know the thing is that Greg's gonna be fine like I'm not it's I'm super interested to see like where this",
            "start": 3974.8
        },
        {
            "text": "of interpret these things in different ways and I think Greg will find that he'll find you know the thing is that Greg's gonna be fine like I'm not it's I'm super interested to see like where this where this ends up I think you're gonna be totally fine yeah I think you're gonna be fine quicker probably won't die alone no because I'll probably always live with you and that's five six people before that oh my god I might die alone there's no guarantee that my relationship will work or his relationship any relationships work you can't really look that far ahead you really can only look like the next five ten years ahead you can't really be like where am I gonna be when I'm 80 shitting my pants in my recliner to Nick's point in the words in the words of bad religion here we go all promises become a lie all that's benign corrupts in time I do so so you have to just that is a classic Nick ism so you have to just be prepared for any contingency all options are on the table all options",
            "start": 4006.56
        },
        {
            "text": "become a lie all that's benign corrupts in time I do so so you have to just that is a classic Nick ism so you have to just be prepared for any contingency all options are on the table all options Japanese Chinese open why why why are you doing this to Colin's point Vietnamese Filipino with an f or so anyways I'm single ladies and gentlemen don't make a big deal about it follow him on snapchat I'm sure you want me I'm sure not follow him follow him I need to see the slides at the DMS I only have the one snapchat it's the kind of funny account that I don't know how to use doesn't matter that's why I'm not using all share that Colin it's your topic but first thank you to everybody who supported us in April all you big beautiful kids over on patreon.com slash kind of funny as always your name is now put on the screen you get to enjoy it and see your name there you go there you were thank you for everything this is still good today I can't see from this angle it's still going yeah you only",
            "start": 4040.32
        },
        {
            "text": "is now put on the screen you get to enjoy it and see your name there you go there you were thank you for everything this is still good today I can't see from this angle it's still going yeah you only get to see you just see a line you see a little line yeah yeah and a slightly bigger Peruvian boy well okay so I want to talk we've talked about this topic in the past but now I want to do a gut check moment with everyone okay Donald Trump is the going to be the Republican nominee for president now we talked about this a long time ago we were like I think basically the walkway was probably this won't happen that conventional wisdom was wrong with him right and now he's going to be the guy everyone else dropped out it's him it's going to be him I want to share a few statistics with you about this and then see where you guys all stand I don't know if you think this is going to happen because the reason I wanted to bring this up and I thought this was a thoughtful topic and a topic we can",
            "start": 4089.76
        },
        {
            "text": "this and then see where you guys all stand I don't know if you think this is going to happen because the reason I wanted to bring this up and I thought this was a thoughtful topic and a topic we can all talk about is that we usually when we talk about politics it's a lot of me and you guys kind of responding but political conventional wisdom doesn't work anymore now like it's all bets are off like it doesn't matter everyone was wrong everyone that knows anything was wrong everyone no one predicted that this was going to happen right of any consequence it's hilarious watching all of the media kind of ecro right now oh yeah like why shout out to the people that don't know anything though they're like feeling pretty smug right now so we knew it we liked him apprentice no um okay speaks his mind so before so there's this notion my my my my thesis is this polling shows trump behind by double digits to hillary clinton a head-to-head matchup right and so I can but polling the head-to-head",
            "start": 4134.0
        },
        {
            "text": "mind so before so there's this notion my my my my thesis is this polling shows trump behind by double digits to hillary clinton a head-to-head matchup right and so I can but polling the head-to-head polling this early is useless until the conventions it really doesn't matter but people still look at those as as predictive so what it predicts is that trump will lose almost as bad as goldwater lost to lbj in 1968 which was terrible he got fucking killed right and a lot of people predict that like this is not going to be a race at all that trump is going to lose he's going to lose red states he might win a few he might pick off texas and a few other states but he's going to lose like like he might lose georgia he might lose north carolina like states that do not typically vote um democrat right but then there are statistics that suggest that there's way more to this than meets the eye and I want to share something with you lay it on me with your amazing gold handwriting so 44 states have",
            "start": 4164.96
        },
        {
            "text": "but then there are statistics that suggest that there's way more to this than meets the eye and I want to share something with you lay it on me with your amazing gold handwriting so 44 states have voted there's still six of them left trump had won 28 of them trump so far has won 40 of the vote in a field of 16 people 10.7 million votes cast which will end up when everyone votes be the most votes for a republican nominee ever for context romney got 10.4 million votes when he won the nomination it only lost to obama by four points and mccain got 10.6 million votes in 2008 and lost more like by six six and a half points w holds the record of 10.8 million votes in the primary in 2000 so with california still to vote and california has the most republican voters of any state believe it or not because there's so many people here trump is probably going to reach more like 12 12 and a half million votes which makes him the most popular amongst republicans nominee of all time right so there's",
            "start": 4206.72
        },
        {
            "text": "because there's so many people here trump is probably going to reach more like 12 12 and a half million votes which makes him the most popular amongst republicans nominee of all time right so there's that one statistic and then i was reading washington post has been publishing a lot of interesting things about donald trump that i thought were interesting and there's a lot of think pieces about why he's going to get killed but there are think pieces about why he might not get killed um and there someone came across uh this it was on i was on morning joe and i and i so here's a little piece of of uh what i think is fact for you guys let me know what you think of this and this is by i think chris isola wrote this right yes chrysalis it says the prevailing wisdom and political circus circles following donald trump's emergence as the presumptive republican presidential nominee is he has very little chance of beating hillary clinton in the fall election that she and her team of experience",
            "start": 4251.84
        },
        {
            "text": "following donald trump's emergence as the presumptive republican presidential nominee is he has very little chance of beating hillary clinton in the fall election that she and her team of experience operatives will carve trump up like at thanksgiving turkey using his many controversial remarks to build a case that he is fundamentally unfit for the office he is seeking that her political experience will turn him into a blabbering a blubbering fool both on the campaign trail and the debate stage might happen could happen but clinton would do well to study the 16 republican candidates who held that same belief and watched as trump systematically destroyed them on his march to the nomination if we learn anything about trump during this campaign it's this he's very very difficult to run against so there's that one i think truth about it that all the conventionalism was wrong about the republicans and he destroyed he destroyed those people it wasn't like he beat bush and then bush is gonna",
            "start": 4291.28
        },
        {
            "text": "so there's that one i think truth about it that all the conventionalism was wrong about the republicans and he destroyed he destroyed those people it wasn't like he beat bush and then bush is gonna like you know kind of come up and support him like he embarrassed jeb bush he embarrassed ted cruz he embarrassed marco rubio he embarrassed all of them yeah all these people with money on a level where they might not run ever again right like like some people like rubio are finished yeah um and then there was this more interesting piece that came out i think just today and it says democrats don't celebrate trump's nomination fear it and this is the and this is by fred hiet and here here he gets into statistics i think you guys will be very interested in and i'm going to throw it to you guys see what you think says i know the polls say donald trump cannot win but what if you're looking at the wrong poll question what if trump's overwhelming negatives don't matter or to put it another way",
            "start": 4328.72
        },
        {
            "text": "see what you think says i know the polls say donald trump cannot win but what if you're looking at the wrong poll question what if trump's overwhelming negatives don't matter or to put it another way what if the country's negatives matter more right now about six and ten americans have an unfavorable view of trump and only 36 of them view him positively but the country is faring even worse in the most recent average of polls calculated by real clear politics 26.9 of americans think the nation is headed in the wrong right direction and 64.9 think we're headed down the wrong track so what if even voters who respect hillary clinton's competence reject her as the embodiment of business as usual and what if even voters who do not like trump's bigotry or bluster care more than he will in their view shake things up so there's that that little piece as well right so how are you how you guys guts feel right now i mean i think he's gonna win you do i think he's gonna win the whole thing oh wow",
            "start": 4365.76
        },
        {
            "text": "view shake things up so there's that that little piece as well right so how are you how you guys guts feel right now i mean i think he's gonna win you do i think he's gonna win the whole thing oh wow by a landslide i don't know if it's gonna be a lance i don't know i don't know enough about the actual uh politics behind it to to to think on those terms but i think that if he's shown you anything is that people don't want that as quote they don't want the traditional politic they don't want um hillary clinton even if she starts spouting out facts i don't think they're going to believe her or or actually take her seriously because i feel like trump just comes off as truthful he comes off as one of us sitting here saying absurd shit that actually comes off as not status quo and i think that's very very powerful this is the first this is the first real time in my life that i can remember thinking this guy is really actually shaking things up and you hear all these political platforms",
            "start": 4402.32
        },
        {
            "text": "very very powerful this is the first this is the first real time in my life that i can remember thinking this guy is really actually shaking things up and you hear all these political platforms people like we're gonna make america great again we're gonna shake things up we're gonna go to washington and and do all those things i don't think he'll be able to accomplish anything once he gets in but he is he's got such a fervored following based on that based on the fact that he is the guy that is real that i think he could take it all the way that's my that's my opinion i'm i don't want him to i'm terrified of it we don't have a third alternative choice that's even better get off the bench mitt romney if you haven't already by the time this post uh no that's the whole thing that's weird about it is i think the one thing in we're talking about echo chambers last game over geisha two years ago right i think in the political echo chamber the one thing that's being missed when they talk",
            "start": 4442.16
        },
        {
            "text": "about it is i think the one thing in we're talking about echo chambers last game over geisha two years ago right i think in the political echo chamber the one thing that's being missed when they talk about this and that trump has a chance and all this stuff is i really feel the hillary clinton campaign posters should be her and the uncle sam pose saying i i want you i need you because that's how i feel it when i get to the bow box it totally is i'm like neither of you inspire confidence but i can't vote for trump i can't the things he said on this the what he's done the way he talks like it's funny and it's entertaining and i it's i this is very much the opposite of you remember that uh whatever beyond 300 or 200 where like the question was like do you think uh romney's gonna win or will obama get reelected like haha not a chance and i was like i will bet you any day the week he was of course he is i can see i can see the reality where trump gets elected but i feel like i don't this",
            "start": 4476.56
        },
        {
            "text": "obama get reelected like haha not a chance and i was like i will bet you any day the week he was of course he is i can see i can see the reality where trump gets elected but i feel like i don't this one's like one of those big shake the eight ball you look at it's like too cloudy you can't tell it's could go either way but i really do feel there's going to be enough people that it's like all right it's voting day it's like all right get up off the bench and it's like yeah the status quo is not great i agree that i've said forever i hate these career politicians i wish people would come in and i just wish there was somebody like i i guess i wish that bernie had gotten it bernie would be the super interesting nominee right of like i say whatever the fuck i want to but i'm not saying these things that are offending all these minorities and doing all this different stuff and making everybody look everybody from the outside the country looking to go are they fucking crazy like that would",
            "start": 4516.24
        },
        {
            "text": "things that are offending all these minorities and doing all this different stuff and making everybody look everybody from the outside the country looking to go are they fucking crazy like that would be the one i would love to see because that if i honestly think he has a better ch and i know you totally disagree and every political pundit does too i think bernie would have a better chance of beating trump just because i think it would be that whole thing of like oh cool no matter what we're coming out of this different and it's like do you believe him or do you believe him to jump in real quick just to be clear he does poll better against trump but i still say the reason sanders hasn't is doing so well is because the republicans just ignore him sure he will be very easy to kill sure socialism and all that stuff i understand and you know like yeah like they have not focused any energy totally get that so that i want to throw them i just feel like that that would be a one where i'd be",
            "start": 4560.0
        },
        {
            "text": "and all that stuff i understand and you know like yeah like they have not focused any energy totally get that so that i want to throw them i just feel like that that would be a one where i'd be i would vote for bernie and believe in it i'd be like okay cool like i don't necessarily agree with how we're gonna pay for all the shit you're saying but it's better than the shit he's saying whereas like i'm like ah we were so close it seems on this one ah trump speaks his mind but he just says horrible horrible horrible like i just can't like how like when he like the taco salad photo on twitter not even like that was not even deconstructing any of that stuff but just imagining him behind the in the oval office behind the desk it's just like ah it's a popularity contest that's all that it is i mean like this is i mean like you know i think it's gonna i think that there's gonna be plenty of people who troops get rallied we're getting really close to judgment day here guys you gotta get up you",
            "start": 4589.84
        },
        {
            "text": "like this is i mean like you know i think it's gonna i think that there's gonna be plenty of people who troops get rallied we're getting really close to judgment day here guys you gotta get up you gotta vote for hillary or the third part like what's really gonna be fascinating is the republicans how many republicans stay behind him and don't go okay well i can't do this but then do they go to hillary they just go independent third party and see what the hell that does but to what you're saying is yeah it is a popularity contest i do feel like this honestly i could see trump winning this and then next time around i think it would i think you could easily see another ronald reagan type i am a movie star i'm george cluney i'm a movie star i'm totally liberal and democrat and this was a fucked up four years what the hell were we thinking and it just totally moves in that idiocracy way of like it is all of a sudden like it's personality's got it and like think about the first time somebody",
            "start": 4626.8
        },
        {
            "text": "up four years what the hell were we thinking and it just totally moves in that idiocracy way of like it is all of a sudden like it's personality's got it and like think about the first time somebody who's like this is stretching it but stick with me because maybe who the fuck knows anymore think about the next when it gets to the point where all of the youtubers that have started youtube phil defranco and i just seen all these when they're they hit 35 and their audience hits voting age and they're like you know what fucking i'm gonna run like what would that be like right now if phil defranco was old enough or i just seen was old enough and they were like you know the majority of their viewing population who'd grown up with them was old enough and they were like fucking trump's running let's try this you know i mean we'll go third party and numbers of power man i i think it's we're in a very interesting time i've never understood politics and it's never been my thing but the funny",
            "start": 4669.68
        },
        {
            "text": "let's try this you know i mean we'll go third party and numbers of power man i i think it's we're in a very interesting time i've never understood politics and it's never been my thing but the funny thing is it seems like all the people that do understand it have been wrong totally time after time after time with this whole thing and i with the whole bernie stuff we watch that bernie math video on college until he's out he's not out like i don't understand everyone's saying it's impossible for him to win all right well he's still here like i am i am not if i if you had to ask me who i think is gonna win i don't i'm not gonna say he's not going to yeah i would not put money that on that i think that's so fascinating exactly this whole thing's fascinating it's like i i'm these articles confuse me because like to me they seem so backwards where it's like i feel just the opposite way it's like i feel like trump is so obviously has such control over this whole thing and he has for so long",
            "start": 4705.92
        },
        {
            "text": "me because like to me they seem so backwards where it's like i feel just the opposite way it's like i feel like trump is so obviously has such control over this whole thing and he has for so long which has been kind of like rolling down the mountain just gaining traction it's like you don't after all of that you don't have less power you just have more say over everything so now him being the only guy on that side it's like well okay cool that's kind of totally locked in dealing with this other side it's like we'll see how that all shakes out but like the the whole internet thing like it's hard to judge because the polling numbers are what matters but like with the whole the voice of the internet and the circles you're running the shit that i read and the shit that i come across based on the various sites i go to as biased as they are it tells a very very direct story and that's everyone thinks donald's crazy but every other articles about him which right just hearing his name is",
            "start": 4746.32
        },
        {
            "text": "on the various sites i go to as biased as they are it tells a very very direct story and that's everyone thinks donald's crazy but every other articles about him which right just hearing his name is power he's kanye west everyone fucking hates he is he's kanye west everyone fucking hates hillary but she's there and everyone fucking loves bernie so it's like what that actually creates is going to be interesting because i think that this is one of the first um voting times that the internet generation has there's been a couple i think last was a good example of the beginning of it but now the internet's a fucking thing everybody has all these social media networks that's part of your ingrained life and i think that um i mean i you could probably answer my question here but are more people voting now than ever before because i would assume so yeah well the interesting thing is i think democratic turnout is lower with sanders and hillary than it was with hillary and obama which says",
            "start": 4782.48
        },
        {
            "text": "voting now than ever before because i would assume so yeah well the interesting thing is i think democratic turnout is lower with sanders and hillary than it was with hillary and obama which says something about sanders and hillary and higher than i'd ever been with trump on the republican side and which says something about i think that narrative is going to get told and i think that's going to be the thing of like fucking we gotta go vote get up we gotta go you know what i mean because it is i think there is that discrepancy and we've talked about this before with just conservative in general right where it's like uh if you're young you're liberal and so if if you're older you tend to swing more conservative based on your responsibilities taxes so on and so forth and so i think it would be one of those things of like you can get a campaign a groundswell campaign pretty quick if hillary was smart and went to the youtubers and was like we need to get in front of your audience to be",
            "start": 4821.12
        },
        {
            "text": "be one of those things of like you can get a campaign a groundswell campaign pretty quick if hillary was smart and went to the youtubers and was like we need to get in front of your audience to be like are you 18 you gotta go vote because this guy's crazy yeah i mean i think that happened in the last time with obama in that obama had the voice of entertainment behind him like every all the entertainment whether it was movie or music was about change and about obama and i think that that probably says a lot there where they're not necessarily doing that the same way with bernie it's just a bunch of message boards and the internet yeah and that's the thing about that's why you know i use the word optics a lot and it's because of my love of politics because you won't hear a word more than that word when you when you read about politics bernie it looks like everyone loves bernie but three and a half more million more people voted for hillary clinton than bernie in this cycle right so it's",
            "start": 4861.44
        },
        {
            "text": "word when you when you read about politics bernie it looks like everyone loves bernie but three and a half more million more people voted for hillary clinton than bernie in this cycle right so it's like all right so there's some there's something lost there's some connection lost there like it says it's just that bernie supporters are i always compare them to ron paul supporters which i was one except there's just way more of them where it's like no negative things can be said about bernie sanders bernie sanders has the answer to everything bernie sanders can't lose until he loses bernie like etc so i know i know because i know what that looks like because i was there you know i know i remember i remember it um and so the i think the reason trump is resonating there was a really interesting video i wish i knew what it was i saw it on facebook where it was like these guys dressed up in um and they were bernie sanders supporters i think ultimately and they kind of like skewed their",
            "start": 4894.8
        },
        {
            "text": "video i wish i knew what it was i saw it on facebook where it was like these guys dressed up in um and they were bernie sanders supporters i think ultimately and they kind of like skewed their video a little bit towards the end but they were dressed in like muslims for trump shirts or something like that and they went to these rallies and they were videotaping because they expected so a certain outcome that i don't think they got and what they ended up finding out was i think and the guy was saying is like these are kind of just normal people like and they just want change and they're just a lot of working class blue-collar people some white-collar people that that just want change and just see this man and they believe in them and they're not racist and they're not bigots and they're not doing anything wrong you know and like i do think that the biggest weapon trump has is every time someone calls him that or calls the supporters that more people will vote for him than not and i",
            "start": 4932.0
        },
        {
            "text": "not doing anything wrong you know and like i do think that the biggest weapon trump has is every time someone calls him that or calls the supporters that more people will vote for him than not and i think because i don't think people like being called that we saw that with in 2010 in the midterms with the tea party which took over the house and and almost took over the senate and had some crazy candidates so they didn't go to the senate where it can go too far to the right or too far to the left like it did with occupy wall street for instance but really we're all kind of in the middle we all kind of family-oriented want jobs want a strong economy wants safety and security and all that kind of stuff and so the othering of each other's kind of groups of supporters is only going to backfire and that only supports donald trump and so i think that that is um that's something that people really need to take into account when there are basically riots and like it's very much like 1968",
            "start": 4964.72
        },
        {
            "text": "and that only supports donald trump and so i think that that is um that's something that people really need to take into account when there are basically riots and like it's very much like 1968 people can go read about 1968 about the riots and like a really a lot of a lot of fucked up things happening that year because of vietnam and all this kind of stuff across the country and that really called for um strong leadership right and so i by the way i said i said goldwater before 68 goldwater ran in 64 and 68 nixon and lbj ran and nixon um or it wasn't nixon lbj it was nixon and hubert humphrey i think and nixon won that race because uh people were looking for like something someone strong and someone that's like no this isn't okay like we don't riot we don't we don't we let other people speak we don't interrupt and all those kinds of things and people wanted someone with order and so i keep saying that if people want to beat trump the best route to do that is to just you can do all you",
            "start": 4998.96
        },
        {
            "text": "we don't interrupt and all those kinds of things and people wanted someone with order and so i keep saying that if people want to beat trump the best route to do that is to just you can do all you want but just go vote because the more you yell and scream i think it's gonna backfire and i think and i think i think you're gonna find out that most people don't that doesn't resonate with most people and they're gonna be wondering why you're yelling and screaming why you don't why you want to interrupt his rallies why you don't let him speak they're just gonna become more and more curious about him i mean i think you're absolutely right i think that's what we've seen since the beginning it's like even if you're not yelling and screaming at the the you know what in front of him physically like just any post you've ever made insulting donald trump on twitter is building that every single one people want to know why he's bad every click you give him because you want to see him saying",
            "start": 5046.64
        },
        {
            "text": "like just any post you've ever made insulting donald trump on twitter is building that every single one people want to know why he's bad every click you give him because you want to see him saying something insulting or stupid it's like that builds all that shit but that's it's the hip-hop artist mentality right like i have an album dropping i'm going to say something ridiculous right now to make headlines then oh by the way go buy this album right it's classic uh manipulation of the media and trump has it down ultimately though i think he is probably the worst of all of our choices i think he's still really good for politics not in the short term but i think in the long term i think this is a historic election i think this will prove that if anything we just don't want the same insidious lies and bullshit that i have seen ever since i was born we don't want these fucking fake puppets doing the fake speak where they can't point you know because they're too afraid to like if this is",
            "start": 5078.16
        },
        {
            "text": "lies and bullshit that i have seen ever since i was born we don't want these fucking fake puppets doing the fake speak where they can't point you know because they're too afraid to like if this is aggressive this is a not aggressive you know like we don't need that anymore we are so as a society aware because of things like social media that we don't need to be dumbed down and talked down to like all these politicians feel the need to and that's what trump is great at he is terrible at delivering messages he is fantastic at showing how fake everyone else is and that's really all his powers which when he goes up against hillary that's why i fear for hillary is because he's going to just shoot holes through everything she does metaphorically speaking of course he's going to show her as being the complete and total bullshit artist that she is and she has been ever since she's got into senate that's i'm sorry no please well that's what's exciting about this from my perspective is somebody",
            "start": 5116.88
        },
        {
            "text": "the complete and total bullshit artist that she is and she has been ever since she's got into senate that's i'm sorry no please well that's what's exciting about this from my perspective is somebody who's so jaded about politics and it has been forever and was like oh obama he's saying the right things and you vote it's just another just another guy just another dude it's like it literally i do feel like politics after this election will never be the same is that you will let's say trump wins and even if he doesn't your next go round i think even i'm talking about like even mayor mayor stuff you know senate seats all this different stuff is going to be people who are i'm going to shoot straight with you and i can be the donald trump that's a reasonable person and not say this kind of stuff and dot dot dot dot but dialing it back from where you don't have to have an answer for everything because trump doesn't right that that's human and totally like authentic who's who's going to be on",
            "start": 5162.64
        },
        {
            "text": "and dot dot dot dot but dialing it back from where you don't have to have an answer for everything because trump doesn't right that that's human and totally like authentic who's who's going to be on your in your cabinet i don't know a bunch of fucking awesome people what do you think about foreign policy i don't know much about it i'm going to get great people to come in and give me great advice like i have with a million business of them yeah okay that i can get behind but then he says bad things about people well yeah he needs i mean i really wish he'd tone down a lot of the the terrible rhetoric but he i honestly believe would be one of the only people who if elected could actually get things done i don't know to what end or to what you know to what eventual goals he would be getting those things done against i mean i have he talks about building a wall i have to imagine he if he could actually do that he would capitalize off of it wholeheartedly by having one of his companies",
            "start": 5197.36
        },
        {
            "text": "those things done against i mean i have he talks about building a wall i have to imagine he if he could actually do that he would capitalize off of it wholeheartedly by having one of his companies probably build it but um i think he could actually get things done whereas i don't i think you elect hillary i think it's the same thing we've had it's another four years another obama yeah i think so i think this go i think this can go multiple ways i first of all i want to say it's more likely than not trump loses but i wouldn't say any more than that there were some people on the sunday shows that were saying like it might even be 50 50 and i like really when it comes down to it and what a lot of that says i think is that and a lot of people on both sides are like god damn it because this would have been such a slam dunk for the republicans if they just nominated someone like mit romney and this would have been such a slam dunk for the democrats if they nominated someone that anyone liked",
            "start": 5229.6
        },
        {
            "text": "have been such a slam dunk for the republicans if they just nominated someone like mit romney and this would have been such a slam dunk for the democrats if they nominated someone that anyone liked so not a socialist and not clinton but like just like martin o'mal even if he was like more popular and like like it would have been so easy to put someone normal against him that just so happens that both of them suck so now no one so now no man i think it's like a really bad super bowl i think that these are the the two the the most perfect possible candidates that there is for it because it's like from a wide perspective people that don't engage with this stuff on the day to day clinton a name that you know that represents what you know it's just all right cool i can totally wrap my head around what that means and then somebody that is super gung-ho super left like this the super example of that and i don't know any who else could be there that we can wrap our head around unless it was a",
            "start": 5268.56
        },
        {
            "text": "what that means and then somebody that is super gung-ho super left like this the super example of that and i don't know any who else could be there that we can wrap our head around unless it was a celebrity unless it was they the good donald trump like i don't i if it was just another random politician i don't think that they would win out over either of those two ideas oh i don't i mean i don't know if i agree just in the sense that once people start to engage people are engaged way more now earlier general public than they would usually be in the primary people don't usually pay attention to the conventions but it's because of donald trump exactly and so it could be for good or bad he's way underwater in his negatives and that's a bad thing the the the point i'm making is so is hillary clinton people don't like her either people don't like i think the word in some gallop poll or something was like what's the word you associate with hillary clinton's like untrustworthy yeah i'm like",
            "start": 5303.68
        },
        {
            "text": "clinton people don't like her either people don't like i think the word in some gallop poll or something was like what's the word you associate with hillary clinton's like untrustworthy yeah i'm like so i'm like jesus christ like there's a plenty of people on the democratic side that would beat trump but she might not be one of them and that's one of the and that's one of the funny things about about this and so i see it going certain ways there's an electoral map reality right clinton has the electoral map reality it doesn't matter who wins the popular vote it matters who wins the electoral votes and the only way trump can win is if he starts picking off states romney lost and and to that end he needs to win pennsylvania he needs to win ohio he needs to win wisconsin he needs to win like all these states the interesting thing is because donald trump is from new york city born and raised in new york city in the heart of liberalism does he put new york in play does he put new jersey in",
            "start": 5344.64
        },
        {
            "text": "all these states the interesting thing is because donald trump is from new york city born and raised in new york city in the heart of liberalism does he put new york in play does he put new jersey in the play does he at least make hillary clinton play defense there is chris christie almost clearly going to be his running mate you know so does that put like the whole tri-state area in play is he really i i mean i think it's pretty obvious that would be ridiculous so like remember those images of when he got off the plane or whatever with him he looked like he was like just beaten by the world and they're like oh he's falling for it um like or at the very least ag but it seems like that would make that doesn't bring much regional balance which is politically unastute but it's trump he's not looking for regional balance he's not looking for the guy in the middle of the country that like oh i can win ohio by bringing he doesn't care so like again all the political shit out the window so",
            "start": 5380.4
        },
        {
            "text": "looking for regional balance he's not looking for the guy in the middle of the country that like oh i can win ohio by bringing he doesn't care so like again all the political shit out the window so like does it make does it make her play defense in those states does she have to spend money and resources in those states it's just been decided on the states does that let trump then go into missouri and go into all these states that he's gonna have to contest and like and do better there's gonna be so much gamesmanship and this is why i think tim would love politics way more than he thinks he does because this is when shit gets fucking no i get it man i totally get it honestly i think that it's a foregone conclusion that trump wins i think that it really does require a a miracle honestly it requires something to happen that i don't understand because i don't understand this shit but it does require some fucking little finger gaming of the shit that behind the scene things are happening",
            "start": 5411.36
        },
        {
            "text": "requires something to happen that i don't understand because i don't understand this shit but it does require some fucking little finger gaming of the shit that behind the scene things are happening and they're scheming someone's scheming oh someone's doing bernie doing i don't know what the fuck bernie's doing but he's there you know and that at least gives me hope that something's happening because i'm not confident that hillary can take it from from trump i think trump has this the the momentum that is going to carry him i do think that he has this that's fucking not good we need to fix this shit fucking vote do something i don't know but i do think that uh it's i i think that it it's his momentum is everything to lose momentum is everything there's something called big mo this comes from yeah the drum at the university of missouri that's exactly right it comes from i think the bush reagan race in 1980 um all of them have momentum when bush ran one new hampshire something like that",
            "start": 5448.56
        },
        {
            "text": "yeah the drum at the university of missouri that's exactly right it comes from i think the bush reagan race in 1980 um all of them have momentum when bush ran one new hampshire something like that and like they and and journals are calling big mo it's actually in that show the circus that i recommended on colin and greg live yesterday people should definitely watch that show it's on showtime it's fucking awesome um and each and one of the episodes i think is called big mo or big momentum um momentum is everything and i do think that trump is way more formidable than people think and this is what i'm saying about you know the echo chamber where everyone it seems like everyone loves bernie sanders but why is bernie sanders losing you know and it's the same thing where i'm like it seems like everyone hates donald trump but why is donald trump winning yeah and so like we have to kind of like look at those kinds of things so my my statement on that is and again i'm from san francisco born",
            "start": 5484.4
        },
        {
            "text": "everyone hates donald trump but why is donald trump winning yeah and so like we have to kind of like look at those kinds of things so my my statement on that is and again i'm from san francisco born and raised so i have a very different perspective than the majority of people probably but i will never forget hearing that people were voting for bush i was like what the fuck really that doesn't make sense to me everyone is about anyone else but bush and then lo and behold it happened twice and i could not comprehend that i didn't know a single fucking person that voted for him i didn't know anybody that would even think about it because that's just ridiculous and it's the same thing here where it's like fuck man i have no sense of what the hell's going on with all this because my life what i know that doesn't make any sense at all the with obama i could not believe it was as close as it was i could not believe it because the idea of voting for anyone but obama was like what the fuck",
            "start": 5516.16
        },
        {
            "text": "i know that doesn't make any sense at all the with obama i could not believe it was as close as it was i could not believe it because the idea of voting for anyone but obama was like what the fuck obama is the goddamn hero obama's the good guy why would you it's really good guy bad guy and i was shocked that it was as close as it was i remember being in berkeley and there was a we were there for a concert and there was like it was when the the california um elections were the results or whatever and there's this big screen like all the berkeley kids were there watching it and it was so much closer than i could have ever imagined and like that's the thing where i'm like i don't understand this i will never understand this because that doesn't make sense and that's why with this whole thing is it's like it really doesn't matter to me what i think and what i'm seeing because i understand that it's totally out of my hands and it's out of my world entirely but anything can happen well so",
            "start": 5556.0
        },
        {
            "text": "is it's like it really doesn't matter to me what i think and what i'm seeing because i understand that it's totally out of my hands and it's out of my world entirely but anything can happen well so here's the perfect outcome i'm sorry are you gonna say something no just saying okay here's the perfect outcome and this is what i want to happen because this is you were talking about like crazy game of thrones kind of shit this is the inside play that some people are playing for now and i think i was talking about this you guys before i don't know if you or her i was talking to greg about it there's a huge contingent of republicans and conservatives that will not vote for trump a pretty substantial one it means the only way trump wins is either to get those people to vote for him which they might or to give them another candidate and then trump picks off a bunch of democrats and so there's a guy named ben sass who's in his 30s who's a senator from nebraska who people are kind of trying to",
            "start": 5600.4
        },
        {
            "text": "or to give them another candidate and then trump picks off a bunch of democrats and so there's a guy named ben sass who's in his 30s who's a senator from nebraska who people are kind of trying to get in and being like you want to run independent you want to run as like a constitutionalist or whatever they went and talked to mit romney a few days ago to see if he wants to get in come on mit so like so the idea here is a very 1912 style or 1992 style election but even to the up to the up to degree where you have someone that wins states like someone that like trump wins x y and z hillary clinton wins a b and c and then there's this other third party that's picking off random states and no one reaches 270 electoral votes which is what you need to be president and then the house of representatives picks the president which is something that's never happened before in the united states history because everyone always reaches the threshold of 270 or whatever it was before you know when",
            "start": 5632.08
        },
        {
            "text": "picks the president which is something that's never happened before in the united states history because everyone always reaches the threshold of 270 or whatever it was before you know when there were fewer states and so this 270 electoral vote thing is like what some conservative pundits are trying to say like if we can just stop hillary clinton from getting there the republican house of representatives will pick a republican as president which will probably be like mit romney or ben sass or something like that and then we don't have to deal with this at all trump loses and clinton loses you know and and so like that's the incredible gamesmanship that's going on right now to try to get someone on the ballot and they have to do it soon because they're gonna have a lot of money behind them and all that kind of stuff but they have to start getting on the ballots and there are rules and regulations to getting on the ballots and lots of money that needs to go into getting all you know",
            "start": 5673.04
        },
        {
            "text": "and all that kind of stuff but they have to start getting on the ballots and there are rules and regulations to getting on the ballots and lots of money that needs to go into getting all you know because the democratic and republican parties pay for that shit and are way ahead of the game and all that kind of stuff but when you have to do it by yourself it's a whole different story and that's why billionaires are typically the ones like ross perot that do it because they can pay for all these people to do it so that's the inside track and i think you know bill crystal who's a famous writer um the political writer was saying that it's like an inside straight like a straight draw like it's almost definitely not gonna happen but that's kind of the play it's like if they can just stop everyone from getting from 270 electoral votes than the house of representatives which is republican even if they're lame duck will pick a republican and um so that's that's the inside game but i think the",
            "start": 5703.36
        },
        {
            "text": "from getting from 270 electoral votes than the house of representatives which is republican even if they're lame duck will pick a republican and um so that's that's the inside game but i think the way it plays out i think trump loses i think clinton wins and i think that trump loses by way fewer votes than people think i think i think it's gonna be way i think in the electoral vote i think it'll be within three percent and i think he'll lose by only about 30 electoral votes and there'll be like and and and i think it will be unlike the 2008 election where everyone knew mccain was gonna lose i think it's going and ron people thought ron is gonna lose people weren't quite sure people knew mccain was gonna lose i think it's gonna be even closer than that i think that like people are gonna be like i don't know like it's gonna be it's gonna be on florida and ohio and like you know like i think it's gonna be really close and i think i think some weird states flip you can see new jersey",
            "start": 5734.4
        },
        {
            "text": "be like i don't know like it's gonna be it's gonna be on florida and ohio and like you know like i think it's gonna be really close and i think i think some weird states flip you can see new jersey flipping you can see like you know a red state like you know georgia flipping like it's gonna it's a totally whacked out kind of thing but i want to see where you guys stood right now because my my my my message to everyone right now is you are taking this man lightly at your own peril and if you want if you do not believe it fucking believe it he's schooled everyone all these people with hundreds of millions of dollars everyone was against them no one supported them all these very seasoned operatives working for all these other people that worked on winning campaigns he fucking destroyed them and if you think that he can't do the same to hillary clinton you are delusional you know that's all that's all i'm gonna say like hillary clinton has and and you know that showed the circus the guys",
            "start": 5766.56
        },
        {
            "text": "and if you think that he can't do the same to hillary clinton you are delusional you know that's all that's all i'm gonna say like hillary clinton has and and you know that showed the circus the guys go out to dinner with some of their the higher ups in the clinton's campaign and they look worried you know like they're all eating dinner in new york city and brooklyn because that's where she's located and they like kind of don't look joyous yeah they're kind of like one guy says like really seriously is like it's not a game like and like we need to make sure people know it's not a game but like they're losing you know like they are losing the game and if as long as people keep thinking that it's like a reality show and trump just trump plays by different rules if i'm telling you right now 25 things trump said would have eliminated him if he was a normal republican and not only the mexican thing the muslim band thing which is not only offensive and wrong but also unconstitutional it",
            "start": 5804.0
        },
        {
            "text": "25 things trump said would have eliminated him if he was a normal republican and not only the mexican thing the muslim band thing which is not only offensive and wrong but also unconstitutional it doesn't matter what he says like people need to understand that every offensive thing he says he gets more and more votes because people just like this guy doesn't give a fuck and i'm telling you that's appealing to people and i want someone like trump i wish i could like trump i just can't and that's what i tweeted out i'm like the problem i'm like i'm like in good conscience i can't support this man but if i could go and go through his whole history of the things he said and just remove like 10 or 15 things that he said and did he would be fine and i'll tell you right now he would destroy clinton like if what i keep saying is if we need someone like donald trump but not donald trump we need an outsider that can self-fund his campaign and if trump wasn't he was brash and he said we need to",
            "start": 5845.12
        },
        {
            "text": "like if what i keep saying is if we need someone like donald trump but not donald trump we need an outsider that can self-fund his campaign and if trump wasn't he was brash and he said we need to say maybe brash like me but not brash like donald trump if you just said what you meant and didn't really alienate people it wouldn't even be close he would destroy hillary clinton and and we all fucking know it you know and the uh so i think this is going to be a fascinating uh election when everyone regards you want to vote for trump i'm do we have trump supporters out there go vote for trump over everyone but get involved this is going to be an historic election we're going to talk about this election for a very very long time and i agree with you that this no matter who wins or loses this changes everything for american politics it's going to be hard for normal people that are that are that want to run to run the reason trump can run is because he has billions of dollars he doesn't have",
            "start": 5876.64
        },
        {
            "text": "everything for american politics it's going to be hard for normal people that are that are that want to run to run the reason trump can run is because he has billions of dollars he doesn't have to go for anyone's money to go get anyone's money but you're going to see more and more of this and i don't necessarily think it's a bad thing because look at washington now they fucking suck these are all the politics career politicians people have been there for 10 20 30 40 years they suck and they haven't done anything they are corrupt and they are inept and there's no reason why we should keep them there right it's just it's just there's no reason why this might be the man that we should replace them with yeah exactly so it's just so i can see it both ways you know so i want to see what you guys think but you know if you're scared of trump you should be because it's going to be way closer than you think it is and as always the closer you get to election the closer to polls tighten and as",
            "start": 5911.12
        },
        {
            "text": "think but you know if you're scared of trump you should be because it's going to be way closer than you think it is and as always the closer you get to election the closer to polls tighten and as people were saying on morning joe and some of these other sunday shows i wouldn't be surprised if they flip tim and then you'd be scared what's your topic so a couple days ago i went to this this establishment called safeway and i was buying some stuff and as i was you know checking out there's magazines to my left and right obviously cosmopolitan catches my eye because it always catches my of course there was i don't even know what the fuck it was it was national inquirer or some shit next to that was globe next to that was who who the hell knows weekly we're the tabloids the tabloids and the three of them said in order prince discovered dead by aides prince murdered prince suicide and i'm just like holy shit how are these magazines still a thing who the fuck is the audience for them how is",
            "start": 5948.64
        },
        {
            "text": "of them said in order prince discovered dead by aides prince murdered prince suicide and i'm just like holy shit how are these magazines still a thing who the fuck is the audience for them how is that legal what the fuck is going on yeah there's a lot of interesting questions about the i i don't know the answer i'll tell you that when i was like fourth fifth sixth grade i get my mom to buy me the national inquirer really oh yeah yeah me too i was big weekly world news fan too knowing it was fake but wanting to see what batboy was up to yeah this has been honestly a question since i was in since the 80s since i i remember seeing that and asking like what like because you think when you're a kid you're like wow that's crazy that's that's got to be real right similar to how everyone thinks anything they read on the internet is real but your mother is like no he you know because when i was a kid he used to be like aliens it was always aliens right aliens are flying over ohio you're like",
            "start": 5986.08
        },
        {
            "text": "anything they read on the internet is real but your mother is like no he you know because when i was a kid he used to be like aliens it was always aliens right aliens are flying over ohio you're like oh mom those aliens are really just like that shit's bullshit they just make that stuff up and i'm like but how it's on it it's presenting itself as a creditable like news source and she's like yeah don't worry about it just read like something better like the wall street journal the new york times i'm like well i'm not gonna read either of those that sounds like a lot of work mom there's a lot of words what's interesting about what we're saying here is that when you're a little kid that stuff is appealing because they're making shit up and that made up shit sounds interesting right but little kids aren't the ones buying the shit so if you convince your mom to buy it cool that's one thing no it's it's probably if older people probably if i had to guess demographic and i don't want to",
            "start": 6033.84
        },
        {
            "text": "kids aren't the ones buying the shit so if you convince your mom to buy it cool that's one thing no it's it's probably if older people probably if i had to guess demographic and i don't want to sound insulting i would guess older women would probably were probably the ones buying this i i mean yeah because that's i mean the only my my exposure to it was always a babysitter right um an aunt somebody like that who's picking it up yeah i'm a big fan of do you you know i respect your choices and stuff but i feel like i'd be real judgy if i saw someone buying a national enquirer like what the fuck is that but again i think it's one of those things like at this point i don't know why people buy them i would i would hope that they're buying them for just the sheer entertainment value of it and not actually buying into whatever messaging is coming from this similar to me like when my wife reads us weekly or um any of those sort of like rag gossip like magazines that report real stuff but it's",
            "start": 6069.12
        },
        {
            "text": "actually buying into whatever messaging is coming from this similar to me like when my wife reads us weekly or um any of those sort of like rag gossip like magazines that report real stuff but it's always like you know it's all very superficial there though that to me that is just as valuable as this shit we do here yeah but my wife doesn't read who wore it best because she really gives a shit right i mean it's just for the entertainment value of it it's throwaway content it's very cheaply consumable easily consumable content yeah may i read to you from the new york times sure uh this is an article about how do they do all this and how does this not go they're talking to a veteran entertainment lawyer he tells a celebrity that the tabloid will aggressively fight back so the lawsuit will cost hundreds of thousands of dollars and will probably drag on for years he emphasizes that in preparing their defense the tabloid lawyers might be given legal permission to scrutinize the celebrity's",
            "start": 6104.0
        },
        {
            "text": "hundreds of thousands of dollars and will probably drag on for years he emphasizes that in preparing their defense the tabloid lawyers might be given legal permission to scrutinize the celebrity's personal life and he points out that by law the standard for libel for public figures is high making it a difficult case to win the celebrity will have to prove quote unquote actual malice that the tabloid was not just negligent but rather knew that the item was false and nonetheless displayed a reckless disregard for the truth warnings often deter lawsuits that just it's so funny that like some guy or lady found some flaw it was just like i'm fucking running with this we're gonna make a lot of money because it's like you know you think about the paparazzi and stuff the people that are ruining people's lives by like constantly following them around taking pictures and it's like man that's wrong but then there's this other guy there's some scheming bastard that the more i think about it the",
            "start": 6142.24
        },
        {
            "text": "people's lives by like constantly following them around taking pictures and it's like man that's wrong but then there's this other guy there's some scheming bastard that the more i think about it the more i kind of respect he's sitting there and he's like how could i not do any of that work how could i not be all up in someone's business and just make some shit up how can i just photoshop a picture of this person and like like 20 pounds heavier and say they're dying of something but you they aren't even photoshopped those photos those are real i believe so i mean some of them are because i mean like any photo you take i mean you've watched the show enough ladies and gentlemen you see how we are we just don't pay attention or if posture gets all bad and we're just sitting here like oh no undoubtedly like i mean and that's that's how they do it a lot of times with just normal paparazzi too they're coming out of the building or whatever snap off 400 pictures of someone you're going to",
            "start": 6180.16
        },
        {
            "text": "undoubtedly like i mean and that's that's how they do it a lot of times with just normal paparazzi too they're coming out of the building or whatever snap off 400 pictures of someone you're going to have one of those in there ridiculous yeah or the you know yeah any anyone any of us the strycian effect yeah but uh but yeah but i mean that's that's a very real and very fucked up thing that you're talking about right that doesn't just necessarily apply to just these tabloids like a lot of businesses have those practices of being able to have more money and just having a bigger legal team than other businesses and they can just beat them down people accused apple that for a very long time apple like is notorious for being very aggressive about their patents and being aggressive about if anyone comes even close to it because they know they have more money than most countries you can't win a lawsuit against apple you're just not gonna yeah so they win automatically you can't no one can",
            "start": 6215.28
        },
        {
            "text": "comes even close to it because they know they have more money than most countries you can't win a lawsuit against apple you're just not gonna yeah so they win automatically you can't no one can beat apple it's just not happening right no one can be a lot of they went toe-to-toe with our own federal government over the uh san bernard cell phone which is like unfathomable like everyone you're familiar with this right yeah yeah yeah the government just for people i don't the government just being like can you just unlock this fucking phone and i'm like no we're not gonna do it yeah and like when it's a terrorist phone and like we're not gonna do it yeah they're like the court it costs them millions of dollars and like and a lot of people are mad at them you know and i'm i'm i think it's a lot of people awesome yeah yeah but to me i'm like not many people go to toe-to-toe like that with the feds you know so like not only other you know like not only like small companies but they're like",
            "start": 6251.68
        },
        {
            "text": "of people awesome yeah yeah but to me i'm like not many people go to toe-to-toe like that with the feds you know so like not only other you know like not only like small companies but they're like their own government they're like oh no i mean but that's the thing too like yeah there are bigger companies that have lost those arguments or like google um has lost out to the to the government before but but it's scary right when you think about that because someone could come in and say something horrible about you and it costs you more to tell people that they're wrong than it would for you just to shut up and that's part of it too you figure right like i mean the i don't know how many people and i know they exist but how many people pick up the tabloids and believe what they're reading you know what i mean like it is one of those things you pick up and in one ear out the other something interesting something to gossip about but like i mean that what's so weird to me is that like that's",
            "start": 6286.4
        },
        {
            "text": "know what i mean like it is one of those things you pick up and in one ear out the other something interesting something to gossip about but like i mean that what's so weird to me is that like that's not like you you don't gossip about it because it's the good you gossip to your your fellow fans of these things like no but the prince dying of aids things did circulate so that people did talk about that like it was real because it was i mean i've heard that and i've had to look it up and actually and see if it's been dispelled sort of snopes well no but it is an actual rumor that's floating around which is very very sad like i don't i don't know if it's true my other thing is to be you know what prince died of i haven't kept my ear to the ground on this story no i mean the last thing i heard of was that he uh had the flu and was like over and and and died of basically of that but i'm not quite i mean kevin can you look it up real quick and see or do you know i i heard that he was",
            "start": 6324.88
        },
        {
            "text": "i heard of was that he uh had the flu and was like over and and and died of basically of that but i'm not quite i mean kevin can you look it up real quick and see or do you know i i heard that he was taking pain medication yeah he was addicted to pain pills that's what some people were saying that's what got it so an overdose or some sort of like broke his body like sleeping pills because he was sick and he thought he needed it i mean that again that is every bit as maybe ridiculous as saying he died of aids i don't know we don't know we could be prolific this is how these rumors get kind of spread right is that someone says it's of misinformation misinformation and you think you look at a guy like prince who has a sort of androgynous past you don't know what his sexuality was but he's a fucking rock star so you feel like he can probably fuck whoever he pleases whatever he pleases is it inconceivable that a man that really really popular in the 80s and androgynous and probably having",
            "start": 6363.52
        },
        {
            "text": "fucking rock star so you feel like he can probably fuck whoever he pleases whatever he pleases is it inconceivable that a man that really really popular in the 80s and androgynous and probably having sex with lots of people seemingly could die of aids so these are how these things get spread right it's not beyond the realm of people's sort of biases to buy into this shit um the more dangerous thing is when places like tmz start spreading rumors because they are kind of seen as a creditable media outlet but i mean i think there's a difference there though it's like the things that they say are substantiated by something something but it's also like here though but it's insidious right because you're like you didn't need to report that your whole point of being is for entertainment but you're writing yourself off like you're cnn or the wall street journal right like people are supposed to believe this because you because you are a big enough brand that people will be like okay we we're",
            "start": 6403.36
        },
        {
            "text": "writing yourself off like you're cnn or the wall street journal right like people are supposed to believe this because you because you are a big enough brand that people will be like okay we we're kind of speaking the truth but they're also just writing about horrible shit that really is why those people go there though that's why those people go to tmz but that's but see that's that's when it gets really really sad is like so they could dig up some facts about you that's not newsworthy it's a total invasion of privacy but because you're in the public eye and because you fall under those those laws or or you know you're a little less protected than average joe um then they can totally fuck you over a perfect example is um i was gonna was it was amy schumer right she got she's been in the tabloids lately because some guy ran up to her and like forced her to take a picture with them and she was like this guy in front of his kid was just this big asshole who was like you know and he said",
            "start": 6446.96
        },
        {
            "text": "lately because some guy ran up to her and like forced her to take a picture with them and she was like this guy in front of his kid was just this big asshole who was like you know and he said she said look i don't want to take a picture i'm sorry i don't want to take that right now and he said you have to this is america and we paid for you i think were his exact words and it sucks but there's no ramifications against this guy because she is in the public she is a public figure and they were on a public street and he can't take a picture of her that's just the way it goes um but at the same time she's a multi-multi-millionaire so that's how you have to kind of balance out these things right money but i mean like so tabloids when you say tabloids was it the national inquirer should talk about that or was it the us weeklies because i think that there's a difference there what does us weekly count as like those gossip magazines somewhere in between i mean they call i mean the word",
            "start": 6483.84
        },
        {
            "text": "about that or was it the us weeklies because i think that there's a difference there what does us weekly count as like those gossip magazines somewhere in between i mean they call i mean the word tabloids used very loosely and wasn't always necessarily used it pejoratively either um like the new york post is considered a tabloid we used to be about size and paper stock right exactly that's exactly right as opposed to like broad size guys went to college magazine journalism so like the word so the word tabloid doesn't necessarily have a pejorative meaning in its base like new york post is considered a tabloid with new york post is like very sensational but the new york post is a real newspaper so it's it's you know when i think of the word tabloid in the pejorative sense i always think about those magazines the globe and i would say us weekly probably falls into the tab it's like a step i feel like i feel like it's like what it's like the national acquirer and all of them then it'd be",
            "start": 6519.68
        },
        {
            "text": "those magazines the globe and i would say us weekly probably falls into the tab it's like a step i feel like i feel like it's like what it's like the national acquirer and all of them then it'd be like yeah you're us weeklies and i feel like people people's up here people's a little bit better no i would say people really because and i've read the story from the source though but i've read these magazines right the story always has a question mark at the end of it that's how they get away with it is this person pregnant does this person have a drug problem that's not people people has a first-hand account there's always something there like it them being pregnant is is she pregnant based on this evidence that we have is the same as us talking about playstation neo but like is it gonna happen based on journalism it is totally but i've read these articles where it's like where they take a picture of two people that are talking on a street and they're like these two are having an affair",
            "start": 6553.84
        },
        {
            "text": "based on journalism it is totally but i've read these articles where it's like where they take a picture of two people that are talking on a street and they're like these two are having an affair and it's like you don't know that you know like you just you don't like there's no there's nothing in these are these two paragraphs that you read with 50 pictures all over them of like them talking to each other that that has anything in there but they're but they're protected because it's you know speculation they don't know there's you know the copy is quite i'm looking at the i'm looking here see there's there's that's just people.com close enough not many question marks sharon osborn is emotional after reports of ozzie's infidelity but she's not taking it quietly this time no no question mark got off this now here's one for you from 56 minutes ago and this is a real one this is a substantiated parent because it's exclusive tapanga has divorced her husband not on the show in real life",
            "start": 6592.08
        },
        {
            "text": "mark got off this now here's one for you from 56 minutes ago and this is a real one this is a substantiated parent because it's exclusive tapanga has divorced her husband not on the show in real life danielle official just putting that out there that's great that's great news that's really important breaking news breaking news but see but okay so the question mark maybe not necessarily in a literal use but when but they often talk they report on people's infidelities by and they don't cite sources you know they'll say sources close to this person sure sure sure i don't really know if i buy that or not or rumors they actually report on rumors and so that i mean we talked about that a lot at ign right like where do you draw the line do we report on rumors is that real journalism and so that's what and that's why they call them gossip rags because they are gossip and what is gossip a bunch of fake bullshit that's probably been trumped up maybe there's some truth in it but they're not",
            "start": 6631.04
        },
        {
            "text": "what and that's why they call them gossip rags because they are gossip and what is gossip a bunch of fake bullshit that's probably been trumped up maybe there's some truth in it but they're not sending their crackpot team from the fucking washington post out there crack team crack team sorry all these fucking crazy people hands in their hand oh shit it's the crackpot team get out of here don't tell them anything don't give me your wallet no but you know what i mean they're not they're not sending these these these uh Pulitzer prize winning journalists out there to figure out ben affleck bain does nanny but i mean also because that's the whole problem with it is like celebrity entertainment journalism to that extent you know gossip rags or just tmz or whatever is like such so i mean thus it's so superficial it is the superficial like that is another successful here's a bunch of fucking photos of somebody in the bikini yeah it's totally like i like i enjoy this person in a movie so yes",
            "start": 6670.32
        },
        {
            "text": "so superficial it is the superficial like that is another successful here's a bunch of fucking photos of somebody in the bikini yeah it's totally like i like i enjoy this person in a movie so yes i'd love to hear see them in bikini or hear about what ben affleck's doing to the maid or whatever whatever nanny um sorry my apologies well i will give a shout out to the superficial though because he doesn't he's on the nose about it as humanly possible fuck he will the guy that writes that site is an evil genius because he will just straight up like i'm posting this because they're boobs and i know you want to look at them and that's it but he says it a lot more eloquently and funnier than i do um no a little bit more maybe 10 more um but i do give a shout out to that site unlike tmz which i feel like is just and this is i guess why i have a problem with places like tmz not so much us weekly because it is in a kind of a more positive spirit but tmz just seems like it's so fucking negative",
            "start": 6711.52
        },
        {
            "text": "like is just and this is i guess why i have a problem with places like tmz not so much us weekly because it is in a kind of a more positive spirit but tmz just seems like it's so fucking negative they're just evil people who are just yeah perpetuating this horrible horrible feeling that they're putting out in the world and it's that one dude that used to be on people's court i used to like harvey levin i'm a lawyer i loved harvey levin harvey levin was my dude now real quick do you know he's still in the people's court really yeah wow he's double because he's the guy who used to be out with the crowd i know that's still his job and that's still his job and that's still his job and that's still his job and that's still his job i haven't watched people cry obviously but in the last nine months i've caught caught an episode of people's court and put together that it was new it wasn't like old you know i mean he was still but tim question for you did you know that people's court is still",
            "start": 6747.76
        },
        {
            "text": "i've caught caught an episode of people's court and put together that it was new it wasn't like old you know i mean he was still but tim question for you did you know that people's court is still on no no i did not no i did you ever watch people's court does judge wapner mean anything to you you suck is judge judy the same what about a doug llewellyn nope you remember when doug llewellyn got bit by a german shepherd when i was leaving the courtroom on that tv i hate you what do you find time to watch all these shows greg that was growing up that was grandma's house the court the court shows were awesome in the 90s mom and dad loved people's court sometimes i remember getting picked up from grandma miller's and we'd watch it in their bedroom there were some amazing ones who judge mills lane was one of them oh i remember yeah he was the boxing ref yeah and then there was um uh the black guy with the judge brown judge joe brown was one of them but there was a black guy man up yeah man",
            "start": 6779.2
        },
        {
            "text": "was one of them oh i remember yeah he was the boxing ref yeah and then there was um uh the black guy with the judge brown judge joe brown was one of them but there was a black guy man up yeah man that was a joke about uh mathis judge mathis judge mathis was another one but didn't judge judy come from this pedigree of judges yeah he did she's just the most popular judge judy makes something like 35 million dollars a year she's still making new episodes right yeah okay she's fucking awesome i have a secret one of our fans gave me a signature of hers which i'm like this is awesome and a glossy a glossy shot of judge judy with a little doily around her uh i always had respect for her and i always had respect for that show just because oh yeah she always had a little like weird teapot boy he can think coming out of a rope because they always said the shit that i was thinking right when that person opened their mouth and i always respected that and i'm like this can't be real and then it",
            "start": 6810.96
        },
        {
            "text": "can think coming out of a rope because they always said the shit that i was thinking right when that person opened their mouth and i always respected that and i'm like this can't be real and then it turns out it was real right like they were actually really no court cases yeah they're basically well no they are they are but they get bought out of the system though yeah they're they're um mediated cases like they sell the rights to mediate to judge judy okay so they're not going down an official public record as far as i understand like both sides can win money and stuff like that i think it's yeah they both get we've talked about this in the past they get tim or kevin's not real and i don't mean figures i don't mean figures but i mean i think there's a pot of money that they each get a base amount and then the judgment plays into that somehow whether it's taken out of that yeah that's why this is taking a strange turn on that's how they get people to go on to these shows judge god",
            "start": 6850.96
        },
        {
            "text": "base amount and then the judgment plays into that somehow whether it's taken out of that yeah that's why this is taking a strange turn on that's how they get people to go on to these shows judge god bless judge judy judge judy uh gifs slash gifts depending on anyone to say it some of the best things on the internet of like the amazing amazing amazing there's an amazing she's so emotive dude like when i say anything it's awesome her eye rolls like the one with the which is like i'm like this is fucking awesome like you are so you think i'm a curmudgeon oh no she is your rice she's the walder to your statler uh can we come to a consensus right now just for me on the word jiffer gift as a kind of funny what is the kind of way there's no official ruling on this this is a whole topic this is stop stop this should be a topic that's 100 correct this should be a topic this could be next week's topic for you okay done thank you and thank you tim for that topic and thank you patreon producer",
            "start": 6888.16
        },
        {
            "text": "stop stop this should be a topic that's 100 correct this should be a topic this could be next week's topic for you okay done thank you and thank you tim for that topic and thank you patreon producer adam garcia for supporting us over on patreon.com slash kind of funny of course follow him on twitter and instagram right yes adam m garcia he made what for us he made the kind of kind of funny circle logo shirt the blue one no i was like the one i'm kind of funny.com slash store gotcha you know i think andy cortez fucking love that shit yeah andy cortez fucking doing a whole bunch of cool research he's made this andy from russey little big fucking asshole fuck you ladies and gentlemen this has been the game over graggy show if you didn't know each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement yeah nick slamming his head in the microphone i like that it sounded great for kevin if you like that head over to",
            "start": 6925.12
        },
        {
            "text": "friends gather on this table each bring a random topic discussion for your amusement yeah nick slamming his head in the microphone i like that it sounded great for kevin if you like that head over to patreon.com slash kind of funny where you can toss us a few bucks get every episode early along with a bunch of exclusive parks and goodies if you have no bucks to toss no big deal head over to youtube.com slash kind of funny where you get the show broken up topic by topic day by day until we post this one big video and one big mp3 the following friday until next time it's been our pleasure to serve you",
            "start": 6967.76
        }
    ]
}