{
    "id": 1767,
    "video_id": "swEMtQYIduM",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Nintendo's Movie Plans - Kinda Funny Gamescast Ep. 71 (Pt. 3)",
    "description": "We give our thoughts on how Nintendo should make movies.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1464181202,
    "duration": 1275,
    "transcript_chunks": [
        {
            "text": "Thanks Amazon Video Games for supporting Kind of Funny Live. Amazon debuted an awesome program for their Prime members, Prime Gamer Pricing. You can now get 20% off all your game pre-orders and also off any newly launched games up to 2 weeks after they come out. Valid on physical video games. Learn more at amazon.com/gamesave. Kind of funny Live 2 is this Saturday and Sunday. If you haven't got your tickets already, go get them at kind offunny.com/tick. For topic Vader number three, unsurprisingly, I want to talk about Nintendo. Nintendo movie plans. Oh god, things are things are happening. Things are a brew over in Nintendo land. Over at IGN, Alex Osborne writes, \"Nintendo President Tatsumi Kimishima confirmed the company has plans to produce feature films and is exploring a production system in which we can do as much as we can ourselves.\" Kimishima did not give a specific time frame as to when the company plans to release its first movie, only saying, quote, \"The first title won't",
            "start": 0.08
        },
        {
            "text": "in which we can do as much as we can ourselves.\" Kimishima did not give a specific time frame as to when the company plans to release its first movie, only saying, quote, \"The first title won't be ready this year, but it also won't take 5 years.\" Oh. He also noted that Nintendo isn't interested in producing live-action movies with Kimishima citing the 1993 Super Mario Brothers film as the main reason why the company's leaning towards anime type content when Nintendo should produce as much by itself as possible in instead. With regard to which Nintendo franchise may be adapted, he refused to specify. This isn't the first time Nintendo's expressed interest in the movie business. Last year, Miiamoto said the company's open to movie adaptations based on its stable beloved characters. In fact, legendary game designer released a batch of Pikmin short films in 2014, the same year during all those Sony leaks. Uh, a hack revealed that Spider-Man producer Avi Arod was in negotiations",
            "start": 55.44
        },
        {
            "text": "In fact, legendary game designer released a batch of Pikmin short films in 2014, the same year during all those Sony leaks. Uh, a hack revealed that Spider-Man producer Avi Arod was in negotiations negotiations with Nintendo to produce an animated Super Mario Bros. movie, which would have been through Sony Pictures, and that would have been interesting. Um, and then last year there was those Netflix rumors about the Zelda series that not panning out. What do you think? Good luck. I don't know. It's it's are they my concern is are they all going to be like direct to DVD movies? Are they going to be real movies that come to a theater or are they going to be Netflix projects which would be cool to there's a bunch of cool ways to do it but there's so many different ways for it to go wrong. You figure the Mario they're going to do a Mario they have to be looking at Mario right but when I think when you talk to us and you talk to other people who are probably watching this core gamers",
            "start": 94.4
        },
        {
            "text": "You figure the Mario they're going to do a Mario they have to be looking at Mario right but when I think when you talk to us and you talk to other people who are probably watching this core gamers you're jumping to man a Zelda movie would be awesome. Maybe a Metroid movie would be awesome. like taking these worlds that are cool but don't get super fleshed out with story and giving them and giving them characters letting them go. Like they talk about, you know, anime style, right? Like Legend of Zelda anime would be awesome if you if done right. But then just a CG movie of Legend of Zelda in the theaters would be [ __ ] rad too and it would set the world on fire if you gave it the real promotional push and the right writers and the right director. And you know, it's it's similar what we're talking about with Disney and like how they're partnering with the best people for the best IPs. If Nintendo was like, \"All right, cool. Let's go.\" and they wanted to do some of it in house, which is",
            "start": 132.0
        },
        {
            "text": "talking about with Disney and like how they're partnering with the best people for the best IPs. If Nintendo was like, \"All right, cool. Let's go.\" and they wanted to do some of it in house, which is when it's like it'd be cool. Like, what if you went to Pixar and were like, \"Let's [ __ ] make a Nintendo movie. Which property do you want to do? Or do you have some kind of goofy idea to bring them all together?\" Mhm. I mean, I I think the in-house things is a good thing. I think that what they're talking about is not necessarily doing the movie stuff, but it's more about the writing and the the characters and the story and all of that stuff. Like recently, they did the in the launch for Star Fox Zero, one of the few good things about that game was the anime that came with it. It was [ __ ] awesome. Like, I was like, \"How did you nail this so well? How did you get the characters?\" and like and that was written in house or done everything in house. Uh I I don't know the the exact things,",
            "start": 168.16
        },
        {
            "text": "awesome. Like, I was like, \"How did you nail this so well? How did you get the characters?\" and like and that was written in house or done everything in house. Uh I I don't know the the exact things, but I mean I know that Nintendo made it. They they commissioned other people to work, but I mean it was a Nintendo project. They had it planned out and I imagine that this is what they're talking about. Like they're not talking about, hey, we make video games now. We're making movies. I think it's more like, you know, they would be producing the project, commissioning out other people that have the the skills and resources to do it. I know the anime the Star Fox one was made by like real anime houses that work like Bleach Naruto and all that stuff. Um, and I I really loved that. I thought it was amazing. I'm like, man, this I if I was little, I mean, I loved it now, but like if I was little, that's the type of [ __ ] that like I remember Nintendo Power would come with like comics every",
            "start": 199.6
        },
        {
            "text": "was amazing. I'm like, man, this I if I was little, I mean, I loved it now, but like if I was little, that's the type of [ __ ] that like I remember Nintendo Power would come with like comics every once in a while, like a Metroid comic or Star Fox comic, and I was like, [ __ ] this is this is awesome. And uh this the anime is like really one of those things where I'm like, man, I never thought that I' I'd see this type of thing. And I think that now we're finally at a place where media is is so making videos isn't a big deal. You know, we're almost at a point that making movies isn't a big deal. Like, people can just do it. Like, we could make a movie right now if we wanted to with a camera would be good. Oh, it would be good. But whatever. You know, a couple years ago, we couldn't do that. Colin does Dallas. Um Oh, yeah. I'd like to see that [ __ ] So, I I think that uh there's also been a lot of other rumors about Nintendo talking about making actual anime series. Will that go on",
            "start": 236.56
        },
        {
            "text": "Colin does Dallas. Um Oh, yeah. I'd like to see that [ __ ] So, I I think that uh there's also been a lot of other rumors about Nintendo talking about making actual anime series. Will that go on Netflix or this or that? Whatever. The distribution it it gets weird. So, when you say the real movie or direct to DVD, direct to DVD at this point is even more of an insult than it used to be. Yeah, it is. And that's what I I just don't want Aladdin 4 or Jafar Needs Glasses. I want like a real goddamn movie. Okay, first off, do not talk [ __ ] about Return of the Jafar or King of Thieves. Both [ __ ] awesome movies. There's no Aladdin 4. If there was, I'm sure it would be horrible, but two and three were dope as [ __ ] Um, but I think that when Nintendo, it's like, yeah, if they did direct to DVD, that would be an issue. But it's like if they made a Netflix movie, I think that could be really cool, really good even. And I think that we're in a in a place right now in 2016 when you look at CG",
            "start": 271.6
        },
        {
            "text": "that would be an issue. But it's like if they made a Netflix movie, I think that could be really cool, really good even. And I think that we're in a in a place right now in 2016 when you look at CG movies like it it kind of sucks that Russian Clank is seemingly not what it could have been. Um and it seems that it's awesome but it missed the mark of the game of what made the game special. It's like it didn't from I didn't see it but from reading the reviews it seems like it didn't kind of use any of the inventive weapons or kind of really hit on that level of the that's a big part of the game. What is Ratchet? Yeah. What is Ratchet and Clank? and they they missed the the mark on that. Um, I think that it's a little bit easier to to nail that with Mario and stuff because I feel like Mario is a little simpler than Ratchet and Clank in that regard. It is him trying to rescue the princess. That's the narrative. There's not that element that you can miss. You know what I mean? I get I I",
            "start": 308.72
        },
        {
            "text": "is a little simpler than Ratchet and Clank in that regard. It is him trying to rescue the princess. That's the narrative. There's not that element that you can miss. You know what I mean? I get I I worry about fleshing it out enough to make it a full-blown movie. That's the thing is like right now Princess Peach and Mario aren't indepth characters. There's not a lot of, you know, depth to them when you play these games, right? that it is like, \"Oh, hey, Mario. I'm making you a cake. Come over.\" And then she gets kidnapped and we go through all these worlds, right? But there's potential there. But I worry if Nintendo's there holding on too tight, do we ever get that potential where we're getting into who Mario is and all this stuff? They're like, \"Well, no, we don't need to know that. Just get him out there. Bowser's made this [ __ ] thing, a floating castle.\" But I think that's where it's at, though. I mean, I I think that we'd be crazy to think that we're going to get a fleshed out",
            "start": 351.12
        },
        {
            "text": "get him out there. Bowser's made this [ __ ] thing, a floating castle.\" But I think that's where it's at, though. I mean, I I think that we'd be crazy to think that we're going to get a fleshed out Mario movie that like I just want to know his motivations. I want to know what he's drinking from. I think the Mario game it needs to be simple. Well, it needs to be it's a kid movie, you know? It's like that movie I that needs to make a lot of money so that they can then make the the Zeldas or the Metroids or whatever. I honestly I think that the the best foot forward would to be to make the Nintendo movie. Yeah, I totally agree with you. Make the Lego movie of Nintendo kind of crossover that's going to end Nintendo is Sonic. Sonic is there. Call it Smash Bros. But it's Smash Bros. it's all the character like if they just did the plot of Super Smash Bros. Brawl, the single player campaign um and made that into a thing. There's some bad guy who doesn't matter who the [ __ ] it is. All the",
            "start": 387.76
        },
        {
            "text": "character like if they just did the plot of Super Smash Bros. Brawl, the single player campaign um and made that into a thing. There's some bad guy who doesn't matter who the [ __ ] it is. All the bad guys are getting together and fighting and then all the good guys come. They're all introduced. They at first they're kind of fighting but then they join up to beat the bad guy. Soul. Just don't ruin the trailer cuz everybody act like that was going to be a big reveal that the good guys were going to get together at the end. I think that I mean I'm a little more bullish about this thing, Greg. I think this is like an obvious win for them and it's shocking that they really I mean I know that they really got burned with the Mario game movie like you know a long time ago and and that they've been like really quite siloed away from kind of the realities of entertainment and they've been very prideful and they've been very insular with their IP. But I think that you know this can go in",
            "start": 421.2
        },
        {
            "text": "been like really quite siloed away from kind of the realities of entertainment and they've been very prideful and they've been very insular with their IP. But I think that you know this can go in multiple ways and I think that all the ways are pretty positive for them. They could do they could invest in a Pixar style Mario movie. And what would even be more interesting is if they really got in a bed with Pixar or they really got in a bed with DreamWorks or one of these big studios and was like, \"You guys do it and we'll we'll license it and we'll we'll we'll greenlight it.\" But like a studio that has talent that's going to it's going to be published by Disney or something like that and you have um a whole marketing arm, a whole marketing empire kind of behind it. I think that that movie can't lose. Even if it's bad, I don't think that that like a Mario movie like that can lose. I don't think they'll do that is my thing. I think Nintendo's too stubborn for this to let that much up. I",
            "start": 455.44
        },
        {
            "text": "can't lose. Even if it's bad, I don't think that that like a Mario movie like that can lose. I don't think they'll do that is my thing. I think Nintendo's too stubborn for this to let that much up. I think maybe things are changing though. I mean, I think that there's And that's the thing is I think I would agree with you except for the last year or so or last 18 months. They just are a little different now and or they're changing. I don't know if it's fast enough. I don't know if it's too late, but I really think that it's ch they're changing. the smartphone games is a really great sign that um while they're not for me and I don't give a flying [ __ ] about these games like Mitomo, a lot of people do and this is probably the direction they need to go in especially for the native market in Japan. And I think that when you really think about um what would be I think the smartest and boldest move for them and what I think would be a really exciting second or so like secondary or maybe",
            "start": 492.72
        },
        {
            "text": "in Japan. And I think that when you really think about um what would be I think the smartest and boldest move for them and what I think would be a really exciting second or so like secondary or maybe even tertiary move once a Mario movie comes out or a Pokemon movie or whatever it might be would be um and I know that they've done Pokemon movies but you understand what I'm saying. Pokemon really was the last big marketing [ __ ] shotgun blast, right? When you really think about it, like card game, cartoon, movie, all these kind of things, like they really were all on board with that kind of [ __ ] So, there is that, but is I think Metroid's obviously the one that's ripest for the for for the picking in terms of real storytelling, a real movie with real people in it, not a cartoon. And this is one of those things where you can make a you can almost reverse engineer Metroid to be something that everyone's like, \"What the [ __ ] is Metroid?\" when they're in a movie theater and they",
            "start": 528.48
        },
        {
            "text": "this is one of those things where you can make a you can almost reverse engineer Metroid to be something that everyone's like, \"What the [ __ ] is Metroid?\" when they're in a movie theater and they realize like, wow, this is a game series from the mid 80s. This is awesome. Stars a female kind of heroine. Um, you know, she's she's sexy, but she's badass and she's [ __ ] killing all these monsters. Scarlett Johansson. Yeah, it could could be someone like that. Hopefully not. But but so to me, it's like I would love to see them do something bold like that because I think everyone kind of defaults to like, well, Mario and Pokemon. And I'm like, well, all right, those make sense. You can even do something with Donkey Kong, you do something Kirby. It doesn't matter. Like those are cartoons. Then you have something like Zelda, which I think is dangerous because what we really are losing sight of with Zelda, and I say this as a huge Zelda fan, is Zelda has no [ __ ] story. So, I don't think",
            "start": 566.64
        },
        {
            "text": "you have something like Zelda, which I think is dangerous because what we really are losing sight of with Zelda, and I say this as a huge Zelda fan, is Zelda has no [ __ ] story. So, I don't think you really want to go in that direction and like shoehorn things into a silent protagonist and all these kinds of things. It's just not going to I think people are going to look at it and be like, \"This isn't But I mean, that's what I'm the same thing with Zelda is the same thing I think with Metroid. I think Zelda has a better shot of it of being the one you put out there that is different. Link talks in this. it. I think the story makes sense in the terms of you have to unite all these artifacts that are spread out throughout these dungeons or whatever. And that's why you get all these different cool areas to go into fight and meet new characters, raise up this army or whatever. But that's the one like we always talk about in the way of like I think the echo chamber core audience, whatever",
            "start": 599.68
        },
        {
            "text": "cool areas to go into fight and meet new characters, raise up this army or whatever. But that's the one like we always talk about in the way of like I think the echo chamber core audience, whatever you want to call it, gives Zelda so much credit that it's a big deal to us. So, it should be a big deal. It must sell millions and millions and millions of copies. And it doesn't sells fine, does well. We're all excited about it. We love Zelda. But I think that could be the one where it could be the you get that in front of people and like the people who had no idea what Lord of the Rings were before Lord of the Rings came out. You could see people going like that trailer looks awesome and he's fighting that oneeyed spider and this is happening and he's [ __ ] knocking lightning bolts or whatever back at this redheaded dude. Yeah, I could go see that movie. Zelda doesn't have the resonance, but Zelda has and I don't want to say Metroid doesn't have the respect cuz I'm a Metroid fan, but",
            "start": 633.36
        },
        {
            "text": "back at this redheaded dude. Yeah, I could go see that movie. Zelda doesn't have the resonance, but Zelda has and I don't want to say Metroid doesn't have the respect cuz I'm a Metroid fan, but Zelda has like a like a like a Janiqua about it where people it's a little sacred to people I think and like I think it is what it is. And I think the exciting thing about Metroid, what I really want to see them do with Metroid, and that's why I'm confident Metroid is in an X launch title as well, is that they kind of probably realize that I mean, you want to talk about Zelda not selling great. I mean, a good example is like Skyward Sword was out sold by Uncharted 3, which was to me was like unbelievable considering the install base, considering the residents of of Zelda, considering that we hadn't, you know, people were not too happy with Twilight Princess, but it seemed like Skyward Sword just like didn't really do it. People sold 4 million copies, I think. But it with Metroid, Metroid sells",
            "start": 663.92
        },
        {
            "text": "you know, people were not too happy with Twilight Princess, but it seemed like Skyward Sword just like didn't really do it. People sold 4 million copies, I think. But it with Metroid, Metroid sells way worse, right? And that's why I think it's exciting because now they can have this thing where it's like Nintendo fans are excited about, the dorks and the nerds about Nintendo are excited about like, but then like they show it in the theater and it's got fine production value and it's a hundred million dollar movie and it's all these kinds of things and it's Metroid for a whole new generation or just a whole group of people that have no idea what the hell Metroid is, but it's a movie they can enjoy without any context for the games. And I think this is a great backdoor into like revitalizing that series and then figuring out what you can do with these IP that make a lot of sense. So, I really feel like what I'd be most excited about is yeah, a Mario movie will be interesting. I think",
            "start": 699.52
        },
        {
            "text": "that series and then figuring out what you can do with these IP that make a lot of sense. So, I really feel like what I'd be most excited about is yeah, a Mario movie will be interesting. I think they can I think that'd be easy. I don't think there is a plot problem there. I don't think you have to have a plot like that's like really very deep. I think you can do something you like I said cute with Animal Crossing or you know, whatever you want to do. I think Metroid's the one where they can make a serious good movie and they can really reap benefits from it that will reach back into their catalog and allow people to play those games again and and and realize that those games are great and let them kind of, you know, let Retro or another studio kind of run with the series and tell us and and give us a different look at Nintendo, something that's dark and serious. I mean, they've had the series since the very beginning of the NES, so it's not like this is a new thing for them, but See,",
            "start": 729.76
        },
        {
            "text": "give us a different look at Nintendo, something that's dark and serious. I mean, they've had the series since the very beginning of the NES, so it's not like this is a new thing for them, but See, that's like wave four, wave three or four, though, cuz that's what I was saying. Was secondary or tertiary? Yeah. Well, I mean, it'd be Mario and then it would be Zelda because Zelda starts to deal with that where it gets darker but it's so bright and so light and you can enjoy it and it's not all scary times and then Yeah. But I don't think we'll ever get to that. Yeah. No, I mean I it's this whole thing is crazy because So I mean they're talking about not doing any live action. So like it would all have to be cartoon. Yeah. That's what that's what I saw and that's all I'm saying is like my my hope is that they realize that that's probably a mistake, you know? I I just don't know if it is. But I agree with you that a live action Metroid would be awesome. I I don't necessarily think a live",
            "start": 765.44
        },
        {
            "text": "hope is that they realize that that's probably a mistake, you know? I I just don't know if it is. But I agree with you that a live action Metroid would be awesome. I I don't necessarily think a live action Zelda would would work that well. Um I think that an ICG one could. Um but I I just think that it's it's too hard to do that right is my problem is like it's like Lord of the Rings. Yeah, if it's Lord of the Rings, [ __ ] yeah, but it's not going to be. And I think if it was a Netflix show, like we said a long time ago, I'm totally cool with that because there's a different level of quality associated with that and you have more time to explain things and the budget is just different. If a Zelda live action movie was in theaters, I can't imagine it looking right or feeling right. And every I would put CG and I think that I mean that that's where that's what I'm doing with the Zelda movie. I'm not jumping out into live action. I'm staying away from that in general with my pitches or",
            "start": 796.4
        },
        {
            "text": "I would put CG and I think that I mean that that's where that's what I'm doing with the Zelda movie. I'm not jumping out into live action. I'm staying away from that in general with my pitches or whatever. But the problem is that I just and I think it would have a better shot just in the fact of like when a kids movie comes out, I just don't give a rat's ass. And so like when Mario comes out, I know it's going to be a kids movie unless they're getting into his drinking problem. And then but so like when that comes out, it's just like that's not doing anything to push it forward. Whereas I think a Zelda movie can go both ways. It can it does expand out. You've seen the one IG put up the fake trailer for the Zelda movie like the way everyone freak the [ __ ] out. That would still be there. Yeah, but I think and I I totally agree with you. I think a CG Zelda is is the right move. But a perfect example what I'm saying is that Zelda trailer. If you look at it now, I mean it's it's [ __ ]",
            "start": 832.96
        },
        {
            "text": "Yeah, but I think and I I totally agree with you. I think a CG Zelda is is the right move. But a perfect example what I'm saying is that Zelda trailer. If you look at it now, I mean it's it's [ __ ] It's really like it it looks it's what as excited as you were back then, it was more of the idea, right? And back then it was novel and fresh and that was crazy. But now it's like oh god this is really rough. Uh you saying Pokemon I don't even know why. Like I didn't even that didn't come to mind. Like the Pokemon movies it's different because Pokemon is a cartoon you know already and like those movies were I don't look at them as video game movies. They're they're cartoon movies. You know what I mean? Sure. That was just my example of the really the only time since Captain N where they which was like what I grew up with where they were like let's just [ __ ] do it you know like like everything like cuz you know you were younger maybe not even born but like there was a Nintendo at one time",
            "start": 867.2
        },
        {
            "text": "like what I grew up with where they were like let's just [ __ ] do it you know like like everything like cuz you know you were younger maybe not even born but like there was a Nintendo at one time that was like all about merch and all about licensing. I had [ __ ] Legend of Zelda cereal. I had Super Mario Brothers cereal. I had a [ __ ] Zelda lunchbox. I had all these things that just are unheard of really unless you go to like the Nintendo store or something like where these were quite ubiquitous when I was a kid. And um Pokemon to me like from like 98.99 till like the early 2000s. That was an example to me. I I remember I had my Team Rocket action figures just on my computer monitor and I was like this is I would never be able to even get my hands on something like this unless I went to Japan unless I I went to like like specialty shops or got my Funko Pop whatever like whatever it is. In other words, these were just more ubiquitous. I had my Zelda figures. cuz I had like all these",
            "start": 904.56
        },
        {
            "text": "Japan unless I I went to like like specialty shops or got my Funko Pop whatever like whatever it is. In other words, these were just more ubiquitous. I had my Zelda figures. cuz I had like all these kinds of things. And I think you're off about that. Like if you go to a toy store or even a Target, Nintendo takes out a surprising amount of like the action figure. I only see amiibo when I besides amibo there's Yeah. non non video game stuff. Like there's there's like it's surprising to me that there's so much Diddy Kong action figures and Samus and Link. Yeah, I know, right? But I mean it's it's pretty it's way more sucks. Can we just say it? Way more expensive than I thought. Like there's Star Fox and stuff like Oh, that's pretty cool. Yeah, I didn't know that. What I'm saying is like they really were all about like pushing an IP um with Pokemon and that made sense and they they made a lot of money. Um and I just think it's see Nintendo needs to change and I think that they're starting",
            "start": 944.08
        },
        {
            "text": "really were all about like pushing an IP um with Pokemon and that made sense and they they made a lot of money. Um and I just think it's see Nintendo needs to change and I think that they're starting to realize that they need to they have to le leverage their IP and their licensing. They are just not going to be the Nintendo that they were ever again. And anyone who thinks that that's going to happen is wrong. They're done in that respect. like they're not going to be this powerhouse of 50 million, 70 million, 80 million, 100 million selling consoles. It's not going to happen anymore. So, you need to you need to figure out ways to like leverage those things. And since they refuse to go third party, which would be obviously the salvation to that company obviously, um I think that they have to start like getting really comfortable with just heavy licensing. the fact that there's not like a Nintendo like theme park in the United States or like that they haven't buddied with someone in an",
            "start": 980.4
        },
        {
            "text": "to start like getting really comfortable with just heavy licensing. the fact that there's not like a Nintendo like theme park in the United States or like that they haven't buddied with someone in an intimate way whether it was Universal, whether it was Disney or whoever they're working on it. Oh, they are. Okay. So, Oh, yeah, that's right. So, like the fact that like why didn't that happen in 1990? Yeah. Like, this is what I'm saying. Like, why didn't like why isn't there a Nintendo channel like a really like like on television? Like why didn't they like become this ubiquitous thing? like they just let it go and I don't and it's just kind of it's kind of crazy how this company really like the like the QC score kind of aspect of this company has changed so much I think in a in a way Mario and and they just kind of like threw it away and uh they the thing is that they have this IP and they're always going to have it and so they should leverage it in as many ways as possible and I think",
            "start": 1019.36
        },
        {
            "text": "and and they just kind of like threw it away and uh they the thing is that they have this IP and they're always going to have it and so they should leverage it in as many ways as possible and I think that's going to be smart for them to do. I think that a Mario movie made by Pixar would make hundreds of millions of dollars in profit. And um I think that um allowing them to do secondary and tertiary moves like making a Metroid movie and taking risks. Um because I'll tell you right now with all these people that are talking about how much money they have, they can't take too many risks. They if they start dumping money into these projects and they fail, they're going to have no money. So I don't know. It'll be interesting to see how it all pans out for them. I'm rooting for them. But and the crazy thing we're talking about with distribution platforms is like what if the NX is the distribution platform? Mhm. I hope not. I think that that's a that's a bad move. I They need You're what",
            "start": 1059.28
        },
        {
            "text": "the crazy thing we're talking about with distribution platforms is like what if the NX is the distribution platform? Mhm. I hope not. I think that that's a that's a bad move. I They need You're what you're saying is right that they need to use their IP to get out to different people to have them come back for the games. Um I think the CG rout's amazing. I I wish that Pixar would be involved. They're not going anywhere and Disney's not going to be involved. They have too much [ __ ] going on. They have to make their own movies. DreamWorks, absolutely. I think this is something that would be right up their their alley. There's a whole bunch of other smaller um Jack Black is Mario. I mean, absolutely, though. I mean, that's I can totally see that type of [ __ ] happening. And again, like it's not like I'm looking forward to the Mario movie. Like that is going to be the kids thing. But I think that the the smartest call for them would be to do a Nintendo Lego movie style thing. Um",
            "start": 1094.96
        },
        {
            "text": "it's not like I'm looking forward to the Mario movie. Like that is going to be the kids thing. But I think that the the smartest call for them would be to do a Nintendo Lego movie style thing. Um Pokémon, even if they did a Pokemon movie that wasn't related to the the cartoon, I think that could obviously kill. I think that is the easiest win for them besides just Nintendo straight up. Mario's going to perform super well. I think Zelda is the next choice after that. I love the idea of a Nintendo cinematic universe that uh I actually think would work with DC's planning but in a way that DC's I don't think is kind of working out where if they started with the everyone's here and then kind of splinter out but splinter out in a way that they're not splintering out to then reeee up again. It's more just like now you go off in your own universe. Exactly. It's just like here who's introducing like everybody knows these Nintendo characters. You might not know the eight Fire Emblem characters.",
            "start": 1127.36
        },
        {
            "text": "more just like now you go off in your own universe. Exactly. It's just like here who's introducing like everybody knows these Nintendo characters. You might not know the eight Fire Emblem characters. you might not know um Captain Falcon or whatever, but here they are. And then if they ever get their own thing, whether it's a movie or a a 10-minute anime short on YouTube or uh a Netflix series or a one-off special, whatever it is, like I think that they have so many IP that work together in a in a way that we've seen with Smash Bros. Like, we can see these things that should clash somehow not clash because they're Nintendo. That's something unique to Nintendo and Disney. I can't think of many more other people like that. So I I'm excited by this, but it's the same type of thing where I'm like I remember when we heard about Crazy Taxi movies, that never happened. We've been hearing about Metroid movies for 20 years, you know, and like that [ __ ] never happened. So we'll see how this",
            "start": 1170.0
        },
        {
            "text": "like I remember when we heard about Crazy Taxi movies, that never happened. We've been hearing about Metroid movies for 20 years, you know, and like that [ __ ] never happened. So we'll see how this goes. That show about one that show. Yeah. Yeah. I mean, we've gotten so many fan films. I think that's actually like a bigger issue with this. And that's what I was saying about the live action stuff is that I think CG gives this [ __ ] a chance because live fan fan films have already let us see what these things could be in real life, right? So it's like unless they are super high budget and even then then we're getting Transformers, you know? It's like I think the CG is the right route because it's the only way that these things can really work and actually impress us. Otherwise, we're going to get let down 100%. We're just going to get a Splatoon movie. That is true. Yeah. I mean a if they made a Splatoon like cartoon that went like maybe not a movie but a cartoon and if that led to a",
            "start": 1210.56
        },
        {
            "text": "to get let down 100%. We're just going to get a Splatoon movie. That is true. Yeah. I mean a if they made a Splatoon like cartoon that went like maybe not a movie but a cartoon and if that led to a movie I think that they can turn that into a [ __ ] franchise. Yeah. Not for me but for some [ __ ] out there. Pair parent and his kids does love Splatoon. Absolutely.",
            "start": 1251.28
        }
    ]
}