{
    "id": 1755,
    "video_id": "t7riXr_HiR4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "How Long Do You Need To Play A Game To Know It Isn't For You? - Kinda Funny Gamescast Ep. 70 (Pt. 4)",
    "description": "How long do you need to play a game to know it isn't for you?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1463659204,
    "duration": 936,
    "transcript_chunks": [
        {
            "text": "Kind of funny Live 2 is happening May 28th and 29th. It's a two-day event. The first day is going to be a completely ridiculous stage show. What we have planned this year completely blows last year out of the water. And I don't even know how that's possible cuz we were really stupid last year and this year's somehow even stupider. Day two, it's going to be full day of meet and greets. We're hanging out with with all of us. A bunch of Roost teeth people are there. Funhouse people are there. Achievement Hunter. It's going to be a grand old time. There's going to be some games to play. There's going to be signings. It's just it's exciting. It's a really fun time. There's going to be exclusive merch. Oh yeah, there's definitely going to be exclusive merch. Go to kind of funny.com/tick to get your tickets today. There's a couple VIP tickets still available, so make sure if you want one of those, you act fast. Here we are. Topic four, as always, brought to you by the kind of funny forums. to",
            "start": 0.0
        },
        {
            "text": "tickets today. There's a couple VIP tickets still available, so make sure if you want one of those, you act fast. Here we are. Topic four, as always, brought to you by the kind of funny forums. to kind of funny.com/gamescast topic just like my dude Fallon Zion did. Hello to the host with the most and the two best dudes in video games. I recently picked up Dark Souls II after putting 5 hours into the game. I'm simply not into it. I find this odd because I thoroughly enjoyed Bloodborne, but Dark Souls is just not doing it for me. Some would say to give the game some time and to get let it get its hooks into you, but I wonder how long that amount of time should be. My question is, how much time should you give a game before walking away? I think five hours is even too long. Yeah, it's as much as you put into it, how much you want to put into it. Is it not working for you? It's not working for you. Yeah, it's not a huge surprise. What I heard for about Dark Souls 3I was that it is a",
            "start": 32.6
        },
        {
            "text": "much as you put into it, how much you want to put into it. Is it not working for you? It's not working for you. Yeah, it's not a huge surprise. What I heard for about Dark Souls 3I was that it is a little faster and a little more arcade. It might have taken a page from Bloodborne, but um and I like Bloodborne way more than I like Demon Souls or Dark Souls. I didn't play Dark Souls 2 and I didn't play three as I just said. So, but I think that you if like it's your time, man. Time's precious. You don't have nothing to prove to anyone. 5 hours is a lot of time. Like if the game's not connected with you, sell it back or return it and [ __ ] play something else. There's no shame in that. Dark Soul, I've said it before and I hate to say it again, but Dark Souls fans are so [ __ ] pretentious. Some of these people like in terms of like not understanding like that not this game isn't for everyone. It doesn't mean you're bad at games. It doesn't mean you don't like hard games. Doesn't mean",
            "start": 85.6
        },
        {
            "text": "Some of these people like in terms of like not understanding like that not this game isn't for everyone. It doesn't mean you're bad at games. It doesn't mean you don't like hard games. Doesn't mean any of those kind of things. Sometimes these games just great people and they don't want to play them. And I think he's probably one of those people. So I don't think there's any shame in that at games are diverse enough that you can't just say I like games and that's the end of it and you like every game that everybody likes. That's not how it works. You like different genres, you like different gameplay styles, you have to worry about it. Yeah. And it's interesting too cuz Dark Souls 3 and I feel like the dark the the Souls franchise has only gotten like broader and broader where so many people love it so much and uh I mean I just I haven't even really given it a all but I just I can tell it's not for me. Um but yeah, it's like if you if you try and it's not for you like it's whenever",
            "start": 118.72
        },
        {
            "text": "love it so much and uh I mean I just I haven't even really given it a all but I just I can tell it's not for me. Um but yeah, it's like if you if you try and it's not for you like it's whenever that moment is seems like you already hit it like that's when it is. I wouldn't put any time limit on it. It's more case by case, game by game. Um, obviously I think RPGs take a bit longer to get into. Like story based things, you got to give it the time to get hooked on the story. You need that first act. I think at least whatever that means, whether it's an hour or five hours or 10 hours, like you got to get past that point. Um, but if it's really not hooking you, hey, no shame in that at all. Lionheart says, \"Hey guys, recently Sony revealed that the PS4 has sold 40 million units, and as usual, Microsoft is so hush- hush about their sales numbers of Xbox. I'm curious what your thoughts are on why that is. I know people who have bought both consoles, but can't find a reason to play their Xbox",
            "start": 148.16
        },
        {
            "text": "is so hush- hush about their sales numbers of Xbox. I'm curious what your thoughts are on why that is. I know people who have bought both consoles, but can't find a reason to play their Xbox and are unable to sell it. Do you think PlayStation has better quality exclusive games than Xbox? And is that the reason why the PS4 is so far ahead? Or is there another reason? It seems to me that games like Uncharted, God, Last of Us, and Ratchet and Clank are way more popular than games like Gears and Halo. Although I must admit that quantum break does look really good. Keep up the good work. A lot of stuff happen in that question. There is. There is. Why do you hide the numbers? Cuz you're losing. And since you don't have to share them, why would you share them? Because then the story just becomes how far behind PlayStation you are. Mhm. Um is it the exclusives? Is that what does it? No, that is not at all. If that was the if that's how it was, then PlayStation 3 would have [ __ ] dominated",
            "start": 190.88
        },
        {
            "text": "how far behind PlayStation you are. Mhm. Um is it the exclusives? Is that what does it? No, that is not at all. If that was the if that's how it was, then PlayStation 3 would have [ __ ] dominated Xbox from the the jump and gone. Just like the PlayStation 3's failure is the Xbox One failure of we got off on the wrong foot. We came out and said all the wrong stuff and we really alienated everybody. And meanwhile, the competition, in this case, PlayStation 4, came out and said, \"We [ __ ] up last time. We're all about games. It'll be easy to get games on this thing. Let's play games.\" And Microsoft said, \"TV TV, Xbox, Xbox, cable, sports, this, that, but it was like nope. Nobody wanted that. Oh, you can't you have to be online all the time and this that. We're changing everything you know about how you connect with games and your profile.\" And everybody went [ __ ] no. And flipped out before they had the real information before they ever got to try it. That's what the internet does, of",
            "start": 221.6
        },
        {
            "text": "how you connect with games and your profile.\" And everybody went [ __ ] no. And flipped out before they had the real information before they ever got to try it. That's what the internet does, of course. Yeah. And so that's how it happened. It wasn't I mean that's the whole thing is like how we're just, you know, Uncharted is the first first party amazing exclusive you need to have. And how long has the PlayStation 4 been out long? It's like no, it's not. I mean, yeah, Bloodborne was there and there was, you know, Second Sun. Yeah. Kill Zone. Like there's been games you can only get there, but there haven't been games, I think, like Uncharted that move units. Yeah, I agree. I think that I mean we've we've gone over this kind of ad nauseium, but it's it it really shocking how much it doesn't have anything to do with first party games because if it did, Microsoft would be winning cuz uh I think that their output until recently has been better. Um I don't think that any a bunch I don't",
            "start": 260.08
        },
        {
            "text": "have anything to do with first party games because if it did, Microsoft would be winning cuz uh I think that their output until recently has been better. Um I don't think that any a bunch I don't think that any of these games are more popular than Halo or Gears, but uh and I think Gears is going to be a huge game. Gears 4, I think it's going to be huge. But um but I think that it is about the messaging. It is about the zeitgeist of like rolling the the ball down the hill or the rock down the hill and just watching it accumulate um you know debris as it goes down and like I think that that's what happens. Sony just really lapped Xbox from the very beginning and they've never caught up and the number so Microsoft's numbers are probably between 20 and 25 million which are very respectable numbers but not when you're facing something that's selling 40 million in counting. So I think that you know I think it has to do a lot with messaging a lot with optics and a lot less to do with the",
            "start": 296.72
        },
        {
            "text": "numbers but not when you're facing something that's selling 40 million in counting. So I think that you know I think it has to do a lot with messaging a lot with optics and a lot less to do with the games because the games 95% of these cataloges are ex identical. Yeah. So, did you did they release uh numbers last gen? Who? Sony. Microsoft. Both of them. Microsoft did. Sony would occasionally. But the gap wasn't this bad. That's what it is. So, it's not so much as usual. Microsoft's not releasing their numbers. Just this time they're not. Well, as I think he means I I could be wrong, but I think as usual, meaning this generation like they have not announced numbers, I think in like over two years. Um, so that's that that is extraordinary. There's no reason to, but I think that there they they have to figure out a way to spin it that's respectful to them. I would announce the numbers and be like, look, like we're still trending around Xbox 360, not ahead of Xbox 360. 25 million units is",
            "start": 333.68
        },
        {
            "text": "have to figure out a way to spin it that's respectful to them. I would announce the numbers and be like, look, like we're still trending around Xbox 360, not ahead of Xbox 360. 25 million units is nothing to scoff at. That's more than GameCube sold. That's more than the original Xbox sold. That's more than, you know, that we're creeping on N64. Like, you're talking in terms of how human beings speak to each other when when it's just going to be the Twitter headline. Xbox 50% behind PlayStation 4. You know what I mean? That's why they don't do it. That's that's the optic of it. And I think that, you know, the unfortunate thing for Microsoft is that the United States is their most successful market and they're doing fine here, but um Sony mitigated a lot of struggles in the United States with like a lot of success in emerging markets and a lot of success in Western Europe and in Eastern Europe, a lot of success in Japan obviously. So even though PlayStation 3's sales seemed soft, they",
            "start": 374.72
        },
        {
            "text": "like a lot of success in emerging markets and a lot of success in Western Europe and in Eastern Europe, a lot of success in Japan obviously. So even though PlayStation 3's sales seemed soft, they were never as soft as we thought they were. They were never as soft as they felt because we were really in the place where Sony was getting its ass kicked. But if you were in England or you were in Germany or you were in Japan, the PS3 era was a little bit different and a lot of people didn't play Xbox 360, Xbox 360 crash and burn in Japan, for instance. So Sony's able to spread the ball a little bit and they they did that last generation to keep the it was they were never getting beat by that much. Um and they're pretty much in par about 80 million each now. Um so for this like yeah it's a difficult thing for Microsoft but that's why they're doing it is because there's no reason to and I think that maybe the numbers will come out. The numbers do sneak out in weird ways though from other",
            "start": 408.56
        },
        {
            "text": "thing for Microsoft but that's why they're doing it is because there's no reason to and I think that maybe the numbers will come out. The numbers do sneak out in weird ways though from other Yeah, he'll say something about how many total consoles are in the market right now. Keegan Andrew says, \"Hey gentlemen and Tim.\" Ah, I got you. Yeah. Regarding my Wii U, I have a Wii U and I don't remember the last time I played it. I loved it when I first got it, playing all the hot games like Mario Kart, Captain Toad, and so on. My question is, should I wait to sell it or get rid of it closer to the NX launch? Nope. I know GameStop likes to give extra credit when you trade in a console from old gen or should I get rid of it now? I'm sure I could sell it on Craigslist for more money. Don't sell your hardware. That's my my advice. I never sell hardware. Yeah. My thing is I I'm a big fan of even specifically Nintendo hardware. I'm gonna keep that [ __ ] I would keep it alone if we're playing games",
            "start": 446.32
        },
        {
            "text": "hardware. That's my my advice. I never sell hardware. Yeah. My thing is I I'm a big fan of even specifically Nintendo hardware. I'm gonna keep that [ __ ] I would keep it alone if we're playing games like Smash Bros and Mario Kart that like the games that don't die on Nintendo consoles um until there's NX ports hopefully of all of them and you can just use that and put that the Wii U away in a closet. Having said that, do not sell your Wii U on Craigslist. You're not going to make any money off of that. You'll maybe make like 100 maybe 150. It's not even worth it at that point. Well, you're talking about the GameStop trade in. Absolutely. If you're going to get rid of the console, do that. They give weird ass things where it's just totally worth it. If you're planning to get an NX, wait, wait. So, trade it in now or wait for later? Wait for wait for later. I think that that's GameStop are desperate. They we've we've seen it time and time again in the last couple launches where it's",
            "start": 480.96
        },
        {
            "text": "wait. So, trade it in now or wait for later? Wait for wait for later. I think that that's GameStop are desperate. They we've we've seen it time and time again in the last couple launches where it's like they will give you when I say obscene amounts, I mean like shocking for what their trade values are. Bonus trading credit. There's all these like bonuses that if you play it right and you do it the right time, right week, yeah, you can really get a nice deal on upgrading a console and like get half off the console and that that's that's going to be way more more worth it than getting $100 now. I think um but also I do think you should keep the console because don't sell hardware. Don't sell hardware even though I mean there isn't anything coming out for it. If you're planning on getting the NX, like you're going to be playing Zelda there, so um you don't necessarily need it, but um I'd keep it. Anoyer says, \"Hola, it's Spanish for hello. Ask Kevin for the correct punctuation if if need",
            "start": 517.28
        },
        {
            "text": "NX, like you're going to be playing Zelda there, so um you don't necessarily need it, but um I'd keep it. Anoyer says, \"Hola, it's Spanish for hello. Ask Kevin for the correct punctuation if if need be. Long time first time. How much experience do you have playing freeto-play games, and what takeaways do you have about them? What would it take for you to try a new free-to-play game?\" Almost no experience at all. I'm totally averse to the whole model. But you like you played Plans vs. Zombie 2? I did, but I refused to pay anything in it, right? I would have gladly paid them $20 for that game, but since they made me not pay for it, I was like, I'm not paying any [ __ ] Um, and it ruined the game. It It kind of like plans for I was so excited for Plans vs. Zombies, too. Like through the roof excited for it. And uh yeah, it annoyed me. I have no experience. I'm totally averse to the model. The model is predatory. The model is wrongheaded. It's [ __ ] stupid. People should pay for their",
            "start": 555.12
        },
        {
            "text": "excited for it. And uh yeah, it annoyed me. I have no experience. I'm totally averse to the model. The model is predatory. The model is wrongheaded. It's [ __ ] stupid. People should pay for their games. It is destructive to the way we pay for games. It It sets expectations that games shouldn't cost money. Um, it has an extremely destructive nature on all the games around it. Um, and if you don't believe me, ask the thousands and thousands and thousands of developers that have gone out of business trying to release their games on iPhone. Like, I don't know, you know, I don't know what else to say about that. Like, I I think it's totally ridiculous. I hate I hate that model. I think like uh anything else, there's plenty of bad examples of it. I think there's good ones, too. Um, my experience with freeto play limited when you when I think about it at a very top level, right? bunch maybe an iPhone game here or there, but then in reality like I was DC Universe after that went free to",
            "start": 595.52
        },
        {
            "text": "with freeto play limited when you when I think about it at a very top level, right? bunch maybe an iPhone game here or there, but then in reality like I was DC Universe after that went free to play. Kept playing that. I kept paying for it. I'm one of those white whales they always talk about, right? Who every year gives them the whatever the 150 bucks subscription like, \"Yeah, okay. Load the game. Great. I've had, you know, 600 700 hours of great times in this.\" And I think in a experience like that, they always I thought they did free to play correctly. Granted, again, I wasn't free playing ever, but how it worked of download this, try I mean like that was, you know, their salvation when the PlayStation 4 came out. the fact that they were at a la they were there to launch and they were free and so so many people jumped in. You just saw with Xbox One they just launched the Xbox One version. So many people jump in and sure a lot of people jump in are like not for me. This isn't what I",
            "start": 631.44
        },
        {
            "text": "and so so many people jumped in. You just saw with Xbox One they just launched the Xbox One version. So many people jump in and sure a lot of people jump in are like not for me. This isn't what I want. But then there are the people who jump in like oh this is cool and then oh I do want more inventory slots or whatever. I've gone through the trial version and now I understand to keep the servers on to keep the game going to pay them back for the fun. I'll pay the subscription. Yeah. I mean, I I have a lot of experience when it comes to the mobile side of things. And I I think that uh it it to like Gray was saying, there's a lot of examples of it being bad, but I think there's a lot of examples of being really good. Uh I think that when it gets in the way is when it doesn't let you do what you're talking about. I hate not being able to just buy it if I wanted to buy it. Um unless the game is good enough that or not even good enough, like created in a in the right way that you're not",
            "start": 667.28
        },
        {
            "text": "you're talking about. I hate not being able to just buy it if I wanted to buy it. Um unless the game is good enough that or not even good enough, like created in a in the right way that you're not annoyed by pop-ups coming up asking if you want to buy all the time. If if the game is there and you have to go into options to do the microtransactions, I'm totally cool with that. When it gets in your way and it's like timed things of you can only play for this amount of time, I'm not into that at all and I think that's really bad. But I do think that there is a lot of good examples of games that when you get in there and it's just you're playing the game and if you want more, you can get more. They're going to keep updating. There's going to be a bunch of stuff. I think that I I there's a whole bunch of mobile games I've played that I've sunk many hours into and had a lot of fun that I would have never played if I had to pay $3 for it initially, but then after playing for a bit, I'm like,",
            "start": 701.12
        },
        {
            "text": "bunch of mobile games I've played that I've sunk many hours into and had a lot of fun that I would have never played if I had to pay $3 for it initially, but then after playing for a bit, I'm like, \"Oh, yeah, totally. Here's $3.\" Like, I want to buy it. Um, I guess that's that's the the difference between is not it's not so much the it's free to play, microtransactions get you through the game forever. I like it more when it's it's free to play, but then you can download the whole thing. Yeah, I think that I just don't want to underst understate the complete destructive nature of this model on gaming. Um, we were already in the $1560$60 era getting games cheaper than they've ever been. Um, and this convinced people that games should be cheaper and that games maybe shouldn't cost anything at all. And it's just been bad. It's been not good. And but has it? Cuz I feel like it's faded away. I remember when everything was going free to play and it was a big deal. This is at the same time",
            "start": 738.0
        },
        {
            "text": "at all. And it's just been bad. It's been not good. And but has it? Cuz I feel like it's faded away. I remember when everything was going free to play and it was a big deal. This is at the same time when mobile was going to eat our lunch and that was the like any war it fades but like there's still [ __ ] corpses all over the place, you know? I I think that it's it's it's all it's like we talk about with resources with game development. If you make a freetoplay game, you have to figure out ways to make to get people to like give you money. This takes away from design or this seeps into design. If you pay $60 for a game or $20 or $10 or $5 for a game, it's not seeping into the design of how to extract more money from you. You already got the money. You don't have to worry about that kind of stuff. It's fundamentally unsound, I think. And I'd love to see it go away. And I think that you I think that in some ways you are seeing it go away. In some ways you're seeing proliferate. Um but",
            "start": 776.24
        },
        {
            "text": "of stuff. It's fundamentally unsound, I think. And I'd love to see it go away. And I think that you I think that in some ways you are seeing it go away. In some ways you're seeing proliferate. Um but there are so many losers when it comes to this model and like only a few winners. And I think that says everything you need to know about it personally. Cool. Ladies and gentlemen, this topic brought to you by Total War. What is Total War? Warhammer, a fantasy strategy game of legendary proportions. Total War Warhammer combines an addictive turn-based campaign of conquest and empire building with explosive colossal real-time battles. All set in the vivid and incredible world of Warhammer fantasy battles. It's the perfect match. It's a marriage made in gaming heaven rich high fantasy world of perpetual war and massive battles that you find in Warhammer. Total War is a critically acclaimed epic scale conquestbased strategy game. So when you combine them, you get a gorgeous high fantasy",
            "start": 812.0
        },
        {
            "text": "of perpetual war and massive battles that you find in Warhammer. Total War is a critically acclaimed epic scale conquestbased strategy game. So when you combine them, you get a gorgeous high fantasy world of perpetual war and conquest on a colossal scale brought to life in hours and hours of gripping strategy gameplay. talking epic fantasy, Total War style. No one's done Warhammer or indeed fantasy like this before. From the personal skills of your character to 20,000 roaring orcs, no fantasy strategy game is this big and detailed. As a fantasy spectacle is, it is unmatched. If you're a PC gamer and not involved, you're missing out. Factions, there's three of them. All of them play very differently. Each race is wholly different with their unique characters, campaign mechanics, battlefield units, and play style. See below prefer the def the details up in that description. Deep but simplified gameplay, more emphasis on accessibility, clear, intuitive. It's good for you. It's good for",
            "start": 853.6
        },
        {
            "text": "units, and play style. See below prefer the def the details up in that description. Deep but simplified gameplay, more emphasis on accessibility, clear, intuitive. It's good for you. It's good for everybody. Release date May 24th, 2016. You can get that on PC or Steam if you are so inclined. Do you think that Roaring Orcs is a play on words like the restaurant Roaring Forks? Probably not. No, you don't think the guy wrote it and he's like, \"Oh, [ __ ] I ate at Roaring Forks today and then I made a Roaring Orcs tour in my PR press release.\" Ladies and gentlemen, thank you very much for joining us again on this first and last ever episode 70, the Kind of Funny Games cast. We'll see you next week. Hope to see you at Kind of Funny Live. Till next time, I love you.",
            "start": 888.96
        }
    ]
}