{
    "id": 1747,
    "video_id": "wxY6AFH-V7M",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Here's What The Last of Us 2 Should Be About - PS I Love You XOXO Ep. 36",
    "description": "Topic of the Show is what if Greg and Colin were President of Sony Worldwide Studios Shuhei Yoshida for a day, but a Last of Us 2 question really gets the duo going. (Released 05.17.16)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://youtu.be/P_o_j6v3PGE\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1463500804,
    "duration": 6150,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to PSI Love You XOXO episode 36. I'm one of your hosts, Greg Miller, alongside the Pride of Long Island, Colin Morardi. It's good to be here with you today. It's good to be here with you today as well. Um, what did you play this weekend? What have you embibed in? Uh, not much. You You played a bunch of stuff. Uh, you didn't get deep into stuff, but you played stuff. Yeah. You turned on Shadow the Beast for 30 minutes 30 seconds. Uh, no. I I uh I beat Shadow Complex 100% of that on PS4. How was it? How did it hold up? How everything? Yeah. The story is a little ridiculous, but yes, sure. But that's video games, but I mean like Well, no, not necessarily. There's a lot of ridiculous stories in video games. Sure, but not always. Yeah, I would think the majority though. Sure. But this is uh this game has potential to have a cool story, but that's not why you're playing it. Sure. So, very well designed. Is the story not good or is it just crazy and loony?",
            "start": 0.5
        },
        {
            "text": "though. Sure. But this is uh this game has potential to have a cool story, but that's not why you're playing it. Sure. So, very well designed. Is the story not good or is it just crazy and loony? It's just dumb. Okay. You know, it's just uh I mean, it's a story I should like, but I don't. Uh and then I played Doom for a few hours and I I really like it. Yeah. Um you going to get back to it? Yeah. No, definitely. I'll definitely get back to it. Um, and then uh I played Home Front, but very briefly, like an hour. Is Home Front out or do we have that super early? Homer's out this week. Okay. Okay. So, by the time this post exactly, um, doesn't run that well. Yeah. I didn't notice I didn't notice any technical hitches in it when I was playing, but I mean, I played really only through the tutorial, so I wasn't really like in the open world or anything, right? For me, I platinum Uncharted finally got it done Friday night. I played a whole bunch of multiplayer with the kids. Uh then yeah,",
            "start": 59.04
        },
        {
            "text": "so I wasn't really like in the open world or anything, right? For me, I platinum Uncharted finally got it done Friday night. I played a whole bunch of multiplayer with the kids. Uh then yeah, the next morning woke up, put in Doom, played the first two levels, like all right, cool. Like it run it's beautiful. It is a beautiful game. Runs super super slick, super well. Uh but like and I liked that it wasn't like shying away from what Doom is with like the [ __ ] heavy metal and the gruesome kills and stuff. And I was like, \"All right, cool.\" Not I'm not a shooter guy really. I just wanted to see what it was like. I'm out. Put in Homeront. Got barely I probably right where you are in terms of tutorial where I was like, \"Oh, these cut scenes are this this story is weird. I liked Homefront One story so much and this doesn't seem like a Homeront one story. This is a bit more weird. Yeah, it's uh it's all about the corporation and I don't want to ruin it for people but sure. Well, I mean the",
            "start": 99.68
        },
        {
            "text": "story so much and this doesn't seem like a Homeront one story. This is a bit more weird. Yeah, it's uh it's all about the corporation and I don't want to ruin it for people but sure. Well, I mean the first North Korean corporation that basically like the premise of the story is what if and it's a ridiculous what if, but what if North Korea um what if the Silicon Valley and like the revolution that happened in the 70s in California happened in the Koreas, right? And we we imported all their stuff. We took all their stuff. It's kind of a like we were talking about an you know analog to China, right? Yeah. I mean that's the diff that's what's so [ __ ] stupid about this is that so we we talked about Red Dawn the remake which was supposed to be about China. Then they had to go digitally alter all the Chinese flags to make them Korean flags because they don't want to offend their in China sell China movies. That's a big deal. That's a big deal. Yeah. They don't want to offend markets and",
            "start": 134.24
        },
        {
            "text": "all the Chinese flags to make them Korean flags because they don't want to offend their in China sell China movies. That's a big deal. That's a big deal. Yeah. They don't want to offend markets and and investors in China because God forbid you say anything bad about China. I mean who you know we don't want any of that. Only we could be the bad guy and in movies. I think that'd be totally fine. Um so that's a little [ __ ] stupid to be honest with you. So, I I I don't know if what happened with the original Homeront. My assumption is that a similar thing happened. I think I might have known the answer to this question at one point. Um whether it was supposed to be about China and they made it about Korea, but nonetheless, um if they're going to reboot the entire idea of Homeront anyway because the original Homeront never happens in this game, then why not just reboot the idea of who the bad guy is, too? Because you don't have to like jump through hoops a million different ways to",
            "start": 174.56
        },
        {
            "text": "because the original Homeront never happens in this game, then why not just reboot the idea of who the bad guy is, too? Because you don't have to like jump through hoops a million different ways to explain how China and the United States come to blows. Do you have to explain a significant 50 or 60 year alternate history about how the United States succumbs to a small country the size of a midsize American state um with a population a fraction a small fraction of what we have in this country doesn't make none of it makes any sense from the outside that's why I'm interested in playing it because I I feel like they will explain it and the original home intro I thought was pretty good it wasn't as good as the intro to original homer way way more convenient sure but I mean this was like okay cool it sets up what you need to know go to run around and shoot [ __ ] things yeah like so when John Millius, I guess, wrote it, but some other guys wrote original Homeront. That was about Peak Oil",
            "start": 205.04
        },
        {
            "text": "cool it sets up what you need to know go to run around and shoot [ __ ] things yeah like so when John Millius, I guess, wrote it, but some other guys wrote original Homeront. That was about Peak Oil and all that kind of stuff. And that was actually way more convincing than basically a North Korean corporation creating back doors into everything they've ever sold us and no one noticing for decades. Like, I just I don't know. That rubbed me the wrong way when I saw that intro cuz I had not been privy to that intro until um I put the game in because they had been hiding it, you know, like they hid the original Homeront intro, too. So, I don't I I I want to play it more cuz I'm I'm intrigued by the idea. I like the way the game begins. It's very violent. Um which I believe that world would be. It's very dark. It takes place in Philadelphia, which I think is very cool. Cradle of Liberty. So, um we'll see. I mean, I So, I have no thoughts about either of those games in any major way. I",
            "start": 241.84
        },
        {
            "text": "be. It's very dark. It takes place in Philadelphia, which I think is very cool. Cradle of Liberty. So, um we'll see. I mean, I So, I have no thoughts about either of those games in any major way. I think Doom is exactly what I thought it was going to be, and I was so super happy to see that. Yeah. Um Homeront, I I don't know what it's going to be, and I hope that it's something that I like. Um but I'm not feeling super optimistic about it. Sure. Yeah. And then yeah, I put off till I was in the mood. Ratchet and Clank and I was in the mood yesterday. Had a great time with it. I told you. Fantastic game. I told you. No, everyone told that's not right. Everyone in the world. I said it before long before the bomb was even up. So who who else told you first? Who? Tim, I think during the last play. No, definitely not. No, really. It was It was you. Okay. Yeah, it was definitely me. Okay. Yeah. Um about Shadow of the Beast. Uh I actually turned it on with the intent of playing, but then I",
            "start": 279.2
        },
        {
            "text": "play. No, definitely not. No, really. It was It was you. Okay. Yeah, it was definitely me. Okay. Yeah. Um about Shadow of the Beast. Uh I actually turned it on with the intent of playing, but then I got a phone call and I had to go, so I just shut it off. Yeah. I didn't like get past the start menu. I didn't even start the game. um but not being very well reviewed and I'm I'm not sure like Polygon gave it a three. Now it's Metacritic's more like a six or a six and a half maybe maybe around there maybe even a seven but um probably lower than in the sixes. Uh but I always felt like this game wasn't going to be very good because Sony just hit it for so long. Yeah, it just came out of nowhere. It was announced before PS4 even came out and uh then just disappeared for almost three years. probably like two years and then they like kind of brought it out of hibernation like it still exists and here's what it looks like and stuff. So I just I'm just not even sure with all these other games",
            "start": 316.48
        },
        {
            "text": "like two years and then they like kind of brought it out of hibernation like it still exists and here's what it looks like and stuff. So I just I'm just not even sure with all these other games that I'm gonna be playing like when if or when I'll ever get to it because I have no love for that game. That's a very the original Shadow of the Beast 1989 and then came out on Amigga. We don't have an Amigga heritage in the United States and um so this seems to be a game more directed at the nostalgia of European gamers um which I respect and that's totally fine. So I don't know there's nothing there for me to be like well I really want to play this. The the thing that intrigues me is that the original Amigga game is in um the re-release. So, I would actually want to just play that. Just play to get to that part just to see like what that's all about cuz that's supposed to be a classic. Sure. Kind of platformer. So, um or sidescroller. So, um yeah, that's basically it. So, this week I I I",
            "start": 359.52
        },
        {
            "text": "to get to that part just to see like what that's all about cuz that's supposed to be a classic. Sure. Kind of platformer. So, um or sidescroller. So, um yeah, that's basically it. So, this week I I I would like to just get through Doom and Homefront and kind of clear those games out of the way because things are slowing down. We forget to see on the drop. I think that Valkyia Chronicles. Yeah, we've had Valkyia. We've had it forever. I really think February. Is it out today? The day of this posting? I think so. Oh, well then it's great. There you go. Yeah, it's Valkyia. It's totally Valkyia. I've played Yeah. People have reviewed it already. I've played a couple hours of it and I'm It's more Valkyia Chronicles. Well, it is Valkyia Chronicles, which is great. It's the same problem I always have even with games I [ __ ] love where it's like I'm playing I'm like, \"Oh, Welcon and Alician. It's back.\" And I'm playing and it's like, \"Oh, yep. I remember this. I remember all this.\" And that",
            "start": 389.68
        },
        {
            "text": "have even with games I [ __ ] love where it's like I'm playing I'm like, \"Oh, Welcon and Alician. It's back.\" And I'm playing and it's like, \"Oh, yep. I remember this. I remember all this.\" And that makes it very hard for me to be like, \"Now I'm going to dedicate 20 hours to playing it or whatever.\" Tell me so tell me this. Is it cuz I've never played Valkyrie Chronicles but beyond in a cursory only a cursory way but it's a game that's right up my alley I think. Yeah. No, you'd like it. It's turnbased grid based strategy. It's not grid based as much. It's turnbased. Yes. Where you do you you know move your whole team around then you're you end your turn and then they move their whole team around. You have command points. When you spend a command point on a troop, you can then move them and you have a movement bar. So it goes from whereas grid brace, you know, it's like XCOM, right? we draw the line and go like that which I don't like. Yeah, this is not that. And this is one of the",
            "start": 423.92
        },
        {
            "text": "and you have a movement bar. So it goes from whereas grid brace, you know, it's like XCOM, right? we draw the line and go like that which I don't like. Yeah, this is not that. And this is one of the reasons I think I got so hooked on it at when I started the franchise however many years ago now. Um is you take over the character in the third person perspective which I love and then you can run however you want wherever you want as long as you have the movement bar up there but you can [ __ ] yourself and make you know waste [ __ ] yourself in the game. Yeah. Oh yeah, totally. Take the turn the gun around. No. and then uh you can just run off, you know, spend movement you shouldn't have done. Whereas like XCOM kind of or like a grid based would lock you in a way where it's not like you're going to run out of movement points or whatever. This time you could easily like burn off a whole bunch of movement points before you get where you need to be. And what about like equipment and all",
            "start": 464.4
        },
        {
            "text": "going to run out of movement points or whatever. This time you could easily like burn off a whole bunch of movement points before you get where you need to be. And what about like equipment and all that kind of stuff like guns and such? You buy things like armor and equipment and all this. Yeah, I mean you have different classes of people and this is like and you can change classes not on the Well, I mean you can set you have different classes and they're given to you in terms of what's going out, right? Because I think Valkyia Chronicles 2 was a big deal that that I'm not sure of anymore. It's been too long because I played this like we've had it for a month and a half and I played the first night I got it. And is it nonlinear back? You can go back and replay missions and there's optional missions. Um side quest or side miss? I don't think there's side missions in terms of that. I mean like it plays out like a story book. You're going you're not selling super well for me. Well, I",
            "start": 500.24
        },
        {
            "text": "missions. Um side quest or side miss? I don't think there's side missions in terms of that. I mean like it plays out like a story book. You're going you're not selling super well for me. Well, I mean I'm also really rusty again. I haven't I have not committed to them. No, I think that's definitely the opposite of what everybody thinks about Chronicles. Sounds like a bad game. No, I don't think that's that's the case at all. So, maybe I'll get to that eventually as well, but I don't really have time for bad games. So, sure. Um, yeah. So, that's basically all she wrote. Okay. If you didn't know, ladies and gentlemen, this is kind of funny.com's PlayStation podcast. PS, I love you XOXO. We post it every Tuesday at 9:00 a.m. Pacific time on kind of funny.com, of course, which is youtube.com/kindfunnygames as well, and podcast services around the globe as an MP3. So, make sure you like, subscribe, share. I mean, get it wherever the hell you get it and just enjoy yourself. All right, let's",
            "start": 533.52
        },
        {
            "text": "as well, and podcast services around the globe as an MP3. So, make sure you like, subscribe, share. I mean, get it wherever the hell you get it and just enjoy yourself. All right, let's begin the show with what is and forever will be Roper Report. Time for some singular possessive news. There are 17 items on a baker's dozen. A lot of news today this week, but a lot of like financial news and things of this nature, but we'll start with the most interesting of all, I think. Number one, PlayStation 4 was once again the bestselling game console in the United States this time for the month of April 2016. Now, why does my mouse not work? Like, my mouse is kind of like, you know, it's a thing here where There we go. Yeah, I don't know. Uh, in addition, MPD's reported the top 10 bestselling games for the month at retail in the US. They are in order Dark Souls 3, Ratchet and Clank, MLB 16: The Show, The Division, Grand Theft Auto 5, Minecraft, Quantum Break, Call of Duty Black Ops 3, NBA 2K16,",
            "start": 575.44
        },
        {
            "text": "for the month at retail in the US. They are in order Dark Souls 3, Ratchet and Clank, MLB 16: The Show, The Division, Grand Theft Auto 5, Minecraft, Quantum Break, Call of Duty Black Ops 3, NBA 2K16, and Star Fox Zero. Of the multiplat games, Dark Souls 3II, The Division, Grand Theft Auto05, and NBA 2K16 sold best on PS4, while Minecraft and Call of Duty: Black Ops 3 sold best on Xbox One. Ratchet and Clank and MLB 16: The Show are PlayStation exclusives. The show sold better on PS4 than PS3. Novita version this year. And Quantum Break is an Xbox One exclusive, and Star Fox Zero is a Wii U exclusive. So, uh, many congratulations to Rash and Clank, which uh, sold exceptionally well, and I assume I assume surpassed their expectations, but who knows if that's true or not. Number two, Hideo Kojima has given an interview with Japanese magazine Famitsu is translated and passed along by Silicon era that sheds some light on how his deal with Sony came together and what we might expect from",
            "start": 620.08
        },
        {
            "text": "Kojima has given an interview with Japanese magazine Famitsu is translated and passed along by Silicon era that sheds some light on how his deal with Sony came together and what we might expect from the new game. So instead of like kind of boiling this down, I'm just going to go and read the questions and answers. Okay, I'll love it. Again, this is from Silicon era. The question from positsu says, \"After leaving Konami, you immediately opened a new studio, but did you actually want to take some time off?\" He says, quote, \"I did want to get some rest, but taking some rest means my life tempo will go out of order, and nobody would forgive me for that. I'll need about a year to warm up. As for now, we made the logo and web page been at a temporary office.\" End quote. Thank you, Kojima. Um, he says, \"About the logo, quote, I can't say yet, but the secret is found in the logo. The whole body of the logo actually looks super cool, and we're planning on making it into a figure.\" And I think",
            "start": 667.68
        },
        {
            "text": "says, \"About the logo, quote, I can't say yet, but the secret is found in the logo. The whole body of the logo actually looks super cool, and we're planning on making it into a figure.\" And I think he's talked more about this since, but there was a whole bunch of u terrible photoshops he was retweeting yesterday of the logo being put on all manner of body. Uh, the reason for making the first title with Sony quote, \"This is my favorite.\" Okay, this is awesome. Okay, I've had offers come from all around the world, but they all work in Hollywood method, and I didn't feel like doing any kind of detailed presentation. That's when I was wondering who would trust me in with trust who would trust me with just a rough concept. And that's when I found Sony. They're giving me a vast amount of freedom, which makes it very easy to work with. End quote. It's an amazing answer. That's awesome. He's basically saying, I I didn't want to do anything. I don't even know what I'm I didn't feel like",
            "start": 704.0
        },
        {
            "text": "freedom, which makes it very easy to work with. End quote. It's an amazing answer. That's awesome. He's basically saying, I I didn't want to do anything. I don't even know what I'm I didn't feel like working that hard. I didn't do want to take the time off, but I didn't want to throw out my work cadence either. That's an amazing answer. Good for him. Very honest. [ __ ] it. He's Kim. He can do whatever the hell he wants to. About his new title. Quote, \"It's an amazing game. Along with the plot, characters, and game system, I'm brainstorming everything equally. Some parts are very new, so I'll need to experiment with it. I won't say that it's an open world title, but those that enjoy playing today's AAA titles such as The Division and Uncharted, will be able to play it smoothly. When it gets announced, some may think it's not it's not as way out as they had expected, but I'm sure they'll understand once they play it. The genre is action.\" End quote. And then about VR, quote, I'd like",
            "start": 740.4
        },
        {
            "text": "announced, some may think it's not it's not as way out as they had expected, but I'm sure they'll understand once they play it. The genre is action.\" End quote. And then about VR, quote, I'd like to make something for it, but we don't have anyone. I believe VR holds a key to game development. VR gave me a close sense of when I played on the Famicom as a child. I definitely believe that a new world will be born. And that quote was added by Yoji Shinawa, who's the artist at Kojima Productions. So, there's that. Some tidbits, little bit of stuff there. Yeah, you'd expect action from Sure. I just like the whole like I didn't want to make a presentation. I didn't want to go in and to talk to anybody. I just called up Shu. Can I have some money? Great. Done. It's a pretty awesome answer. Number three, Disney Infinity has been discontinued in the studio responsible for the series, Utah based Avalanche Software, not to be confused with Avalanche, the studio behind MadMax and Just Cause, which",
            "start": 768.48
        },
        {
            "text": "three, Disney Infinity has been discontinued in the studio responsible for the series, Utah based Avalanche Software, not to be confused with Avalanche, the studio behind MadMax and Just Cause, which is fine, has been closed. The closure of the studio and elimination of the IP will cost Disney $147 million, and around 300 people lost their jobs as a result of the decision. Disney will no longer be publishing video games, according to Ben Fritz of the Wall Street Journal. So, our very best goes out to those that lost their jobs, of course. Um, lots to be said about this, by the way. Lots of stories about this circulating on Kotaku and other places about what the what happened behind the scenes, Disney's decision, why they made this, and what was going to be in in Disney Infinity 4.0, which sound awesome. Disney Infinity 4.0 sound like the Disney Infinity everybody wanted from the jump. We'll get that in a second. Brown Bear wrote in to kind offunny.com/psq just like you can to get your",
            "start": 809.2
        },
        {
            "text": "sound awesome. Disney Infinity 4.0 sound like the Disney Infinity everybody wanted from the jump. We'll get that in a second. Brown Bear wrote in to kind offunny.com/psq just like you can to get your question read and says, \"Hey Colin and Greg, is the discontinuation of Disney Infinity a big issue for the industry even with all the new Disney movies out there and some huge ones on the way? Is it make it isn't making enough money to be continued? Is this just a sign of the times and the way the industry is changing or should we be more worried?\" Thanks and keep up the good work. Kevin Brown from Ireland. Um, it's an issue. I think it's a I think it's a total I think this this toys to life thing is obviously a gimmick and I don't think it's going to be around forever. Well, how long's forever? I don't know. Probably not much longer. I mean, I think the only reason Lego We talked about this, I think Colin Gregor, maybe on the games. There's a detailed conversation about this. We don't",
            "start": 845.2
        },
        {
            "text": "I don't know. Probably not much longer. I mean, I think the only reason Lego We talked about this, I think Colin Gregor, maybe on the games. There's a detailed conversation about this. We don't want to retread it. There are some crossover listeners. Um, this is was predictable and Lego I think is the salvation of this simply because the Lego has more utility than just the on like the iname. This is what it comes down to, Greg. This isn't a cheap way to play games. And if this is really targeted at children, and it is, then this isn't a sustainable way to play games. Why do I have to buy a $60 game, or maybe more than that to buy the portal and all this kind of stuff, and then I have to buy toys to activate things that are in the game? It doesn't make any sense. when you have these robust experiences that are $60 out of the gate. Like, it's just it's all these extra steps. And I think that I mean, first of all, Disney had a significant write down on this of basically the equivalent of",
            "start": 886.32
        },
        {
            "text": "experiences that are $60 out of the gate. Like, it's just it's all these extra steps. And I think that I mean, first of all, Disney had a significant write down on this of basically the equivalent of three AAA budgets. Mhm. I mean, that's a lot of money. A lot of money. So, the capital investment in making these games is high. 300 people lost their jobs at that studio. So, there's a lot of people working on this game. And then there's it's not just the game and making the game. It's making the toys and QAing all that kind of stuff and molding it and finding retail partners and shipping more things. And you have to buy more things to sell more things. And there was one of these stories saying like that they ate like a million Hulk figures because they made too many of them. They anticipated that being super popular and didn't pay. So there's all these ways to [ __ ] up, right? And that was the thing is that the game from what they were saying was selling well. It was received well, but",
            "start": 927.2
        },
        {
            "text": "that being super popular and didn't pay. So there's all these ways to [ __ ] up, right? And that was the thing is that the game from what they were saying was selling well. It was received well, but it was the cost of making too many figures. And I think parents are going to become privy to this kind of thing because now there's a whole I don't know how many hundreds of thousands or millions of people that bought these games there that you know parents are being like, well, we got burned like this is over now and we could have chosen Skylanders and now Legos out and my kids are older now. Whatever. never doing this again. Yeah. And you just don't hear that about $60 games in a static sort of way. So, I think that the market's kind of catch catching up with this thing. Now, Skylanders was very profitable because it was first and Lego is going to be very profitable or is very profitable because it's Lego. But, I think that that's basically the end of the line. And as I said on the Games",
            "start": 959.36
        },
        {
            "text": "profitable because it was first and Lego is going to be very profitable or is very profitable because it's Lego. But, I think that that's basically the end of the line. And as I said on the Games Cast, it's stupid to have to buy these toys and put them on portals to unlock things in a game you already purchase. It makes no sense. If you if if in other words, if the entire amalgamation of things you needed to make the $60 game were all $60 in totality and the game was free or something like that, then that's a different story. But why am I buying these figures to put on this portal to unlock things in a game I already bought. And then how do parents receive that? Because you're the rarity, right? You're not the person that these games are made for. You're not, you know, maybe for Lego. I think I am for Lego. Disney certainly not. And Skylanders certainly not. No. Skylanders is a kids game and that's why Skylanders is from Lego game too that has more ubiquity. Sure. But I'm saying like",
            "start": 995.36
        },
        {
            "text": "I am for Lego. Disney certainly not. And Skylanders certainly not. No. Skylanders is a kids game and that's why Skylanders is from Lego game too that has more ubiquity. Sure. But I'm saying like Skylanders is directly aimed at children. There's no way around it. Lego is I think they understand how wide their audience is and that's why they go and double down on 808 ' 80s franchises and make those 80s franchises really good and not [ __ ] weak, which is the problem with Disney Infinity Marvel stuff. When I sat down to play Disney Infinity Marvel stuff, I was like, woo, this is shallow. This isn't a Spider-Man action, you know, RPG to an extent. You know what I mean? this isn't walking around like playing X-Men's Legends, which is what I thought it was going to be when I heard about it. You sat down, you played them, you're like, \"Oh, this game doesn't fulfill the promise of being these characters.\" Whereas with Skylanders, they're creating something from the ground for children, four",
            "start": 1032.0
        },
        {
            "text": "sat down, you played them, you're like, \"Oh, this game doesn't fulfill the promise of being these characters.\" Whereas with Skylanders, they're creating something from the ground for children, four toys. They can be carried around and split in half and kids can have a fun time and then smash them together and have fun. And then Lego is this thing where yeah, I think it's a great avenue of kids are going to love kids love Legos, kids love video games. Here we go. And like you know what I always talk about not to be you know the same drama I always do is like some of the problems the pain points you're pointing out are sub you know not a problem with Lego in terms of you buy the starter pack with your three figures in there and then anytime you run into something that you don't have the guy for you can hire a hero with in-game currency to go out and do it. don't need the figures, but if you want the figures, but I think the fact that they are it's Back to the Future and it's Portal and",
            "start": 1068.88
        },
        {
            "text": "for you can hire a hero with in-game currency to go out and do it. don't need the figures, but if you want the figures, but I think the fact that they are it's Back to the Future and it's Portal and it's all these adult it's all these adult nerdy things is speaking to the fact that they understand that that's in the humor in the game and the you know the I guess mainly just the humor and the storytelling of the game and the way how cool it is to see your favorite franchises from a kid mashed up speak more to I think me and Trevor Starky and everybody else I see tweeting me photos of their collection. And it's the same way too of like yeah I don't need Slimer but I bought Slimer to make sure I had him and that's wave five now. You know what I That's a game that I would have platinum and put away like every other Lego game, right? You figure when they sell me Lego Marvel, I sit down and I platinum Lego Marvel and then I put it down and never play it again and never put any more money",
            "start": 1103.12
        },
        {
            "text": "put away like every other Lego game, right? You figure when they sell me Lego Marvel, I sit down and I platinum Lego Marvel and then I put it down and never play it again and never put any more money into it. Maybe the DLC, but maybe not. Whereas this one I'm still buying and I'm super stoked to see if they're going to say anything at E3 about what their next waves are. What's interesting for me though is the takeaway I have from his question is, is it a big issue for the industry? I don't go the doom and gloom side of Toys Life. I think Toys Life still has a future. Is it forever? No, nothing's forever, I don't think. I mean, unless you're talking about like genres of RPG or whatever, but yeah, just like the music game, eventually nobody's going to want peripherals and all this other crap floating around their house. Um, is it a big issue for the industry? I think it's a I think honestly for me it's it sucks for everybody who lost their job. It sucks for all this stuff. I think the",
            "start": 1136.16
        },
        {
            "text": "floating around their house. Um, is it a big issue for the industry? I think it's a I think honestly for me it's it sucks for everybody who lost their job. It sucks for all this stuff. I think the silver lining is that it's an interesting business move for the industry. It is Disney saying, \"Cool, publishing games is hard and we don't want to do that. We want to go have partners that do all of that. We want to partner with Telltale for a Marvel game there. We've talked about it on this show. This rumor that Spider-Man, which is a Disney property now, is going to be made by Sucker Punch and be PlayStation exclusive, which sounds [ __ ] crazy, but in this world, that doesn't sound that crazy. That does sound like, man, we are done publishing games, everybody. We don't want to we we understand like look at what they've done with Star Wars. We're done publishing games and we want to do these franchises. Anything we do with Marvel or Star Wars or Disney, we want to do right and we want it",
            "start": 1169.76
        },
        {
            "text": "like look at what they've done with Star Wars. We're done publishing games and we want to do these franchises. Anything we do with Marvel or Star Wars or Disney, we want to do right and we want it to be awesome and we don't want the reviews we got for Infinity. We don't want people walking away saying it was almost there, but it wasn't there. So, [ __ ] it. We won't publish games anymore. We'll instead sign partnership agreements with we'll bring in the best people. So, what do we want to make? We want to make a Spider-Man game. Who does awesome Spider-Man stuff or open world superhero stuff? Sucker Punch. And that I mean granted we're way out into hypothetical situation right now, but that's an exciting business move for me the gamer. And I don't mean it as the PlayStation guy. I mean it as somebody saying like, \"All right, cool. Let's look at what Activision did with Spider-Man.\" Oh, [ __ ] no. Let's not crap out games. Let's get awesome people. Let's do what we're doing with Star",
            "start": 1206.96
        },
        {
            "text": "as somebody saying like, \"All right, cool. Let's look at what Activision did with Spider-Man.\" Oh, [ __ ] no. Let's not crap out games. Let's get awesome people. Let's do what we're doing with Star Wars for Marvel. Let's do what we're doing with for Disney. Like that's is it is it a big issue for the industry? I think it's a big moment for the industry if that's how it is. if it is Disney saying our video game catalog is important to us. Our video catalog matters to us. Let's not halfass it. Let's get the best of the best and go make games. Yeah, I think that uh we will see how it all pans out. But uh the write down will have a chilling effect. Um and uh because you can make so many games with that much money um or you can make at least a few big games with that money that they just wrote wrote down. Um, and uh, I do think that there's just this issue as I I I thought about only for the first time really after peripheral like just thinking about video game peripherals and this really",
            "start": 1244.96
        },
        {
            "text": "wrote down. Um, and uh, I do think that there's just this issue as I I I thought about only for the first time really after peripheral like just thinking about video game peripherals and this really bodess not well maybe for VR is like there is no successful video game peripheral. Yeah. Like when you really think about it, what is the successful ubiquitous video game peripheral? So like yeah, Rock Band and Guitar Hero had their day. Um, but they fell too, right? Like Waggling had its day. Yep. Uh, the guns had their day. The light guns had their day and super scope and and the zapper and all that kind of stuff had had their day, but nothing really has changed the way we play games with the exception of a few like the analog sticks and the internet and stuff like that. Like none of these. So that the most popular toys to life thing is really amiibo and that's only because it's the only way to buy good Nintendo figurines. Figurines. Yeah. No one gives a [ __ ] about how how that and",
            "start": 1286.48
        },
        {
            "text": "So that the most popular toys to life thing is really amiibo and that's only because it's the only way to buy good Nintendo figurines. Figurines. Yeah. No one gives a [ __ ] about how how that and that's the thing too where I think that's you know when we bring it in that's a completely different audience in terms of how it works out right like amiios aren't bought to be put into the games 95% of the time I'll say and I also think that amiios based on again echo chamber Twitter feeds whatever but based on all of our friends it's not kids buying amiios it is p and Jose and Alano buying a million this and then panda musk bringing them weirdass gold mark like is you know what I mean like it is this collector frenzy to it and that's cool and that's Right. And that's something completely different though. I think so. But I like I like fandom like that. Real quick, one more thing on this Disney thing. I mean, for anything else that we would say is cool on this show, I think that's cool. I",
            "start": 1330.24
        },
        {
            "text": "though. I think so. But I like I like fandom like that. Real quick, one more thing on this Disney thing. I mean, for anything else that we would say is cool on this show, I think that's cool. I don't know when we're sitting here talking about our cool variant VAS, we have any stones to throw. J Moral wrote in the kind of funny.com/psq just like you say, hello Colin and Greg. Hello. Now that Disney has stopped publishing games and canceled Infinity altogether, what are the chances that Star Wars and Marvel go to Lego Dimensions? It seems perfect to me. Your thoughts, Joe? 1,000 fucking% that's going to happen. I remember I've said it before and I think maybe if I would have been, we always get to this point where you like look back and like, why didn't we read the tea leaves a bit differently on this? When I remember when Disney Infinity happened and then Lego Dimensions happened, I was like, \"Fuck, that's awesome, but like clearly they're going to ride out this Lego Marvel deal.",
            "start": 1372.4
        },
        {
            "text": "on this? When I remember when Disney Infinity happened and then Lego Dimensions happened, I was like, \"Fuck, that's awesome, but like clearly they're going to ride out this Lego Marvel deal. They'll do their last Lego Marvel Avengers game and then that'll be the end of it and then we'll never get another Lego Star Wars.\" And then they're like, \"Lego Force Awakens.\" And that was should have been the first sign of like, oh, Disney's not doing video games the way you'd expect someone who publishes video games to do video games. And it's because even then they probably knew that they were getting out of it or that they were going to start doing this partnership deal of like, let's go to the best, who are the best people, who are the best, you know, who do we have relationships with? What do our fans want? And fans have since the get-go of that. I mean, remember when Lego Dimensions got re uh put out, people took their Lego Star Wars figures they had and put them on their bases of",
            "start": 1413.84
        },
        {
            "text": "do our fans want? And fans have since the get-go of that. I mean, remember when Lego Dimensions got re uh put out, people took their Lego Star Wars figures they had and put them on their bases of dimensions and put them down and took a photo of it. like this would be amazing. And so you see that in like the Force Awakens and so sure now that that's done 100% I think you see Lego Marvel in there. I think you see Lego Star Wars in there and I think that's a huge win for Dimensions as well where I bet if we were I this is the always the fun weird I wish we could be flying the wall cuz these guys speak English too. Whenever like I wish we fly in the wall in Sony Japan, we wouldn't understand anything. You could be a Japanese fly. If I could be over there in good old England, right? Oh hey governor just a fly in the wall. Don't you know here I I my imagination is that like certain packs come out and sell gang busters and then I think and I think it's that it is the portals and it is the",
            "start": 1444.72
        },
        {
            "text": "just a fly in the wall. Don't you know here I I my imagination is that like certain packs come out and sell gang busters and then I think and I think it's that it is the portals and it is the Ghostbusters and it is to an extent the DC stuff and I bet that it's like I bet Scooby-Doo didn't do as much. I bet that like Ninjago doesn't do that much and I don't know but again that's just like I don't give a [ __ ] about Ninjago but I expect most of the people who care about what we say and play Lego Dimensions and talk about how much money they've burned they send me photos of their stuff and I don't see Ninjago figures in there. I see Jurassic World. I see Portal. I see the Ghostbusters. Do you feel a lot of shame? No, no shame. I There are a lot of people putting them in the collector in little cases that I like a lot. I I just bought my second toolbox to house all my uh Lego Dimensions guys. So, I'm going to have one that's just the people and then the one that's just the cars and",
            "start": 1481.6
        },
        {
            "text": "little cases that I like a lot. I I just bought my second toolbox to house all my uh Lego Dimensions guys. So, I'm going to have one that's just the people and then the one that's just the cars and accessories. Yeah. Uh number four, The Witcher 3: Wild Hunt substantial piece of story DLC, Blood and Wine, has a release date and it's only a day off from earlier rumors, which I think we reported on last week. The DLC will launch on PS4 and other platforms on May 31st. Its main story will take around 20 hours to complete. It has 90 quests within 40 points of interest, 30 new weapons, 100 pieces of armor, and 20 new monsters amongst other new stuff. So, I'm sure there's a lot of people looking forward to that, and you are only a few weeks or a couple weeks away from playing it. So, congratulations. Go Witcher fans, be free. Number five, Sony has revealed the bestselling digitally released games for the month of April 2016. The top 10 bestselling games at digital on PS4 were in order. Dark",
            "start": 1518.72
        },
        {
            "text": "Go Witcher fans, be free. Number five, Sony has revealed the bestselling digitally released games for the month of April 2016. The top 10 bestselling games at digital on PS4 were in order. Dark Souls II, Ratchet and Clank, Rocket League, MLB 16: The Show, Minecraft: The Division, Grand Theft Auto 5, Enter the Dungeon: Beyond Two Souls, and The Order 1886. Beyond Two Souls, um PS3, the top 10 bestselling games were in order, Minecraft MLB 16: The Show, Grand Theft Auto 5, Okami HD, Saints Row 4, Grand Theft Auto San Andreas, Call of Duty Black Ops 3, Lego, Marvel Superheroes, Little Bigplet 3, and Bayonetta. The top 10 bestselling Vita games digitally in order were Severed, Digimon Story, Cyber Sleuth, Risk of Rain, Persona 4 Golden, Axiom Verge, Minecraft Grand Theft Auto PS VA collection, which I have no idea what that is. Is that Liberty City? It's the PSP games and Chinatown Wars. And Chinatown Wars, XCOM Enemy Unknown Plus, Shovel Knight, and Civilization Revolution 2 Plus. The",
            "start": 1555.52
        },
        {
            "text": "which I have no idea what that is. Is that Liberty City? It's the PSP games and Chinatown Wars. And Chinatown Wars, XCOM Enemy Unknown Plus, Shovel Knight, and Civilization Revolution 2 Plus. The top 10 bestselling PlayStation classics, War in Order, Bully, Grand Theft Auto San Andreas, Rogue Galaxy, Manhunt, Grand Theft Auto the Trilogy, Max Pain, Grand Theft Auto Vice City, Mega Man Legends 2, Mega Man Legends, and Suen 2, Fallout 4, Call of Duty Black Ops 3: The Division, and Star Wars Battlefront graced the top DLC list for PS4, while Call of Duty Black Ops 3, Call of Duty Black Ops 2, and a few others dominated the PS3 DLC charts. Big takeaway, of course, uh, severed number one bestselling games in only 5 days on the market in that period. People love that VA. Get them games. Um, also another takeaway is the same takeaway all the time that Rockstar and Take Two must be making handover fist money on PS Classics. Sure. Um, because they're always within 50, 60, 70% of that chart.",
            "start": 1599.68
        },
        {
            "text": "another takeaway is the same takeaway all the time that Rockstar and Take Two must be making handover fist money on PS Classics. Sure. Um, because they're always within 50, 60, 70% of that chart. Number six, new information is coming for Gran Turismo Sport, the upcoming allnew entry in the Gran Turismo franchise. And that information may be out by the time you hear this. Oh no. On May 19th, Polifany Digital will stream new footage of the game as well as a ton of new information about it. We'll report back on next week's episode with all we learned. So, you can look forward to that. Please look forward. I bet they talk about cars, maybe motorcycles if you're lucky. Please look forward to it. I'm sure there'll be a very long segment about damage and how it's there, but it's not severe. And um we'll talk about shifting stuff. Number seven, that's enough. Number seven, a sequel to Star Wars Battlefront is coming sooner than you might think. EA has revealed that Battlefront 2 will launch",
            "start": 1637.76
        },
        {
            "text": "um we'll talk about shifting stuff. Number seven, that's enough. Number seven, a sequel to Star Wars Battlefront is coming sooner than you might think. EA has revealed that Battlefront 2 will launch in 2017 with the visceral developed Star Wars game being p penned by Uncharted creator Amy Henne is aiming for a 2018 release date. Battlefront 2 may focus more on the new movies, something that hasn't been possible uh since the original Battlefront came out in 2015. EA Motive, on the other hand, is helping out on Visceral's game, while the already reported Respawn Star Wars game is also in the works, allowing EA to release a Star Wars game every year for the next three or four years. Dang. So, that's going to be big for them. Yeah, very big. I want that Amy game. Battlefront 2, fine, whatever. Yeah, hopefully it has like a story. Yeah. Number eight, Sega appears to be interested in releasing Shenmue and Shenmue 2 in the form of HD remasters, though it's unclear if it's possible at all and",
            "start": 1676.32
        },
        {
            "text": "Yeah, hopefully it has like a story. Yeah. Number eight, Sega appears to be interested in releasing Shenmue and Shenmue 2 in the form of HD remasters, though it's unclear if it's possible at all and when that may happen. Sega's European community manager, Dan Sheridan, said Sega would love to release the games, but doing so isn't so easy when speaking on a podcast transcribed by GameSpot. Quote, \"Sadly, it's not as simple as porting the games to the current platforms. We need to ensure that any HD remaster lives up to the quality of the original titles. with games as immersive as Shenmue and Shenmue 2. There are further complications involving licensed products that were included in the original games. That said, we'd love to do it and we are currently investigating how to make it a reality.\" End quote. So, I think that you will see those games coming out on PS4, Xbox One, PC. I'm sure you're stoked about it. I I care about Shadow. You love seeing it. It's interesting. I mean, Shadow",
            "start": 1717.44
        },
        {
            "text": "End quote. So, I think that you will see those games coming out on PS4, Xbox One, PC. I'm sure you're stoked about it. I I care about Shadow. You love seeing it. It's interesting. I mean, Shadow was interesting. Yeah. I think it's that's one of those games that if you didn't play it at the time, I think you've heard so much about that you would pick up and then you would go, \"Wait, why the [ __ ] did anybody want a third one of these?\" Yep. Why are people so into this? Why are people so into this game? What is going on with this guy in a jacket? I think you're right. Number nine. How's Battleborne doing? It's unclear though. Videogamer.com seems to have some data suggesting the game is at the very least doing okay. The game's creative director Randy Varnell noted in a Twitch stream that the studio is quote cautious cautiously optimistic end quote about the title and that the launch was quote pretty good end quote. Battlebborne is supposedly tracking just ahead of Borderland sales when",
            "start": 1755.12
        },
        {
            "text": "studio is quote cautious cautiously optimistic end quote about the title and that the launch was quote pretty good end quote. Battlebborne is supposedly tracking just ahead of Borderland sales when compared for time and Borderlands sold some 8 million units lifetime. It's worth noting that Borderlands sales were a very slow burn and Borderlands I I would be shocked if if they came anywhere near Borderlands agree with that. But I'm interested to see how Battlebborne's doing. I don't believe that it's doing well. I still ghost wrote into kind of funny.com/psq and said, \"Hey guys, earlier this week we got word from Gearbox that Battlebborne sales were pretty good and that they were cautiously optimistic about it reaching something similar to Borderlands 1.\" Colin has repeatedly said that Battleborne would bomb. Might be wrong. Need to wait for official numbers. Do you feel that Overwatch has room in the marketplace or did Battleborne eat its lunch? Thanks, gentlemen. Overwatch is going",
            "start": 1791.6
        },
        {
            "text": "would bomb. Might be wrong. Need to wait for official numbers. Do you feel that Overwatch has room in the marketplace or did Battleborne eat its lunch? Thanks, gentlemen. Overwatch is going to clobber Battle. I know Overwatch had 10 million beta players. 10 million. For comparison's sake, Gears of War 4, which is going to be very healthy on the market, had 1.5 million beta players. Yeah. Overwatch had 10 million people play it. People won't shut up about Overwatch. Don't worry about it. I think Yeah, Battleborne is No, no, you don't have to worry about it. So, there's ways to kind of figure out how games are doing with the hardcore. I think that this is a game that's going to be Battlebbor. Yeah, Battlebborne is Yeah, Battlebborne is going to be a game that's going to be kind of live or die by the hardcore. So, let me give you an example. Never let die. Uh Battleborne, according to PSM Profiles, now PSM Profiles doesn't track everyone's profiles at all, and not even close. But",
            "start": 1827.76
        },
        {
            "text": "or die by the hardcore. So, let me give you an example. Never let die. Uh Battleborne, according to PSM Profiles, now PSM Profiles doesn't track everyone's profiles at all, and not even close. But hardcore gamers, people that basically put their profile in and are tracked, has 25,92 game owners, right? Um for comparison's sake, let's just go to what Uncharted 4 has. Okay, Uncharted 4 has 35,415 players. Um, and Drake's Fortune Remastered has 91,000. So, just from the remastered from on PS4. If you look at new games being released, give me a new IP to compare Battleborne to. Well, I'm just looking at new games here. So, Doom already has 3,300. It came out Friday, right? Um, Shadow Complex Remastered 459. That's a $20 downloadable game. Tabletop Racing World Tour 24,000, but that's because it's free. Nah. Um, The Park 475. So, it's doing better than um some other games around it being that it's a retail game. That seems like the performance might be decent, but there are 2.67 million",
            "start": 1863.44
        },
        {
            "text": "it's free. Nah. Um, The Park 475. So, it's doing better than um some other games around it being that it's a retail game. That seems like the performance might be decent, but there are 2.67 million gamers tracked on PSN profile. So, it's not a lot. That's a that's a cross-section of PlayStation gamers. Probably core PlayStation gamers, but not the hardest of the hardcore, but certainly not indicative necessarily of the 40 million people with a PS4 or the 80 million with a PS3 or the 12 or 13 million with a VA. So much like polling, you have to kind of take these things and be like assume that it's being spread across. My assumption is that these numbers are actually actually track high and that if you divided those numbers in, you would probably have to subtract maybe even 50%. because these are core gamers, you know, that play nerdy ass games like Battleborne or Uncharted. So, my takeaway, it's not doing well at all. But, you know, we'll see how, you know, if they can spin that and",
            "start": 1916.32
        },
        {
            "text": "are core gamers, you know, that play nerdy ass games like Battleborne or Uncharted. So, my takeaway, it's not doing well at all. But, you know, we'll see how, you know, if they can spin that and I'm sure that they'll release numbers or maybe they will, maybe they won't. I bet they won't release numbers. If they don't, you know, it's not doing well. Yeah, 100%. But, I just don't think I mean, like I don't I think this is the best you can spin it. It's tracking ahead of Borderlands. Yeah. No one give a [ __ ] about Borderlands. I am 100% I agree with you. I understand that. That's what I remember about Borderlands was that the story took it took a year for people to really like Yeah. to claim it in Brick playing it every [ __ ] night to like be like this is a big deal. I remember playing it. Yeah. Like late like a few months later. I was like this is a great game. But I'm and I was way more connected than most people at the time. So Borderlands selling seven or eight million copies.",
            "start": 1965.44
        },
        {
            "text": "it. Yeah. Like late like a few months later. I was like this is a great game. But I'm and I was way more connected than most people at the time. So Borderlands selling seven or eight million copies. People love Borderlands and people went back and bought Borderlands for years. So I don't know like Borderlands 2 had people go back and buy Borderlands. I just I'm not I'm not convinced at all. Number 10. It appears Dark Souls 3II is a commercial success. reports that the game has shipped 3 million units, bringing the Dark Souls series shipment to 13 million units. Half of the shipment went to North America, another 1 million went to Europe, and 500,000 shipped in Japan and elsewhere in Asia. This doesn't seem to account for digital sales, and it's important to note that shipments don't necessarily equate to immediate sales, but nonetheless, Dark Souls 3I is, I think, the fastest selling Namco Bandai game. Suck at Pac-Man. Something like that. Don't hold me to that. Number 11. Square",
            "start": 1997.44
        },
        {
            "text": "equate to immediate sales, but nonetheless, Dark Souls 3I is, I think, the fastest selling Namco Bandai game. Suck at Pac-Man. Something like that. Don't hold me to that. Number 11. Square Annex's business appears to be booming. Revenues are up 27.5% year-over-year, and profit is up a staggering 2.3% year-over-year. Net sales of gaming specifically was up 42% year-over-year. And profit from gaming was up 58.9% year-over-year. The publisher praised Tomb Raider and Just Cause 3 as solid sellers, as well as a series of strong smartphone and MMO performers. Um, so MMO like Dragon Quest 10, Final Fantasy 14. Um, they'll be releasing games like DSX and Final Fantasy 15 and Tomb Raider on PS4 this year. So, um, they should be in good shape. Although, I think that Final Fantasy 15 is going to take a lot of I was going to say Final Fantasy is going to be very, very interesting. Number 12, Resident Evil Zero HD, which launched in January, has sold an impressive 800,000 copies, according to",
            "start": 2033.04
        },
        {
            "text": "take a lot of I was going to say Final Fantasy is going to be very, very interesting. Number 12, Resident Evil Zero HD, which launched in January, has sold an impressive 800,000 copies, according to Capcom's own financial report for its fiscal year. The sales were only counted through the end of March and represented the second successful launch of an HD re-release of a Resident Evil game within 12 months. As Remake, which is the GameCube remake of Resident Evil, which was then HDI for PS4, also sold very well in 2015. The game performed favorably, in quotes, according to Capcom, and may prime a path for Resident Evil 4, 5, and six re-releases as the year moves on. And obviously, we're already into that cycle. um hopefully towards the reveal and possible release of a new Resident Evil game, which we talk about on the Games Cast this week, so I won't uh bore anyone with that. Number 13, Capcom CEO Kenzo Sujioto admitted that Street Fighter 5 may have not been ready for prime time. In",
            "start": 2072.8
        },
        {
            "text": "which we talk about on the Games Cast this week, so I won't uh bore anyone with that. Number 13, Capcom CEO Kenzo Sujioto admitted that Street Fighter 5 may have not been ready for prime time. In its earnings report, Sujimoto said that quote, \"It's best to spend a little more time in developing and running a high-quality title that will perform well globally.\" Ellipsus. Some aspects of Street Fighter 5 needed more polish, such as the lack of content and server issues at launch. Accordingly, we feel it's better to give a little more time to development than before and have made slight adjustments to our portfolio.\" End quote. Just slight. Obviously, as we reported last week, Street Fighter 5 undersold significantly. About 600,000 copies, I think, where they thought it was going to be. Yeah. Come on. 600,000. No big deal. That's just one truck. That's just one truck. Number 14. Ubisoft CEO E Gilmont predicts that there will be one more generation of consoles before streaming takes",
            "start": 2108.96
        },
        {
            "text": "Yeah. Come on. 600,000. No big deal. That's just one truck. That's just one truck. Number 14. Ubisoft CEO E Gilmont predicts that there will be one more generation of consoles before streaming takes everything over. In a Ubisoft earnings call is relayed by GameSpot. Gilman said, quote, \"Now on the console side, we expect there will be new consoles that are going to make this market continue to grow, and we feel we still have another generation of consoles before we have new types of consoles coming to market.\" Ellipsus, we believe in streaming, but it demands a lot of bandwidth. We think it's going to grow, but today with the types of games we have, it will still take a bit more time to be popular. For the new consoles, there's nothing official on that. So, my expectation is we will have another cycle of consoles before we go to streaming. I don't have dates or anything but what I see is the manufacturers would prefer to have again a new hardware to take up the potential of the new",
            "start": 2146.08
        },
        {
            "text": "another cycle of consoles before we go to streaming. I don't have dates or anything but what I see is the manufacturers would prefer to have again a new hardware to take up the potential of the new possibilities that they can bring and I feel that the last transition was very smooth and the volume that was brought by consumers was very high was very high quickly. So we don't see a transition now as a potential problem. We see that as more of a way to boost the market end quote. That's the end of the story. But now Greg has left. I'm a little scared because I don't know. Could it be the water man? But he's already back. No, he's not back. Is it the water man? There's some clinging and clanging. Doors opening and closing. There's no scuffling going on. No screaming or yelling. Greg's stomping up the stairs like a Clydesdale. He's closing the door. He has packages in his hands. What do we got? Packag. Yeah. Top secret baggage. Boring. All right. Number water man. Number 15. The Division",
            "start": 2181.6
        },
        {
            "text": "up the stairs like a Clydesdale. He's closing the door. He has packages in his hands. What do we got? Packag. Yeah. Top secret baggage. Boring. All right. Number water man. Number 15. The Division is officially a commercial success. Ubisoft revealed that the game has 9.5 million registered users and that active users, which they didn't reveal a number for, are spending three hours on average in the game each day. Uh Far Cry Primal exceeded expectations, selling better than any game Ubisoft ever released in February. Is that the end? That's the end of that. I still don't believe that Division stuff. That that's that's a spin because the Division stuff is not going well because I said in Calling Greg Live when we read that story, right? That's great. I like what a great number of like people who have played The Division and like but then like you say in the story, you know, oh they're spending three hours a night but they didn't release how many people are actively playing it. The drop",
            "start": 2226.72
        },
        {
            "text": "who have played The Division and like but then like you say in the story, you know, oh they're spending three hours a night but they didn't release how many people are actively playing it. The drop off I've seen and talking to like even Tai who you know I mean Tai and Fran we were all so gung-ho on it so into it none of us are playing it and Tai's like I'm not I was talking this week he's like I'm not going back to the Division ever again probably. And you look at the Reddit and everyone's furious and you look at the posts from the developer who are like, \"We know we [ __ ] up the first expansion, first patch, whatever.\" Like, \"We're going to work hard not to have that. There won't be exploits, there won't be this, there won't be that.\" PC's totally [ __ ] with hackers and stuff like this. I don't know. I think there's a there's a dark story happening beneath the surface of that and how much they talk about Division from here on out will be interesting. And not to mention if they can",
            "start": 2269.6
        },
        {
            "text": "I don't know. I think there's a there's a dark story happening beneath the surface of that and how much they talk about Division from here on out will be interesting. And not to mention if they can salvage it when they put out more stuff. I think they will. I mean, I think we'll see a sequel probably sooner. So, like I think we'll see the I think the expectation. All right. So, this will probably be the opposite of the way that um that Destiny was treated and that Destiny 2 was supposed to be out way sooner than they thought and then they Destiny was so popular that they're like, \"We can kind of squeeze water from a stone or blood from a stone. It's not from um and uh I think you'll see the opposite with this where they probably had these lofty plans to let The Division Breathe and they're probably being like, \"We really actually need to make the sequel quicker.\" Yeah. Cuz I feel like everyone's run off that. No one talks about that. just I mean I never I mean I I spent a lot of time",
            "start": 2300.96
        },
        {
            "text": "probably being like, \"We really actually need to make the sequel quicker.\" Yeah. Cuz I feel like everyone's run off that. No one talks about that. just I mean I never I mean I I spent a lot of time with it and 40 plus hours and I got to level 28 or something like that. I'm so close to like just capping and being the game and I'm like I just I don't know. Yeah, but I did to it credit I was in it for a minute. I liked that game. I I I totally did not play it after they patch it. Once we hit level 30 and we went out and I was like, \"Oh [ __ ] this is the treadmill. This is all there is is this gear treadmill of going out and running the same things and spending my replay tokens.\" I'm like, \"No, I'm good. Thanks.\" Um you lost me. Let's see here. What's happening behind me? Why do you keep looking at looking at the clock right now? You're doing fine. You're doing great. Still running. I just like to make sure that we're not spending too much time on this news. I always I always look at the",
            "start": 2336.72
        },
        {
            "text": "at looking at the clock right now? You're doing fine. You're doing great. Still running. I just like to make sure that we're not spending too much time on this news. I always I always look at the clock. I like looking at it. Number 16. Titanfall 2 is coming in the 2016 calendar year, and EA is anticipating good sales of the game, even as it launches close in proximity to another EA shooter also releasing in late 2016, Battlefield 1. GameSpot reports that CEO Andrew Wilson says, quote, \"Shooters are a giant category in our industry, $4.5 billion. There's a very broad, diverse set of players who are looking to fulfill different gameplay motivations. Some people play very quickplay, some people play more strategic, some people want both in different contexts. We feel we have a really strong position to deliver the broader set of gameplay mechanics as it relates to the first-person shooter genre across two titles. I feel very confident that we are well positioned to do very well in the",
            "start": 2373.36
        },
        {
            "text": "position to deliver the broader set of gameplay mechanics as it relates to the first-person shooter genre across two titles. I feel very confident that we are well positioned to do very well in the category this year, Ellipsus. Titanfall 2 has evolved substantially from the first Titanfall. It will be on both platforms, which obviously means a bigger audience for Titanfall, particularly with the Sony platform, which hasn't experienced Titanfall before. But at the same time, obviously, the Attach won't be anywhere near as high as it was with Titanfall because it was one of the first AAA titles for the new Xbox One. We think you're going to see numbers clearly larger than our first Titanfall. We've got expectations for it, but we try to be prudent in how we forecast that in our guidance.\" End quote. Be prudent. That to me says that um Titanfall is not going to be a big seller for them. It will sell a few million copies probably. Yeah. But I don't I think that I don't want to be too bold",
            "start": 2410.72
        },
        {
            "text": "quote. Be prudent. That to me says that um Titanfall is not going to be a big seller for them. It will sell a few million copies probably. Yeah. But I don't I think that I don't want to be too bold in my assertion, but I think Titanfall's kind of come and gone. Like I I don't know that releasing Titanfall 2 in the fall is a good idea. If I were them, I wouldn't release it in the fall. I would release it in the summer. I'd release it in the spring. Yeah, spring would make sense. Um just with I don't care how many how people are nailing the new Call of Duty. That game's going to sell 15 million copies. Battlefield 1 is going to sell a ton of copies. People are still playing Battlefront. they're still engaged in the Division or Destiny or whatever is going to, you know, there's other things like I just don't know that this is a smart move to wedge Titanfall in there. Yeah, I think it would make more sense to let it stand out in the spring cuz it is an interesting game. I do I love",
            "start": 2443.28
        },
        {
            "text": "like I just don't know that this is a smart move to wedge Titanfall in there. Yeah, I think it would make more sense to let it stand out in the spring cuz it is an interesting game. I do I love Titanfall 1. I'm excited for Titanfall 2, but in a crowded holiday market, I don't know how much I'll be playing and how much you'll be jumping in there. How many am I still regening and all this [ __ ] Yeah, I don't I don't uh I'm excit I want to play because I want to I like the mechanics of the original Titanfall. I just don't want to play online and I like the idea of of campaign. I think that'd be great. So, I'm in it and I want to play it. Yeah. Two things. Will the original Titanfall get re-released on PS4? I don't think that's possible. I don't know the exact answer to that. That seems to be a deal that was worked out. I think Yeah, I don't think that's possible. But that's what we said about Mass Effect, right? But it took 5 years, though. So, I wonder if that's the same kind of deal.",
            "start": 2480.0
        },
        {
            "text": "a deal that was worked out. I think Yeah, I don't think that's possible. But that's what we said about Mass Effect, right? But it took 5 years, though. So, I wonder if that's the same kind of deal. Yeah, I remember when the original Mass Effect came to PS3, I was like, \"This is unbelievable.\" Because I really didn't expect that that was going to happen. But yeah, weird things have happened. Number 17, Rogike RPG Mystery Chronicles. This is the wrap-up, by the way. Yeah. Rogike RPG Mystery Chronicle: Oneway: Heroics is coming to PS4 and VA this summer. Puzzle game four-sided fantasy comes to PS4 this summer. And finally, if you're still rocking PS3, a lastg Call of Duty collection is launching this week and contains all three Modern Warfare games at a reduced cost. I think it's $30. I think all the games have some sort of online component, but I'm not sure you have to look into that. Some DLC, but again, look into that if you're interested in buying it before you do. You know, I don't",
            "start": 2512.96
        },
        {
            "text": "all the games have some sort of online component, but I'm not sure you have to look into that. Some DLC, but again, look into that if you're interested in buying it before you do. You know, I don't know much about it. That's it for the news. Colin, I'm interested in this here rogue like on Vita you just talked about, but that's not coming out till the summer. If I want to know what stores had mom and games this week and things had come to digital warehouses and stores had been updated by Andrew Kelly, where would I go? You go the official list of upcoming PlayStation 4, PlayStation 3, PlayStation VA to sometimes PSP software by the kind of funny co-founders. Okay, let's see. What was that? Hold on a second. No, that's your Twitter. That's Long Island. Your Twitter header is Long Island, is it? Yeah. Oh, okay. Well, Cubicolor comes to PS4. It's a digital game out the 20th. So, this is a Friday release. Immerse yourself in the world of Cubicolor. And that's C U BI K O L O R. I don't",
            "start": 2546.56
        },
        {
            "text": "is it? Yeah. Oh, okay. Well, Cubicolor comes to PS4. It's a digital game out the 20th. So, this is a Friday release. Immerse yourself in the world of Cubicolor. And that's C U BI K O L O R. I don't like anything about what I've heard so far. Armed only with your logic and your cube with a K. Move through 150. The 150 levels outwitting the traps in the system. Proper noun. An evil scheming entity to confform to confront the machine and pass the test. Will you achieve the highest score? Let me read that all again. Immerse yourself in the world of cubicolor. Armed with only your logic and your cube. Move through the 150 levels outwitting the traps in the system. An evil scheming entity to confront the machine and pass the test. Will you achieve the highest score? I don't know what the hell is going on there. Homeront the Revolution comes to PS4 digital and retail. Homer from the Revolution is an open world first-person shooter where you lead the resistance movement and wage guerrilla",
            "start": 2590.48
        },
        {
            "text": "is going on there. Homeront the Revolution comes to PS4 digital and retail. Homer from the Revolution is an open world first-person shooter where you lead the resistance movement and wage guerrilla warfare against a superior military force to ignite the revolution. The dynamic evolving world responds to your actions as an oppressed nation rises up in defiance against the occupation. Now, this is the one thing that frustrates me is that the original Homeront ends with them sparking the revolution. So, why didn't they just leave that as cannon? You know, cuz they wanted they just want you to jump in. They don't want you have to go play this first game that they didn't have they didn't sell. Letter Quest Remastered. I bet you the original Homeront sells better than this one. Oh, I agree. Letter Quest Remastered PS4 and PSV. Time out. I mean, that that's not even fair. The original Homefront had one of the most aggressive marketing campaigns we had ever seen for especially for a THQ",
            "start": 2636.4
        },
        {
            "text": "Letter Quest Remastered PS4 and PSV. Time out. I mean, that that's not even fair. The original Homefront had one of the most aggressive marketing campaigns we had ever seen for especially for a THQ middle of the pack uh developer, publisher, everything. Everybody on that remember you'd go down to San Francisco, get on the MUI, and every [ __ ] sign had Homeront on there. And they didn't they get in trouble and they release balloons into the air and like they were doing all sorts of crazy [ __ ] for Homeront. You couldn't go anywhere and not see Homeront. This one I didn't even know what the real release date is. No one did. Guaranteed it sells better. So Homefront the Revolution PS4 digital retail. We read that one already. Next. Letterqu Quest Remastered PS4 VA digital crossby. Ever wondered what would happen if you cross Scrabble with an RPG? Oh god, no. Now you don't have to because Letterqu Quest is here. Help Grim and Rose, a couple of adorable grim reapers defeat monsters,",
            "start": 2670.56
        },
        {
            "text": "wondered what would happen if you cross Scrabble with an RPG? Oh god, no. Now you don't have to because Letterqu Quest is here. Help Grim and Rose, a couple of adorable grim reapers defeat monsters, ghosts, evil bunnies, and more using the power of words. I like that. I think I got my down with that. That's a good idea. Life Goes On: Done to Death comes to PS4 digital. Life Goes On is a comically morbid platformer where you guide heroic knights to their demise and use their dead bodies to solve puzzles. Oh, cool. On your quest, you find the cup of life. You will summon night after night to be brutally sacrificed. In Life Goes On, death is not a setback. It is the only means to success. My night job comes to PS4 digital. Black Knight, an abandoned mansion and a bunch of monsters sounds like the perfect job. Players will have to use a variety of weapons to save their skin and master the challenge of leading survivors to safety while also defending the building from invaders. Use more",
            "start": 2714.32
        },
        {
            "text": "the perfect job. Players will have to use a variety of weapons to save their skin and master the challenge of leading survivors to safety while also defending the building from invaders. Use more than 60 weapons from voses and floor lamps to chainsaws, shotguns, and ginormous hammers. Could be interesting. Sure. Perfect Universe comes to PS4 digital. Perfect Universe is a collection of nine game modes with both single and local multiplayer options varying in complexity all tied together with a beautiful art style and highly detailed environments. You have got to write better [ __ ] things than this. What is this game? Pissing me off now. It's a perfect universe. Rugby League Live 3 comes to PS4 and PS3 digital. It's footy season. I'm not reading the rest of this. Thank you. Shadow of the Beast comes to PS4 digital. Explore the alien landscape of Carmoon, a world filled with beauty, brutality, and mystery on a lone quest to overthrow the malevolent tyrant Melothth. Survive epic boss",
            "start": 2754.0
        },
        {
            "text": "Beast comes to PS4 digital. Explore the alien landscape of Carmoon, a world filled with beauty, brutality, and mystery on a lone quest to overthrow the malevolent tyrant Melothth. Survive epic boss battles and tackle hordes of enemies and ferocious adrenalinefueled action. Develop abilities with skill points earned from the death of your opponents, unlocking increasingly brutal moves as you draw power from the blood of your foes. This is a PlayStation 4 exclusive. Shadwin comes to PS4 digital. Shadwin is a stealth action game where the only rule is to remain unseen. Stay hidden or the ruthless guards will kill you on sight. Shadwin, an assassin, has a chance encounter with an orphan girl, Lily. Lily f follows Shadwin on her dangerous journey. But when the guards get too close, Shadowin must take action right in front of Lily's eyes. Oh my god, sounds like two different things that you just wrote and put them together. Soft Body comes to PS4 digital. Yeah. Soft Body is a meditative",
            "start": 2792.72
        },
        {
            "text": "must take action right in front of Lily's eyes. Oh my god, sounds like two different things that you just wrote and put them together. Soft Body comes to PS4 digital. Yeah. Soft Body is a meditative action game where you control two beautiful gooey snakes at the same time. Yeah. In the game, you paint the world with your body, and as you do so, the world changes around you and reveals new obstacles and challenges. Although the action is tense, the mood and aesthetic are contemplative and calm. That seems like a weird mashup. Then, Valkyia Chronicles Remastered comes to PS4 digital and retail. Valkyia Chronicles is back and now beautifully remastered in HD for PS4. It was already in HD, wasn't it? It was on PS3. Now, with brand new trophies and the previously released DLC preloaded, take advantage of the visually distinctive classic. Do it. Vev Viva XVivo comes to PS4 digital. Vev Viva XVivo is a unique pick up and play action game and with puzzle and survival elements. Players take",
            "start": 2834.0
        },
        {
            "text": "advantage of the visually distinctive classic. Do it. Vev Viva XVivo comes to PS4 digital. Vev Viva XVivo is a unique pick up and play action game and with puzzle and survival elements. Players take control of a virtual ukaria. How do you say that? This is a word I've actually seen before. It's a it's a bio a biology word this one. Oh. Um ukaro uk y ukarote. Let's look. Let's have dictionary tell us. Where's the diction dictionary? How we say this word? Ukariote. Ukariote. Ukariote. Okay, let's go back. Players take control of a virtual ukarote visualizer. Nailed it. A single-sellled artificial life form which allows them to explore four distinct microscopic environments. Fresh water, soil, blood, and ser cerebrros spinal fluid. Oh, okay. Stop with your goddamn biology. Some kind of [ __ ] We got a goddamn medical bio game over here, huh? Everybody get into biology 101 with Vev. And finally, WildArms 3 comes to PS4. The PS2 classic PS4 digital. Experience WildArms 3 on PS4. Desolate",
            "start": 2869.76
        },
        {
            "text": "We got a goddamn medical bio game over here, huh? Everybody get into biology 101 with Vev. And finally, WildArms 3 comes to PS4. The PS2 classic PS4 digital. Experience WildArms 3 on PS4. Desolate wastelands and eroded memories are the remains of a dying world. Sparse settlements provide protection from the harsh environments. Few dare to roam beyond the town's boundaries. The ones that do are proclaimed drivers. The ones that survive are heralded as legendary. Legendary. And that is it. Did you like Wild Arms 3? Not really. No. Okay. I was going to I can remember where that Wild Arms one and two. I love You love those. One is one of my favorite games of all time as everyone knows. Uh that is it for the games releasing. That means it's time for topic of the show. Yuka Rayote. Yuka Rayote. Colin. I got a humdinger. I got a humote. You got Is it picking up? Because I hate it when we do funny audio gags and know you don't hear them. It just sounds like silence. I got a humdinger of a",
            "start": 2927.28
        },
        {
            "text": "Colin. I got a humdinger. I got a humote. You got Is it picking up? Because I hate it when we do funny audio gags and know you don't hear them. It just sounds like silence. I got a humdinger of a topic of the show for you. You ready? Tots tots. Ts. This one comes from game on Parker who wrote in and posted it over on kind of funny.com/psq. Colin, put on your thinking caps. This involves you need your imagination. Multiple thinking caps. You need your imagination for this one. Yeah. Well, I know one isn't good enough for you. No, you'll be way too grounded. You'll start talking about Trump and everything. Okay. Hi, Bertillo Colin and Greg. This question might bring out the craziness in both of you, but hopefully it will be in a good way. If you could become Shuhei Yoshida for one day, what would you do? Every decision you make will stay set and cannot be changed. I'm just curious to see how both of you would spend your time being shoeh for one day. Don't get too crazy. Game on, Parker.",
            "start": 2970.32
        },
        {
            "text": "would you do? Every decision you make will stay set and cannot be changed. I'm just curious to see how both of you would spend your time being shoeh for one day. Don't get too crazy. Game on, Parker. So, we wake up or we sign a deal with the devil. So, we we're 100% aware cuz that's always the big thing. I wouldn't if is this all a dream? What's happening? D we already we go into this knowing tomorrow we're going to wake up is Shu Yoshida. We'll be fluent in Japanese. We It'll be like a Greenland ring. We're just translated. They're translated. It's no big deal. But the alarm goes off. If we wake up, we hit the alarm. What? What are you doing? Hi. Look, it's already happening. Enichi suman. Um, God, I walk around Japan like a [ __ ] when I'm over there. No idea what I'm doing. Cuz I told you the whole thing the first time I went to Jan where I was like, \"Hi.\" Like when I walk up to someone and I was like, \"I'm just saying yes. I'm a [ __ ] idiot.\" Yeah. Yeah. I did that the second",
            "start": 3014.72
        },
        {
            "text": "you the whole thing the first time I went to Jan where I was like, \"Hi.\" Like when I walk up to someone and I was like, \"I'm just saying yes. I'm a [ __ ] idiot.\" Yeah. Yeah. I did that the second time I was there, too. Anyway, uh, so what I would want to So there are things I don't even want to make decisions. There are things I just want to know. Exactly. And so that's so and it's not even the things that are happening, it's the things that have happened. So I would a different direction. So I would So I don't care about the future plans. That's whatever. Those are already set in stone. We're not in a day. We're not going to be able to change those plans. They have budgets and they have I'm not going to go to Sucker Bunch and be like, \"Hey, you've been working on a game for two years and guess what? Like we're going to find another $50 million and you're going to recreate your, you know, like No, no, no. See, what I would mine would be is that I would have a morning of not a morning",
            "start": 3060.24
        },
        {
            "text": "guess what? Like we're going to find another $50 million and you're going to recreate your, you know, like No, no, no. See, what I would mine would be is that I would have a morning of not a morning of, but I would take like a section of the day for Skype calls and I I would call Sucker Punch, be like, \"All right, bring me up to speed. Where we at? Show me the latest demo.\" You know what I mean? All right, great. Hang up on them. Call Bend. Fire Eric Jensen. Now, show me what he's been working on. And they're like, \"We haven't been working on anything.\" You told us not to shoot. We have this game called Dead Don't Ride, but uh nobody wants it. No, we can't. But we actually have a ma game. We have a logo. It's very pretty logo. We've been sitting here for 5 years and we can't It's hard to get to our office and bend. So, we have no idea what's going on here. Um, I want to know what's happen. I hit them up. What are they working on? Yeah, that's not that like so because we'll find",
            "start": 3092.4
        },
        {
            "text": "to get to our office and bend. So, we have no idea what's going on here. Um, I want to know what's happen. I hit them up. What are they working on? Yeah, that's not that like so because we'll find answers to those eventually. But to me, I would basically spend all day going through my email and reading old [ __ ] and listening to old voicemails and like so I'm sure a company as big as Sony probably has their own historians or their own their own um archavists basically. Like I would be like I need a dump of like everything that I sent like the entire time I've worked here. I would like do like huge word searches on like whole databases of his emails and like figure out because I dude there's so much awesome [ __ ] in there probably about canceled games and and and some difficulties and some successes and things we just said we'll never know about. Way more interesting than finding out what these guys are going to be working on anyway. So, that's how I would like from 12:01 a.m. until",
            "start": 3124.08
        },
        {
            "text": "successes and things we just said we'll never know about. Way more interesting than finding out what these guys are going to be working on anyway. So, that's how I would like from 12:01 a.m. until 11:59 p.m. I would be trolling. I would be in email and be talking to people and listening to voicemails and like having conversations and maybe find something in there and then go find that person and be like, \"Hey, do you remember this thing?\" Like, tell me about like I refresh my memory on what happened here. Why Why did we get away from the Boomerang controller? Can you go get me the Boomerang controller, please? I want to see the boomerang. I mean, so I'm throwing you a curve here, but that's that's the way you use that time. That's the way you use that time. I mean, sure. And then I come back and I tell you everything. No, sure. But I mean like that's all as usual. Yeah. But that's we could ask you most of those questions. He'd tell you all that stuff. Not to mention that I don't don't",
            "start": 3165.84
        },
        {
            "text": "and I tell you everything. No, sure. But I mean like that's all as usual. Yeah. But that's we could ask you most of those questions. He'd tell you all that stuff. Not to mention that I don't don't forget did say Horizon was coming out this year and we don't know whether or not that's true. Did he lie to my face like Drman did now? Also Neil Duckman. Think about it this way too of like emails only go so far back. He does have beautiful hair. That's what I'm saying. Archemist like like but they but okay we think they should do Sony definitely has everyone's emails. It's a big company from the jump. Yeah, I bet you they do. I don't think they do. Not I don't think. And I even if it is, I don't think it's easy enough to be like, \"Cool, they come up with like a flash drive in 15 minutes. Here are all your emails.\" I'm sure that's a process. You've wasted your day. Hopefully there's not like awkward things in the email. Some stupid interns down there. Oh, there's 100. That's the other",
            "start": 3198.0
        },
        {
            "text": "Here are all your emails.\" I'm sure that's a process. You've wasted your day. Hopefully there's not like awkward things in the email. Some stupid interns down there. Oh, there's 100. That's the other thing, too, is like you've gone like you're reading his diary. Like you've gone super single white female about it. Like I want to know what other people are doing, but I'm not invading Shu's privacy. You're going through there's emails from his family members. You're impersonating him to other people to get information. It's the same things. Come down from your ivory tower, sir. I'm just finding things out. I'm not I'm just going to go great. And if they're like, \"What do you think about?\" I'm like, \"Let me sleep on it. Hit me up in the morning. I'm not going to make any big decision.\" The one big decision I would make is I'd make sure we're getting a Patapon. I'd be like, \"Hey, so hey, I'd hit up everybody. Where where are we off in this Patapon? Where whatever happened with the",
            "start": 3236.08
        },
        {
            "text": "The one big decision I would make is I'd make sure we're getting a Patapon. I'd be like, \"Hey, so hey, I'd hit up everybody. Where where are we off in this Patapon? Where whatever happened with the Patapon, you know, VA game or the Patabon remaster?\" Like, \"Oh, well, you know, I got killed for this.\" And I'm like, \"No, that's dumb. Let's get on Kickstarter, huh? Just get it [ __ ] out.\" The more interesting mind kind of thing we could like the the g game we can play is if if you were Shu Yosha and you had $500 million and to spend and five years what would you do with it? You know m that's fun. What would you do? Buy studios and probably buy a few studios and then and then see what you know how much those studios cost. Who are you buying? I mean I would buy House Mark Drink Box. Uh no I wouldn't buy Drink Box. Why not? I think they're great that they're I'm talking about studios that probably have an interest in being purchased. I don't think Dreambox has any interest in being",
            "start": 3267.84
        },
        {
            "text": "no I wouldn't buy Drink Box. Why not? I think they're great that they're I'm talking about studios that probably have an interest in being purchased. I don't think Dreambox has any interest in being purchased by anyone. I think Housemark would absolutely be a Sony studio. I mean, you think house but why? They're doing good on their own. They're doing great on their own. They only do PlayStation games. Sure. Well, I mean, so I mean, why do you think that they want to be purchased more than Drinkbox wants to be purchased? Well, I'm saying it's the possibility of that. I don't think that Drinkbox Studios is like a small group of people. They're not they're not going to be a first-party studio. Housemark is a little bigger and a little more a little more established in the in the in the ecosystem. I'm not no disrespect to our friends at Drinkbox Studio. I hear you. It's just so I would I would but I would go invest in some IP and I would I would revive some IP and cancel some games and",
            "start": 3310.24
        },
        {
            "text": "I'm not no disrespect to our friends at Drinkbox Studio. I hear you. It's just so I would I would but I would go invest in some IP and I would I would revive some IP and cancel some games and you know really narrowly. What' you say? You going to cancel Gran Turismo? I would cancel Gran Turismo. Fire Kazanori, close down both Polifany offices and thank them for their service. You hit the button and launch Last Guardian just like it's out. [ __ ] it. We're not waiting till E3. I would release the old version of The Last Guardian. That would be funny. Actually been showing you this game doesn't even exist. We have the PS3 version. And it's been done for 4 years and it sucks. Here it is. Yeah. Enjoy it and you'll still buy it, won't you? You're still going to buy it. Yep. Mhm. So, uh, I keep forgetting that game's coming out. I don't even care about that game anymore. I really give a flying [ __ ] about that. That's the big problem. I think with Last Guardian, why I do think curiosity,",
            "start": 3337.6
        },
        {
            "text": "forgetting that game's coming out. I don't even care about that game anymore. I really give a flying [ __ ] about that. That's the big problem. I think with Last Guardian, why I do think curiosity, one of my E3 predictions is I will put lock it in now for that show because we had to start gearing up for that eventually is the fact that I think it's going to be the and it's out today. It's out right now. Download it right now. Why not? They're not doing anything else because they're going to have to flood the the retail channels with it, too. And it's going to leak unless they don't have to retail it. You think that's going to be a digital only game? I mean, how long is this game limped along? A long time. Exactly. What are we expecting out of this? I think you I think you release it as a digital and you put it out for 40 bucks and you set the expectations on what you're getting here. You're getting a 5 hour game. It be funny if it was a PS+ game. That would be interesting. That would",
            "start": 3379.12
        },
        {
            "text": "digital and you put it out for 40 bucks and you set the expectations on what you're getting here. You're getting a 5 hour game. It be funny if it was a PS+ game. That would be interesting. That would be bold. Yeah, they'll they'll make money back on it. There's so much more curiosity about this game that'll sell. They're never going to make their money back. Like I I mean unless the budget's been It's the same thing with Final Fantasy 15 where I'm like there's no way I don't there's no how how do you make your money back? I don't know. You make a anime, you make a movie, make a bunch of crazy ass collectors editions. I don't know if you've uh knew this about me. You known this about me, but if you look kind of funny, I don't know much about business. No, I'm well aware of that. So um I know economics I'm no Adam Smith. Sure. Um but um nor am I a Bernie Sanders if that makes any sense to you. That works for me. I know I know Bernie Sanders feel the burn. So like I'm not like super up",
            "start": 3411.44
        },
        {
            "text": "economics I'm no Adam Smith. Sure. Um but um nor am I a Bernie Sanders if that makes any sense to you. That works for me. I know I know Bernie Sanders feel the burn. So like I'm not like super up on economics like Mr. Smith, but I don't just say whatever I want like Bernie Sanders. I say whatever I want, but I don't say whatever I want. Okay, think listen to the difference. I don't say anything I want, but I don't say anything I want. Okay. Okay, I think I understand a bit. So yeah, you'd be Japanese. That'd be cool. Yeah, you could order whatever you wanted and know what it was going to be off the menu. That'd be cool. I can go in and order ramen and not play ramen [ __ ] roulette like I usually do. Yeah, we just hit the buttons on the thing. So you want to go back? You want to find old stuff? Mhm. You're trying to green light some You're Are you going to You don't want to buy Let's just say for the sake of Well, that that's a different But I'm just saying you you we knew it was",
            "start": 3447.76
        },
        {
            "text": "old stuff? Mhm. You're trying to green light some You're Are you going to You don't want to buy Let's just say for the sake of Well, that that's a different But I'm just saying you you we knew it was coming and you had the 500,000 500 billion. Sorry, my apologies. 500 million. I mean, I would I would just greenlight a b, you know, obviously The Last of Us 2 is greenlighting a bunch of these other games, but I would invest in new studios because I think that Sony's um someone made an interesting point on Twitter just of a listener of ours that this is a while ago, but point an astute point, simple point that I never really thought of, which is that Sony's playing like a really interesting game right now where they are investing a lot in second parties and investing a lot in talent that they don't own, but IP that they do own. And so that's a lowrisk lowreward kind of situation I think where okay so the game doesn't work out you don't own this team they can go [ __ ] off and like you",
            "start": 3499.28
        },
        {
            "text": "don't own, but IP that they do own. And so that's a lowrisk lowreward kind of situation I think where okay so the game doesn't work out you don't own this team they can go [ __ ] off and like you have your game and your IP maybe it sells maybe it doesn't but the riskreward thing is like well so what if this team ends up being really good and this game's really good and now you just showed the entire world how good they are and now you can't nail them down. This is exactly what happened with From Software I think. So, and From has obviously been making games for a very long time since PS1 and PS2, but for Sony, but Demon Souls is a great example of a game where like we might have wanted to be a little more careful with that. Um, and this Dark Souls [ __ ] would have played out very differently for you. Sure. Um, and imagine if they didn't have Naughty Dog Lockdown and Uncharted came out or Uncharted 2 came out and then everyone's like, well, Activator's like, well, we have way more",
            "start": 3538.96
        },
        {
            "text": "for you. Sure. Um, and imagine if they didn't have Naughty Dog Lockdown and Uncharted came out or Uncharted 2 came out and then everyone's like, well, Activator's like, well, we have way more money to spend. We can we can, you know, so there's something to be said about maintaining publisher, maintaining your own developers. It is high risk, high reward to do those kinds of things. And then you end up with Naughty Dog. you end up with Sucker Punch. And I mean that whole thing what you're talking about is I don't think they're mutually exclusive. I think that you invest in these second parties and if you see somebody who's showing you signs that they could be Naughty Dog, you know what I mean? It wasn't like Uncharted was Naughty Dog's first game for PlayStation. You see somebody who shows that kind of potential, that's when you lock them down. That's when you give them the ring. That's when you sit there and go, \"Okay, what can you do just for us? Just focus on one platform. Just do",
            "start": 3576.32
        },
        {
            "text": "that kind of potential, that's when you lock them down. That's when you give them the ring. That's when you sit there and go, \"Okay, what can you do just for us? Just focus on one platform. Just do all these different things. Make us the next big thing.\" I think that's when you lock them down. I don't think it has to be, \"Okay, well, [ __ ] We let them You know, like like you're saying From Software had worked forever. And I don't even think with all due respect to Demon Souls, it wasn't a game that you played and you're like, \"Holy shit.\" It was a game that some people played and went, \"Holy shit.\" And some gamer was like, \"No way.\" And if you're thinking about big and mainstream and all this different stuff like who they need to own, what they need to have, they didn't I don't know if they anyone played that was like, \"We need to have these guys.\" Right. But Bloodborne was an admission that there was an accident, right? Well, I think it was an admission. Yeah. That like we want to",
            "start": 3608.64
        },
        {
            "text": "they anyone played that was like, \"We need to have these guys.\" Right. But Bloodborne was an admission that there was an accident, right? Well, I think it was an admission. Yeah. That like we want to get these guy we want to keep those kind of players with us. We want to give you a reason those kind of players because guess what? Demon Souls, Demon Souls is the genesis and the seed of what becomes Dark Souls, but also for the player fan base as well, right? Where it's I think so many uh copies of Dark Souls were sold on PlayStation platforms because the lineage and I think that was the whole thing of like well why don't we bring them bring that make sure we still maintain that lineage. And it's also the fact of it's you know is my my sense of importance of the first parties has dwindled over the years. Not that it's gone, but I do remember when we I was sitting there and like they launch PlayStation mobile and talk about PlayStation mobile and I'm like this is the next step. This is",
            "start": 3640.56
        },
        {
            "text": "over the years. Not that it's gone, but I do remember when we I was sitting there and like they launch PlayStation mobile and talk about PlayStation mobile and I'm like this is the next step. This is them admitting that there's a PlayStation brand outside of the PlayStation hardware. And when that happens, that's when you flip the switches and Naughty Dog is making games for every platform. And you know, Sucker Punch is making games for every platform. And this has been the generation where we've seen that traditional logic not work, right? That it doesn't matter. The [ __ ] system can't be stopped right now. And it just got what? It's first. you must have AAA exclusive from a first party. You know, Uncharted is that game. And before then, it has been these second party deals. It has been your Bloodbornes. It has been games that are great, but also that they're just dominating a third party conversation where Destiny is PlayStation. This is that. Bloodborne, I think, specifically was",
            "start": 3678.88
        },
        {
            "text": "your Bloodbornes. It has been games that are great, but also that they're just dominating a third party conversation where Destiny is PlayStation. This is that. Bloodborne, I think, specifically was uh even though it's a second it's a first party published, second party game, um it was a stroke of genius. It really was. It was the best you could do in a situation because I'm sure they were like, \"Fuck.\" Like, see, they could have published Demon Souls in the States and they didn't in the West. They just didn't publish it and they didn't think anyone would care and that was a mistake. But if I looked, it's the same thing I've said before in the past. If I looked at that game, I' been like, there's no way in hell we're publishing this game in the United States. So, it's the same thing we said about Minecraft. People passed on Minecraft. Like, there was there's great stories about like the what happened with Minecraft situation before it blew up where everyone was like, \"What the [ __ ]",
            "start": 3713.76
        },
        {
            "text": "about Minecraft. People passed on Minecraft. Like, there was there's great stories about like the what happened with Minecraft situation before it blew up where everyone was like, \"What the [ __ ] is this?\" And if I looked at that game, I would be like, \"Fuck this game.\" Right. It's garbage. Yeah. you know, there's just only so much vision you can have no matter how smart you are. Um, so yeah, we'll see what happens. I think that the first parties are important still because they give brands identity. They're important. I'm not saying like I'm saying I'm not trying to make it out that there's no need for first party. I still do think that in the future, the ubiquitous future that Eve Gil think is is coming in the streaming thing and after one more generation, clearly that's going to put Sony in a great spot of like, all right, cool. We have these incredibly talented people. Let's do it now. Now they better spot. That's the point I'm making. They're shuttering studios, but not really",
            "start": 3746.96
        },
        {
            "text": "Sony in a great spot of like, all right, cool. We have these incredibly talented people. Let's do it now. Now they better spot. That's the point I'm making. They're shuttering studios, but not really opening one. Northwest Studios, they really we don't really know what the [ __ ] they're even doing. I don't think they're doing anything that we're going to care about, to be honest. I hope I'm wrong. I think they're doing VR. Um, so we care about VR, but I I want something, you know, so I it would just be nice to for them to fold in some of these new stu some of these other studios that they work with yet again, but yet like these are de facto. Housemark and Quanic especially are like just de facto first party studios anyway. They don't make games for other people. And see, this is I guess my thing where I'm talking about for me Quanic and Housemark are in the same conversation league where I think Housemark's great. You know that I love Housemark, don't get me wrong, but I think that",
            "start": 3782.24
        },
        {
            "text": "my thing where I'm talking about for me Quanic and Housemark are in the same conversation league where I think Housemark's great. You know that I love Housemark, don't get me wrong, but I think that like when I'm thinking of a first party studio, somebody Sony needs to scoop up and get them doing and you look at the rest of their portfolio and who fits. I think Quantic Dream fits way more than Housemark does. Housemark's making great games, but they're making these great little, and I'm putting in quotes, little experiences. You know what I mean? They're not making these AAA first party games. And now could they? Of course they could. Yeah. you need, but you need that, right? If you're going to spread the ball, then you need to have the the $20 games and the studio. But my point my point to that is just like I think there's always going to be a giant bucket of developers making those kind of games where that's not for your first party studios. You want to worry about somebody who's",
            "start": 3813.04
        },
        {
            "text": "to that is just like I think there's always going to be a giant bucket of developers making those kind of games where that's not for your first party studios. You want to worry about somebody who's going to make something AAA and awesome and this experience that defines your company, defines your platform. And I don't think that necessarily that's what's happening with Housemark in the same way that I don't think that's what's happening with Drink Box where I think I think those guys are kind of in that bucket already of like, okay, these guys are making great games and if one of them went to Microsoft and was only making their games, that would suck, but we'd have another giant bucket still of like people who are making awesome stuff that's here. I don't think we need to get into bed with any like bucket analogies. I do. It's like how my old review score analogy. I like that a lot. Put all the seven fives in here, put all the eights in there, and you just debate about what's in the",
            "start": 3847.36
        },
        {
            "text": "any like bucket analogies. I do. It's like how my old review score analogy. I like that a lot. Put all the seven fives in here, put all the eights in there, and you just debate about what's in the bucket. You know, we have to get into [ __ ] 7.75 [ __ ] [ __ ] it. [ __ ] it. Two tears in a bucket. Yeah. Colin, it's trophy time. What do you got for me this week? Let me lift Let me lift up this laptop. We lift them up to the Lord. It is right to give him thanks and praise you up can stand on a mountain. All right. Let's see. Uh All right. So, trophies. new trophies. So, the interesting thing here is Kinetic has trophies that are live. Connecticut, of course, Sony Santa Monica's very first game, right? PS2 game. It's a racing game. This is before God of War for all you [ __ ] noobs out there. Now, uh Kinetic looks like it's going to come out on PS4 maybe next week. Wild Arms trophies went up at the same time. Um Overwatch's trophies are live, so we'll take a look at those. Uh Wild Arms",
            "start": 3881.04
        },
        {
            "text": "Now, uh Kinetic looks like it's going to come out on PS4 maybe next week. Wild Arms trophies went up at the same time. Um Overwatch's trophies are live, so we'll take a look at those. Uh Wild Arms 3's trophies we'll take a look at. Should we take a look at Magga Tag mentioned Blanc plus Neptune versus zombies trophies? Under no circumstance should do we look at those trophies. Okay. Um let's look at Shadwin's trophies and my night jobs trophies. Does that all work for you? That works for me. Okay. So Overwatch 53 bronze, five silver, one gold, one platinum. No one owns it yet. Let's see. Uh, so reach level 10, reach level 20, reach level 50, win 100 games in quick or competitive play, play a quick or competitive play game in a group with a friend, collect 50 unlocks for a single hero, earn 21 postgame cards in quick or competitive play. So obviously being the nature of the game, all heavily online, heavily multiplayer, heavily competitive. Yeah. Trophies. No, thank you. Um, and there",
            "start": 3928.0
        },
        {
            "text": "21 postgame cards in quick or competitive play. So obviously being the nature of the game, all heavily online, heavily multiplayer, heavily competitive. Yeah. Trophies. No, thank you. Um, and there are, as you can tell, a [ __ ] ton of bronzes indeed. I couldn't. You can't really, I don't think, have any more bronzes than this game has cuz I would assume that you have to have Well, I guess there are games with no silver trophies, but are there platinum games with no gold trophies? I don't think. Yeah, there's pl there's games with platinums and no golds. Yeah, I want to say cuz that's always the weird thing where it jumps from a silver bronze silver. The Walking Dead was one of those games. Let's check. I'll look into it. You keep working. I'll get back to you. Maybe I'm wrong. I wish there was a way to search it easily. Wild Arms 3's trophy. So, nine bronze, 13 silver, five gold, one platinum. Um, upgrade an arm attribute level five. It seems like a lot of these are storybased. Uh,",
            "start": 3982.88
        },
        {
            "text": "was a way to search it easily. Wild Arms 3's trophy. So, nine bronze, 13 silver, five gold, one platinum. Um, upgrade an arm attribute level five. It seems like a lot of these are storybased. Uh, different migrant levels. Um, yeah, a lot of story based stuff. Explore 100% of the world map. Defeat Ragu Ragla for the final time. Uh, as a secret enemy. Um, let's see. Reach level 90 with Virginia, Clive, Jet, and Gallows. So yeah, there's some there's some grindy ones here, but I think you can do it. I don't know if there's any missable ones. Shadwin has 36 bronze, eight silver, three gold, one platinum. Completing the levels. Wow. Okay, so complete level 15 gives you one through 15 gives you trophies. Kill all the guards in all of them gives you trophies. So those are 15 more trophies. Don't kill anyone in different levels gives you a whole set of trophies. Yeah. So basically the entire trophy list is populated by beating levels and then killing everyone or killing no one. So it sounds",
            "start": 4021.68
        },
        {
            "text": "kill anyone in different levels gives you a whole set of trophies. Yeah. So basically the entire trophy list is populated by beating levels and then killing everyone or killing no one. So it sounds like it's going to be need to be replayed at least twice. And my night job is the final one we'll look at. That's 12 bronze, one silver, one gold. Uh let's see. I don't really understand these trophies. This is a bad this is a bad choice for the record. No, there was there was a silver and a gold in the walking dead there. Okay. So anyway, those are the trophies that we'll talk about today. Not too many new trophies going up will have any consequence. Uncharted 4, by the way, people are really You platinumed it. Yep. Um, let's look at the platinum list. No. Okay. 93 people already have the platinum. That's people get crazy out there. Insane, actually. You got to do it. Um, yeah, I I got to get to it eventually. I'm not going to anytime soon. Yeah. I mean, you're I feel like it's going to be",
            "start": 4073.92
        },
        {
            "text": "That's people get crazy out there. Insane, actually. You got to do it. Um, yeah, I I got to get to it eventually. I'm not going to anytime soon. Yeah. I mean, you're I feel like it's going to be a while before you double back to it. Yeah. I mean, I'd like to play it again. I mean, I loved it. Um, but there's just too many games and I don't have enough time to play them all. I mean, that's the [ __ ] problem, dude. I know. No, there are too many games. cuz I 100% agree with you. Um, okay. So, I'm trying to figure out I know I want to This is perplexing now cuz I want I want to say that I have seen games without golds that end in a platinum, but is that really possible? Is that just in my head? Well, games end without a gold trophy, but they might have a gold trophy. No, no, I'm aware. I know. I'm not saying like in the lineage of it. I'm just saying to the point we're talking about in terms of how many cuz you can break up the points however you want. So, it could be all bronzes and",
            "start": 4118.16
        },
        {
            "text": "know. I'm not saying like in the lineage of it. I'm just saying to the point we're talking about in terms of how many cuz you can break up the points however you want. So, it could be all bronzes and then the platinum. Someone out there knows the answer. I'm sure we'll find out. Okay, good. Let us know. Uh, we have one question for trophy time. It comes from Caleb for Tribe. He wrote in to kind of funny.com/psq just like you can. It says, \"Hello, Colin and Greg. I think we can all agree that the best and most rewarding platinum trophy comes from a game that makes you do it in two playthroughs. One to simply enjoy the experience and the other to obtain collectibles, complete challenges, etc. I recall a discussion that you guys had about being annoyed with the Last of Us requirement to play through it at least three times. You both agreed and that was too much. So, this is my question. With your limited time, if a game allows you the opportunity to platinum it in one go around, is it",
            "start": 4159.12
        },
        {
            "text": "through it at least three times. You both agreed and that was too much. So, this is my question. With your limited time, if a game allows you the opportunity to platinum it in one go around, is it unethical to play through without a guide the first time? I did this for the Order 1886, and while I didn't get a natural experience with it, it allowed me to get the platinum without having to bear through that pretty boring game again. I'm interested in your thoughts on the matter. Cheers, Caleb. PS. I love you like a song, baby. And I keep hitting repeat. Um I don't agree with him from the get-go. I I don't think it's unethical. I've used trophy guides to platinum a game in one run many times. So for the I'm saying I don't agree with him that the most rewarding comes from two playthroughs. No, I don't I mean I don't I don't agree either. I I love uh one that you can just you play through the game and then you can double back and do whatever. And I don't like playing games a second time. I",
            "start": 4196.56
        },
        {
            "text": "I don't I mean I don't I don't agree either. I I love uh one that you can just you play through the game and then you can double back and do whatever. And I don't like playing games a second time. I feel like I'm always wasting time. I want to get to the next thing, go to the other thing. So going back and playing a game again always takes something out of it for me. Um, I'd rather just like, you know, even though I had to play Uncharted what, three times and there is now, it looks like an exploit for speedrun. So, you should probably actually get on that before they do it because it's super simple. What is it? You have to just start in the last chapter or something. No. Yeah. The memory if the memory serves, we'll have to look it up. Is and everybody can look it up too, and leave in the comments in the YouTube video. Is that you start a new game, play the first section, save it, quit. uh this after you've already beaten it once. Come back through chapter select, load the epilogue,",
            "start": 4235.2
        },
        {
            "text": "comments in the YouTube video. Is that you start a new game, play the first section, save it, quit. uh this after you've already beaten it once. Come back through chapter select, load the epilogue, play through that and s choose the save slot over the game you just started and then that at the end of the epilog should click it over. But the initial report I said was saying it doesn't work every time for or for so it's like I'll just do the normal I don't know. Yeah, I don't want to be labeled a cheater. But no, I hate [ __ ] I I would much rather it be that I'm trying to think of a great example of it. I don't I don't have one, but I mean, let's think if it was I don't know why I can't think of one off top of my head, but like a Fallout where I beat Fallout. Great. And then it was like, \"All right, cool. Now I got to get to level 50 with the character. Now I got to go find this these quests or do this kind of thing.\" I don't want to restart even with Fallout where it's like, \"All",
            "start": 4265.2
        },
        {
            "text": "\"All right, cool. Now I got to get to level 50 with the character. Now I got to go find this these quests or do this kind of thing.\" I don't want to restart even with Fallout where it's like, \"All right, cool. Now go side with the other group. All right, now go side with the other group.\" Like, I like seeing those endings of like seeing how that played out. And I would have done that on my own, but it would have been more rewarding for me not to have to go back and do that cuz like I keep saying like now the Fallout DLC is out this week, right? And I need to go through and figure out which one of my [ __ ] saves I'm going to use and where everything is. Well, remember too that Fallout 3's trobies were [ __ ] because you had to have you had to reach level 10, 30 or 20 and 30 or 10, 5, 10, 15, whatever it was with uh different karmas. Yeah, different karmas and you can manipulate the [ __ ] out of it and that's what I did. But like that was nonsense. Like that sucks. Like that's not",
            "start": 4302.8
        },
        {
            "text": "15, whatever it was with uh different karmas. Yeah, different karmas and you can manipulate the [ __ ] out of it and that's what I did. But like that was nonsense. Like that sucks. Like that's not fun. No. And u and so yeah, there's something to be said about, you know, the enjoyment factor of the trophies as well. And I don't find Yeah. Replaying once again for on the harder difficulty or to get collectibles, it's not a big deal. But I I do like the idea of a game that can be beaten even if you have to beat on it hard the hard hardest difficulty level that just playing it once and if you did it completely then you get the platinum. I think that's totally fair. Yeah. And I don't like I like doubling back like I think Uncharted does it great with its collectibles in this one, right? Where you double you want to go you can go chapter by chapter and see how many optional conversations you missed and where you missed treasures. And it's not I hate that cloak and dagger [ __ ] where you",
            "start": 4330.0
        },
        {
            "text": "you double you want to go you can go chapter by chapter and see how many optional conversations you missed and where you missed treasures. And it's not I hate that cloak and dagger [ __ ] where you don't know if that's where it is. Even Ratchet with like gold bolts, you know what I mean? Last night I was looking at before bed I was like, \"Oh, great. Okay, I know exactly where to go or what to do or like where I'm [ __ ] off and it's not one of those like [ __ ] where is everything. I hate that [ __ ] where you're left like when I lost the one blast shard in infamous nightmares. Yeah, can't do that. Can't do that. Colin, it's time for the return of a segment. Dear Shuhi word wrote into kind of funny.com/psq and says, \"Hey guys, I have requests for shoe on the PlayStation store. Actually, it's two requests, but both involve the same feature. Remember, if you have something for dear Shuhi, you write in with a question and then we read it here so you can make your plea to Shuhi Yoshida",
            "start": 4364.88
        },
        {
            "text": "it's two requests, but both involve the same feature. Remember, if you have something for dear Shuhi, you write in with a question and then we read it here so you can make your plea to Shuhi Yoshida and the rest of the PlayStation Nation on what needs to happen on that their PlayStation. But we take time off. This is the first time we've done this segment in like 3 weeks cuz a lot of you were just making little baby requests. At some point, the PlayStation store added the wish list. You can click the heart on titles and add them to your wish list. I love this list as I get to keep track of the titles I don't own yet, but I but want to get some here's some stuff he wants to add is what he's trying to say. Request number one, have a notification for when there are price drops/sales/playstation plus discounts for items on your wish list. I check the sales every week, but it would be nice if Sony could notify me when a title I've added on the list goes on sale in some capacity. Request",
            "start": 4400.72
        },
        {
            "text": "plus discounts for items on your wish list. I check the sales every week, but it would be nice if Sony could notify me when a title I've added on the list goes on sale in some capacity. Request number two, allow me to share my wish list through a website link of sort. Like with Amazon, I can add things to my wish list and when my birthday or Christmas is coming up, I can simply send the link to my family, whether they have Amazon accounts or not, and they can view the things I currently want. I want this to be a thing with PlayStation as well, allowing people who don't have PlayStation Network accounts to access my direct wish list and purchase something for me. I think it would be amazing. Please, Shu, make my heart happy by making the heart of the PSN more useful. Sincerely, Owen. PS. I think I love you, but I want to know for sure. Those were good. Those are reasonable. The wi the wish list. I Why can't we buy things for friends? There's a whole bunch of little stuff like there.",
            "start": 4437.84
        },
        {
            "text": "I think I love you, but I want to know for sure. Those were good. Those are reasonable. The wi the wish list. I Why can't we buy things for friends? There's a whole bunch of little stuff like there. Now, granted, I'm always excited when I turn it on and it's working. Turn on the PSN's up there. Great. That's good enough. I'm not asking you to tax the systems too much. Push this thing into a system where it can't go. God forbid we have, you know, something, you know, usable. We're just happy we're still, you and I are still here. We're looking at that. We marvel that it works, that the trophies load fast. I'm not not, you know, don't not as much to complain about as you don't put all this wish list stuff on the forefront. If it's going to break the system, if it's going to break the network, just take your time. Get it get it there. But like some of these I I agree with word word that some of these would be good for wish list editions. Sure. Con. Yes. Let's keep let's keep it with the",
            "start": 4471.12
        },
        {
            "text": "just take your time. Get it get it there. But like some of these I I agree with word word that some of these would be good for wish list editions. Sure. Con. Yes. Let's keep let's keep it with the listeners. What do you say? Sure. We'll go through see what they're saying. I have a whole bunch of Uncharted related questions, but not Uncharted like, \"Hey, can you believe that Sully turned out to be a [ __ ] robot this entire time?\" That was that was unbelievable, but that's fine. Let's start with Evan Wallace, who says, \"Hey fellas, hello. I want to talk about game length in Uncharted. Why does the order 1886 get grief for being a short game, but all Uncharted games can be completed in less than 6 hours, especially Uncharted 4 with a speedrun trophy? I'd love to hear your thoughts. Keep doing you, Evan Wallace. And what [ __ ] universe are you being uncharted in under 6 hours if you're playing it like a normal human being? You can beat the order like a normal human being in 5 hours.",
            "start": 4504.88
        },
        {
            "text": "doing you, Evan Wallace. And what [ __ ] universe are you being uncharted in under 6 hours if you're playing it like a normal human being? You can beat the order like a normal human being in 5 hours. Yeah. Watching every cut scene, exploring the environment trying to find the items that So, I don't understand the question. No, I don't understand the thing either. I I think he's totally I think if you're looking at the trophy for the speedrun in six hours and equating that to being like that's possible on your first playthrough, I don't think you can watch all the cut scenes in six hours. probably the way the [ __ ] game plays. You're Don't worry about it. It's not the same thing. It is not the same thing. Don't worry about it. That's an insult to Uncharted. But in terms of why the order gets [ __ ] the order got [ __ ] for a lot of reasons. The length was not one of my main gripes with it. It was just a boring game. It was a boring 6 hours is my grip with the order. And I don't mind",
            "start": 4545.76
        },
        {
            "text": "gets [ __ ] the order got [ __ ] for a lot of reasons. The length was not one of my main gripes with it. It was just a boring game. It was a boring 6 hours is my grip with the order. And I don't mind like look at me with Gone Home. I'll totally, you know, ring [ __ ] chapel bells all around the world for a game and not if it's an hour and a half. That's not the point. If it's an experience that's mattered. Why do you ring the chapel bells for them? Cuz that's how you alert people to what's happening. You know what I mean? That's people hear the bells going off in their town from their church. Now it makes it makes a lot more sense to me. Right. Right. Right. Right. Right. I don't think that's the main hang up of the order. It's one that a lot of people who are, you know, haters want to lean on a lot. Oh, such a short game. That's not the problem with Yeah. If you're a clown, that might be the problem. But other than that, not to mention there's so much to do in Uncharted and double",
            "start": 4579.84
        },
        {
            "text": "lean on a lot. Oh, such a short game. That's not the problem with Yeah. If you're a clown, that might be the problem. But other than that, not to mention there's so much to do in Uncharted and double back for and collect and see. Like it's not the same. It ain't the same [ __ ] thing. Brad Makus. Brad Makus says, \"Hey Colin, hello.\" He said, \"Wait for the hello.\" Good job. And hi, Greg. I'm going to keep this short. Do you think any of the trailers and gameplay showings that led up to the Uncharted 4 reveal spoil too many of the cool sequences and location from the game? My friends are kind of bummed over the E3 show basically spoiling one of the greatest moments from the game, but I'm rather indifferent. I understand the need to build hype, but maybe there's just a better way to go about it. What are your thoughts? Thanks, guys. Brad, PS, say hi to Pat for me. Um, I agree with 100%. I mean, I can't agree or disagree because I just I I intentionally avoided it. Yeah. So, because I",
            "start": 4611.12
        },
        {
            "text": "it. What are your thoughts? Thanks, guys. Brad, PS, say hi to Pat for me. Um, I agree with 100%. I mean, I can't agree or disagree because I just I I intentionally avoided it. Yeah. So, because I assumed that was going to be the But you still saw stuff. I saw some stuff and I was disappointed that I saw it. Yeah. No, that was the the big problem. And I think it's reflected in the review when I'm talking to Tim about uh and there's no spoilers here about the lack of giant set pieces and crazy set pieces. I remember spoilers for Uncharted 3 when like the day before we got our Uncharted 3 copies, they showed uh uh the subway commercial showed the plane breaking in half and like Drake flying out in without holding on to anything. And it had never in my mind occurred to me that that might be a possibility that he was you would be free falling in this game. And so when I got to that point, I was like, that sucks that I know was happening. And I remember playing Uncharted 4 and being like,",
            "start": 4650.72
        },
        {
            "text": "a possibility that he was you would be free falling in this game. And so when I got to that point, I was like, that sucks that I know was happening. And I remember playing Uncharted 4 and being like, okay, cool. Like all right, this is that part. I saw this at, you know, okay, this is the PSX demo. This is when the demo broke. Okay, cool. I've seen this part, but it'll be fun. All right, going a little bit further. Okay, all right. This is the the Jeep demo from E3. This is the one I This was awesome when it happened to D3. Play through. That's fun. And then it was like, [ __ ] those were like there's moments in here, but like the moment the big moment was the that E3 demo and the E3 demo, if if I hadn't seen the E3 demo, if they hadn't shown that demo to E3, if they hadn't shown it behind closed doors and then released it all to the public anyway, like if you didn't know that would happen, I agree with your friends that that would have been one of the greatest moments in from any",
            "start": 4690.96
        },
        {
            "text": "closed doors and then released it all to the public anyway, like if you didn't know that would happen, I agree with your friends that that would have been one of the greatest moments in from any game, let alone Uncharted. like you would have been I would have I as it was playing it and I was having a good time don't get me wrong but I'm doing the thing where I'm like going down in the jeep like in there and I remember like you know talking to Bruce Neil afterwards the fact like you can take any pathway to get them I'm like oh that's cool and I deviate a little bit I'm like oh cool they're right no neat and sly joke to the guys about first- time driver and it's like oh and then it's like oh cool I'm going to hang out I'm going get drunk and it's like I was like some point in there where I'm just like [ __ ] can you imagine playing this with no context can you imagine playing this and having no idea any of that was about to happen like how I preview games anymore. How crazy that would",
            "start": 4730.4
        },
        {
            "text": "just like [ __ ] can you imagine playing this with no context can you imagine playing this and having no idea any of that was about to happen like how I preview games anymore. How crazy that would be. I know. That's what I That's what's nice about us is that usually it is. Yeah. Like, oh, cool. That game looks great. Blackout. Don't even know anything about anything about I don't know anything about any of these games I'm excited about. That's what's so fun about it. Yeah. V2 Drake wrote in to kind of funny.com/pq and says, \"Hey, Greg and Colin, I have a rather exciting theory. Spoilerfree. So, Uncharted 4 has greatar PS4s and I happily spent upwards of it's like an upside down J with a line through it. 200 on everything from the game to merch to DLC. It's my favorite franchise by far. And like you, Greg, I'm in it for the relationships. It's the reason why I had to play it almost nonstop until the end hit. I need to know everything how everything panned out. That brings me to my",
            "start": 4762.4
        },
        {
            "text": "And like you, Greg, I'm in it for the relationships. It's the reason why I had to play it almost nonstop until the end hit. I need to know everything how everything panned out. That brings me to my theory and question. Without spoilers, do you think the single player DLC for Uncharted 4 could be a zero combat adventure with I'm going to leave all that out. I don't like that. I don't like what he said there. It could be zero combat adventure. Yes, I remember Colin said in his review Left Behind that it would have been even better if there were no combat. No combat. I'd love Adventure. No combat. Would you think they'll be You think they'll be Do you think Do you think it'll be that though? Yes. Really? Yeah. I I say under no circumstances. It's So the problem with the Well, I don't want to talk about this because this this is too Okay. It's It's impossible not to spoil the game. If you want to talk about it like this, I don't think we need to. My whole thing is I think is it possible",
            "start": 4803.28
        },
        {
            "text": "talk about this because this this is too Okay. It's It's impossible not to spoil the game. If you want to talk about it like this, I don't think we need to. My whole thing is I think is it possible that there'd be a combat free uh DLC for Uncharted? Sure. Do I think that's going to happen? No. I think that Last of Us was your best chance of that because combat was so they could have gotten away without it with that was what was so frustrating about that was that the the Left Behind was awesome and then at the end there's like an arena like you're in the mall and you're fighting everyone and I'm like why does it have to end like this? Why didn't you just end it? Why can't like they don't fight every day of their lives, you know? Give us a glimpse into their lives when things are just normal for them, right? And they did that for the most part, but that was that was where the left behind was. And see, I think it's just I think I think that I think uh Naughty Dog probably took that to",
            "start": 4851.6
        },
        {
            "text": "for them, right? And they did that for the most part, but that was that was where the left behind was. And see, I think it's just I think I think that I think uh Naughty Dog probably took that to heart in terms of what they could have done there. And interesting, I think I do think that the Uncharted DLC will be Uncharted. I don't think I think Uncharted is these zany adventures and shooting a gun and da da da. So, is it going to be some kind of prequel to Uncharted 4 wherever in the Uncharted timeline of Nate and Sully on an adventure? Is it going to be something with Sam and Nate Nate on an adventure? Cuz clearly they work together for a while. You know what I mean? Or is it going to be Yeah. Is it going to be an offshoot? Is it going to be Cutter and Chloe? Is it going to be Elena doing her own? You know, I mean, there's so many different ways that you can [ __ ] around. But I think you still have shooting in there. About Flynn. Oh, man. A prequel for Flynn. Man, I'd love to see.",
            "start": 4888.64
        },
        {
            "text": "her own? You know, I mean, there's so many different ways that you can [ __ ] around. But I think you still have shooting in there. About Flynn. Oh, man. A prequel for Flynn. Man, I'd love to see. What about a Lazarovich RTS? I love that. How he rose to power to become such a war. I really enjoy that a lot. Talk Speaking of That Last of Us, Benny Blackout wrote in and said, \"Hey, Colin and Greg.\" Hello. With Naughty Dog's tendency to announce their next title relatively soon after their last release, parenthesis, The Last of Us announced a month after Uncharted's release and Uncharted 4 announced within a year of The Last of Us being released and it most likely being a Last of Us sequel that's in the works. I was wondering what you guys thought the game would be called. In my opinion, The Last of Us 2 sounds clunky and redundant. And I can't help think that something like The Rest of Us would work better. And if indeed the series makes it to a trilogy, called Call the finale, The End",
            "start": 4929.12
        },
        {
            "text": "Last of Us 2 sounds clunky and redundant. And I can't help think that something like The Rest of Us would work better. And if indeed the series makes it to a trilogy, called Call the finale, The End of Us. What do you guys think about this suggestion? And what would the ideal title for The Last of Us sequel be to you? Thanks, Benny from O Australia. PS. I love you, Greg, but us Aussies don't talk like that. Save it for the Pomies. [ __ ] you. I'll say whatever I want. Benny Black, I like the idea of the end of us. I think that's cool. the um that's a nice convention, but I think that it'll be called The Last of Us 2. Uh or The Last of Us colon game or something. I don't know. My name It's going to be The Last of Us colon, whatever it is. And that's where all the scuttlebutt about the poster in the game is coming from, right? The Last of Us American Daughters. We've talked about it on the spoiler cast, so I won't go into too much here cuz I don't know where you are or anything else,",
            "start": 4963.2
        },
        {
            "text": "in the game is coming from, right? The Last of Us American Daughters. We've talked about it on the spoiler cast, so I won't go into too much here cuz I don't know where you are or anything else, but you know, there's Easter eggs and stuff like that. But what it's going to be, I don't know. But I think The Last of Us in like what we talk about with what we'd want out of a sequel, Last of Us, may you want it to pick up right away. I'd be totally fine with new stories, new people, whatever's happening in that world. I think The Last of Us becomes this universe in a way. It becomes its own anthology. And I think that's the way you build off. I agree. I don't like Last of Us 2, but that also we already know sequels sell better. So if you put it on there, it's going to do better than last. There has to be a call to The Last of Us in it. So in the title. So yeah, two or the colon thing. I think it's probably safe bet or Yeah. you know, um I'm excited to see I really do hope it it it's about",
            "start": 5006.48
        },
        {
            "text": "has to be a call to The Last of Us in it. So in the title. So yeah, two or the colon thing. I think it's probably safe bet or Yeah. you know, um I'm excited to see I really do hope it it it's about Joel and Ellie still, but I really care about those characters. I care about the world as well and the Fireflies and all that, but I but I just feel like there's so much more to be told there. I don't I it's got they have to be in it at least. What do you think still left to be told? And I mean, I know it's hard not to spoil. [ __ ] it. We're going forever. Yeah, came out three years ago. Joel and uh which is unbelievable. Joel lies to Ellie and Ellie tacidly kind of acknowledges it but not really. So just Okay. So I think that the story should probably I would like for it to take place right after the ending. But I think that it should very at least take place of her like being rising in prominence in some way in the resistance or in the um not really the resistance but the fireflies or",
            "start": 5040.24
        },
        {
            "text": "after the ending. But I think that it should very at least take place of her like being rising in prominence in some way in the resistance or in the um not really the resistance but the fireflies or whatever and maybe Joel is dead or maybe Joel you know becomes a bad guy or something. I don't know. Like there's a lot of different ways but I think cuz I just feel like when we start talking about that it's like it's a really interesting pick from the picking right back up but then like what's the conflict I don't and like what's their motivation anymore and what's their goal like you know I mean the thing the Last of Us nailed I thought so well was cool your mission is to protect this girl she is the future she is can save everything da da da da and then we get to the end of the last of us and now we're just going to live our lives and I feel like I don't know what we come back from living our lives to do necessarily it would be interesting the conflict I think could be interesting a it",
            "start": 5082.56
        },
        {
            "text": "now we're just going to live our lives and I feel like I don't know what we come back from living our lives to do necessarily it would be interesting the conflict I think could be interesting a it starting right after it but not necessarily taking place right after it. I think it's entirely possible. That's the way the first game started too. So, it would be interesting to see what their their conversation was like and then just fast forward 20 years or fast forward 10 years, whatever and there's some sort of relevance where they have a falling out or something like that. Um there could be rumors spreading among settlements and stuff that that this girl is the is could cure us and and selfishly was removed from that that situation by another guy, you know, trying to save her life. And there's a lot of like conflict. I mean, I I I don't think you could you could have a very hard time figuring out how the game would what the game would be about. I think it can go in a million different",
            "start": 5122.56
        },
        {
            "text": "a lot of like conflict. I mean, I I I don't think you could you could have a very hard time figuring out how the game would what the game would be about. I think it can go in a million different directions and be totally compelling. Um, but unlike, you know, you look at you used to talk about The Walking Dead, about how it's about those characters, not about that world. Well, I think The Last of Us is somewhat the same. I think the ethos and the and um it's not even that. I think that the the mythology of the the universe is is important, but I do think that like Joel and Ellie are your grounding. Sure. I mean, they're the characters I care about in that universe, but I think I think it would be a huge risk to make it not about them. I think I think the other side though is then what you're talking about though is how much you care about Joel and Ellie. And I think that coming back to those characters could ruin it. Now, would would they? Probably not. They're naughty. They apparently",
            "start": 5159.44
        },
        {
            "text": "talking about though is how much you care about Joel and Ellie. And I think that coming back to those characters could ruin it. Now, would would they? Probably not. They're naughty. They apparently can't do anything [ __ ] wrong. I keep waiting for them to [ __ ] up. They haven't done it. So, but I think you could come back and then it is this weird transition back into that world, those characters, those people. I would I would it'd be cooler for me to start on Last of Us Colon, whatever the [ __ ] it is, not knowing what is happening, whatever my motivation is, whatever my story is, and then you run into an Ellie who's 10 years older, who has been off, and trying to figure all these different things out, and then maybe she's gone bad or something like that. Yeah. Even if it's about if it's different protagonists and different motivations, they have to one of them has to be in it. It would probably be Ellie. I don't know. We can dedicate a whole toss to this in the future because I",
            "start": 5197.68
        },
        {
            "text": "it's different protagonists and different motivations, they have to one of them has to be in it. It would probably be Ellie. I don't know. We can dedicate a whole toss to this in the future because I do have a lot of ideas about how The Last of Us can go. But um because unlike The Walking Dead, there is now the intent. There is now the idea that there's a cure. Like that this can actually be fixed. The Walking Dead, it's over. Like it's over in The Walking Dead, right? Like there's no They They messed with that with this the CDC a little bit in the beginning. Yeah. But like not It seems like there's a lot more complacency in that world and in this world, even though it's more recent in that world. In this world there's complacency yet there was also hope and so I think that you can kind of play narratively with those but I say we double down it's another tot like I guess my problem I see what you're saying like but the thing is right that only her and Joel know everybody else is dead",
            "start": 5229.2
        },
        {
            "text": "play narratively with those but I say we double down it's another tot like I guess my problem I see what you're saying like but the thing is right that only her and Joel know everybody else is dead now granted there's information out there I guess you could come around and try to piece it all together is going to go to that hospital and find everyone massacred and they know you know so it's not that it's not that only those two only those two people know that this is the option they all And they're going to sound the clax on that this is like this girl is now a fugitive basically. So then, but so then I mean what do we what's this the narrative we're we're thundering through is now they're just on the run and they're trying to capture her to do the exact same to come to the exact same ending we saw before maybe or there could be I I think it can go in like all sorts of different directions where like there could be a religious or philosophical argument that like this is what's",
            "start": 5268.4
        },
        {
            "text": "ending we saw before maybe or there could be I I think it can go in like all sorts of different directions where like there could be a religious or philosophical argument that like this is what's supposed to happen and there's a group that's like fighting to be like no like they did the right thing like you're not allowed to kill this girl we don't want a cure like this is nature like there could be all sorts of really interesting and bizarre ways you can go about it The fireflies will actually obviously play pretty prominently in it. And the fireflies are technically the good guys, even though that you would be. And that's where it kind of turns things on their head where it's like, but they're technically the bad guys in the game, but they're not really the bad guys. No, that's what I always said, right, when I beat it. I I I remember putting the controller down and being like, I can't believe I was the bad guy. I can't believe Joel was the bad guy. And then, you know, every",
            "start": 5309.76
        },
        {
            "text": "I always said, right, when I beat it. I I I remember putting the controller down and being like, I can't believe I was the bad guy. I can't believe Joel was the bad guy. And then, you know, every everybody he talks to like, well, I you know, that's actually just Neil Duckman of just like, well, that's how you interpret it. I'm like, no, no, that's how it is. You know what I mean? He could have saved humanity. And then we get this whole argument. And my whole argument, even though Neil said that that wasn't really in his writing or whatever, I still think it's easy to infer and I think it's fair to infer that they didn't know if it was going to work at all. So there's all these hypotheticals and all these questions, but he in that hospital in Salt Lake City, he I think it was in Salt Lake City, he just killed a bunch of people and like they're going to find that. And so Joel's in a lot of trouble. And so it would be interesting to see where they go with it. I just think it's I don't",
            "start": 5340.16
        },
        {
            "text": "City, he just killed a bunch of people and like they're going to find that. And so Joel's in a lot of trouble. And so it would be interesting to see where they go with it. I just think it's I don't think it's a copout because it would be hard to make a new story in that world that would you would care as much about Joel and Ellie. So, it would be a bold move to be like, well, it's not about them anymore. But, I think it would be also a copout to be like, well, we're just not going to wrap this up cuz I do I don't think it's wrapped up at all. I think there's like way more open-ended questions now about what their relationship with each other and what happened and are the Fireflies going to give up and are there other people that have the cure or are imbued with the cure and stuff like that. I think there's that's that's why it's so fascinating to see what the second game is gonna be all about. And I do think that you have to have about about Joel and Ellie or Elise Ellie. So, okay,",
            "start": 5371.2
        },
        {
            "text": "I think there's that's that's why it's so fascinating to see what the second game is gonna be all about. And I do think that you have to have about about Joel and Ellie or Elise Ellie. So, okay, we'll see. We will everybody. Mr. Snarub writes in and says, \"Hey, Colin and Greg, can you have Jack Trenton read the following? Hey, kids. You want to come take a ride with me in my van? We've got a wide variety of exhilarating software across all our PlayStation platforms.\" And you can do this one. Hey, Colin. It rubs the lotion on its skin. It does this whenever it's told. It rubs the lotion on its skin or else it gets the hose again. We've got an exciting lineup of adling games coming soon to PlayStation. And finally, hey Greg, you got a real pretty mouth, ain't you? Check out these immersive and visually stunning PlayStation games that we have planned for you to enjoy in the coming year. I'm Jackie T Creeper. Our incredibly horrible impression of Jack. Sounds nothing like the man. Super",
            "start": 5403.36
        },
        {
            "text": "and visually stunning PlayStation games that we have planned for you to enjoy in the coming year. I'm Jackie T Creeper. Our incredibly horrible impression of Jack. Sounds nothing like the man. Super nice. We just keep melding him. Colin, I want one last question for you. Okay. I'm getting a little tired. Like I'm getting a little like I feel like I put I put so much energy into everything today. You know, I had a good day today. Ravster95 says, \"Oi, I've got a simple question. With Project Spark closing its servers, do you think Media Molecules Dreams is doomed to fail? These types of games just don't seem to have the traction. And with Dreams only being on PlayStation 4, I really think it's going to completely bomb.\" Which is a shame because I love the Media Molecule. Thanks. Can't wait for you guys to come to England for a cheeky Nandos and some tea biscuits. Ravi Patel, Bolton, England. So I I you know we they came and visit us at GDC but they asked to come visit us. Media",
            "start": 5449.2
        },
        {
            "text": "wait for you guys to come to England for a cheeky Nandos and some tea biscuits. Ravi Patel, Bolton, England. So I I you know we they came and visit us at GDC but they asked to come visit us. Media Molecular. Yeah. Media Molecular specifically show me Dreams because I just don't believe in it. I didn't really understand it. Now I understand it a lot more and I think it's quite dynamic and I think it's quite interesting and I think it's quite clever and Do you think it's a game yet? But uh it's a game I guess if you want to term it like that. I still think that the game is not going to do well and I and I and I think that they I I hope that they're not in trouble because in talking to them and really marinating on it like for a while like what we talked about on the stream and like they don't seem to have a game yet. Like they were talking about how they made their tools and now they make the game, right? Like and and now they're going to make their game with the tools. So you can show",
            "start": 5492.24
        },
        {
            "text": "seem to have a game yet. Like they were talking about how they made their tools and now they make the game, right? Like and and now they're going to make their game with the tools. So you can show see that you know you can make a game with these tools which is you know like little big planet but I agree like I don't know how you market this game. I don't know how you sell this game to anyone. I don't know why you'd let them make this game but I but I hope I'm wrong. You know I'm very pessimistic about it but I hope that I'm wrong cuz they are very talented. They're super talented. Oh yeah, we love those people. My thing is I don't think project Spark is the canary in the coal mine for dreams. I think project project spark's completely different and I think it shows Xbox Microsoft chasing what Sony had with little big planet where it's like all right cool Xbox One project spark and from the jump I saw project spark at the Xbox One San Francisco not reveal event cuz it was already",
            "start": 5535.36
        },
        {
            "text": "what Sony had with little big planet where it's like all right cool Xbox One project spark and from the jump I saw project spark at the Xbox One San Francisco not reveal event cuz it was already revealed but like your first chance to play all these Xbox One games and the demo crashed and it wasn't fun and I was like gh and then it came out and no one cared about it. No one talked about it. And Microsoft hasn't built that infrastructure, that community, that fan base that wants that kind of [ __ ] Sony has definitely built a fan base of like, here's some weird crap. Here's some weird artsy [ __ ] Let's, you know, everybody get super stoked about this weird ass game where you're a plankton just floating around eating other plank. You're like, \"All right, cool. Yeah, why not?\" You know what I mean? Like, PlayStation gamers, I think, have a more broad uh pallet for what they what can work and what doesn't work and how it's going to go. Dream is going to be interesting. I think Dreams yes",
            "start": 5571.44
        },
        {
            "text": "I mean? Like, PlayStation gamers, I think, have a more broad uh pallet for what they what can work and what doesn't work and how it's going to go. Dream is going to be interesting. I think Dreams yes is incredibly hard sell. It is super interesting. Like I look at it. I watch I you know I saw people build levels at E or yeah no PlayStation experience and all stuff and I'm like super cool. Love the tools. I remember how much how bad I was with little big planet tools. The tools aren't going to do anything for me. Is it going to find an audience that just wants to play the levels that just wants to play the games just wants to see things? Hopefully. Probably will. Yeah. Will it be big enough to ma make it a big deal and matter? You don't know. making this game forever. And that's that's the big problem when you get to Media Molecule is like, yeah, this is they've been in on this for a while. They've been heads down on this for a while. They did tear away and then, you know, tear away",
            "start": 5609.28
        },
        {
            "text": "big problem when you get to Media Molecule is like, yeah, this is they've been in on this for a while. They've been heads down on this for a while. They did tear away and then, you know, tear away unfolded, but like that wasn't the thing and this isn't the thing either. And it's is that question with you see Sony shutting down studios is this one where are they like on the evolution level, right, of like, all right, this better be a hit and you put it out and it's not. What does that mean for the studio? That sucks because it's not nearly their fault. Like if the game's good, like Drive Club was different with Evolution cuz they really [ __ ] that game up. Yeah. But if if Dreams is well executed and it scores in the eights or something like that and then it doesn't sell, like that's not really their fault. They're not the marketers and they're not the ones that green lit the game or funded it. So I but I don't think I don't think that's lost on PlayStation leadership. You know what I",
            "start": 5646.48
        },
        {
            "text": "their fault. They're not the marketers and they're not the ones that green lit the game or funded it. So I but I don't think I don't think that's lost on PlayStation leadership. You know what I mean? Like I don't think I don't you don't know how I mean from the way people talk about going in and pitching a game at PlayStation, right? Like you have to believe in it. So sure it isn't on them. They didn't greenlight it. They didn't do this. But they do have to sit there and be like, \"Well, fuck.\" Like, \"What have you given us lately in terms of this?\" You little big planet. Sure. And we love you guys for that. You know what I mean? Tear away loved by fans and critics, but didn't move units. It didn't dominate the world. I I don't know. I don't I hope they're not in trouble. I just I I mean, Dreams is clearly going to be a tough sell. I mean, Dreams is clearly not going to be a huge hit. Like, I just don't know how else to put it. Like I don't I don't see how this is going to be the game",
            "start": 5681.12
        },
        {
            "text": "Dreams is clearly going to be a tough sell. I mean, Dreams is clearly not going to be a huge hit. Like, I just don't know how else to put it. Like I don't I don't see how this is going to be the game that this is going to be the game that that that breaks open the floodgates with Uncharted and some of these other games of first party success. I'm like I don't think so. Yeah. Um I just I'm concerned for them but and I'm concerned for that game but I understand it a lot better now. And I can definitely say that and I think it's quite quirky and quite charming. Um but it's not for me. I have no I'm not eager at all to play it. Not even a little. That's the thing about it and based on the demos where I'm like, man, this is cool tech and this is cool and I I like what I'm seeing. I don't want to play. I'm not like, \"Oh man, I can't wait to play it.\" Totally excited to see what happens from a business perspective when it's out. Want to see what people creating it. Want to see all these",
            "start": 5716.64
        },
        {
            "text": "to play. I'm not like, \"Oh man, I can't wait to play it.\" Totally excited to see what happens from a business perspective when it's out. Want to see what people creating it. Want to see all these different things, but I haven't been sold in terms of I need to sit down and play this. I can't wait for Dreams. If Dreams was coming out tomorrow, I wouldn't be like, \"Oh, [ __ ] Here we go.\" I'm more excited for that Fallout DLC. I know you are. Colin, would you like to meet your new best friend? I have to. PS, I love this best friend. XOXO is where you write in looking for people to send PSN messages to you. Looking for people to send PSN messages uh friendship to you. And today is Adam Greeny. Adam Greeny writes in and says, \"Years ago, back in 2010 or so, I submitted my name for PS of the week on podcast beyond. My story of being dumped a day earlier while coming out of the shower naked earned sympathy from Greg and he actually friended me. One of the best days of my life. However, dot",
            "start": 5752.32
        },
        {
            "text": "on podcast beyond. My story of being dumped a day earlier while coming out of the shower naked earned sympathy from Greg and he actually friended me. One of the best days of my life. However, dot dot dot during the extra during the extra life that year, I jumped in to play Uncharted 2 multiplayer. Because of the limit on friends, Greg had to unfollow and unfollow and follow people to bring them into the game. Since that day, I have been a husk of a man, unfollowed by Greg, an empty shell. For this reason, I feel at some point in the future, I should submit my name and up I should submit my name and up the number of best friends I have in the PSN. In fact, let's make that day today. Adam Greeny. Adam Greeny. All one word, but it's e at the end of green. Adam Greeny, everybody go send him support, friendship requests, and be cool, folks. Colin, do you have this week's forgotten PlayStation game? It's your It's on you, actually, I think. Oh, is it really? And I don't have one. We We've",
            "start": 5791.6
        },
        {
            "text": "support, friendship requests, and be cool, folks. Colin, do you have this week's forgotten PlayStation game? It's your It's on you, actually, I think. Oh, is it really? And I don't have one. We We've been doing audience ones over and over again, so it's actually your turn. Okay. There's no forgotten game this week. It was forgotten. Okay. PSN's worst name of the week. This is where you go to kind of funny.com/formums. Submit your bad PSN name. Not one you've seen, but instead yours that you regret. This one comes from MC who writes in and says, \"Hey, Colin and Greg.\" Colin, get ready to feel old. I first acquired my PS3 during my sixth grade year of education. Terry Hot Indiana. Right, that's how I say that. Indiana born. Middle school starts during the year. Thus opening my still developing angxridden mind up to thousands of possibilities of PSN names that I will inevitably carry to my grave. Punk music was my life and I couldn't stop playing those damn darn Sonic Adventure games.",
            "start": 5831.52
        },
        {
            "text": "angxridden mind up to thousands of possibilities of PSN names that I will inevitably carry to my grave. Punk music was my life and I couldn't stop playing those damn darn Sonic Adventure games. Especially when it came to the game that started the what starred the leader of Edgginess himself, Shadow the Hedgehog. So, what do I go with? I sat for hours until I finally came up with a name that I would have in into my junior year of college with a trophy level of 17. Dark Creature 501. Dark Creature 501. My god, it was perfect. Though it lacks any type of vulgar verbiage, I still to this day am mocked online and by my friends for being a stupid 12-year-old kid because of this name. Along with being the epitome of stereotypical middle school PSN ID comes the extremely often mis misprononunciations of my name. Dark creator, dark dank creeper, and black creation. The number of genuine attempts I hear every time I hop into an online match truly floores me. I wish I can make this [ __ ] up,",
            "start": 5875.52
        },
        {
            "text": "of my name. Dark creator, dark dank creeper, and black creation. The number of genuine attempts I hear every time I hop into an online match truly floores me. I wish I can make this [ __ ] up, but if I'm lying, I'm dying. Now, only if Shuhei would let us change our names. The world would get rid of these dank creeper 501es middle school PSN IDs for good. Come on, Shu. Hey, just let her change our names. That's not a bad name. I'm a little disappointed in that one. I'm sure I'm not the only one. But it's the fact of the funny names after the fact. Nobody sees it. That's the problem. Nobody thinks about it. You think you got a name that's cool and then it's like everybody calls you Dank Creeper, right? They call you Dank Creeper is a great name. Black Creation. They call you dark creator. Big old dark creator. Big old dark creator. What are you doing over there, Colin? Big old Michael Strand. That name was brought to you by Gamefly. Are you ready to save monthly and play more games?",
            "start": 5922.72
        },
        {
            "text": "Big old dark creator. Big old dark creator. What are you doing over there, Colin? Big old Michael Strand. That name was brought to you by Gamefly. Are you ready to save monthly and play more games? Then let me introduce you to our sponsor, Gamefly. Gamefly is the best way to buy and rent all your favorite games. Just go to gamefly.com, pick your favorite games, and have them mailed directly to your door. They have more than 9,000 titles to choose from, so you can try before you buy. Go to gamefly.com/ps and start your free premium 30-day trial today. The premium trial allows you to check out two games and or movies at a time. And you can only get this offer by visiting gamefly.com/ps. Ladies and gentlemen, this has been psi I love you. XOXO episode 36. Remember, it is kind of funny.com's PlayStation podcast. It is the number one PlayStation podcast on the internet and it posts every Tuesday at 9:00 a.m. is one big video on youtube.com/confygames and MP3 services around the world. So",
            "start": 5965.84
        },
        {
            "text": "PlayStation podcast. It is the number one PlayStation podcast on the internet and it posts every Tuesday at 9:00 a.m. is one big video on youtube.com/confygames and MP3 services around the world. So share it with your friends. Grab it. Subscribe it. Share it. Yik yak it. You use the yik yak yet? Use the yik yak. What? There's this program called yik yak the kids like a lot. No. You want to get on that? Nope. Not even a little bit. Okay. Text me. But I can yak you too. No. Oh, PS. I love you. XOXO. I can Snapchat you. I can Snapchat you. Snapchat me. I definitely don't ever. You want the Yik Yak though? No. I don't want What if they should make a Yik Yak PlayStation VA app? That's what I was saying. Great. That would be awesome. And that would get the kids in. Get the kids right in there. Use the VA camera. It'll be awesome. Every episode of PS I Love You XOXO ends in a song in a segment we call singing a shoe. Hey, this is where one of you goes to kind of funny.com/psm and submits",
            "start": 6009.2
        },
        {
            "text": "Use the VA camera. It'll be awesome. Every episode of PS I Love You XOXO ends in a song in a segment we call singing a shoe. Hey, this is where one of you goes to kind of funny.com/psm and submits your music for the show. That's right, something you created. I need your MP3 to download and put on the end of our MP3 and I need your YouTube video to annotate to from our YouTube video. Today we have a special guest, Colin. This one comes from Anders. Hello, PS. I love you XOXO. This is Anders Nestrom and I probably butchered that. Swedish. Yeah. from the Swedish metal band Katonia. Katon Catatonia Katonia. In Fallout 4 and Skyrim, there are special Katonia Easter eggs. And this is true. His band is referenced in both these Bethesda games. And we want to challenge all the listeners to track them down. Are you up to the task? The soundtrack to your quest will be provided in the form of our new song, Serene, from our upcoming album, The Fall of Hearts. Thank you, Anders. Anders Nestrom.",
            "start": 6049.76
        },
        {
            "text": "them down. Are you up to the task? The soundtrack to your quest will be provided in the form of our new song, Serene, from our upcoming album, The Fall of Hearts. Thank you, Anders. Anders Nestrom. That is very Swedish indeed. Very. But I thought it was cool that his is banned and there's Easter eggs for his band in [ __ ] Skyrim in Fallout 4. I'll be playing Fallout 4. I'll be looking for him right now. So ladies and gentlemen, until next time, this is S from Anders/ the band. Catatonia. I kne it. Yep. Catonia nailed it. Until next time, it's been our pleasure to serve you. [Music] Heat. [Music] Heat.",
            "start": 6092.8
        }
    ]
}