{
    "id": 9857,
    "video_id": "EPOtmkXKSVU",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Todd Howard"
    ],
    "title": "Will Fallout Ever Go Outside of America? - Todd Howard Answers",
    "description": "Does Fallout NEED to be in the USA? Todd Howard answers in our one-on-one interview. \n\nFull episode of Gamescast: https://www.youtube.com/watch?v=7wvqF41_Bgw\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1714753804,
    "duration": 114,
    "transcript_chunks": [
        {
            "text": "check question cuz it sounds like they're fishing but they're phrasing it in a way that talk about the past instead of the future uh new Mato says have have you Todd ever looked at doing fallouts in places other than the US say Canada's annexation London like I so he said have you ever looked in the past not about what's happening in the future at all look my view is part of the Fallout stick is on the um Americana naiv and part of that and so um you know for us right now it's it's okay to sort of acknowledge some of those other areas but our plans is to predominantly keep it in the US I appreciate that I think again like we had this conversation sorry go Ahad question good question it's a good question I also like in any sort of world I don't feel the need to answer like it's okay to leave mystery or questions what is happening in Europe what is happening here I think those are good things and Elder Scrolls everybody wants to kind of go to these other specific lands and I think my I'm",
            "start": 0.04
        },
        {
            "text": "mystery or questions what is happening in Europe what is happening here I think those are good things and Elder Scrolls everybody wants to kind of go to these other specific lands and I think my I'm known for here saying like the worst thing you can do to mysterious land is remove the mysterious history let me explain everything and answer every question mysterious lands mysterious yes cool I'm just saying like that I agree with you and I think it's for me personally as something I talk about in gamescast last week I think why Fallout 3 resonates so much in my mind of being that Americana blind patriotism and being in DC I thought worked so well in terms of all the monuments and all the stuff by but that step out moment is still my favorite in Fallout 3 and then you come out you see destruction there's no humanity and then this iBot Rolls by sort of you know if at times right it's playing this Americana this is President John Henry Ed that that moment is really I I think really",
            "start": 52.88
        },
        {
            "text": "destruction there's no humanity and then this iBot Rolls by sort of you know if at times right it's playing this Americana this is President John Henry Ed that that moment is really I I think really delicious yeah I love it 100%",
            "start": 97.32
        }
    ]
}