{
    "id": 316,
    "video_id": "meKelL4j0B8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "When Will the Apocalypse Happen? - The GameOverGreggy Show Ep. 28 (Pt. 4)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1403161201,
    "duration": 1654,
    "transcript_chunks": [
        {
            "text": "all right my topic yeah you should tell her what's your topic don't steal my line that's what I get to say oh okay I don't think this is sorry AA what's your topic um so anyway uh so this probably not original probably somebody's come to you with like what would you do in the apocalypse or what would be your apocalyptic plan but I would like to ask you how close you think we are to an actual **apocalyptic** state in the west I think we're a ways off I don't think that I mean by a ways I mean I don't think it's in our and then as an addendum what would be what would what do you think would trigger a potential apocalyptic breakdown uh like what kind of political social economic condition I'm going to go **A.I.S** some some form of computer sense yeah yeah computer **** us up yeah or the SyFy show yeah I always thought Dark Angel made an interesting thing remember that Jessica Alba show I remember the show but I don't remember what it started with an EMP they set off an EMP Over",
            "start": 1.1
        },
        {
            "text": "Syons, yeah I always thought Dark Angel made an interesting thing. Remember that Jessica Alba show? I remember the show but I don't remember what it started with - it started with an EMP over America or over in America, one of the other Americas, yeah Central America really **** up their **** that shit's already dark; they blew out the three lights, isn't running anymore. Why am I racist? We were just talking about this today, House Hunters International was on. Why are all these people trying to move to Central America because it's cheap as **** **** that it's not, it's crazy there - they only drive golf carts. Like buy an island down there; like you literally buy like you could take the money that you would spend on a house in San Francisco and buy an island in Panama, yeah million bucks mil fck an island, a whole island, yeah then you just bring down, you take your generator on your little motorboat and you're on fire, you're you're you're freaking Marlon Brando right so so",
            "start": 45.6
        },
        {
            "text": "bucks mil fck an island a whole island yeah then you just bring down you take your generator on your little motorboat and you're on fire you're you're you're freaking Marlon Brando right so so I None of the things you've said are realistic but fun AI like don't you feel like well sorry maybe like I'm not saying like AI like it's not like a Terminator sense but I think I think it's going to be some computer type **** where like all the computers **** up and like we're we're all so YK we are really dependent on we're so dependent on it nowadays and like my generation is a bunch of **** idiots so we're all going like **** what do we do all screwed I feel that way if my phone dies like when I'm out I'm like where where do I go what do I do no it's it's it's a joke but it's also the same thing of like I don't have a map in my car I don't know anybody's phone number right yep I don't know how to do or go anywhere yeah yep so it's not just your generation we're all dumb yeah",
            "start": 88.36
        },
        {
            "text": "the same thing of like I don't have a map in my car I don't know anybody's phone number right yep I don't know how to do or go anywhere yeah yep so it's not just your generation we're all dumb yeah technology we do that's I mean that's the big thing we lean on it way too much but I don't know I feel it's one of those I feel like it's far off too even when we were talking with the banking crisis right that was like where I was talking about we were teetering on the edge you like it would have been like like Great Depression style craz were real close I don't think it would have been like Anarchy in the streets you think it would have been but you always lean that way yeah I mean it's kind of almost like a wishful thinking kind of he always talks about he always talks about he always talks about how he was a kid please God let there be some kind of terrible economic breakdown let everybody run to the streets and eat each other let there be cannibalism he always talks about how when he",
            "start": 126.84
        },
        {
            "text": "When Will the Apocalypse Happen? - The GameOverGreggy Show Ep. 28 (Pt. 4)\nabout how he was a kid please God let there be some kind of terrible economic breakdown let everybody run to the streets and eat each other let there be cannibalism he always talks about how when he was a kid used to wish Red Dawn was real I kind of wanted Red Dawn to be cool go there in the woods with your friends practice Sharp Shooting right yeah oh yeah I used to take pine cones and throw them like they were grenades and stuff like that um did you see the remake yeah we watched Greg it was fine it was silly you know the original one silly the first one was silly but we didn't know that because our level of I feel like it's so rare that I go to the movies now and leave and I was like holy **** that was awesome usually I leave and I was like was fine oh now that makes me sad I don't want to be dead inside well I keep we just had a conversation last week about we want I want movie theaters to be over I want everything to be digital",
            "start": 163.56
        },
        {
            "text": "like was fine oh now that makes me sad I don't want to be dead inside well I keep saying we just had a conversation last week about how I want movie theaters to be over I want everything to be digital I'll buy more things TV is a better platform for everything **** off with movies do you not feel like there's something special about the experience of going to a movie when it opens on that weekend and experiencing it with 300 other people when it's all perfect yeah it's great like I my my the my what I talked about was Avengers when I went and saw Avengers with a whole room of comic fans and the girl in front of me when they showed Thanos she stood up and flipped out and I was like that's awesome but then I went and saw a double feature of Godzilla and what was the other one recent X-Men and like you know there's a hillbilly at the end of the road talking like an idiot and all this other stuff and there's kids behind me and this I hate it when people laugh before the",
            "start": 201.68
        },
        {
            "text": "X-Men and, like, you know, there's a hillbilly at the end of the road talking like a redneck and all this other stuff, and there are kids behind me. This I hate when people laugh before the joke's over, and I feel like that happens all the time; it's just like they've ruined the joke for me during a comedy where they're just like, \"See, it's coming beforehand,\" they start laughing. I'm like, \"Why are you laughing to look smart right now in front of everybody else?\" Like, I saw The Return of the King sold out at 12:30 at night at the Arclight in LA, and like the usher came out and he was like, \"Ladies and gentlemen, Oh Come...\" He was so excited; he was like urinating himself. It was like he had made the movie. You know everyone you ever was like so fired up, and there was that energy right when everybody... it didn't even matter how good the movie was; it was just that we were all thinking about this since we were kids, and it was",
            "start": 240.4
        },
        {
            "text": "so fired up and there was like that energy right when everybody it didn't even matter how good the movie was it was just that we were all have been thinking about this since we were kids and it was happening and that was amazing I get that and I and I love that in that Avengers scenario and I usually see the comic book movies I'm really into it Avengers was great that that was one of those movies was like this **** as it was happening I was like this is the best thing that's ever happened to me and that's one of those and like that was for me like Godzilla I guess I had I saw Godzilla late so I had really low expectations for it so the whole movie I was like this is **** fun I'm having fun right now this is you know what I mean like stuff like that but you know I think like a great example of the opposite of that is like just what like right now with Orange is the New Black right or House of Cards like it comes out everybody has that weekend and then they go to work and they talk about",
            "start": 275.44
        },
        {
            "text": "When Will the Apocalypse Happen? - The GameOverGreggy Show Ep. 28 (Pt. 4)\n\nexample of the opposite of that is like just what like right now with Orange is the New Black, or House of Cards, like it comes out everybody has that weekend and then they go to work and they talk to friends about it maybe it's just the you know where we work that all of our friends are on the same equal nerd level we're all the same thing so it'd be different like when I I always talked about you know when I worked at the newspaper there was you know multiple generations of people there working so we didn't have that shared line of interest whereas at IGN I work with my best friends, people you know used to ask me oh cool have you made friends I'm like oh yeah friends every weekend I go out with the people I work with and they're like what do you mean like that's a weird that's a weird thing for somebody who's in a job that's different but for us it we still have that experience, like that was Nick's argument of like sharing the experience leaving the theater talking immediately to someone",
            "start": 310.96
        },
        {
            "text": "somebody who's in a job that's different but for us it we still have that experience like that was Nick Scarpino's argument of like sharing the experience leaving the theater talking immediately to someone you came with about what happened versus like this is a collective experience where everyone watches it at home and then talks about it work but I feel like both of those experiences are valuable like right like right now so for example Game of Thrones like I get to work on Monday and then everybody's like did you watch it last night and we all talk about it or someone goes I haven't watched it yeah please wait until tomorrow and we talk about it on Tuesday but I feel like that doesn't devalue that's as comparatively interesting as going to see you know Avengers and then talking about that with your friends on Monday or playing a game and being like I'm only halfway through campaign wait till you finish the game and well you know I feel like those things I think it would be sad maybe I'm now",
            "start": 341.48
        },
        {
            "text": "friends on Monday or playing a game and being like I'm only halfway through campaign wait till you finish the game and well you know I feel like those things I think it would be sad maybe I'm now I'm all said I'm old I think it'd be sad to not ever be able to have the experience of seeing a movie in a sold-out theater with 5 people all eating popcorn and all yelling at the same time and all gasping at the same time it's one thing my thing is I don't think it's ever going to go away we having this argument and somebody and people were saying or somebody at the table is saying that you know it will go in I'm like I don't think it will movie theaters always going to be there I hope they keep going the way of I arite you book your seats right like where you sit yeah like it's it's super I think it's probably going to go to pre you'll have just premium and then super low rent shitty theaters and nothing in between and I would and I think the more people can get games movies day and date",
            "start": 374.92
        },
        {
            "text": "think it's probably going to go to pre you'll have just premium and then super low rent shitty theaters and nothing in between and I would and I think the more people can get game movies day and date you'll only for a premium experience for the big Temple movies that sounds awesome I everything about that cuz there's so many movies like like Spider-Man like I'm not a Marvel kid so like I was like I missed opening night with friends and I was like well **** it I'll see it on DVD no if you don't go opening weekend for a movie like that like what's if that was out like on if they would have put it on iTunes the same night I would have gotten watched on a plane and been like oh this sucked or whatever totally you would have felt the same way regardless of where you saw it right but about the end of the world the end of the world the end of the world we technology um well I so there's two I have two ways of thinking about this the first one is that the world has already ended like",
            "start": 408.28
        },
        {
            "text": "the end of the world the end of the world the end of the world we technology um well I so there's two I have two ways of thinking about this the first one is that the world has already ended like multiple times for multiple people in multiple locations for example it just ended in you know in Indonesia and Malaysia with the earthquakes and the tsunamis you know what I mean like it ended for those people right like they looked around and everything was **** leveled no services no medicine no food for weeks no water people dying in the streets it happened it already happened in Haiti it already happened in Rwanda it's already happened lots of places so we think about apocalypse as being like the end of the entire world the end of the world occurs constantly all over the globe yeah I feel like I feel like our example of of the Apocalypse happened in a modern American city where we were all watching people standing in the streets starving and dying of dehydration and nobody showing up",
            "start": 443.8
        },
        {
            "text": "like I feel like our example of the Apocalypse happened in a modern American city where we were all watching people standing in the streets starving and dying of dehydration and nobody showing up and the cops shooting at American citizens firing on unarmed American citizens who were just trying to get out of that City like that was the first example and like I thought about LA and I thought like what happened if there was like a massive earthquake in LA and just for like 3 days if you called the cops nobody came like what that would be like yeah you know what I mean yeah no um I don't think about it as like on a massive scale like I've got to get a compound although I really do want a compound and I want it to have a Crow's Nest and like electrified fence and like you know do you own guns do you want guns I do own a gun yeah I do own a gun was talking about you should own a gun yeah yeah I mean look I it's funny because I'm I'm super Progressive and I kind of feel like um I I really",
            "start": 485.16
        },
        {
            "text": "do you want guns I do own a gun yeah I do own a gun was talking about you should own a gun yeah yeah I mean look I it's funny because I'm I'm super Progressive and I kind of feel like um I I really getting sick of like turning on the TV and seeing some mass go and shoot up a building makes me apeshit bananas I do feel like we have right a constitutionally protected right to own guns but the idea that we have a constitutionally protected right to buy bullets on the Internet by thousands and thousands and thousands of ordnance on the internet without being checked out is **** I think the right to own guns does not mean the unlimited right to buy to amass as much weaponry as you possibly can without safeguards and I think we Safeguard you have to wear a seat belt you can't put arsenic in baby food you should have to wait 3 days if you can't wait three days you don't need a gun you know what I mean like if it's if it's a **** hurry there's something wrong with what",
            "start": 526.28
        },
        {
            "text": "When will the apocalypse happen - The GameOverGreggy Show Ep. 28 (Pt. 4) arsenic in baby food you should have to wait 3 days if you can't wait three days you don't need a gun you know what I mean like if it's if it's a hurry there's something wrong with what you need it for um so I do own a gun and it's licensed and I and I shoot on a regular basis so that I can use it safely so I don't wake up the middle of the night and shoot my husband when he's coming back from the bathroom or I don't shoot accidentally shoot myself cuz I don't know how to operate it or someone breaks into my house I do know how to operate it I end up shooting the bad guy and not having it jam or lock cuz I didn't take the safety off like I feel like it's a responsibility we think it's a right I feel like living in this country is a responsibility it's a responsibility to be educated it's a responsibility to know what's going on it's not just a right it's not just me me me I'm an American and everything's my way and that's the problem I have with that but that being said I so",
            "start": 560.0
        },
        {
            "text": "a responsibility to know what's going on it's not just a right it's not just me me me I'm an American and everything's my **** way and that's the problem I have with that but that being said I so I think about like what would happen in LA like you know if there was like a massive earthquake no power fires everywhere you know they were saying if there was one massive earthquake in San Francisco and there were just three configurations, three major configurations so like not blocks and blocks like one like three full city blocks on fire and then your house is on fire no one is coming to put your house out and that that is essentially like the Tipping Point for social services breaking down so um I think or I think that it could happen at any time in in that scenario 120 **** per and I think you should be thinking about it in your life that way which is like where would I go who would I call but um I don't know I think about also like you know what if China just decided to like make us",
            "start": 594.6
        },
        {
            "text": "you should be thinking about it in your life that way which is like where would I go who would I call but um I don't know I think about also like you know what if China just decided to like make us pay them back right yeah we always talk about that you know what I mean I think I think we could go into like a prolonged a really prolonged depression and so I feel like um unfortunately we are in bed with those guys forever because uh we just owe them too much money and I think that that would be more of like a long-term like sell your stuff move to the country kind of thing and I don't know I mean things have always been so stable here you know it's like it's hard to imagine that things could break down and even this last depression kind of felt God like we don't really we can't figure out how to get out of this cuz the big problem was even after we kind of bought our way out of it we gave all this money to the banks and then they all hoarded it um and so I don't know I don't know that",
            "start": 638.16
        },
        {
            "text": "how to get out of this cuz the big problem was even after we kind of bought our way out of it we give all this money to the banks and then they all hoarded it um and so I don't know I don't know that it's that far off I don't think it's going to be like zombies in the streets but um I think it would just be more like the way that things work yeah you yours is way more terrifying because when you ask when you know ask what's the apocalypse going to be like or when's that coming like oh what's going to take out the entirety of the United States yeah there there's an earthquake coming from San Francisco is our shitty house going to hold up I don't know and even if it does what's to say the houses on the side of us don't catch on fire and burn us down you know I mean the Marina's done yeah the marina just the mar is built on the rubble of the 1906 or 1907 earthquake and that's crazy an entire district if a big earthquake comes is just going to crumble and then yeah no one's going to help them",
            "start": 681.96
        },
        {
            "text": "Marina, just the Marina is built on the rubble of the 1906 or 1907 earthquake, and that's crazy. An entire district if a big earthquake comes is just going to crumble, and then yeah, no one's going to help them. Yeah, that's crazy, but I think it'll be it's it's sick and it's sad and it's messed up. But I think if something like that, like a Katrina-style thing happened in San Francisco, they would come because all of the money is here, you know? And so, like, they didn't have the political leverage in New Orleans to get the help, you know? There's no way if Barack Obama is in office and all his progressive pals in San Francisco are involved, you know. And and the Senate controlled by Democrats or by your friends, you know what I mean? Like, I feel like York or San Francisco, even though there's a Republican in office, I feel like the money is this is the hub of technology for this country. I feel like there's just certain cities like Washington, New York, San Francisco, maybe even Houston because of oil and oil interests.",
            "start": 716.96
        },
        {
            "text": "I feel like the money is this is the hub of technology for this country. I feel like there's just certain cities, like Washington, New York, San Francisco, maybe even Houston because of oil interests down there. Like, there are places where it's like that's not going to happen like quite the way it happened in China. It's still going to be messed up, you know? But that's my I don't know. I think that um I think there's multiple ways that everything can go to hell. We we talk about this pretty often in terms of personally, you know. We just go to bed, I think, in laying there whispering sweet nothings, tell me a story. I think in 2008, you're going to have to kill Pat Robertson. I think I think in September 2008, we were really close to complete disaster and I don't think and I've said it before on here and like I don't think people want to think about or know how close we were. And I think that like there's like dissonance there where they really don't want to understand like we were like a hair's breadth away from catastrophe.",
            "start": 755.48
        },
        {
            "text": "I don't think people want to think about or know how close you were and I think that like there's like dissonance there where they really don't want to understand like we were like a few days away from complete collapse, you know. And um, and I encourage people to go read about it because it's true uh and that was even when I was talking my girlfriend, we're from Long Island and I was like we really need to like in September when everything was going on like we might need to get the heck out of here, you know, like and go home, you know, like and like start driving um at San Francisco yeah like just to get with our people just to get home to your family like just be like I don't know like I might not have a job next week anyway so you know like we might have 50% unemployment in a week. Um but I think I think the I don't know if there's an apocalyptic scenario that's like really possible, I think mutually assured destruction for instance is real, I don't think that like",
            "start": 795.84
        },
        {
            "text": "in a week um but I think I think the I don't know if there's an apocalyptic scenario that's like really possible I think mutually assured Destruction for instance is real I don't think that like there's going to be nuclear war anything like that I don't think that that's really going to happen unless it's like a terrorist cell that does it um yeah it's not going to be a major a major operator that shit's real that kept nuclear bombs kept the peace which is like the ironic thing that like a lot of people don't want to think about like they kept the peace between Russia and the United States we would have had conventional Wars in Eastern Europe for 50 years if we didn't have nuclear bombs um but uh I think that there's certain tipping points or that could that could totally happen I think that the uh the idea of a civil unrest Civil War Revolution is very real you talk about that I think I don't think it is we're so lazy so many people are like Tim Gettys and I more than that",
            "start": 827.36
        },
        {
            "text": "I think that the uh the idea of a civil unrest, Civil War, Revolution is very real you talk about that. I don't think it is we're so lazy, so many people are like Tim Gettys and I more than that, the like I just think the thing, the idea that we don't think the government would **** up any kind of like legitimate militia threat to the like we they would just blow them away I think is just ridiculous. Oh no, I don't think that either and I don't want something like that to happen but I think that there's certain tipping points that could create a situation where people are like **** this you know. I I actually think the Second Amendment question um I do think we need controls on the Second Amendment and all that kind of stuff. I think that if I think there's a disingenuousness in the argument about gun control where people that want gun control really just want gun bans and at least a lot of people do and I don't think that they speak plainly and I think that they don't speak",
            "start": 864.16
        },
        {
            "text": "the argument about gun control where people that want gun control really just want gun bans and at least a lot of people do and I don't think that they speak plainly and I think that they don't speak plainly about it because they understand that that can never happen in this country because that would cause a massive problem you know what I mean my cold dead hands like like where like yeah no it really is that thing if the government was like guns are illegal they'd be like I don't think so you know what I mean like and that is that is like a real thing like that that's why that can never that can never happen in the United States that's why everyone's like why are guns legal why don't you outlaw guns it's like that will never happen the bigger thing is that it would be unmanageable even like let not even talk about how people would Rebel or how they'd feel about it you just couldn't collect all of the guns that already exist so I think it's unmanageable just purely on like a",
            "start": 903.44
        },
        {
            "text": "even like let not even talk about how people would rebel or how they'd feel about it you just couldn't collect all of the guns that already exist so I think it's unmanageable just purely on like a technical level on a practical executional level you could not get all the guns away so they would never do it because it would just be like an unmanageable proposition um I actually think that I think you're wrong I think there are people on the extreme of both things which is like I should be able to carry an automatic weapon into a school and there people like no one should be able to own weapons I think most people in the middle which is like I understand that people have the right to own weapons but I would like to not see another 14-year-old shoot up a grade school I think that's how most people feel right but I also think that they ignore we've talked about this on our shows before where it's like most gun crime in the United States is is from pistols a vast majority of it",
            "start": 935.72
        },
        {
            "text": "most people feel right but I also think that they ignore we've talked about this on our shows before where it's like most gun crime in the United States is from pistols, a vast majority of it even a vast majority of shooting massive shootings are done with pistols not with automatic weapons um and then it's and then the whole disingenuousness or there's a lack of knowledge of saying like well you can have a gun to hunt and you can and it's like no no no the Founders put the Second Amendment in to protect themselves from the government you know like that's why it exists to protect themselves from you you know not from so they can go hunt they they they didn't think they needed permission to go hunt everyone had a gun you know it wasn't about that it was about having no matter how well you're armed you are if the government comes for you you're done I don't disagree with that it's totally conceptual that you could defend yourself as the United States",
            "start": 966.2
        },
        {
            "text": "about having no matter how well you're armed, you are if the government comes for you, you're done. I don't disagree with that - it's totally conceptual that you could defend yourself as the United States government if they want you, you're undone before you fire a thing; they will level this podcast. I don't argue just like an idea, I don't argue that, but I also don't think there's not nuance in how those kinds of situations go down about who's on whose side - the military might not want to engage in warfare against its own people, like all those kinds of questions. In fact, I'm pretty positive that the military - people often think if there was a rebellion right, or just like a state tried to secede or whatever, in the military world, I'm not so sure the military would roll in there; you know, I'm not so sure they would want to do that. I think they'd be more likely to",
            "start": 1002.32
        },
        {
            "text": "military World in there I'm not so sure the military would roll in there you know like I'm not sure so sure that they would want to do that I think they were the way they did when the country was founded which is that this is a union and we have to maintain the the strength and the sanctity of the Union we're going in there because this is the United States of America and you don't get to leave that like this is the deal this is who we are yeah again I just think that there's a lot of unanswered unsettled questions about those kinds of things and that's what makes all the wh-ifs by the way there was a rebellion they would just turn off your cell phone and then You'd be like what do I do now how do we communicate how am I going to tweet how am I going to tweet somebody has to know hashtag government sucks I I so so I don't think how do you do that in smoke signals how do you make a hashtag in Morse code this is so stupid so I don't I don't think that like I think that the United States is extremely",
            "start": 1041.44
        },
        {
            "text": "When Will the Apocalypse Happen? - The GameOverGreggy Show Ep. 28 (Pt. 4)\n\nsucks I I so so I don't think how do you do that in Smosh's signals how do you make a hashtag in Norris code this **** so I don't I don't think that like I think that the United States is extremely socially unstable actually and that like we um often it's like what happened in 2008 where we were like there's a massive gunshot wound in the in the economy we just put a little Band-Aid over it and nothing don't worry about it everyone don't look at it it'll go away it's still there it's still **** gushing blood and I think that if everything went down in 2008 the way maybe even should have gone the way you wanted it to go no just in terms of a cleanse where it's like we can't have this debt like this is actually unsustainable it's going to happen eventually like the economy is going to collapse under the weight maybe we should have just let it happen and I actually kind of feel that way but at the same time if that kind of happened and Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys are right and they were",
            "start": 1072.96
        },
        {
            "text": "under the weight maybe we should have just let it happen and I actually kind of feel that way but at the same time if that kind of happened and Gernot Kaltz and all those guys are right and and they were like you know Henry Kissinger and all these people and they were like we look at 50% unemployment and stuff like that if you have a scenario like that which is actually twice as bad as it was in the Great Depression in the 20s and 30s then that is right for civil for like for complete civil unrest like and complete Anarchy and it's always those kinds of situations unfortunately economic you know uncertainty where typically far-right governments come from where typically people look to something that's powerful or something that's stabilizing this is exactly what happened in the Weimar Republic um when they're you know hyperinflation during the Depression when they owed all the money from Versailles and the Nazis came in like it's pretty pretty similar situation so like there's just",
            "start": 1113.68
        },
        {
            "text": "When Will the Apocalypse Happen? - The GameOverGreggy Show Ep. 28 (Pt. 4)\nRepublic when they're, you know, hyperinflation during the Depression when they owed all the money from Versailles and the Nazis came in; it's pretty similar situation so like there's just all sorts of scenarios where I think that like it's not going to come from war with China, it's not going to come from war with Russia over Ukraine - who cares? Like it's going to come from something like Abraham Lincoln used to say: we will undo ourselves, you know. And like I believe that that's totally possible; I think I think to say like you know it's not going to happen, it's not possible, we're fine; I think that like ignores all of the tea leaves you know about like problem is we could never allow a full crash and cleanse because too many other countries are tethered to our economy and they would all step in. You know there we don't know how many hundreds of backdoor conversations happen; like you cannot let your economy collapse, it will bring the entire world down.",
            "start": 1149.08
        },
        {
            "text": "and they would all step in and you know there we don't know how many hundreds of back door conversations happen like you cannot let your economy collapse it will bring the entire world down with you and then we will let you swing so get your act together because when we go down Europe goes down Asia goes down everybody goes down so that no one would ever allow that I'd be like you can't let your house burn down cuz then the block burns down so we're coming over to your house to tell you to get your act together unplug your appliances unplug the fridge the curling iron God forbid I charge the Wii U gamepad so you know people always laugh at me because it's like you know I do have like these like these visions cuz I'm really into that kind of fiction you know it's not even you have visions like you need to stop reading or whatever you've been reading no it's it's not even Tom Clancy stuff either even like",
            "start": 1184.56
        },
        {
            "text": "I'm really into that kind of fiction, you know. It's not even... you have visions like you need to stop the remaining or whatever you've been reading. No, it's not even Tom Clancy-esque either. Even like, where it's like kind of like it's okay. Uh, but like, you know I just like... I like to think about it in a very intellectual way, where like civil unrest happens, problems happen. We fought each other in the 1860s for four years; it was the bloodiest American war in history, one of the bloodiest wars in the history of any war when we fought each other. You know, and like... an absurd amount of people died – like 4% of the population, yeah you know? Like, and so like... I just don't think that it's not possible to use a double negative, you know. I mean where I think that like... I hope it doesn't happen; I want no strife with anyone. Like I don't want people to get stupid in the Midwest or get crazy in the South or get crazy in the North or like try to do stupid stuff. I just",
            "start": 1221.32
        },
        {
            "text": "I want no strife with anyone, like I don't want people to get stupid in the Midwest or get crazy in the South or get crazy in the North or like try to do stupid stuff. I just, I just understand that certain economic conditions or social conditions can happen where like people really do get pissed and like I think that is what drives the end at least in this country because you were saying it's about location, it's about what happened with the genocide in Rwanda, it's what happened with starvation in North Korea and Somalia, it's about those are the end of the world situations for those countries and for us the end of the world would be like yeah, you have no internet, you have no electricity, the military might be fighting half the population, um, and you have your money is worthless, hyperinflation, you have no job, that's a post-apocalyptic situation in the United States especially an economically vibrant place like this, you know, so like that's you know that's",
            "start": 1264.6
        },
        {
            "text": "When Will the Apocalypse Happen? - The GameOverGreggy Show Ep. 28 (Pt. 4)\nis worthless hyperinflation you have no job that is a post-apocalyptic situation in the United States especially an economically vibrant place like this you know so like that's you know that's that's longwinded but that's that's the way I feel about it uplifting topic I I don't know why you guys were all you guys were dancing around the edges of this pit all day and it just like seemed like the obvious question so **** a tow in a room that's same thing did you did you I have actually a second scenario but I want to hear yours I no I I yours scared the **** out of me that's because I I was the same way EMP this crazy **** happens and everything ends and then you're like oh no it could just be a little bit and I'm like well then yeah it's going to be an earthquake in San Francisco and this is the thing is like and this is totally going to be like my remorse story cuz every so often Christine's like we should get like a we should make like a bugout bag like an emergency bag in case",
            "start": 1300.04
        },
        {
            "text": "this is the thing, is like, and this is totally going to be like my end-of-the-world story cuz every so often Christine's like \"we should get like a bugout bag, like an emergency bag in case something happens\" - like, we'll get to it. there's so I'd love to but Diablo's really good, I want to play some more Diablo, you know what I mean? and so like it's one of those things that'll be \"the house will crumble and it'll be me and Pella looking for her with nothing\" yeah exactly but that would be yeah that is super scary and I bet that's just it's just a motorcycle apocalypse it's happening, it's happening how great would that be take these cards one day one day everybody's going to want this footage you bury it, bury it in a in a what's your second scenario no I mean the other scenario that I think is actually more likely than we'd all like to admit is is catastrophic illness, some kind of communicable catastrophic illness, some kind of bug you know we keep hearing",
            "start": 1337.8
        },
        {
            "text": "other scenario that I think is actually more likely than we'd all like to admit is a catastrophic illness, some kind of communicable catastrophic illness, some kind of bug you know we keep hearing about like MERS and SARS and all these things and they've been relatively contained but you know like they just had apparently there was an MERS outbreak in the Middle East right now and they had their first MERS case in the states where someone you know was over there and then came here and interacted with a medical worker here and they caught it and I think um they just the problem with any kind of like flu-like virus is that the latency is a couple of days by the time you know you're contagious, it's already too late I feel like that would be another scenario that I don't think is that unrealistic unfortunately yeah like Planet of the Apes absolutely or like Outbreak, Hot Zone, yeah contagion, that that show that upcoming show on Discovery+ that's about that, that sounds great, that sounds like a",
            "start": 1378.92
        },
        {
            "text": "yeah like Planet of the Apes absolutely or like Outbreak: The Hot Zone yeah contagion that that show that that upcoming show um on D ship that's about that that sounds great that sounds like a great uh times no it's a great piece of fiction I don't want that to happen I'm not I'm not necessarily on the boat I'm not in the navy no none of us are on that boat no it turned out The Game Over Greggy Show was doing a USO tour the Umbrella Corporation came in middle of the Atlantic and we're okay mhm all right get on your rowboat and to the middle of the bay I'll be all right well ladies and gentlemen that's The Game Over Greggy Show uplifting end to the day I love those kind of topics clearly we talk about these topics every week every week we come to you here uh you can get the MP3 for a dollar over at gameovergreggy.bandcamp.com every Friday if you don't want to give us the dollar that's totally cool over you mean WR the dollar do you want do you want the e to collapse you want the American economy",
            "start": 1411.72
        },
        {
            "text": "at GameOverGreggy.com every Friday if you don't want to give us the dollar that's totally cool over you mean WR the dollar do you want do you want the e to collapse you want the American economy to collapse give these guys a dollar you want my economy to collapse please give us a dollar I actually I'm taking a dollar with me so please pay them back you can go to youtube.com/ GameOverGreggy get the topics broken out one by one every day up until the full video is posted we post a whole bunch of other stuff uh of course we just posted a video really recently of Patillo unboxing his first ever BarkBox you should check that out he flips the **** out I've I I've known the dog for nine years this is some of the craziest **** I've ever seen from him you can go there go to barkbox.com / GameOverGreggy you get $10 off your subscription then of course buy Shir it's districtlines.com/GameOverGreggy those are all my plugs but Aisha you must have a million you have a you have a book out",
            "start": 1457.52
        },
        {
            "text": "gameover greggy you get $10 off your subscription then of course buy shirts its districtlines.com gameovergreggy those are all my plugs but Aisha, you must have a million, you have a book out self-inflicted B called self-inflicted wounds you can get on Amazon very funny I got it on the Kindle thank you thank you for getting it uh you can also get it on Audible all of the variety of formats are available to you digital ebook audiobook uh actual analog paperback make those they do make them and you can read and then when you're done you can use it to like prop open in a door or hit your roommate cuz he owes you money save it for kindling when when the apocalypse come set it under your console because you don't like how low it is to the ground uh and you can come and visit me at AishaTyler.com Aisha Tyler Twitter Facebook Instagram all those things its always Aisha Tyler because there are no other Aisha Tyers in the world so that is my handle in every format on every",
            "start": 1497.4
        },
        {
            "text": "Aisha Tyler because there are no other Aisha Tyers in the world, so that is my handle in every format on every platform. You go to AishaTyler.com online to see me live; you can watch me every day on The Talk, you can watch me every week on Whose Line Is It Anyway?, and you can watch me starting January 2015 on season six of Archer. Those are all the things we didn't talk about this no, no, never. But I read a thing: you have like an optioned life for TV show right? I sold uh self-inflicted wounds; you're so rich, I'm going to I'm going to liquidate all of it and put it into my bugout bag now; I'm terrified. Um, I'm turning it all to gold; the Bloons are in there; it's like I'm ready, and the solar-powered radio that you crank... um, but yeah, so we're developing that now; hopefully excited, we'll see how it goes. You know, it's it'll be a fun",
            "start": 1536.28
        },
        {
            "text": "in there it's like I'm ready and the solar powered radio that you crank um but yeah so we're developing that now hopefully excited we'll see how it goes you know it's it it'll be a fun experience regardless of whether it ends up being a TV show but it's fun so far working on it yeah a lot of successful people they suck but you're awesome I like you a lot you're one of my favorites thanks for coming to our house yeah thank thank you for being way more famous than us than coming here you made me a cocktail it was a lovely experience I Madea Tyler an old fashioned and she drank it did I drank the whole thing and I'm actually mad at several points during this conversation I wanted to stop talking and get you to go get me a he started ranting about the end of the American economic system I did I didn't realize that literally I put my finger on his button next time I'm going to ask you guys what your favorite omelet filling is Jesus oh dude yeah don't stop go for days",
            "start": 1579.68
        },
        {
            "text": "I did I didn't realize that literally I put my finger on his button next time I'm going to ask you guys what your favorite omelet filling is Jesus oh dude yeah don't stop go for days on that one Canadian peameal bacon it's not bacon ladies and gentlemen it's been our pleasure to serve you Nick Scarpino as a scumbag",
            "start": 1621.64
        }
    ]
}