{
    "id": 416,
    "video_id": "7D-I0h0huf8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Our Favorite Podcasts - The GameOverGreggy Show Ep. 46 (Pt. 5)",
    "description": "Tim Gettys talks about his favorite podcasts to listen to.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1414134003,
    "duration": 1315,
    "transcript_chunks": [
        {
            "text": "Tim, yes, what's your topic? So my topic today is oh **** we have Tim's topics, yeah, we can get we can get this through this one no hurries as long as it takes no hurries take a breath that's that's the Mantra as long as it takes podcasting or podcasts as hard as it gets what is what are you guys' thoughts on it are there any that you listen to what are your thoughts on just the whole the idea of podcasting is it crazy to you that there's people that would listen to people talk is it crazy to you that you listen to people talk I've heard it's having a Resurgence and I'm not saying that just because we started doing this show but I've read a couple articles saying that podcasting everyone thought it was going away for a while who thought it was going away well I think it was going away for a while because like the YouTube online video video became a thing so podcast did die down for a bit and then now they're they are going up there's like so many more just statistically sure so and",
            "start": 1.1
        },
        {
            "text": "a while because like the YouTube online video became a thing so podcast did die down for a bit and then now they're they are going up there's like so many more just statistically sure so and they're doing better than they have ever I never I never listened to podcasts until we started doing this show largely cuz I was like okay we're part of this sort of part of this this podcast Community now I should Branch out and start and then when you start going down that rabbit hole oh it's the problem with podcast is there a huge time suck and if you find a good one unless you're in LA or you're driving or you're you're taking mass transit like my commute TKS 20 minutes so it takes me a week to listen to a whole podcast if it's you know as long as ours is um but I it I you know going down that I'm like okay I'll look up people that I know and see so Kevin Smith obviously is one of that I always listen to he does smartcast he does Fat Man on Batman Fatman on Batman's really good he does",
            "start": 40.32
        },
        {
            "text": "I'm like okay I'll look up people that I know and see so Kevin Smith obviously is one of that I always listen to he does SmartCast he does Fat Man on Batman, Fatman on Batman's really good he does J get old these are you know him and Scott Moe're hilarious it takes a little getting used to like everything because you're basically like it's an intimate thing when you're sitting there listening to two people that are talking in their living room we talking in their home studio um but once you get into that world it's it's crazy how well you can connect with people so started listening to him started listening to R Link's podcast uh Ear Biscuits which is amazing see that's one of mine is just awesome those guys are so good at what they do it's not like our podcast where we sit here and talk about uh complete and total nonsensical stuff and have a great time about it they interview people it's an interview podcast uh so they they do this great thing it's very much like NPR well",
            "start": 81.8
        },
        {
            "text": "and talk about uh complete and total nonsensical stuff and have a great time about it they interview people it's an interview podcast uh so they they do this great thing it's very much like NPR well they'll they'll they'll set up who the person is first then you'll go into the interview and then they'll have like segment breaks where they'll talk about the next very very well structured those guys are those guys are Pros yeah they're great um and the only other podcast that I listen to aside from The Business which is NPR which is really really good if you guys haven't listened to it it's only I think it's only 30 minutes but it's a a hardcore look at the film and uh TV business and they go I mean they go super in depth as like who's trying to buy DreamWorks and who's taking over for you know is the chairman or president of Fox and all this stuff so it's it's really cool to hear that get that exposure um but by Shadow no shadow of a doubt the craziest podcast I listen to is",
            "start": 118.0
        },
        {
            "text": "know is the chairman or president of Fox and all this stuff so it's it's really cool to hear that get that exposure um but by Shadow no shadow of a doubt the craziest podcast I listen to is The American Cinematographer Podcast they don't do it all that often this is something Sean Finegan turned me on to like you got to listen to this podcast it's amazing it's once a month and they talk to random cinematographers or director photographers from throughout the years it's not even just modern stuff uh the best of which I think was I forget his name but he was the the cinematographer for RoboCop and so they talk to him now about that movie and how they had to make that movie in the 80s and how they had to make uh this costume that took three or four hours to get into that now they would just you know make it a CG thing and how they had to shoot it such a certain way and how they had to put it like he goes as far as to say you know the suit was actually rubber you don't know that cuz",
            "start": 153.12
        },
        {
            "text": "\"Just you know, make it a CGI thing and how they had to shoot it such a certain way and how they had to put it. Like, he goes as far as to say, you know, the suit was actually rubber. You don't know that because they shot it so well it looks like it's metal, like that suit would be plastic if it weren't red. So we found a rubber compound to do it. He goes, but then we wanted the thing that sells metal effects is that you have to have reflections right? Reflections are what sell anything - makes it look like metal, the more reflective it is, the shinier surface, more metal-like it is. So he's like, we'd have to go around and put lights, like flashlights strategically all around the set just so we could have the right reflection so this thing would look real. And he's like, and then we also had to follow these rules of you know when you're shooting Robo - he calls him Robo, he's like a crazy Scandinavian guy because Hovind is like his main\"",
            "start": 193.8
        },
        {
            "text": "to follow these rules of you know when you're shooting Robo he calls him Robo he's like you know when we're shooting Robo and he's he's crazy Scandinavian guy cuz he he was a Pover Hovind's like main guy from when Pover Hovind came over sorry I'm talking to you guys um Paul Rogan we all know well uh he's like we got to shoot Robo from Robo you always got to shoot low so Robo looks bigger than life and you're like that's just cool it's cool listening to the way these guys I like stories like that think about how to make these characters come to life and really it's when you when you listen to Just directors directors always have to talk about sort of their grand vision for it right but the cinematographer or the DP talks about how best to support that Vision with visuals um you need to put it in games terms I guess it would be more like I don't know I guess the creative director is sort of the person that that Helms the project but then you've got like I guess the the the lead",
            "start": 228.84
        },
        {
            "text": "to put it in game terms i guess it would be more like i don't know i guess the creative director is sort of the person that helms the project but then you've got like i guess the lead environment artists or any of the lead artists that'll come in and kind of talk about the visual and how that affects the storytelling it's super cool it's really really cool and it's very technical so if you don't have that vocabulary it'll it'll help get you there along with reading the American Cinematographer Magazine which is amazing those are my podcasts similar to i mean i'm going to give a whole bunch here yes but uh Rett & Link reminded me of Talk Is Jericho, Chris Jericho's podcast not just about wrestling but it's the same thing you bring somebody on interviews them they talk about a whole bunch of stuff run the gamut as they say um I want my new favorite like obsession podcast is Death, Sex and Money it's by Anna Sale this is something i caught from This American Life",
            "start": 265.28
        },
        {
            "text": "A whole bunch of stuff runs the gamut, as they say. Um, I want my new favorite podcast to be like \"Death, Sex & Money\" by Anna Sale. This is something I caught from \"This American Life,\" because \"This American Life\" is like the epicenter of my podcast world. Off of that comes \"The Moth,\" \"Death, Sex & Money,\" and \"Serial,\" which I'll talk about all in a second. Uh, \"This American Life\" obviously just a great weekly show; they sometimes run a little bit not weekly, running runs in there as they do things, but you know, journalism of whatever caliber about stories out in America, topics switch off as they go. There's a theme to every episode, but every episode feels very different, which I like a lot about it - giving you different glances at what's happening here and there. Um, \"Death, Sex & Money\" is the new podcast show; it's on the short side, which I don't like. I wish it was longer; I wish it was like \"This American Life.\" You're getting like an hour's worth of content - you know what I mean at least.",
            "start": 303.52
        },
        {
            "text": "is the new This American Life show, it's on the short side, which I don't like. I wish it was longer. I wish it was like This American Life - you're getting like an hour's worth of content, you know what I mean? At least usually, and then Death, Sex & Money this one is like 20-30 minutes somewhere in there, you know what I mean? But again, it's interviews with someone that all has to do with something death, sex or money - or all of them wrapped up. Or the tagline for the show is \"the things we all think about but don't talk about enough\" for something, something to that extent, you know what I mean? It's like they had Jane Fonda on there talking about her entire life and how this was all wrapped up with death, sex money - and then I definitely don't think about Jane Fonda enough, that's for sure. Well no Death Sex & Money things you because all three of those things it's an amazing episode. Jane Fond is an amazing woman, awesome does amazing work on the Newsroom. I won't hear anything other uh but yeah you go through",
            "start": 341.2
        },
        {
            "text": "things you because all three of those things it's an amazing episode Jane Fond is an amazing woman awesome does amazing work on the newsroom I won't hear anything other uh but yeah you go through stuff like that they do one with a guy who's getting a vasectomy and talk to him about that as he's getting the vasectomy no not at well actually yeah there is he recorded it himself actually um e it's good though e that's what you got that's what you got for me take a little piece out of you just a little piece up just a little p if I'm not okay with veins I'm definitely not okay with taking your man bits it's fine they just cut Don't Take Your Man Bits just the part of the man bit that dip see that's it if it was the whole thing that'd be one thing but there's it's the inside parts it's like have you seen Luther 3 where they have to cut the cord they to cut the cord of the bomb at the beginning it's exactly what it is except you cut it on both sides Cal is the new This American",
            "start": 377.88
        },
        {
            "text": "Have you seen Luther (no correction needed, but note: there is no \"Luther Weapon 3\" game or movie) where they have to cut the cord; they too cut the cord of the bomb at the beginning. It's exactly what it is, except you cut it on both sides. Cal is the new This American Life podcast. Have you heard about this? A lot of people are talking about it. It's doing really well. Uh, it's basically like think of Dateline; you know how they follow a case for an hour or whatever. This is like a season dedicated to one case with each episode being something different about it or whatever, and like they're going through it. Yeah, it's really good so far. Everybody I highly recommend it. It's good. What is it called? Serial, like serial killer? I'm... I'm looking it up right now. What was the other series like Blueberry? Like Blueberry? Yeah, Cal and that's Sex and Money, Honey. Blueberry and Fr Loops. Uh, The Moth; another one that's part of the This American Life family of shows, even though this like for This American Life and Serial are directly connected to Death.",
            "start": 416.64
        },
        {
            "text": "\"Honey, blueberry, and from Loops, uh, The Moth. Another one that's part of This American Life, I feel, family of shows, even though this, like, for This American Life and Serial are directly connected, Death Sex and Money isn't; it's just like some a cool podcast they thought was cool, they brought. I think one of the stories on same thing with uh The Moth is highly originally featured on This American Life. The Moth is true stories told in front of a live audience, so their podcast is sometimes you know usually one story from one person's; sometimes they'll put up The Moth StorySlams which are like you know giant swatches of people but just people coming out and telling their stories about whatever that's really good. I like that, like was it Money Sex Death was that the first one? Death Sex and Money shows where my priorities are. Yep, yeah. Colin, uh, so I don't listen to podcasts per se because it well it says a lot about how I interact with media and like how I need to focus on.\"",
            "start": 450.28
        },
        {
            "text": "Death, Sex & Money shows where my priorities are. Yep, yeah, Colin, uh, so I don't listen to podcasts per se because it well, it says a lot about how I interact with media and like how I need to focus on certain things. So, like at work for instance, you know I don't listen to anything when I'm working because I can't write and I can't read and I can't think when I'm listening to something on my commute I listen to music, I listen to Spotify - Spotify is the best $10 a month you can possibly spend, it's amazing. And that's all I do like when I commute I listen to music and I read the news. I think the closest thing I get to listening to actual podcasts is that I really enjoy Pardon the Interruption and uh and Around the Horn on ESPN, which actually I think are in podcast form if you want them but there shows half an hour shows each about sports like the day of sports and it's like a debate kind of. And I listen to those as much as I can, I often DVR them and then I I go through things where I watch like",
            "start": 489.84
        },
        {
            "text": "Half an hour shows each about sports, like The Dave Ramsey Show and it's like a debate kind of. And I listen to those as much as I can. I often DVR them, and then I go through things where I watch like one a day for you know keep up with it for a few weeks, and then I just have like 10, and I just delete them all cuz like they're useless after a day, yeah, cuz they're topical exactly, like they're like that day. And some of some of their podcasts don't even work after a few hours you know, like because things go so quickly in the world of sports. Um, but I'm I'm more of a reader, like I interact with things like informational things which I kind of look at as podcast are entertainment, like this one's an entertainment podcast, Beyond is an entertainment podcast, but a lot of people recommend you know like Hardcore History for instance, um, which is a Dan Carlin podcast, like people people really love that podcast. I get recommendations for that podcast for years, you know, like people say or you have to listen to this.",
            "start": 530.16
        },
        {
            "text": "for instance, um, which is a Dan Carlin podcast, like people love that podcast; I get recommendations for that podcast for years, you know, like people say \"you have to listen to this podcast\" and it's just not the way I really interact with things - I'd rather watch a documentary, I'd rather it be visual and audio, and uh, so you know, I'm watching Ken Burns' The Roosevelts and all those kinds of things; how that you were ready for it good. I actually started even watching like... the cool thing about YouTube is that they just don't think people like documentarians really get too crazy about copyright and stuff like that, and like, just like they like people watching their stuff on YouTube - it's just a wealth of documentaries; like I just search every once in a while, I just search for documentary and I just look and I'm like \"oh okay\", like it's a three-and-a-half hour documentary on the French Revolution that I watched when we were in New York, you know, like this is cool.",
            "start": 565.92
        },
        {
            "text": "for documentaries, and I just like look and I'm like oh okay like it's a three and a half hour documentary on the French Revolution that I watched when we were in New York you know like this is cool I can feel that it's awesome it's a long ass time The Roosevelts is like 16 hours my God I think Ken Burns' baseball was like 22 hours or something like that which was like an awesome documentary so I think I just interact with things a little bit differently where I like I don't really have a time where I'm just sitting there and I want to listen to audio because I I I compartmentalize the things that I do so when I'm writing I write when I listen to music I listen to the music when I'm watching sports I watch sports it's never there's never a time where I'm like doing something and there's something in the background and if there is like when I'm working out or cooking or something I'll just listen to music ambient music so it's just I think it's just a way that I interact with it's a mood",
            "start": 599.24
        },
        {
            "text": "in the background and if there is like when I'm working out or cooking or something I'll just listen to music ambient music so it's just I think it's just a way that I interact with it's a mood thing for me when I'm doing dishes or I'm cooking I like a podcast when I'm playing Minecraft I have I usually have it on mute anyway I'm playing some I'm listening to a podcast DC Universe when I'd go around farming my EXO bits and podcasts yeah yeah I love listening to podcasts while I drive there's just something about hearing some two other people talk that you don't have to respond to especially listening to like SModcast I don't know if you guys listen to SModcast at all but Kevin Smith and Scott Mosier just well I think they get super high in fact I know they get super high because you can hear them smoking on the show for a long time they even talk about how they're like well we were trying to hide this from every room now you'll just hear like the the click of the you know the big",
            "start": 632.92
        },
        {
            "text": "hear them smoking on the show for a long time, they even talk about how they're like well we were trying to hide this from every room now you'll just hear like the the click of the you know the big lighter once in a while yeah you hear little you never hear the bubbling but you do hear like that you'll hear a cough every once in a while and not that I'm advocating uh marijuana use at all but they just are having fun right and they're just joking around and they're two guys that have literally known each other almost their entire life um and they've got so many shared common things that they you know together these shared experiences together, not the least of which was you know Kevin Smith produced Clerks and has been his producer since then yeah um and so these guys share such a bond that they're letting you in on that I think that's just really really cool and hearing them laugh together and then you start the more you listen to it the more",
            "start": 667.92
        },
        {
            "text": "um and so these guys share such a bond that they're letting you in on that I think that's just really really cool and hearing them laugh together and then you start the more you listen to it the more you get those inside jokes and you start to hear the Inception of these amazing things that Kevin's doing where you know he had quit film making for a while and then because of his audience decided to get back into it uh with projects like Red State or Tusk or or Hobo With A Shotgun that's coming up now which I'm super excited for it's just it's it's a fun it's fun to be counted amongst people that podcast and it's fun to be a part of that culture MH yeah I like it a lot have you have you gone through your pics no so for me um the only one that I listen to religiously is my boy Tony Hinchcliffe tonf it's my boy Tony Hinchcliffe it's him and my other one of my other favorite rappers Pete Holmes their uh podcast is called Tacos and Chocolate Milk which is one of the greatest podcast names I'm going I'm going to listen to this",
            "start": 700.72
        },
        {
            "text": "tonf it's him and my other one of my other favorite rappers, PackFM, their uh podcast is called Tacos and Chocolate Milk, which is one of the greatest podcast names I'm going I'm going to listen to this, it's uh it's very a lot of in jokes and it's just two dudes that are like really good friends talking about hip-hop and also just talking about whatever, it's similar to the show in a lot of ways um and it's just it's really entertaining, I just I like listening to them, it's just like hearing their perspective on stuff when it's not being wrapped is really fun um so they're the only ones that I listen to all the time, that's CU I'm invested other podcast that I I enjoy is one called Chewing It with Steve and Kevin, the the guys from Broken Lizard, the super dudes oh wow they are hilarious, that sounds funny yeah they're they're great and they get a lot of good guests too um like they got the like the Workaholics guys and um so just a bunch of comedians talking about **** and it's so funny",
            "start": 740.0
        },
        {
            "text": "Sounds funny, yeah, they're they're great and they get a lot of good guests too. Um, like they got the Like the Workaholics guys, and um, so just a bunch of comedians talking about stuff, and it's so funny because they'll start talking about, like, huh, they got Michael Rosenbaum, I don't know, in your face, super, I'm telling you this right now. If there's one person that does a spot-on Christopher Walken, it's Mike Rosenbaum. Episode N of the Game Over Greg Show - click and watch it right there. His walking is is the upper echelon; it might be top-top percentile of walk-ins ever done. I'm talking I'd stack his up against J Moore; I would stack it up against Walken. I would, yeah. If you if I close my eyes, I wouldn't be able to tell you who's Walken and who's Michael Rosenbaum. Um, after that just goes into a bunch of YouTube people. You were saying the Red and Link one ear biscuits - another great name for a podcast. Oh god, um, Grace Helbig just started a new one. Have you guys listened to this at all? It's",
            "start": 782.16
        },
        {
            "text": "bunch of YouTube people um you were saying the red and Link one ear biscuits another great name for a podcast oh god um Grace Helbig just started a new one have you guys listened to this at all it's called um not so deep with Grace Helbig and it's it's really funny it's really good it's short she's doing something that's different that I I haven't seen yet where it's like the audio is like 20 minutes of it but then there's a YouTube component too that goes in the middle of it so it like it's weird and interactive and **** interesting too much for me to keep up with and actually do but she's got a billion subscribers and follow her doing that stuff oh the Rooster Teeth podcast that's awesome I like that one a lot never heard of them yeah there they're these dudes talk U but the Rooster Teeth podcast is really it's consistently good and what do you like about the Rooster Teeth podcast I like it that they're just I like them like they're funny people and they they always talk about really",
            "start": 824.92
        },
        {
            "text": "Our Favorite Podcasts - The GameOverGreggy Show Ep. 46 (Pt. 5)\npodcast is really it's consistently good and what do you like about the Rooster Teeth podcast I like it that they're just I like them like they're funny people and they they always talk about really topical things and um I like their perspective on stuff and I like that you get a bunch of different perspectives it's similar to this where it's just like you really do run a wide spectrum at this table yeah exactly of perspectives so uh it's it's good um but another one and I think this this is probably my favorite that I just to randomly listen to is the Face Breaker podcast which is Freddy Wong's oh interesting um it definitely has a cinematographer slant M where it's it's definitely definitely doing a lot very hardcore talking about like making videos so obviously I have some investment there um but also Freddy Wong is just a wealth of knowledge of just random trivia and Greg will attest to this don't even get me started on Freddy Wong yeah go Freddy no Freddy amazing human being",
            "start": 869.84
        },
        {
            "text": "there um but also Freddy Wong is just a wealth of knowledge of just random trivia and Greg will attest to this don't even get me started on Freddy Wong yeah go Freddy no Freddy amazing human being we love him very much obviously helped us out with the patreon stuff he's in our patreon video amazing he's he's a friend of ours a personal friend of our show but I mean like anytime you talk to Freddy you could just be like man it's just like it's crazy that this glass isn't flat and that it does this and he would break down the physics of this glass and where it was invented and how and why this happens and he'd have theorems and math and it's crazy man he just knows everything right he knows way too much about everything it's just like how do you know that much yeah him and Colin need a show where they talk to each other like when I'm sure Freddy will be through here at some point and when that happens one of the topics I want we should do is just like yeah me Nick and Tim want to see what",
            "start": 912.84
        },
        {
            "text": "they talk to each other like when I'm sure Freddy will be through here at some point and when that happens one of the topics I want we should do is just like yeah me Nick and Tim want to see what you and Colin talk about and we leave the room and leave them alone for 20 minutes watch just speaking to Freddy real quick Video Game High School season 3 just launched yesterday you guys should definitely check that out it's Nick you should check this out season three they stepped it up like that's my thing about like I I hosted the Comic-Con panel for them when it was it was me and Freddy and with the other guy not Matt of whose name I Bo no other guy Campos why can't oh look at your phone Wikipedia video game high school thanks for all your help I'll do it you didn't get me the charger earlier why didn't you say something we're trying to do a goddamn show over here so sad earlier great anyways I watched the show we did the panel it was I they didn't need me at all but for some reason I",
            "start": 955.8
        },
        {
            "text": "why didn't you say something we're trying to do a goddamn show over here so sad earlier great anyways I watched the show we did the panel it was I they didn't need me at all but for some reason I was brought along for the ride which was nice will is that sound right yes thank you it was will thank you it was Freddy and Will uh and I watched that show and it's amazing what season 3 looks like season 3 is insane looks like a movie episode but like holy **** I mean well it's the final season right they're not doing this anymore right when you go and you need to watch it Nick okay especially though just for the end with the opera scene when she starts singing and it's that Montage of everything that's happening it's like holy **** is this amazing they did good did you give up on it you said well he said yes I I want a double check I want verification def Tim's a lexicon walking freaking library of all these so he knows yeah definitely go check it out tweet F Wong telling him what you",
            "start": 996.68
        },
        {
            "text": "well he said yes I I want a double check I want verification def Tim's a lexicon walking freaking library of all these so he knows yeah definitely go check it out tweet F Wong telling him what you think about it yeah I'll tell you one thing about Freddy I've only met him a handful of times super nice guy does make you feel a little stupid cuz he's so smart and so insanely see he never makes you feel stupid though he's so smart and so incredibly see he never makes you feel stupid though he knows more than will Campos no Colin makes me feel stupid just because I will not in a bad way in in a way that makes me want to go and be more learned like I'll talk to Colin and I'll be like I should go home and read not in a degrading way and same with Freddy like I'm not saying like I was going to say what saying me Freddy's just a very funny guy right like he's super smart he was able to turn you know his love of of effects and making online video into not only a career but basically an insane lifestyle",
            "start": 1040.84
        },
        {
            "text": "just a really inspirational guy right like he's super smart he was able to turn you know his love of of effects and making online video into not only a career but basically an insane lifestyle for himself and his friends um and the guys that he works with and yeah now he's doing great work right and being able to follow his career from like just making ridiculous lightsaber videos to now making something that you guys are saying I mean clearly I have to watch now I'm interested I'm going to go see this see the production quality and you know I remember seeing High School Musical one and going okay this looks cool it's like a Nickelodeon show or something I see you know made for kids I haven't seen season 2 yet so I got to watch that and now I guess I got to watch these I got more stuff to watch Frank Miller yeah this and Franklin & Bash, I've done that and some dried fruit o some apricots maybe I like stuffing those down my throat ladies and gentlemen this has been another",
            "start": 1083.72
        },
        {
            "text": "to watch Frank Miller, yeah this and Franklin & Bash. Franklin & Bash done that and some dried fruit, o some apricots maybe I like stuff those down my throat. Ladies and gentlemen, this has been another episode of The GameOverGreggy Show. Remember, each and every week four sometimes five best friends gather on this table, each bring a random topic of discussion for you, your amusement. If you like that, a new episode posts each and every Friday, and there are a number of ways to get it over on Kinda Funny.com, that include Patreon support which we love so much, Bandcamp, and Vimeo, of course. If you don't think we're worth the money, neither do we. You can wait and over at youtube.com/KindaFunny, the episode goes up topic by topic broken out for your amusement starting on Sunday right now probably next week next week next week maybe on and on as long as people keep supporting us on Patreon with fifth topics right M I'm nailing it yeah something like that all right great we'll see goes we'll see",
            "start": 1117.44
        },
        {
            "text": "Our favorite podcasts week next week maybe on as long as people keep supporting us on Patreon with fifth topics right I'm nailing it yeah something like that all right great we'll see goes we'll see how it goes I'm think it's going to go well though of course you can buy T-shirts over at District Lines.com GameOverGreggy team Fat Kinda Funny.com store is that work yeah you can do that just it's easier kind.com for all your needs for everything there's a Team Fat shirt it's amazing but the Colin and uh my presidential campaign shirt no buy the other one a lot about this also do I've had a couple tweets now should we start making a shirt for our female audience yes I've yes I send them to you all the time female cuts do that no we don't we just sell these garbage bag T-shirts that hide the form and if there's anything we need to show it's the form of our listeners well cuz I think you know like my wife even says that she's like you know says me all the time",
            "start": 1157.88
        },
        {
            "text": "that hide the form and if there's anything we need to show it's the form of our listeners well cuz I think you know like my wife even says that she's like you know says me all time if you actually made them in in female cut all right do it it's done pull the trigger all right we have to just figure out which one we want to make we'll have to start with one just to see how it does you know me I'm very risk averse to these to that's the thing with our shirts is that we you know for you guys because we use like a third party vendor we buy them ahead of time so we need that is a good idea we we should test like team fat or should go with the most popular shirt we have which is the Scarpino Gular shirt not the of love the party just got started keep it going with us everyone Cheetos where's he at is he here I is he probably he's making big decisions somewhere he's on on in the FaceTime with the Israelis he's in he's in Iran negotiating the terms of the nuclear arms treaty ladies who watch",
            "start": 1200.76
        },
        {
            "text": "at is he here I is he probably he's making big decisions somewhere he's on FaceTime with the Israelis he's in Iran negotiating the terms of the nuclear arms treaty Ladies who watch this show let us know what shirt you'd like in the comments Should we send everybody to Patreon or should we do it on YouTube hit us up on Twitter cuz we'll be notified no who's going to go back and check that who's you yeah we need a place to collect them yeah what are you going to do you're I don't want to see this is an actual voting system what is this your guys is winning no there's not going to be votes if we win I just want to see we'll get a general consensus of the women's shirt which what shirt the women's want yep it's I mean again it's clear it's going to be okay go to the YouTube video this video the breakout and put it up there how about that is that okay and also on Patreon do not tweet at me about the ones that you like so it keeps it a little simpler if someone already posted",
            "start": 1238.08
        },
        {
            "text": "this video the Breakout and put it up there how about that is that okay and also on Patreon do not tweet at me about the ones that you like so it keeps it a little simpler if someone already posted one of those they can't tweet a Kinda Funny Games Kinda because that doesn't exist you have to go to Kinda Funny Vids Kinda Vids excuse me yeah yeah at Kinda Funny Vids but is a nightmare and a half we'll see how this one develops ladies and gentlemen until next time it's been our pleasure serving you",
            "start": 1281.28
        }
    ]
}