{
    "id": 423,
    "video_id": "p8BZDkcFz3I",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Crowdfunding - The GameOverGreggy Show Ep. 47 (Pt. 2)",
    "description": "Colin Moriarty explains his thoughts on the difference between Patreon and Kickstarter.\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1414393204,
    "duration": 1065,
    "transcript_chunks": [
        {
            "text": "Colin yes what's your topic uh so right after so let's go back let's step back about a month and a half I'm stepping back was that like I was in September I was in Japan yeah Kichijoji son uh standing and uh orating uh and uh we launched our Patreon when I was in Japan and it was an arousing success to surprise us all very much we're very honored by that and you know one of these things I think I anticipate right I think I'm pretty good at anticipating problems or things people are going to say things that are good and one of the things I didn't anticipate when we launched the Patreon was that people were going to come to me specifically and say why do you support Patreon but you don't support Kickstarter yeah you're not a big fan of Kickstarter you've been an outspoken advocate about burning Kickstarter to the ground no that's not true in fact there was an episode of The Game Over Greggy Show this summer where I talked about how I might have been harsh on Kickstarter",
            "start": 1.1
        },
        {
            "text": "an outspoken advocate about burning Kickstarter to the ground no that's not true in fact there was an episode of The GameOverGreggy Show this summer where I talked about how I might have been after Shovel Knight how I might be wrong about Kickstarter how it's facilitated but generally yeah but no generally I stick by it I think generally it's it's it's a little weird it's a little abused and it's it's a little kind of overdone now I think we're seeing that a lot a lot of games aren't being funded for instance games that would have would have been easily funded two years ago um and so I wanted to not only explain for me why Patreon and Kickstarter are very different kind of give people a look behind the curtain in terms of how he settled on Patreon um but also kind of get your guys' opinions on why Patreon works for you and how maybe it's different for Kickstarter for you even though I don't think three of you have a problem with Kickstarter anyway um because I think this is an important",
            "start": 56.56
        },
        {
            "text": "on why Patreon works for you and how maybe it's different for Kickstarter, for you even though I don't think three of you have a problem with Kickstarter anyway. Um, because I think this is an important conversation. Because I've been meaning to talk about this, and I talked about it a little bit with people on Twitter at the time, then we kind of forgot. We have well, that was the thing. People, of course, on Twitter will tweet me and be like \"how can you call him like this?\" I'm like, well, we actually tweeted about this a day and a half ago, which means no one can see it; it's you'll never see it again. So here's where I'm coming from with this, and this is what I wanted people to explain. Maybe you guys can tell me what you think. When we were at VidCon this year in Anaheim, we started talking about how can we grow our channel at the time which was Game Over Greggy, it wasn't Kinda Funny yet; we hadn't settled on that name before Tim Gettys came up with it and we talked a little bit about like well could we",
            "start": 94.36
        },
        {
            "text": "can we grow our Channel at the time which was GameOverGreggy, it wasn't Kinda Funny yet, yeah we hadn't settled on that name before Tim Gettys came up with it and we talked a little bit about like well could we Kickstart something like could we do something like is that possible and that was something that I kind of personally was like I don't I'm not comfortable with that in fact I went as far in a conversation with Tim to say like if that was something you guys were going to do I want to make it clear that I'm not going to take personal money from that cuz I don't believe that I want to do that and we we stepped away from it and we we kind of regrouped, this thing Patreon was kind of brought to our attention, yeah exactly, exactly, this thing Patreon was kind of brought to our attention, we we came to it, I was like, let's explain it to me, what is Patreon, how does it work, and what I loved about it, what what I gravitated towards it was it's a subscription service and that's always kind of",
            "start": 122.8
        },
        {
            "text": "we came to it I was like we'll explain it to me what is Patreon how does it work and what I loved about it what what I gravitated towards it was it's a subscription service and that's always kind of the way I looked at it so when people look at it as crowdfunding I guess technically it probably is but it's actually like a monthly subscription that you can get in or out of immediately and that you get things for immediately or as soon as we can possibly deliver them so in other words it's not like a a lump sum of $50,000 or $100,000 we're like in years we're going to give you a game or you know six months a podcast it's more like on this you could subscribe if you like us and we're going to give you something immediately so like today we did our Google Hangout uh we you know we have different perks and different thank yous and all those kinds of things and we were making new shows we just filmed one of two new shows and what I really liked about it was the rapidity in which you",
            "start": 155.32
        },
        {
            "text": "different perks and different thank yous and all those kinds of things and we were making new shows we just filmed one of two new shows and what I really liked about it was the rapidity in which you could deliver to people and give them what they want and see if they want to keep doing it or not and if that they can withdraw and I'd be totally comfortable with that because I want them to get something immediately and feel like they're getting bang for their buck and if not get out you know you don't have to wait there's no question that you're going to get what you want so to me uh Patreon ended up being uh a subscription model kind of funny and uh so that's kind of where I stand with it and that's and and I wanted to kind of explain that and see where you guys uh stand with it as well because to me I think it's a really ingenious service in the sense that it gives people unfettered access to the people that they want content from pretty much immediately at least that's the way I",
            "start": 190.52
        },
        {
            "text": "because to me I think it's a really ingenious service in the sense that it gives people unfettered access to the people that they want content from pretty much immediately at least that's the way I look at it as well for me it's it's the exact same thing minus a lot of nudity to what HBO is doing right and a lot of companies are starting to we can give him the nudity this uh oh all right that's not quite as sexy as True Blood you're not really doing it for me like the Mother of Dragons here oh all right okay he's only beer wow well keep drinking let's get through it you can't go back you got to just go through uh this is the way the world is going right we we are on demand it's not necessarily you know the democratization of of content but it's getting there to the point where you don't have to have your experiences chosen for you now for the first time we have the tools to as consumers or as people who want to view content uh get we get to choose which ones which which",
            "start": 221.88
        },
        {
            "text": "have to have your experiences chosen for you now for the first time we have the tools to as consumers or as people who want to view content uh get we get to choose which ones which which pieces of content we want to you know program for ourselves and it's huge this is an insanely insanely powerful time for Content creators and audiences alike largely because you know how many tell me more tell me 10 channels list 10 channels right now on basic cable that you watch regularly I don't watch T exactly right like not a lot of people can't even if you can I I don't think I can name 10 channels other than HBO maybe Showtime Encore and MTV mtv2 you watch you watch three mtvs no you don't well that's what I'm saying is I you know it's a it's a rudimentary argument but the concept is there's a lot of shows I don't watch but yet I still have to subsidize I still have to pay for because my cable bill is so damn expensive because they the cable company has to",
            "start": 274.52
        },
        {
            "text": "Is there's a lot of shows I don't watch but yet I still have to subsidize, I still have to pay for because my cable bill is so damn expensive. Because they, the cable company has to be able to afford all those channels; they have to charge us more in order to be able to keep those channels alive. And then those channels bear the burden of having to have 24-hour programming seven days a week. It's it's a nightmare. Now we've got services and HBO is very much leading the way with this, but actually I give it to Netflix as the creator of all this because they're the ones that first made the subscription model really work. I don't know how I've been a Netflix subscriber for maybe two or three years, and really yeah, I've been it's been for a while. I like I thought that was short; no, no, no. It's it's I I was very late to everything always a late adopter. So I got on it because I was like, \"Oh, this is a cool way to rent DVDs,\" where as Blockbuster was dying.",
            "start": 321.48
        },
        {
            "text": "was short no no no it's it's I I was very I me a late adopter to everything always late adopter so I got on it because I was like oh this is a cool way to run DVDs where as Blockbuster was dying and then I realized quickly that you know I I could just wait a couple weeks and get the streaming so I went streaming and then I realized of course streaming on demand subscription content is the wave of the future so I should just get used to it and now I'm having that debate internally of do I have to should I cut the cord every week my wife and I kind of roach the subject of like should we just get well the answer is yes now it is entirely but it's also amazing because everyone's doing this and and it's it's going to put probably uh mainstream media a lot of these companies out of business like a lot of the networks are going to have a hard time competing with people like us because we can give you know soon hours of entertainment per week to people whereas and we you know we can give them",
            "start": 356.84
        },
        {
            "text": "a lot of the networks are going to have a hard time competing with people like us because we can give you know soon hours of entertainment per week to people whereas and we you know we can give them exactly what they want doesn't cost us that much to do it's just our time and there's a a genuine connection to our audience who can tweet at us and talk to us and come see us that you just you can't do that with a show like The Blacklist you can't do that with CBS or NBC uh so to me when you guys brought up when you guys met the Patreon guys I don't think I I still have not met them which is disappointing dude they're good people from good folks and you started talking to me about this I was like wow this is something really powerful and really cool and to Colin's point being able to offer people value above and beyond what you can normally offer them with your your normal distribution outlet like YouTube like with Patreon we have the ability to give people stuff early and you know like right",
            "start": 393.8
        },
        {
            "text": "value above and beyond what you can normally offer them with your your normal distribution outlet, like YouTube, like with Patreon, we have the ability to give people stuff early, and you know, like right when it's done, we can give it to them and see what see how they're going to react to it and get that feedback back from them and have that community grow there where it's uh you know so we can grow there, we can grow YouTube, we grow all sorts of places, it's really really cool. That's the big thing for me is the instant feedback is what you're talking about right, and the difference between Kickstarter - I today I got an update on a Kickstarter I funded or whatever right and it's like oh right I didn't remember I was doing that I forgot about that whereas Patreon I try to have uh you know every nowadays every few days because people were telling me I was posting too much on the wall every few days contact right or like today we did the stream, I immediately posted what did you think of the",
            "start": 434.92
        },
        {
            "text": "nowadays every few days because people were telling me I was posting too much on the wall every few days contact right or like today we did the stream I immediately posted what did you think of the stream tell me how to make it better right and they give us that feedback to make it immediate where yeah Kickstart, years from now you get the game like this sucks and I can't do anything about it whereas like now it's like well you know I always liked it just the fact that if we start messing up and we start you know we've promised these Milestones there's these perks we start missing those things and we alienate you, you leave right away I mean like you can get out early you have that power yeah I I mean I I like Kickstarter, you know calling me you you're coming around and I'm sort of coming the opposite way with it but I do from that same reason of like I I backed a movie called Kung Fury and I really want to see this thing happen but it's been a year",
            "start": 468.12
        },
        {
            "text": "around and I'm sort of coming the opposite way with it but I do from that same reason of like I I backed a movie called Kung Fury and I really want to see this thing happen but it's been a year now and I'm like oh I forgot I forgot that that thing is still a thing not necessarily as fired up as I will be for it when it actually comes out eventually but for me it's really about being able to go out there and support like it's it's it's a weird thing to say but there's no middleman anymore you don't I don't have to deal with a Hollywood studio or television network or a production company or any of that stuff I can if I have a cool idea and it's good enough and good enough on its own merit to warrant other people coming out to support it well I have that tool now and that's either going to be Kickstarter Indiegogo or Patreon and as a person who has one day an aspiration to make you know a two-hour long feature film like I hope those things stick around I hope they even grow more and all",
            "start": 506.56
        },
        {
            "text": "Kickstarter or Indiegogo and as a person who has one day an aspiration to make you know a two-hour long feature film like I hope those things stick around I hope they even grow more and all this other crap of you know the studios having to make you know a horror film because horror is big right now and all that stuff can just go away it can just go away but now back to what you're talking about which is kind of off the topic a bit I it's interesting you were talking about games right and how some games aren't even getting funded now is we've definitely Patreon is an interesting thing just in the fact that we're able to appeal to our audience and our hardest of hardcore fans can come and support us and take care of us right but then you are seeing kickstarters not getting funded I I pulled up uh the Indiegogo for Hot Mess Moves an amazing YouTube channel we all love we love those two girls they do amazing content but they're trying to raise $30,000 right and they have eight",
            "start": 544.36
        },
        {
            "text": "I pulled up the Indiegogo for Hot Mess Moves, an amazing YouTube channel we all love. We love those two girls; they do amazing content. But they're trying to raise $30,000 right now and have eight days left, which means by the time you see this, one day right maybe – no, they have two days left because this will go live on Monday, and then yes, two days left. Uh, but they're only at a little over $1,000, and it's like that should be a slam dunk; they make such amazing content, you know what I mean? They're hilarious; they're not kind of funny; they're very funny. They're girls, so by definition, they're much more fun to look at than we are – unfortunately, sadly for us. You're such a weirdo, I know. Uh, yeah, so I mean but that's what we're saying: like, so many people are using crowdfunding now and doing all these different things; it's an interesting thing. Well, go ahead; you haven't chimed in yet. I was my thoughts on it are I think crowdfunding isn't",
            "start": 579.44
        },
        {
            "text": "people are using crowdfunding now and doing all these different things that it's an interesting thing well go ahead you haven't chimed in yet I was my my thoughts on it are I think crowdfunding isn't inherently a bad thing I think it's a great thing um I think that you're spot on about the subscription aspect of Patreon that makes it different than Kickstarter I do think it is crowdfunding because it is what it is it is but I look at uh at Patreon as a subscription service I look at Kickstarter as just buying stuff like I've said this before but pre-ordering stuff basically it's pre-ordering yeah so it's like I I buy a lot of music off of Kickstarter albums that they just need help making you know it's like they just don't have the money to ship it and do all that stuff so they need the money to be able to do all that so I'm just pre-ordering something that I'm going to buy maybe get a t-shirt maybe get some like the extra perks just kind of like I found that because they're using Kickstarter",
            "start": 619.2
        },
        {
            "text": "able to do all that so I'm just pre-ordering something that I'm going to buy maybe get a t-shirt maybe get some like the extra perks just kind of like I found that because they're using Kickstarter now I'm not just getting a CD I'm also getting a bunch of like a a behind the scenes DVD all this like extra random **** that's just like cool I wouldn't have had this otherwise and like I like that stuff and if it's people I support I want more dumb little Trinkets and **** I was just showing Greg uh this group I like Cunning Linguists they put out a a new album Cunning Linguists that's very nice yeah that they're really embarrassed by it cuz it made sense in 2001 now they're just like God we're old and this isn't we have kids and grandkid yeah um we have kids and grandkids and uh but anyway so they they released a a new mixtape and it's on a CD also comes on vinyl also comes on cassette and that was just a like a Kickstarter type bonus how can even make a cassette these days you can",
            "start": 659.48
        },
        {
            "text": "so they released a new mixtape and it's on a CD, also comes on vinyl, also comes on cassette - that was just a like a Kickstarter type bonus. how can even make a cassette these days? you can find that vendor that will make you a cassette cuz the Guardians of the Galaxy just said we were talking about that where they're going to release soundtrack on a cassette and that blows me away cuz I was like you would have to literally find the one vendor in the world that can still make a cassette and put and obviously they're not expecting people to listen to this cassette unless you have an old '88 Honda Civic like I used to have that had his cassette player in it. I can't even say the word cassette that's how old it is - get out my tongue recently I saw someone uh tweet a picture of a bunch of Disney VHS tapes and she's like oh man look at all my old VCRs or no VHS tapes I'm like oh God yeah it's been a while hasn't it you don't know what to call them anymore yeah but",
            "start": 699.28
        },
        {
            "text": "picture of a bunch of Disney VHS tapes and she's like oh man look at all my old VCRs or no VHS tapes I'm like oh God yeah it's been a while hasn't it you don't know what to call them anymore yeah but with with the Kickstarter and um Indiegogo versus Patreon they are similar things but they have very different uses right and I think that yeah Patreon is a subscription thing but it's like that's just because that's what we made of it you know and that's kind of the same a lot of people did that too I mean like that's Patreon's whole thing is like support artists making art right or whatever but it's like what I'm saying is it's kind of not is Kickstarter good or bad it's really how is each individual using it yeah know yeah that's a good point I mean what what the it was funny because like I said I didn't anticipate it because I thought it was so obvious how they were different in my mind because that was just an assumption I made so I wanted to just talk to people about and see like",
            "start": 739.0
        },
        {
            "text": "I said I didn't anticipate it because I thought it was so obvious how they were different in my mind, because that was just an assumption I made. So I wanted to just talk to people about and see how you guys felt about it. Because the big thing I remember when we were talking about it was, \"What is this? Can you explain it to me?\" And is anyone going to not get something because of this? Because we give away our shows for free, you know? Yeah... um... And what I loved about it was because and how why they it diverges from Kickstarter so significantly is Kickstarter is like, \"There's nothing, and we're going to give you something.\" Yeah. And for us, because like you're saying, is well, we make it on Patreon, is we are going to do this anyway, and you just let us do more of it and give it to you in different ways, give it to you early or whatever. But it's still there if you don't want to support us. And that was like one of the things that was really important was, I want... I don't want anything.",
            "start": 779.88
        },
        {
            "text": "ways give it to you early or whatever, but it's still there if you don't want to support us and that was like one of the things that was really important - was like I want nothing to change, I want nothing to change for the people that don't support us and that was what Patreon allowed us to do so that's why I was really excited about. I'm like this is a great idea because it gives us the impetus obviously to make new shows and new content and give you guys things in cool new and creative ways, but it doesn't stop us from hitting the people that maybe are more casual fans or maybe they just don't have the money to pay for us but they like our content - like they don't suffer and that's that's that was so essential to me. So that was why I was so excited about Patreon because I was like this is something that my my partners want to do it hits all the notes for me perfectly, it's crowdfunding in its own way which you know I've had some bad things to say about but at the same time",
            "start": 818.16
        },
        {
            "text": "like this is something that my my partners want to do, it hits all the notes for me perfectly, it's crowdfunding in its own way, which you know I've had some bad things to say about, but at the same time it's it's a sub, it's no different to me than Amazon Prime or Netflix and that's what I and I like that if you don't like what you're getting, I accept that you can get out and you don't really lose anything, get out, you still get our content right exactly so it's cool, so I wanted to I want to explain that and also get you know and thank everyone of course out there for for supporting us but um you know also voice that because I've been meaning to do that for like two months so I'm sorry that this topic came so late it's a little not it's not timely really at all anymore but um you know yeah just kind of express that to people and see see what you guys thought about it because I'm super excited about the Patreon model because I think it's just cool, it's just a cool way to subscribe to to",
            "start": 851.2
        },
        {
            "text": "just kind of express that to people and see what you guys thought about it because I'm super excited about the Patreon model because I think it's just cool, it's a cool way to subscribe to Kinda Funny, it's an ingenious Model A and B, it's very empowering on both sides, it really is for us, it keeps us on track, it also gets built-in functionality like that we have actually installed to keep us honest to make sure that we're putting out more content, and just from a from an artistic perspective it helps us constantly rethink of what the next thing we want to do, which is really really cool, that's not something that's that's something that's actually hard, that I think we've had a little bit of trouble dealing with in the last couple years of doing the show or doing these shows is because even to get to the stage where we do this podcast was like a I think we wouldn't have gotten there well how am I phrasing this let me see uh you're very",
            "start": 888.0
        },
        {
            "text": "the show or doing these shows is because even to get to the stage where we do this podcast was like a i think we wouldn't have gotten there well how how am I phrasing this let me see uh you're very important we understand no no no I'm not I'm not very important you're more important than all of us we already voted and you got that title for now no but just but but rolling out this podcast for instance right should have happened a long time ago but we just we didn't have the time or the energy or the inclination to do so so now that we're on Patreon and looking at we have to do two new shows it's cool for me because it it forces us to get in a room get a Starbucks coffee or something and just start floating around fun ideas and figuring out what what's avail if it's not publicly shared there's so like you know like the live event I'm still moving behind the scenes I'm making that happen but if it was just like we should do a live event we said that at lunch never 6 months later like we",
            "start": 922.88
        },
        {
            "text": "so like you know like the live event I'm still moving behind the scenes I'm making that happen but if it was just like we should do a live event we said that at lunch never 6 months later like we should do a live event you know what I mean it would just keep going now it's like I got to make sure I'm sharing it on Patreon and telling people it all provides the impetus because at the end of the day we won't we don't want to let you down and I think unlike Kickstarter, we don't want to let you down in two years we don't want to let you down drag you around now we don't you down what are your thoughts on did you see the guy that that got paid like $80,000 to make potato salad yeah it's funny I mean he was making a point you know like he made now he has to make a lot of **** he's got to make a l he already did I thought he already did the potato salad like festival or whatever they were talking about I don't know I don't know how that went I know he had to make a bunch of t-shirts and",
            "start": 960.52
        },
        {
            "text": "a l he already did I thought he already did the potato salad like festival or whatever they were talking about I don't know I don't know how that went I know he had to make a bunch of t-shirts and hats and supposedly he was like **** it's it's it's it's funny because like a direct quote when we reached out to her comment Mr Thomas said Fu it sounded oddly enough like a Greg Miller fart it's funny because I think that that whole thing was obviously a commentary G to ride it definitely was but yeah so I just wanted to kind of Express that to our you know our people out there and and let them know where we're coming from and I'm sorry again that it took us soul and answer that I've been meaning to do it actually since I got back from Japan and just kind of slipped through the cracks but yeah like I'm so excited about Patreon and I I think what we have going on there is special and I love that it's it's it's forcing us to do new and unique things we we just filmed the new one of our new",
            "start": 995.2
        },
        {
            "text": "like I'm so excited about Patreon and I I think what we have going on there is special and I love that it's it's it's forcing us to do new and unique things we we just filmed the new one of our new shows this past weekend and we're going to keep doing them we're going to keep giving you guys new and cool things on on Patreon to to to you know see what you guys think and how you guys want to respond to those things and we're going to keep we're going to keep on going with that so so thank you and I hope that that makes sense to some you know I think most people got where I was coming from originally but for the people that you know questioned that or whatever I hope that that answers your question",
            "start": 1026.92
        }
    ]
}