{
    "id": 2043,
    "video_id": "l3mDgR_0_YA",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Andrew Goldfarb",
        "Colin Moriarty"
    ],
    "title": "PS4 Pros and Cons - PS I Love You XOXO Ep. 52",
    "description": "This week, IGN's Andrew Goldfarb joins Colin to talk about some ways PS4 Pro makes sense (and the many ways it doesn't), how PS4 Slim can help mitigate Xbox One's growing sales, and why we're so god damn in love with BioShock.\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://soundcloud.com/alessandrodiosi/03-pretty-lady\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1473782406,
    "duration": 6092,
    "transcript_chunks": [
        {
            "text": "Welcome to PS I Love You XOXO Episode 52. My name is Colin Moriarty. I'm joined today by IGN's news editor, new senior editor, executive editor, executive editor of news. Yeah, it's way too executive editor of news. So not editor, senior editor, executive editor of news, Andrew Goldfarb. It's me. Hello. Yeah. Thank you for having me. This is the first time you've been on the show. It's the first time I've been on PS I Love You. Right. And first time in the news studio, which is super nice. What do you think? You like it? Oh my God, it's gorgeous. I did it all myself. It looks so professional. I bet you did. I've been working extremely hard. This is like the old fireside chats that we kind of did. Yeah, exactly. You still are found on podcast beyond our old podcast on IGN.com PlayStation podcast over there. Thank you for joining us. For those that are curious, Greg is gone doing some stuff pre GameStop X, while we're going down there tomorrow. So we're recording this. This will be the",
            "start": 0.0
        },
        {
            "text": "over there. Thank you for joining us. For those that are curious, Greg is gone doing some stuff pre GameStop X, while we're going down there tomorrow. So we're recording this. This will be the last show we record for a few days. But there's much to catch up on because last week was a very eventful week. Now, Andrew, to catch everyone up really quickly, we did a PS I Love You Episode 51. That was kind of a live Twitch stream that was really only about somewhat about slim, but mostly about pro. I'm going to pretend that that never happened in a sense specifically because I just want to have more of a news layout about what these things are. Some people know, so it's less opinion based. Maybe it'll probably become very opinion based at some point, but more about what is happening. So we have some actual information as opposed to gut instincts, which a lot of people didn't really care for. So I want to make sure that we at least have those bases covered. So I just wanted to warn people.",
            "start": 59.4
        },
        {
            "text": "some actual information as opposed to gut instincts, which a lot of people didn't really care for. So I want to make sure that we at least have those bases covered. So I just wanted to warn people. And a lot of stuff rolled out in hours after too. Some shirts a little more fleshed out. Exactly. So I just wanted to inform people of that. So as we usually do when I do these shows without Greg, or as I did last time I guess with Vince, I'm going to skip some segments we're not going to do this time. We're not going to do PS I Love This Best Friend. We're not going to do The Name of the Week and we're not going to do The Song. I kind of leave those things up to Greg. That's more Greg's wheelhouse. I want to talk about the content. We'll get some reader questions in. There's 11 pieces of news on the Roper's Report this week. Very unique name that we've come up with. Barely distinguishable indeed from Roper Report. I'm used to looking at this camera. Now I'm looking at this camera. What I'm",
            "start": 96.84
        },
        {
            "text": "the Roper's Report this week. Very unique name that we've come up with. Barely distinguishable indeed from Roper Report. I'm used to looking at this camera. Now I'm looking at this camera. What I'm trying to figure out is which one to look at. There are so many cameras. That's my one shot. That's the one in the middle. That's the main dude. And that's my camera. And so that's yours. But we don't really address them on this show. Colin and Greg live. We like to do the one shot a lot. That makes sense. On this particular show, you can look at it. You can stare at it the entire time for all I care. You can stare at the monitor, stare at Kevin. You can stare at the monitor like Nick. So thank you everyone out there for your patience with Greg not being here. We have a great fill in with Andrew. Very knowledgeable. I think this is a good episode to have you on. Also it's Bioshock Week which I thought was pretty funny because Bioshock Collection comes out in a little while. Now before we",
            "start": 127.48
        },
        {
            "text": "Very knowledgeable. I think this is a good episode to have you on. Also it's Bioshock Week which I thought was pretty funny because Bioshock Collection comes out in a little while. Now before we begin Roper's Report with the news, is there anything that you want to say? Do you have a preface? Is there some sort of prologue to this podcast that you want to say? I'm no filibuster. I have a speech. No, not at all. Just hey everybody. I have a lot to say about everything this week. There's a weird, PS4 Pro left me in a weird spot I think. And there's Sony in a weird spot too. It's been a weird week watching other people's reactions. It's been a weird week kind of reacting my own way. And then Sony had a bunch of stuff pile up all at once. Bad week. Yeah it really was. It was a bad PR week for them I think. And especially following that announcement like the Blu-ray thing rolled out and just like a few other kind of little nuggets here and there. And then of course Bethesda and some of the",
            "start": 163.34
        },
        {
            "text": "them I think. And especially following that announcement like the Blu-ray thing rolled out and just like a few other kind of little nuggets here and there. And then of course Bethesda and some of the stuff. Yeah it's been a really solid, rock solid week for Sony. All right so let's get into it. Before we do, I want to say two things. I apologize for two things. I'm still getting over my sickness so I apologize if you're obviously listening to this whether you're watching the video or listening to the podcast. Might sound a little sick. I know that's not very pleasant so I do apologize about that. More importantly if you're watching the video I apologize about my hair and my beard. I look like I'm fucking homeless. All right. I think they look good. I think they look good. Back to the shot. Yeah you're right. I look all right. Okay now let's get into the news number one. Are we not going to do the jingle? Oh yeah we can do that. I forgot. Well I'm usually with people that don't know",
            "start": 206.72
        },
        {
            "text": "Yeah you're right. I look all right. Okay now let's get into the news number one. Are we not going to do the jingle? Oh yeah we can do that. I forgot. Well I'm usually with people that don't know what the fuck's going on. All right. What is now and forever will be Roper's Report. Time for some news and then Greg does the thing and he draws a Superman logo on him. Yeah that sounds like Greg. Number one. PlayStation 4's new iteration codenamed Neo is officially called PlayStation 4 Pro. PlayStation 4 Pro, a moderately more powerful unit that strives to enhance games graphics, frame rates and resolutions amongst other tweaks, will launch on November 10th and will cost $399. That's in USD of course. You're going to have different things. I think it's $399. I think it's $249 maybe pounds? Something like that. I don't know. Sounds right. And then you know $40,000. $40,000 billion Australian dollars. Yeah and a billion Australian dollars. Who knows what it's going to cost in Brazil. The Pro",
            "start": 239.12
        },
        {
            "text": "like that. I don't know. Sounds right. And then you know $40,000. $40,000 billion Australian dollars. Yeah and a billion Australian dollars. Who knows what it's going to cost in Brazil. The Pro doesn't phase out the standard PS4 but is designed to sit alongside it similar to a phone or tablet upgrade. The console strives to take advantage of high tech 4K and HDR technologies but doesn't necessarily require an expensive 4K television to use. The console comes with a 1 terabyte hard drive, boosted CPU clock speed and double GPU power. It won't however include a 4K Blu-ray drive for physical 4K media as Andrew noted. According to Sony's Andrew House in a conversation with IGN the console is designed to go after PC players who might look to abandon consoles during a standard console generation. Quote, I saw some data that really influenced me. It suggested that there's a dip mid console life cycle where the players who want the very best graphical experience will start to migrate to PC",
            "start": 280.5
        },
        {
            "text": "Quote, I saw some data that really influenced me. It suggested that there's a dip mid console life cycle where the players who want the very best graphical experience will start to migrate to PC because that's obviously where it's to be had. We wanted to keep those people within our ecosystem by giving them the very best and very highest performance quality. So the net result of those thoughts was PlayStation 4 Pro and by and large a graphical approach to game improvement. End quote. What do you make of this? Because I actually have no idea if you're on board with this. It sounds like you kind of gave us a little preface that you're not. But what do you make of this? Are you as, do you have this guttural reaction that I do that this is totally unnecessary? Well, yeah, I just don't know why. Like my whole thing from this event, I was like, I just, all I need is to walk away knowing why they made it. Because I knew like I wanted like the rumors that was coming this year, I am not going",
            "start": 315.98
        },
        {
            "text": "Like my whole thing from this event, I was like, I just, all I need is to walk away knowing why they made it. Because I knew like I wanted like the rumors that was coming this year, I am not going to get a 4K TV in the next 90 days. So for me it was never really on the table, but I also walked away from it like, well, why would anyone want it? Like I don't really know, especially with the HDR update for all other existing PS4s, I think if you have a TV that supports that, you're covered. If you want, if you have a 4K TV, like I guess there's no reason not to get this if you don't have a PS4 yet. But if you already have a PS4, I don't think they made a compelling argument for why you would get rid of your existing one to get this. Yeah, I think that the problem is multi-tiered. I think that there's obviously, I keep saying, and I've said that this isn't for anyone, but this is obviously for someone. My big, I actually kind of had this pit feeling in my stomach when I saw Andrew House's",
            "start": 350.36
        },
        {
            "text": "there's obviously, I keep saying, and I've said that this isn't for anyone, but this is obviously for someone. My big, I actually kind of had this pit feeling in my stomach when I saw Andrew House's talk about this, like later on when they were kind of, because I think we can all agree the press conference was bad, right? So they had to go out and really do a lot of damage control. I don't know what they were thinking with that press conference. But when he's like, he says to you guys, to IGN, quote, so the net result of those thoughts about the thoughts of keeping PC people or keeping people from abandoning PS4 to go to PC. So the net result of those thoughts was PlayStation 4 Pro and by and large, a graphical approach to game improvement. And I have a, and that's the end of the quote. I have a massive fucking problem with that. Massive problem with it. I know some people think that that's good. I don't because as I said on PS, I love you, the kind of impromptu episode 51 that we did",
            "start": 391.42
        },
        {
            "text": "have a massive fucking problem with that. Massive problem with it. I know some people think that that's good. I don't because as I said on PS, I love you, the kind of impromptu episode 51 that we did game development hasn't perfected anything outside of graphics. So why are we enhancing the thing that I really do feel matters? Not maybe least, but matters not very much compared to design, fun factor, gameplay and all those kinds of things. Now the argument can be made that for instance, a 60 frames per second frame rate as opposed to 30 frames, a frame rate can enhance the gaming. And I get that. I understand that. I don't necessarily feel like I need that, but I understand that that's a lot of people's argument, especially with first person shooters. I get that. But I feel like with the imperfect nature of the way games are now, we're just enhancing the thing that I don't feel like matters the most. Games are pretty. And I feel like there's a place for the last of us. There's a place",
            "start": 430.54
        },
        {
            "text": "nature of the way games are now, we're just enhancing the thing that I don't feel like matters the most. Games are pretty. And I feel like there's a place for the last of us. There's a place for Uncharted, these lifelike games, but that's not what's important. And for them to basically come out and say like a graphical quote, a graphical approach to game improvement. What about gameplay? What happened to playing games? What happened to the design elements of these games? I made the argument, I'll keep making it because no one's giving me a satisfactory answer. Find me a game on PS4 that couldn't in theory in a scaled back way run on PS3 or PS2. And everyone's like, well, The Witcher. And I'm like, no, we had open world role playing games. So that's not a good answer. And people are like, well, what about the Shadows of Mordor? And I'm like, that's not a good example either. The point is, is that VR is really the way we're going to be playing games in a new way. But shouldn't we",
            "start": 475.3
        },
        {
            "text": "like, well, what about the Shadows of Mordor? And I'm like, that's not a good example either. The point is, is that VR is really the way we're going to be playing games in a new way. But shouldn't we concentrate on other things? I understand the argument that people say that's not really Sony's fault, that's the studio's fault. But I say if you keep doing this kind of thing, then you're basically putting the spotlight on the wrong kind of thing. So what do you make of all of that? I know I spoke a lot there. No, no, no. I agree with so much of that. And I'm far from the first person to say this, but the weird thing to me is if you are so obsessed with graphics, why are you playing on a console to begin with? I mean, granted, they're first party exclusives, obviously, but it's like if your whole thing is that you need everything to look as good as it can possibly look, you're probably a PC gamer. And I don't know that they made any kind of compelling case that you should stick to a",
            "start": 512.74
        },
        {
            "text": "whole thing is that you need everything to look as good as it can possibly look, you're probably a PC gamer. And I don't know that they made any kind of compelling case that you should stick to a console or that a console is going to give you a PC experience, especially when Scorpio's on the horizon and we've already seen closer to PC specs on a home console. So I don't really know. I'm the same boat. I think with that press conference, I'm surprised they streamed it at all, because I think one advantage they might have had would have been to do the PlayStation meeting, invite out select press, let people see this thing, do the Mark Cerny presentation behind closed doors, and then maybe you get people coming out and saying, oh, in person it looked really good. But doing a streaming press conference on Twitch and YouTube at medium quality where everything's compressed anyway and doesn't look like it will look on a beautiful 4K TV, I don't really know what they showed off. And you're",
            "start": 548.8
        },
        {
            "text": "conference on Twitch and YouTube at medium quality where everything's compressed anyway and doesn't look like it will look on a beautiful 4K TV, I don't really know what they showed off. And you're also exactly right that graphics are, we're doing pretty good on graphics, I think. And Uncharted 4 looks damn good on a 1080p TV on PS4 as it is. I don't know that the evolution I needed from that was higher fidelity graphics. I think for me it's more like, yeah, let's keep going down that path of storytelling and of mocap technology improving and all of that. And that stuff's important. And then of course performance and frame rate and things like that. But I don't know that realistic graphics are the thing I've been missing this generation. Yeah, definitely not. I feel like I've made the argument before, and it might not be a salient argument to some people because of the complicated nature of the cell processor in PlayStation 3, but I've made the case before, and so forgive me for those",
            "start": 591.04
        },
        {
            "text": "before, and it might not be a salient argument to some people because of the complicated nature of the cell processor in PlayStation 3, but I've made the case before, and so forgive me for those that have heard it, that there's a leap of difference between Uncharted, Drake's Fortune, and The Last of Us. This was made on the same exact console over a 10-year period and I feel like in development, and I feel like since Project Big and all that kind of stuff, and I feel like there's more power to be extracted. I just wonder, who was really asking for this? Patrick Klepik made an interesting tweet during the PlayStation meeting right around the time it was going on, which I thought was in line with something I had heard from a source of mine, which is that developers don't seem to be enthusiastic about this at all. And I think that the list of games that are getting patches that are already out really says it all. A lot of it's first party, they're going back to Infamous and all of the",
            "start": 630.96
        },
        {
            "text": "about this at all. And I think that the list of games that are getting patches that are already out really says it all. A lot of it's first party, they're going back to Infamous and all of the other. I'm like, really? The thing that really gets me in my gut is, is this why Horizon was delayed? Is this why The Last Guardian, which we're going to talk about a little bit, is delayed? Is this why? Maybe not, but you can't help but read into those kinds of things to wonder, what are you guys doing? And is this thing really going to sell? Is this thing really a compelling item that you had to go out of your way to complicate the entire ecosystem that you guys... The way I put it was, just keep your foot on the gas and just fucking drive the car forward, as fast as you can. The thing is selling, PS4 is selling without all this, meteorically. You don't need help. And I agree with you, we've never really been graphics whores on console. And often the weakest console, or the weaker of multiple",
            "start": 665.88
        },
        {
            "text": "PS4 is selling without all this, meteorically. You don't need help. And I agree with you, we've never really been graphics whores on console. And often the weakest console, or the weaker of multiple consoles, is often the winner. So that's just the way we play. Now I appreciate the future proofing that they're trying to seem to be doing, but I also think this is a problem. I've often talked about how solutions are often developed for problems when you see them on the horizon. And this problem isn't even on the horizon. They've developed a solution for a problem that they anticipate they might have. And maybe that's smart. We often talk about how PSVR is very smart, proprietary piece of technology that I think will pay off for Sony as a whole. But I just don't see it. I just don't see how this makes any sense. I've said before, and I'll say it again, they should have just revealed PS5 next year and released it in 2018 as a fully backwards compatible, much more powerful machine. And I",
            "start": 705.32
        },
        {
            "text": "this makes any sense. I've said before, and I'll say it again, they should have just revealed PS5 next year and released it in 2018 as a fully backwards compatible, much more powerful machine. And I think that would have made their case similar five year distance between PS1 and PS2. The PS2 to PS3 was six years. And the PS3 to PS4 was only so long, I really do feel, because of the financial crisis. Otherwise, I don't think it would have been that long. So I feel like that's in line with conventional thinking. And I feel like that's why I give Scorpio more of a pass, because not only is it a more powerful unit, but there's a four year distance between that and Xbox One, which is the same as the original Xbox and Xbox 360. And it was also like that video for Scorpio was like, granted, it was like marketing. It was like a very well produced little video thing. But it sold me on the Scorpio more than the hour long PlayStation meeting did, I think. The point I'm in is like, I understand",
            "start": 743.2
        },
        {
            "text": "was like marketing. It was like a very well produced little video thing. But it sold me on the Scorpio more than the hour long PlayStation meeting did, I think. The point I'm in is like, I understand why they're doing all of this. I just don't see why they're doing it now. Like 4K TVs are like right on the line where they will be priced mainstream, maybe even as soon as next year. And I do think like it is very, very smart to see that trend coming and say, you know what, like more and more people are going to be buying these things. We want those people to buy a PS4 when they do. That is very smart thinking. That's they're on the right track. But why do it now when you have a vast hardware lead? I mean, we have less than 40, so there's probably between 45 and 50 by the end of 2016 would have been sold anyway of the standard issue PS4. Why push it, especially when you're already launching new hardware this year to begin with? I don't really know what the logic was. Even if it does sell",
            "start": 783.2
        },
        {
            "text": "been sold anyway of the standard issue PS4. Why push it, especially when you're already launching new hardware this year to begin with? I don't really know what the logic was. Even if it does sell well or even if it doesn't, I don't think if it fails that PS4 is dead and Sony is never making consoles again, I don't think it's a massive success that it proves that regular PS4 wouldn't have been. I don't think there's really a good barometer for this thing. So for me, again, I'm not going to get a 4K TV in the next three, six months probably. So I'm going to wait to get a PS4 Pro when there are bundles or when it's $50 cheaper or when the technology is better or maybe I'll just skip it entirely if they really do announce a PS5 in the next 18 months. It is important to note again that they claim, and I believe them because of frame rate and all that kind of stuff, that you don't necessarily have that about 4K TV to use HDR technology or to use, I guess, the enhancements, the frame rate",
            "start": 826.0
        },
        {
            "text": "claim, and I believe them because of frame rate and all that kind of stuff, that you don't necessarily have that about 4K TV to use HDR technology or to use, I guess, the enhancements, the frame rate and gameplay that they can do with the unit as well. And I appreciate all that kind of stuff. But I was looking at some numbers and so for people out there, these are approximate because I only have them from one source, but they seem to be reliable sources. I found that in looking around that there are approximately a billion televisions in the world, about 980 million TVs. The 4K televisions from what I can find in the first half of 2016 sold about 1.5 million 4K TVs. So assume that they're going to sell another 1.5 million at the end of the year and consider it's a snowball effect, we'll tap another million at the end. So you have 4 million 4K TVs sold in 2016. That's 10% of the PS4 user base right now. Not to mention that most people buying 4K TVs will never touch a PlayStation 4. So",
            "start": 867.34
        },
        {
            "text": "another million at the end. So you have 4 million 4K TVs sold in 2016. That's 10% of the PS4 user base right now. Not to mention that most people buying 4K TVs will never touch a PlayStation 4. So I feel like it's incumbent on them to show why this is important to people with standard 1080 or even 720 TVs. But at the same time, I also feel like could it be an intelligent thing that is forward thinking? I'm sure it is. But I still feel like if they knew what Microsoft was doing, they would have never done this. And I feel like because of the nature of flooding the channel with units and how you have to manufacture these things well ahead of time, you have to design them and order parts and stuff that they could not undo it. They could not put the genie back in the bottle without eating a shit ton of cost, probably an enormous amount of money. The units probably already ordered, they probably already gave money to Foxconn. So they can't go back. So they had to figure out a way to market",
            "start": 901.3
        },
        {
            "text": "ton of cost, probably an enormous amount of money. The units probably already ordered, they probably already gave money to Foxconn. So they can't go back. So they had to figure out a way to market it. And I think when you look back at E3, it might have been there. Like I wonder if they pulled it to the last minute or if it took this long to roll out because they had to figure out a clever way to market it. And I expected more out of them considering how long they had to think about this. There was multiple ways they could have done this more intelligently. And I agree with you either. We were invited to the PlayStation meeting. We decided not to go. I would have been so mad if I had went. I would have been even more mad because that would have been such a huge waste of time. And it's not even like we played a bunch of the games. Like Ryan McCaffrey was there. He got impressions and he got some interviews and good stuff. But it's not like we walked away, oh, what you didn't see was X,",
            "start": 942.78
        },
        {
            "text": "even like we played a bunch of the games. Like Ryan McCaffrey was there. He got impressions and he got some interviews and good stuff. But it's not like we walked away, oh, what you didn't see was X, Y, and Z. And it's so important to have somebody there in person. I think instead we're all just kind of left wondering why. And it is stunning to me that the same company that put on that E3 press conference could three months later put on this because this felt so tone deaf. This felt like it felt honestly more like something you would have seen from Microsoft years ago or from kind of the old school Sony that we saw towards the beginning of the PS3 gen. Like I don't know what this was and who it was for. I think Andrew House and Mark Cerny are brilliant men in their own right. And they have a lot to say. I don't think either one of them should have been on stage for this. I think either a host or even Sean Layden would have been a more compelling way to present this rather than just",
            "start": 981.54
        },
        {
            "text": "a lot to say. I don't think either one of them should have been on stage for this. I think either a host or even Sean Layden would have been a more compelling way to present this rather than just numbers and specs. I don't think that works. And it was actually funny that Apple press conferences, which I always find boring, this came immediately after the Apple conference. And honestly, that was a better show all around. It was long and it was a little bloated and there was a lot of stuff I didn't care about in it. But at least it sold me on the product more than this one did. Yeah, I agree. We'll get to Sony's bad week in a minute or in a few moments. But I agree with you. I think that this was a cart before the horse situation. That because of the 18-wheeler nature of a corporation, you can't just turn that thing. And I think they have to go forward with it. I'll be interested to see the numbers. I will be interested to see if they ever talk about how it's sold or if they don't",
            "start": 1024.22
        },
        {
            "text": "you can't just turn that thing. And I think they have to go forward with it. I'll be interested to see the numbers. I will be interested to see if they ever talk about how it's sold or if they don't piecemeal it from it. It's similar to Vida and PSP where they actually wouldn't separate those numbers after a while. Yeah, exactly. So I wonder if we'll ever get numbers on that. I'm sure that they'll have their own numbers, whether or not they're impressive or not. Or whether or not we'll ever look at them as impressive considering how big this install base remains to be seen to be as well. Yeah, I'm fascinated there wasn't even that one demo that at least we came away talking about. Like, Horizon looked great and I'm glad we saw Mass Effect gameplay and there was a lot of little stuff in there. But there wasn't that one wow moment that I feel like they've had at every conference they've done since February 2013. I feel like there's always been something to focus on. It was a shockingly",
            "start": 1063.38
        },
        {
            "text": "But there wasn't that one wow moment that I feel like they've had at every conference they've done since February 2013. I feel like there's always been something to focus on. It was a shockingly bad conference. Will PS4 Pro turn me around? Yeah, I mean I change my mind on things all the time as we get more information as time goes on. And I'm not opposed to pretty graphics in games running fluidly. That's obviously, I didn't look at days gone and be like, this game is too fucking pretty. I like pretty games too, but I just don't like the emphasis. Let the PC space emphasize graphics if that's what they want. Graphics are important, but they're not the be all end all. I hate to tell you that games stand the test of time not because of their graphics, but because of their gameplay and because of their stickiness. It's why we're about to, as we'll talk about in a little while, we're about to play Bioshock again this year, which is 10 years old and almost and still fantastic. And it's a",
            "start": 1099.66
        },
        {
            "text": "of their stickiness. It's why we're about to, as we'll talk about in a little while, we're about to play Bioshock again this year, which is 10 years old and almost and still fantastic. And it's a pretty game and it's an atmospheric game and it's got a great aesthetic, but that's not necessarily why the game is good. And so I just don't like the emphasis on this. And you know what, I tweeted out about it and I talked a lot about it and a lot of people agree and that really made me, that really heartened me. Some people didn't, but some people absolutely agree. If you're playing games for graphics, I agree with you, you're in the wrong space and you've frankly been in the wrong space for a long time. The bigger piece of news I think in terms of like more immediacy out of it was number two, which is PlayStation 4 Slim. It says, not surprisingly PlayStation 4 Slim is real and will be the new standard PlayStation 4 model moving forward. The console which leaked weeks ago with nary a",
            "start": 1140.22
        },
        {
            "text": "two, which is PlayStation 4 Slim. It says, not surprisingly PlayStation 4 Slim is real and will be the new standard PlayStation 4 model moving forward. The console which leaked weeks ago with nary a comment or acknowledgement from Sony will cost $299.99 and will officially launch on September 15th. The console is smaller than the original PS4 from 2013 and uses less power. The volume of the console has been reduced by 30%, weight by 16% and power consumption by 28%. The last, what is this? Hold on, I think I fucked something up. Is Nadd, was it Nadd? Oh no, that's right. Okay, that's it. I accidentally put things forward, which means there's actually a straight up dozen things on here, which is unusual. A baker's dozen? I guess it doesn't matter, Greg's not here. So what do you make of this Slim? Because I feel like this was the more intuitive, natural thing. This is exactly what happened three years into the PS3's life cycle. So I feel like this made a ton of sense. And the price",
            "start": 1179.86
        },
        {
            "text": "this Slim? Because I feel like this was the more intuitive, natural thing. This is exactly what happened three years into the PS3's life cycle. So I feel like this made a ton of sense. And the price alone makes a ton of sense. The price is perfect. I think $299. It would have been great if it was even cheaper than that. I thought they were gonna go for $249, but that would have been a $100 difference. It doesn't seem like the market's dictating that they do that. There's no need to do that this fall. I think if they really don't have anything up their sleeve next fall, I can see them doing that to counter Scorpio. You can get a 500 gig or 1 terabyte PS4 for $249, $299. But I do think that this is smart. I like Slim models. I like when things get cheaper and that benefits the consumer because obviously the chipset of the PS4 is cheaper now than it was in 2013. So why not drop the price? Why not offer new models? I haven't seen it in person yet. It looks fine. I happen to really, really",
            "start": 1222.5
        },
        {
            "text": "obviously the chipset of the PS4 is cheaper now than it was in 2013. So why not drop the price? Why not offer new models? I haven't seen it in person yet. It looks fine. I happen to really, really like the design of the original PS4. So I don't feel like I needed a redesign of it because it already, and I remember talking about this when it was announced, it already kind of is reminiscent of what you would expect from a Slim. Like having the internal power supply and just being very straight lines. Like the industrial design on the regular PS4 was great. So aesthetically I didn't need this, but I'm happy to see it get cheaper. Yeah. It's smaller, no optical out, which is fine. I know some people are upset about this. I think you have to understand that the heat mapping that Sony no doubt has on the use of that port is probably very low. And while you use it, I bet you have asked people that don't even know it exists. So you can't, they have to remove things to make it cheaper. And I",
            "start": 1260.76
        },
        {
            "text": "has on the use of that port is probably very low. And while you use it, I bet you have asked people that don't even know it exists. So you can't, they have to remove things to make it cheaper. And I think that that's still important to them that they sell it at a profit as well. Now that we have the PS4 Pro and the PS4 Slim things out in the wild, we have some questions. Nico writes in, says, dear Colin and Greg, Greg's not here, sorry. Greetings from bankrupt paradise of Greece. Do you think the PS Pro is made in order to support the upcoming PSVR? I've been reading that the PS4 isn't able to push graphics on par with Oculus and Vive. So I was wondering if the PS Pro might've been necessary evil in order to compete. If so, do you think we'll get an announcement of true PS5 next E3 for release in 2018? Thanks for taking time to read my questions. Me love you a long time, Nico. Ah, the famous expression of Greece. Yes. No, I don't. I feel like I, as far as I understand, you might know",
            "start": 1301.52
        },
        {
            "text": "in 2018? Thanks for taking time to read my questions. Me love you a long time, Nico. Ah, the famous expression of Greece. Yes. No, I don't. I feel like I, as far as I understand, you might know more about this than I do because I haven't really looked into it too deeply. You still have to connect that external box to the Pro. So I don't feel like the Pro has, that would have been actually really interesting if the Pro was like, you actually could buy a special VR unit that's cheaper if you buy the PS4 Pro because we can handle it. But I, but that's as far as I understand, not the case. Yeah. That was my theory forever. I thought it was going to be sort of the, like if you have a Nintendo 3DS, you can Frankenstein it into a new Nintendo 3DS by getting like the boat with extra analog stick and like a separate NFC reader. And you can like buy all these things to piece together what you would just get as one unit. I thought maybe Sony was doing that. I thought maybe you would see them",
            "start": 1336.44
        },
        {
            "text": "and like a separate NFC reader. And you can like buy all these things to piece together what you would just get as one unit. I thought maybe Sony was doing that. I thought maybe you would see them even sell a complimentary like box that you can get as a hundred dollar add on to an existing PS4 or something, which is probably technically impossible. But it doesn't seem to be that. From what I've heard, I haven't seen anyone rather break the news that you can play PSVR without that box on a Pro. I also think they would have said that if that were the case. Yeah. I think that that, you know, to your point earlier, I feel like there are too many things in the wild now. So you have the standard PS4, which is going to be floating around until the channel's cleared of that. The PS4 slim, which comes out the 15th. And bundles too. Like we already have an Uncharted 4 bundle. Yeah. The Uncharted 4 bundle, Canada is getting like an NHL bundle. There's gonna be all sorts of those. Then you have",
            "start": 1373.68
        },
        {
            "text": "comes out the 15th. And bundles too. Like we already have an Uncharted 4 bundle. Yeah. The Uncharted 4 bundle, Canada is getting like an NHL bundle. There's gonna be all sorts of those. Then you have the PSVR unit and you have PS4 Pro coming out in November. These are four things now. Like if they spoke to, and Vita is still out there too. So you have these things that are intimately speaking to each other. You need to communicate that better. And I think that they, I agree with you. I think they would have done that, but I feel like at the same time, that would have been a compelling selling point to me too. It'd have been like the PS4 Pro is more expensive than the PS4, but you can buy the special VR unit that doesn't come with the box. All that kind of stuff is cheaper. And so it kind of helps mitigate the cost and you have a higher functioning PS4, like almost anything they could have done. Would have been more compelling and more interesting to me than what they actually did. And",
            "start": 1412.36
        },
        {
            "text": "helps mitigate the cost and you have a higher functioning PS4, like almost anything they could have done. Would have been more compelling and more interesting to me than what they actually did. And I really do feel like, and this is what I'm saying, there's a self importance, I think we all have it in our own way with like the NeoGaf crowd, for instance, some of the people, and I don't mean just NeoGaf, but like these high, these forums, right? Or these be like these, these enthusiast forums or Reddit or all these places where, where like they're like, they think that their high end experience is what's important to everyone. And it's fucking not. And you know, for all the people that can identify a frame rate to the exact frame or know that something's running in 1080 or 4K, all those kinds of things. There's probably 25 people that play PS4, I have no idea what the fuck you're talking about. And I think that that's the confusing thing to people. So when mom goes into the store and",
            "start": 1443.06
        },
        {
            "text": "of things. There's probably 25 people that play PS4, I have no idea what the fuck you're talking about. And I think that that's the confusing thing to people. So when mom goes into the store and she sees a PS4 Pro and a PS4 Slim and it's talking about 4K, she's like, no way what the fuck you're talking about? All she's looking at at the price point, which is the only thing I think is compelling about PS4 Pro is that it's more expensive nature makes the Slim look cheaper. And it is literally cheaper, but it makes it look like an affordable, like, oh, I understand what this is. I mean, I'm not sure what the price of the TV I have with a normal HDMI cord or composite cables or whatever the hell it is, or component cables, you know, composite cables. And I feel like there's all this unnecessary muddling and confusion, this grayness that exists in the ecosystem now. So would it have been useful to be for PSVR? Yes. But Nico, I don't think that that's the case. Yeah, I think you would have",
            "start": 1475.14
        },
        {
            "text": "muddling and confusion, this grayness that exists in the ecosystem now. So would it have been useful to be for PSVR? Yes. But Nico, I don't think that that's the case. Yeah, I think you would have seen PSVR already all over the box if that were the case. I also, I was actually, probably my biggest surprise in that conference was they didn't push VR more. I mean, they showed Farpoint, which, like, they were talking about how much better Farpoint looks, but no one has a frame of reference for Farpoint because no one has played Farpoint. So that was a really weird game to focus on. But I also just feel like more and more, like, we've played these games on existing PS4 hardware and the games that look good, like Battlefront and Arkham VR and the new Blood Ties Tomb Raider mode, like, the things that have been most compelling to me about VR, I didn't play any of them on PS4 Pro. That was all standard PS4 stuff. So even if there was a big push for, like, oh, it's VR ready, I don't, you",
            "start": 1509.14
        },
        {
            "text": "things that have been most compelling to me about VR, I didn't play any of them on PS4 Pro. That was all standard PS4 stuff. So even if there was a big push for, like, oh, it's VR ready, I don't, you know, I don't think we need it yet until someone makes, like, a 20-hour immersive VR experience that requires extra processing power or something. Yeah. I think the one thing that bothered me, too, and this didn't seem to be a sticking point for some people, but, or many people, but for me it was, was I often predicted, I'm like, how are they going to message this stuff now moving forward at E3? Like, how are you going to make the PS4 owner, the standard PS4 owner not feel left out or, like, a has-been or a piece of shit because you're going to constantly be showing the better versions of the games running on Pro, and lo and behold, at the bottom of every single game they show they have this long thing about, oh, it's the PS4 Pro and it's blah, blah, blah, blah, blah. I'm like, oh, my",
            "start": 1551.3
        },
        {
            "text": "the games running on Pro, and lo and behold, at the bottom of every single game they show they have this long thing about, oh, it's the PS4 Pro and it's blah, blah, blah, blah, blah. I'm like, oh, my God, like, this is already, this is already unnecessary. This is just so unnecessary. I understand that if you look at the picture with Microsoft having done their own thing independently, I don't think the other one hand knows what the other hand is doing. I really don't. They're doing Scorpio because, as people have said before, it's not a unique thought. They lost. They lost. And they need to do something. And I still feel like Scorpio is going to be their new console, and I just think that they haven't necessarily said that yet or they'll ease into that, into that reality of having Scorpio exclusive games, because it seems like it is much more powerful than the Xbox One. So why lock your developers to this lower skew? It's the same thing PC gamers complain about with consoles all the",
            "start": 1584.66
        },
        {
            "text": "exclusive games, because it seems like it is much more powerful than the Xbox One. So why lock your developers to this lower skew? It's the same thing PC gamers complain about with consoles all the time, doing the same thing. I think they're hedging their bets by not calling it Xbox One Scorpio or by not giving the name yet. I think that's exactly what they're doing. They were like, well, let's see where the industry is in a year. And then now if they want to call that the Xbox with no moniker at the end and just start a new platform, or if they want to call it the Xbox Two or whatever the hell you would call it, like, I think they have that path open. Next year is going to be fascinating seeing what is, because the Xbox One S is more on par with the PS4 Pro than it seems like Scorpio is. I feel like those are now sort of the neck and neck machines where Scorpio seems like it's kind of in a class of its own. So that'll be interesting. But I don't know, like I know there are people out",
            "start": 1616.5
        },
        {
            "text": "I feel like those are now sort of the neck and neck machines where Scorpio seems like it's kind of in a class of its own. So that'll be interesting. But I don't know, like I know there are people out there who preordered the Pro and I don't want to just shit all over it. Like I mean, if those people are happy, great, good for you. Like it's your money. Like if you are buying that thing, awesome. And like I know that there are some people who found something compelling enough that they preordered it day one. I, for me, I just don't get it. I legitimately, I feel like it makes me feel uninformed to watch that hour long meeting and walk away being like, why? Like I just wish someone could answer that straight up question. Like what was the purpose? And Sony's been so good with messaging this entire generation, I'm surprised they didn't clarify or follow up because the 4K Blu-ray stuff that rolled out and was really confusing in the hour or two after was such an anti Sony move. That's",
            "start": 1653.34
        },
        {
            "text": "entire generation, I'm surprised they didn't clarify or follow up because the 4K Blu-ray stuff that rolled out and was really confusing in the hour or two after was such an anti Sony move. That's just not how they've been doing things for the last three years. That's more along the lines of what happened after the original Xbox One reveal when like the messaging just wasn't clear and everyone was so confused. So I'm in this weird boat where like I think they could still convince me if they just want to come out and explain like, oh, actually like regular games really will run, like load times will be less and they will look better or like maybe, yeah, like maybe they will lean into VR stuff once VR is launched. But right now I just don't get it. Yeah, I think that I agree with you there. I think that it's, you know, I look at it a different way for you in the sense that you were like, well, it makes you feel uninformed. I'm like, it makes Sony feel out of touch. In the attempt to be",
            "start": 1688.82
        },
        {
            "text": "I think that it's, you know, I look at it a different way for you in the sense that you were like, well, it makes you feel uninformed. I'm like, it makes Sony feel out of touch. In the attempt to be as in touch as possible, I feel like they're out of touch. I feel like, who are you talking to? You know, like the the PS4 hasn't survived and exploded in popularity only due to the sophisticated gamer that, you know, it's just not the case. That sophisticated gamer they're aiming for, there's a few million of them probably that own PS4s. Everyone else, you know, Greg and I had made the case, and I think Greg made it very compellingly that like things like this should be the easiest sell for people like Greg and I because we really love PlayStation. We buy everything. We have PSP Go, we have all this shit, right? We've been huge advocates of Vita, obviously, and both of him and Iroy. What the fuck is this? And that says a lot. And I think that's said a lot to a lot of people because we're",
            "start": 1730.02
        },
        {
            "text": "this shit, right? We've been huge advocates of Vita, obviously, and both of him and Iroy. What the fuck is this? And that says a lot. And I think that's said a lot to a lot of people because we're known as huge Sony fans and huge advocates and some people fanboys. I don't think that's a fair assessment considering what we've been saying. What you've been saying right here. But if that's your assessment, that's obviously your prerogative. I feel like that was a major red flag to me internally where I'm like, this is unbelievable. They didn't have to do almost anything for me to buy this. And instead I walked away being like, yeah, I'll get a slim for my girlfriend. And that's basically it. I'm good for now. And I feel like I agree with you about the point of the 4K TVs that we were talking about before, the ubiquity of them is just not there yet. Maybe this will make a lot more sense and will be looked at foolishly in the coming years and maybe Sony will be very shrewd. Maybe they",
            "start": 1763.38
        },
        {
            "text": "about before, the ubiquity of them is just not there yet. Maybe this will make a lot more sense and will be looked at foolishly in the coming years and maybe Sony will be very shrewd. Maybe they deserve the benefit of the doubt considering how things have been going. I don't know. I feel like this was an interesting time and just not really excited about this at all. And I don't see that. I really honestly don't see that much excitement about this unit from almost anyone. So I'll be interested to see if they're transparent about how it does. But at least everything else this week worked out well for them. Yeah, right. We'll get to that in a minute. I do want to give the other side of the argument. Psi Love You fan reverse flash wrote in the following. It's a little bit of a long message, but I want to read it. It says, watch your PS4 Pro reaction PSI Love You special and I am disappointed by all the negativity for the PS4 Pro being thrown around. There's no debate the conference",
            "start": 1796.7
        },
        {
            "text": "but I want to read it. It says, watch your PS4 Pro reaction PSI Love You special and I am disappointed by all the negativity for the PS4 Pro being thrown around. There's no debate the conference itself was bad and the messaging poorly delivered, but the PS4 Pro itself I feel is a positive machine for Sony to put out. I am a huge Sony PlayStation fan like you guys and buy tons of video games each year so I am all for understanding Colin's argument about gameplay being the most important thing about a game, but I feel you guys are missing the point of it here. Why wouldn't you guys want games to look and run as best as they can? I don't understand why anybody would just be satisfied with games being at a standstill in terms of technical aspects for many years. One major thing I think that was overlooked by Sony at the conference and by you guys that actually does affect gameplay is frame rate. I am an avid gamer and understand a game at 60 frames per second as opposed to 30 makes a big",
            "start": 1838.3
        },
        {
            "text": "overlooked by Sony at the conference and by you guys that actually does affect gameplay is frame rate. I am an avid gamer and understand a game at 60 frames per second as opposed to 30 makes a big difference in the way a game feels. I don't understand how people can't see this and why this was glossed over at the event. PS4 Pro is going to be beneficial to people even without 4K TVs because games like Rise of the Tomb Raider for example are going to have 1080p setting with a high frame rate increase for those without 4K. So to me frame rate is more important than resolution and actually does affect gameplay so my biggest question is why overlook frame rates importance and why would you guys not want to see games looking and running better sooner? I personally don't want to go back to older games as there are too many good new games to play and I can't imagine why anybody would not want to play a game as gorgeous as Horizon Zero Dawn that probably also plays great and be satisfied with",
            "start": 1870.12
        },
        {
            "text": "games as there are too many good new games to play and I can't imagine why anybody would not want to play a game as gorgeous as Horizon Zero Dawn that probably also plays great and be satisfied with something like PSN game like Abzu instead. Yeah Abzu is not a good game but yeah I understand what you're saying. It baffles me and you guys just talked about how the PSN is flooded with garbage so I wouldn't put gorgeous looking games that have a really high chance of playing great like Horizon, Spiderman or Days Gone in that category. So I would argue opposite of Colin that there are plenty of great games in terms of gameplay being made today and that also look and run amazing. Great graphics and frame rate most definitely help enhance the gameplay experience. If you're looking for a new way to play that's what VR is for. There's going to be something out there from Sony hardware wise for everyone this fall and that's great. Thanks Reverse Flash. I appreciate your positivity but I'm",
            "start": 1899.84
        },
        {
            "text": "way to play that's what VR is for. There's going to be something out there from Sony hardware wise for everyone this fall and that's great. Thanks Reverse Flash. I appreciate your positivity but I'm going to go back, Reverse Flash if I may, to what Andrew House said. I'm going to delete your thing here because I don't want to read it twice. He said quote, I saw some data that really influenced me. It suggested that there's a dip mid console lifecycle where the players who want the very best graphical experience will start to migrate to PC because that's obviously where it's to be had. We wanted to keep those people within our ecosystem by giving them the very best and very highest performance quality. So the net result of those thoughts was PlayStation 4 Pro and by and large a graphical approach to game improvement. End quote. He uses the word performance there once but we know what he's talking about. He's talking about aesthetics. Now yes, I do agree with you that frame rate can",
            "start": 1930.4
        },
        {
            "text": "approach to game improvement. End quote. He uses the word performance there once but we know what he's talking about. He's talking about aesthetics. Now yes, I do agree with you that frame rate can improve a game. Not going to deny that. It increases the fluidity of shooters and Twitch games like that specifically. I don't think it's the most important component. I think The Last of Us at 30 frames was totally fine. Some people thought The Last of Us was fucking awkward at 60 frames. And I feel like that's an important component that we have to talk about. I would love Sony to come out and say, wouldn't it made a big difference Andrew if Sony came out and said we have this new powerful unit and to your point and to the point being made, graphics can be improved and that's great. PS4 already puts out these great graphics. But man, the load times in Bloodborne are going to be a lot better now. The frame rate that's stuck at 30 frames or even lower in some games, look we even fixed",
            "start": 1967.08
        },
        {
            "text": "already puts out these great graphics. But man, the load times in Bloodborne are going to be a lot better now. The frame rate that's stuck at 30 frames or even lower in some games, look we even fixed Horizon. Look how good Horizon runs now. All those kinds of things. Instead it was about graphics and graphics and HDR and 4K, blah blah blah blah blah blah. That doesn't affect gameplay. And that was there. So it's incumbent on them to talk about those things if that was the messaging. But that's not what's important to them. That's not what Andrew Houser said in that quote and that's not what they said by and large at the conference. So I think that what you're saying seems right but that's not where Sony seems to be coming from. And what I see is an ecosystem now with both Scorpio coming out and right now with PS4 Pro where now developers have to make two skews of games running on two different units. They're still going to have to scale down everything to fit on the lowest unit. So",
            "start": 2009.74
        },
        {
            "text": "out and right now with PS4 Pro where now developers have to make two skews of games running on two different units. They're still going to have to scale down everything to fit on the lowest unit. So this doesn't really fix any gameplay problems. This doesn't fix anything in terms of scale or scope until they can start making exclusive consoles for those most powerful consoles. So this is really a graphical increase. And it is going to create an ecosystem as I predicted months ago of haves and have nots within the PlayStation 4 ecosystem. This is an unforced error and I really do feel that way. We can talk about it until we're blue in the face but I just feel like I wanted to present the other side of the argument because there is a salient other side of the argument. But I just don't agree with it. If that's what they wanted, they would have said it. I agree. The three quick points from that for me are yeah, if it's about frame rate, say that. Like talk about load times, talk about",
            "start": 2043.02
        },
        {
            "text": "with it. If that's what they wanted, they would have said it. I agree. The three quick points from that for me are yeah, if it's about frame rate, say that. Like talk about load times, talk about existing games running better. Also like the HDR update was probably the coolest thing from that conference for me. If you have a set that supports HDR, you now get that update anyway. So you're getting added clarity from existing PS4 games. And I feel like that's something a lot of people are glossing over. You don't need to spend $400 to get that HDR support which is awesome. But then also the biggest thing for me is they can't have it both ways. And if you want to talk about frame rate and graphics and all these things that are improving, then don't also say every game will still run on existing PS4s. Because truthfully, yes, that's a pro-consumer thing and that's awesome. And all these games I've spent three years buying will still work if I buy a pro. But also if you're trying to sell",
            "start": 2076.98
        },
        {
            "text": "PS4s. Because truthfully, yes, that's a pro-consumer thing and that's awesome. And all these games I've spent three years buying will still work if I buy a pro. But also if you're trying to sell that this machine is the only way to experience them at their best, then maybe there should be some PS4 Pro exclusive games. Maybe there should be something that fully takes advantage of the hardware. So as you're saying, developers don't have to segment and say, oh, it would have been really cool to add this, but we can't because we have to support the lower end system. I think maybe what we'll see are exclusive features. I can see games offering two-player split screen on an existing PS4 and four-player split screen on PS4 Pro. Or things like that are where if that started to be the norm and there were more and more reasons why performance-wise PS4 Pro will be the better place to play, then sure, that to me starts to make a compelling argument for why I'll upgrade. But none of that was",
            "start": 2114.74
        },
        {
            "text": "there were more and more reasons why performance-wise PS4 Pro will be the better place to play, then sure, that to me starts to make a compelling argument for why I'll upgrade. But none of that was present in that conference. Yeah, I agree. So we'll see how it all plays out. But I think this console can do different things and more powerful things than just graphical output, but they didn't make that clear. And that's not my fault. And that's not the consumer's fault, and that's not your fault or my fault or anyone's fault. It's their fault. They did a terrible job messaging it. I think it's because they're in a corner, and I think they realized that if they could have undone this, they probably would have. Because I think that they will have, to the point of an earlier letter I think from Nico about PS5, who knows now what's going to go on. But I still feel like having a $400 or $500 PS5 ready to go in 2018 that completely has exclusive content but also backwards compatible with PS4",
            "start": 2153.02
        },
        {
            "text": "Nico about PS5, who knows now what's going to go on. But I still feel like having a $400 or $500 PS5 ready to go in 2018 that completely has exclusive content but also backwards compatible with PS4 would have been a way smarter move. And maybe we'll still get that. But we'll get that in the future. Some people make the argument that technology isn't advancing in an affordable way to the extent that you would justify a new console. But to that I say, give it time. And if you need more time, then spread it out. They're making PS4 obsolete, and they're doing it themselves. And that's a weird kind of thing. And I'll say, he was talking about Horizon, he was talking about Days Gone. I hate to tell you, man, I played Horizon. I played Horizon extensively on a regular PS4. And it's fucking awesome on a regular PS4. It looks great on a PS4, it runs great on a PS4, it plays great on a PS4. I saw Days Gone behind closed doors extensively. Guess what? On a regular PS4, looks fucking great. Plays",
            "start": 2188.0
        },
        {
            "text": "on a regular PS4. It looks great on a PS4, it runs great on a PS4, it plays great on a PS4. I saw Days Gone behind closed doors extensively. Guess what? On a regular PS4, looks fucking great. Plays great. Looks fucking awesome. This isn't, this isn't, and these games aren't even done. Especially Days Gone. Days Gone, if you, like that would have been the one to me to just not have an E3 and just announce it here with this. Because that's the one where I feel like they could have made it a proof of concept for what you can do with power. And because that thing, like, say what you will about the game itself, like, it is very impressive how many zombies are, not zombies, clickers, no. Walkthrough Runners. I mean, they're zombies. We'll just be zombies. Yeah, I know what you're talking about. They're not, they eat and sleep and shit, so they're not, I forgot their name. Whatever, those things, there are a bunch of them on screen at once and it is really impressive. Like, that's what I",
            "start": 2229.96
        },
        {
            "text": "They're not, they eat and sleep and shit, so they're not, I forgot their name. Whatever, those things, there are a bunch of them on screen at once and it is really impressive. Like, that's what I took away from that BCD was like, oh wow, there are a billion of these things at once. I feel like maybe that's the thing you save for the pro reveal, even though it does look great in a regular PS4. I'm looking. Days Gone is an open world zombie post-apocalyptic action adventure survival horror video game. That's an actual sentence. Played from the third person perspective. The game takes place, Freakers. Freakers, that's it. Freakers. Rolls off the tongue. Yeah, that game looked so good on a regular PS4 and I mean, they showed a second of footage of it at this event, but I didn't, I mean, that's what I wanted, right? I wanted to see something go, oh damn, that looks way better on PS4 Pro. That never happened during that conference, partially because it was at, we were watching on Twitch at,",
            "start": 2273.36
        },
        {
            "text": "what I wanted, right? I wanted to see something go, oh damn, that looks way better on PS4 Pro. That never happened during that conference, partially because it was at, we were watching on Twitch at, you know, not even source quality. I was watching it like medium quality on my laptop. Like, that's the worst way to see a game like that. I mean, it reminds me, Andrew, because we were both there at E3 seeing God of War, Detroit, Days Gone and Horizon all behind closed doors. We went hands on with Horizon and I'll tell you what I didn't fucking say in any of those things was, man, this game is fucking ugly. And I'll tell you what else I didn't say. This game doesn't run right. That's the only point I'm trying to make. You guys can have this conjecture about these games. I've seen them, you know, like they are gorgeous and they look fucking awesome on a PS4. So yeah, can the PS4 Pro do more? Could it increase God of War's frame rate? Sure. Like, do I care? I don't. I just don't. I mean,",
            "start": 2308.56
        },
        {
            "text": "know, like they are gorgeous and they look fucking awesome on a PS4. So yeah, can the PS4 Pro do more? Could it increase God of War's frame rate? Sure. Like, do I care? I don't. I just don't. I mean, that's just where I'm coming from. And I'm telling you, I'm in the majority. I just, I don't know anyone that was looking at God of War, but like, man, this doesn't look fucking impressive. Incredible. Yeah. It's like, come on, guys. Yep. Yep. I'm delayed. Can you believe this? We buried this number three. Yeah. God. Again, word comes by way of our friend Shuei Yoshida, president of Sony's first party studios, who noted on PlayStation blog the following quote, the last guardian development team is fast approaching major milestones in production and have and has made the tough decision to delay the release of the last guardian a few weeks. The last guardian will launch on December 6, 2016. Fumito Ueda, Gen Design and Japan Studio have a wonderful vision for the last guardians touching",
            "start": 2343.16
        },
        {
            "text": "delay the release of the last guardian a few weeks. The last guardian will launch on December 6, 2016. Fumito Ueda, Gen Design and Japan Studio have a wonderful vision for the last guardians touching emotional journey of friendship and trust. And we want to deliver the most polished experience possible for our fans who have supported us for so long. A delay is a difficult decision, particularly with this game, but we have encountered more bugs than anticipated while in the final stages of development to ensure that the last guardian delivers on the experience that the game's creators have envisioned. We need to take the extra time to work on those issues. Our development continues to push itself to the fullest and we look forward to revealing new content toward launch. We appreciate your continued support. End quote. What a joke this game has become. And like, why did they reveal that E3 was that 2015? Like just wait, just wait. They shouldn't have talked about it again until they're",
            "start": 2385.72
        },
        {
            "text": "continued support. End quote. What a joke this game has become. And like, why did they reveal that E3 was that 2015? Like just wait, just wait. They shouldn't have talked about it again until they're ready to say this is the date forever and always. That's it. We saw it. We basically weighed the year and didn't see anything else. Kind of limped out at E3 alongside everything else where everything was so good that it overshadowed the last guardian. And now right before the finish line, we're pushing it again. Like I worry about this game a lot because I feel like it is not the kind of game that benefits from a hype cycle like this one. Like there are games where like the more you anticipate it, like the more it can build it up. But like Shadow of the Colossus wouldn't have been one of those games. I certainly don't think the last guardian looks like it is either. No, I agree. I think that, you know, there's a canary in the coal mine with this story and it's the release date. Now when I",
            "start": 2415.4
        },
        {
            "text": "games. I certainly don't think the last guardian looks like it is either. No, I agree. I think that, you know, there's a canary in the coal mine with this story and it's the release date. Now when I saw that, when I saw the delay, I'm like, oh, they delayed it the next year. They didn't. And the reason that they didn't, I think, was because they fucking can't. They literally can't say like, we said this game drop dead was coming out in 2016, we're releasing in 2016, but here's the fucking kicker. Four days before that, the only other PS4 exclusive of any consequence comes out in Gravity Rush 2 and they're releasing them on top of each other. That is the weirdest fucking thing I've ever seen in my entire life where you're going to say like, we have nothing this fall except for these two, one very minor game and one game that I don't think is very big, which is the last guardian. After Black Friday, after every other console. And they're coming out four days apart. We have no Gran",
            "start": 2452.38
        },
        {
            "text": "one very minor game and one game that I don't think is very big, which is the last guardian. After Black Friday, after every other console. And they're coming out four days apart. We have no Gran Turismo, we have no Horizon. Sony's treatment of this, and I know I'm beating on Sony and that's just the way it's going to have to be this episode. Their treatment of first party or just general second party AAA exclusives in the PlayStation 4 cycle has been fucking unacceptable. And when you really think about it, they've never really hit in the fall with a game of any consequence since the game launched or since the console launched. We had Killzone, which was great and nah, but 2014, nothing. 2015, nothing. 2016, nothing. All those games were pushed. Thank God the order was pushed because that would have been a big Christmas disappointment instead of a February disappointment. But to me it's like, and this goes back to this thing where you guys are concentrating and confusing developers",
            "start": 2492.48
        },
        {
            "text": "would have been a big Christmas disappointment instead of a February disappointment. But to me it's like, and this goes back to this thing where you guys are concentrating and confusing developers and giving them more things to work with. They can barely get the fucking games out. And it's not a disrespectful thing, I don't make games. It's clearly hard and you're giving them more shit to worry about when they can't even deliver? This game's been in development for a decade, a decade. Unacceptable. Just totally anyone who defends this game, man, from a perspective of being like, well, it takes time, but if immediately you wait on all this kind of stuff, I mean, I'm going to blow the fucking air horn right now and tell you like, Shadow of the Colossus, great game, not this game that deserves to be on the pedestal it's on and this game is going to disappoint you. Shocked. Shocked. If this game comes out and everyone's like, that was worth 10 years, you know, who's going to, who's going",
            "start": 2533.8
        },
        {
            "text": "to be on the pedestal it's on and this game is going to disappoint you. Shocked. Shocked. If this game comes out and everyone's like, that was worth 10 years, you know, who's going to, who's going to, I hope that's the case. I hope I'm wrong. I hope it's the best game I've ever played in my life. I don't see it. Especially commercially. I think at this point there's, I like, obviously it's not like I have any insight into what it costs to make this game, but in what world could it possibly recoup its investment at this point? I can't even imagine. I think they put it out and I think you've said this in the past because they have to, because at this point canceling it would look awful. I super worry about it. I mean, the one thing I will say is like, I think if you watch someone play whatever, any puzzle game, Portal 2, you would be like, oh, it's just portals when you see, you know, the early stuff. And then of course by the end there's like the tractor beams and the gels and all the",
            "start": 2568.7
        },
        {
            "text": "any puzzle game, Portal 2, you would be like, oh, it's just portals when you see, you know, the early stuff. And then of course by the end there's like the tractor beams and the gels and all the ways you mix it up. We haven't seen that yet from this game. Like maybe there's a, the entire third act of this game is like really complicated puzzles and really emotional storytelling and whatever. Great. I hope that's there. But for me, like it's never been particularly compelling. And this is something that's like so up my alley, just like the beautiful art style and you're basically hanging out with a dog the whole time and it's a Japanese game. Like this should be like an Andrew Goldfarb game through and through. I've never quite gotten it. I really want to be wrong. I really want to just love the hell out of this game, but I kind of agree with you. I don't see a world where this ends up being a game that lives up to everything. And it's a very different boat than Final Fantasy 15, which",
            "start": 2606.32
        },
        {
            "text": "the hell out of this game, but I kind of agree with you. I don't see a world where this ends up being a game that lives up to everything. And it's a very different boat than Final Fantasy 15, which has obviously been gestating in multiple forms for 10 years. That game I think has a really good chance to do well commercially. Obviously it would have been better in September than November, but I still think it might do really well. And then also I think from what we've seen of it, that at least feels like it's delivering on the promise of what it originally was. I feel like this game, Last Guardian, might even be five hours long, four hours long. Like I don't even know what we're getting with it. Let's assume it's five hours long. That's a half an hour per year of development of gameplay. Just totally wildly ridiculous. It was 2011 when Clemence saw it. And I feel like the story of this game, the wild and radical mismanagement clearly of this game at some level that needs to be told. I",
            "start": 2641.8
        },
        {
            "text": "totally wildly ridiculous. It was 2011 when Clemence saw it. And I feel like the story of this game, the wild and radical mismanagement clearly of this game at some level that needs to be told. I feel like Sony shit the bed in some way so badly on this game, whether it's a fucking great game or not, is irrelevant to this particular point. They need to come out and say, what the fuck happened? What happened? You know, like, okay, the PS3 couldn't run the game. Somehow the PS3 ran The Last of Us and the entire Uncharted trilogy, but it couldn't run The Last Guardian, which was apparently this amazing vision. Okay, fine. And then it delayed and delayed and like, what happened? You don't owe us anything. Sony doesn't owe us a goddamn thing. But I think they do owe their fans in some respect, hey guys, like we really did shit the bed and here's X, Y, and Z of why this happened. And they just won't do it. And it's similar to Sony Santa Monica with the game. We know it was canceled. We know",
            "start": 2679.34
        },
        {
            "text": "hey guys, like we really did shit the bed and here's X, Y, and Z of why this happened. And they just won't do it. And it's similar to Sony Santa Monica with the game. We know it was canceled. We know it was canceled well into the development and they just don't talk about it. They pretend it doesn't exist. And I'm like, well, we're interested in what happened. Don't you, did you learn from it? Did you, what did you take away from this experience? And in a gaming era, which I think the PS4 and Xbox One are emblematic of just delays, rehashes remastered delays, same game over and over and over again. And like, we need better graphics apparently. That's what we need. All they need to do is wait. Like Last Guardian, like honestly, I'm the biggest proponent of delays when it makes the game better. And there will always be that Shigeru Miyamoto quote that is obviously like, take the time you need because if you put out a crappy game, it's crappy forever. If you wait, it'll be better. Like I",
            "start": 2728.66
        },
        {
            "text": "And there will always be that Shigeru Miyamoto quote that is obviously like, take the time you need because if you put out a crappy game, it's crappy forever. If you wait, it'll be better. Like I totally buy that. But then just don't announce a release date till you're positive. Like that's my big thing with Last Guardian is more just why, like I get that everyone's been asking and asking and asking, but just wait, it's fine. Everyone will be fine. Like we would rather just get the game and have it come out. I think that fallout style of here's what it is out in six months is always preferred. And obviously with something like a new IP, you need the time. You need the marketing cycle, but it's just communication. I think at this point, if they did come out like that Shuhei blog post. Yeah, I get it. And like it was well said and it's concise and whatever. I almost would prefer to 3000 word long. Hey, like we've been really running in trouble with this game and here's what's going on.",
            "start": 2771.18
        },
        {
            "text": "I get it. And like it was well said and it's concise and whatever. I almost would prefer to 3000 word long. Hey, like we've been really running in trouble with this game and here's what's going on. It's a lot of what I've been saying about No Man's Sky. Like they, as of the time recording this, they have been silent for almost a month now about that game when all they really need to come out and say was, hey, we're a small team. We wanted to put this stuff in. It's been really hard getting this game out to you. Here's our rollout plan for the next six, 12 months of how we're going to add things in. I think that would have been a really easy way to communicate it. Last Guardians is similar boat where if they just said, hey, like our team started as 100 people and then went down to 20 and then five and now we've just ramped up and it's it was hard learning the new hardware and blah, blah, blah, blah. If they at least said it, I think it would be fine and I'd be a lot more patient with",
            "start": 2806.68
        },
        {
            "text": "then five and now we've just ramped up and it's it was hard learning the new hardware and blah, blah, blah, blah. If they at least said it, I think it would be fine and I'd be a lot more patient with it. But at this point, just don't say anything till you're positive. Yeah, I think that everyone needs to learn. But that's the example is perfect. And what Rockstar I anticipate is going to do with Red Dead at some point too. I feel like the yeah, give people less time. Like I really do think this we'll see how the game turns out. The smartest we might have been in the cancel this game five years ago. Now this brings us to the topic of the show in the middle of Roper's report. Thank you. Bart from Toronto says the following. He says, hey guys, a string of Sony decisions have either have been either divisive or just unpopular with the gaming community. First they announced that PS Plus prices are increasing in North America and then the network is down multiple times since then. I think",
            "start": 2842.52
        },
        {
            "text": "either divisive or just unpopular with the gaming community. First they announced that PS Plus prices are increasing in North America and then the network is down multiple times since then. I think it's very safe to say that Xbox Live is a much better service. So it does not. So it does not consumers much confidence. I don't know what that means. The PSN will improve in terms of the network and the free games. And it's worth an aside here. This is me speaking now. Not Bart that Xbox Live was considered by some sort of study that more reliable network over PSN. He then continues. Second is the PlayStation meeting. Pretty much that needed to be said about it was said on last week's show. No 4K Blu-ray support. What? And now Sony has blocked Bethesda's mod support for Fallout and Skyrim. We're going to get to that in a minute. Some say that Sony is also making a mistake of not allowing games like Rocket League to feature cross-platform play with Xbox. But I can understand Sony's",
            "start": 2878.04
        },
        {
            "text": "We're going to get to that in a minute. Some say that Sony is also making a mistake of not allowing games like Rocket League to feature cross-platform play with Xbox. But I can understand Sony's reasoning for not allowing it. So Sony has had a pretty rough few weeks now and even though everything will be fine, is this starting to show shades of early PS3 Sony? Are they being too cocky? It seems to some that they are changing their attitude and making more unpopular moves. I understand business is business but I'm scared this may be a slippery slope for Sony. Best regards, Bart from Toronto. What do you think of that? Because I do think that they're, I don't know if they would intentionally go back to those days because they were dark days indeed. But do you see shades of early, of let's say 2005, 2006, 2007 Sony here? Yeah, absolutely. I mean it comes across, I don't think it's quite that same, like that was arrogance straight up. I think at that point they were, they were",
            "start": 2913.08
        },
        {
            "text": "of let's say 2005, 2006, 2007 Sony here? Yeah, absolutely. I mean it comes across, I don't think it's quite that same, like that was arrogance straight up. I think at that point they were, they were overconfident. They, you know, the get a second job, all of that stuff was just coming from a place of we're on top and we'll always be on top. I don't think that's quite what's happening here, but yeah, it's a slippery slope to becoming that. And I think like they've seen unprecedented success this generation. Like the PS4, like say what you will about last week, but from, you know, the February 2013 reveal event up until I guess now this PlayStation meeting, I think they have made almost no wrong moves. It feels like everything was going really, really well. I think now we're starting to see a couple of questionable decisions. I mean like people have left the company, I would assume unrelated. I think there's a lot of people being like, oh, this is why Adam Boyce left. When it's like, I",
            "start": 2942.18
        },
        {
            "text": "a couple of questionable decisions. I mean like people have left the company, I would assume unrelated. I think there's a lot of people being like, oh, this is why Adam Boyce left. When it's like, I don't think it's fair to make that one to one. We don't know. For sure. Yeah, not at all. It's concerning. I mean, if like I'm super invested in the Sony ecosystem. I play my Vita every day. I do prefer PS4 to Xbox One as far as third party games when possible. That's not to say, I think Xbox One is actually super, like it's a great system. I, in a lot of ways even prefer the UI. I think Xbox Live has a lot going for it, but like Sony is just where I naturally go to. But that said, this is an important time for people to pay attention to what they're doing because what I'm seeing in, I put up a thing on IGN. I talked to Albert Piniello the day of the PlayStation meeting and Microsoft said all the right things and who knows if it'll pay off with Scorpio, but like they are, they seem to be",
            "start": 2983.86
        },
        {
            "text": "a thing on IGN. I talked to Albert Piniello the day of the PlayStation meeting and Microsoft said all the right things and who knows if it'll pay off with Scorpio, but like they are, they seem to be paying attention. They're bullish. They know what they want. They're trying to appeal to the gamer again. Whereas Sony seems to be swinging in this weird opposite direction where everything they're saying is that they're appealing to the hardcore gamer, but what they're actually doing seems to be trying to appeal more to the mainstream. It's like they're trying to get some piece of the 4K pie with this or they're trying to go like get in on VR early in case that becomes the next big thing. All that stuff is smart in terms of future proofing, but awful in terms of messaging. I think that there's, I think that I have the perception that there's something attempted synergistically with this with like Blu-ray, 4K, PlayStation is making Sony a lot of money. Let's try to get some of this shit",
            "start": 3024.86
        },
        {
            "text": "I think that I have the perception that there's something attempted synergistically with this with like Blu-ray, 4K, PlayStation is making Sony a lot of money. Let's try to get some of this shit going with other people. I think that that's part of why I think VR is going to be so successful for Sony in the future in 10 or 20 years is not outside of PlayStation where they're going to start connecting it on TVs and all that kind of stuff. I think that that will make more sense. So I think there's some sort of like false level of synergy. I hate that fucking word, but where they're like trying to extract value out of PlayStation to add to other things that, you know, so it's like, oh, well, why not buy a Sony 4K TV or why not, you know, whatever. So I think there's something to be said about that. I agree with you that I don't think they would intentionally ever go back to that space. And I don't think that that arrogance is there or that we're on top of the world. We destroyed our",
            "start": 3061.42
        },
        {
            "text": "about that. I agree with you that I don't think they would intentionally ever go back to that space. And I don't think that that arrogance is there or that we're on top of the world. We destroyed our competitors is there because they didn't destroy their competitors with PS3. They basically were neck and neck with Xbox 360. Now, they did in a year or less time and they certainly came back strong towards the end and really took over. And really on the back, I think of exclusivity with their first party studios, which I think are unparalleled. But I do feel like Sony, the Sony with its back against the wall was a fun Sony to watch because they had a fight for everything they got and they won the battle considering the position that they put themselves in. And so when they're on top, I feel like things change. And I would love for their mentality internally to be like, we're losing. The numbers don't matter. We're losing. Let's keep the mentality that we're losing just like we were in",
            "start": 3096.94
        },
        {
            "text": "like things change. And I would love for their mentality internally to be like, we're losing. The numbers don't matter. We're losing. Let's keep the mentality that we're losing just like we were in 2007, 2008. We were getting our asses kicked and just keep making the right moves. And I feel like because of the attempt to see again the notion of we anticipate the problem on the horizon that's not there yet as opposed to seeing the problem on the horizon and then dealing with it, I think is a huge error in judgment on their part. And I hope it doesn't blow up in their face. People have asked, is there any way Xbox catches up to PS4? No. Xbox One is so in the dust right now. But that doesn't mean Xbox One hasn't sold respectively. Those combining PS4 and Xbox One sales puts it at a healthy 50 percent almost. I think somewhere around there, maybe even higher, point than the PS3 and Xbox 360 were in their points in time on sale in 2000, I guess it would be what, three years later. So 2007",
            "start": 3133.86
        },
        {
            "text": "percent almost. I think somewhere around there, maybe even higher, point than the PS3 and Xbox 360 were in their points in time on sale in 2000, I guess it would be what, three years later. So 2007 and 2008 between Xbox 360 and PS3. So they're doing well combined. Xbox One is doing very well. But no, I don't think this is going to cause them any problems. It's just going to cause them unnecessary headaches, marketing headaches, questions I have to answer. And for what? So we can get a prettier horizon? If horizon wasn't pretty enough, I'm going to make that point again. I wasn't in those rooms at E3, but behind closed doors with a few people and the developers. And I didn't hear the developers ever complaining. They didn't have enough power to deal with. I didn't hear them saying they wish that this rendered in 4K. I don't remember them saying that. Yeah, I feel like I think you're right in that they're solving a problem. If it isn't broken, don't fix it. I don't know who has been",
            "start": 3167.54
        },
        {
            "text": "wish that this rendered in 4K. I don't remember them saying that. Yeah, I feel like I think you're right in that they're solving a problem. If it isn't broken, don't fix it. I don't know who has been asking for this. But all of that said, I don't think it's this doomsday thing. I think Sony messaged this badly. They had a rough week. We'll talk about the Bethesda thing and Last Guardian, obviously a couple other things. But no, I don't think this is anywhere near as dire as what was happening at the beginning of the PS3 era for Sony. And I especially don't think it's going to hurt PS4 sales. I think honestly, we can complain about this until we pass out. But ultimately, I think PS4 is going to sell fine this holiday. I think you're going to see third party games selling better on PS4 this holiday. And I don't think PS4 Pro is even remotely a factor in that one way or the other. I would imagine it's not going to light the world on fire. But I think plenty of people will buy a $299 PS4",
            "start": 3206.74
        },
        {
            "text": "holiday. And I don't think PS4 Pro is even remotely a factor in that one way or the other. I would imagine it's not going to light the world on fire. But I think plenty of people will buy a $299 PS4 Slim along with whatever Call of Duty or Battlefield or whatever they're going to buy this holiday. I think it'll do just fine. So I don't think there's any reason for people to panic. I think that it begins to sow the seeds of a much longer term problem for them, which is that for the next year, they keep down this track and Scorpio comes out and Microsoft is doing everything right and they price it well, then maybe next generation you see another seismic shift of people being like, oh, Microsoft is easier to work with or whatever that is. I think maybe you can extrapolate that could come years down the road. But I mean, all of that's so premature. I think the only thing that works out advantageously right now, definitively towards Sony, or at least even the playing field with what I feel",
            "start": 3245.62
        },
        {
            "text": "down the road. But I mean, all of that's so premature. I think the only thing that works out advantageously right now, definitively towards Sony, or at least even the playing field with what I feel is a series one force errors, is that perhaps people are going to be a little lukewarm on buying an Xbox One, even with the Xbox One S, which I think is a fantastic console because of the promise of Scorpio. So are you going to hold off now? Now the evidence for the last two MPD cycles says no. We already know. We haven't had full MPD reports for August, but we already know that Xbox One again outsold PS4. And as far as I understand, those are the only, I don't remember ever being back to back months where Xbox One has sold PS4. I think this is the first time. So not good. Yep. You know, in terms of optics, are they going to reverse course? Maybe if they don't because Gears of War comes out, which is going to be huge and I can't wait to play Gears of War and other things. And there's just a",
            "start": 3285.62
        },
        {
            "text": "of optics, are they going to reverse course? Maybe if they don't because Gears of War comes out, which is going to be huge and I can't wait to play Gears of War and other things. And there's just a dearth of Sony exclusives this fall. If they go three, four months. Yeah, I don't know, man. Then I'm like. I mean, that's a good point. And that's what it takes, right? That was even when, I mean, if you look at last generation, it's a really interesting study in how that lead can kind of change because PS3 did have a couple of months where it was on top all in a row. And I think that began a positive streak of momentum for them. Yeah, it broke up something like two years worth of Xbox 360 dominance. Yeah. And I mean, like maybe we're seeing the beginning of that. I think Call of Duty is the wild card because Call of Duty is trying something very new this year. I think it's a bigger break year for Infinity Ward specifically because they were always the A team for so long. And then I think",
            "start": 3324.78
        },
        {
            "text": "card because Call of Duty is trying something very new this year. I think it's a bigger break year for Infinity Ward specifically because they were always the A team for so long. And then I think after Ghost and after how much success all three black ops have seen, maybe they're not anymore. Maybe Treyarch is kind of seen as the A team. So I think this is a big year for Infinity Ward, but also for Call of Duty as a whole, because this is the first year that Battlefield versus Call of Duty is such a dramatic change. Like they are nothing alike at all. And I think Battlefield leaning into Xbox harder and Call of Duty leaning into PlayStation harder is for the first time in probably three, four or five years actually really interesting and may make a difference. I mean, ultimately my gut tells me Battlefield will sell better on PS4 than it does on Xbox anyway, but who knows? We'll see. We're going to find out. But yeah, I think this fall will be really interesting both because I'm just,",
            "start": 3363.56
        },
        {
            "text": "me Battlefield will sell better on PS4 than it does on Xbox anyway, but who knows? We'll see. We're going to find out. But yeah, I think this fall will be really interesting both because I'm just, as a nerd about industry stuff, I'm so excited to see how VR does in more of a mainstream setting. I think Vive is incredible, but Vive was never going to be a runaway consumer hit and Oculus is kind of in a similar boat. But PSVR really could legitimize VR. Like if even 10% of the install base of PS4 buys a PSVR this fall, that is a huge deal. And that says a lot for the investments people are putting into VR. But aside from that, I think it's sort of anybody's race as far as console sales. Yeah. I mean, I'd say even if 10% of the consumer base right now bought PSVR in the first year, that would be 4 million. That would be exceptional success for Sony. So we'll see. I still say PSVR is going to be a success. I think it's going to take time and I think it's got to be relative. Real quick,",
            "start": 3401.38
        },
        {
            "text": "be 4 million. That would be exceptional success for Sony. So we'll see. I still say PSVR is going to be a success. I think it's going to take time and I think it's got to be relative. Real quick, this is an aside. I want to ask you this now since we're talking about Battlefield and Call of Duty. What do you make of Titanfall? Because I feel like Titanfall is being sent out to die and I don't know if this is necessarily true because I know in listening to Blake Jorgensen and those guys at EA that they're actually a little bit bullish on Titanfall. And I think that that's foolish, but I don't know what I'm missing. It's coming out two weeks after another EA published game that's going to be way bigger than it and a Call of Duty game. And then they're throwing it out there. And the only argument that can be made, I feel like, is they're trying to do as much to distract from Call of Duty as possible. But do you think that this game is going to flop? Because I don't know that that's",
            "start": 3445.82
        },
        {
            "text": "argument that can be made, I feel like, is they're trying to do as much to distract from Call of Duty as possible. But do you think that this game is going to flop? Because I don't know that that's actually going to flop, but I feel like 9 million, I think, was their projection for it. And I think that that seems to be extraordinarily confident and maybe even foolishly confident. The funny thing to me is in a vacuum, Titanfall 2 looks awesome. I think they looked at what people didn't like about Titanfall 1, which was obviously a lack of campaign. And then it kind of backed their own horse. It was Xbox One exclusive at a time when PS4 was majorly gaining momentum and the tides were kind of churning. And I think now being multi-platform and having a bespoke campaign is really smart. And I think that, again, in a vacuum against nothing, I can see doing incredibly well. But I think your point is the important one, which is that why would you put it so close to Battlefield 1, which has",
            "start": 3483.36
        },
        {
            "text": "I think that, again, in a vacuum against nothing, I can see doing incredibly well. But I think your point is the important one, which is that why would you put it so close to Battlefield 1, which has the bigger marketing push and the better name recognition? And especially why would you put it so close to Call of Duty? I think that Titanfall feels like a game that would have benefited from either an August release date, like up against Deus Ex and things like that, or even December or in the spring or any number of other windows where it could have kind of stood its own. I don't know why they're so confident in it. And maybe it's getting incredible locker views and internally it's testing really well and that will carry it. But I think just Battlefield and Call of Duty are such monsters that I can't see it standing its own. And 9 million feels unbelievably confident to me. Yeah, it seems like a move that would be made should either Battlefield or Titanfall not being published by the",
            "start": 3522.54
        },
        {
            "text": "that I can't see it standing its own. And 9 million feels unbelievably confident to me. Yeah, it seems like a move that would be made should either Battlefield or Titanfall not being published by the same publisher. That's the weird thing to me is that if Ubisoft put out Titanfall, then I'd be like, all right, well, that makes sense. They want a piece of the pie. But I keep making the argument of numbers, which is that there's only so much attention that can be paid to these immersive experiences that require, like the Division, that require you to stay on board for a really long period of time. And are you really going to capture people, a plurality of gamers that are looking for that experience with Titanfall when Call of Duty and Battlefield are out as well? It seems like one of those things where with Respawn's relationship, their second party relationship with EA so intimate and with them working on a Star Wars game, it would have been smarter for them to be like, you know what,",
            "start": 3559.88
        },
        {
            "text": "things where with Respawn's relationship, their second party relationship with EA so intimate and with them working on a Star Wars game, it would have been smarter for them to be like, you know what, polish the game, take your time, we'll put it in the can, we'll release it in March, work on your DLC, we'll get a day one patch out that makes the game beautiful. In the meantime, I go fuck off and do something else. And they have the money and the means to do that. And so I don't understand why the game needs to be rushed out, especially considering the fact that the response to the beta seemed extremely poor. And I know that they're going to fix a lot of those things, I'm sure, I hope so. And it seems like for running through that laundry list of things and saying, hey, we're going to fix this. Exactly what needs to be done. What you were saying with Hello Games or with other guys that are doing similar things. So we'll see how that all plays out. But I'm utterly baffled by it. I want",
            "start": 3598.3
        },
        {
            "text": "this. Exactly what needs to be done. What you were saying with Hello Games or with other guys that are doing similar things. So we'll see how that all plays out. But I'm utterly baffled by it. I want to see, because I trust your instincts with this. I'm glad you're baffled too, because this one, this one makes no sense. When I look at those release dates, I'm like, this doesn't make, this doesn't pass a smell test. This doesn't, both of these games have been in development for years and released in three weeks apart. Yeah. It seems so weird to me, especially given that like Titanfall is fun, honestly. Like what we've played with it is really, really cool. And I actually really liked the original Titanfall as like the way I play Call of Duty and Battlefield every year is specifically to play the campaign. So it's like Titanfall not having a campaign in the first place was a huge turn off for me. I kind of like the sort of buddy robot thing they're doing here. I think it could be a",
            "start": 3628.92
        },
        {
            "text": "play the campaign. So it's like Titanfall not having a campaign in the first place was a huge turn off for me. I kind of like the sort of buddy robot thing they're doing here. I think it could be a really good game. But yeah, I don't know in what world they think Titanfall can do well without Battlefield flopping and vice versa. Like I feel like they have to take market share away from each other, especially with Call of Duty as the real spoiler. Yeah. I'm glad we're on the same page with that because that doesn't make any sense to me. And I don't feel like a lot of people are talking about it. Yeah. We're going to be talking about it when we see MPDs that month. I think people are forgetting about Titanfall, honestly, which is not, does not bode well for EA either. I think most people are talking about Battlefield versus Call of Duty and not considering Titanfall. And like maybe Titanfall comes in and blows both of them out of the water, but that feels like the real dark horse in",
            "start": 3659.4
        },
        {
            "text": "are talking about Battlefield versus Call of Duty and not considering Titanfall. And like maybe Titanfall comes in and blows both of them out of the water, but that feels like the real dark horse in that race. It could critically, I wouldn't be necessarily surprised maybe with Battlefield, that'd be a little bit surprised because I think Battlefield is going to be awesome, but I think Call of Duty is going to be good too. But, but I don't know that it matters. That's the other thing is I just don't know that it matters. Yep. Yeah. So I think that, I think that the, the, the, the first instinct of seeing Titanfall too is that the democratization of the platforms finally getting it away from Xbox 360, but still on Xbox one and then on PC and on PS4 makes it seem like there's going to be more users and there probably will be per capita, but not to the extent, I just don't understand where they're getting that guidance from with those numbers. And yeah, maybe mock reviewing is doing",
            "start": 3694.3
        },
        {
            "text": "more users and there probably will be per capita, but not to the extent, I just don't understand where they're getting that guidance from with those numbers. And yeah, maybe mock reviewing is doing really well for that, but that's not going to sell those units in a very busy time when people are looking forward to these two games. I'm looking forward to playing the campaign frankly for all three of those games. So number four, alongside the reveal of PS4 slim and the PS4 pro Sony has also revealed a slate of new peripherals, the slightly modified DualShock 4 that will come with slim, which allows the light bar to be seen through a sliver on the touch pad is one such peripheral. A new PlayStation camera is another. I stand for the new PS4s that will work with both the slim and the pro is the third and finally a new platinum wireless headset. The first three will be available on September 15th. So that's the day the slim comes out and the headset will be available later this year. So if",
            "start": 3724.9
        },
        {
            "text": "third and finally a new platinum wireless headset. The first three will be available on September 15th. So that's the day the slim comes out and the headset will be available later this year. So if you're looking forward to any of those things, just know that they exist. So for instance, if you need a camera for your VR unit, maybe you'll get the new one. The stand, like I hate stuff like a $25 stand to make the thing stand vertically, but whatever. That might have been nice to put in the box, but yeah. Number five. That thing looks like it costs $2 to make. It's a very, it's got X's nose and it's a Vita memory card issue. Got to extract that money. Number five, PlayStation 4's newest major firmware, firmware 4.8 codename, Shin Gen, is set for launch and should be available by the time you listen to or watch this podcast. Some of Shin Gen's upgrades have to do with PlayStation 4 Pro and HDR, the latter of which will be available to standard PS4 users as well, but much else has also",
            "start": 3757.54
        },
        {
            "text": "you listen to or watch this podcast. Some of Shin Gen's upgrades have to do with PlayStation 4 Pro and HDR, the latter of which will be available to standard PS4 users as well, but much else has also been altered specifically on the what's new screen, the content info screen, the music quick menu, the share menu, library organization, trophies and more. PlayStation blog is a full rundown on what's new if you'd like to have an exhaustive list. So we'll get 4.0 downloading by the time you hear this. Yeah. The most exciting thing on there that was very smart is the system transfer stuff. The LAN system transfer sounds very easy, fast and nice. Like that just, good for pro users for sure for pro or I guess for slim for some reason, if you're switching over. Yeah, I think just having that be easy is awesome. Number six, Bethesda will not be bringing mods to Fallout 4's Skyrim special edition as originally promised and it seems to somehow be Sony's fault and a rather curt statement written",
            "start": 3798.66
        },
        {
            "text": "is awesome. Number six, Bethesda will not be bringing mods to Fallout 4's Skyrim special edition as originally promised and it seems to somehow be Sony's fault and a rather curt statement written on Bethesda's official website. The publisher said, quote, after months of discussion with Sony, we regret to say that while we have long been ready to offer mod support on PlayStation 4, Sony has informed us they will not approve user mods the way they should work, where users can do anything they want for either Fallout 4 or Skyrim special edition. Like you, we are disappointed by Sony's decision given the considerable time and effort we have put into this project and the amount of time our fans have waited for mod support to arrive. We consider this an important initiative and we hope to find other ways user mods can be available for our PlayStation audience. However, until Sony will allow us to offer proper mod support for PS4, that content for Fallout 4 and Skyrim on PlayStation 4 will",
            "start": 3832.86
        },
        {
            "text": "other ways user mods can be available for our PlayStation audience. However, until Sony will allow us to offer proper mod support for PS4, that content for Fallout 4 and Skyrim on PlayStation 4 will not be available. We will provide an update if and when this situation changes. And quote, we brought this up briefly before, but what do you make of this? I have never seen a third party so bluntly give the middle finger to a first party. Like it is, I don't even know if I can overstate how rarely that happens. And especially like this isn't like a flowery statement where they bury it in the middle. Like this is straight up forcing Sony's hand. This, this blog post was meant to make Sony look bad. This blog post was meant to put the blame on them. And probably because Bethesda is frankly sick of having fans ask where mods are when it's apparently at least to their side, the story, not their fault. And investing capital and making it work and it probably does work fine. And there's some,",
            "start": 3865.6
        },
        {
            "text": "of having fans ask where mods are when it's apparently at least to their side, the story, not their fault. And investing capital and making it work and it probably does work fine. And there's some, my assumption is that there's some sort of, it's not necessarily quality control, but my assumption is content that is inappropriate or somehow beyond the, beyond the realm of what Sony wants in their console, which is fine, but they should just come out and say it. Yep. Yeah. And again, Sony not responding in any way is amazing to me because on the same day, I don't know if you have it in here, but on the same day there was the rumor about them charging for HDR patches in games. And then Sony immediately was like, oh no, no, no, that's not true. Like that statement was out like hours later, whereas they haven't responded that I've seen yet to the Bethesda situation at all, which is really surprising to me because you would think they would have some kind of like, hey, like consumers, this",
            "start": 3906.0
        },
        {
            "text": "they haven't responded that I've seen yet to the Bethesda situation at all, which is really surprising to me because you would think they would have some kind of like, hey, like consumers, this is for you. We're trying to protect you and keep the PS4 experience better by not having mods and blah, blah, blah. Like I can see them trying some kind of counter to this argument, but man did this make Sony look bad in my opinion. My assumption why that didn't happen is twofold. Either that they simply don't have a good answer because it's, it has to do with control or they're still working on a solution. But if I was Bethesda, I'd be mad too because certainly they've had people working on this for months and can't find a satisfactory solution. And to your point, I think eventually you're like, fuck this. Yeah. But then it could also swing and stick around. I don't think it's going to affect them at all. So yeah, it's just, I honestly like, like a lot of these situations, it sucks for the",
            "start": 3937.74
        },
        {
            "text": "fuck this. Yeah. But then it could also swing and stick around. I don't think it's going to affect them at all. So yeah, it's just, I honestly like, like a lot of these situations, it sucks for the fans. It sucks that these mods have been, it's been, it was like before E3 you had mods in the Xbox version. So I mean, it's been probably four or five months of Xbox users and obviously PC users being able to have mods when you don't on PS4. And just guessing, I would assume it sold better on PS4 than it did in Xbox One to begin with. So that just like, it's a bummer to not have a feature available. Yeah. So you'll be able to play that on Xbox One and PC obviously still if you want with all those games. I don't know that it matters so much with Fallout 4 anymore because I feel like that ship is coming up and I feel with Skyrim it's going to be a bigger deal. Number seven, Bloodstained Ritual of the Night, the spiritual successor to the Metroidvania style Castlevania games from Konami,",
            "start": 3973.42
        },
        {
            "text": "is coming up and I feel with Skyrim it's going to be a bigger deal. Number seven, Bloodstained Ritual of the Night, the spiritual successor to the Metroidvania style Castlevania games from Konami, namely Symphony of the Night, has been delayed. Originally slated to come out in 2017, the game will now launch in 2018. Word comes by way of creator Koji Igarashi, who posted a video in the written word on the game's Kickstarter page apologizing for the delay and explaining why it's happening. Here's what he said, quote, the last thing I want to do is keep our backers waiting, but after receiving such incredible support, I feel responsible for delivering the best product I possibly can. Again, I offer my sincerest apologies. All of us on the campaign and development sides of the team are looking forward to playing the finished game as soon as we can, but as Iga says, we also want the game to be, quote, done right the first time. We'll continue to keep you updated on the development process",
            "start": 4009.76
        },
        {
            "text": "forward to playing the finished game as soon as we can, but as Iga says, we also want the game to be, quote, done right the first time. We'll continue to keep you updated on the development process every step of the way. And then it parenthetically says, in fact, the next regularly scheduled update featuring some songs and commentary from Michiru Yamane is just about ready to go. And as Iga mentioned, you can expect more news about the development process as soon as it is available. Thanks again for all you've done to make such an exciting project possible, end quote. So just be clear, this quote is a mix of Iga and his translator, his handlers. I want to throw out there that for transparency's sake that I helped reveal Bloodstained to the world by hosting the Igarashi panel. I know Iga personally and consider myself friendly with those guys. So and with any creates, I want people to take anything I say about Bloodstained with a grain of salt if you like. I'm going to be honest with",
            "start": 4039.56
        },
        {
            "text": "personally and consider myself friendly with those guys. So and with any creates, I want people to take anything I say about Bloodstained with a grain of salt if you like. I'm going to be honest with you and tell you that the game looks awesome, plays awesome. But I just want that out there so that people know and they can make their own decisions. This doesn't seem to be a huge deal. The thing I read into this and this has been the conjecture that's going on with this is that he specifically says in the video that he's brought on new developers. And like to the team, is any creates fucking this game up? Because like they fucked up Mighty No. 9 in some way. So I'm wondering if there's like some concern with the response to Mighty No. 9. And Deep Silver is still publishing. So I would imagine they're concerned with their response to Mighty No. 9 as well. Yeah, I feel like I feel like there's more to this than we're ever going to probably find out. But this is one of those examples",
            "start": 4075.32
        },
        {
            "text": "imagine they're concerned with their response to Mighty No. 9 as well. Yeah, I feel like I feel like there's more to this than we're ever going to probably find out. But this is one of those examples where Bloodstained from what I played from the E3 demo, which they sent me and we did a Let's Play on YouTube.com slash Kind of Funny Games if you want to check it out. The game is a little empty right now, but it's fun. It feels good. They're on the right track. Take your time. This is the game we need. It's very reminds me a lot of Final Fantasy Tactics or one of those games where I'm like we need a game like this and it needs to be done right. So take your fucking time. I don't. 2018 fine. It'll fly by. If it sucks in 2018 like Mighty No. 9 ended up sucking so bad, then that's a different story. But yeah, I mean, it's. First of all, it's weird having a release date this far out, not a release date, but a window this far out because I think it's the only confirmed 2018. Like, yeah, I",
            "start": 4112.1
        },
        {
            "text": "story. But yeah, I mean, it's. First of all, it's weird having a release date this far out, not a release date, but a window this far out because I think it's the only confirmed 2018. Like, yeah, I seem like Cyberpunk or some of the other really far off things are somewhere in there, but it's just really weird having someone openly put a 2018 date on a calendar. But also, yeah, I mean, you said it perfectly. I would so much rather have a good game in 2018 than a shitty game in late 2016 or 2017. Yeah, exactly. And I feel like with Mighty No. 9 being the proving ground that those kinds of games can still exist, I don't think it's as Mega Man like as we all wanted it to be, but at all. It sucks. And I still haven't gotten my rewards from backing it three years ago. It's just garbage and just up and down like it's just a bad game. And we can't afford that to happen with this. Just to prove that we want these kinds of games, let's show Konami, for instance, that we want a Castlevania",
            "start": 4145.92
        },
        {
            "text": "just up and down like it's just a bad game. And we can't afford that to happen with this. Just to prove that we want these kinds of games, let's show Konami, for instance, that we want a Castlevania game, a proper Castlevania game. It's important that this game does well for more reasons than us just playing this game. It's a symbol. Bloodstained is a symbol. And Mighty No. 9 was a symbol to Capcom that they probably laughed about. We don't want Konami to laugh when they see Bloodstained. So I think take your time. First half of 2018 is fine. We'll play it in two years. That's totally fine with me. The only one last thing I think is funny is that one of the stretch goals is Wii U. And that's theoretically still in the docket for the first half of 2018, which is very funny to me. Yeah, I mean, we'll see about that. We'll talk about some promise. The Mighty No. 9 port, Pavita, never even happened. Number eight. If you've heard rumors floating around per what Andrew said before that Sony",
            "start": 4182.24
        },
        {
            "text": "we'll see about that. We'll talk about some promise. The Mighty No. 9 port, Pavita, never even happened. Number eight. If you've heard rumors floating around per what Andrew said before that Sony or third parties may charge gamers for HDR related patches, it's not true. The original story came by way of an interview with Japanese publication Game and Press Watch, which Kotaku translated for Western consumption. In the interview, Sony's Masaharu Iido essentially said that charging for patches quote will vary for each one of our titles unquote and seemed to double down on that when asked to reiterate. However, Sony has since released a comment stating that the company quote will not charge consumers for patches unquote. That's a confusing story because if you read the interview, and I don't know if there's more to the story, but when I was reading Kotaku, they asked him like three times and he says the same thing like over and over again. It gets deeper and deeper, like case by case",
            "start": 4217.86
        },
        {
            "text": "know if there's more to the story, but when I was reading Kotaku, they asked him like three times and he says the same thing like over and over again. It gets deeper and deeper, like case by case basis up to licensees, all these kinds of things. And then Sony's like, no, it's not true. It's like, well, what, what, how the hell did that happen? You know, like when have you ever charged for patches? Why would he think that you're going to charge for HDR related patches? Doesn't make any sense. Yeah, it's really weird. It's also there was another dev who came out on on the GAF thread and said, oh, we're specifically not allowed to charge for patches. Like that's actually part of the why am I forgetting the abbreviation, the things they agree to when they when they develop a game. The thing that's weird to me is like I just don't have a technical understanding of what goes into an HDR patch. If it's complicated, if it requires work, to me, it seems crazy to not release it in some kind of",
            "start": 4247.18
        },
        {
            "text": "weird to me is like I just don't have a technical understanding of what goes into an HDR patch. If it's complicated, if it requires work, to me, it seems crazy to not release it in some kind of premium thing. Like, I mean, the Bioshock collection is out this week, as we said. And that's something that took probably a year or two years or however many months of remastering. If that's required to make games compatible HDR, like that seems like wasted work if they can't charge for it. So I was always confused about what was the whole issue here. If it's as simple as flipping a switch, then yeah, of course, why would you charge for it? Number nine, when PlayStation VR launches next month, it's slated to come with a demo disk that packed 18 individual demos. Sony has confirmed that the following 18 games will be playable out of the box in demo form. Alumet, Battlezone, Drive Club VR, Eve, Valkyrie, Nog, Harmonix, Music VR, Headmaster, Here They Lie, Job Simulator, PlayStation VR Worlds,",
            "start": 4283.5
        },
        {
            "text": "18 games will be playable out of the box in demo form. Alumet, Battlezone, Drive Club VR, Eve, Valkyrie, Nog, Harmonix, Music VR, Headmaster, Here They Lie, Job Simulator, PlayStation VR Worlds, Resident Evil 7, Biohazard, Res Infinite, Rigs, Thumper, Tumble VR, Until Dawn, Rush of Blood, Wayward Sky, and Within. I was really happy to see this because there's gonna be a lot of experiences you don't have to necessarily pay for to at least see if you're interested in these games and then go buy the full version. So 18 games will come with PS VR in demo form. Yep, no matter which version you buy. Some of those are more like experiences that are, what is it, Anu, I'm pronouncing it wrong, I'm sure Anuette or whatever it is, it's supposed to be incredible. That's like almost like a short film in VR, but you can kind of rotate around the protagonist. It's based on a classic story, just sounds amazing. There's a lot of cool stuff in there. Looking forward to that. Really, really excited",
            "start": 4322.08
        },
        {
            "text": "in VR, but you can kind of rotate around the protagonist. It's based on a classic story, just sounds amazing. There's a lot of cool stuff in there. Looking forward to that. Really, really excited about PS VR. Number 10, Batman Return to Arkham, a collection on PS4 as well as Xbox One that includes Batman Arkham Asylum and Batman Arkham City, was delayed earlier this year. Now however, it has a release date. Witcher Warner Brothers has revealed that the collection will now launch on October 21st. As we already know, the collection contains all the DLC for both Batman titles in addition to the original games in remastered form. I know Greg's excited about that, I don't really care. I'm still also confused why, I mean I'm not confused, but they just have bastardized Arkham Origins to the degree where it's like, why did you guys even make it? If you're just going to pretend that it doesn't exist, it's not a good game. People like that game. Unless it was drastically underperformed, I",
            "start": 4355.78
        },
        {
            "text": "degree where it's like, why did you guys even make it? If you're just going to pretend that it doesn't exist, it's not a good game. People like that game. Unless it was drastically underperformed, I guess. I mean that game too. Which is why you'd want to get it out to more people, right? Yeah, I guess that's true. Buy like the 30th time you go to the bridge and have a fight in that damn bridge in that game. I like it. I'm excited to play Asylum again though. Number 11. Lego Harry Potter Collection is coming to PlayStation 4 and will combine Lego Harry Potter years 1 through 4 and Lego Harry Potter years 5 through 7 into a single disc. It will launch the same day as Batman returned to Arkham on October 21st and will come with quote enhanced graphics, environments, lighting, and visual effects end quote. The interesting thing about this story, I got this from IGN but I looked around a little bit, only on PS4? Like where is the Xbox One version? Mmm, interesting. I don't know, they might",
            "start": 4390.08
        },
        {
            "text": "end quote. The interesting thing about this story, I got this from IGN but I looked around a little bit, only on PS4? Like where is the Xbox One version? Mmm, interesting. I don't know, they might have announced it since then but that story specifically says PS4 only. And I was like, that's interesting, I don't know why that would be. That can't be true. I would be surprised if that's true. Number 12. Hyper Light Drifter has been cancelled for PlayStation Vita. The unique action RPG which came to PS4 in late July this year which was originally slated for Vita but was cancelled due to unforeseen issues in the development of the Vita iteration including fatigue of the developer, including issues with the engine there having to build it from the ground up, they can't get the game to run. I want to reiterate, because I don't think it's done necessarily with any malice, developers need to stop promising games for Vita if they're not going to fucking deliver them. I want to be very",
            "start": 4418.88
        },
        {
            "text": "run. I want to reiterate, because I don't think it's done necessarily with any malice, developers need to stop promising games for Vita if they're not going to fucking deliver them. I want to be very categorical about that. Stop promising us Vita games and not delivering them. It's not acceptable. This is happening over and over again now and it's not fucking cool. We knew that Axiom Verge took a year because of this and the other thing, we forgive that especially with all the Tom Haps going there which is fucking terrible by the way and we wish him the very best. You know, Money Number Nine, nowhere to be found. Salt and Sanctuary, nowhere to be found. Like over and over again, treat us with a little bit of respect. If you're going to promise us the game, then fucking deliver it. Or do not promise it. And I hate to sound like it's come off as heartless or curt, but it's like I understand that there are extraneous circumstances and fatigue and all those kinds of things. Not your fans",
            "start": 4452.0
        },
        {
            "text": "promise it. And I hate to sound like it's come off as heartless or curt, but it's like I understand that there are extraneous circumstances and fatigue and all those kinds of things. Not your fans fault. You promised the game. We didn't ask you to promise the game. No one put a gun to your eyes and said, give us the Vita version. So when the guys at Salt and Sanctuary are upset that people are asking for the Vita version, it's like, well you fucking promised the Vita version. Now people can ask you nicely. I don't have to be assholes. I'm not condoning that at all. But I understand people's anger about this at this point. We are a small but loud group of people and we want our games. And if you're not going to deliver them, don't promise them. The same thing happened with multiple games that came out recently. That story-driven game, Alone With You or whatever. That's not the right one. What's the one with the interesting graphics, like the adventure game where you have six hours to",
            "start": 4492.94
        },
        {
            "text": "that came out recently. That story-driven game, Alone With You or whatever. That's not the right one. What's the one with the interesting graphics, like the adventure game where you have six hours to deliver or whatever. That was supposed to come to Vita. I played that on Vita three years ago. And then Hugh, that puzzle game was supposed to come to Vita. Where to be found. Like, come on guys. This is getting actually ridiculous. And I think Sony needs to do something about this where it's like, you know what, your game's not maybe coming out on PS4 until it comes out on Vita if you're promising it that far ahead of time. It's also a weird thing for Kickstarter games because they're putting Vita as a stretch goal on Kickstarter. And just don't do it. Don't just put that word there if it's not something you intend to deliver or that would be too complicated to port. Like I think that's the thing that always confuses me with stretch goals because technically someone gave you money",
            "start": 4529.26
        },
        {
            "text": "it's not something you intend to deliver or that would be too complicated to port. Like I think that's the thing that always confuses me with stretch goals because technically someone gave you money specifically to get to that stretch goal, I'm sure. So why not just say additional platforms or why not say we'll investigate Vita or just be super upfront that, hey, this might not work, but we'll look into it. Again, it's all messaging. Like I feel like communication is so bad from so many devs lately. There's also like, I mean, like I'm Settsuna is a great example of something that came to Vita in Japan and didn't here. And I don't think Squire has really said why, but you can assume it's business related or maybe it's too expensive to localize. It also didn't run very well on Vita. That's the word I heard. And that would make sense. And they lost money on IMS. But yeah, so I think they were trying to like, I think they probably made, they released their financial report before the game",
            "start": 4567.9
        },
        {
            "text": "word I heard. And that would make sense. And they lost money on IMS. But yeah, so I think they were trying to like, I think they probably made, they released their financial report before the game even came out here. I think they probably made their money back. But yeah, it's an interesting messaging thing where it's so confusing. Like 2K stealth releases these big games that could have been a big deal. Square Enix suddenly is just releasing games on Vita again. They release Adventures of Mana out of nowhere, out of nowhere. And we get Dragon Quest Builders and World of Fun fans. Yeah, Dragon Quest Builders. And I'm like, what the fuck's going on? And I asked obviously XSeed doing God's work. You know, like, so I just, you know, I don't mean to call anyone out individually and I'm not doing that per se, but it's just, it's gotten to the point where someone needs to really stand up and be like, this isn't fair. Like don't announce your games and then just cancel them on us. Like some",
            "start": 4605.8
        },
        {
            "text": "that per se, but it's just, it's gotten to the point where someone needs to really stand up and be like, this isn't fair. Like don't announce your games and then just cancel them on us. Like some of us have been waiting to play those games like specifically on Vita. And then you like come back and be like, don't ask us about the Vita game or just out like cancel or those kinds of things. Like you guys promised it. No one like, you know, it's not, no one left in your mind and made you fucking say you're gonna make a Vita version. Hyper Light Drifter and other games probably benefited from the stretch goals that were promising Vita and they got more money and they didn't deliver the game. And I understand they're offering refunds and they're offering a different skew of the game. That's fine. And that's the best you can do. And I understand things happen and mistakes happen. We know that we produce things, but it's just happening over and over again this year. And I don't think it's",
            "start": 4640.04
        },
        {
            "text": "fine. And that's the best you can do. And I understand things happen and mistakes happen. We know that we produce things, but it's just happening over and over again this year. And I don't think it's cool. I don't think it's right. And you know, I do, I still stand by the fact that I think there is a vibrant audience on Vita that would want to play these games if you would just figure out a way to deliver them. And we're still getting our Vita games, but you know, I, you know, I'm seeing examples every week now. Yeah, it's crazy. Speaking of Vita, Alexis wrote in and said, greetings guys, long time fan here beyond, he says. I have been listening to your podcast for the last couple of years and have heard nothing but praise for Sony's special child, the PlayStation Vita. I am actively looking into buying one the last few days, seeing as I already own like 100 or more games from a PS Plus and cross buy titles alike, but I'm still not sure. See, I am a college student, so my income is",
            "start": 4670.96
        },
        {
            "text": "into buying one the last few days, seeing as I already own like 100 or more games from a PS Plus and cross buy titles alike, but I'm still not sure. See, I am a college student, so my income is low and my expense is high. The world of adults is harsh. Normally I spend about 250 euros a year on video games, a little more than the Vita costs currently. So joining the Vita island seems like a pretty big investment for me at the time. I will have to skip on a lot of games I'm excited to play. What would you guys, what would you guys' advice be? Can you convince me to jump the gun and buy one? Your market, you market these things better than Sony themselves. Thank you for all your hard work and love you put in your content to please us. Keep it up, Alexis. You're very welcome, Alexis. Thank you for writing in. What do you make of this? I think that if you have that many games, I feel like jumping on it is fine, but I, again, your financial situation doesn't seem great. If you're looking",
            "start": 4703.2
        },
        {
            "text": "you for writing in. What do you make of this? I think that if you have that many games, I feel like jumping on it is fine, but I, again, your financial situation doesn't seem great. If you're looking forward to playing, you know, the five or six triple A games you can afford or the smaller develop, you know, smaller PSN games that you can afford, then it might not be a good time for you to do that. First of all, my voice cracked when I said beyond. So beyond because that was very sad. Very, very lackluster beyond. Second, Alexis, I assume she, I guess Alexis can be a dude. Oh yeah. Yeah. That's a good point. They wrote and said, euros in Europe specifically, there is actually a bundle that includes a bunch of games. It's like a Vita mega value pack or whatever that comes with like hotshots and Uncharted and Gravity Rush and something else, I believe, as part of that core skew. So you can get a deal on things like that. And I don't know, I would actually say the opposite. I think there",
            "start": 4733.46
        },
        {
            "text": "and Uncharted and Gravity Rush and something else, I believe, as part of that core skew. So you can get a deal on things like that. And I don't know, I would actually say the opposite. I think there are a lot of great PSN games to buy, but I think there's probably more on Vita that you can get. Like, yeah, I guess it gets hard when money is that tight, of course. But I think that if you buy that value pack and then if you can get what's available on PS Plus and all that, I think there are enough deals that could probably do okay. So the cross buy stuff, a lot of your PS4 games automatically cross over again. So like that's that many more titles in your library. That's it for Roper's Report. I forgot, I forgot how intense and loquacious your Roper reports can be. That was good. That was fun. Thank you. Well, fun one's word for it. Yeah. Let's get into the games coming out this week because we're really excited about one of them. I want to talk to you about one of them. You're a bigger",
            "start": 4770.88
        },
        {
            "text": "Thank you. Well, fun one's word for it. Yeah. Let's get into the games coming out this week because we're really excited about one of them. I want to talk to you about one of them. You're a bigger fan even than I am of this particular series because I really am a fan of one of the games. Let's go through as we often do and read the upcoming games as they are written on the PlayStation blog because this is fun. Arcade's archives Kiki Kaikai comes out to PS4 Digital. This is the 14th release of this comes out on Wednesday. Kiki Kaikai is an action game released by Taito in 1986. Players control Seiyo, a young Shinto shrine maiden fighting against monsters in order to save the kidnaps seven lucky gods. This title includes both the Japanese version and the overseas version. Can't be that lucky if they got kidnapped. Makes you think. Bioshock the collection comes to PS4 Digital and retail. Return to the cities of Rapture and Columbia and experience the award winning Bioshock franchise like",
            "start": 4822.4
        },
        {
            "text": "if they got kidnapped. Makes you think. Bioshock the collection comes to PS4 Digital and retail. Return to the cities of Rapture and Columbia and experience the award winning Bioshock franchise like never before. Bioshock the collection retells the epic journeys of the Bioshock universe beautifully remastered for PS4. How excited are you? Because I am fucking stoked and I got to be honest with you I'm specifically excited about Bioshock too because we're about to find out the trophies are different because they had to remove the online ones. So I mean yes good because all those multiplayer trophies were awful. Yeah. I'm excited. I'm so excited. Bioshock is one of my favorite games. I know you feel the same way about it. Infinite specifically so what do you what are your thoughts? And even as so I played like 30 40 minutes of this at my even longer than that at gamescom and it looks like it cannot be understated how much better Bioshock one really does look. I think like we only really",
            "start": 4858.72
        },
        {
            "text": "as so I played like 30 40 minutes of this at my even longer than that at gamescom and it looks like it cannot be understated how much better Bioshock one really does look. I think like we only really saw the beginning parts so like I'm sure maybe later in the game there's whatever. But what we saw really did look noticeably better which is awesome because I actually went back to Bioshock one relatively recently and it does look dated. It just is Bioshock one is still mechanically dated though and that doesn't go away. I think playing Bioshock two in what respect. I mean it's just a little like picking things up in the inventory system and things like that and the way you're limited just feels clunky. I think Bioshock two is just easier to play than Bioshock one despite the fact that I think Bioshock one is leaps and bounds ahead in terms of story. But I'm so excited to revisit them. Infinite like looks like the PC version. I mean it looks better than it did on PS3 but I don't notice",
            "start": 4892.56
        },
        {
            "text": "Bioshock one is leaps and bounds ahead in terms of story. But I'm so excited to revisit them. Infinite like looks like the PC version. I mean it looks better than it did on PS3 but I don't notice any like gigantic visual differences in the time I spent with it. But yeah I'm super excited to go back to Bioshock one. I want to play through Bioshock two again. I've only played through it once. Maybe it's tighter than I remember. But I especially want to play Minerva's Den which I feel like is just I know a lot of people do talk about it but I feel like even so it's just criminally underrated. That is such a good piece. It's such a tight piece of content and it's actually really long. It's like twice as long as it probably you would expect it to be. I want to say did Steve Gaynor write Minerva's Den? So Steve Gaynor and a bunch of Fullbright people. So the Fullbright people, the guys and gals that work on Gone Home are responsible for that. You're probably going to find some resonance",
            "start": 4931.84
        },
        {
            "text": "Den? So Steve Gaynor and a bunch of Fullbright people. So the Fullbright people, the guys and gals that work on Gone Home are responsible for that. You're probably going to find some resonance with the particular plot there. I'm super so Bioshock I love the original Bioshock. I'm very I adhere to the school that that game is with the exception of Last of Us probably the best game in the last 10 years. And I feel like there's a generation of gamers because I really hadn't thought about it until recently. I was 22 or 23 when Bioshock came out. I'm 31 now. It's been a long time and I feel like there's a generation of gamers that have just jumped on or just missed it. This is your chance. I can't say how the games run or how this collection is. You might want to wait for reviews so don't just jump on things and then it's all fucked up and don't blame me. But I'm telling you if everything pans out with this, this is a great great collection to buy. And I'm not a huge fan of Infinite but",
            "start": 4967.32
        },
        {
            "text": "jump on things and then it's all fucked up and don't blame me. But I'm telling you if everything pans out with this, this is a great great collection to buy. And I'm not a huge fan of Infinite but I'm excited to go back and try it again because I feel like there's something I missed and people I trust like you really love it. So I feel like I was just in a weird space or something in my head at that time. I don't know why it didn't click with me. I think I was looking for something more like the original Bioshock and it's not. It's definitely not. It's also like you. My best advice to people with Infinite is not to play as a shooter. I think it is as a shooter. It is very clunky. If you just actually use the vigors, actually use the powers, it's much more interesting because combining those. And I played Bioshock 1 the same way. I like to play Bioshock 1 with only the wrench. I almost never fire a bullet in that game because I don't really find the shooting itself particularly great.",
            "start": 5009.4
        },
        {
            "text": "And I played Bioshock 1 the same way. I like to play Bioshock 1 with only the wrench. I almost never fire a bullet in that game because I don't really find the shooting itself particularly great. I think combining the plasmids in that game and kind of being strategic about what you do especially on harder difficulties is a must in that game. I think Infinite that carries over. I think Infinite's most creative gameplay comes from weird ways you can combine the powers. I agree. And I platinumed the original Bioshock on PS3. I know you did the same with Infinite. And I think you did it on Xbox One. You got all the achievements right. So you really love that game. Not great. I'm going to really drop everything and try to platinum those three games. I'm excited about all these delays too because my biggest criticism of this when they announced it was it was coming out a stupid time because it was around all the fall games. But now truthfully with Final Fantasy moved and then with Last",
            "start": 5042.76
        },
        {
            "text": "my biggest criticism of this when they announced it was it was coming out a stupid time because it was around all the fall games. But now truthfully with Final Fantasy moved and then with Last Guardian October moved like I think I can pretty much clear out September to play this which is awesome. I think I'm totally going to jump in back into probably all three of them honestly. Yeah me too. Yeah. With new games that I'm really excited to play it's really only Mafia 3 and Battlefield. So other than that like I have time and I'm going to use that time to at least get through Bioshock and some others as well. Dead Rising triple packs on here. Comes out digitally it says enjoy three times the zombies with Dead Rising triple pack including Dead Rising Dead Rising 2 and Dead Rising 2 off the record. What a time to be undead. I was so confused about these because they were they're selling separately. I saw also again like as a remaster collection like this Bioshock 1 and like even Harry",
            "start": 5080.56
        },
        {
            "text": "record. What a time to be undead. I was so confused about these because they were they're selling separately. I saw also again like as a remaster collection like this Bioshock 1 and like even Harry Potter or any of those like that makes sense. I don't know why you would buy just I mean I guess it's because there's this ardent fan base that only likes Dead Rising 1 and not 2 or vice versa. Dead Rising 1 is a different game so it's yeah so that could be but I think it's weird as well. Don't Starve Together console edition comes to PS4 digitally. Don't Starve Together console edition is the standalone multiplayer expansion of the uncompromising wilderness survival game Don't Starve. Enter an unexplored world full of strange creatures, dangers and surprises. Gather resources to craft items and structures to match your survival style. Play your way as you unravel the mysteries of this strange land. Do whatever it takes but most importantly don't starve. Hot Shots Tennis the PS2 games comes",
            "start": 5114.44
        },
        {
            "text": "structures to match your survival style. Play your way as you unravel the mysteries of this strange land. Do whatever it takes but most importantly don't starve. Hot Shots Tennis the PS2 games comes to PS4 digital with trophies. Says a tennis game for everyone filled with classic hot shots personality and true tennis gameplay. Play against the quirky case of tennis pros and challenge your friends and family in singles or even four player double matches. Tennis will never be the same. No platinum. Yeah it's weird that they're doing it. They did the same thing with Ape Escape. Mahjong comes to PS4 digital. Says rediscover the famous traditional Chinese game. Find all the matching pairs of tiles being careful not to become blocked in to get to the end of each level. Concentration and perceptiveness are needed to finish the gorgeous boards that we have produced for you. Oh that last sentence was very straightforward. May Q Labyrinth of Death comes to Vita digital and retail. Says first",
            "start": 5150.56
        },
        {
            "text": "are needed to finish the gorgeous boards that we have produced for you. Oh that last sentence was very straightforward. May Q Labyrinth of Death comes to Vita digital and retail. Says first the winds stop then birds vanish from the skies. Finally the sunset and an eternal night fell upon the world. Why does this keep happening in games? It's up to you and your mechanical guardians whose individual parts can be customized to make your way through the four tower mazes and set things in motion again in this challenging dungeon crawling RPG. Mystery Chronicle One Way Heroics comes to PS4 Envy the digital cross by. The kingdom is being swallowed by the shine raid a destructive wall of light. But forget about saving the king forget about saving the townsfolk a true hero is one who lives to save the day so you better keep moving. Leave dinky dungeons behind to explore an infinite number of procedurally generated worlds each with their own unique terrain traps and treasure. Is dinky dungeons",
            "start": 5187.96
        },
        {
            "text": "the day so you better keep moving. Leave dinky dungeons behind to explore an infinite number of procedurally generated worlds each with their own unique terrain traps and treasure. Is dinky dungeons like a proper noun or is it saying dinky? No it's not. I see. Because dinky dungeons would be an awful place to live. Dinky dungeon would be a great name for a game. I would leave that behind for sure. NASCAR heat evolution comes to PS4 digital and retail. For the first time on PS4 race is your favorite NASCAR Sprint Cup series drivers across all 23 licensed NASCAR tracks in stunning HD with incredibly detailed environments. Get ready for the most fun you've had with a NASCAR game in years. Probably not very. Bold claim. NBA 2K17 which I'm sure is going to be huge comes to PS4 and PS3 digital retail out the 16th. Thursday release. Following the record breaking launch of NBA 2K16 the NBA 2K franchise continues to stake its claim as the most authentic sports video game. NBA 2K17 will take",
            "start": 5223.66
        },
        {
            "text": "retail out the 16th. Thursday release. Following the record breaking launch of NBA 2K16 the NBA 2K franchise continues to stake its claim as the most authentic sports video game. NBA 2K17 will take the game to new heights and continue to blur the lines between video game and reality. Look at those screaming men. If you look at the cover art of NBA 2K17 next to NHL 17 everyone's screaming at each other. Calm down guys. NHL 17 comes to PS4 digital and retail. Shape your legacy in NHL 17 the biggest and most exciting EA Sports NHL game to date. Own every zone with more end to end control with authentic goalies. All new net battles for offensive and defensive zone play and new goal celebrations that capture the excitement of scoring the biggest goals. Live your hockey fantasy. Have you played any of NHL 17 yet? Nope. I heard it's good. Yeah I haven't played an NHL game in years. Every once in a while I'm randomly in the mood because I used to love them way back in the day even though I",
            "start": 5253.62
        },
        {
            "text": "any of NHL 17 yet? Nope. I heard it's good. Yeah I haven't played an NHL game in years. Every once in a while I'm randomly in the mood because I used to love them way back in the day even though I know nothing about hockey and I'm very very bad at those games. Yeah I used to review them every year at IGN but I haven't played them since. Pac-Man Championship Edition 2 which I can't fucking wait to play. PS4 digital. The mush awaited sequel to Pac-Man Championship Edition featuring eye popping, 3D graphics and funky visuals. The latest version of this classic game takes chomping and chasing through mazes to a whole new level. I know virtually nothing about the sequel but I know that Pac-Man Championship Edition DX and even regular Pac-Man Championship Edition I love so much. Yeah they're great. Like DX is one of those like that's like IGN has some 10s in its history that are dubious but I think that one is totally just funny. Yeah I actually agree I really really love that game. The",
            "start": 5293.38
        },
        {
            "text": "great. Like DX is one of those like that's like IGN has some 10s in its history that are dubious but I think that one is totally just funny. Yeah I actually agree I really really love that game. The sequel has a platinum which I think is pretty cool. Pro Evolution Soccer 2017 comes to PS4 and PS3 digital retail. The award winning series returns taking the famed gameplay to a new level. Control reality with a host of new improved features to gameplay including real touch and precise pass. The new features refine the focus for the series which is enjoying playing PS with friends. Psycho Pass mandatory happiness comes to PS4 and Vita digital and retail. 2112 Tokyo decide the fates of Nadeshiko Kugatachi and Takumi Suragi. Two new detectives assigned to Division 1. Every decision has its own repercussions. Victims can become criminals and the story may end quicker than expected. I know that Kelly Plagge and Miranda Sanchez love this. They like Psycho Pass is a real big deal. There's a",
            "start": 5328.54
        },
        {
            "text": "repercussions. Victims can become criminals and the story may end quicker than expected. I know that Kelly Plagge and Miranda Sanchez love this. They like Psycho Pass is a real big deal. There's a bunch of views on the anime stuff so that's cool. Bunch of dorks. Rive. That's another NIS game. Yep. More power to them. Yeah they're doing their they are doing God's work. Rive PS4 digital. Rive is the metal wrecking robot hacking shooter you've been waiting for. This 360 degree shooter platformer hybrid lets you choreograph a dance of destruction during an insane sequence of spectacular battles and set pieces. Rive feels like the explosive games of yore pumping megapixels in true 21st century style. Stardust Galaxy Warriors Stellar Climax comes to PS4 digital out the 12th so this is out today. Oh well by the time you hear this it's already out. You've already had your stellar climax. Stardust Galaxy Warriors Stellar Climax is an engaging one to four player couch co-op action game",
            "start": 5369.0
        },
        {
            "text": "today. Oh well by the time you hear this it's already out. You've already had your stellar climax. Stardust Galaxy Warriors Stellar Climax is an engaging one to four player couch co-op action game combining shmup and brawler like gameplay with light RPG elements. Choose from different game modes, gameplay settings, mechs, weapons and upgrades to customize your experience freely. Soar through space, defeat evil and save the future from itself. I saw that first and saw Stardust and got very excited and then it was not very exciting. Unholy Heights PS4 digital. Hell is too boring so the devil transforms himself into a monster apartment slumlord. Unholy Heights combines tower defense and apartment management to create uniquely fun and addictive gameplay. As a devil you have two ambitions, collect millions in rent and breed a monstrous legion of fearsome beasts. Unleash your monsters on the human adventures and evict them with extreme prejudice. Sounds fun. Do you think hell is that the",
            "start": 5406.72
        },
        {
            "text": "millions in rent and breed a monstrous legion of fearsome beasts. Unleash your monsters on the human adventures and evict them with extreme prejudice. Sounds fun. Do you think hell is that the ultimate hell if hell is just like an office job? Like hell isn't like torture it's not that it's as literally just boring. Pushing papers bro. I didn't want you to yell at me because I'm forgetting off the mic. Worlds of Magic Planner Conquest. Planner P-L-A-N-A-R. On PS4 digital out the 14th so this is a Wednesday release. Become the supreme sorcerer, explore and conquer an almost limitless number of uniquely generated universes. I've heard this before. Using military and magical power to overcome your foes. Find cities, raise armies, cast spells and create powerful magic artifacts in your bid to become the supreme sorcerer lord in Worlds of Magic Planner Conquest. A 4X turn based strategy game. And that's it. So I would say pick of the week has to be BioShock. Although I would give it Pac-Man",
            "start": 5439.18
        },
        {
            "text": "the supreme sorcerer lord in Worlds of Magic Planner Conquest. A 4X turn based strategy game. And that's it. So I would say pick of the week has to be BioShock. Although I would give it Pac-Man Championship Edition 2 a nice nod of the head as well. Hopefully like I don't know I haven't seen reviews for that I don't know how that's looking I would hope that the pedigree of the first one means the second one's good. I am I'm in this weird boat also so I guess I should mention we were recording this before the Sony Asia press conference that's tonight at midnight I think so maybe there will be an answer to this question. Seeing NIS on there reminds me like where the hell is Dangarump at three? What happened to that? They're not saying that. So we had the developer the creator of the series over to the house last year we talked about it. I think they're just keeping their they're working on the anime and then I think yeah kind of just chillin it's gonna be a PS4 and be the game so I think",
            "start": 5478.94
        },
        {
            "text": "to the house last year we talked about it. I think they're just keeping their they're working on the anime and then I think yeah kind of just chillin it's gonna be a PS4 and be the game so I think it's gonna be a little bit bigger it's probably a little more ambitious. I forgot it was also on PS4 this time yeah that's a good point. All right before we get into a few last questions as I said earlier we're not gonna do the traditional music or making fun of your PSN names or any of that kind of stuff thing because that's more Greg's thing. I wanted to go get into a few trophy things because so Bioshock Infinite's, Bioshock 2's, Bioshock trophies are all live. All the Dead Rising games trophies are live. Psycho Passage trophies are live. I won't get too into the woods I did want to get into the Bioshock trophies though and Bioshock 2 and Bioshock Infinite specifically because you're here and I think this will be fun. So Bioshock 1 for people that do not know the base game has 48 bronze",
            "start": 5516.72
        },
        {
            "text": "the Bioshock trophies though and Bioshock 2 and Bioshock Infinite specifically because you're here and I think this will be fun. So Bioshock 1 for people that do not know the base game has 48 bronze trophies two silver trophies and three gold trophies and a platinum trophy and then the DLC will also have trophies so there's trophies to be added. DLC trophy pack one has another 11 bronze and one silver. Is that what the challenge rooms and stuff are? Yeah this is a rescued little sister and a shocking turn of events rescued little sister blah blah blah. It seems like the trophies it's been a while since I platinumed it but it seems like the trophies are the same. Is it like brass balls and all the yep brass balls complete yep survive with no vitachamber yep complete the game on survivor difficulty without using a vitachamber complete the game on hard difficulty without using a vitachamber. I did all that once I'll do it again. Tonic collector. I've never done it with the hardest",
            "start": 5552.84
        },
        {
            "text": "difficulty without using a vitachamber complete the game on hard difficulty without using a vitachamber. I did all that once I'll do it again. Tonic collector. I've never done it with the hardest difficulty it's very hard. It is. Bioshock 2 is interesting so base game 24 bronze 9 silver 4 gold and a platinum. Now here's where they I haven't I haven't compared them on a one to one basis but they must be different because there is no multiplayer in this game. So I think that there is like so there's a trophy called protector defend yourself against lambs assault in the train station Sinclair solution joined forces with Sinclair and Ryan amusements I think these might be new. I wonder if they just added more story trophies. Let's you know what we can in real time we can just look. Yeah. So let me do this I'm gonna pull this over on this side of the screen. So we're gonna play Bioshock 2 in its entirety right now so yeah well just appreciate your patience just be patient with us and we'll",
            "start": 5589.12
        },
        {
            "text": "me do this I'm gonna pull this over on this side of the screen. So we're gonna play Bioshock 2 in its entirety right now so yeah well just appreciate your patience just be patient with us and we'll figure it out. Let's see I want to do some profiles. I actually got a lot of the multiplayer trophies in this game and they were not very fun. It was also not very fun trying to find people to play with because after launch this thing fell off real fast. Yeah I remember I lived in a studio apartment at the time I remember doing the same thing so yeah it says so this is Bioshock 2 so yeah unlocked all trophies the same big brass balls is now in here finished the game without Vita chambers I don't know that the original one has big brass balls no it does they're just moving them around but it's a so oh so it seems like they took some of the trophies and made them more so I made them more big brass balls in the original is a silver in the new one it's a gold. The same thing let's see with that",
            "start": 5630.88
        },
        {
            "text": "so oh so it seems like they took some of the trophies and made them more so I made them more big brass balls in the original is a silver in the new one it's a gold. The same thing let's see with that would actually be yeah so granddaddy is a silver in both so they must have just gone ahead against all odds. Yeah so yeah it's interesting so against all odds in the original one finished the game on the hardest difficulty levels a bronze in the new one it's a gold so it seems like the trophies are not different the but they upped them yeah I mean that would make sense like I'm super excited to play through Bioshock 2 again I really like the core story concept of like Alpha series and then Delta series with Charles Minton Porter and all that in Minerva's Den it's creative director was Jordan Thomas who worked on all three Bioshock games in some capacity and of course went on to do Magic Circle and a bunch of stuff on his own like that game I don't remember as well to be totally honest",
            "start": 5667.22
        },
        {
            "text": "Thomas who worked on all three Bioshock games in some capacity and of course went on to do Magic Circle and a bunch of stuff on his own like that game I don't remember as well to be totally honest because I just played through it the once but like I might try and platinum it like I feel like I might go back and try and get some of these. The cool thing about Bioshock 2 that I'm excited about DLC packs two of them Protector Trials and Minerva's Den both have their own trophies obviously so two bronze and five silver added for Protector Trials and then five bronze three silver for Minerva's Den which we were just talking about you guys should check out and then Bioshock Infinite 34 bronze 15 silver one gold and a platinum for the base game and then three DLC packs that add let's see I think so three did Clash in the Clouds adds three bronze or seven bronze and three silver Burial at Sea episode one seven bronze and three silver and then Burial at Sea episode two seven bronze and three",
            "start": 5714.36
        },
        {
            "text": "so three did Clash in the Clouds adds three bronze or seven bronze and three silver Burial at Sea episode one seven bronze and three silver and then Burial at Sea episode two seven bronze and three silver so lots and lots and lots of trophies in the cloud. The Clash in the Cloud ones are very hard because that's just the combat DLC and some of them are crazy. I'm excited before we go Gold Forb, let's read a few more questions from the audience to round things out. Gregory Index says, I recently decided to start buying all my games digitally and it has been great. However, the other day when I decided I wanted to play Divinity Original Sin I was unable to because the network was down. So now I am unable to play most of the games I have been playing of late all because of something that is completely out of my control. This has made me question my devotion to buying digital games and while I understand these instances don't happen often it makes me dread the idea of another great PSN",
            "start": 5755.52
        },
        {
            "text": "completely out of my control. This has made me question my devotion to buying digital games and while I understand these instances don't happen often it makes me dread the idea of another great PSN outage. I know the topic has been covered many times before but how can you convince everyone to buy digital games knowing they might not be able to play any of them at some point because of an outage. Thank you for all you guys do. PS I like you a lot. Signed Gregory Index. It's part and parcel with I think the reality. I don't necessarily know that it's different from some other digital ecosystems either. No, it's the same. Yeah, I mean Xbox has that all the time. I couldn't play Arkham Knight at one point because Xbox I was down. I mean this is like my biggest fear with digital games is that like there will be not even on the Sony side but on like my crappy Comcast internet side. I also worry about this with like the PS4 Pro not having a Blu-ray drive. It worries me because I want",
            "start": 5802.88
        },
        {
            "text": "that like there will be not even on the Sony side but on like my crappy Comcast internet side. I also worry about this with like the PS4 Pro not having a Blu-ray drive. It worries me because I want physical media because I can't imagine the internet strain of streaming whatever Luke Cage in 4K. Like that seems like it would be really hard. Right. So yeah, this is always my concern with entirely digital libraries. On Vita I love it because I want to carry around a bunch of cartridges obviously and generally if you have flight mode on the PSN checks are fine. Like I haven't encountered a game really where I can't do anything you know when I'm not connected. But yeah, this is always a concern of mine. Yeah I feel like it's just part of the danger and hopefully we can mitigate those risks moving forward. I would like Sony to do something where, and I thought they did, where if you bought the game and I could be wrong but I thought if you own the game like I am Setsuna for instance",
            "start": 5835.22
        },
        {
            "text": "moving forward. I would like Sony to do something where, and I thought they did, where if you bought the game and I could be wrong but I thought if you own the game like I am Setsuna for instance downloaded it from PSN on your core PSN with your name that it is able to be played without pinging the server. I guess not. I thought maybe that was the case. Maybe it's game by game because I actually thought that was the case too whereas I don't think it is on Xbox One but I thought it was on PSN but maybe apparently not. Because I've definitely played digital games not connected to the internet. Like absolutely positively done it many times. So I don't know if there's something more to that I'm sure someone can fill you in in the comments. Ray Briggs II writes in and says, hey Greg and Colin, again Greg not here, says two weeks ago a user, VerySuperJamus posted a question about maintaining your passion for games even as you get older and your life attempts to get in the way. I thought you",
            "start": 5880.66
        },
        {
            "text": "again Greg not here, says two weeks ago a user, VerySuperJamus posted a question about maintaining your passion for games even as you get older and your life attempts to get in the way. I thought you guys had a great response but I wanted to add something to it. I'm 37, married, have two kids, run my own business and volunteer at my daughter's school. I only have three to four hours of devoted game time each week though some weeks I can get in more. This year I have only played or completed seven games. Firewatch, Until Dawn, Stealth Inc. 2, Day of the Tentacle, Uncharted 4, Abzu and Headlander. That's a good set of games. I'm pretty good at boxing. I still consider myself a passionate and hardcore gamer. Those passions have just been redirected into reading about games, listening to those I trust talk about games on podcasts as I truck my children from place to place and watching streams and Let's Plays when I can. Just because I can't play as much doesn't mean I don't love it like I",
            "start": 5911.5
        },
        {
            "text": "I trust talk about games on podcasts as I truck my children from place to place and watching streams and Let's Plays when I can. Just because I can't play as much doesn't mean I don't love it like I always have. So if anyone ever tells you that you're too old or there's no time to be a gamer, you promptly tell them to go fuck themselves. You can make time for the things you truly care about. Thanks to Colin and Greg for helping me keep my passion and devotion to games ever present even though my life keeps trying to get in the way. Ray Briggs II. Thank you for writing in Ray. I wanted to acknowledge that because I think that was a very nice letter. That's very sweet. Let's see. Let's see. Let's see. I already read something like that so I'm going to delete that. Let's see. We already read something about that as well. Keep being afraid I'm going to hit some fancy equipment when I stretch my arms. You know what? I'm kind of satisfied with where we are right now. I think I'm going to",
            "start": 5943.5
        },
        {
            "text": "something about that as well. Keep being afraid I'm going to hit some fancy equipment when I stretch my arms. You know what? I'm kind of satisfied with where we are right now. I think I'm going to end it. How long have we been going, Kevin? That's a pretty good line. That's not bad. Especially considering we don't have all this other stuff to add on. I'm going to let you go. Andrew, thank you so much for joining me. It was a good week to have you on. Your expertise is always much appreciated. I forgot how much fun it is to podcast with you. You have a lot of great insight. Everyone should make sure to go check out Andrew's work on IGN, obviously. You can follow him at Garfepp, G-A-R-F-E-P on Twitter and listen to him on Podcast Beyond. Are you on other podcasts now as well or is that the only one you do? Occasionally I bounce around on NBC sometimes. There was an episode with Jeff Gerstmann that we did a couple of weeks ago and then weirdly this week I was on IGN Anime Club despite",
            "start": 5977.38
        },
        {
            "text": "only one you do? Occasionally I bounce around on NBC sometimes. There was an episode with Jeff Gerstmann that we did a couple of weeks ago and then weirdly this week I was on IGN Anime Club despite having seen almost no anime. But I talked about the new Persona 5 stuff. Cool. Yeah, Persona 5 right around that you're going to import it or are you going to wait for the... I have actually two copies coming from import because I wanted the special edition and then I wanted some of the pre-order bonuses from other places. That's out this week too which is crazy. 39 out of 40 of Famitsu doesn't mean anything but it seems like it's being well received. So Andrew, thank you so much for joining. You're welcome back with us anytime. Thank you out there for joining us today on PSILoveUXOXO. Greg will be back for a normal episode with me next week, I assume. But I hope you enjoyed this kind of special, different, more news oriented, more talkity talkity talkity episode of PSILoveUXOXO which is",
            "start": 6014.26
        },
        {
            "text": "be back for a normal episode with me next week, I assume. But I hope you enjoyed this kind of special, different, more news oriented, more talkity talkity talkity episode of PSILoveUXOXO which is interesting to say since it's a fucking podcast about talking about PlayStation. All right, we'll see you next time. Thank you so much for your support. We love and appreciate you. Next week we'll see you again for episode 53. Goodbye.",
            "start": 6049.86
        }
    ]
}