{
    "id": 2085,
    "video_id": "P52RHV-rwxI",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Rahul Kohli",
        "Zacq Wenzel"
    ],
    "title": "The Dog Shit Conspiracy (Pt. 1) - Kinda Funny Doodles",
    "description": "New episode of Kinda Funny Doodles every Friday!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nAnimated by Zacq Wenzel",
    "published_at": 1475251202,
    "duration": 78,
    "transcript_chunks": [
        {
            "text": "so here's the deal I traveled to go to La last week to go do the Final Fantasy event with Greg I come back and there is a bag of dog [ __ ] on my car and I'm just like that's weird it's a little bag of [ __ ] so I just take it off bling it off and that's it two days later it happens again there's another bag of [ __ ] on my car and I'm just like what the hell this is so weird then I leave to go to Texas we're there for a couple days and I get a text from curring dude there's three bags of dog [ __ ] on your car right now and I'm like well [ __ ] literally okay have you made sure that Kevin's not doing this to you no see that's my thing is I haven't had time to Kevin was pissed off when I told him he couldn't come to Austin with us and this is a perfect way for him and also when we first met a bag of dog [ __ ] fell out of his pocket here here's here's how we'll know if you set up the camera and you catch the person but he's wearing the Scream costume it's Kevin he you know yeah car",
            "start": 0.4
        },
        {
            "text": "met a bag of dog [ __ ] fell out of his pocket here here's here's how we'll know if you set up the camera and you catch the person but he's wearing the Scream costume it's Kevin he you know yeah car alarms are going off he keeping into them",
            "start": 48.8
        }
    ]
}