{
    "id": 2037,
    "video_id": "sNyGiWWzvpI",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Colin Plays 20XX - Kinda Funny Plays",
    "description": "Colin takes time to play 20XX and enjoys it.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1473436804,
    "duration": 926,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations. Welcome back to Kind of Funny Games. My name is Colin Morardi. Today I'm going to play 20XX. This is a sidescrolling rogike that's apparently based some way on Mega Man. Clearly the name indicates that. This was provided to me by a PR person who wanted me to play it after Mighty Number N. And how disappointed I was with it. I've been hearing good things about it. It's on PC. It's by It says Battery Stable Games and Fire Hose Games. No idea who they are. Uh this game's apparently in beta. You can still buy it on Steam. No idea how that's possible. Uh do not understand PC gaming. Nonetheless, 20XX it is. Let's jump in and see what it's all about. Playing with an Xbox 360 controller. As you can see here, uh A to jump, X to fire on the uh wellworn Xbox 360 controller that I'm using here. Um it's teaching me how to play. Apparently, I can hold A to jump further. All right. I like so far right bumper. Okay, I see right bumper to move forth and then ah okay, super",
            "start": 0.08
        },
        {
            "text": "that I'm using here. Um it's teaching me how to play. Apparently, I can hold A to jump further. All right. I like so far right bumper. Okay, I see right bumper to move forth and then ah okay, super jump. Oh, okay. So, it is very it's really Mega Man X and not Mega Man. I can wall jump. All right. Yeah, it's a Mega Man X clone. So, like what I'm seeing so far. Clever little tutorial area to show me everything that's going on here. These are small health pellets. I guess I don't need them. What is this? Boomerang blades. All right. Do I have to No. Okay, I guess I can't pick those up. Uh, so why to use the special weapon? Cool. Very cool. Like it so far a lot. Looks like there's something up here. Heart container. Max health up. Cool. All right. It looks like we're going maybe into the normal part of the game. Oh, a little boss. Huh. I wonder where they got this idea from. These boss doors. Oh no. Who's this man? Rollster beta. F roll free or die. All right. I dig. Where's my health?",
            "start": 35.68
        },
        {
            "text": "part of the game. Oh, a little boss. Huh. I wonder where they got this idea from. These boss doors. Oh no. Who's this man? Rollster beta. F roll free or die. All right. I dig. Where's my health? All right. Just busting him up. I'm still not seeing my health. I guess I don't have health yet or something. I don't know. Okay. Tutorial complete. Prepare to die. All right. Fair enough. Now we're talking. There it goes. There's my health. I'm Al, the station's onboard AI. I'm here to help. All right. Multiplayer. Absolutely not. Shop. No, we don't need any of that. Challenges. Daily challenge. Normal mode. Okay, let's play normal mode. Let's see what normal mode is all about. Generating levels. Since this is rogike, so it is randomly generated and procedural as rogue likes are. Level one. Vile Vis. This is seriously Mega Man X, which is very cool. Soul chips. All right, so I can hold down fire to obviously do more damage. Twice as much damage, it looks like. Whoa. Oh, a little teleporter.",
            "start": 107.36
        },
        {
            "text": "Vis. This is seriously Mega Man X, which is very cool. Soul chips. All right, so I can hold down fire to obviously do more damage. Twice as much damage, it looks like. Whoa. Oh, a little teleporter. These are icy, it looks like. No, maybe not. Uh oh. Oh, so spikes don't kill you. All right. Well, that takes away a little bit of the the uh danger here in the game. I respect it, though. I'm sure the game's going to get very hard. Some parallax scrolling in the background. Very nice. Very fancy. What does this mean? You are too poor. Oh, okay. All [Music] right, let's flank him from behind. All right, that looks like health. I'm going to go ahead and endeavor to get that. Nice. This evil penguin man, it looks like he's got a problem with me. So, go in the other direction. All right. Use these teleporters, I guess, to get over here. Oh, I'm already at some sort of boss or mini boss, maybe. What is this? Pay five nuts to unlock. I don't even have nuts. Well, I have nuts, but not in the",
            "start": 170.2
        },
        {
            "text": "teleporters, I guess, to get over here. Oh, I'm already at some sort of boss or mini boss, maybe. What is this? Pay five nuts to unlock. I don't even have nuts. Well, I have nuts, but not in the game. Oh my god, look at this [ __ ] thing. Vile visar of nightmares. All right. Yeah, force my way through this guy, I [Music] guess. All right, bonus achieved. It says in 57 seconds. I don't know what that means. We keep going. Who is this man? Well done. Take the boss's power or nuts or an AUG. Huh. Force Nova. Release a shock wave, crushing foes and blocking shots. Nut stack. Very nice. Viro reserve. Max energy plus four. I'm going to take [Music] that. Look at these doctors. I wonder who they're modeled after. I found this in the garbage. What does this mean? I guess I didn't need that. Rollster stir. So, these are the next enemies I can go after. Okay. All right. What's this? Looks like an interesting creature. Let's go here. The Vacu Lab. Death Lotus. I'm feeling it so far. It's good.",
            "start": 278.56
        },
        {
            "text": "stir. So, these are the next enemies I can go after. Okay. All right. What's this? Looks like an interesting creature. Let's go here. The Vacu Lab. Death Lotus. I'm feeling it so far. It's good. It would be right at home on PS Vita if they're paying attention over at these studios. Can I go down this way? Is there any secrets? Nope. I respect that you let me try. Music's really cool. You guys can hear that. Looks like this thing's going to keep shooting these sons of [ __ ] All right, let's see. Get away from me. Oh, so let's actually here we're going to need to use the super jump. Cool. Oh, what the hell just happened to me? Oh, it's that. I see. Okay. Okay. So, here we're going to have to get a little clever. Oh, little Mega Man 5 homage. Gravity man. Very cool. All right. Disappearing blocks. What would Mega Man be without those? I don't know what that guy's all about, but I don't want to fight him from up close. Let's put him away. Is it doing any damage? Yep. Okay. This is really",
            "start": 371.48
        },
        {
            "text": "What would Mega Man be without those? I don't know what that guy's all about, but I don't want to fight him from up close. Let's put him away. Is it doing any damage? Yep. Okay. This is really great. This is really, really cool. Like this a lot. It's very intuitive if you play Mega Man. If you're a Mega Man fan like me. Very intuitive. Probably not if you're not a Mega Man fan. All [Music] right. Oh, so I can go glory zone. What does that mean? I don't even want to know, but I'm going to Well, I guess I do, actually. Oh Jesus. The hell was that? Hold on. No damage. Failed. Oh, okay. So, I guess I couldn't take damage. I guess I got to go now. Try it again. [Music] It looks like I can't. Oh, it looks like it doesn't respawn. I respect that. Oh, man. So, the same rules apply here. Looks like you can only have three bullets on the screen at a time, just like in Mega Man. I like how he seems to be dressed like kind of like the Mega Man box art. [Music] This stage reminds me a little bit",
            "start": 446.84
        },
        {
            "text": "you can only have three bullets on the screen at a time, just like in Mega Man. I like how he seems to be dressed like kind of like the Mega Man box art. [Music] This stage reminds me a little bit of Plantman stage in Mega Man 6. All my Mega Man 6 fans out there. Don't know if that's Don't know if that's intentional. Could be, might not be. I don't know. It's definitely getting harder. As you can see, the platform is getting a little more a little crazier. [Music] Got to brute force your way through sometimes in Mega Man. I'm running out of energy though, so I got to be a little care more careful here. [Music] Nice. Exactly what I needed right now. Perfect. Oh, I don't know why I did that. All right, so we're here at the boss. I don't think I'm going to have what it takes to beat him cuz I don't have much energy left. Pay five bolts. So, let's see. Scrap recycler. What does that mean? Okay. So, I can buy some hit points. Is that what I can buy here? I'm too poor. Okay. You like the",
            "start": 539.76
        },
        {
            "text": "I don't have much energy left. Pay five bolts. So, let's see. Scrap recycler. What does that mean? Okay. So, I can buy some hit points. Is that what I can buy here? I'm too poor. Okay. You like the countdown timer? Oh, yeah. I didn't even notice that. I didn't even think I noticed that. Uh-oh. I don't think I have enough time. Thanks for pointing that out, Kevin. I didn't even notice that. It's not very prominent. They could do a little bit better to design that a little more. That might be for the like bonus thing you got earlier. Oh, okay. Die owl. Bonus timer. Oh man, this boss is a little bit of a pain in the ass, huh? He's going to kill me. This is a cool These are cool designs. I'm going to die. But we gave it a valiant effort, didn't we? Not bad for my first time. Maybe I can do it. Doubtful, but maybe. Jesus. Come on. Come on. Come on. Got him. Tell you what, Kev. Big Kev dog. Thank you. Thank you. Take his mortar or I can take I'm going to take more nuts. Strong armor. Basic",
            "start": 634.8
        },
        {
            "text": "Doubtful, but maybe. Jesus. Come on. Come on. Come on. Got him. Tell you what, Kev. Big Kev dog. Thank you. Thank you. Take his mortar or I can take I'm going to take more nuts. Strong armor. Basic attacks deal more damage. Soul chips. Shall we keep going? That guy. All right. Sky Temple. Interesting. They don't refill your life. I like it. Very rogike. Ah, this this this stage strikes me a little bit like um Oh, I'm going to die. Strikes me a little bit like uh Storm Eagles in the original Mega Man X. Again, not sure if I'm just reading into [Music] that. Do those things ever go away? I like the pallet swapping. They're doing a lot of pallet swapping in the game, which is cool. Give you a little bit of diversity with the enemies. Not something Mega Man really did. Uh, but you definitely saw that in other games. Uh, a lot of role playing games back on the NES. SNES did a lot of pallet [Music] swapping. Oh [ __ ] Oh. Oh. My guy stopped moving. I think I ran into a bug. Guess it's a",
            "start": 712.84
        },
        {
            "text": "saw that in other games. Uh, a lot of role playing games back on the NES. SNES did a lot of pallet [Music] swapping. Oh [ __ ] Oh. Oh. My guy stopped moving. I think I ran into a bug. Guess it's a good way to wrap it up. No, everything else is still Well, no, nothing else works. Way to go, guys. It's a fine place to stop. Can you see why I should have been at the uh SGC competition you guys did at RTX? Cuz I'm the only one that actually knows how to play games. If only you had wanted to come with us. I know. What a shame. Kevin, thank you for your time. Everyone out there, thank you for your time. Remember, you can find 20x uh as long as it doesn't break. I don't know if it's our controller or the game. Could be either. Uh over at Steam. Uh I think it's like $1.99 or something like that. Uh but you go check that out. See if the price is appropriate for you. whatever it's priced at. Uh, hope you enjoyed. I like it a lot. I think it's great. It certainly shits down my number nine sword,",
            "start": 834.96
        },
        {
            "text": "but you go check that out. See if the price is appropriate for you. whatever it's priced at. Uh, hope you enjoyed. I like it a lot. I think it's great. It certainly shits down my number nine sword, that's for sure. Uh, keep it tuned for more let's plays right here on uh, youtube.com/kind of funny games. We appreciate you. We'll see you next time. Okay.",
            "start": 913.84
        }
    ]
}