{
    "id": 414,
    "video_id": "cLSx_33dxeA",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Limeade Oreo Cookie Review - Oreo Oration",
    "description": "Is there a new king of Limeade?\n\nThis episode is because of your support on Patreon. Thank you: http://www.patreon.com/kindafunny\n\nSUBSCRIBE / LIKE / SHARE / BUY A SHIRT: http://www.districtlines.com/kindafunny\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Whenever a noteworthy cookie comes, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/kindafunny?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1413615604,
    "duration": 451,
    "transcript_chunks": [
        {
            "text": "[ Music] what's up everybody? Welcome to Oreo Oration. I'm Greg, and while you were out living your life, the fine people at Oreo are making endless variations to Milk's favorite cookie. So whenever a new cool flavor comes around, and thanks to your support on Patreon, I tear open a new package and give you a tasty review without any calories. If you like that, like the video, share us with your friends, and subscribe to Kinda Funny on YouTube. Today we're reviewing Limeade Oreos. Now here's the thing, ladies and gents, these neon green jerks have been all up in the news. People have been tweeting me for a while now saying, where you get the L ? What the thing about it? Oreo of course is crazy. We've known this for a while. They they they they're just insane over there putting out new flavors all the time. I have no idea why lime is one. I would have never predicted. I of course am from the Chicagoland area, went to school in Missouri. Limeade of course to me is Sonic. I I didn't think many people knew about lime",
            "start": 0.55
        },
        {
            "text": "no idea why lime is one. I would have never predicted. I of course am from the Chicag oland area, went to school in Missouri. Limeade of course to me is Sonic. I I didn't think many people knew about limeades outside of that, but here we are and it's all set to go. Uh of course, every Oreo Oration begins with the patented first look and there they are in all their neon glory. Of course, the bouquet of any oration First Look is a big part here. All right, I'm getting no hints so far of limeade. What I'm getting is the shortbread cookie, you know it well from the oration. If we look again at the first look, it looks like we got screwed over. We're missing a cookie there, but they are all intact, which is always a big part and who doesn't like that's always like leave some leave some room for for the Holy Ghost as they say. Um so yeah, good first look. They're all intact. I wish the smell was a bit stronger, but we can uh jump officially right to taste. There's a lot going on. It's more complex than you think.",
            "start": 43.56
        },
        {
            "text": "as they say. Um so yeah, good first look. They're all intact. I wish the smell was a bit stronger, but we can uh jump officially right to taste. There's a lot going on. It's more complex than you think. When I first bit into it, I was already ready to go, nope. But then it you mull it on your tongue a bit longer and you get that limeade taste here . Hold on. It's very sweet. I would say on on that last second bite there, it felt like my tongue was having a seizure, like it was like vibrating around cuz there was so much going on. Still, it's still cooking. That's it's dominated by the shortbread taste. You look at it, of course, this is back to one of the ones like I was I said in the pumpkin spice one that they seem like they didn't they had a normal amount of Oreo filling when usually these crazy ass flavors have double stuffed amounts. That's a double stuffed amount if I've ever seen one right there. You're not tricking me, Nabisco. What it it reminds me of more than limeade, like a sherbet. It tastes it tastes",
            "start": 89.8
        },
        {
            "text": "double stuffed amounts. That's a double stuffed amount if I've ever seen one right there. You're not tricking me , Nabisco. What it it reminds me of more than limeade, like a sherbet. It tastes it tastes like a when the green part of sherbet, you know, sherbet comes different colors. It's got the Limey the lime taste. I'm a bit perplexed. I like the taste, but I don't love it and I don't know where I would when would I eat this cookie? At what point am I like craving a limeade right now? Ch's out in that. Uh yeah, I don't know. I don't understand. You see then you you get a hard swallow there, you get more lime taste. I'm perplexed. This is the first oration where I am perplexed. Put it on the board, perplexed. Let's see how pairs with milk, of course, a big part of the oration here and my brand new mug, Districtlines .com, Kinda Funny. Ah of course, now we go to the maoy moment. One, two, three, I a go high pitched, but whatever. Wow, the whole thing just exploded in my hand again. The milk seems like it's muting the taste",
            "start": 159.64
        },
        {
            "text": "Kinda Funny. Ah of course, now we go to the maoy moment. One, two, three, I a go high pitched, but whatever. Wow, the whole thing just exploded in my hand again. The milk seems like it's muting the taste of the limeade cream. It exploded in my hand when I bit into it maybe because it was it we had weakened its outer shell. It's always a big problem with Oreos and eggs. Uh let's see how it goes on the twist test. Two out of three, one clean break, two clean. You don't have to worry about These Guys. These guys are Pros. Now I'm now want to see we're going to go double stuff, which is really a quadruple stuff of lime, see what happens and you know what I don't want to do that. I'm going to do something different here. I just want to taste the cream. I just want all this cream in my mouth. There you go. What has anybody ever done a reverse you think where they put the cream on the outside and the cookie on the inside and it's like a crazy ass we do that one day. It's perplexing. I feel like 90% of consuming the",
            "start": 227.04
        },
        {
            "text": "ever done a reverse you think where they put the cream on the outside and the cookie on the inside and it's like a crazy ass we do that one day. It's perplexing. I feel like 90% of consuming the cream has 10% of the flavor. I'm I you know, it's not until the very end that I taste any of the flavor on this cookie, but I like it still, but I don't love it. What is going on? How can this be? Final score time, of course. Pop it up. The first look good, it's intact . The taste test good in the end, but in the beginning it's a long it's a long winding stretch to nothing similar to these episodes. Milk pairing shatters in my hand. Twist tests good. 65, they're okay. I again, I could see I could see a day where these are on a table. Maybe I'm at a catian, some kind of dance, a prom, a sweet 16, the party where you're 18, maybe someone's 21st birthday. They have these out there on a hot summer day. All the girls are in white sundresses. I'm in a sear sucker suit with a hat and a monol and a little pipe. I can see these are",
            "start": 282.28
        },
        {
            "text": "someone's 21st birthday. They have these out there on a hot summer day. All the girls are in white sundresses. I'm in a sear sucker suit with a hat and a monol and a little pipe. I can see these are out there. That makes sense. It's a it's a light it's a light summery treat, but at no point am I knocking down the door to Target and being like, hey, give me more of them limeades. No, doesn't happen the way. So that's the way the cookie crumbles for Limeade Oreos. But ladies and gentlemen, let me know what you think of this cookie. Tell me in the comments. Make sure you share this video with your friends. Uh the big thing you need to do is when you see Oreos in your neck of the woods, let me know what they are so I can get them review them on the show, continue our Oreo journey together. Uh call them out in the comments, do everything like that. Go support us on Patreon. That's the whole reason these episodes of Oreo Oration are happening. Thank you so much for that and then until next time, keep on dunking.",
            "start": 368.96
        },
        {
            "text": "the comments, do everything like that. Go support us on Patreon. That's the whole reason these episodes of Oreo Oration are happening. Thank you so much for that and then until next time, keep on dunking. Cheers to your catian 21st birthday dance with the white [Music] [Applause] [Music] dress.",
            "start": 409.04
        }
    ]
}