{
    "id": 428,
    "video_id": "dQyqUb7mM5E",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What is the Next Human Evolution? - The GameOverGreggy Show Ep. 47 (Pt. 4)",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1414566005,
    "duration": 588,
    "transcript_chunks": [
        {
            "text": "Nick , yo, what's your topic? Well, now I gotta find it. My topic, of course, comes, we went through a lot of topics today, so bear with me. My topic comes from Twitter, of course. If you have topics for the show, make sure to follow me and tweet at me, Nick Sc arpino. Like, I don't even know how to say this, G-O-T-U-E-I-G-O-T- A-K. What will humans lose or gain in the next stages of our evolution? You think we're going to lose nipples, gain them? We're going to gain more like nipples, like Pella, like when they have those big nipples that just come down their body and they look like buttons on a freaking suit? Yeah, no, I think dudes are LED suit. No, think so? Mhm. Have they even started? Have dudes started being born without nips? How many dudes without nips do you know? Well, see, now I'm excited to hear what your genius answer is, Greg. What if people started being born without doing touche, no ears? Oh, all those people without ears, we're going to lose. All right, good call, good call, good call. Yeah, the nips, the",
            "start": 1.1
        },
        {
            "text": "Genius answer is, Greg, what if people started being born without doing touche, no ears? Oh, all those people without ears, we're going to lose. All right, good call, good call, good call. Yeah, the nips, the nips is what you think they'll lose. What do you think they're going to gain? Because if we lose the nips, we, we have to, we're losing them for a reason, right? Guys don't need them anymore. That's not how evolution works. Yeah, that is how evolution works. You lose something to gain something else. No, you don't, not to gain something else, but you lose, this is an RPG where you only have so many SL. You gain something or you mutate because of a condition or set of circumstances that makes your specific gene pool more, you know, acclimated or stronger against that thing. We don't need nipples, so event we lose the nips, gain flight. Okay, I don't think we need, I don't think I should, I should have gone first if we wanted to take this topic anywhere close to serious things. We're going to lose intelligence. Oh, I",
            "start": 51.64
        },
        {
            "text": "the nips, gain flight. Okay, I don't think we need, I don't think I should, I should have gone first if we wanted to take this topic anywhere close to serious things. We're going to lose intelligence. Oh, I think your mind, I think we're going to get stupider because here's the thing is, stick with me on this, all right? It's like, you know, survival of the fittest, who's breeding the most? I think stupid people are having more kids than smart people. Yeah, think about it, like, yeah, all this the 16 shows and all the problems we have with all these, but it doesn't say that their kids are going to be stupid. That's a good point, good. And the, you know, but I mean, you do , you're, you have, you have, you know, you're, you got one arm tied behind your back if you're born into poverty and house never went to college, but your capacity is, is your capacity to learn is, is inborn. Your intelligence is based on, you know, your experiences. So, you know, a person that might not seem very smart could have the capacity to be smart, like",
            "start": 92.44
        },
        {
            "text": "capacity is, is your capacity to learn is, is inborn. Your intelligence is based on, you know, your experiences. So, you know, a person that might not seem very smart could have the capacity to be smart, like you said, if the condition was better, nature versus nurture. Sure, nature, nurture. Uh, I think obviously that we're going to become much, much smarter, that we're going to become probably physically weaker and our heads are going to get bigger and all those kinds of things that old sci-fi writers thought, you know, aliens looked like basically because we're going to basically have lesser and lesser need to do things physically. So over, over thousands of years, our bodies are going to, well, robots will have all the parts of our body going to get smaller, no, except for that part stay the same, right? Thank God, damn it. Uh, but I think, you know, I think that there's something to be said about, you know, evolution taking some a species that over thousands years is smart and doesn't need to do anything for itself",
            "start": 134.2
        },
        {
            "text": "damn it. Uh, but I think, you know, I think that there's something to be said about, you know, evolution taking some a species that over thousands years is smart and doesn't need to do anything for itself and has robots and things to do, like whatever, you know, people were going to be like, like, uh , what was that movie, uh, the Pixar movie with the robot, WALL-E? WALL-E, we're all and we're all just fat on vacation for the rest of our lives out in space somewhere. No, I don't think that's going to be the case. I think I think over thousands of years, like we've gotten taller, right? Like over the last few hundred years, like much taller. Mhm. That's all the bananas. That's that's a that's a reflection on our diet and the and the accessibility of bananas. Yes, bananas, accessibility of banana. It's mostly because of the accessibility of meat. Yeah, and and you know, so there we see ways that we can genetically change ourselves by our environment if we look at that in terms of like robots and computers and kind",
            "start": 179.56
        },
        {
            "text": "of the accessibility of meat. Yeah, and and you know, so there we see ways that we can genetically change ourselves by our environment if we look at that in terms of like robots and computers and kind of the think about like something that's physically intensive like mining, right? Mhm. Well, robots will do that. Think about something intensive like putting a machine together, working on an assembly line, robots will, robots will do like, like we really are going in that direction. So it makes you wonder over thousands of years or even hundreds of years how our body's going to respond to that new condition and it means that our brain capacity must be bigger, yeah, to deal with these these new technologies, but we don't need muscles on that on that front. Yeah, I was going to agree with you because look, the amount of information that we have to process on a daily basis now has to be hundreds of times more than it was 100 years ago for the average human being , right? Right. So we are forcing our in order to",
            "start": 218.68
        },
        {
            "text": "amount of information that we have to process on a daily basis now has to be hundreds of times more than it was 100 years ago for the average human being, right? Right. So we are forcing our in order to succeed in these worlds and for our gene pools to live on and and to to flourish, we are forcing ourselves to have to think faster and better and and evolve in that way. And I think that yeah, we're going to get smarter, hopefully taller because that would be lovely for me and yeah, if we can get a robots take my wife out every once in a while. None of the things you're talking about right now, I can't do it now. No, it won't happen 20 years from now. Well, **** evolution, dude. It's not part of the party 201 evolution is, oh, you just won over so many Southern States. We just, we just got Texas. Yeah, I see it's a new southern strategy, evolution. Yeah, yeah, I mean, I I think it's clearly not part of the party. We got, we got Cheetos. It's just weird to think that we the the reason we're, you know, everyone's",
            "start": 260.84
        },
        {
            "text": "a new southern strategy, evolution. Yeah, yeah, I mean, I I think it's clearly not part of the party. We got, we got Cheetos. It's just weird to think that we the the reason we're, you know, everyone's welcome on our party. A good example is North Korean kids and South Korean kids are inches apart in terms of height by the time they reach like 10 years old because North Korean diet is so bad. So like you could like that's why we've talked about before American American GIS, you know, are thousands of us over there still in South Korea on the DMZ. We put our biggest soldiers over there to make it look like we're all that big because they don't know. So they like think, oh, this 6'8 guy is emblematic of every American and we are undernourished and small. And so we see even generationally how the lack of food or the surplus of food like we have in the United States can affect yourself, your size to be bigger or smaller. So I I I do wonder in the in the coming generations how our size will if we do get",
            "start": 303.48
        },
        {
            "text": "food or the surplus of food like we have in the United States can affect yourself, your size to be bigger or smaller. So I I I do wonder in the in the coming generations how our size will if we do get bigger because we have a surplus of food and especially in the United States like we we're very fortunate in the sense, hopefully it doesn't backfire on us one day. We're very fortunate in the sense that we don't have a huge population compared to a lot of places in the world and plenty of room to grow our own food. We're actually pretty self-sustaining in terms of our food stuff. So we're always going to have access to food. So I'd be interested to see like how our kids and grandkids and and their kids and so on become bigger kind of stay the same because there really is a huge difference between go to an old house especially in the east coast . I don't know if you guys have been in old houses. I'm sure you have like they're they like doorways are made for smaller people 200 years ago like you",
            "start": 345.48
        },
        {
            "text": "go to an old house especially in the east coast. I don't know if you guys have been in old houses. I'm sure you have like they're they like doorways are made for smaller people 200 years ago like you could see go into a cathedral that's like a like you know 5 years old or a thousand years old like you'll the the hallways or the stairwells specifically like Germany when you're when you go to the Dome the Dome yeah wento in uh in uh in Florence and I walked you go up at and it's just I mean you're walking up a staircase not the least of which is the most claustrophobic inducing thing in the planet shoulder to shoulder almost maybe you got a little bit more space but I mean the little monks that used to walk up there or the little uh not the monks the priests that used to walk up tiny little guys like my dad like big Lou make think inita our our brain capacity must get bigger but at the same time like I'm I'm not super educated on it but I wonder you know they often say we don't use all",
            "start": 376.8
        },
        {
            "text": "guys like my dad like big Lou make think inita our our brain capacity must get bigger but at the same time like I'm I'm not super educated on it but I wonder you know they often say we don't use all our brain. I wonder if we use what we have first. They made a documentary called Lucy about this. What happens when terrain reaches 100% capacity? I have no idea. Lucy uses it. Oh, I know that was out the waters. It's going to be really awkward showers in like 200 years. What happened? It's going to be really awkward showers because they're going to have bigger brains. It's going to be thinking more. We all know we think a lot in the shower. We do and they're bigger and the shower head's going to be lower than them and that's always really weird. I'm sure you know I know about it. I I I make I never thought about that. Yeah, it's a nightmare suck for you. It's the worst do the thing where you like you know you you roll under ne yeah oh man then it gets in your eyes see for me at at the perfect height the",
            "start": 414.0
        },
        {
            "text": "about that. Yeah, it's a nightmare suck for you. It's the worst do the thing where you like you know you you roll underne yeah oh man then it gets in your eyes see for me at at the perfect height the average height for human beings right it's just like showers are perfect I can't reach the thing to too hot can't turn it down plus you have to I my friend you you don't even have to unlock doors right cuz you can climb through the KE you **** leprechaun it's okay at least people don't run from me they think I'm **** Bear yeah that's right nobody's afraid of youm they ain't afraid of no ghost where are we at right now we're done this topic is done this is it that's that's evolution for you thanks everyone that's a good topic so nipples are going right yeah and we're going to have flight and brains wisdom teeth and append giantes oh yeah wisdom teeth need to get out of here yeah they need it's funny man some people are being born without them or like there only two are coming go it's no",
            "start": 459.44
        },
        {
            "text": "brains, wisdom teeth, and appendicitis. Oh yeah, wisdom teeth need to get out of here. Yeah, they need it. It's funny, man, some people are being born without them or like there only two are coming go it's no it is happening it is definitely like the evolution is definitely doing away with them all right then so that is that is evolution and action all four mine came in none of them impacted which is unbelievable where do we stand on telekinesis is that going to happen some point you have to get rid of the freckles to get that damn you are just burning through these today you want anything else you want to get rid of any other or no I think I'm good can telekinesis ever happen uh yeah probably I I I I I mean probably ask because Colin knows exactly what's going to happen in I often wonder like what is the limit like if we think telekinesis is possible then then yes it could it could happen from a sensient being I guess I just don't know I we don't aren't able to use all our brain we don't",
            "start": 507.4
        },
        {
            "text": "what is the limit like if we think telekinesis is possible then then yes it could it could happen from a sensient being I guess I just don't know I we don't aren't able to use all our brain we don't understand anything that's what we talked about that so many times we don't get anything we don't understand anything you know there's so much we can't see and so much we so yeah I think it's probably I think it's probably that's not telekinesis there's only two things think about it's either twerking or that rapper that he always likes yeah Tone Loc. [Music]",
            "start": 551.36
        }
    ]
}