{
  "id": 426,
  "video_id": "gANEC6iyD1o",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "How Young is Too Young to Date? - The GameOverGreggy Show Ep. 47 (Pt. 5)",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1414652402,
  "duration": 1104,
  "transcript_chunks": [
    {
      "text": "[ Music] Tim, yes, what are you thinking right now for a topic? Right now, what what's your topic? I was making a fun little , making a fun little play on words for people who listen real hard,'cause all I'm thinking about is that damn video and it's amazing . You got a big booty, it's me. So my topic tonight is how young is too young to date, to date. I need to make that clear. That's a good, that's a good clarification. So right now, based on each of us, yes, do you have any set rules? Now pretend you guys, everyone, we're relationship, no relationships. It's just so in this instance, for my own clarity, my wife has died, but she has died in a peaceful way and we were okay with it. That is the only way we okay with that. The only way I'm allowed to date she, there was this, there was she was flying this experimental plane that had it, had a nuke for every one of the American cities and there was a Tess on it and for some reason she didn't just land it or just smash it into the ocean and jump out at the last",
      "start": 1.1
    },
    {
      "text": "plane that had it, had a nuke for every one of the American cities and there was a Tess on it and for some reason she didn't just land it or just smash it into the ocean and jump out at the last second,'cause she had crazy ass abilities. That's how she went down, but she was talking on the radio to you as she went down. Like maybe at some point that he, that she didn't know she could do that until the second movie where for no reason at the beginning of the movie he just does that. He just jumps out of the freaking plane. Is your wife, I mean not he learned, your wife learned that that's just something you could do. But how do you learn that? You just got to do it, right? Yeah, you screwed up once I guess, but you just think you put it down. Annihilation, wouldn't you try it? I really liked you're in the elevator scene. Oh, that elevator scene. All right, your wife's dead, but it's okay. Yes, uh, I'm 32. God, yeah, I'm how old are you? I'm 34, 30, 30 years old, 25. So Tim, for you, so young ages are probably about the same.",
      "start": 58.52
    },
    {
      "text": "no, I'm kidding. I I can't date anyone. I probably couldn't date under 25. If if 25, 10 years, 10 year gap is probably it's probably as far as I can go,'cause when you get, you start getting, 25 is when you start, most people start, I I feel, coming into their own as far as like who they want to be, what they want to do, at least for the next few years of their life and that's someone that I can, I think I could start to grow with or at least get behind, in front of, underneath, um, whatever support I help support with my hands. Uh, 25, I'm saying 25. Yeah, okay, that's that's as low as I'll go. My answer is a moving target, my brother's age. So my brother is two and a half years younger than me. Okay, so for me it's, so he's 22 right now. Yeah, so 22, so 22, but next year will'll be 23, next year will be 24. Interesting. I don't",
      "start": 97.28
    },
    {
      "text": "my brother's age. So my brother is two and a half years younger than me. Okay, so for me it's, so he's 22 right now. Yeah, so 2 2, so 22, but next year will'll be 23, next year will be 24. Interesting. I don't think I can go younger than my brother. Now there's been cases where there's been people that are my brother's age, but a couple months younger than him, I'm okay with that. So they can be younger than my brother, just not a year younger than my brother. Two years isn't that bad. I don't know why you're making that. Well, so here's my thing. You have to realize that I'm still pretty young in the grand scheme of things. So to me, high school wasn't that long ago. So when I think about it, I'm like, you know, when you're a senior and there's a junior, that's a big deal. It's like, damn, there are generations behind you, you know? And as you go on, like I feel like that gap gets much wider where it's like people in your age group are, it's a lot more years in there, you know? Sure. Um, so I've always had this thing of my",
      "start": 152.8
    },
    {
      "text": "you know? And as you go on, like I feel like that gap gets much wider where it's like people in your age group are, it's a lot more years in there, you know? Sure. Um, so I've always had this thing of my brother's age, but it wasn't until I thought about this topic today that I was like, would I go younger? Like what if there was someone that was super awesome and well, yeah, obviously it depends on the person. If some, if I met an amazing human being, I'm like, I don't really care how old you are. That's the big thing for me, especially not being in the situation for real, you know what I mean? Having a girlfriend, yada y y is like, yeah, I don't have a number in my head. I've never thought of this. I've never sat there and been like , oh man, I would never date someone below this, you know what I mean? What if she was 18 then we start, I mean, is she cool? She's a cool 18-year-old. Oh yeah, like we're hitting it off and we're trying. Yeah, it's people going to think you're scum. She's people think I'm a scumbag",
      "start": 194.6
    },
    {
      "text": "if she was 18 then we start, I mean, is she cool? She's a cool 18-year-old. Oh yeah, like we're hitting it off and we're trying. Yeah, it's people going to think you're scum. She's people think I'm a scumbag no matter what,'cause I am a scumbag best friends anyways. Uh, I mean, I don't know, like I don't, I don't know. I've never, I've never thought of this literally really until right now. I feel like this is a thing. Here's the thing about your, here's the thing for you though, Tim, it it will, that gap, that gap will widen as you get older because you know, as you hit 28, 23, 24 still okay, 30, 23, 24 still, you see what I'm saying? Like as you get a little older, like you'll you'll hit that gap. I think 10 years once you hit your 30s probably as far as you want to go in either direction. But so for me it's like when I when now I look at 20 year olds, my I'm like, you look like a little kid. My point was this though, like, but my thing is I don't even know any 20-year-olds. I have know, I don't even know what a 20-year-old",
      "start": 234.08
    },
    {
      "text": "now I look at 20 year olds, my I'm like, you look like a little kid. My point was this though, like , but my thing is I don't even know any 20-year-olds. I have know, I don't even know what a 20-year-old looks like right now. I remember when you started, you look like a baby. But I was, I was how many years ago? Should I type in 20-year-old? No, you should not type in 20-year-old in Google. I don't know. I mean, for me it'd be a weird thing if you were under 21 for sure,'cause then we you can't drink, we can't go out and get a drink somewhere. That's a weird thing. All of our lives revolve around and then if I mean if we're thinking about, I remember what I was like yet in 21 and what I was like in college, right? Like I would not, I wouldn't be hitting it off for the girl that's in college right now. I'd imagine grad school maybe or whatever. See, but remember when you were young and everyone just kept like all the old people were just like, oh, like you're a little kid, you have so much learning to do and blah blah",
      "start": 280.68
    },
    {
      "text": "school maybe or whatever. See, but remember when you were young and everyone just kept like all the old people were just like, oh, like you're a little kid, you have so much learning to do and blah blah blah, like whatever and you're just like, **** you, I hate wrong. Now you look back at it, you're like, oh, some of them were right, some of them are ****. Um, but that's generally the way life works exactly. But I think for me it's like looking back on it, I'm like, well , I don't know if I could be with an 18, 19, 20 year old. You can't because you can't, no, they're not mature. They don't, they're just not mature for me. Like 22 even going forward , even if it wasn't my brother's age, I don't know if I could be with the 22-year-old now. You're talking about a relationship, right? Yes, yeah, I mean if you're into a hardcore long-term relationship, yeah, I mean think about what you were like at 22. Yeah, that's different for you. Yeah, that's a whole, that's a different, I don't know if I can do 22. That's a big thing",
      "start": 318.04
    },
    {
      "text": "a hardcore long-term relationship, yeah, I mean think about what you were like at 22. Yeah, that's different for you. Yeah, that's a whole, that's a different, I don't know if I can do 22. That's a big thing though, because first of all, I'm just laugh with Port looks **** tuckered out right now. He's had a rough day of protecting house, doing nothing. He's been sleeping, he's been protecting the house. Uh, but that was the thing I was thinking is that like around Tim's age is when I stopped in retrospect being embarrassed in retrospect , if that makes any sense. Like think about yourself when you're 20, you're like, oh, what the **** was I doing, you know? Like 22, oh, what the **** was I doing? 24, what the **** was I doing? 25, 26 when I started like looking back and being like, I think I was all right, you know? And so that's what I think about with a woman that you know, that kind of post college age couple years later pretty essential because when I was in college or getting just out of college, I was a",
      "start": 360.24
    },
    {
      "text": "know? And so that's what I think about with a woman that you know, that kind of post college age couple years later pretty essential because when I was in college or getting just out of college, I was a **** idiot. I'm still look back at some of the things I've done even the last year or two and I'm like, like I have a lot to learn. So if I was in that state then certainly that's not uncommon and therefore you don't want to be with a person like that. You want to be with like a crazy person, you know, or a person that's still finding themselves or a person that doesn't really know who they are. So the mid 20s is probably a pretty good place to stick and that that it gets creepy when you get older because you could say that that number never moves at that point that you're 50, 25 year old, but you don't. That's there was there was some, I forget who it was that put out some some somebody put out, yeah, stud, you know what I'm going with this where it was like they asked men and women throughout the ages",
      "start": 396.96
    },
    {
      "text": "that's there was there was some, I forget who it was that put out some some somebody put out, yeah, stud, you know what I'm going with this where it was like they asked men and women throughout the ages what what age you find and women's track with them and men's 23, 23, 23, 23, 23. I'm like it was like w that's weird. Yeah, that's not that weird I guess, but you got to think about it in terms of sustainability, not in terms of your sexuality, you know? Like well that's the problem is most guys hit they try for that sustainability, they try for that first relationship for whatever reason it fails and they think, oh, I'll just reset the clock with the 23 year old because then at least I'll have those first 10 to 20 good years like I had with my first wife and she'll take care of me when I'm you know, in diapers, but she'll only be 40 which which just it never works out. It's so weird try to make your relationship. I always wonder in those situations like we always talk about why would that guy, you know, that's",
      "start": 434.64
    },
    {
      "text": "but she'll only be 40 which which just it never works out. It's so weird try to make your relationship. I always wonder in those situations like we always talk about why would that guy, you know, that's so gross that that guy with that woman, but why is that woman with that guy? And I think we always default like well it's money or some sort of material game, but I don't think so. Like I think there's also something about a woman and I don't know because I don't have obviously the woman's mind, but or body unfortunately, no unfortunately, but but there's something I think women like older men and men like younger women and it's it's interesting how and I'm not saying that's for everybody, but I'm saying that seems to be like a theme and like it's it's interesting that they conflict. Yeah, like like universally like it's a it's a conflict, you know? Like I'm not saying that's the same for every woman and every man, but it just seems like he always talk about the the man with the younger woman or the",
      "start": 477.88
    },
    {
      "text": "like it's a it's a conflict, you know? Like I'm not saying that's the same for every woman and every man, but it just seems like he always talk about the the man with the younger woman or the woman with the stereotype. I mean it is just it's a cliche. It's it's the guy that wants to feel young again. Oh, she makes me feel young like Alec Baldwin with his 25 year old or 26 year old yoga instructor that's now pregnant with his trials. You're like I mean good for you Alec Baldwin, you're losing weight, feeling healthy, it's great, but the same time down trim. Yeah, he she she's getting him down, she's getting him down. Uh, but you know you had Kim Basinger, so it's like she was gorgeous and you couldn't you know something about that fell apart. It's sad. I don't know. Well it's more than looks of relationships. Well let's flip it now. All right, how old would you go? Like what's the oldest you would go? See normally I wouldn't go again over 10, but there's something about Helen Mirren that just I thought I saw her",
      "start": 510.48
    },
    {
      "text": "let's flip it now. All right, how old would you go? Like what's the oldest you would go? See normally I wouldn't go again over 10, but there's something about Helen Mirren that just I thought I saw her walking down the Embarcadero the other day. I was like, is that Helen Mirren? I almost crashed my car to go out and say what's up to her. Probably wasn't her to say what's up to her. What's up? If knows that Helen Mirren was in San Francisco, please let me know and I will I will just shoot myself. That's the Tim Burton's wife. No, that's uh Helena Bonham Carter. Helen Mirren is the woman that played the queen. She was also in the movie uh Red with Bruce Willis. She played the older woman who was like the assassin, but she's just the best. How old is she? Oh, she must be in her late 60s, early 70s. Damn Nick, she's hot. Look up her picture, she's hot. See, I'm I saw her in person 70s. I saw a picture of her. I mean I saw her in person and she was gorgeous, gorgeous. Again, I feel you buddy. Never thinking of this. I I immediately jump",
      "start": 549.28
    },
    {
      "text": "her picture, she's hot. See, I'm I saw her in person 70s. I saw a picture of her. I mean I saw her in person and she was gorgeous, gorgeous. Again, I feel you buddy. Never thinking of this. I I immediately jump to who who do I think is attractive, who is an older woman? I jump to Diane Lane and she's 49 at the moment. Hot Lane. Oh yeah, I know her. Oh my God, watch Unfaithful. Holy **** Jesus. Unfaithful makes you want to cheat on your wife. Great, totally. Yeah, right here big dog. I don't agree. Uh, but no, I remember Unfaithful that it was one of those movies you were talking earlier about sneaking into Super Troopers. Me and a friend finished a movie and we're like, oh, we got time to kill to because we were it was one of the things where we went out with a group of girls, they went inside a different movie when and they had like another 40 minutes in their movie like all right, we'll jump in something else like oh Unfaithful. I'm like, I hear their sex and that you're like, oh man, maybe we can catch them if we",
      "start": 591.08
    },
    {
      "text": "and they had like another 40 minutes in their movie like all right, we'll jump in something else like oh Unfaithful. I'm like, I hear their sex and that you're like, oh man, maybe we can catch them if we walked in we're in high school by the way and we walk in and we if you've seen two years ago spoil spoiler for Unfaithful, we walk into at the scene where she's Diane Lane is getting getting it from behind in the like the hallway of the apartment building but in front of a picture window so it's just like blinding white sunlight is we so we come in at this moment and literally we clear that part where you know where like it angles down you come out and literally the entire theater of adults just turns and looks at us and we just look at them we just back out slowly just like we are not supposed to be here right now. What a **** hot movie. Just as an update, Helen Mirren is 69. Let me see her. I I don't know what she looks like. Also shout out to to Dame Judy Dench. She plays M in uh she up until",
      "start": 634.68
    },
    {
      "text": "to be here right now. What a **** hot movie. Just as an update, Helen Mirren is 69. Let me see her. I I don't know what she looks like. Also shout out to to Dame Judy Dench. She plays M in uh she up until Skyfall spoilers. How you're you're how old are you? 35. I'm 34, 34. This is she 69, so she was 35 years old when you born. Yeah, she's a good looking lady. She's she's she was 35 when you were born. Yeah, Budd look at that mean this woman just gorgeous trying to find a get attracted she's just gorgeous. I know she is hot. She's definitely hot for an older woman. She's I mean you need the foreign older woman part in there. No you don't. She's hot in general. I'm putting this in there, but it's it's getting to the point where that's going to fall apart a few years. I'm just saying look at look at how good I mean she has aged well. She keeps her she keeps her body in good. I would have loved if you crashed the car to speak to this woman. This would have been the best thing like you're an idiot because I'm a huge",
      "start": 673.32
    },
    {
      "text": "she has aged well. She keeps her she keeps her body in good. I would have loved if you crashed the car to speak to this woman. This would have been the best thing like you're an idiot because I'm a huge celebrity and I like no, but you have to have coffee with me and she would so endeared by it with me and then I would have been like we are friends forever and maybe we might have a small thing on the side. It's not a big deal. Uh, the answer to your question by the way is right now is 40. You think years? Yeah, I think that's I think that's a good play. I mean it's so funny because a 40-year-old and a 30-year-old are in such different places. You assume it's just an assumption, but if if you're getting with a 40-year-old woman, maybe she's divorced, maybe she has kids, maybe not, maybe she never, you know, there's so many unanswered questions that relieve so many so many wh ifs and could bees. I'm just smiling because of the grin you have. You have the **** eating grin as you like spin this tail over here.",
      "start": 723.28
    },
    {
      "text": "so many unanswered questions that relieve so many so many wh ifs and could bees. I'm just smiling because of the grin you have. You have the **** eating grin as you like spin this tail over here. See for me, I think my answer is like two years. Jesus Tim, your window is so, but like I to me, I think 2 years older than me is like the perfect the perfect hit right there where it's just like that is what I'm looking for and it's always that way. It's perpetual. So when you're 30 it'll be 32. That's a good mentality to have. Go for the old, go for the older woman. Not two years. You can you can broaden out a little bit more than that older than that man. Oh yeah, like'cause here's the thing like I think two is what like to me like the my ideal out of planner you are thinking way too long term. You can't do that. You just have to meet the person and if they're like two to three years'cause I know your heads at you're like well when I'm 40 then she'll be like 42 and then it's like I got to throw her out. You don't",
      "start": 760.16
    },
    {
      "text": "you just have to meet the person and if they're like two to three years'cause I know your heads at you're like well when I'm 40 then she'll be like 42 and then it's like I got to throw her out. You don't have to do that. You can have you can have a good longlasting relationship with anyone as long as you try at it. No, I get that. I just want them to be two years older than me. That's weird. Yeah, but you're in your early 20s and there is such a difference in your 20s between even the year even a year in your 20s is like a is like a decade. You hit 30 everything slows down a little bit and everyone's kind of like a 3 0-year-old can be at on the same level success wise maturity wise as a 40-year-old doesn't matter, but the difference between 20 and 21 or 21 and 22 20 you know 22 to 28 is like a huge margin in my opinion at least. I agree that's what I was trying to say is I think Tim's in the age now where things are starting to even out a little bit. Yeah, 30 actually after 30 doesn't matter anymore",
      "start": 810.64
    },
    {
      "text": "in my opinion at least. I agree that's what I was trying to say is I think Tim's in the age now where things are starting to even out a little bit. Yeah, 30 actually after 30 doesn't matter anymore be like 10 years older than me 35 whoever it doesn't matter like I can't imagine being with you you know imagine being with him I a very sensitive lover I am attentive I will take you out beforehand if you want a bigger popcorn and a bigger DC of the movie you got but you want that yeah it's about having someone that wants what you want Red Vines bang although they changed the packaging guys I got I gotta be honest with you you you said this to me and and it catalyzed a thought in my head that I hope you know to to you know we don't want to give too too much away to the listeners and viewers out there but we're we're playing around with an idea of a movie show and doing something maybe next year with with you know going to the movies and talking about new movies and stuff like that and I like",
      "start": 850.28
    },
    {
      "text": "but we're we're playing around with an idea of a movie show and doing something maybe next year with with you know going to the movies and talking about new movies and stuff like that and I like the idea of us just going to the movies what is your habit at the movies what what does everyone do with the mov no no no this is a separate topic you can sit on that till next week write it down on your phone just it just thought just that's a great one put the phone put put it right up of calendar put in my phone next to the rest of my thank you I'm just just thinking about that it's a great topic I would I'll will talk to you for the next 45 minutes on that topic'cause I have my thoughts I'm sure we'll go it later I really have no doubt about it there you go ladies and gentlemen a teaser for the next episode of The GameOverGreggy Show thank you so much for joining us for this episode of The GameOverGreggy Show remember each and every Friday sometimes four sometimes five best friends gather",
      "start": 891.64
    },
    {
      "text": "episode of The GameOverGreggy Show thank you so much for joining us for this episode of The GameOverGreggy Show remember each and every Friday sometimes four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement you can pick up the MP3 or the video over on patreon.com/kindafunny along with Vimeo and Bandcamp, but if you don't want to give us any money we understand times are tough you can go to youtube.com/kindafunny when we break the topics out topic by topic day by day every day of that next week by day I don't know if you mentioned this in the beginning because this has been a long and amazing show this really good one I meant to say it was worth a dollar before we started yeah this one's definitely worth the dollar to8 but but I don't know if you mentioned some guy driving his car he's just like no this was the uh the the Patreon exclusive episode goes live this week oh right I forgot I didn't I forgot about that you're",
      "start": 933.72
    },
    {
      "text": "I don't know if you mentioned some guy driving his car he's just like no this was the uh the the Patreon exclusive episode goes live this week oh right I forgot I didn't I forgot about that you're there we go so did we decide a day do you want to put no we don't know a day I think think we should still put it up Friday October 31st so two on Friday well yeah but I mean by this point the P okay oh I see what you're saying I see what you're saying the Patreon people would be on Wednesday yeah let's do Wednesday Wednesday the 29th 29th yeah Wednesday 29th October 29th Wednesday Oh see it says see you next Wednesday what music video what is it again it says see you next Wednesday it's Written in Blood Thriller thank you there it is nailed **** high five damn you hate me until you need me you see what I'm saying I didn't anyway a Patreon exclusive episode an entire episod October 29th yes for brand new topics yes only place to get him is on Patreon go over to Patreon what's the is there",
      "start": 971.68
    },
    {
      "text": "see what I'm saying I didn't anyway a Patreon exclusive episode an entire episod October 29th yes for brand new topics yes only place to get him is on Patreon go over to Patreon what's the is there a tier for that or is that just everybody thing Patreon people you get that whether it be a dollar or $3,000 you get that yeah so if you want that and you're not a Patreon person pay a dollar yeah good point good point yeah great great job if it's $3,000 though I will do a dance for you the next time we do a Patreon and the the important thing to point out if you're well that doesn't count for that one actually I was going to say for the Patreon exclusive content you'd be able to get like the Patreon live stream we did tonight you'd be able to get but no that's 155 up so you have to get $15 to get that one so yeah you should do that if you want it sounds like a Patreon plug we'll stop right now ladies and gentlemen until next week when I will not be here oh man I'm not host I'm giving the",
      "start": 1025.6
    },
    {
      "text": "get that one so yeah you should do that if you want it sounds like a Patreon plug we'll stop right now ladies and gentlemen until next week when I will not be here oh man I'm not host I'm giving the key to you guys who's going to be in the fourth chair who knows I it's going to be the the show ding ding that's see it's the intro but I took out the middle day I like I like that name this that was like a name this tune kind of thing yeah kind of it's been our pleasure to serve you [Music]",
      "start": 1066.36
    }
  ]
}
