{
    "id": 421,
    "video_id": "O28j7Sp-zMo",
    "show_name": "Portillo",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Portillo the Wiener Dog Eats a Stick - Barkbox Unboxing October 2014",
    "description": "Portillo ain't 'fraid of no ghost.\n\nGet 10 percent off your Barkbox subscription at http://www.barkbox.com/gameovergreggy.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=kindafunny\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1414220400,
    "duration": 312,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Greg Miller and this is the star of the GameOverGreggy show, Portillo the wiener dog. If his cries weren't alerting you to it, of course, it's that time of the month when a new BarkBox comes and we unbox it for you. Not yet , Portillo, not yet. Don't do I know. Oh my god. Of course, you can go to barkbox.com/gameovergreg gy. You'll get 10% off your BarkBox subscription. BarkBox is simple. Every month, the 15th of the month, they send you a box filled with dog goodies and your dog will learn to go crazy like mine has right now. Look at him, just insane in the head, doesn't know what to do, knows he's about to have the best moments of his fleeting life and existence. He's shaking so hard from it. Prill , are you ready? Go. What's in there? What's in this month's? Oh, it's Halloween themed. You got a bat. You got bats on it. You oh, you got a little you got a toy already. You're getting into right away. Little soft guy . Oh, it looks like a kitty of some kind. This is the plush puppy Invincible Cat.",
            "start": 0.12
        },
        {
            "text": "got a bat. You got bats on it. You oh, you got a little you got a toy already. You're getting into right away. Little soft guy. Oh, it looks like a kitty of some kind. This is the plush puppy Invincible Cat. Portillo already doesn't like it. He I mean he likes it, he just you know, hates cats. He's a wiener dog. Dogs aren't supposed to like cats. Let him go at that one. Get it, Fred. Get it. What's that? Oh, that noise, Freddy. Oh, you're going to get him treat him and show them what you do at a cat party. What you do a cat party. All right, Portillo will tear this thing apart in 2.5 seconds. This will not survive the next GameOverGreggy show, I imagine, available here on youtube.com/kindafunny. See what else happen. Okay. Okay, Portillo, of course, Py is a fat ass. He's proud member of Team Fat, of course. Let's see, we got all sorts of dog stuff here. We right, whoa, whoa, whoa, calm down, P. Calm down. We're always two point seconds away from loing. This is a Twist Sticks. Get give you one seal, just back off. I'll let you pick your",
            "start": 38.36
        },
        {
            "text": "sorts of dog stuff here. We right, whoa, whoa, whoa, calm down, P. Calm down. We're always two point seconds away from loing. This is a Twist Sticks. Get give you one seal, just back off. I'll let you pick your own. All right, Pill , you get pick of the litter. Get in there. Get one. There you go. There you go. There you go. Looks like a big old cigar. What's the Twist Sticks all about? Twist Sticks peanut and Caribou chew treats as a taste as tasty as a peanut butter cup, but actually good for your teeth, made in Texas and ideal for pups with gluten allergies. Really got to worry about the dogs with the gluten allergies now too. First more you already know this. I made the mistake of course where I gave Pello the treats and now there's another toy here. We have a ghost. This is the simply phto ghost with organic cotton aof free DED. Hey, hey, hey, he does not care. He's got a he's got a food. He only cares about the food at this point. Superior Farms lamb knickknacks chew. Don't bring up Knack in here. It's a dirty word",
            "start": 84.68
        },
        {
            "text": "aof free DED. Hey, hey, hey, he does not care. He's got a he's got a food. He only cares about the food at this point. Superior Farms lamb knickknacks chew. Don't bring up Knack in here. It's a dirty word in this house. So the end product is all natural and perfect for dogs with sensitive tummies or protein allergies. How are all these dogs this sick? How are dogs allergic to everything? Aren't they supposed to be descendants of wolves? He is into this Twist Sticks, so we'll see if this can even oh this is like oh oh oh huh huh trade you trade you yeah what do you think of this one what do you think of this twist SS n this is not twist SS what do you think NOP nope we're off this one no we're back to it he doesn't know how what to make oh okay well don't don't jump and die here you go chew on the Raw Hide thing your lamb knick knack patty whack give this dog a bone he doesn't care about this bone at all he's back to the Twistic oh another Edes chew we knew these from one of the other ones this is a",
            "start": 124.2
        },
        {
            "text": "thing your lamb knick knack patty whack give this dog a bone he doesn't care about this bone at all he's back to the Twistic oh another Edes chew we knew these from one of the other ones this is a crunchy duck chew from E des again will Prilla give a rat's ass about it probably not he seems in love with Twist Sticks huh you want that one nope we have a clear winner for this Mon's BarkBox treat of the week it is the Twisti Pella will not stop eating it huh huh stupid you want this one no and finally closing out this one's BarkBox we got our 100% rabbit treat Hair of the Dog they they've been in the BarkBox before we know Hair of the Dog well Patillo generally likes their stuff but again pretty gosh darn obsessed with this it's rabbit jerky so now he is just going to town of his Twist Sticks oh finish oh who who that distracted him oh there we go for the first time ever Twisti is on the back burner it's into the rabbit jerky now with Patilla did you swallow that hole no there's",
            "start": 176.44
        },
        {
            "text": "sticks oh finish oh who who that distracted him oh there we go for the first time ever Twisti is on the back burner it's into the rabbit jerky now with Patilla did you swallow that hole no there's nothing else in my hands you you've taken it all your twist scks is right there let's see what he takes right back to the Twist Sticks this dog is crazy for Twist Sticks so there you have it ladies and gentlemen another BarkBox month in the books Portillo is in love with Twistex he is literally choking on himself trying to eat it all up well he's not literally choking he didn't die on The Twist X he's clearly just inhaling it along with that rabbit jerky he didn't even chew the rabbit jerky that can't be healthy we're worried about these gluten allergies For Dogs what about them just inhaling large pieces of pressed rabbit that's the real concern for me of course spk box is a monthly subscription service each and every 15th of a month they send you a box filled with goodies for your pup",
            "start": 225.08
        },
        {
            "text": "large pieces of pressed rabbit that's the real concern for me of course spk box is a monthly subscription service each and every 15th of a month they send you a box filled with goodies for your pup they come in a whole bunch of sizes if you want to sign up and get 10% off you can go to barkbox.com gameover Greg get 10% off Pell's back now he's done with his Twist scks he's trying to figure out what else he wants to have right back to the rabbit jerky cuz why not he is going to poop in the bed tonight ladies and gentlemen until next time I'm Greg Miller this is the star of the GameOverGreggy show poor Tay of the wiener dog and it's been our pleasure serving you just stop eating",
            "start": 264.28
        }
    ]
}