{
  "id": 408,
  "video_id": "oc-gZXfNQGI",
  "show_name": "Oreo Oration",
  "hosts": ["Greg Miller"],
  "title": "Caramel Apple Oreo Cookie Review - Oreo Oration",
  "description": "All the flavor, none of the wood.\n\nThis episode is because of your support on Patreon. Thank you: http://www.patreon.com/kindafunny\n\nSUBSCRIBE / LIKE / SHARE / BUY A SHIRT: http://www.districtlines.com/kindafunny\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Whenever a noteworthy cookie comes, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/kindafunny?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
  "published_at": 1413010803,
  "duration": 460,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to Oreo Oration. I'm Greg, and while you're out living your life, the fine people at Oreo are making endless variations to Milk's Favorite Cookie. So whenever there's a new flavor in the news, and because of your support on Patreon, I tear open a new package and give you a tasty review without any calories. If you like that, like the video, share it with your friends, subscribe to Kinda Funny on YouTube . Today we're reviewing Caramel Apple Oreos. You, depending on your part of the country, Caramel Apple Oreos, there is an extra A in there, but I grew up caramel, so I'm going to keep saying that. Nick , what do you think? I go caramel. You say caramel? I'm going to go caramel. You're wrong. It's spelled that way. It is, but I don't, I don't think I've ever danging romens looking at it right now. It's there an extra A and now you're you're pronouncing it incorrectly, but Regional, there's a commercial Shack, if you remember Nestle Crunch where he argues about this, it's caramel, it's",
      "start": 0.55
    },
    {
      "text": "it right now. It's there an extra A and now you're you're pronouncing it incorrectly, but Regional, there's a commercial Shack, if you remember Nestle Crunch where he argues about this, it's caramel, it's car RL. Can you you spell whatever you say, sha. Anyways, uh, the Caramel Apple Oreos here, caral Apple apples, the stick you got. Well, hold on, I don't need to talk about it. There it is. You've seen them before, the Granny Smith. They're dunked on thing. Never mind cup of tea. I I have a thing about teeth. I don't want them first off, I don't want them getting broken. I don't want falling out and biting into Apple. It's all gross. You're walking around doing that. Not a fan of that. Um, let's see what actually happens here. These are another ones that you guys will not stop tweeting me about. Thank you so much. Remember to do that. Every Oreo Oreo Oration begins with the patented first look where we tear back Nabisco ceiling technology. All right, again, good first look. They're all there. We didn't get shorted any cookies",
      "start": 44.52
    },
    {
      "text": "do that. Every Oreo Oreo Oration begins with the patented first look where we tear back Nabisco ceiling technology. All right, again, good first look. They're all there. We didn't get shorted any cookies, which I'm always worried about. You see the sharp red standing out though. Let's get the the the bouquet here. Whoa, I guess it could be it could be described as a caramel smell. There's definitely smells going on. Things are emitting from these cookies and it hurt this eye, this eye over here. I I I smelled too hard and this one definitely took the brunt of whatever you want to kale the car carry mels here. All right, let's jump into taste. Where do I want to start? I'm going to go with this guy, this little bastard here. Well, of course, the fun thing about, you know, we're in the first look still. You got it here. Well, I guess we weren't. I just said let's go to taste, but clear now we're going back. Go back. Thank you. Come back. You see you got the green, you got the you got the Brown there, you got the caramel",
      "start": 88.04
    },
    {
      "text": "here. Well, I guess we weren't. I just said let's go to taste, but clear now we're going back. Go back. Thank you. Come back. You see you got the green, you got the you got the Brown there, you got the caramel, you got the Apple flavoring here . It'll be interesting to see we will do taste tests here on oration spoiler alert for the next 15 seconds of your life where I'll take bites out of each side to see if they taste different, but I'll go right down the middle on this guy. That's weird. One day I hold on. It's it's not going to happen. Sorry, it was close where it looked like that finally might be the one that got me not today. One day I'm going to go to Oreo. I'm going to go into Nabisco and I'm going to meet the goddamn Moon wizard they got working there that can make a cookie taste like different things. It tastes like it tastes like a caramel apple. It tastes like you can get the Apple flavoring out of it. It t I don't know how you do it. That tastes like an apple and now granted I've only read about",
      "start": 143.08
    },
    {
      "text": "it tastes like it tastes like a caramel apple. It tastes like you can get the Apple flavoring out of it. It t I don't know how you do it. That tastes like an apple and now granted I've only read about apples in books. I'm kidding. I've eaten an apple once or twice. I'm now I'm going to try eating just a green side. Pretty good cut just green. I like this cookie quite a bit. Ho do it. What kind of sorcery are they using over there, man? Let see how pairs with milk. I just don't get it . It's just it tastes like a caramel apple or at least the candy version of that, you know what I mean? M one moment. Welcome back. One, two, three. Yeah, the milk's taken away. If I had a caramell apple, I wouldn't dunk it into milk period. Everyone knows that. So why would I do it with this cookie? Well, it's part of the test, of course. I have to, but I think this is obviously in a very professional setting in recreational use of the caramel apple Oro, I don't think I'd do it. Okay, let's go to twist test. Best two to three, one, two",
      "start": 193.0
    },
    {
      "text": "I have to, but I think this is obviously in a very professional setting in recreational use of the caramel apple Oro, I don't think I'd do it. Okay, let's go to twist test. Best two to three, one, two nailed it. Come on, that one was already pre-twisted and we might have to eventually have a conversation ladies and gentlemen, fans of the oration, do we need the twist test anymore? I feel like when's the last time we had one that failed? It was like season one. That was two and a half years ago. They've perfected this technology. This seems like it's going to be too much, but for in the interest of some science, yeah, don't do that. That's too much. Tastes a lot like an apple still. Okay, so taste test, they tastes like a goddamn caramel apple. Milk test, I want to do it. Uh, oh, First Look was good. I don't even know this own show. How many episodes have this been done, Nick? 94 94 H um and twist test, they were fine at it is making my teeth ache just like if I ate a bunch of caramel apples like I I just did, but I think",
      "start": 287.32
    },
    {
      "text": "own show. How many episodes have this been done, Nick? 94. 94. H um and twist test, they were fine at it is making my teeth ache just like if I ate a bunch of caramel apples like I I just did, but I think you know, if you enjoy them responsibly, I'm going to go 85, put it up 85 final score for these guys. Really good. They're a Great Cookie. Again, I wouldn't eat too many of them. I've eaten too many in this oration. The double stuff was a terrible idea. This is probably why my teeth hurt right now and are tingling too much, but on a oneoff basis, get you go one by one nom nom nom. They're tasting like little they're tasting like caramel apples. You can't ask for much more. It's on the box. That's what you bought. So that's the way the cookie crumbles for caramel caramel apple Oreos. But what do you think ladies and gentlemen? Let me know in the comments below your thoughts on today's cookie. Then make sure you talk to me about what cookies you're seeing in the wild streets of your town. Go in the comments, tweet",
      "start": 360.2
    },
    {
      "text": "gentlemen. Let me know in the comments below your thoughts on today's cookie. Then make sure you talk to me about what cookies you're seeing in the wild streets of your town. Go in the comments, tweet me, say you saw this Oreo, this is where I live. I'll come get it. We'll put on the oration. We'll score it for you. Then make sure you go to our Patreon page at patreon.com Kinda Funny to give us more support because this episode is only happening because of your support. Then make sure no matter what life throws at you, you make caramel Oreos out of it and keep on dunking [Music] w",
      "start": 410.2
    }
  ]
}
