{
    "id": 213,
    "video_id": "LALu_kkI3TA",
    "show_name": "Gregway",
    "hosts": [
        "Greg Miller"
    ],
    "title": "How to Work in Video Game Journalism - Gregway",
    "description": "Want to get paid to talk about games? Here's how Greg Miller did it.\n\nSUBSCRIBE/LIKE/SHARE/BUY T-SHIRTS: http://www.districtlines.com/gameovergreggy\n\n----------------------\n- Mitch's Tips\nhttp://mitchdyer.tumblr.com/post/72135964880/on-game-journalism\n\n- IGN is AFK (http://games.ign.com/articles/786/786529p1.html)\nThis podcast is dead now, but this episode chronicled how several of us got into the industry.\n\n- The IGN Article (http://games.ign.com/articles/679/679512p1.html)\nYup, we've written about this suff before.\n----------------------\nLeave your questions for Greg as a video response and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nCheck out our Merch Store: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
    "published_at": 1391004004,
    "duration": 589,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to this episode of Gregway, of course. Greg Miller answers one of your questions every Wednesday and Friday. Today's topic comes from Shawn Blackburn, who asks how did you get to work in games journalism? Sean Blackburn, this is a question I think every one of us who works in the games industry and the press side, the Enthusiast press side, has answered a million times. I'm happy to answer it again for everybody else who's ever heard it. I think I've told it on Game On Guy, the podcast. I know I have a form letter I sent to people who wrote in IGN. Mitch Dyer just put up an awesome blog about all of this; Dan Amrich wrote a book called Critical Path. All of these are linked in the description - you get them there. My personal journey though, and stick with me because it was years ago so it's a little bit old and dated but I'll update it with some annotations for you here in real life not in the YouTube video.",
            "start": 0.16
        },
        {
            "text": "There my personal journey through and stick with me cuz it was years ago so it's it's a little bit old and dated but I'll update it with some annotations for you here in real life not on the YouTube, I know nobody clicks on annotations uh. In the fourth grade, I had an issue of GamePro and on the cover was Maximum Carnage and on the inside was a report on The Death and Return of Superman. And of course back in the day magazines like these - these were there was no internet really this is how you got your information so I read it, I read I read this magazine, I saw that you know they listed these games were coming out in the summer and so it was technically summer where I was so there was a month where I came home every day had a note card like this one with all the Toys \"R\" Us and KB Toys and everything else all their phone numbers listed and I would call down the list to see if they had either Maximum Carnage or The Death and Return of Superman for Genesis, of course what we're",
            "start": 40.52
        },
        {
            "text": "everything else all their phone numbers listed and I would call down the list to see if they had either Maximum Carnage or The Death and Return of Superman for Genesis of course what we're talking about they never did they got really sick of me calling every day for a month but I would finish the note card calls and then I would read the magazine cover to cover and finally after a month of doing this it dawned on me that someone got paid to write this magazine someone got paid as a job to write about video games to talk about video games and I walked into the kitchen had in the magazine I'm like Mom I figured out what I want to do with my life I want to write about video games and to my mother's credit she's like okay we'll make that happen of course back in the day we didn't know how that worked how did you make that happen um best we could do was journalism right you think okay they they know how to write they got to be a journalist easy do that it was kind of already in",
            "start": 82.68
        },
        {
            "text": "How that worked, how did you make that happen? Um, best we could do was journalism, right? You think okay, they they know how to write; they got to be a journalist. Easy, do that. It was kind of already in the path of what I probably wanted to do with my life generally figure because I based all my decisions on Clark Kent, the glasses, the hair – I not the body – but of course Superman doesn't have to work out, so that's always what I say: like you know, Superman doesn't work out. So anyways, uh, I went the journalism route; did a whole bunch of stuff in school; uh, went to high school; ran the daily – sorry, the weekly paper there and the five monthly paper there too; and eventually, you know, uh, my teacher, I guess he gave me a pamphlet, and he said if you're serious about this journalism thing, you should go to this uh journalism summer camp kind of thing, and I looked at it, and it was at this place called the University of Missouri, and I looked at the prices, and I was like, \"This is too expensive.\"",
            "start": 118.64
        },
        {
            "text": "Go to this uh journalism summer camp kind of thing and I looked at it and it was at this place called the University of Missouri and I looked at the prices and I was like this is too expensive but I'll go there for school and so I decided to go to journalism school at the University of Missouri because of course I was in the suburb of Chicago um there's two journalism schools everybody talks about right they talk about uh Northwestern uh which is medial uh and that's in Illinois right in the suburbs of Chicago or in Chicago actually sorry and then University of Missouri they always compete back and forth for who's the number one school it's usually Missouri though uh and so I went to Missouri based on the fact that it was cheaper Northwestern was really expensive and it would give me a nice buffer from family and everything else right I I I some people get intimidated right by leaving for school and having to start over I kind of find it refreshing right that I'd be able to go go to a brand",
            "start": 157.8
        },
        {
            "text": "From family and everything else, right? I mean, I I I some people get intimidated by leaving for school and having to start over. I kind of find it refreshing, right? That I'd be able to go to a brand new place and kind of make my own thing. So I went to Missoula, uh, into magazine journalism there to get my major. Went on that path forever, and like it was funny - we'd go around in classes, and people would say, \"Okay, what's your favorite magazine?\" People would throw out Esquire or this or whatever, like The New Republic, all these things. Then they'd get to me, and I'd say Electronic Gaming Monthly, and people in the class would laugh, of course. Being when that was a thing - not in a mean way, just 'cause it was clearly not at all like what everybody else is doing. And I know for some people that that would be bad for them, right? Of course, Greg Miller likes getting laughed at, but what I found to be the most rewarding and cool thing about that is that it immediately gave",
            "start": 194.0
        },
        {
            "text": "for some people that would be bad for them, of course. Greg Miller likes getting laughed at, but what I found to be the most rewarding and cool thing about that is that it immediately gave me a presence within the journalism school - right? People would come and seek me out; they'd have an article they wanted to do, someone wanted to do something for the magazine about The Sims. They'd come and give me the assignment: I had to go there and like beg them for stuff, right? They knew that there was a video game kid around here who wanted to write, who was good at it, so they'd let me do it. Great! So I'm doing all this under the assumption that I'm going to graduate one day with a degree in journalism from the University of Missouri - and I'm going to be able to write my own ticket, right? I'm going to go to EGM, who at the time when I went to college was still in the suburbs of Chicago but eventually moved to San Francisco or I'd",
            "start": 231.48
        },
        {
            "text": "of Missouri and I'm going to be able to write my own ticket, right. I'm going to go to EGM, who at when I went to college was still in the suburbs of Chicago, but eventually move to San Francisco or I'd go to IGN or GameSpot or something like that. I was going to go into one of these big things that I would graduate with a degree from the best school; they'd have to pick me, and so I come to graduation, I get the degree, and I have a summer basically, I have a job locked down in Columbia if I want it, where I'm a daily newspaper reporter or I you know I had that lock up before summer. So then the summer where I still had to do like my Capstone class which was like finishing off all my school work; I was like now that I have a real job in my back pocket, I can shoot for the stars and you know apply to IGN, apply to GameSpot, blah blah blah applied to all those people nobody would touch me with a 10 foot pole, nobody would even give me the courtesy of a rejection letter. Right, I actually had",
            "start": 269.72
        },
        {
            "text": "know apply to IGN apply to games blah blah blah applied to all those people nobody would touch me with a 10 foot pole nobody would even give me the courtesy of a rejection letter right I actually had an uh one phone call with InQuest Gamer for a position right and I couldn't stop talking like there were a spin-off of Wizard Magazine couldn't stop talking and I was like well didn't get that job big surprise um went to The Daily newspaper ended up being there a year and a half what changed for me and what changed everything is that after a year of it The Columbia Daily Tribune gave me a video game column in the Weekly Magazine and a video game blog that I chose to do daily but nobody really cared what I did with it but I was doing it daily writing something about video games and localizing it to Columbia Missouri and trying to make this name for myself there so all that happens it's great uh I apply to IGN and I you know this is I've gone through my Gmail",
            "start": 308.24
        },
        {
            "text": "games and localizing it to Columbia, Missouri, and trying to make a name for myself there. So all that happens is, I apply to IGN, and I you know this is I've gone through my Gmail because I obviously had a misspelled account - God only knows how many times I emailed IGN from it - but applied for a job at IGN, and I went through and ended up getting it. Of course, went through this was my 13th application to IGN on the Gmail account, so I had 12 misses where they didn't even say you're not welcome here; they didn't even respond, which is why I always thought I'd never work at IGN. I was like, \"I'll end up at one of those guys' companies at least talk to you like they...you know.\" Oh man, this is good but you're not good enough, thanks. Uh, but on the 13th time I applied at IGN, I got contacted, interviewed, and hired within 24 hours - all within, literally overnight. My life changed in a 24-hour period; everything was different suddenly out of the blue, and it was crazy, it was great though. But when I got",
            "start": 346.12
        },
        {
            "text": "within 24 hours all within I literally overnight my life my life changed in a 24-hour period everything was different suddenly out of the blue and it was crazy it was great though but when I got out to San Francisco finally I asked uh Greg Miller who had hired me I was like so what changed you know what I mean like I had applied 13 times and this time you guys hire me within 24 hours like what is the difference and he said it was experience right like I'd been applying those other 12 times with uh a clip I had done in the magazine here and then 6 months later a clip I had done here and then 3 months later a clip I had done there I wasn't writing consistently about video games and on that last time I had had the column and blog for 6 months and this was my first time applying with that experience under my belt so all of a sudden they had this wealth of content to go look at and be like oh he's got a voice and he knows what he's doing he's getting better y y they saw that I could do it right",
            "start": 389.68
        },
        {
            "text": "Under my belt, so all of a sudden they had this wealth of content to go look at and be like, \"Oh, he's got a voice and he knows what he's doing; he's getting better.\" Y-y, they saw that I could do it right, that I proved that I could do it. So that's always the advice I give out to everybody else now. This is where I've updated it for the 2014 edition. Right? You should be writing if you want to do what we do – if you want to talk about video games, need to write about video games every day. You know what I mean? Have a blog right; review stuff because reviewing is tough. And if you start now, obviously you're going to get through the crappy parts; you're going to have the shitty reviews out of your system by the time you have to write for a real place. Same thing though – now start a YouTube channel right like what you're watching here is easy. I mean, I've learned in the year and a half I've been doing this quite a bit, and it's awesome, and I love it. But you need to be doing it.",
            "start": 428.56
        },
        {
            "text": "Right, like what you're watching here is easy I know what I mean. I've learned in the year and a half I've been doing this quite a bit, and it's awesome and I love it. But you need to be doing it too - you need to be comfortable talking to a camera right? Because you're on camera, Persona - that's how it works. So go do that start one right now with your webcam or your iPhone, talk into it every day about video games or about whatever it doesn't matter just get comfortable talking then talk more. Podcast with your friends - everybody has a podcast out there, get to it and do it. Be blogging, be podcasting, be making videos, be capturing gameplay now. Be doing gameplay walkthroughs, be doing all of that, and then on top of all of that, get that workplace experience when you're making your own YouTube videos. You are not in it for views when you're making your own reviews - you're not in it for clicks. You are in it to get better and learn what you're doing so that when you apply to places like IGN or GameSpot or Polygon.",
            "start": 462.4
        },
        {
            "text": "in it for views when you're making your own reviews, you're not in it for clicks; you are in it to get better and learn what you're doing so that when you apply to places like IGN or GameSpot or Polygon, or whoever, you can show them I know what I'm doing. I've done it, and I've gotten all the crap out of my system. I'm way better at talking on camera than I would be if I just cold-called you and did it out of the blue. Right? That's what you need to do. Then, if you're making walkthrough videos, go put them in freaking wikis; IGN has a whole bunch of wikis right? If you found, you know, whatever bottle on The Legend of Zelda, and we don't have that video up, go put the video in there. We want that kind of content; that's the way it's supposed to be. So, that is how I got into video game journalism, but never taking no for an answer by learning how to write, and then having no shame – just taking my shirt off whenever I want to. I hope you have an easy time making it happen; it is not an easy road to go down. I'll",
            "start": 500.08
        },
        {
            "text": "no for an answer by learning how to write and then having no shame just taking my shirt off whenever I want to I hope you have an easy time making it happen it is not an easy road to go down I'll tell you right now A lot of people are doing it but what's interesting is a lot of people try to do it but the kids who are super super passionate about it that shines through as soon as you meet them when I met Brian Albert years ago at a Portillo's IGN meet and greet I knew he would work for IGN one day and now he does so that sounds cheesy I'm sure but like if you have the passion and drive you'll easily get into this industry uh that's how Gregway works of course every Friday you leave a comment I answer it thank you so much for your support like subscribe and share and then just man keep watching Greg",
            "start": 532.6
        }
    ]
}