{
    "id": 54,
    "video_id": "hFdlkLLPNN8",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Oreo Cakesters Review: Oreo Oration",
    "description": "Cakesters are like Oreo cookies from a squishy planet. Come see if they're worth your money in the Oreo Oration review.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1360159255,
    "duration": 262,
    "transcript_chunks": [
        {
            "text": "[Music] what's up everybody Welcome to an Oreo oration I'm Greg Miller and while you were out living your life basking in the sunshine or whatever state you live in the fine people at Oreo were making endless variations of milk's favorite cookie so every Wednesday and Friday I tear open a new package and give you a tasty review without any calories if you like that like the video and subscribe to my YouTube channel today we're reviewing Oreo cake Stars well they got out of my hand there are so foreign this is not at all what our normal Oreo oration goes like right ladies and gentlemen we'll stick to the same pattern first look where you got to open it up and see how they're packaged and stuff well this is actually impressive already look at that they're all lined up in a in a little congol line of Oreo cakers we'll get right into one they're prepackaged if I really wanted to I bet I could go out and sell these on the street I won't that's probably frowned upon two cakes in every",
            "start": 0.59
        },
        {
            "text": "congol line of Oreo cakers we'll get right into one they're prepackaged if I really wanted to I bet I could go out and sell these on the street I won't that's probably frowned upon two cakes in every package if you're wondering crack it open now I guess we're into a real first look you got a little bit of a gooey gooey open there I'm not a not a fan anything I open that's immediately gooey like that but whatever and then we're going to open them up wow well look at these guys the first look continues they're gooey on the sides Oreo looking it's you know basically you're trying at home to make an Oreo you make an Oreo cake you put them together and whatever this looks like all we're going to jump right into taste now see how these little guys taste I was expecting not to like them but I would say I want to go as far as say I like them I want to eat them again but you remember you remember snackwells these snackwells cakes were a big thing back in the day the makers of fat-free",
            "start": 42.92
        },
        {
            "text": "but I would say I want to go as far as say I like them I want to eat them again but you remember you remember snackwells these snackwells cakes were a big thing back in the day the makers of fat-free snackwells devil's food cookies apologize for the short supply meanwhile keep enjoying the other variety they kind of got that cake feeling the the snackwells cake but it's also tastes like that snackles thing where you bite into it you're like what am I even eating what is this thing it's got that grainy chocolate thing toing I'm not let's see how it goes with milk see if that changes my mind no not not liking this aftertaste either so we'll do the triple dunk one two three you can just see it splurging milk out there no now it's not even to the you know how I like you watch the show or oration subscribe to us here on YouTube you know that I like the fact that a traditional chocolate sucks in that milk gets a bit soggy this is too soggy not a fan but it's not bad it's not a bad cookie I",
            "start": 88.88
        },
        {
            "text": "subscribe to us here on YouTube you know that I like the fact that a traditional chocolate sucks in that milk gets a bit soggy this is too soggy not a fan but it's not bad it's not a bad cookie I want to say it's bad uh of course next is the twisting test God only knows how this Abomination is going to Fair it's not cuz it's an Abomination but you know it's whatever it's not an Oreo this is just sa oh man it's not it's just that is not an Oreo ladies and gentlemen the cak stir is not in oreo as I'm sure you knew and were well aware that this is not an Oreo so H how do I review not an Oreo on the Oreo o or oration whatever the show is called scale I'm going to go four five not a fan uh it's not well it's not good that's it's poor for sure it's well you shouldn't squeeze them in your hands I guess I squeeze these in my hand but presentation's all off the map The Taste isn't that great after taste isn't that great uh it doesn't pair well with milk and you can't twist them worth a damn so",
            "start": 145.32
        },
        {
            "text": "guess I squeeze these in my hand but presentation's all off the map The Taste isn't that great after taste isn't that great uh it doesn't pair well with milk and you can't twist them worth a damn so we're going to say yeah 4.5 let me get to my card here so that's literally the way the cookie crumbles for the Oreo cakers but what do you think you probably have tried these before leave your review as a video response below like the video then subscribe to my channel now here's the big question ladies and gentlemen I'm or reviewing cak I'm I'm going out of my way to review every Oreo what Oreos am I missing leave it in the comments below along with Where You Are so I know where to get them then please share this video with your friends I'll be back every Wednesday and Friday until I run out of cookies to review but until then keep on dunking I have to wash my hands [Music]",
            "start": 203.56
        }
    ]
}