{
    "id": 692,
    "video_id": "1iKkVmUOaRs",
    "show_name": "Reactions",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Furious 7 Review - Kinda Funny Reacts",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1426629600,
    "duration": 1268,
    "transcript_chunks": [
        {
            "text": "what's up guys I'm Tim Gettys this is Nick Scarpino this is the Furious 7 review that we saw when we saw Furious 7 last night and it was amazing like nine out of ten I have so many of these things that I'm just going to roll around in them on my living room it's a family heirloom it's amazing yeah uh Tim let's talk about before we get into the film there are going to be some spoilers by the way guys I apologize there's no way we can talk about this without having there be a few spoilers we'll try to keep it to a minimum yeah but the thing with the spoilers is it's we're spoiling just like describing singing of this movie and watching very much watching on the big screen a fast movie for Christ sake uh so we go to this we go to a special screening of this movie we sit there for 3 hours we go in and there's a PA system set up and we're thinking who are they going to bring out to talk to us my gut told me was going to be like an executive producer or producer of the film",
            "start": 0.2
        },
        {
            "text": "for 3 hours we go in and there's a PA system set up and we're thinking who are they going to bring out to talk to us my gut told me was going to be like an executive producer or producer of the film hey I'm so and so you never heard of me when I'm producing the film and someone comes out a nice a nice woman comes out to start Talk starts talking to us she's very excited to share this movie with us this is the second screening they've done and then the Crowd Goes Wild as who walks in Tyrese Ty Reese the man himself Roman Pearce himself walks gets us even more excited for the film than I think been Too Furious it was good and then the film starts and it opens um I don't want to spoil this scene too much but it opens in a great great great scene with Jason Statham and that sets up his character and pretty much the tone just shows how badass he is it's this film is completely over the top whereas I think fast six kept a little bit back maybe just a little bit that's the thing when you first",
            "start": 40.28
        },
        {
            "text": "and pretty much the tone just shows how badass he is, it's this film is completely over the top whereas I think Fast & Furious 6 kept a little bit back, maybe just a little bit. That's the thing when you first saw it, you didn't think that, no, that's true, that's true. Compared to uh to Fast 6, Fast & Furious 7 is like on speed, which is hard to believe, it's like if you take all the things you love about Fast and Furious and just condense it and just keep doing it over and over and cut out a lot of the fat, this movie doesn't have much so like yeah let's let's start top level what did you think of it I loved it you loved it yeah I loved it too only most mostly because it's a fast movie um it had some issues I thought largely I think due to the fact that I don't know that they were able to finish the movie they wanted to make because of Paul Walker's death um I think it because I think that like they did a really good job having dealt",
            "start": 81.6
        },
        {
            "text": "that they were able to finish the movie they wanted to make because of Paul Walker's death um I think it because I think that's unfair to say I think that like they did a really good job having dealt with that stuff I think all that stuff was great and we can go into that a little bit but I think that the movie felt a little disjointed it it felt like they weren't really and this is sad to say because we are talking about a Fast and Furious movie it it doesn't feel like they really gave too much of thought to the plot or how characters were getting from the big set pieces um you know you have a little bit of exposition here and there you have you know we've seen the the the Dom and Letty uh relationship come full circle now you know where she's still trying to figure out who she is and he's still in love with her and all that stuff we get to see a little more of their backstory um we have the Paul Walker and Jordana Brewster kind of story where he's you know he's a family man now",
            "start": 125.08
        },
        {
            "text": "in love with her and all that stuff we get to see a little more of their backstory um we have the Paul Walker and Jordana Brewster kind of story where he's you know he's a family man now and and which gives us a great minivan scene yeah he's got a again I don't want to spoil too much say a great scene um but you know the movie is mostly about the big set pieces and that's that's what you're going to see this for you're not going to see a movie for uh uh it's not going to win an Academy Award it's not going to win any any sort of golden gloves for for the writing or even the acting for that matter but it is a phenomenally fun ride while it lasts yeah and it's a lot it's it's like 2 hours long of it's 2 hours and 20 minutes huge set piece to huge set action action and that's the thing is like I kind of disagree with you where I I'm happy there wasn't more Exposition and there wasn't more like why are we going to this place let's talk about why we're going here then let's go it just",
            "start": 160.64
        },
        {
            "text": "like I kind of disagree with you where I'm happy there wasn't more exposition and there wasn't more like why are we going to this place, let's talk about why we're going here then let's go it just kind of was like now we're in Abu Dhabi, who gives a **** that's where the buildings are jump between that's true and it really was hilarious cuz they were you know people like why are you going to Tokyo I was like to bring well you know let's take a step back I love the Tokyo Drift connection I wanted more of that there was not a lot of it exactly we get to see it's they just gave you exactly what you needed with that but I wanted more I wanted more that's been what I wanted since Tokyo Drift since the whole series since Four started getting all like let's connect the whole story and make this a franchise I've been waiting for the connection back to Tokyo Drift we got it in Six we saw that Jason Statham so we knew that this one was going to be the one to bring in the white boy from Tokyo",
            "start": 198.08
        },
        {
            "text": "this a franchise I've been waiting for the connection back to Tokyo Drift we got it in six we saw that Jason Statham so we knew that this one was going to be the one to bring in the white boy from Tokyo Drift and that was so exciting to me and then he is a cameo at best yeah I mean they got him back which is awesome and it's you know I think they probably realized that a number of years had gone by he doesn't look like a high school kid anymore he looks like he's his mid-40s which is even more apparent because they actually used footage from Tokyo Drift which was cool they used I mean that's I thought that was dope they use the scene at the very very last scene of Tokyo Drift where Han comes up to him and says hey there's this guy that knows you he wants to race you I'm sorry there's a guy that wants to race you he's like n I'm good right now and he goes nobody says he knows Han it's the iconic scene I don't know if it's iconic but it's the scene where he pulls up that's pretty iconic and",
            "start": 237.68
        },
        {
            "text": "Wants to race you, he's like \"I'm good right now,\" and he goes, \"Nobody says 'he knows Han.' It's the iconic scene. I don't know if it's iconic, but it's the scene where he pulls up - that's pretty iconic.\" And they're about to drift, and he looks over at the GTO and he's like, \"That's what's weird; they didn't show that scene.\" I wanted to see that race so badly, and we never got to see it. I'm really hoping there might be a director's cut or something one day where we see that. That was an intense scene, but that felt super disjointed right there. You know? But it was plot exposition; it was what we needed to see them talk. It was cool. We always wondered ever since I saw that scene: What happens next? How do these two characters form a relationship? Is this like a relationship they form or is it just two ships passing in the night? And it's not, and I think that's my biggest problem with this entire movie for sure - is the fact that",
            "start": 278.68
        },
        {
            "text": "is this like a relationship they form or is it just a kind of two ships passing in the night? Not, and it's not. And I think that's my biggest problem with this entire movie for sure is the fact that spoilers there's no like huge reveal for the next movie you know, like a couple movies back we found out that well, the three in Three there was the big reveal of oh **** Diesel was about to race this guy that was huge. Then um in Five what was amazing about that was that you know that tied it into the rest of the series up until that point we're like oh Fast and Furious is just going to be one-off adventures of these two people, oh no we know that Diesel's here because Han was his boy because there's a bigger story happening here somewhere we didn't really know that so far but that laid the groundwork it the ground Justin Lin did that yes knowing well knowing he needed all back together because the movie is not about racing no it's about family it's about family and this movie",
            "start": 310.88
        },
        {
            "text": "the groundwork was the groundwork Justin Lin did that yes knowing well knowing he needed to get everything back together because the movie is not about racing no it's about family it's about family and this movie definitely is that and you know it's about family from a number of perspectives a number of points which we'll go into later um but continuing but yeah so so fast five we get the reveal at the end that let's actually still be alive she died in four but then we have Eva Mendes come back in her first appearance since two which is kind of weird and just like you know show the police reports or whatever and you see Letres still alive you're like oh crap so that's what six is about and then in six we see that it's actually Jason Statham that killed Han this didn't have that and and again I think I want to give the producers and the director a benefit of doubt I don't know that this is the 100% story they wanted to tell definitely um I think that you know you go you see this it has great great big sets",
            "start": 354.0
        },
        {
            "text": "the producers and the director give a benefit of doubt I don't know that this is the 100% story they wanted to tell definitely um I think that you know you go you see this it has great great big set pieces I mean that's really what these movies are about it's about watching these fun characters that we've been with for seven movies now interact with each other they know each other they're all actually friends you can tell you can tell they like each other you can tell they have a great camaraderie and it's about watching them talk a little bit and then blow some stuff up in one liners they like exclusively talk in one liners especially The Rock The Rock has some fantastic oh my God and The Rock like I think we kind of disagree about this a little bit but I always want there to be more Rock in every movie I love I think he's the best character in every movie I think they used just the right amount of The Rock he's in the beginning Something's Happened to him and then he doesn't come",
            "start": 392.08
        },
        {
            "text": "in every movie I love I think he's the best character in every movie I think they used just the right amount of Dwayne \"The Rock\" Johnson he's in the beginning Something's Happened to him and then he doesn't come back end there's a smattering of The Rock in this movie it's not really about The Rock It's really more focused on Dom Toretto and his crew, also known as the Fast and Furious franchise, um and his career the team and the boys um which is good because that made The Rock so much more special every single thing he did or said was just stole the show it was amazing they really they they they had done them I'm interested to hear other people's opinions on this too because I love the movie I love Fast and Furious I will watch it again but some of it was so over the top that it lost me a little bit and you're breaking me some of it was like and that's the thing I think the movie because it was just boom boom boom boom boom didn't give me enough time to reset and invest in the characters a little bit so that when they had those big wow set moments like the one",
            "start": 424.92
        },
        {
            "text": "think the movie because it was just boom boom boom boom boom didn't give me enough time to reset and invest in the characters a little bit so that when they had those big wow set moments like the one where we've seen both of these in the trailers so this is not spoilers but the one where he jumps where he runs over the bus was awesome a lot of build up to that we had a lot I was invested in that scene he does it and even though I saw it in the trailer when Letty comes and she does that I'm like that was awesome and the scene where where he jumps through the buildings yeah plural um that had that was awesome I'm like dude this is awesome this is these two characters doing what I want them to do which is talking and like being there for each other during this crazy set of circumstances that like they're going to die in any second but spoilers don't die I think that's the biggest compliment that I can give this movie is that the trailer was so good and showed so much like we saw so many",
            "start": 464.52
        },
        {
            "text": "like they're going to die in any second but spoilers don't die I think that's the biggest compliment that I can give this movie is that the trailer was so good and showed so much like we saw so many of the the set pieces in the trailer and every single one takes it a step further and every single one surprised me and made me go oh **** I have never smiled so hard watching a movie like I think I SM from iing entire time it was just ridiculous like every single thing that happen amazing and then they just keep up in it and man they just understand this franchise they know what it is and there's a there's the fight scenes too are amazing oh well that that's something they've always been really good at since about four when they decided to go straight up Muay Thai like at MMA and I I think that's I don't know if it's Paul Walker's doing but you can tell he definitely used to kickbox cuz when he starts fighting with Tony Jaa which is everything they're in together is awesome all the fight scenes",
            "start": 501.4
        },
        {
            "text": "I don't know if it's Paul Walker's doing, but you can tell he definitely used to kickbox because when he starts fighting with Tony Jaa, which is everything they're in together is awesome. All the fight team are great, and you actually get a sense that he can hold his own against Tony Jaa, which he cannot; he would not be able to in real life, but it was fun, and the stunts were great, and then we get the parkour in there. Michelle Rodriguez versus... um... Ronda Rousey was it? Ronda Rousey was... was Ronda Rousey from the first no last one? Alright cool yeah so they F was the one oh yeah you're right that was awesome. We get a fight between The Rock and Jason Statham, which is amazing, and he actually Rock Bottoms him; he does, which they must have paid rights to WWE for that. Amazing, they did that. If you can't... if you haven't seen the movie yet it's in one of the trailers. The director has this fun stuff with the camera too a lot of zooms and a lot of craziness where he puts like",
            "start": 541.68
        },
        {
            "text": "if you haven't seen the movie yet it's in one of the trailers the director has this fun he has a lot of fun stuff with the camera too a lot of zooms and a lot of craziness where he puts like he follows the action so as he Rock bottoms we don't follow the rock we follow St and all that was great look it was it was great fun I think it's I like it to this it's like really good pizza after that third slice you don't really need the fourth slice but you eat the fourth slice then you're thinking about the fifth slice this was the whole large pizza you ate the whole thing you about five six slices in you're like you know what I don't need any more of this but it's in front of me so I'm going to consume the hell out of it and enjoy it as it's going and like that's how I feel about this one whereas Furious 7 was a little bit more emotionally invested just because there was Han Solo there was the Han story all that stuff happened and that really felt like it was maybe the end of the series for me cuz",
            "start": 585.96
        },
        {
            "text": "six I was a little bit more emotionally invested just because there was Han, there was the Han Solo story all that stuff happened and that really felt like it was maybe the end of the series for me cuz we didn't know there was going to be seven we didn't know there was going to be Furious 7 this one is kind of icing on the cake right it's like it's your birthday party and they bring out cupcakes and a cake yeah you're like I'm not going to complain about this um and some of the set pieces fell flat some of them weren't that great at all well some of them just didn't need to be as long as they were like I know so long like that's what I thought was what made it special like the the scene we've seen so much from the trailers of the skydiving cars which we haven't even mentioned in this yet well that was that was actually funny cuz that was the shortest like when Skyler just SK which I liked I was like oh there's not going to be anything crazy I mean they just",
            "start": 623.56
        },
        {
            "text": "this yet well that was that was actually funny cuz that was the scene that was the shortest like when Skyler just skydives which I liked I was like oh there's not going to be anything crazy I mean they just I mean there was some comical elements which was really really fun um but I liked that because then they land and they there's this whole like crazy formation thing and then they split up into multiple teams and they start driving down the mountain and there's all these different things they did and it was a very long that whole sequence was that's the sequence that leads up to the the bus sequence that that was awesome don't get me wrong that was awesome um again I'm we're critiquing a movie that really ought not to be critiqued this is one of those movies that you're not really you go get a giant thing of popcorn get a giant Diet Coke sit watch it on the biggest screen you possibly or a regular Coke if you're under the age of 35 you're going to watch it on the biggest screen you",
            "start": 659.2
        },
        {
            "text": "get a giant thing of popcorn, get a giant Diet Coke, sit watch it on the biggest screen you possibly can or a regular Coke if you're under the age of 35, you're going to watch it on the biggest screen you can possibly find and you're going to you're going to think it's hilariously fun, it's just fun, these movies are so good at making the entire theater involved like people are oh my God we talking and stuff but yeah like you're allowed to laugh you're allowed to clap and it's like I I'm I'm usually not a fan of clappers in movies but it's like but the thing is you clap at the end but people clap during scenes in this, it's like something happens and it's like dude I clapped and it's again again this is another shot in the trailer so don't get all pissed off in the comments about spoilers I almost stood up when he when Dwayne \"The Rock\" Johnson sees literally is looking outside of his his Hospital window sees explosions on the news it's like whatever and he's like Dre no it's not",
            "start": 697.36
        },
        {
            "text": "about spoilers I almost stood up when he when Dwayne \"The Rock\" Johnson sees literally is looking outside of his his hospital window sees explosions on the news it's like whatever and he's like Dre no it's not whatever on the news they say there's like outside it's what can only be described as vehicular warfare yeah and he's like and he does the for some reason he's got his his gun and his vest by the hospital bed his daughter's there she's been there the whole time so when he when he actually delivers the line Daddy's got to go to work he's not just talking to himself he's talking to his 10-year-old daughter and she goes I understand pounds his hand and he like rips out of his **** cast told goes to work got to go to work that's what this is about it's so good it's so so so good oh Kurt Russell was amazing and I love this so here's the thing the the movie didn't give me the one thing that I was looking for which is that big post credits reveal scene and the reason for that probably is maybe maybe",
            "start": 732.12
        },
        {
            "text": "and I love this so here's the thing, the movie didn't give me the one thing that I was looking for, which is that big post-credits reveal scene. And the reason for that probably is maybe they just don't want to go in a different direction with them. They handled Paul Walker really well. Let's talk about that last yeah let's talk about that last um but I think that they didn't give me the reveal because of that, which makes sense. But what they did do is they left a lot of people alive. We won't spoil it, but like certain characters are left alive in a way that's like okay there is room for the sequels, I understand what they're going to do with that. But what's most important is Kurt Russell, who is essentially this character that allows him to be like the Nick Fury of, who could just give them whatever tech they want. Did you get that? Did you get that sense where like you know they just leave him in the middle of",
            "start": 783.72
        },
        {
            "text": "that allow he's now like the Nick Scarpino of who could just give them whatever tech they want did you get that did you get that sense where like you know they they like just leave him in the middle of nowhere and he's like don't worry I'll be okay he's you're not leaving me I'm leaving you and you see the Black Hawk helicopter for this guy's like he plays Mr. Nobody I don't even think his name did he have a name the whole time his name was Mr. Nobody I think it was Mr. Nobody and he just plays this comical character that's you know the ultra badass that it's Kurt Russell for Christ's sake I he's play Kurt Russell playing Kurt Russell as a guy in Fast and Furious 7 and he's F it's fun he was again the black suit Black Tie thing I didn't need that but eventually I'm like whatever it's fine I liked it because it's a little stereotypical what it does is it shows that in the next movies they can up the ante even Beyond this somehow and have it make sense because now they have this McGuffin that's",
            "start": 820.4
        },
        {
            "text": "because it's a little stereotypical what it does is it shows that in the next movies they can up the ante even Beyond this somehow and have it make sense because now they have this McGuffin that's just like all right cool you can oh well they're always going to have that but they've got they've got Kurt Russell who can now send them on different things yeah so it's going to be really interesting to see let's let's let's close out though um and talk about Paul Walker yes so the movie closes and obviously you knew this was going to happen this was another one of my moments where I clapped and felt like I needed to almost stand up the movie closes and it goes to a white screen with black text that just says for Paul yeah and that's awesome classy very classy and they did a great probably the best job you possibly could have done shooting around him not being a part of this for through the latter half of the film uh they used as everyone knows they use a number of stand ins",
            "start": 858.04
        },
        {
            "text": "best job you possibly could have done shooting around him not being a part of this for through the letter half of the film uh they used as everyone knows they use a number of stand-ins, which were his two brothers um and they use some facial replacement like technology that they use on stuff like Benjamin Button and things like that. For the most part it worked okay now if you're a newcomer to the series don't start with seven because you're not going to know what the hell's going on but if this is your first movie in Fast and Furious you're going to think that shot looked a little weird, that's not for you it's for all of us that have loved watching Paul Walker and these guys get along for the last seven movies um and we needed to see closure that's what these were about. And the thing is like I know a lot of people are going to jump just because they know that it's CG, I feel like there's going to be a lot of hate of like it didn't look good it was creepy and it",
            "start": 894.04
        },
        {
            "text": "about and the thing is like I know a lot of people are going to jump just because they know that it's CGI, I feel like there's going to be a lot of hate saying it didn't look good, it was creepy and it was weird, and it's like they don't even know what the **** they're talking about. I was watching, I didn't notice it the entire movie until the last shot. There were two shots that I noticed, and I'm not going to call it out because I want people to watch this and if they don't see it, they don't see it. That's great. If you don't see it, don't look for it. Um, there are a couple of shots where you could tell it wasn't him. There were a couple of shots where you could tell that uh, they didn't do the face stuff. But they needed to; they had to. It didn't take me out of it though. It doesn't take you out of it either. Also, because and that's when people ask me, \"Fast and Furious\" - do I really, really like Fast and Furious? The answer is yes, I",
            "start": 929.44
        },
        {
            "text": "it though it didn't take me out of it, it doesn't take you out of it also because and that's that's when people ask me a Fast and Furious do I really really like Fast and Furious the answer is yes I do do I think they're great movies no I don't think they're Academy Award-winning movies I don't think this is the the you know like The Godfather Trilogy um I don't even think these rank up uh I mean they rank highly but they're not about that it's about they created they created a community and they created a culture where this it's just about having fun right and part of that was the the sort of ludicrous no pun intended nature of all these situations these guys have been in in the last seven movies and a big part of that was Paul Walker so you go into that and it's almost like you are friends with these people and you want to watch them do these crazy things you want to be on that ride with them you're not watching them you're actually experiencing with him and so we as all of us",
            "start": 962.0
        },
        {
            "text": "friends with these people and you want to watch them do these crazy things you want to be on that ride with them you're not watching them you're actually experiencing with him and so we as all of us that have been a part of this we needed that sense of closure for Paul Walker I needed to see the the shot that they close the movie you got to see it was great and it was it was very good yeah and and I don't want to spoil it for you cuz I I I want you you guys to have that emotional connection if it works for you if not whatever you know you're dead inside um but you know I think that they're they're very clear as to where they're taking the franchise going forward uh it was a very nice I actually got a little sad at the end of it I was a little no for sure for sure and I I thought it was cool too that like the movie didn't like play with your emotions with that like there wasn't a moment at the end where you're like oh man is Paul Walker going to die you very clearly knew",
            "start": 998.52
        },
        {
            "text": "was cool too that like the movie didn't like play with your emotions with that like there there wasn't a moment at the end where you're like oh man is Paul Walker going to die you very clearly knew that he wasn't going to die like he wasn't in any sense of like they didn't they didn't do the they didn't uh wuss out and be like let's let's re a situation where they kill him yeah well even it's not even so much about killing him it's so much about like I feel like the easy way to handle it would have been to capitalize off the emotion and like you know kind of like build it up and make it look like he might be dying and then he like comes back to life or whatever but like they didn't do that and I thought that was really cool and I thought that like they gave him a great story in this they gave him a lot of fun action they gave him a lot of cool things to do is gave him such a good send off yeah and surprisingly he's the main character yeah like he's not it wasn't he they didn't I was my",
            "start": 1034.04
        },
        {
            "text": "him a lot of fun action they gave him a lot of cool things to do. He was given such a good send off, yeah, and surprisingly he's the main character, yeah, like he's not it wasn't he, they didn't I was my big worry was that halfway through the film they were going to sidetrack him, yeah, and he's not, they they must have filmed a good portion of it with him and whatever they did with his brother or with the two brothers and the stunts and the face stuff worked cuz you don't really notice it I mean there's the scene probably with my guess is that one of the fight scenes with Tony Jaa is probably not him which probably wouldn't have been him anyways but it probably wouldn't have been him anyways, yeah I don't know he actually did a lot of his own stunts I think he did a lot of the stunt work, yeah cuz you could tell he he can he knows how to move he knew more Jiu-Jitsu. Ultimately this is the big question Tim and I know we've run a little long on this I don't think so we can talk about this forever",
            "start": 1072.48
        },
        {
            "text": "tell he he can he knows how to move he knew more Tai Ji Jitsu um ultimately this is the big question Tim and I know we've run a little long on this I don't think so we can talk about this forever that's very true which about to say needs to be its own video ranking the where does this rank in your Pantheon of Fast and Furious movies you know we're going to have to do our own video about that where we really get into it a bit later cuz we need to let it sink in but discussing it right now yeah how I feel about it it's definitely top three okay definitely um where it falls there I don't know I've always kind of struggled with what number one that's all I I needed to know I don't need to necessarily cuz my top three changes one is usually my top just got give it to it cuz I go back and watch that movie and I'm like it's so bad but I love it so much it's a guilty pleasure you can't do that um if it's in your top three I don't yeah I I let it sink I I think that five six and seven are",
            "start": 1105.28
        },
        {
            "text": "watch that movie and I'm like it's so bad but I love it so much it's a guilty pleasure you can't do that um if it's in your top three I don't yeah I I let it sink in I I think that five six and seven are definitely the top three here's my deal with it last night I walked out and I was like I was tired it was a really long movie and I was like I didn't like it as much then I woke up this morning I was like you know what I did like that movie I liked it a lot more than I thought I did so I gotta I'm going to have to think about where it fits in my in my lineup cuz my my thing is I always say that five is the best movie in the franchise because if you just watch one Fast and Furious movie I think it should be five fair enough because they introduced the characters well enough and you don't really need that's the difference I think five of six I I that's the problem is I think a five or six is as part one or part two exactly like that's the problem they call it 7.5 8.5 I'd have been like dope it's I mean",
            "start": 1149.76
        },
        {
            "text": "that's the hard I think five of six I I that's the problem is I think a five of six is as part one or part two exactly like that's the problem they call it 51 52 I'd have been like dope it's I mean that's what I mean that's the director made that it was Fast Five and Furious Six I know so like that's hard those those like kind of lump in together but but that's the thing that was like even having said that it's it's like Star Wars in a lot of ways where New Hope yeah you needed the sequels but you didn't really like it was fine I feel like five is the same way like five did have an ending five ends better than any of the others that's when they're all billionaires yeah but they're all they're still Outlaws so they can't come home six is about coming home you know what I mean yeah but okay six is about six well let's we can go into this forever we're going to have to do a part two to this review at some point cuz Greg standing here going we got to get set up for cl and Greg live",
            "start": 1184.88
        },
        {
            "text": "okay six is about six well let's we can go into this forever we're going to have to do a part two to this review at some point cuz Greg standing here going we got to get set up for cl and Greg live but uh all right anyways anyway it's really it's really damn good thank you so much for uh getting me into the movie cuz you were the one that set that screening up Alex me I got to give him a shout out shout out to Alex um if you're having any hesitation of seeing Fast and Furious or you don't like this film franchise well you are dead inside um for the if anybody has that thought I think made it this far into yeah that's good point everyone else that's ride or die with us thank you so much for watching this Tim thank you so much for hosting this do you want you want to outro us out no no no no just for let us know in the comments what you think about the Fast and Furious are you excited and did you watch this video even though it was full of spoilers cuz I respect you until then I love",
            "start": 1220.08
        },
        {
            "text": "No, just for let us know in the comments what you think about the Fast and Furious - are you excited? And did you watch this video even though it was full of spoilers cuz I respect you. Until then, I love you. I love you. I love you too, family.\n\nNote: I corrected \"Fast and Furious\" to proper case (since it's a title), kept the enthusiastic tone and filler text intact, and made minor punctuation adjustments for clarity.",
            "start": 1253.76
        }
    ]
}