{
    "id": 669,
    "video_id": "2WjHhrHE-WQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Let's Play Starwhal - Multiplayer Mondays",
    "description": "This multiplayer Monday the Kinda Funny Boys finally play Starwhal!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1425927710,
    "duration": 1138,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to a Multiplayer Monday here on YouTube.com/KindaFunnyGames. I'm Greg, that's Tim, that's Nick, that's Colin, and this is Starwhal. Who's played Starwhal before? Show hands! You guys are so... I'm going to eat your goddamn breast. No, uh, Starwhal just came to the PlayStation Network here. Uh, it's this whole thing where you jump and you kill each other and you try to... This is what they didn't tell me. I played this at the E3 panel that was the video game Hunger Games. This is one of the things I had to win to go to the finals, which I did, and then I won the whole thing. You want to hit each other in the heart or your belly because you're a whale with a unicorn horn. It makes perfect sense when you play it. So I thought it was called Narwhal. Is that something different? It's not What's N Hog. Oh we get to choose colors. I'm blue, oh sweet! I want to be green. I'll be orange. Customize... Oh my God, this is a game into this already. I'm so pink body.",
            "start": 1.08
        },
        {
            "text": "Is that something different? It's not what's n hog. Oh, we get to choose colors. I'm blue. Oh sweet, I want to be green. I'll be orange. Customize. Oh my God, this is a game into this already. I'm so pink body. How do you customize? Burrito is an option. Bacon wraith sucks on it. That's so good. That's the snail that I want. I'm going with tutu and my head is gonna be an afro. I'm good, I'm ready. Lightsaber, excuse me guys, you're not excused. Yeah, lightsaber with the snail. All right, I'm going to wear the blue shell. I'm player well, you going to wear the snail? I should probably get rid of the snail. What's every who's everybody who's who's what color? All right, so I'm orange with the Mega Man helmet and the... I'm white. All right, with the blue shell on the glasses. I'm blue with the snail. Okay, okay, I'm pink with the cool shades on and the ninja sword. Goa yeah, like how the whale has a ninja sword's awesome. Fck guys, doe he's dope. I already love this asid x Magnus Neo flop Acron. It's got a Neo flop. Awesome. Oh waus 2.",
            "start": 40.72
        },
        {
            "text": "Shades on, and the ninja sword, Goa. Yeah, like how the whale has a ninja sword - that's awesome! F**k guys, doe, he's dope. I already love this aside from X Magnus Neo flop Acron; it's got a Neo flop, awesome. Oh, wau 2. I wanted to go to the tunnels of love; we can do it next round. We'll be there next time, sure. Yeah, so what are the rules? I forget - I've never played it on a console. We all flop down. I know how do you play? Oh my God, this is hit each other in the heart! I just... I just hit you; got got hit. What the hell? So is it like... I'm confused. So you're trying to run your ship, and oh god, oh no - X propels you wherever you are. Nick is just sitting there, oh my God. Oh, he's just 69'd whoever the orange one is; just did some fun stuff. This doesn't make damn sense... so X is to propel, so it is like... um, Greg, think... um, no - like gravity crush or something. Gravity crash, whatever was called Grav Crush, no - no, the game on Vita and PS3 where you were the ship, and you had to... damn it, f**k me, and the horse f**ked me in.",
            "start": 89.8
        },
        {
            "text": "Gravity Crush or something Gravity Crash, whatever was called Grav Crush. No, no, the game on Vita and PS3 where you were the ship and you had to... n damn it... me and the horse... me in the horse. I like a good strategy is just to wait, where Tim's waiting right now, and just wait for the opportunity. Tim, now attack! I'm the blue one. Oh, who's the white one? I am. Look at that. This guy camping always camping. I like how when it's Tim, it's a good strategy. When it's me, it's a horrible thing. You dick. I lost. You happy? Yeah, it does make me happy when you lose. Oh, you got me! Oh man, it's tied up here. Oh God no. Colin and orange in the Mega Man helmet. Tim... and no, what did I do that for? Colin's just really good at these kinds of games, better than all of us. I feel. Colin get on him, get on him bro. The dance. Oh so close! What possessed these people to make this game? They spent a lot of time. Look at the artwork is amazing on this. This was like a year of their life for don't give up it can turn",
            "start": 152.4
        },
        {
            "text": "oh so close what possessed these people to make this game they spent a lot of time look at the artwork is amazing on this this was like a year of their life for don't give up it can turn in a dime I'm just going to chill over here time running out damn that was fun yes oh wait what oh sorry oh cuz you had less hits we got to really enjoy those stats my bad guys we got to go to the tunnel tunnels of L if anyone saw those stats for the one frame they were on let how we did all right oh man this this does remind me of a Tunnel of Love I was in one I don't even know how to respond damn it oh man calling you are just a little **** get out of here Nick suck I'm vulnerable I got to get out of no off come on everybody what the **** eat my lunch white person which one is this eat my lunch white person got you who's white I am oh oh damn it I actually really like this oh this game's great this game the controls are a little too literal for me cuz I play inverted and so I",
            "start": 207.76
        },
        {
            "text": "\"Lunch, white person got you? Who's white? I am. Oh, oh damn it! I actually really like this. This game's great. This game, the controls are a little too literal for me cuz I play inverted and so I don't know, I can't really control my guy very well. Suck on it! Oh, Craig sneaking up on me like a... There's definitely a lot more to this than be the eye. Oh damn, I just got hit. Oh man, I'm almost dead. I also like that my guy can't flip, so you're basically why can't youry? No, I don't know, I'm stuck in like one way, I can only go one way. No, that's like... You need to just hold this is really a truly bizarre. Oh no, God bless the Indie scene for for real dude! Damn, I'm out. You guys seem to have a better idea of the controls than I do. I think it's about... Bu no, Greg scratching that belly scratching that booty itch, you know what I'm saying? Booty itch, booty it, booty itch. I understand what you're saying, Greg. Thank you. Kyle. Oh oh hitting the wiener on The Sweet Spot, you know what I'm saying? Booty... It's\"",
            "start": 276.2
        },
        {
            "text": "Let's Play Starwhal - Multiplayer Mondays\nitch you know what I'm saying booty itch booty it booty itch I understand what you're saying Greg thank you Kyle oh oh hitting the wiener on The Sweet Spot you know what I'm saying booty **** it's going to be a tie I think they go to seven death so be ready you oh no really great now we get to look at the stats now that I **** up sorry you had a great game last time you can probably pause in let's play and watch it a different world yeah yeah let's go to The Forsaken yeah looks like icy planet like Earth ice ice got a little bit slush Kill the Dinosaurs the dinosaur the Ice Age sorry I like starting head to he which isn't even true when you're an asteroid killed the **** dinosaur as Mr Freeze you're not a doctor he is he is a doctor I know I know he really was a doctor oh great what what do you want me to do like Nar starall and your naral what guys have why do you guys have such problems like I oh I'm Wrecking shop oh Greg wrecking me though I'm getting wrecked W wall Tim come",
            "start": 349.52
        },
        {
            "text": "what do you want me to do like Narwal and your naral what guys have why do you guys have such problems like I oh I'm Wrecking shop oh Greg wrecking me though I'm getting wrecked W wall Tim come here I got a little something for you on the tip of my nose Colin let's play this all day or all night one yeah there go get the **** out of here pinky like that oh no Colin wait why is Pinky a commi Comm just recall pinky back me up here call uh uh yes thank you Kevin back it up look at look right now you pinky Kami see what comes up Pinko Kami bastard Pinko that's a that's a that makes sense oh you're right that's not the same thing you're going to tell me your small toe and your P to I lost again P toe I did all the hard work I haven't hit anyone yet and you won't right now either you date rapist get out of here pinky oh you watching me **** **** up over here oh no a this is a grudge match right here I don't like this I also don't like the way Greg looks man I look like me I look",
            "start": 413.88
        },
        {
            "text": "\"Rapist, get out of here! Pinky, oh you watching me **** **** up over here? Oh no, a this is a grudge match right here. I don't like this. I also don't like the way Greg looks, man. I look like me, I look like me doesn't look like you; it does look like you, really. Glasses! I actually think NX is the best just for the sword, no reason on the like. Well done, I did lousy that round but still came in second. I got to do something about this good. I got to really get a Stacent hit rematch. God, all really upset about it. Well, I don't like this level. Oh God, you think you're going to get me? But no, I'm flippity Dippity! God damn it! CH, remember that? You remember that feather touch from your butt? Come here, come here! I remember that. God damn it! Pinkoami, Pinko, damn pink oami! Pinkoami, my favorite Okami! The pink oami. Oh, got like that! I just keep talking ****, that's what you do: talk **** and get **** shot, brother! Damn it! Talk ****, get shot. Why am I putting my belly up like\"",
            "start": 476.76
        },
        {
            "text": "\"Oh, my favorite Okami, the pink Okami. Oh, got like that, I just keep talking **** that's what you do, talk **** get shot, brother, damn it, talk **** get shot. Why am I putting my belly up like that? That's a real **** maneuver. Hose down Bell's up, Colin, what are you doing? Greg and I are having the Battle of a lifetime. I know right, like our noses are right on top of each other. Tet in the game, oh there you go. Damn, I got to go back for a good strike. **** strike. Oh that was good, oh that was the kill shot. Oh how did you, you know how to play this a little? I don't know, no you're full of ****, you're full of ****, you're a **** piece of godam human garbage so **** you're full of ****. Pack up all your Lunchables. The way you're controlling your character is unlike anyone else is controlling their character. You and Nick have a better... you and Nick have a better. Oh did you know? Well how many games we play that Nick and Tim have never played. I know right.\"",
            "start": 530.48
        },
        {
            "text": "Is unlike anyone else is controlling your character, you and Nick have a better understanding. You and Nick have a better understanding. Oh, did you know well, how many games we play that Nick and Tim have never played? I know right every with the exception of Smash Brothers. Well, it'd be like it'd be the same thing if we were watching Chuck Norris films like well, how many of these Chuck Norris films have Colin watched? Be zero, we you know value our time. These two idiots probably watch oh yeah, I definitely value my time as you can see from my trophy list uh damn reach around Greg's got Greg's got a special understanding of this game. Love this game are we doing another one? Yeah let's go let's go to space Asteroid X Asteroid AST one more mag let's go classic the classic battle. We've only been playing for 11 minutes, it feels like a lifetime. Experts at it fast, this is fun I think my snails no get away from me God damn it you know Greg you're full of **** you know how to play this game you know how to control your character.",
            "start": 589.96
        },
        {
            "text": "Feels like a lifetime experts at it fast, this is fun. I think my snails can't get away from me. God damn it, you know GameOverGreggy, you're full of it. You know how to play this game and control your character better than everyone else. All it is just thinking of your nose like a dust pan and putting it under - get that nose out of here, damn Greg. You came in for the kill. Oh no, did you just get double hit? Yeah, it doesn't count that way though. God damn it. Oh, that makes sense, GameOverGreggy. Thanks, like a genius man. Yeah, it makes a ton of sense. GameOverGreggy is amazing. Just sitting there, I was leaving it exposed for a trap. No, back the hell up off of me. Dammit, God. All right, that's it now. I don't know what the hell is going on in this game. Oh no, only have one life. Oh, God luck. God, I was trying to protect myself. GameOverGreggy's so full of it; he understands this game better than anyone.",
            "start": 638.76
        },
        {
            "text": "was just that was just a kill of Starwhal, nope, what the hell am I talking about? Oh God luck, God, I was trying to protect myself. Greg's so full of ****, he understands this game better than anyone; he's controlling his character by then, yeah, we played it once, it's true, I did, I played it one time, just like the Starwhal over you. What's funny about this is that this is totally the kind of game that Greg Miller would be good at – it makes no sense, it is loud and obnoxious, and it serves zero purpose; son of a ****, talk, talk, get shot, uh-oh, no, no, oh no, Timmy help me, I just tapped your no, you stuck it right in my heart, get off me, bro. This is this is the stupidest fun I've ever had – I'll be honest; it's over, it's going to be a tie, oh no, damn it, can someone stop hitting Tim? Stop hitting rematch, I'm not; we got, we skipped past it, I think I won that one, I'm pretty sure I was on my way to winning that one, hitting you right there; well, no, that's the best part is it, stop.",
            "start": 696.96
        },
        {
            "text": "Tim stop hitting rematch, I'm not, we got, we skipped past it, I think I won that one, I'm pretty sure I was on my way to winning that one, hitting you right there. Well, no, that's the best part is it stop with you; we're going to rematch to see. I'll warn you guys right now - they didn't call me the sperm whale in high school just 'cause you know they called you the spur wheel. I'm sure they probably did. Oh, oh, oh, I went you right into your sword on that one. Ooh, yeah, as to die. Oh, that was a good one. Call thank you. It controls like grab like a gravity crash - that's like on crack basically 'cause like I understand the physics of the game but I still can't control my character. I mean they they move like real whale unicorns. How does a real whale unicorn move? Like, oh how did you get away from that? That's garbage; you didn't. I got him, yeah, but I was supposed to get you, yeah. **** Oh man, you horny little **** ****. I'm going to die first. This is horrible. I'm just",
            "start": 768.84
        },
        {
            "text": "Away from that, that's garbage. You didn't get me? Yeah, but I was supposed to get you. Yeah... Oh man, you're horny little ****. I'm going to die first. This is horror... I'm just going to tumble around and hope for the best. Man, I came down on you so hard - how hard, very hard, hardest I've ever come down on someone. Oh, I just made Colin Moriarty squeal. Oh yeah, you're crafty ****. It's like a rocket coming across the uh screen. No, no call. Oh God... This is really great. I like the little dance of death that happens when you're trying to get away - the slowdown is actually really brilliant design. Come on, there we go. Bring it down to my level, you ****. Bloody ****! What the **** was that? I lost three health in 4 seconds right there. Points on the board... putting points on the board. I hit X that time. CU, I'm mad. That's fine. I understand. We got to go. There's a way to do it - sudden death. I know. Like so there's not all these damn ties and stuff.",
            "start": 831.32
        },
        {
            "text": "\"Putting points on the scoreboard, I hit X that time. CU, I'm mad that's fine. I understand we got to go. There's a way to do it in sudden death. I know, like so there's not all these damn ties and stuff. I know there was a clean there saying it seems kind of cheap but you think you know you're the best. Did that one well what I don't, there's a slight flaw in this and that if you just don't engage you win and that's bad, that's what I tried to do but you guys call me out heart because you literally we're doing Pi on your controller, see what happens here. We're having too much fun. Score 30. I like the uh the font they use, it reminds me a lot of the producer Seducer Street, you can find over on itch.io for/ store nice. I have to get that out right go take a look at it wrap yourself in Mag we haven't been to Magnus yet in The High Ground no way that's the time spiral no this is going to be a conundrum so what do we here what did the thing say get the heart, this is just terrible cheap it's\"",
            "start": 908.08
        },
        {
            "text": "to Magnus yet in the The High Ground no **** that the time spiral no this is going to be a conundrum so what do we here what did the thing say get the heart this is just terrible **** it's it's the most kills I guess there's a heart get I think there's a game there you there it try to deal with this **** I'm T I got my heart why would I go down here when everyone's here **** me y oh thanks **** you hard yeah we're aware of the rules Kevin to my victory there we go oh guys get it get him I'm on top of him it's not really doing anything get him stab him in the heart oh **** they call me the Slippery Sperm Whale they have since high school they will continue to do so he's exposed in the annals of History got it what is this thing oh I had it for one second now just sits there like he's dead I had it for one second oh dear you know what I can't even get out of this hourglass thing Nick's going to win stop stop just think about what you're doing oh my god let's do that",
            "start": 950.2
        },
        {
            "text": "Dead I had it for one second oh dear you know what I can't even get out of this hourglass thing Nick's going to win stop stop just think about what you're doing oh my god let's do that one again all right one more then we're done we got work to do Nick suck on my oh no suck on your what Nick where do you want me to suck Nick tell me where to suck and I'll make it happen suck on my golden heart feel like we don't move as gracefully yeah oh **** you get that you like dug it out from underneath me I'm good at digging up clams sperm is that what sperm whales do how do you think they get so big and eat stuff I thought it was the Plankton that was constantly going mouth to mouth that's what you like to call tobacco industry lie I didn't know the tobacco industry had any cause to lie about sperm whales they don't want you to know that they're eating clams they want you distracted by the Plankton why are you in my way get out of my **** way ah damn it Nick Nick Nick's really",
            "start": 1015.96
        },
        {
            "text": "Lie about sperm whales, they don't want you to know that they're eating clams; they want you distracted by the Plankton. Why are you in my way? Get out of my way! Ah, damn it. Nick's really good at this part of the game. Yeah, I'm terrible; I'm terrible at this game. All right, I've had enough. Ladies and gentlemen, that Starwhal, not Narwhal - you can get it on the PlayStation 4 and the PC. Uh, we had quite a lot of fun with it. What do you think of it? Let us know in the comments below. Then make sure you keep coming back here to youtube.com/kindafunnygames each and every day for a brand new let's play until next time.",
            "start": 1098.08
        }
    ]
}