{
    "id": 709,
    "video_id": "Wnt6gcyibP8",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Let's Play The First Fifteen Minutes of Bloodborne (Kinda)",
    "description": "Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1427162401,
    "duration": 1660,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome back to Kinda Funny Games My name is K Moriarty this is Nick Scarpino now Nick yes we are going to show everyone the first 15 minutes of Bloodborne but I want to use the word \"kind of\" you're doing a caveat here going be a significant caveat why is that since it's me and you and we like to have some fun together in Bloodborne just like in Dark Souls, Dark Souls to Demon's Souls you'll be able to create your own character first so I'm going to start the clock after we create our character you want to get you want you don't want to be rushed no exactly and what I'm hoping for here is a lot of Sliders I don't know I've never not gone past this point of the game yet okay this is all we've seen so far it's just the other than other than our preview stuff this is all we've seen okay and so I don't know what the nature of the character creator is going to be I'm hoping that it's heinous and then once we get through that I will hit the clock I have it",
            "start": 0.32
        },
        {
            "text": "Is all we've seen okay and so I don't know what the nature of the Character Creator is going to be. I'm hoping it's heinous, and then once we get through that, I will hit the clock. I have it right here on my iPhone, and we will hit the clock, and then we will do 15 minutes. Sounds good? Are you ready? Let's do it. So uh, it's telling me to adjust. I like it'll be a little brighter than usual, so let's do that. On these games, you know what they do? They always say, \"Adjust the maximum scary factor.\" I crank the gamma; I want to see everything coming from like three miles away. I don't like that stuff either. Uh, and I've already gone in and reversed the Y-axis as I do. Thank you; you do that, yeah. Very important for me, good man. Oh yeah, also there's a Paleblood. Let's see what happens. Uh-oh, here's what I'll do: I'm going to start the clock now. You've come to the right place, stop it during the character okay? Yam is the home of Blood ministration; you need only unravel its mystery. Yes, like that top hat, but where's an",
            "start": 34.64
        },
        {
            "text": "going to start the clock now you've come to the right stop it during the character okay Yamatai is the home of blood ministration you need only unravel its mystery yes like that top hat but where's an outsider like yourself to begin that's a good question oh you get a little closer with a bit of yarn usually it's at this time in San Francisco when I either run or I have that internal struggle in myself I'm like you're going to have to kill this human I was pretty sure I was going to say I was pretty sure I've seen that guy in the Hunter's Dream I'm 100% sure we saw him yeah yeah so let's see what happens he he's here all right so I'm going to stop it now so I'm I actually just reset it because that was only 30 seconds okay I'm gonna enter my name I'm gonna call this guy Galvatron let's see you want me to call him Galvatron yeah I don't know why is that his name will be Galvatron so Nick we find ourselves here at the character creation screen right and right now our guy looks a little like",
            "start": 69.0
        },
        {
            "text": "Want me to call him Galvatron, yeah I don't know why that's his name. Will be Galvatron, so Nick, we find ourselves here at the character creation screen right and right now our guy looks a little like... well, who does he look like? I don't know, actually I was going to say Dracula but no, he looks more like a bartender in the Tenderloin. Yeah, yeah okay, so there's this game I see, I feel like it's based on San Francisco in many ways and I'm really interested to see more of it, but at your behest I've gone ahead and named our character Galvatron - it's a dope name. Uh, which you and we'll keep the gender as male, the age... let's see what he looks like if he's aged. Should we have aged? We have mature. Let's go with mature. Mature origin, milk toast, Lone Survivor, troubled childhood, oh I mean violent past. And let's keep an eye on the stats here. Let's see what we got. We got so like a low Vitality for troubled childhood but high endurance okay, violent past professional... what do",
            "start": 111.16
        },
        {
            "text": "oh, I mean violent past and let's keep an eye on the stats here let's what we got we got so like a low Vitality for troubled childhood but high endurance okay violent past professional what what do you think here waste of skin what no we definitely don't want to do waste of skin military veteran what whatever gives us the highest Blood Echoes that's really BL ech let's see the highest Blood Echoes will be Noble Scion yeah so I feel like well I mean I'm a huge fan of Bloodborne okay I don't really know what they are no me neither I have no idea what that is but it sounds dope and then let's go to the appearance and I think this is where we're going to have a lot of this is going to be great so we already selected that the voice we're not going to be able to hear but let's give him the mature voice anyway build let's see very Burly very Burly I like very Burly okay but let's give him also a small head okay oh you want you're going for the for the asinine on this no AB absolutely oh",
            "start": 156.8
        },
        {
            "text": "mature voice anyway build let's see very Burly very Burly I like very Burly okay but let's give him also a small head okay oh you want you're going for the for the asinine on this no AB absolutely oh absolutely okay uh let's see we can let's see if we just what happens if we put this all the way up I'm just going to sit here for a while and just do this you want to see how how how big the head can get I thought you wanted a small head well I want to start with a small head and then we're going to go to the big it doesn't seem to be changing it though am I crazy I don't know I it doesn't seem to be I'm going to keep pressing right here all right I don't know chest does the chest seem to be growing at all I don't nothing's growing oh I can change by 10 here so let's do that I want to I want to put it all up okay we're going stay this guy's going to be a giant yeah absolutely I'm fine with that all right so we're good we're good here we're going to be the biggest man in the game okay",
            "start": 193.6
        },
        {
            "text": "to put it all up okay we're going stay this guy's going to be a giant yeah absolutely I'm fine with that all right so we're good we're good here we're going to be the biggest man in the game okay return okay base skin color oh yeah let's see I like that jaundice let's go jice it looks like it's either jice or La celebrity look I like that God it's funny we can mess with it if we want but let's let's leave it where it is face details I don't want to use the presets no God no let's make them let's make him as feminine as possible wow okay and aged as much as hum would okay there we go you just made the wish from Wicked facial balance oh yeah this is getting good now it's a Pixar character I'm putting everything up everything's going up so you just G to let's just max out everything and see what we wind up with this dude looks dope yeah let's put everything up and see what happens okay just max settings Max set this is the Kinda Funny character right here",
            "start": 234.96
        },
        {
            "text": "just max out everything and see what we wind up with this dude looks dope yeah let's put everything up and see what happens okay just max settings Max set this is the Kinda Funny character right here we're putting it all up, bridge mode this is very very deep I feel like if we spend enough time we could make you oh oh definitely not me because my looks are far too complex but your your iconic classic looks I think we can make wow what is why would you even need that we're breaking the game right now so good okay he has no eyes he looks like a Star Trek character now it's like you know in Star Trek when they were be like let's just make him have bigger eyebrows and paint him green okay so we're putting everything up, everything, everything Max it out man that's what we do here on Kinda Funny Games we Max it out what's so funny about this to me is that we've the character has changed the way it's looked like 17 times now just based on putting all these sliders up yeah",
            "start": 295.08
        },
        {
            "text": "youtube.com/ funny games we Max out what's so funny about this to me is that we've the character has changed the way it's looked like 17 times now just based on putting all these sliders up yeah it's really freakish actually he looks like when people decide to get the 19th procedure in plastic surgery and that's the one that makes it so they can't move their face I watched that show on E! what is it called uh it's about like botched plastic surgeries and I think he looks better than some of the people I've seen on that show I think so you talking about the one where the guy like came in and he's like I did a hair transplant he's got a gigantic scar in the back of his head cuz he went to like some quote unquote doctor and like the worst part of LA the guy's like here it's like the doctor from freaking The 89 Batman where he's like you have to understand the the nerves were severed that was that was my that was a bad impr that was this what how many more sliders are there there's",
            "start": 347.28
        },
        {
            "text": "from freaking the 89 Batman where he's like you have to understand the the nerves were severed that was that was my that was a bad impr that was this what how many more sliders are there there's so many sliders all right I can't wait to get the hair oh my God yeah this is only what's that can we turn him and see what he's looking like from other angles here yeah let's yeah that's working that's working that's right where we want to be there's one more here let's see all right oh you went all narrow I wonder what it would look like if we went all like big we could make another we could do another video go where we remove all yeah we'll go 100% all right so we're good we're good here okay makeup we already did this skin eye area do we want do we want some some I mean I'm bright I'm fine with our max out this dude looks Twisted this is the kind of guy that you see right before you get killed by a serial killer look at him if you see if you see this when you wake up at night if this",
            "start": 385.68
        },
        {
            "text": "our max out this dude looks Twisted this is the kind of guy that you see right before you get killed by a serial killer look at him if you see if you see this when you wake up at night if this if this guy's hovering over your bed you are dead you are dead just assume your entire family is dead wait lipstick let's make sure we get I just dude this is the best let's see what happen I don't think my guy even has any lips so I don't know if this is going to do anything we'll see this dude's freakish hair 100% should we just go all the way what do it it's probably goes black if we go 100% all the way yeah it probably will how's that that's beautiful all right we're good there we nailed it hair let's see what kind of type of hair want oh we got to give him the mullet like the man mullet oh that's beautiful I like that that's my favorite let's just make sure there's nothing else here like a stylish haircut like this like he's like well anything to detract from my nose that's you nailed it go",
            "start": 439.04
        },
        {
            "text": "beautiful I like that that's my favorite let's just make sure there's nothing else here like a stylish haircut like this like he's like well anything to detract from my nose that's you nailed it go back that one that's amazing okay oh did keep do he keep it wait what this is the one right yeah that was it there we go there we go go back to color now can we make the how oh oh it didn't keep it cuz I I didn't press my fault it's my fault I like that shade of lavender that you had it's very in color right now one here lavender yeah let's keep that okay it's like a silver lavender brow yep I mean when you nail it you nail it you know what I mean I don't think my guy even has eyebrows I can't see anything there's a couple right yeah no do that one has any like that that's that's good all right we'll keep it there brow color we're going to keep it the same right yeah okay beard oh you got to give him a no he look I don't want to I don't want to detract from the face can we go just cop beard",
            "start": 491.04
        },
        {
            "text": "we'll keep it there bro, color we're going to keep it the same right yeah okay beard oh you gotta give him a no he look i don't want to i don't want to detract from the face can we go just cop beard that can i see what the second one looks like oh my god your call on this one i could do either the second one or the one you had the the the the gentleman mustache is pretty amazing this one yeah yeah let's keep let's do this now let's see if we can i feel like we need a different color for the for this for the beard yeah all right let's see if we can find just just the right hue i mean this game this game's already fun i'll tell you right now eyelashes i cant tell the difference it doesn't matter look how beautiful he is he's my favorite is my favorite is he's got the circa 1997 jennifer aniston friend's haircut ponytail going on which is amazing pupils let's go big color pupils i don't think we're going be able to see we're not going when i want i i would be able to mess with the",
            "start": 552.08
        },
        {
            "text": "Aniston friend's haircut ponytail going on which is amazing pupils let's go big color pupils I don't think we're going be able to see we're not going when I want I I would be able to mess with the pupil size but I just don't feel like you're going be able to see it tattoos all over he's got to be tatted up I think he's too jais for for us to even see any probably we've basically made wait what is wrong with us this is what we spend our life doing I like no I like the little circular one I like the little circular ones the ones that are like shaded those are hilarious way to go back no no no one's one over this one here yeah that's freaky what we think at that this dude is beautiful oh my God it's so good that's so bad all right I'm going to save this to fav yeah definitely why would you need to save any other ones though this guy's dope well that's our guy that's that's that's Galvatron cool so Galvatron the noble SCI he's mature he's male and he looks like he's going to kick some ass",
            "start": 607.16
        },
        {
            "text": "to save any other ones though this guy's dope well that's our guy that's that's that's Galvatron cool so Galvatron the noble Scourge he's mature he's male and he looks like he's going to kick some ass yeah he's he's ready to crush it now let me open my phone here down the Avenue and we'll start the clock right now okay starting it we finalized Galvatron I can't wait to see how he looks in cut scenes it's going to be awesome it's going to be awesome I mean with I I I would imagine that he can't even move his mouth because you gave him basically a beak so it can only do this they must have they must have tested this the Japan studio is smart enough to know yeah they know what's going on now I think the game's just loading we're loading we got the little loading icon loading for a while almost 30 seconds I wonder if I should restart the clock again no I mean this is the first 15 all right here we go all right we got F include loading screen so that's a good point what happens let's see what",
            "start": 675.72
        },
        {
            "text": "Let's Play The First Fifteen Minutes of Bloodborne (Kinda) \nI wonder if I should restart the clock again no I mean this is the first 15 all right here we go all right we got F include loading screen so that's a good point what happens let's see what happens if bloodborne happen stay in blood oh there's the guy from the there's the guy we met at the attendant one so we signed and sealed it let's begin hey but you got something right here on your eye oh don't you worry that messed up whatever happens you may think it all a m bad you got a little something right here bud just right here the gauze on your eye mean looks like it needs to be replaced yeah I think maybe when they said every day you should do twice daily I'm still laughing Galvatron is Galvatron is gorgeous so whatever you think keep thinking it because he's perfect I'm afraid his nose is so big though that someone might chop it off in In the Heat of battle I feel like it's another thing you has to worry about it really is but it adds depth to his character cuz when he grew up",
            "start": 723.96
        },
        {
            "text": "\"His nose is so big though that someone might chop it off in 'In the Heat of the Battle'. I feel like it's another thing you have to worry about, it really is. But it adds depth to his character because when he grew up, he was always a little bit self-conscious about that nose. Oh my God, what the hell's happening? I think I've actually seen this happen in 'The Last of Us' too, which is ironic and a little weird. I'm pretty sure I've seen this creature in Golden Gate Park. What the hell is that? You can actually see that creature if you uh watch one of our unboxing videos. Oh my God, oh oh Jesus Christ, this creature's on fire! I'd love to know what FromSoftware and Japan Studio are doing all day that they're coming up with something like this. It's some kind of drug we've never heard of before. It's awesome, but we'll never hear about it because we're not cool enough. Galvatron, get up! Galvatron, why are you still in bed? Why am I staring at my own feet here? Buddy, nice pinstripe pants. Are these guys going to drag us to hell? What the...\"",
            "start": 771.6
        },
        {
            "text": "hear of it cuz we're not cool enough Galvatron get up Galvantron why are you still in bed why am I staring at my own feet here buddy nice pinstripe pants are these guys going to drag us to hell what the hell's happening oh my God that guy has his hands on my crotch get off of Catron's crotch hey bro Galvatron don't put out not like this not like this oh my God damn they're making out with each other this is like a demon porno you found yourself a hunter and his name is G Galatron there look at how glorious he is what the hell he's got straps hanging off of him you know that's not how you use suspenders just putting that out there if they stay like that they're useless look at this Noble creature he looks a little like James Cromwell just a little bit no that'll do pig what is this respect seek pale blood to just transcend the hunt I can see that this is already going to be as obscure as Dark Souls Souls was pale blood is do they expect you to know what pale blood is or do you just have to",
            "start": 811.68
        },
        {
            "text": "pale blood to just transcend the hunt I can see that this is already going to be as obscure as Dark Souls. Souls was pale blood is do they expect you to know what Paleblood is or do you just have to kind of figure that out as H? I know the movement's already way faster it feels like the Is it in might you're not a giant Knight that's true so that kind of helps I mean this guy's I mean for Christ's sake he's half bird he should be spry that's his call that's that's the call of Galvatron oh there's notes here let's see view notes attack right hand weapon oh my God what the **** get away from me how are you not kicking those things right now they're showing me a note okay oh my God they're gone so I'm going to use right to oh is there another one here no R3 lock on and release okay okay did you just give him like a Kung Fu chop damn dude you did Galvatron knows what's going on he was trained in kung fu it's very dark in here this looks like the uh the Order: 1886 a little bit little bit",
            "start": 861.6
        },
        {
            "text": "you just give him like a Kung Fu chop damn dude you did Galvatron knows what's going on he was trained in kung fu it's very dark in here this looks like the uh the Order: 1886 a little bit little bit he's in that cool chair you got lot of cool chairs in this house is this your house I don't know I kind of want to go through all this stuff see what it is you know it's very interesting but uh oh just waiting for a boulder to come down and smash yeah the game will be over in 2 seconds I'm going to die we're going to die like what is this oh my God that thing's going to kill you right now what am I supposed to do you can try to kill it but it's going to kill you can I just run I'm just going to run just Judo chop it no see you bye bye you're the first person in history to pass this up and just eat your back out eat the back out of you oh God yeah close the door maybe no he's like he's fine what is he he's got a big crotch oh my God he just disappeared out of where he's gone that's it that's",
            "start": 907.76
        },
        {
            "text": "Let's Play The First Fifteen Minutes of Bloodborne (Kinda) \neat your back out eat the back out of you oh God yeah close the door maybe no he's like he's fine what is he he's got a big crotch oh my God he just disappeared out of where he's gone that's it that's awkward oh look how pretty it is look how pretty this is beautiful game holy **** that looks awesome cool Yharnam Gothic tell right now if you live in this town though you are just battling you have to know something's **** up right yeah you're just coming in here looking for trouble this is not a place you go to vacation this is not like Monaco or Bora Bora Quicksilver bullets you have to know something's **** up do you feel like this is going to be a game did you play Souls yes but only for about less than 10 hours okay what what stopped you from from continuing I don't like the game that much I just yeah I didn't like Demon's Souls I played Dark Souls I played Dark Souls 2 um people really ride or die about oh yeah they love the game and I respect that I respect it it's just",
            "start": 946.72
        },
        {
            "text": "that much I just like yeah I didn't like Demon Souls I played Dark Souls I played Dark Souls 2 um people really ride or die about oh yeah they love the game and I respect that I respect it it's just not for me it's very too too detailed too obtuse you know what I mean I feel like that's the whole point right is that it's it's supposed to sort of annoy you and fuddle you a little bit go kill that guy with a torch I don't have a weapon you got a judo chop bro oh Jesus CH oh this guy's coming for you and he is tall and he's got a tall hat and that makes him taller someone have a weapon for me please someone have a weapon you have blood I don't know what that is throw a blood vial at him bro oh my God where did you come from Jesus why is he so big look he's got an abnormally long arm get him you got this bro chop that I mean it's not really doing much but you got it just 70 or 80 more of those and",
            "start": 995.84
        },
        {
            "text": "where did you come from Jesus why is he so big look he's got an abnormally long arm get him you got this bro chop that I mean it's not really doing much but you got it just 70 or 80 more of those and you got him get him get him chop that dude chop him chop him in the head you're wearing him down get that big ass ax he's got that looks dope come on God oh yeah you little pissed off you came out oh my God I'm on fire oh my God I'm dead you just died oh Jesus oh Jesus well that's our first death we are Oh look The Clock here my phone went to sleep we are uh 5 minutes and S no 6 minutes and 18 seconds into the game yeah little 6 minutes and some Chang to the game and we already dead I think that I actually lasted longer here than I did when I played Dark Souls the first time 6 minutes is not bad although 2 minutes of it was cut scene that's true with those guys playing with my crotch oh so where am I maybe was I supposed to die I maybe no I feel like this is like was it dark souls like I",
            "start": 1036.0
        },
        {
            "text": "bad although 2 minutes of it was cut scene that's true with those guys playing with my crotch oh so where am I maybe was I supposed to die I maybe no I feel like this is like was it Dark Souls like I never played Dark Souls don't doesn't when you die you have to go reclaim your soul or something yeah you do but I feel like this is just a new cut scene like I'm in a new place maybe I'm supposed to die they didn't give me a weapon I had no weapon maybe I missed it now I'm at a church look at how beautiful this is beautiful game they really nail the ambience of of this world like that's the really I think one of the great things about Dark Souls so you're in some sort of Dreamscape now that's my nightmare right there having to like jump from pillar to pillar it's like the end of uh Hitler guy to the Galaxy Series where he's just stuck on a thing he can't has to jump you never read it you know you kids today you don't read you did have you seen have you met Galanor I'm talking to Kevin",
            "start": 1082.68
        },
        {
            "text": "to the Dark Souls Series where he's just stuck on a thing he can't has to jump you never read it you know you kids today you don't read you did have you seen have you met Gatrón I'm talking to Greg everyone for those of you who can't see he's behind the camera here there he is Gatrón with the spectacles he's beautiful spectacle now those things came out of the ground even if it was the 50th time and I knew they weren't trying to hit I would kick the **** out of them I would just try to kick them to death even though clearly they're already dead so I can choose a pistol or a Bow gun so now I have a gun cool how'd you get that they give it to you yeah and by the way I'm saying Bespectacled like when you have glasses Kevin is speckled but I mean I don't know I don't know what the hell's going on the messenger offers you a trick weapon choose one trick weapons are wielded with",
            "start": 1123.52
        },
        {
            "text": "but Speckled Herring, I mean I don't know, I don't know, I don't know what the hell's going on. The messenger offers you a trick weapon; choose one. Trick weapons are wielded with the right hand and employed them to do something - Saw Cleaver, Hunter Axe, or Threaded Cane? I'm going to go with the Saw Cleaver. Why the hell would I want a Threaded Cane there's got to be a reason, there's got to be that but that's the one that's like everyone in the Master Sport. It's like two months for now are be like why the hell did you choose the Thread of Cane? Look at this, I'm doing like a two-hand attack in the graveyard; that would have been good against the what this Headstone of Awakening no place to awaken the hell does that mean? Headstone of Awakening. All right, that's where you can awaken when you die. I'm going to go this way now. You got to go find your dude and you got to go kill that long-armed guy. I just want to get into this church; feel like I'm really exposed out here. Oh my gods, oh my",
            "start": 1169.8
        },
        {
            "text": "you die, I'm going to go this way now. You got to go find your dude and you got to go kill that long-armed guy. I just want to get into this church; feel like I'm really exposed out here. Oh my gods! Oh my God, am I... like, oh, am I handcuffed? Okay, you might be handcuffed; I don't know what you might not be able to use weaponry in this state. Look at how pretty these flowers are. Pick one of these flowers. Galvatron, Galvatron. No, he's not in the mood. What is this? It's a lamp. Can we pick it up? Bath messenger... Oh, that's TR blood. Echo with Messengers to buy and sell items. What? Oh my God! There's so many items; you're scaring me. I'm going, yeah, I don't really... You know, it's been a while since I've actually said yes to anyone that's propositioned me in a bath. You, I don't know if anyone's ever propositioned me in a bath per se. It hasn't actually happened to me either, but you know, here's hoping. Quick Silver Bullet replenishment; use with caution. Performing this action drains HP. Look at them; are they...",
            "start": 1209.96
        },
        {
            "text": "me in a bath per se it hasn't actually happened to me either but you know here's hoping Quick Silver Bullet replenishment use with caution performing this action drains HP look at them are they it looks like a credit card there we go it's literally the American Express of the underworld hey what's up let me out of this place why won't you let me go can you jump over those things you know transform weapon at transforming attack okay so now now my hands aren't together anymore can I can I go it takes a special kind of person to play this game doesn't it it's so complicated it's so complicated not in a bad way I'm not making fun of it no not at all I'm saying like if this is your thing this is like you're in heaven right now to me my brain just glazed over and I'm like I don't understand how any of this works I'm glad I'm not driving I'm just along for the ride here I'm looking at the scenery on the lovely Coastline that is Bloodborne look at this beautiful these beautiful flowers oh my",
            "start": 1262.76
        },
        {
            "text": "any of this works I'm glad I'm not driving I'm just along for the ride here I'm looking at the scenery on the lovely coastline that is Bloodborne. Look at this beautiful these beautiful flowers, oh my God. These notes held by messengers contain the written wit and wisdom of hunters from other worlds, okay so that's pretty similar to The Dark Souls there. So they're just telling you like what what's what people can leave notes and like hints for you, oh really? Mhm, that's cool which are very useful. So like I jumped in this a year from now people like don't do that choose the Threaded Cane but how do I leave like I oh my God look at how beautiful are they're amazing I love them I'm fine to just spend the next 8 minutes looking at these flowers but it'd be dope to get back to that dude and hand him his ass. Inspect an abandoned doll that's freaky, don't why is it life-size? Why is it there what kind of doll I can't even imagine what kind of doll you would make that's a female form",
            "start": 1311.64
        },
        {
            "text": "them his ass inspect an abandoned doll that's freaky, don't know why is it at life size, why is it there, what kind of doll? I can't even imagine what kind of doll you would make that's a female form that's life-size and what you would use it for. What do you think? Probably just looking at it maybe talking to it. Okay, Greg's doing a motion with his hand that's not appropriate for this recording, thank you, Greg. All right, I don't know what to do, I'm already lost. This just tells me everything I need to know about Bloodborne. I'm just not good enough to play it, so can you... I mean, I feel like you got to leave, I have to leave, but will it let me? Can I just kill myself? I don't want to be in this world; this is a mess-up world. Oh my God, let me out of this world. There's got to be a way to get out of here. Oh, of course, but I'm... I'm curious. You can't have you tried going through the main doors yet? These yeah those big doors, yeah it won't let me; it won't let you do it. Okay, here on let's try let's press X again closed I",
            "start": 1351.2
        },
        {
            "text": "I'm curious, you can't have you tried going through the main doors yet? These yeah those big doors, yeah it won't let me, it won't let you do it. Okay, here on, let's try, let's press X again. Closed, I can see that the door is closed. I just tried to open it. Oh my god, let's look at the doll again. Let's look at the doll, it's freaky, it's really freaky. Look's like a Galvorn looking at the doll. Look at him, he's so beautiful. Galvorn, you're gorgeous. Here we are Born to be Kings, yeah we should try to find a nice Vista here and we'll do a nice pan. Oh yeah, let's get the GL. Can I sing to it? Or yeah absolutely. Let's look, let's go over here and let's get all right. You ready? Yeah, we are Born to be Kings. He's the Prince of our universe. I feel like the broad chest nothing, the body didn't make any difference. No, I don't know, nothing we did other than tweaking his face to make him look... We should do another video, we should do another video though where we we do the opposite, we we SL all the slide down I",
            "start": 1393.32
        },
        {
            "text": "No, I don't know nothing. We did other than tweaking his face to make him look... we should do another video, though, where we do the opposite - we SL all the sliders down. I still like the Jaice look, though. I mean, I really want to get a better look at him. Can we get a better look at him? I mean, what happens if I hit the touchpad? The personal effects... okay, uh. Can we take off the cape? Yeah, let's ditch the hood. Like, why does he have all these things on? I don't want him to have them on. I want him to be as close to naked as this game will allow, 'cause that's where he's fastest when he's unclothed. It's funny that it won't let me use my weapons either. You're in the dream state, man. You don't need your weapons here. Get out, get out of that black... okay, yeah. There we go. Here we are - Born to Be Kings, Cales, the princes of the universe. He goes by Gal, but if you know him, look at that beautiful specimen of a creature. God, he's gorgeous. Even the even the",
            "start": 1459.6
        },
        {
            "text": "yeah there we go here we are Born to Be Kings Cale's the princes of the universe he goes by Gehrman but if you know him look at that beautiful specimen of a creature God he's gorgeous even the even the plants seem to be becoming erect when they get around you see slow pan look at the slow pan I got going on right now oh this is good your camerawork is excellent as we go up and up and around I feel like this is not an accurate representation of how people should be playing the first 15 minutes of this game but I'm into it have you tried going through that gate closed we have a lockpick of some sort let's see let's look inventory key noys saw Cleaver Hunter Blunderbuss one of the you know here's the thing one of these guys probably does have a key yeah they got to give us a key we only have 45 seconds left so let's okay he creepy ass **** all they're just yeah they're telling this is mean this is like basically tutorial but I feel maybe it's a perfect tutorial cuz you know you're",
            "start": 1499.76
        },
        {
            "text": "Have 45 seconds left so let's okay he creepy ass **** all they're just yeah they're telling this is mean this is like basically tutorial but I feel maybe it's a perfect tutorial cuz you know you're going to be frustrated as all hell when you play this game anyway so this is just kind of setting you up for it well that's basically the first 15 minutes plus yeah that's it what what what are you pointing at oh we can do it now oh wow okay cool good job Greg how did you know that Greg I'm so glad he's smarter than us that's it that's that's 15 minutes that's it so I hope everyone out there Nick enjoyed uh Galvaton the jaundiced Elder God Birdman hero I certainly did oh he was fantastic thanks for hanging out with me uh he was just a fantastic creature and I'm glad we got to make him together with all of our friends here on Kinda Funny Games and of course getting a look at the first 15 minutes although that was more like the first three minutes",
            "start": 1550.68
        },
        {
            "text": "and I'm glad we got to play it together with all of our friends here on Kinda Funny Games and of course getting a look at the first 15 minutes although that was more like the first three minutes of the game and then we just ran around and looked at flowers and pretended they were beautiful in the game's defense, the flowers and that creepy doll and that weird doll - you know that doll's going to... you know that doll is going to wake up, oh yeah it's coming for you, dream. So you're back to your uh your apartment here, yeah I'm back in my apartment, it's a little disrepair maybe we'll do another gameplay video soon of Bloodborne and show everyone a little bit more of the game uh so we do appreciate you joining us here on Kinda Funny Games for the first 15 minutes of Bloodborne plus the character creation which I think was still the best part of the game so far, I mean I just play that yeah absolutely that's a good game let's make that let's Sony just put that game out",
            "start": 1603.12
        },
        {
            "text": "plus the character creation which I think was still the best part of the game so far I mean I just play that yeah absolutely that's a great game let's make that let's Sony just put that game out that's a great game more sliders the more sliders the better that's what I always say we'll call it Sliders yeah yeah not to be confused with the TV show or the small cheeseburgers you put in your mouth all right till next time we'll see you later",
            "start": 1634.2
        }
    ]
}