{
  "id": 377,
  "video_id": "C-88BsOjEIQ",
  "show_name": "The GameOverGreggy Show",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino", "Colin Moriarty"],
  "title": "Batman, Robin Williams, and The 2016 Election - The GameOverGreggy Show Ep. 37",
  "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1408690802,
  "duration": 4391,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to the GameOverGreggy Show. I am one of your hosts, Greg Miller, alongside the producer, SL Seducer, Nick Scarp ino. Hi Greg, you have one hair out of place. Oh no. Well actually a whole bunch up there, but one right there. No, that's fine. Don't, you can't fix it. It's impossible to fix. Is it like fixed it? Did I fix it? It looks pretty good actually. Yeah, cool. All right. Uh, over here, the PR of Long Island, Colin Moriarty, and the pure one, Tim Gettys. Let him host. Let him host indeed, ladies and gentlemen. Thank you so much for doing us. How are you gentlemen doing? Very good. Colin, you didn't come to work. You're working from home. Yep, working on a review. I didn't see you. Tales of Exill ia 2. Yeah, I missed these **** with little arms. I know those little flabby back here and I don't know. Yeah, but no, I was just playing my game, playing my video games. Yeah, yeah. All right, good to see ladies and gentlemen. If you didn't know, the GameOverGreggy Show is quite simple. Every week four, sometimes five,",
      "start": 1.1
    },
    {
      "text": "but no, I was just playing my game, playing my video games. Yeah, yeah. All right, good to see ladies and gentlemen. If you didn't know, the GameOverGreggy Show is quite simple. Every week four, sometimes five best friends gather around this table each bringing a random topic of conversation for your amusement. If you like that, you go over to gameovergreg.bandcamp.com every Friday and buy the MP3 for $1. It's the entire show, high quality MP3, almost said H2O. Uh, it's the entire show, everything you want right there. If you don't want to pce the dollar cuz we're not worth it, we totally understand. You can wait and go to youtube.com/gameovergreggy where every week we break out every topic topic by topic until all the topics go up is one giant topic topic topic topic topic as a giant thing on Friday. Then go to Districtlines.com gameover reg buer t-shirts, then follow us on Twitter. Yeah, do that. Then there's something else I usually say. You got the shirts, you got the the band camp, you got the like subscribe.",
      "start": 38.28
    },
    {
      "text": "to Districtlines.com gameover reg buer t-shirts, then follow us on Twitter. Yeah, do that. Then there's something else I usually say. You got the shirts, you got the the band camp, you got the like subscribe, share, you're our best friend. We love you. Thank you. Go to the Reddit. They got the Reddit still going over there. The one thing you missed is last week I said was two weeks ago I said that last week's episode was going to be worth a dollar. Yeah, this week's episode's also worth a dollar ladies and gentlemen. I'm just letting you know there a lot of tweets letting me know that it was worth a dollar. So oh, and you're already you're already saying this one call a shot. He's the Babe Ruth of podcast . If you're so confident you go first this time. Tim, what's your topic? So Colin, yeah, earlier tonight you you guys were talking and I was overhearing like I often do and you explained that there there's some something that can happen that means that Obama could be president again for a third time somehow if",
      "start": 79.52
    },
    {
      "text": "guys were talking and I was overhearing like I often do and you explained that there there's some something that can happen that means that Obama could be president again for a third time somehow if something happens and I don't understand because to me I know presidents can only do two times what is this? Uh, there was just an article in Vox today, uh, written by, uh, an ex-White House advisor saying that the when a president runs for a second time because of the 22nd amendment, he cannot run again was created after Roosevelt was President four for four terms and, uh, it ham strings the president, makes him a lame duck, what they call lame duck in American American politics. You're not going to get anything passed exactly like they're you're being waited out nobody respects you and, uh, so he was saying that the only way to eliminate lame duck sessions with presidents and with Congress is to eliminate term limits and he was saying that you would get rid of the 22nd amendment to let people run again",
      "start": 118.24
    },
    {
      "text": "that the only way to eliminate lame duck sessions with presidents and with Congress is to eliminate term limits and he was saying that you would get rid of the 22nd amendment to let people run again uh because it was called the Washington precedent that George Washington ran twice and then he retired and so that was whatever everyone was doing no one even tried to run for a third term until Roosevelt ran for a third term in what was it 34 no 40 he ran for a third term so 1940 so that's what that is okay so if they got rid of that they got rid of that Obama has a chance a three repeat yeah if if that that's not happening Happ definitely not happening happening because of my topic tonight my topic oh you're going somewhere with this okay I thought it was just like my topic is M hearing things about presidents my topic is in 16 there will be two parties going right one of them Miler Mor arti and one of them Scarpino Gettys I like that I like that a lot I like the sound who's going to win",
      "start": 163.56
    },
    {
      "text": "about presidents my topic is in 1 6 there will be two parties going right one of them Miler Mor arti and one of them Scarpino Gettys I like that I like that a lot I like the sound who's going to win who's going to be President and Vice President are we of this fine country are we judging what were the tickets Scarpino Gettys and then Morard Miller right yes I don't want to be in the front of the oh yeah so I said that slow that down right cuz like there our campaigns immediately got a giant hole in the boat yeah you know what I mean like it's no one's are you saying no one's voting for you for president no no no I I'm a great Joe Biden I'm a Great Dan Quail like when we actually are a great Dan qua can you shake my hand and smile for the camera you got to do you got you got to hold it for 15 or 20 seconds though really awkwardly I mean yeah that's the big thing like people like Greg Miller and they'll they'll watch me on the twitch or do whatever with me they'll enjoy hanging out with",
      "start": 205.88
    },
    {
      "text": "15 or 20 seconds though really awkwardly I mean yeah that's the big thing like people like Greg Miller and they'll they'll watch me on the twitch or do whatever with me they'll enjoy hanging out with me watching the content on IGN they I think that's where you follow me on Twitter when you're voting for who's got their finger on the button you're not going with this face unless I think you and I could have a good George Bush uh Dick Cheney you pulling the strings on on me kind of a thing then I could really work it but I think for right now what this country needs they'd want to have the mor and you're a great VP too you're a great go the Bush Cheney thing where Cheney just randomly started shooting people in the woods with with I'm going to do that too once once on VP you don't want to come hun to shoot you with if we won or when we win we would win it's going to be a lot more fun I'll tell you why we would win because our promotional campaign for our presidency would be epic it's",
      "start": 247.2
    },
    {
      "text": "come hun to shoot you with if we won or when we win we would win it's going to be a lot more fun I'll tell you why we would win because our promotional campaign for our presidency would be epic it's going to have the best thumbnails ever it would be all just ring light rap video like with us wrapping to the pertinent issues of our time like immigration yeah and drugs a Starbucks that's even bigger than the Trenta the quarenta damn guys think about that the answer is quick the only thing I would enjoy would be your Campa t-shirt because it would say Scarpino and then Gettys but then instead of having that dividing line it would be a line of cocaine see I can't the gradients are too expensive okay I can't do I'm sorry I realiz you're pinching pennies on your we don't have a lot of this is a Grassroots campaign oh okay back in high school when you know youning for class representative yeah exactly fifth grade class represent like me and Nick could win that so I'm just kind of curious",
      "start": 283.84
    },
    {
      "text": "a Grassroots campaign oh okay back in high school when you know youning for class representative yeah exactly fifth grade class represent like me and Nick could win that so I'm just kind of curious what would you know what our platform well yeah what's your party see you jump in the gun there's no there have got a primary you can both join the primary and then in this scenario that's out the window we are there's we're still in the two- party system we have come to that point we are it's down to us somehow well all right so there's a problem with your ticket already in that and that you you have you just just very fun you have no Regional balance on your tiet you're both from California uh that's a super important thing when you're running for president have six states soon that's true so we're good yeah so like four of them already that's a good point but we don't vote for that until 2016 and you'll be on the 2016 ballot sure so then it has to be ratified so you guys are running in",
      "start": 329.76
    },
    {
      "text": "we're good yeah so like four of them already that's a good point but we don't vote for that until 2016 and you'll be on the 20 16 ballot sure so then it has to be ratified so you guys are running in one California so your Regional your ticket's very slanted it's it's a losing ticket you're talking all sorts of adult talk that's not what the nation needs yeah okay I keep hearing about the party I like that part party are we we're going to be no we're not going to be a party we're going to be the party yeah Colin they're actually making a ticket I like yeah theyy there might be room for two vice presidents on this CS right I look like the idea that yeah your campaign photos and stuff with the ring light You'got sunglasses on and Tim's doing that I like hands out like scared cat face that I do sometimes when I don't know what to do the gift face there it is but what do you you stand for we stand for all things right unity and equality equality love rainbows love that's what we do we do",
      "start": 367.4
    },
    {
      "text": "do sometimes when I don't know what to do the gift face there it is but what do you you stand for we stand for all things right unity and equality equality love rainbows love that's what we do we do it for the love we doing it for the love we want to see everyone happy we want to see no one starve doing it want to see no one starve doing it for the old men by the campaign like scarpo old people and kids alike are welcome at the party yeah so you're going to have an Andrew Jackson thing going on where are you going to have the people in the White House you're just going to let people in the White House just going to let them chill there's enough room in there for a good half a state have you ever been the White House I've been in front of it I've never been inside of it it's a lot bigger than it looks on TV like you know how many times they walk around in the white house that's a good seven8 miles just stretch but those are wings that's not really the house itself sure there's parking",
      "start": 414.04
    },
    {
      "text": "it looks on TV like you know how many times they walk around in the white house that's a good seven8 miles just stretch but those are wings that's not really the house itself sure there's parking lot that people can hang out into underground I like that your campaign is a campaign of love and the party well we would clearly be the Democratic party on this one I think so I don't know man I think we would just get get rid of that stuff we are just the party we don't need to choose a party we're the party so when people ask when people ask you what party are you like we're the party well you've been elected through the Democratic you're you're a Democrat no no we're the party that I feel like people of all types are going to vote for us sure that's true and that's how elections should work I'd like to imagine that happens all the time but I mean it does we'll just ask you write Us in we'll just be they'll just write us into the ballot no that we can't no there's one of us is winning",
      "start": 452.64
    },
    {
      "text": "I'd like to imagine that happens all the time but I mean it does we'll just ask you write Us in we'll just be they'll just write us into the ballot no that we can't no there's one of us is winning that's the point I'm we have to have it we it has to be a two-party system in this so you guys be your third party candidate is Destin Legary so he's he's he's he's filed an amendment where Canadians and Sean finnean that would be an amazing take him to school uh show them what we're about no I I I mean we we you know with the policies we're we're pretty clear with the conversation with Colin and we standing think a lot of these policies spend more than you make right don't be all upid about the gay marriage right abortion whatever go do your thing right Playboy right all right uh but I'm I'm more curious just how badly I would Massacre Nick in the oh my God uh see here's the thing you've never you've never debated me before I'm amazing at evasion no not at all not at all like that's what",
      "start": 492.6
    },
    {
      "text": "more curious just how badly I would Massacre Nick in the oh my God uh see here's the thing you've never you've never debated me before I'm amazing at evasion no not at all not at all like that's what keeps my mind fresh you see when you start asking me things question ask me a great hardest little question you can think of right now I don't know the the the Z guys right now is immigration so that's a great question that's a great question Colin let me take let me take before I start that though I want to talk about something a little more important to this country love love damn dude we're so good you can't fight love you can't fight love you can't there's no there's nothing you can do to combat love you got to just have it you got to open your hearts to love your uh your ticket seems formidable it's it's something it's something it's going to be a fun party train to watch see and if it starts going downhill we'll have Tim accidentally shoot someone right and it'll be like wow those",
      "start": 536.0
    },
    {
      "text": "it's it's something it's something it's going to be a fun party train to watch see and if it starts going downhill we'll have Tim accidentally shoot someone right and it'll be like wow those guys don't how a **** party I think I don't think you quite understand how this whole thing works but I'm I'm I'm interested to see how you guys kind of figure this what would your uh what would you guys run on what what would your platform be well we would be Republicans we be we would be Republicans what would your big thing new Republic new Republicans yeah maybe we would just maybe we would just reform the Wake party and uh we'd be the ones to come in I would say that if the Republican Party Colin describes and then he like if if all Republicans were like Colin I'd totally be on board with being a republican I would assign myself to their party they make sense right small government stay out of my business stay out of my money leave stop taxing me to death right stop getting in other",
      "start": 580.2
    },
    {
      "text": "being a republican I would assign myself to their party they make sense right small government stay out of my business stay out of my money leave stop taxing me to death right stop getting in other people's way with their personal Liberties and what they want to do marry whoever you want to marry but on the other side there's just love that's the that's the ticket we are fighting a nebulous enemy that's the problem I'm sorry guys you cuz love is everywhere guys but we have concrete don't touch me the why are you so warm I burn hot I'm also fat team fat Districtlines.com game you're like a big blanket yeah to wrap you around me what what gets really bad at night is like I'll be so hot I'll sleep on top of covers and just my underwear and then Patillo who's also Burns hot will come and just like slam himself on my side so it's like the two hottest things in the world does he just like slide off in the morning sweaty no in the middle of the night he gets up and he gets out of there he's",
      "start": 619.44
    },
    {
      "text": "like slam himself on my side so it's like the two hottest things in the world does he just like slide off in the morning sweaty no in the middle of the night he gets up and he gets out of there he's had enough of that crap that's nice yeah I'm sleep I'm going to sleep in that bed you can come let's cutle got big I mean sler doesn't have to be no sure okay I like this idea I'm excited about this this good we should actually consider running all of us but I mean the first Pet's always a big deal Portillo obviously you pillo what we got you I see you guys with the chimpanzee man yeah or a rut Tang damn so that could be like this hey that's Cheeto the orangutang Cheeto the orangutang yeah his name would be Cheetos damn I really like that make sure we get get one of the like the monkeys that was in a'9 0s movie like there was a lot of monkey well we'll just say it's the monkey from the'90s movie and no one will ever like that's not him he can't possibly be that old what you need to do is",
      "start": 661.84
    },
    {
      "text": "in a'90s movie like there was a lot of monkey well we'll just say it's the monkey from the'90s movie and no one will ever like that's not him he can't possibly be that old what you need to do is when you go to like do your presidential speeches like in front of the White House Press Corp you roll in with Cheeto the what is the orangutang this is Cheetos the orangutang Cheetos he got be plural Cheetos on the aring thing but he's got like a he's got like a tree on a platform with the tirre swing you roll in next to you and like every fifth statement that comes when I out I hand him a banana he like cracks it in half like monkeys but no then any time they're like well president things aren't going right you know the the boots on the ground in Iraq it isn't going our way what are you doing you just looking at me like it's a great question uh Jim from The New York Times I'll tell you the same thing I tell all the boys in blue see him out there on the battlefield I tell him just like in",
      "start": 703.4
    },
    {
      "text": "you just looking at me like it's a great question uh Jim from The New York Times I'll tell you the same thing I tell all the boys in blue see him out there on the battlefield I tell him just like in blue what is this a civil war just like I tell Cheetos the hang in there and the monkeys hanging right next to you hang is hanging in there hang in there I like like a lot they would appre from 1863 I'm sorry I understand that you've thought about being president for a long time I haven't thought about it so I've only ever thought about being a so I'm thinking of how do I address the troops on the ground there my boys in blue of course the PD police officers I wasn't prepared to step up and make this speech with Cheeto orangutang next to oh yeah I think I think we'll win Greg I think we'll win the election I think we'll win the election 95% of the vot here's the reason I think your guys'stuff looks better on stuff like your two names look better on you think the Miller Mor oh the mor does",
      "start": 739.88
    },
    {
      "text": "the election I think we'll win the election 95% of the vot here's the reason I think your guys'stuff looks better on stuff like your two names look better on you think the Miller Mor oh the mor does look good there's the alliteration going on I Like That Eminem and then we can have Eminem rap at our inauguration em if we can do that yeah would it be too far to go Eminem 16 like is that too much is that too milant that's too much too much we might also get Su by the Mars company for that M16 like M16 could be your thing and it just be a gun but with but then ours will be a gun with a flower and it'll be love and holding it but like eating some Cheetos is he in aing Tang or is he chimpanze you're right you called me out on it oh it's already starting to crumble every you have you have to have a good foundation for this campaign let's do when this happens when this when this comes around the primaries come around let's do a debate between you and me and let's see how long I can go",
      "start": 792.24
    },
    {
      "text": "to have a good foundation for this campaign let's do when this happens when this when this comes around the primaries come around let's do a debate between you and me and let's see how long I can go before you punch me in the face and just walk out when you end everything with love dude laugh Cheetos he's like he's not a dog he's if we have a monkey he's gonna hand me Cheetos like oh here if we have a monkey throwing up a heart come on so first it's got to be an orang thing like Clyde from any how well would they do though cuz they would actually do pretty pretty well yeah you do pretty well it would be a good third party candidacy get all these M take all the Democrat that's what we need to do okay so Schwarzenegger won the governor stuff and that blew my mind I was like how is that a thing we could do that because he's the Terminator but he got didy though we need to Rock the vote we need to oh we can get Kanye we got get Kanye and Beyonce damn I don't know that's can one of your",
      "start": 831.88
    },
    {
      "text": "thing we could do that because he's the Terminator but he got didy though we need to Rock the vote we need to oh we can get Kanye we got get Kanye and Beyonce damn I don't know that's can one of your like you know your presidential like campaign TV spots can it be like a recreation of the Kanye video where he's on the motorcycle with his Cheetos on your back you're on the motorcycle you're looking like hey guys let me tell you about our party line I'm going to call it right now Cheetos is feeding you the Cheetos all of our promotional things for our campaign are going to be are going to be uh ripo ffs of Kanye West Kanye West remake videos going be The Power video and it's just like it goes about 30 seconds into it and then I just I look and I'm like let me tell you something about immigration love love and then CL just like swinging you have you two cuz that one love oh absolutely you would definitely come perform at anything we wanted them too cuz we'we'd be all about love and",
      "start": 874.32
    },
    {
      "text": "love love and then CL just like swinging you have you two cuz that one love oh absolutely you would definitely come perform at anything we wanted them too cuz we'we'd be all about love and happiness and like you know not actually tell people how to accomplish anything be great would they sing Bloody Sunday on no you don't want to do that that bring up bad memories yeah they're going to be pop culture what is love Yeah 2014 edition 2016 Edition excuse me you can have whatever you want at this party cuz it's your party too we want to win we want to be the president you can't have that and you probably can't have ice cuz I forgot to stock ice the party it's the number one thing I never stock D that's not good I know you got to remember to stock that I will cuz we'll also serve K lad at the party oh God my suspicion is that we're going to win this election I think so too but I think I don't even think we have to really do anything the adults have to come out and vote I'm saying he could",
      "start": 911.84
    },
    {
      "text": "party oh God my suspicion is that we're going to win this election I think so too but I think I don't even think we have to really do anything the adults have to come out and vote I'm saying he could motivate the kid core and the kid core is out there won got to think of the children The Hope yeah they had the hope they got the love people didn't vote in that 2008 election McCain went have W which is bizarre but isn't this what Twitter's for can't we tell can't we ask people who they'vote for on Twitter well we we're on a social platform right now everybody in the comments tell us who you comment and tell us Who You'd H for # love or no no no here's what we'll do here's no yeah hold on this is what we're going to do instead you're going to go home tonight and you make t-shirts you make campaign t-shirt that's not what I do when I go home after this what do you do you goep you specifically make campaign I watch the cosmos I go home and I kiss my wife cuz she's usually asleep I watch",
      "start": 956.84
    },
    {
      "text": "campaign t-shirt that's not what I do when I go home after this what do you do you goep you specifically make campaign I watch the cosmos I go home and I kiss my wife cuz she's usually asleep I watch the cosmos and the rest of it none of anyone's business all right so anyways go make t-shirts and we'll put them up on Districtlines.com yeah make we want a morard Miller one and a Scarpino Gettys one and I can do whatever I want for the Scarpino Gettys one we'll give it the F we'll give it the first month and then we'll report back with statistics on which shirt sold more and that'll be the winner I like cuz I'm not going through counting every I'm not going to count every comment in every gosh darn YouTube thanks leave comments but I don't like counting everybody knows I hate math that's another part of our platform you do the math oh you do the math the words of currency you're not a mathematician but you can count it's it's M SAR 16 you do the math you do the math or with the party",
      "start": 994.48
    },
    {
      "text": "another part of our platform you do the math oh you do the math the words of currency you're not a mathematician but you can count it's it's M SAR 16 you do the math you do the math or with the party come swim in my pool at the party oh my God God that's so good that's a terrible slogan that's not that it's confusing but you have to imagine on a poster girl like who's just walking in a bikini yeah I mean this is like the easiest thing on the planet holding Cheetos hand how will you deal with Congress though Congress is going to get rid of you in about I'm not going to deal with Congress I'll tell you why who's the person in the government that deals with Congress who's the head of the Congress the speaker of the house yeah and Cheetos I'm going to inv Cheetos the speaker of the house damn no you got Cheetos you're the head of you're the head of the Senate Cheeto is just going to come in and he's going to throw stuff all over the place people like this guy this r who else the Cheetos",
      "start": 1029.08
    },
    {
      "text": "no you got Cheetos you're the head of you're the head of the Senate Cheeto is just going to come in and he's going to throw stuff all over the place people like this guy this r who else the Cheetos he's Congress is [Music] ajour like that Cheeto drives a hard bargain fine cross those ey holes fine we'll Tear Down the Wall no immigration how you going to deal with Putin cheetah send him over there send him on a rocket a over just parachutes in all right that was a crazy topic and mainly all was build your campaign cuz our campaign is sensible yeah well that's the thing sensible never wins when's the last time you went to a really good sensible party that's a good point the Tim Greg the Tim Greg debate would be pretty great just asking us question we're just like yeah whatever I don't know anytime math yeah the money comes up the budget we're like What do you that would be amazing I want to see that too that's Happ whenever like I like Tim and I are just like know when we're at the kids",
      "start": 1070.12
    },
    {
      "text": "math yeah the money comes up the budget we're like What do you that would be amazing I want to see that too that's Happ whenever like I like Tim and I are just like know when we're at the kids table like when we'll be talking about something for the YouTube channel or whatever and YouTu will start talking about like well I'm not confused about the tax breakdown of this and Tim be like yo what's up hey I like Donell you just got to all you do is you take it and you relate it to something you do know about and we know about partying you're right this is going good places love every all right buy the shirt we'll tell you who won based on that Nick yes what's your topic my topic is always comes from the audience oh yes it does who won last week unsurprisingly accidentally farting in public one last week uh and that was thanks to I really got to write these down damn it well I'll find that later guys while I'm looking for that yeah when's the last time you accidentally farted in public I",
      "start": 1127.72
    },
    {
      "text": "last week uh and that was thanks to I really got to write these down damn it well I'll find that later guys while I'm looking for that yeah when's the last time you accidentally farted in public I mean what like accidentally I mean I fart in public intentionally all the time but yeah yeah I I I time it doesn't embarrass you well I do when people really can't hear it yeah like when you're on the airplane that's the best oh I have pants thank you so much for that great Twitter handle good handle yeah for especially for this question Colin so you're walking down the street and you're like uh you feel it cuz it starts in like sort of that mid stomach kind of toward the rear end area and you're like I got some buildup and I don't I think it's good enough to just kind of let it go you got to relieve some pressure and you're just like it's a basic human thing so before modern society this was happening all of the time every time someone would go anywhere and they had to fart they just farted",
      "start": 1169.2
    },
    {
      "text": "some pressure and you're just like it's a basic human thing so before modern society this was happening all of the time every time someone would go anywhere and they had to fart they just farted right but we have these sort of social tab os which are that it's it's really not you're not supposed to do it in public right that doesn't bother you at all oh no no no one has to know it's not like I'm walking around like in a in like a church and I'm like you know fart ing walking down the aisle to get the host or whatever you know it's [Music] like the body of Christ yeah do the tongue there I forgot you do the tongue thing I I us to the camera do to the camera do to the camera look at the PRI ey we're all best friends show the best friends don't break out I contact do the wheels Tong seaw like I like the idea of you not breaking eye contact with the priest though I never do when tongues are involved I always keep eye contact but no like last week I was texting Greg because I",
      "start": 1216.4
    },
    {
      "text": "Tong seaw like I like the idea of you not breaking eye contact with the priest though I never do when tongues are involved I always keep eye contact but no like last week I was texting Greg because I was even on the mun coming home yeah and I was just I was just farting like I was like I got to do it I'm sorry I'm like letting I got to let it go they smell I I definitely more so than the smell were they like did they make audible they they did cuz I could I could hear it but I think like the noise the train and all those kinds of things you're covering it are covering it up like I don't think you're you know again it's it's there's a difference between like there's ambient noise and and yeah like no one's you know no one's going to hear like the you know the rip of the fart sure um but you know what I when I think about it like I I'll walk down the street and I'll fart you know I'm not going to do I'm trying to be inconspicuous about it right but like I always walking and like just",
      "start": 1261.44
    },
    {
      "text": "you know what I when I think about it like I I'll walk down the street and I'll fart you know I'm not going to do I'm trying to be inconspicuous about it right but like I always walking and like just Dro to like your KN but I always think about if I'm doing it certainly other people are farting around sure I I mean I will I'll if there's no one around sure why not but like I don't think I've actually ever accidentally done it oh I have ever maybe in like I did it in school I don't I don't remember the time when I did it never accidentally like I've never farted with an audible fart that I didn't want to happen at that time interesting so you do it for humor well Audible for humor but mainly I mean I'll just do it when I'm like I'll fart in front of whoever the **** if I know it's not going to make a sound I don't give a **** so the sound is the most important thing me sound the lingering stench in the air that SMS tot blame someone else unless it's like with someone I've seen",
      "start": 1300.68
    },
    {
      "text": "going to make a sound I don't give a **** so the sound is the most important thing me sound the lingering stench in the air that SMS tot blame someone else unless it's like with someone I've seen what you guys eat and there are some rotting stuff inside oh my colon is just it's dark a mess it's a **** mess it looks like one of those caves that like they have man hasn't touched in like billions of years it's just the lagm mites everywhere and like creatures it's it's amazing anyone anything gets out of there at all there have been times though where I've tried to be sneaky with the fart and then it just and it it smells it's like you can't you got to kind of either play it off I remember uh in the old office in Brisbane I was going out with clayon uh to go out to lunch and I was waiting by his desk and I did I ripped the fart it just ReRe and I was like I'm sorry I'm sorry I thought it was just going to be an innocuous kind of fart yeah that's there there has been times where I've",
      "start": 1343.52
    },
    {
      "text": "by his desk and I did I ripped the fart it just ReRe and I was like I'm sorry I'm sorry I thought it was just going to be an innocuous kind of fart yeah that's there there has been times where I've been alone like at my desk and I'll fart and then someone will come up to me immediately it happens to me all the time at work I fart and then somebody comes up with a question I'm like Jesus Christ really like I've been alone for 30 minutes all of a sudden somebody's got a **** question here and Bre goddamn news what's even worse is that at the IGN offices all of our somehow the cubicles are ly are are put in such a way that your back is always toward everything yeah like I can't see anything I am blind I have like one spot I can see like a horse everything else and no peripheral Visions so they sneak up behind you they'll be standing there you don't know how long they're there for how long have you been there for they're like reading your emails and stuff having a cup of coffee enjoying",
      "start": 1383.32
    },
    {
      "text": "sneak up behind you they'll be standing there you don't know how long they're there for how long have you been there for they're like reading your emails and stuff having a cup of coffee enjoying the superficial while you read it yeah it's the worst now I want to bring up just real quick two rules take your time with this the the first rule is that when you're in a bathroom a public bathroom fart farting goes it doesn't matter I think I fart urinal and all that **** all the time who's around me who's there I let it go I get the weird I get weird about that yeah I got to let it go really where are you going to fart if you can't start the bathro go into the stall **** that no you're in the bathroom that's weird man with Christine right like where I I I don't want to fart around her here's the thing you need to know about Greg Miller everyone who is a best friend here you guys I don't know how much you've caught on to this we don't talk about it enough everyone out there needs to",
      "start": 1427.08
    },
    {
      "text": "the thing you need to know about Greg Miller everyone who is a best friend here you guys I don't know how much you've caught on to this we don't talk about it enough everyone out there needs to know I'm a loud person I'm very loud right my voice at a normal volume is loud and when you walk up the stairs it sounds like the Sasquatch is coming home from work sure there's that when I sneeze how do I sneeze like my mom super loud it's not super loud it's just it's very then you heard me hold it back what I'm driving at is that I do everything loudly I fart my in high school and you're just friends and you sit around you fart and like you make fun of each other they always said I sounded like a baseline cuz it's like it sound it's it's you got the lowend it's coming from deep within me somewhere in here and coming out loudly so that's I mean I there's no way not when I fart it's rare for me like oh that was a quiet one nice whatever so like when I go to poop or even when I'm in the",
      "start": 1465.6
    },
    {
      "text": "somewhere in here and coming out loudly so that's I mean I there's no way not when I fart it's rare for me like oh that was a quiet one nice whatever so like when I go to poop or even when I'm in the bathroom like I like around like Christine right I'm not going to be like farting all the time right at least only if they're quiet okay no whatever but like when I got a fart or whatever I'm not trying to fart around her but when as soon as I close the bathroom door I'm not even worried about it anymore like I'm I'm **** in the bathroom this is where the farts go this is what happens interesting I mean granted I'm **** in there too don't get me wrong it's like just I don't go in there like a weirdo fart for a little bit come out we have that policy too at at my household it's an unspoken rule we've never spoken about could I just fart in front of her we have talked about this at nause um at my house my wife cuz I think it's funny when you're married you're like everything's funny it's",
      "start": 1506.52
    },
    {
      "text": "rule we've never spoken about could I just fart in front of her we have talked about this at nauseum at my house my wife cuz I think it's funny when you're married you're like everything's funny it's too you're locked in now what are you going to do it's it's expensive to get out of this so I'll be talking and I'll go and I'll be like yeah yeah and you go start you'll just go and you'll still be in the conversation but the door be open and you'll be going to the bathroom or whatever I did not know I'm talking as I'm walking he always Muppet walk this isn't a walk I thought you going to be like you grab her by the nose and F no but you'll go and inevitably like you'll just be caught up in the conversation and you'll go to the bathroom my apartment's really small in San Francisco it's not like we all have a lot of space and the bathroom is like it's hardwood floors you can hear everything and inevitably something will squeak out and she'll be like just shut the door I can still hear it",
      "start": 1538.56
    },
    {
      "text": "we all have a lot of space and the bathroom is like it's hardwood floors you can hear everything and inevitably something will squeak out and she'll be like just shut the door I can still hear it but it's the courtesy of you shutting the door that allows me to continue on living without wanting to kill you yeah every single second and I get that but see you don't tell me that cuz then I just leave the door open on purpose every single time oh see now I don't yeah I go in there I close it and then I learned a trick from Damon Hatfield cuz I room with Damon Hatfield for years going to events just to run water just run water to cover up any any noise in there whatever you're doing I'm like oh that's very po why did I eat those WIS I'm the exact opposite punching myself in the stomach you you and your girlfriend have a bizarre bathroom relationship yeah yeah I Cheryl and I just go like if she's like as long as no one's pooping you know we'll go in and out of the bathroom like while we're",
      "start": 1576.08
    },
    {
      "text": "and your girlfriend have a bizarre bathroom relationship yeah yeah I Cheryl and I just go like if she's like as long as no one's pooping you know we'll go in and out of the bathroom like while we're talking to each other and I'll just like she'll be in the shower I'll be and all that kind of stuff but I fart in front of her all the time and sometimes I try to Dutch up in her as well so it's just uh but like I I I rip like notorious farts in the morning this is a Moriarty thing I think everyone farts in the morning but my farts are like really loud my then like my dad I would hear my dad fart in the morning like from upstairs and then hear him laughing this long like 5sec fart cuz my dad eats mostly vegetables so it's like a really gaseous fart then you hear like uh but uh which is like so because it's funny like your parts are funny but I'm going to teach you guys a trick that I really want I want everyone at home to do it too listen up go in the shower and wet one of the walls you",
      "start": 1615.52
    },
    {
      "text": "so because it's funny like your parts are funny but I'm going to teach you guys a trick that I really want I want everyone at home to do it too listen up go in the shower and wet one of the walls you have tile walls right wet one of the walls and then when and you have to fart right so use one of the wet walls and if you really want to get crazy with it kind of soap up your butt a little bit Yeah are we in the shower right now can you just ask are we in the shower like are we we're shower we're shower you're in the shower you're climbing into the bathtub he said go into the bathroom and wet a towel yeah all the wall the tile wall Nick on this wet the tile wall and soap up your butthole a little bit while you're in the shower press your ass against the wet wall and fart and it is the loudest thing you have ever heard in your life I'm going to do tomor executed properly it could be heard anywhere in the house can I call you when I do it tomorrow is it something you learned from living with",
      "start": 1657.36
    },
    {
      "text": "thing you have ever heard in your life I'm going to do tomor executed properly it could be heard anywhere in the house can I call you when I do it tomorrow is it something you learned from living with your your your brothers and uh I I don't know I think it might have been something I actually invented myself I don't know I don't know when I figured out that like you can amplify the fart noise by putting it against the wet wall in the shower but I learned that can we uh and it was great is there a name for this that we could name right now I don't know maybe people in the comments can tell us what they want to name this wet wall Moriarty wall you're in the shower the Waller you fart you may or may not soap up the butthole a little bit that's optional uh I don't know if it's necessary I feel like it might be necessary but I've I Ty I typically have not like cuz I've never I've never actually like just soaped the butthole to do this but sometimes I have soap on me yeah it's running you what me",
      "start": 1706.6
    },
    {
      "text": "it might be necessary but I've I Ty I typically have not like cuz I've never I've never actually like just soaped the butthole to do this but sometimes I have soap on me yeah it's running you what me yeah it's like it's ready to go so I'm not quite sure if it's just the the the Lu when the last time you did this few weeks ago probably yeah oh this recent thing sometimes it's a dud which is disappointing so give it a few shots this is so good don't just come out and think you know attempt one think you got it but tell us in the comments what you think we should name this maneuver and then try it for yourself because I think it's really something special um because it really it really brings out the humor in the fart you know um you already have the fan going in your bathroom you're not going to smell you might be hot boxing yourself for a little while yeah the problem with the the any sort of farting in the shower is that inevitably it makes it that much worse cuz it's warm then",
      "start": 1743.2
    },
    {
      "text": "going to smell you might be hot boxing yourself for a little while yeah the problem with the the any sort of farting in the shower is that inevitably it makes it that much worse cuz it's warm then it's like a warm smell yeah it it is a warm smell you you know what the worst thing when you're in the shower is on as side it's it's very intimately related though you ever go in the shower and then you have to **** so you have to get out of the shower and then you're all wet and you're sitting on the the toil feel like it's like so it's terrible and then you have to like start all over again the worst is when you you'll finish showering you'll be like all right now it's start I got to poop and you poop you're like I Just sh I literally was clean for 10 seconds it's a real got jump back in the shower yeah yeah I always do this I jump out of the shower do it get back in forget I jumped out of the shower like a wet seal and then when I'm done showering I slip fall my ass cuz there's water",
      "start": 1784.12
    },
    {
      "text": "shower yeah yeah I always do this I jump out of the shower do it get back in forget I jumped out of the shower like a wet seal and then when I'm done showering I slip fall my ass cuz there's water everywhere every time every single time how have you not broken anything cuz I'm made of steel oh broke your hip you break your hip break your hip like an old man okay that was a good topic thanks I have pants remember if you have topics for this game over G show follow me on Twitter Nick Scarp ino and tweet at me your topics just like I have pants uh and we will vote like we're going to do right now L gent two topics are going to come up I did not run these by you guys I F number one will be down here number two will be over here you click on it you watch Little Nick's intro videos Little Nick you watch Nick's videos about it Little Nick little Nicki and then you like the video You're voting for so you can watch both you like them the one with the most likes is more likely to be picked I",
      "start": 1818.08
    },
    {
      "text": "you watch Nick's videos about it Little Nick little Nicki and then you like the video You're voting for so you can watch both you like them the one with the most likes is more likely to be picked I feel like we haven't done this topic yet and I really like it it's a it's a good serious topic when would you cut the cord with cable oh that's that's a good that is a good one that be there right here so click on Nick over there Tim's right arm fcking this you guys **** around you've never even watched these videos you have no idea where they go I don't watch my own work and the next one is worst dates you've ever been on that'll be click on the third cord it's this auxiliary cable auxiliary cable coming out right here it's just going to be a few pixels click on that we're done now how does YouTube work how does YouTube work great thanks guys my turn for a topic my turn for a topic I don't know if everybody's aware of this there was a cartoon we used to love called Batman Beyond this",
      "start": 1860.76
    },
    {
      "text": "YouTube work how does YouTube work great thanks guys my turn for a topic my turn for a topic I don't know if everybody's aware of this there was a cartoon we used to love called Batman Beyond this year I'm sure you're aware of Colin did you ever watch Batman Beyond I watched is that the really styliz one from the early to mid 90s right yeah I watched that one the future flies oh okay late'90s yeah yeah yeah I watched that one I used to rent the videos okay great face looks like a cat it looks like what now that's where that's where Harley Quinn comes from right no that was the animated series that was Batman animated series then there was a sequel to it called Batman Beyond that continu Eric from Bor me world as will forell isness yeah anyways I don't think I watched that one okay it's it's future flung where there's this new Batman and Bruce Wayne's mentor and y y y uh there's a whole storyline obviously from the cartoon that then was SP spun out into the digital DC comic series",
      "start": 1905.68
    },
    {
      "text": "it's future flung where there's this new Batman and Bruce Wayne's mentor and y y y uh there's a whole storyline obviously from the cartoon that then was SP spun out into the digital DC comic series that's going on right now and they just revealed that Batman used to sex up Batgirl but he used to have sex with Batgirl they were getting it on they were in a relationship Batman and Batgirl were in a relationship they were in a relationship with sexual relation having sex right so not like a like a a real emotional relationship no they were they were D I mean like um if I mean the headline is Batman **** Batgirl but like the the when you get into the story and you get like they were in a relationship she'd already dated Dick Grayson this is Canon of course for everything you Dick Grayson is uh Robin right and then he goes on to be Nightwing he's the first Robin right uh they had already dated they had broken up she got it got together with Bruce they had a a relationship they decided",
      "start": 1949.84
    },
    {
      "text": "is uh Robin right and then he goes on to be Nightwing he's the first Robin right uh they had already dated they had broken up she got it got together with Bruce they had a a relationship they decided in the end wasn't good for them got out of it then Nightwing or at this time Dick Grayson comes back to town uh Barbara and him try to make it work again into this relationship she discovers she's pregnant with Bruce's kid no oh damn yes now no protection the kiss of death to be clear here she there was no cheating here there weren't cheating there was defined ends but like Nightwing came right back and they picked up where they left off yeah but there's rules I don't know what those rules are no that's a rule you're breaking that rule there's a what you I mean Bruce Wayne **** pretty much adopted Dick Grayson right like he was his Ward or whatever like they were they had a father son relationship and like sometimes it's more played up like brothers but they were family yeah you if you're",
      "start": 1989.56
    },
    {
      "text": "Dick Grayson right like he was his Ward or whatever like they were they had a father son relationship and like sometimes it's more played up like brothers but they were family yeah you if you're the dad you don't **** your son's extra you know what I mean rul that are being broken here you don't this is rule number one if you're trying to be a dad who okay what's the age difference there oh I mean like it it's whatever yeah let's just this I agree I I agree but I'm you know it's it's I don't know for the Batman Beyond Canon exactly what the age difference was you usually figure Batgirl starts at what 16 17 somewhere in there and at that point Batman's already been Batman a few years he's usually picking up at 30 he's becoming Batman at 30 so maybe he's 3at 32 the godamn Batman so there's at least a good 15 to 16 years that's not bad I say not bad because he's time out too I'm sure she was legal so I'm sure she was she's legal he's 20s she's dude there's OB say 3520 is the when it",
      "start": 2033.64
    },
    {
      "text": "at least a good 15 to 16 years that's not bad I say not bad because he's time out too I'm sure she was legal so I'm sure she was she's legal he's 20s she's dude there's OB say 3 520 is the when it happens yeah 352 yeah how's that let's say 21 just cuz you got to take her to a bar be able to take her well first off no he does Bruce Wayne is not taking Barbara Gordon the librarian anywhere that's **** weird everyone would be like he a weird coupling huh that would be true yeah that's very true okay Bruce Wayne is going for the sexy starlets he's not going for for the cover of course not they're having sex yeah to the pregnancy point it wasn't just a one time thing this was like a hey come you're going to be going to drop by The Manor tonight or is it your place well I'm sure they went out in crime fought and then got it on in places similar to The New 52 when Batman was **** Catwoman and that was awesome see I don't like this and let me tell you why there was a small hint and I think it",
      "start": 2073.08
    },
    {
      "text": "in crime fought and then got it on in places similar to The New 52 when Batman was **** Catwoman and that was awesome see I don't like this and let me tell you why there was a small hint and I think it was a Justice League Unlimited MH where Batman and Wonder Woman had a thing for a second yeah yeah yeah they were they that was they were building to that for they were building to that I love that yeah they Opposites Attract right it could be more opposite she's a superhuman like you know kind of crazy Amazonian and he's Batman yeah so you know the Dark Knight thought that was a really endearing way to connect two characters sure this just sounds like they're trying to sell issues which granted that's the business but like would Batman this is a guy who spent his entire life living a double life as Batman all he does is fight crime every day think when he's not fighting crime he's thinking about fighting crime the man has an iron Constitution why would he do this yeah you know he got",
      "start": 2121.12
    },
    {
      "text": "life as Batman all he does is fight crime every day think when he's not fighting crime he's thinking about fighting crime the man has an iron Constitution why would he do this yeah you know he got caught up in the moment I mean Barbara Gordon's hot first off not bad Barbara Gordon and I don't mean just hot in terms of physical attractiveness I mean she's smart she's funny I I I mean Oracle she's not paralyzed in this though is she no no no she's she's so Batgirl in this cuz that would add another dimension to it that would be right yeah yeah anyways no she's not paralyzed but Batman gets it on with Catwoman that's not a good idea he just it still happens yeah I get that though because okay with that one because that makes that kind of makes sense in that that is his real Persona is this guy who's attracted to this girl this woman who if he had just gone a little bit to one side he'd be that he'd be the person that doesn't give it the other the other added layer to this that is makes",
      "start": 2167.08
    },
    {
      "text": "guy who's attracted to this girl this woman who if he had just gone a little bit to one side he'd be that he'd be the person that doesn't give it the other the other added layer to this that is makes it even more **** up right is the fact that like he works so CL closely with Jim Gordon Commissioner Gordon her father oh my God you know what I mean this is like now dating your best friend's daughter on top of your son's ex-girlfriend SL maybe brother's ex-girlfriend think there so incestuous in this world yeah this is crazy I like that what comic book is this this is Batman Beyond 2.0 that was chapter 27 that had happened 28 it's like the 26 27 28 Arc where they're on right now cuz I guess I had missed this i'had been catching up on IGN.com Comics articles about all this right in the fact that in the Batman Beyond animated series series which I enjoyed but I had already I think I was already getting to the point where I was like not at home watching cartoons at this point so I was",
      "start": 2206.56
    },
    {
      "text": "that in the Batman Beyond animated series series which I enjoyed but I had already I think I was already getting to the point where I was like not at home watching cartoons at this point so I was catching it here and there and I was so you're only 25 exactly I was getting ready I had to go to work that's the only thing that skipped out on it but like they there's a whole thing of like they talk a little bit about it of like why like Dick doesn't come around and Dick isn't a part of their relationship and then they do like the uh uh Return of the Joker St storyline that looks back at like what happened you know what I mean but even that it's it's like implied by Barbara I guess in some conversations with Tera that like she had a a fling with Bruce but not like this whole relationship not that they had a baby that by the way what happens is in the flashbacks right Bruce of course finally tells dick that this happened you know what I mean dick beats the hell out of him and Bruce",
      "start": 2242.76
    },
    {
      "text": "not that they had a baby that by the way what happens is in the flashbacks right Bruce of course finally tells dick that this happened you know what I mean dick beats the hell out of him and Bruce doesn't fight back just takes the beating he deserves but while that's happening they like flash across town where Barber Gordon's fight or Barbara's fighting some people and she gets like not socked right in the gut and like doubles over in pain and like that's like the cue that she miscarried because of that spoilers so whatever I what that's where we're getting up on the thing fair enough fair enough this is crazy so comics in general seem to have taken this CRA I mean not that they weren't always crazy but now I feel like they can just be even more crazy this whole digital thing and like it's it's easier to make comics and distribute Comics like people are way more focused in on these like let's just have a crazy ass story see it's not even here's the thing is I don't like I'm with you that",
      "start": 2279.68
    },
    {
      "text": "easier to make comics and distribute Comics like people are way more focused in on these like let's just have a crazy ass story see it's not even here's the thing is I don't like I'm with you that I think the digital Comics I I've been saying since Injustice started in Smallville to an extent even though I think Smallville is way harder to follow now as a comic just because that's a whole different story but Injustice in particular right is telling the most fascinating DC comic stories right now in terms of superheroes and what's happening right and now this Batman Beyond is in the fold in the same way just in the fact that these are digital chapters like even Adventures to Superman uh they're digital chapters that are throw away like and not throwaway but they're not like you always talk about Joker they why doesn't Batman kill Joker right he doesn't kill Joker because you're talking about the main Batman series and there has to be an issue for this next book next month but there has",
      "start": 2317.56
    },
    {
      "text": "about Joker they why doesn't Batman kill Joker right he doesn't kill Joker because you're talking about the main Batman series and there has to be an issue for this next book next month but there has to be an issue for the next Batman book next week you know what I mean there's these different things so like all these have to keep getting out and not getting killed cuz otherwise they'd have nobody for him to fight or do right which is stupid and it sucks and I you know when you think about when you think about it on a logical level it's a pain in the butt sense like the Superman New 52 when they reboot when they started up new 52 right and Superman's going and he's just like this guy's made a fire and oh this like like this is boring this sucks I don't even care about these people you know what I mean cuz like why are you you have to waste time to get to the next Lex story I didn't get to the next thing there's all these filler Comics filler story lines in between whereas the digital",
      "start": 2353.92
    },
    {
      "text": "what I mean cuz like why are you you have to waste time to get to the next Lex story I didn't get to the next thing there's all these filler Comics filler story lines in between whereas the digital stuff where like all right Tom Taylor here's Injustice you know we have the game there's a little bit of a backstory you get to just tell whatever story you want now and he gets to do the thing where Superman's ruling the world you know what I mean and talking about what that he gets to kill characters that would never get killed in Canon same thing like you know like oh Dr. Ock taking over Spider-Man's body and then a year later all right Spider-Man's back and Oh Captain America's Dead all right Captain America's back like you have to do that over and over again where with the digital books you get to do whatever and this is why I'm always stressing and i'I've brought it up before to Jim Lee and like when I'll do these interviews at ComicCon and of course goes nowhere is that I would love",
      "start": 2386.92
    },
    {
      "text": "get to do whatever and this is why I'm always stressing and i'I've brought it up before to Jim Lee and like when I'll do these interviews at ComicCon and of course goes nowhere is that I would love to see uh basically the month-to-month books the Canon universe is just done away with I would rather you say you're the Grant Morrison you're this amazing Comics writer here Superman tell whatever story you want you get 12 issues to do it and then when that ends that's it that's done it's like Kingdom they do those they don't don't they do those like like limited runs yeah they but they don't that's not the I want that to be the norm I want it to be you're getting a year of Grant Morrison telling this Superman story and when it's done there's no Canon to worry about there's no complicated relationship to worry about so you want the Wolverine you don't want the Days of Future Past like you want oneoff cool stories that you can do whatever the hell you want with don't not handcuffed by",
      "start": 2420.56
    },
    {
      "text": "relationship to worry about so you want the Wolverine you don't want the Days of Future Past like you want oneoff cool stories that you can do whatever the hell you want with don't not handcuffed by having to tie it in with that happened 10 years ago exactly if you want to tell that story more power to you you know you get your year you get your story and you want to draw back and do like I mean and even this a terrible example but in terms of movies right you want to make Superman Returns and draw back to the Donner films more power to you you know what I mean like that's why I was bring up the one in the you know I did the episode of Gregway where I was like what Comics should you read I always call out last son the you know the Jeff John's uh Richard Donner last son Series right which is like Zod comes to Earth there's this kid that Lois and Clark try to adopt or whatever and it's like it's almost a sequel to the Richard Donner movies because it exists in this like odd space you",
      "start": 2461.56
    },
    {
      "text": "is like Zod comes to Earth there's this kid that Lois and Clark try to adopt or whatever and it's like it's almost a sequel to the Richard Donner movies because it exists in this like odd space you know what I mean of like it could be Zod space it exists in a space where it could be a Donner thing it could be its own story line this is the first time it's the first time he's met Zod n and Ursa you know what I mean it's like yes that's awesome just do that cuz we this is the same problem with the movies right like all right we're rebooting Spider-Man so you have to **** see his origin again hey hey hey guys Spider-Man needs our help swing all the cranes over here that was on the other day it was great let me uh ask you a quick question lay it on me first of all I heard I heard an aide Rumor for the Marvel fans out there that uh Beast was **** Jean Gray so I wanted to throw that out there real quick uh but why do the uh why did the villains and Superman uh why do they are are they so",
      "start": 2496.28
    },
    {
      "text": "for the Marvel fans out there that uh Beast was **** Jean Gray so I wanted to throw that out there real quick uh but why do the uh why did the villains and Superman uh why do they are are they so terrible compared to the villains and and say Batman sure why do they like I just don't I think there's no one interesting in that universe that I've ever seen that is like not really no it doesn't make any sense like he's he's you but but Superman is Superman right and Lex Luther is a h a normal person right you know it's it's like that's why it's interesting that Lex has to come at Superman in different ways not just fights not just fist fights he's always trying to tear down his life and it's also interesting the way that like you know Superman has nothing but morals and ethics un Le has none of that right like Superman sure could smash through the building and break his neck but he never would whereas Lex would do that in heartbeat if he could but he does he can't so it's so weird this",
      "start": 2537.16
    },
    {
      "text": "of that right like Superman sure could smash through the building and break his neck but he never would whereas Lex would do that in heartbeat if he could but he does he can't so it's so weird this is the we this is the weird conundrum of comic books like why wouldn't Superman just kill Lex Luther told youi you know it's like you got but play play the game but it's a cop out what that is yeah if Lex Luther's doing all this terrible **** just kill him okay thank you now why doesn't President Obama just go kill every dictator in the world because that's not that's the exact same thing President Obama is bound by law America is a superow America superow America could do whatever it wants it could start a world a war with the whole planet if it wanted No One's Gonna Stop Superman No One's Gonna Stop America yeah yeah they would no it's it it's it doesn't make any sense it doesn't make any sense but but the bigger thing is that I've just never you know in all the Superman stuff I've seen",
      "start": 2580.6
    },
    {
      "text": "Stop America yeah yeah they would no it's it it's it doesn't make any sense it doesn't make any sense but but the bigger thing is that I've just never you know in all the Superman stuff I've seen where the movies or whatever it like I just there's just no interesting villains and that's what really bums me out sure you know I like the Batman villains and I just feel like Lex Luther is an interesting character but where is like the I need like a guy like you know that's a little they need they need new villains I agree I I I'm with you on that thing I think what you're talking too powerful though that's another problem again this gets into the whole thing the ree movies ruining everything I don't think he's as powerful as you think he is but that's beside the point that's another argument he can fly through space the vacuum of space how does he breathe he does he can hold his breath it sucks it's stupid have you been reading the Batman ongoing right now yes Scott Snyder yeah like the zeroy",
      "start": 2620.24
    },
    {
      "text": "can fly through space the vacuum of space how does he breathe he does he can hold his breath it sucks it's stupid have you been reading the Batman ongoing right now yes Scott Snyder yeah like the zero year thing yeah for a while were they not releasing issues yeah they weren't going concurrently for a while there okay cuz I feel like there was a huge gap and I was like where the **** the yeah they just had some stuff in the middle of it it was it got off track that that was too bad because the Scott Center stuff's great yeah uh and back to what you're saying though I think uh yeah Batman's villains are all more cerebral right they have to think and I think the fact that a lot of people I mean Superman gets created right and you can I think they're lazy with him for 30 40 50 years right of just like well throw this giant guy at him to fight and they'll do it again next time it it'll be this giant robot and it'll be you know what I mean like the great example was today uh you know Robin",
      "start": 2657.96
    },
    {
      "text": "just like well throw this giant guy at him to fight and they'll do it again next time it it'll be this giant robot and it'll be you know what I mean like the great example was today uh you know Robin Williams passed away this week while that we're recording and obviously there's been a lot of stuff shared lately about like trying to get people out of you know not get them out of depression but like hey if you are depressed here's some help y y and uh one of our fans actually I want to say it was one of the Dos Brothers I'm I'm sorry if it wasn't sent me uh a link and it was to a Tumblr that was uh from the H Strazinsky run of Superman when he walked across the country to get back in touch with Earth because he'd been gone for so long uh and he he's walking across country and he comes across a girl who's getting ready to jump right and it's like a seven page dialogue with her where he's like he flies up to talk to her and she's like freaking out that you know she wants to end her life",
      "start": 2695.16
    },
    {
      "text": "a girl who's getting ready to jump right and it's like a seven page dialogue with her where he's like he flies up to talk to her and she's like freaking out that you know she wants to end her life or whatever and she's getting ready to and how bad everything is and Superman's like you know she's like talking to Superman she's like you always you know I I've read that you always keep your word right like you never break your word he's like yeah that's true and she's like you know I need you to give me I'll let you keep talk I'll let you talk to me as long as you want to as long as you give me your your word that if I jump you won't save me and he's like all right I'll give you my word like blah blah and so they he sits there and talks to her for like seven pages trying to talk her off the ledge and be there for her and like there's this great like four panel spread where you're like she's like I'm done talking I don't want to talk anymore and he's like she's like my head hurt he's like",
      "start": 2735.48
    },
    {
      "text": "and be there for her and like there's this great like four panel spread where you're like she's like I'm done talking I don't want to talk anymore and he's like she's like my head hurt he's like I I'll wait don't worry and so there's this thing of him just sitting there hovering and like you know it's like clearly like you know midday then it's Dusk and then it's night time and like they put on a giant Spotlight up in the air on him she's like can you tell them to turn that off it hurts my eyes and he just looks down heat Visions it and breaks it and then he just like that's where like Superman works and I think belongs and exists the best I don't I don't enjoy a Superman story where he just goes and fights the giant monkey you know what I mean like I like Cheetos where he goes and fights Cheetos and takes down the evil president Scarpino no like I like I like when he's there being this you know human yeah he's acting a human he is a human he's showing his Humanity but he has all",
      "start": 2768.2
    },
    {
      "text": "Cheetos and takes down the evil president Scarpino no like I like I like when he's there being this you know human yeah he's acting a human he is a human he's showing his Humanity but he has all these amazing abilities to you know like that's great like you know what I mean like that's when I love Superman and that's what I really really love about him I just think that I have no problem with Clark Kent as a character I think the whole like you know the whole angle of him as a human or like because his normal person's cool and his love affair with Lois is interesting and Lex Luther is an interesting character it's just they need to tone his strength like his strengths down he can do everything like you're saying he's floating in the air and using his laser vision to like destroy this light and all this kind of so he can fly in space and there has to be like some sort and and his weakness is like this rock mhm I don't know it always bothered me when I was a kid when I watched Superman",
      "start": 2804.28
    },
    {
      "text": "and all this kind of so he can fly in space and there has to be like some sort and and his weakness is like this rock mhm I don't know it always bothered me when I was a kid when I watched Superman movies cuz it was just like again though the movies are what ruins you you got ruined by 30 to 50 years of laziness and they're doing interesting this is what I talk about with the Animated Series right like he's not all powerful in the Animated Series he isn't he has to wear a space suit when he goes to space like that's you know what I mean like there's differences here like where the Mythos has been expanded and twisted where it's not just but how does he survive the Van Allen radiation belt when he leaves the Earth you know what it's only the at what point does he not have the powers like if he goes under under a red sun when there is no sun final night of course when the sun was being eaten by the sun eater and there was no sun he wore he wore down over time oh that's crazy Superman",
      "start": 2844.44
    },
    {
      "text": "if he goes under under a red sun when there is no sun final night of course when the sun was being eaten by the sun eater and there was no sun he wore he wore down over time oh that's crazy Superman Superman Superman you should read Invincible I think the thing oh you should definitely read Invincible but I think the thing about Superman that I always love hate was that when I imagine when I think about the the sort of Pantheon of amazing Heroes right you got to have the Wolverine in them you got to have Batman in there those are fundamentally flawed characters they have weaknesses they have well Wolverine does I guess not have that many weaknesses but still he there's lots of psychology going on there right those are the characters I like to read when I imagine myself as a superhero you don't ever give yourself a weakness right and that's how I see that's Superman like I would be like well I want to fly I also want to be Invincible to stuff E I kind of want to be really fast",
      "start": 2881.56
    },
    {
      "text": "you don't ever give yourself a weakness right and that's how I see that's Superman like I would be like well I want to fly I also want to be Invincible to stuff E I kind of want to be really fast too and it would be cool to be able to see through stuff also I'd like to hear really far because then it's like you know hearing that's a stupid one I wouldn't want that it's awesome you can hear bullets coming from like miles away like going hit me and just die I don't care so yeah I mean it's it's awesome but yeah Colin's right I mean he does it's hard to write a good Superman St 100% that's it's hard to write a good Superman movie yeah I think he's just too much there's no conflict anyways back to Batman **** the **** out of Batgirl and giving her a baby that was crazy God I and it's one of those things I don't it's just never really occurred to me you know what I mean like somebody pointed out oh was in the interview I was reading on IGN right the fact that like and like guess like",
      "start": 2920.0
    },
    {
      "text": "of those things I don't it's just never really occurred to me you know what I mean like somebody pointed out oh was in the interview I was reading on IGN right the fact that like and like guess like Barbara or Batgirl's like second appearance on the Animated Series she has like a dream of kissing Batman and it's like oh like yeah but it never like I just in the same way we're talking about Superman like you know what I mean like that he's all these ethics and morals even though Batman's a flawed character I never thought in my head he'd be that flawed to like to give into weakness and like even kiss or let alone weakness but see I love that because that's what makes Batman Batman like sure he's got ethics but after a while he is just a man would break down that many lonely nights that much like violence would at some point there's going to be a maybe it's raining outside only looking at Alfred you got yeah Alfred's not little he's not a looker he's not helping you out when you're in",
      "start": 2958.36
    },
    {
      "text": "like violence would at some point there's going to be a maybe it's raining outside only looking at Alfred you got yeah Alfred's not little he's not a looker he's not helping you out when you're in need he has Alfred dress up sometimes I heard in the Wayne Manor and you know he just calls him Penny yeah Penny I don't know I'm not got with that um but I do think that there's something to that right like I think that there's obviously she idolizes him she wants to be Batgirl sure sure sure and there's going to be a certain amount of attraction that would happen to a man of his stature in both communities both the crime fighting and in both communities entrepreneur community entrepreneural community so yeah I mean I could definitely see it happen I think it's a very human it's just crazy I don't I've never really K given the idea much of a thought you know what I mean like we we talk about how like you know played out Comics are and like you've seen everything before and everything just",
      "start": 2997.48
    },
    {
      "text": "I've never really K given the idea much of a thought you know what I mean like we we talk about how like you know played out Comics are and like you've seen everything before and everything just gets recycled it's like I've never really thought about this and I guess one of the parts that I'm going back to with the fact that I'd love to see more limited issues and not have a continuity is like the fact that I've never really thought about or done is cuz they can't do that right they can't they can't do that and really **** up the universe in a way that really like Kingdom Come awesome so good and a good a standalone book right four things there you go let's take a step back though before we wrap this one up isn't that the whole when you were a kid and you imagine yourself maybe that was the only person that did this you imagine yourself as a superhero wasn't part of that that you got to get the girl like isn't that why we're so fascinated by watching these superheroes eventually",
      "start": 3042.96
    },
    {
      "text": "was the only person that did this you imagine yourself as a superhero wasn't part of that that you got to get the girl like isn't that why we're so fascinated by watching these superheroes eventually like pair up and get girlfriends the girl though that's the little girl that's what makes it weird like that's Robin's girl but at this point yeah right like I guess like you ship them you don't ship you and the fair enough he had Catwoman like that to me Catwoman was never going to happen he's never going to like settle down it did happen they had a kid that was of course pre pre- crisis thought had the kid with what's her name Al ghoul well that's that's post crisis pre new 52 that's a woman you marry no Talia will kill you in your sleep she loves you got to be wants she wants exactly and then when you don't do what she wants she tries to kill you and sends all our will you have something against strong women no I don't don't please people on the internet put words in my mouth all the",
      "start": 3075.68
    },
    {
      "text": "then when you don't do what she wants she tries to kill you and sends all our will you have something against strong women no I don't don't please people on the internet put words in my mouth all the time let's not go down that path right now wait until you see Beast banging out Jean Gray though I'm looking at in my mind now I don't they're banging out I'm not totally up to date on it but like they're not I'm just making that up no but there was a a thing where like damn it they were like into like past Jean Gray comes to the Future this is why are dumb yeah yeah there's like a dream sequence not dream sequence she goes in his head or something and she her psych Powers pretty much yeah and he's just like oh **** I did have a chance like he realized there was a moment that she was like into him I should have acted on that this is why Comics are silly because I made something up and it actually happened in the one yeah that's why Comics are silly not fiction Beast shouldn't be banging",
      "start": 3117.72
    },
    {
      "text": "him I should have acted on that this is why Comics are silly because I made something up and it actually happened in theone yeah that's why Comics are silly not fiction Beast shouldn't be banging anyone he's he's a normal man yes he is you don't he's a blue animal he's a mutant you're being against mutants right now you're being Prejudice I always like the Wolverine storm connection I'm going to put that out there as a final thought for me on this Wolverine storm okay they had a fun little hook up in a in the ultimate X-Men what was the one where he had no hand it was yeah as of Apocalypse they hooked up and she had the badass like Mohawk thought storm never got she never got enough like attention from the group if I had Storm sitting there I'd be like equal equal to Jean Gray I'm talking to this girl I'm talking to I either of those girls at the cool little table I know I'm still s with my kitty Pride K KY I like me some just cuz you just like saying kitty kitty kitty what about uh",
      "start": 3157.64
    },
    {
      "text": "to this girl I'm talking to I either of those girls at the cool little table I know I'm still s with my kitty Pride K KY I like me some just cuz you just like saying kitty kitty kitty what about uh Kitty the samurai chick Psylocke oh she was hot she had the best like the unitard or like the leotard outfit come on that's one of the only issues I've X-Men ever bought when I was like it was like bought the exact same one it was when she was on the cover like this is awesome it's one of the only issues I ever bought the one where she was on the cover yeah it was well guys we put her on the cover once never again but I think it was when she was maybe introduced she was kind of new or something like that I don't remember her really being a thing quick thing to blow your mind you know how you're talking about how you liked in Justice League Unlimited Batman and Wonder Woman keep in mind then that would be the same animated continuity that would eventually lead to this reality really so they",
      "start": 3201.88
    },
    {
      "text": "talking about how you liked in Justice League Unlimited Batman and Wonder Woman keep in mind then that would be the same animated continuity that would eventually lead to this reality really so they break up so where do I start when I want to start with it all starts with Batman Animated Series then Superman the Animated Series then Justice League then Justice League Unlimited then Batman Beyond then all the comic series based on no so well I've seen Batman Beyond also okay so what do you I don't what what the **** is your question thought was a digital comic you're talking about yeah yeah yeah so go buy the digital comic p on 2.0 yeah that's that's what I'm asking so that's that's where I start right got it sorry I wasn't understanding the question my bad I wasn't articulating properly real quick is Bishop and Cable still a thing yes in the Marvel Universe yeah MH okay just curious I liked them I liked them when I was young young man I liked Cable Marvel sucks Colin yeah what's",
      "start": 3240.04
    },
    {
      "text": "real quick is Bishop and Cable still a thing yes in the Marvel Universe yeah MH okay just curious I liked them I liked them when I was young young man I liked Cable Marvel sucks Colin yeah what's your talk uh I want to talk about Robin Williams uh we we mentioned him a little bit earlier but obviously as you said uh he committed suicide uh this week we're recording so people will be hearing it a week or so after that happened and it was very sad um uh you know Robin Williams is a very uh important comedian and actor I think a very an actor that showed a lot of range I think some of his best uh work were was actually when he played serious characters obviously he won an Academy Award for Goodwill Hunting but he was nominated for Dead Poet Society too and stuff like that which is maybe his best movie and some of his creepier roles I think were really interesting too one hour photo photo yeah I think it was like a really weird movie um it doesn't get enough credit people always talk",
      "start": 3274.92
    },
    {
      "text": "his best movie and some of his creepier roles I think were really interesting too one hour photo photo yeah I think it was like a really weird movie um it doesn't get enough credit people always talk about it you'll hear people I liked it a lot I like it was the kind of like horror or suspense movie I'm I was into you know what I mean like you knew this guy's off what's going to happen what is he going to do next yeah it was a really weird movie uh so I just want to kind of throw him out there see what you guys think of his career and and uh some of your favorite Robin Williams you know moments memories whatever um I know that when I was a young man Moran Mindy used to be on Nick and Knight and uh that show was on from like 78 82 or 83 so it was even before I was born but uh I used to think that show was hilarious and it was hilarious and the tie in the Happy Days um is a because that's that's in the same universe which is really weird um with Le and Shirley and all that other ****",
      "start": 3320.84
    },
    {
      "text": "that show was hilarious and it was hilarious and the tie in the Happy Days um is a because that's that's in the same universe which is really weird um with Le and Shirley and all that other **** too uh and uh I just thought that that I just thought he was really funny like that character was really funny and and uh genuine and and kind of pure you know like it question for you as the expert what in the Happy Days more commit thing which forgot all about so right there was it that Mor started on Happy Days or was it that they had two concurrent shows and then crossed over no the shows were in this as far as I understand he only appeared on Happy Days After Mor and Mindy was over oh and I think it was that it was just the same production team I think and it was in the same universe gotcha gotcha gotcha um so yeah I mean you know and I think about some of the movies you know Dead Poet Society I was watching the O Captain my Captain scene yesterday which is like such a poignant and",
      "start": 3360.4
    },
    {
      "text": "gotcha gotcha gotcha um so yeah I mean you know and I think about some of the movies you know Dead Poet Society I was watching the O Captain my Captain scene yesterday which is like such a poignant and Powerful scene that movie is just really fantastic it's a fantastic film um and then I'm thinking about Hook and I'm thinking about Jack and I'm thinking about Jumanji and you know and Goodwill Hunting obviously is you know way overplayed movie but um like it's on all the time Jack was awesome I remember seeing that in the theater that's the first movie I remember I remember crying to he was the big kid he was he was Aging in rever or was it just that he aged really quickly to be Robin Williams he was aging quickly he was like he was like a 10 year old boy but he was like an adult I forgot what it was but there's a scene in that movie that for some reason just resonated with me and I was a little kid but it like it hit me so hard that I was like man that's so sad that idea is so sad I remember",
      "start": 3400.48
    },
    {
      "text": "was but there's a scene in that movie that for some reason just resonated with me and I was a little kid but it like it hit me so hard that I was like man that's so sad that idea is so sad I remember just crying it was crazy yeah doesn't he doesn't he die yeah he like graduates right and yeah something like that I remember seeing it with my dad it was like when we used to go to the theaters on Saturday and see two movies and that was one of the movies we saw was 96 no thank you the other the quick as side about the movies when I went to see Godzilla and X-Men with Christine I was like oh yeah we'll go see a double feature of Godzilla and oh you're great like that was like the idea and then we're planning the day she's like all right so we'll go see the first movie and then we'll go to lunch and then we'll see the second movie I'm like well no that's what are we no and she's like why by the F I'm like what what do you think a double feature is she's like Well we'd buy I'm like no you",
      "start": 3440.96
    },
    {
      "text": "and then we'll see the second movie I'm like well no that's what are we no and she's like why by the F I'm like what what do you think a double feature is she's like Well we'd buy I'm like no you buy one ticket and then you can feed her hop she like I am not doing that I'm like all right I me I I haven't done that I haven't done that as an adult but I used that was my thing too I I used to do that all the time I do that with uh I used to do that all the time well I think I think in eth grade I saw like something about Mary and like some other random movie we used to go to the Glen after I mean like I'm again I'm junior high was the last time I did a double feature where I'm jumping around being stupid but anyway sorry yeah I probably did it like you know quite a few times yeah and hook man Hook was awesome was such a good movie yeah Rufio so awesome yeah Rufio is awesome the thing about Robin Williams now is like whenever people die nowadays in this the internet generation like you",
      "start": 3478.12
    },
    {
      "text": "man Hook was awesome was such a good movie yeah Rufio so awesome yeah Rufio is awesome the thing about Robin Williams now is like whenever people die nowadays in this the internet generation like you would see everyone's reactions like Twitter Facebook all that stuff then as the days goes on you start seeing the like more thoughtful like letters and stuff like his daughter right Zelda like put that thing and then um Rufio I forgot his the actor's name but like he wrote this like really heartfelt letteren seen and just like it's so hard to read these things and just be like man like you knew them like this sucks that you lost somebody like we all lost somebody but like you guys you're the ones that really lost someone well there was a a good comic that got tweeted today a web comic this woman Drew about how um battling her own depression right she's I I'm not familiar with her work but I think she's been cartooning on the web for a long long time and it was you know that she's known",
      "start": 3512.4
    },
    {
      "text": "woman Drew about how um battling her own depression right she's I I'm not familiar with her work but I think she's been cartooning on the web for a long long time and it was you know that she's known she's been depressed forever and she's not she's never been suicidal but more in the way of like she just if there would she Comics like if if there was a button that I could hit to make me not exist I would do it without a second thought or whatever and she like you know draws like you know her mom telling her she wasn't worth anything and her father saying that like people being really mean to her and now she's married and in this committed relationship with an awesome guy or whatever but same thing that she can't get over that and then like how this new you know that she felt really good I guess I'm I'm script the dates here today's Wednesday right so she felt really had a really good day Sunday and and like didn't feel that way right and then Monday she finds out Robin Williams is you",
      "start": 3552.16
    },
    {
      "text": "guess I'm I'm script the dates here today's Wednesday right so she felt really had a really good day Sunday and and like didn't feel that way right and then Monday she finds out Robin Williams is you know killed himself or whatever and it makes her immediately think about it again but then watching the world react to it and saying what we're saying right that like we are all devastated but then there's people who like know him and like family members and like that was her you know watching the world react let alone the people who actually know him like Zelda then you know gave her this new thing of like she's not going to do that she's not going to think that anymore she realizes what it would do to her family her friends and the great life she has now you know what I mean like she'll still have her bad days and y y but like she can keep this are like you know north star kind of thing and I thought that was you know interesting and fascinating a good thing to come out of this terrible",
      "start": 3587.96
    },
    {
      "text": "have her bad days and y y but like she can keep this are like you know north star kind of thing and I thought that was you know interesting and fascinating a good thing to come out of this terrible thing and that's what happens you know like when things are worst is when you get the best of something so yeah that's good uh yeah for me it was weird because it was a really long week it's been a really long week and we're recording on Wednesday so we got two more days but the news sort of hit as I was doing 50 different things I was like that's horrible but I don't really have time to take that in Flash Forward I drive home that night on Broadway and I hit Broadway and Steiner which is where the Mrs. Doubtfire house is and there's news trucks everywhere in a candle light Visual and I was like holy crap that actually like this is that somehow connected me a little bit more in a little bit more material manner than just the sort of reading the headline on Twitter and I was like wow that's",
      "start": 3623.64
    },
    {
      "text": "holy crap that actually like this is that somehow connected me a little bit more in a little bit more material manner than just the sort of reading the headline on Twitter and I was like wow that's like that's crazy like I can't I can't believe I I guess the hard thing for me to process because I'm not someone suffering from an Affliction like that is that I just don't get why if you had that it's it's hard cuz outwardly it looks like his life is amazing right the man has been uh one of the most revered actor / comedians since the 70s really I think right like he started doing those stand-ups and he just was you know I guess it was a hard life but he had great success and he struggled even then with addiction and all throughout these years and so it's so hard for me to figure out like what was the breaking point now CU to me if I had that going for me and granted yeah he's had a few movies lately that weren't great his show didn't get picked up again um but I I mean like that I'm sorry",
      "start": 3658.16
    },
    {
      "text": "was the breaking point now CU to me if I had that going for me and granted yeah he's had a few movies lately that weren't great his show didn't get picked up again um but I I mean like that I'm sorry go I I don't know if I don't know if that played into it I Me Maybe the thing about depression is that it doesn't make sense right that's the whole problem with depression is I don't even know if it's like some if things are pushing him over I mean people talk you know there's been so many stories about I'm dealing with depression or this you know you hear people talk about what it is and they're like cuz people are like he had a million dollars why wouldn't he be thrilled you know what I mean and they're like you have you know what makes you happy and it doesn't make you happy and you don't know why and you can't fix that you know what I mean that's crazy that's like crazy super hard this whole thing to me like you were saying that Mrs. Firehouse like it's it's so weird to me it hasn't",
      "start": 3701.76
    },
    {
      "text": "know why and you can't fix that you know what I mean that's crazy that's like crazy super hard this whole thing to me like you were saying that Mrs. Firehouse like it's it's so weird to me it hasn't still hasn't really hit me as hard as I think it might have a couple years ago uh Robin Williams lives in San Francisco like at least one of his houses in San Francisco not even Marin there's a oh you're saying it's one of his house I sering yeah one of his houses is in the um it's right right by Baker's Beach and it like it was like 10 minutes from the house I lived in growing up and every year at Halloween we go to his house and like he had this huge thing like he had these like giant dinosaurs that he'd bring out like giant dinosaurs and you put them out and then there would be a line of people you'd give everyone little glow sticks and like he'd personally give people candy no way really he gave you candy he wasn't there every year oh yeah a bunch of years I got candy from him like",
      "start": 3738.24
    },
    {
      "text": "people you'd give everyone little glow sticks and like he'd personally give people candy no way really he gave you candy he wasn't there every year oh yeah a bunch of years I got candy from him like all the time you just give it it was like going to his house for Halloween was like Halloween Halloween and so that was awesome but what was crazy too is like Robin Williams was like a neighborhood staple for me like growing up and I never really realized how like crazy it was because like I'd watch Hook or Aladdin and all this stuff and be like oh yeah it's him my mom would my mom would tell me how big a deal it was but I never really put it together but like we'd go to the playground and like his son would be there we'd go buy Pokemon cards and his son would be he'd be there with his son buying Pokemon cards and all that stuff and uh I'll never my favorite Robin Williams story is when we were me and my little brother went to Blockbuster and were going to rent movies I don't remember what",
      "start": 3778.52
    },
    {
      "text": "Pokemon cards and all that stuff and uh I'll never my favorite Robin Williams story is when we were me and my little brother went to Blockbuster and were going to rent movies I don't remember what I was renting but my brother was trying to buy You Got Served classic American classic it's on AMC's top 100 and uh Robin Williams is in front of us in line renting a movie at Blockbuster cuz that's what people do yeah and um we're going to we're going to do this he turns around to us he just starts talking to us like I I don't even know why and um then he just looks at my brother he looks he's like oh I'm in that and my like really he's just like no why are you getting that get something better and it was the best and yeah that's my Robin Williams story that's awesome yeah yeah that's yeah he's a he a special dude movie we haven't brought up that I'm not even saying as a joke Bicentennial Man I enjoyed Bicentennial Man yeah cuz it's just weird it's a weird movie it was weird it was",
      "start": 3815.28
    },
    {
      "text": "a he's a he a special dude movie we haven't brought up that I'm not even saying as a joke Bicentennial Man I enjoyed Bicentennial Man yeah cuz it's just weird it's a weird movie it was weird it was conceiv he great I did not like Flubber see I loved Flubber I was was old for exactly I was too old for the dance sequence home man yeah what I didn't realize about him was just that he was such a conflicted man like I don't know how I missed that cuz that seems to be pretty well known yeah but I didn't realize like who was it he they were saying like he was he had a pretty severe cocaine addiction I knew I knew about the addiction but he did coke with someone who died like that the night he did coke with him I I can't remember it's like another famous actor I can't remember the name I was just reading about it that Grantland did this like huge awesome piece on him that I was reading today and um I didn't realize that he was like so incredibly conflicted about like a lot of things in his",
      "start": 3857.28
    },
    {
      "text": "reading about it that Grantland did this like huge awesome piece on him that I was reading today and um I didn't realize that he was like so incredibly conflicted about like a lot of things in his life or whatever and one of the things I always appreciated about him and I don't think I even realized the level of it until I was reading about it too was just like I always knew he was like a nerd um which always let us connect with him or whatever obviously he named his daughter after you know the Legend of Zelda which is amazing and I was reading to that he named his son Cody After Final Fight really I didn't know that that's rad um which like I didn't know too um and uh so it's like and I was watching the Zelda commercials I remember seeing them on TV the um that he did with his daughter for the 3DS or Ocarina of Time re-release and I don't know he he just seemed like a really genuine person and like he always played a part that you can kind of relate to and it can make you sad I I",
      "start": 3901.04
    },
    {
      "text": "for the 3DS or Ocarina of Time re-release and I don't know he he just seemed like a really genuine person and like he always played a part that you can kind of relate to and it can make you sad I I remember being really kind of again caught up with this part part in Goodwill Hunting like I thought he was just really good in that movie and I know Ben Affleck and Matt Damon owe him a great deal for that playing that role and and they know it too yeah and they said I mean I think they've said as much and yeah Ben Affleck almost like Ben like I know but his tweet was about that yeah like you know what do you what do you owe a guy who gave you you know everything he's like the answer is everything I I screwed that up quot up but it's something nice so it's it's it's it's a sad thing it's it's definitely a loss for you know American Cinema and American Comedy and obviously the world and stuff and and I you know he was one of ours in this country like one of our great exports in terms of",
      "start": 3940.32
    },
    {
      "text": "definitely a loss for you know American Cinema and American Comedy and obviously the world and stuff and and I you know he was one of ours in this country like one of our great exports in terms of comedy and and acting and it's sad that you know it's sad that you could be so profoundly sick that like like Nick was saying like situations that people would you know really kill to be in like have all the money in the world you want you never have to work again you work CU you want to yeah you're beloved in your neighborhood and your community and in the country in the world and that's still there's still something nagging at you there feel something yeah and it's like that's profound and **** up and uh sad and it's too bad that he had to be found like that by people you know the way he killed himself with people that loved him and you know it's it's a bummer like he's definitely you know he's one of the first actors that have died uh for Our Generation where like we really knew him MH",
      "start": 3979.88
    },
    {
      "text": "himself with people that loved him and you know it's it's a bummer like he's definitely you know he's one of the first actors that have died uh for Our Generation where like we really knew him MH you know and he was really super prominent it's always sad when someone dies and like you know someone like Heath Ledger dies and it's profoundly sad and he's a great actor talented actor we didn't know what he could do quite yet you know he was just kind of coming into his own with with Joker and all those kinds of things obviously did a bunch of roles before that people really loved and but Robin Williams we saw like a whole lifetimes catalog and now we don't have him anymore that's kind of it's kind of **** up yeah I remember when I was a kid this is that I mean this is just my sort of not a memory of Rob Williams but this is something that like I I I would have liked to have said thank you for as I was not a huge Disney fan when I was a kid I just I you you I'd watch Disney movies",
      "start": 4025.88
    },
    {
      "text": "not a memory of Rob Williams but this is something that like I I I would have liked to have said thank you for as I was not a huge Disney fan when I was a kid I just I you you I'd watch Disney movies growing up uh and you're like okay this a tune so sure I'll watch it you get to Aladdin mhm he was one of the first people in a Disney movie there I was like this is a different take on what I had grown up with this is a really funny really almost kind of adult character that they've put into this to really kind of shake things up and from that point on I started paying attention to those movies CU I was like if they can get me with this what do they got next to their sleeves and I think I can't remember what the next one was I think maybe it was like Lion King and then I was like Hook come on yeah dude oh Aladdin was so good Genie was so like Genie specifically you're right like he's the character he make the movie you can't you can't have Aladdin that movie would have tanked without",
      "start": 4063.96
    },
    {
      "text": "on yeah dude oh Aladdin was so good Genie was so like Genie specifically you're right like he's the character he make the movie you can't you can't have Aladdin that movie would have tanked without him well I would have what's funny I think I actually told the story before on the show but um Robin Williams said he'd only do Aladdin if he wasn't the the top billing on the um poster mhm and they **** that up I don't know if you guys remember he didn't want his character to be the biggest thing the genie is the whole top half of the poster so he got pissed at Disney and like sued him and like got super angry and didn't do the sequel and then he came back for the third one cuz he was just like I like this character like s but the character made the movie why it deserves top building it's the best he doesn't want it to be that way yeah he he didn't want it to be people going for him he wanted it to be for I don't know other other stuff but Steve from Full House yep and uh so yeah Genie",
      "start": 4100.4
    },
    {
      "text": "best he doesn't want it to be that way. Yeah, he he didn't want it to be people going for him, he wanted it to be for I don't know other other stuff. But Steve from Full House, yep. And uh so yeah, Genie was played by some different dude in the in the second movie, but he came Robin Williams came back for the third and then the whole Aladdin series is like begins and ends with that one little the dude in the um the um desert, the desert guy that's like selling stuff and who has the lamp and like that's Genie. That's awesome. I haven't seen the second third one got excit I know, right? I was like no, I'm going back to that. Yeah, I'll just watch that final scene see what or have him Jumanji. I just saw Jumanji and I say just I remember at Moone when we were getting ready to go out the first time you seen it no no no it's the first time I seen it forever it was the last time I've seen it since this happened got it and uh yeah it was one of those where it started and then it was one of those movies",
      "start": 4144.44
    },
    {
      "text": "it no no no it's the first time I seen it forever it was the last time I've seen it since this happened got it and uh yeah it was one of those where it started and then it was one of those movies where like I just stopped getting and sat in the bed cuz I couldn't remember what exact like how do they get back and what happens and what it's there's that movie is one of those the few movies in my life that just like the random quotes will just always be in my head like one of the ones is just like oh what a little water ever do to someone he's like nothing but a lot could kill them I'm like whoa that's super deep Robin Williams yeah what year is it did you say The Fisher King uh no I didn't say the Oh I thought I heard you say The Fisher King cuz that's another great movie no but that was an amazing movie yeah I thought I could have SW say oh I said we got to finish the game that's what they kept saying you have to finish the game yeah she's like I don't want to finish the game that was",
      "start": 4185.16
    },
    {
      "text": "amazing movie yeah I thought I could have SW say oh I said we got to finish the game that's what they kept saying you have to finish the game yeah she's like I don't want to finish the game that was a good movie yeah a lot of good a lot of hits you said earlier you saying Cody that reminded me that you know when you're little and you play as the Ninja Turtles it's like I'm Leonardo and you're Donatello whatever so me and my brother my friend Kevin were always I was Leonardo my friend Kevin was Donatello my brother was Michael Angelo we never had a Raphael so we'd switch out with all the random kids at the park Cody he was our Raphael every once in a while oh yeah and that's fun that's awesome yeah was he a good actor like his dad I mean we had fun I don't I I I didn't even relate that he was sure sure you didn't yeah it was fun cool that's cool that you had that connection it's very cool very random I never I'm looking up I'm looking up the kids because I don't think I've ever seen pictures",
      "start": 4222.28
    },
    {
      "text": "sure you didn't yeah it was fun cool that's cool that you had that connection it's very cool very random I never I'm looking up I'm looking up the kids because I don't think I've ever seen pictures of them I think Zelda I saw her Twitter yesterday because of course everyone was like retweeting her yeah or two days ago yeah um but I don't think I've ever seen a kid well Tim's leaving already Tim you taking off no he's checking the information the battery we're we're on battery power today so we're making sure we work but we're done anyway of course rest in peace Robin Williams uh ladies and gentlemen tell us in the comments of course your favorite Robin Williams memory if you can top being his best friend growing up with them in the neighborhood getting candy meeting him at Blockbuster let us know and of course not sign cliched if you're going through anything reach out for help you're our best friend we tell you that all the time obviously we're not making that up you know more about",
      "start": 4257.88
    },
    {
      "text": "us know and of course not sign cliched if you're going through anything reach out for help you're our best friend we tell you that all the time obviously we're not making that up you know more about us by watching these shows than our friends and parents probably do so make sure you take care of yourselves you know we're always there for you in the whatever way we can be unless I've muted you on Twitter because you were annoying me ladies and gentlemen that's the GameOverGreggy Show remember every Friday you can pick it up over at Bandcamp it's gameover.bandcamp.com $1 gets the entire MP3 uncut no problems you get it you're good you're great great if you don't want to give us the dollar I totally understand go to youtube.com SL gameoverguggy Monday through Thursday every topic is broken out one by one until we post the whole show for free on Friday but then you can just go to Bandcamp buy the one for a dollar and have a great time go to Districtlines.com gameoverguggy buy",
      "start": 4295.72
    },
    {
      "text": "broken out one by one until we post the whole show for free on Friday but then you can just go to Bandcamp buy the one for a dollar and have a great time go to Districtlines .com gameoverguggy buy T-shirts cups and stickers right now Nick is hard at work I'm sure I'm doing it right now I'm writing notes down posting the campaign shirts Morard Miller Scarpino Gettys we're giving you one month to buy them and then we'll see who is the more successful presidential ticket love guys and then we'll leave them up I'm sure through like 2016 do you like parties and love or do you like a balanced economy that doesn't do you like a do you like jobs yeah do you like Security taxes having military look if you don't have a job you don't have to pay taxes you just go to the party all day long that's a good point ladies and gentlemen we'll be back next time but until then thank you for watching it's been our pleasure serving you [Music]",
      "start": 4334.24
    }
  ]
}
