{
    "id": 378,
    "video_id": "p8wt32bMTRQ",
    "show_name": "Portillo",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Wiener Dog vs. Savage Lobster - Portillo's August Barkbox Unboxing",
    "description": "See Portillo tear open a box of goodies, and then watch him ruin The GameOverGreggy Show...\n\nGet 10 percent off your BarkBox subscription here: http://www.barkbox.com/gameovergreggy\n\nFull Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1408723207,
    "duration": 233,
    "transcript_chunks": [
        {
            "text": "What's up everybody? It's me, Greg Miller, and if my cry baby dog didn't give it away, it's time for another Bark Box unboxing. Of course, this is Portillo, the true star of the GameOverGreggy show. He's being as good as he can. He's my nine-year-old wiener dog. He knows now, of course, that when this box shows up and it says BarkBox, or at least it smells like treats, it's his time of the month because every month BarkBox sends you and your furry friend a whole bunch of goodies. You subscribe, it's great. If you want 10% off your BarkBox subscription, all you have to do is go to barkbox.com/gameovergreggy. However, let's get Portillo in right now cuz he's dying. All right, you ready? Everybody set? Good. All right , P, tell you ready? Let's unbox it. What's in there? Get in there. What's in there? I'll take the card. You always have a problem with Jesus. Okay, calm down. All right. Okay. Well, first off, you've taken a lobster. I like that. Uh, BarkBox, of course, every month has a theme. This one's theme is the Hoy M.",
            "start": 0.16
        },
        {
            "text": "You always have a problem with Jesus. Okay, calm down. All right. Okay. Well, first off, you've taken a lobster. I like that . Uh, BarkBox, of course, every month has a theme. This one's theme is the Hoy M. We're going nautical, it looks like. Portillo has taken a liking to the PetRageous Lobster. Taking a dip in the ocean, a backyard pool, or just the bathtub, this Lobster is waiting to splash around with your pup for some floating fun. No pinching, we promise. How adorable was that? All right, let's see what else we got here in the blue bag. We got, oh my goodness, oh, more Boe Bakery stuff. P, you love this. This the one, this one of this is still the card. You don't care about the card. Nobody cares about the card. This lobster roll treats. Cy, you had these, the bones, the chicken cordon bleu bones. These people had done a few months back, loved them, ate them all. Now he's incredibly excited already. You can see we got a lobster roll. Let's pull back. Oh, there's still cute little bones. P, they just smell like",
            "start": 34.44
        },
        {
            "text": "had done a few months back, loved them, ate them all. Now he's incredibly excited already. You can see we got a lobster roll. Let's pull back. Oh, there's still cute little bones. P, they just smell like nothing to me, but you want it? There you go. Yeah, you want it? Get up in there. P, thank you, Bois. You always do good stuff for them. Let's see what else we got going. Oh, goodness, Portillo. Oh, I'll give you another treat before I get into that one. This one is the Daily Essentials chicken breast jerky treats. Let's get in there. Oh, party, you're getting so fat tonight. Oh, you're so fat. These are huge. Just take part of it. Oh, oh, well, there you go. There you got a big part of it, but you got a part. It's all that matters. There you go, party. We're good. You want, I'll give you another half one so I can at least get the next two things out cuz the next two things look like they're more things for Daddy taking care of a dog than what a dog would care about. So you come and eat this one now, though. This is this is a",
            "start": 75.72
        },
        {
            "text": "the next two things out cuz the next two things look like they're more things for Daddy taking care of a dog than what a dog would care about. So you come and eat this one now, though. This is this is a big one right here. Portillo, of course, known for his blue bow tie, but it looks like this one's BarkBox comes with yep, a safe made nautical bandana. Oh my goodness, what a cute nautical dog. P, you're ready for the ocean? Are you ready to go swimming? All right, and last but certainly not least, we have the Muddy Buddy dog mop. What does it do? It soaks up to seven times its weight in water and mud, dries five times faster than regular towels. P gets baths all the time and then he runs around the house and he's super cold. Now that won't be a problem. Keeps going. Oh, oh, it's like this. I thought something was wrong with it, but it's like this. So you dry the dog's head like this, you dry the dog's body like this. Okay, you get your, there's your Lobster, huh? Mr. Nautical, Mr. Mr. Now use one more food. Come here.",
            "start": 114.88
        },
        {
            "text": "was wrong with it, but it's like this. So you dry the dog's head like this, you dry the dog's body like this. Okay, you get your, there's your Lobster, huh? Mr. Nautical, Mr. Mr. Now use one more food. Come here. You'll get more. Sit, chill out with this. This guy, get all this over here just for the actra. All right, that's all we got to do. P, this is any want how to give you this is too much for how you know it's too much for he's a tiny dog. Look at how that that the the jerky is literally the length of his stomach. Luckily, he never eats anything. I'm working on it. Don't hit my hand. So there you have it, ladies and gentlemen, another successful BarkBox unboxing. Remember, you can go to barkbox. com/gameovergreggy, get 10% off your subscription. Every month they'd give you a box filled with treats and goodies and things to keep you sane because you clearly have an insane K9 in your house. Until next time, Portillo and I will be waiting for you here on youtube. com/gameovergreggy.",
            "start": 162.76
        }
    ]
}