{
    "id": 1673,
    "video_id": "D5k8x09331w",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Critical Role x Kinda Funny: Dungeons & Dragons - The GameOverGreggy Show Ep. 123 (Pt. 2)",
    "description": "The amazing Matthew Mercer, Laura Bailey, Travis Willingham, and Marisha Ray of Critical Role join us to play Dungeons & Dragons.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1460444400,
    "duration": 1407,
    "transcript_chunks": [
        {
            "text": "welcome back everybody to The GameOverGreggy Show Critical Role x Kinda Funny crossover just joining us I'm already unconscious cuz Nick the Mage is a God bless you Nick the m so glad he did that I will say that the irony is that you wanted to be here and you're the one who ended up making another attack by the way scw oh yeah I'm definitely going to make another attack I came off the bench from these guys I'm I'm attacking Jester that's no I'm Julian Julian all right goad R for Attack on why I can't understand you you don't sound like you're attacking Julian thank you very much get to the all right that's 22 what's your armor class 21 21 that hits you take 15 points of bludgeoning damage from the Heavy Club of B the Hill Giant get blud God damn it Nick is it just going to be me left that's Nick do you have healing spells you revival spells let me see do I as a wizard you do not have healing spells these two here have some healing the cleric but I'm talking crap to them this",
            "start": 2.85
        },
        {
            "text": "that's Nick do you have healing spells you revive spells let me see do I as a wizard you do not have healing spells these two here have some healing the cleric but I'm talking **** to them this entire time I'm un can I make my dog do **** well I'm about to do that for you right now so the dog that's rushed up to Nick the Mage is going to go had an attempt to bite you with its giant snash Dire Wolf clf and rolls is six it misses your small frame is too small and you manag to dodge out of the way unharmed okay you're tiny dim siiz frame tiny frame again again it is if you take an overall average I am right in the **** midle okay aage how could any woman to C you're up plenty of women up plenty of women have L me I've had the love of many a bar me money I would like to rush up to uh giant ass damn it with my werewolf rage and I would like to uh using my dueling style attack can I say Waits is that how this works a reaction shout it yeah okay and using a dueling strip with my extra\n\nCorrected chunk:\n\nthat's Nick do you have healing spells you revive spells let me see do I as a wizard you do not have healing spells these two here have some healing the cleric but I'm talking **** to them this entire time I'm un can I make my dog do **** well I'm about to do that for you right now so the dog that's rushed up to Nick the Mage is going to go had an attempt to bite you with its giant snash Dire Wolf clf and rolls is six it misses your small frame is too small and you managed to dodge out of the way unharmed okay you're tiny dim size frame tiny frame again again it is if you take an overall average I am right in the **** middle okay age how could any woman to C you're up plenty of women up plenty of women have L me I've had the love of many a bar me money I would like to rush up to uh giant ass damn it with my werewolf rage and I would like to uh using my dueling style attack can I say Waits is that how this works a reaction shout it yeah okay and using a dueling strip with my extra\n\nCorrected errors:\n\n- \"manag\" -> \"managed\"\n- \"siiz\" -> \"size\"\n- \"midle\" -> \"middle\"\n- \"aage\" -> \"age\"\n- \"C\" -> (no change, assuming it's an abbreviation or typo)\n- \"L me\" -> (no change, assuming it's a typo or colloquialism)",
            "start": 70.64
        },
        {
            "text": "ass damn it with my werewolf rage and I would like to uh using my dueling style attack can I say \"Waits\" is that how this works, a reaction shout, it yeah okay and using a dueling strip with my extra attack, my long sword and and cut him oh go forward and a 17 a 17 what's your armor class 13 that does hit yeah and the second one we killing it today I think I'm unconscious you'll find out you'll find out damage in the first strike okay uh that's 12 + 1 D6 is uh 13 I'm actually so you take 13 points of damage where are you at now I'm dead or unconscious if that's pretty almost you have a little bit little bit of life left the second one is a four plus 7, four * 2 oh right plus a D6 * 2 definit dead so eight and six so 14 plus I don't know uh seven how do you want to do this so you see this Rush this this werewolf rushed towards you uh uh cold energy encased blade streaking in the air and and I jump up with my long sword and I plunge it into his throat I thought you were a wolf yeah shut up",
            "start": 133.28
        },
        {
            "text": "this this werewolf rushed towards you uh uh cold energy encased blade streaking in the air and and I jump up with my long sword and I plunge it into his throat I thought you were a wolf yeah shut up and I plunge it into his throat and I ride his chest all the way down opening up his thorax what happens when you get to the **** you leave that admire and then keep sliding as as you as you feel the life blood draining from your body about the last thing and that at least consoles your end is the fact that you somewhat impressed this werewolf on the way down at least I died with purpose tell the stories of my goodness tell stories of my girl all right uh so that that finishes your turn um all right Democrat you're up I'm against the wall I guess right because I'm still within the and there's still the where the uh the direwolf the direwolf which has help your boy out here so I want to turn around I I'll I'll expose myself not like that what's the next on that I think that's a persuasion",
            "start": 201.88
        },
        {
            "text": "still the where the uh the direwolf the direwolf which has helped your boy out here so I want to turn around I I'll I'll expose myself not like that what's the next one that I think that's a persuasion role like okay because establish dominance make yourself look bigger large person all right so uh because it doesn't see you and you're hidden you have an advantage on the attack and so that means is you roll two d20s and take the higher of the two okay oh nine n is the higher one terrible plus oh three right that hits oh oh man I was bad I rolled wait I rolled did I roll did I say I rolled a one you did but it's not a blunder like is it it is if you if but with Advantage you take the higher the the one so it doesn't count okay Co so go ahead and roll the sneak attack damage on that what is where is the sneak attack it would it is a plus seven on sneak I'm sorry I can't read these new I can't read these oh no worse so I'm I'm just rolling a 1d8 you're plus and then on the very bottom",
            "start": 260.76
        },
        {
            "text": "where is the sneak attack it would it is a plus seven on sneak I'm sorry I cant read these new I cant read these oh no wor so Im Im just rolling a 1 d8 youre plus and then on the very bottom it should say oh sneak attack okay already on a level five its 3 D6 so eight so 12 Real Americans american6 I dont know where any my D6 you dont even know your **** group name Im unconscious I dont even know were Im talking from dream state so six was the the sneak attack damage uh plus 12 all right great so 18 18 nice so with that singular bolt jamming itself into the side of the direwolfs head you can see it Saks out trying to thrash about scratching towards the ear where the bolt currently embedded itself in the back of its head uh its looking pretty H its not quite in depth store but its looking a little rough um Nick try to talk to it yeah you can attempt to rehide if you want to yeah I will hide again okay its right next to you just another Fireball take with me come on",
            "start": 320.64
        },
        {
            "text": "but it's looking a little rough um Nick try to talk to it yeah you can attempt to re-hide if you want to yeah I will hide again okay it's right next to you just another Fireball take with me come on sure if you are sure but was he impressed that I exposed myself I think everyone was fairly impressed you exposed yourself a bold strategy all right Jester you're up it's my turn I skip over to um stupid voice on the ground hey that's me stupid voice KCK him in the kill him I step on him and say oh I think you might be unconscious and I cast um Spare the Dying on him oh you can kill him though immediately stabilizes him correct so you are no longer dying you are stabilized you're not conscious God **** damn it but you're not dying cool I don't feel like healing you yet see and then um I use my Spiritual Weapon to turn around still looking like it's coming oh I make my Illusion walk over to him too all right so Spiritual Weapon looks like it's coming from that thing and I oh I",
            "start": 376.8
        },
        {
            "text": "I use my spiritual weapon to turn around, still looking like it's coming. Oh, I make my illusion walk over to him, too. All right, so spiritual weapon looks like it's coming from that thing, and I... oh, I feel bad kicking a dog; it's a very big wolf, very nasty one. I raise the foot high in the air and I stomp on them from above. All right, go ahead and roll for the uh spell attack on that. Okay, it's plus six, oh um 12, uh plus six plus six - that hits. Okay, cool, and then what do we do? Uh, it's the 1d8 plus three big money; 9, 11 points of damage. All righty, this time with the uh your sacred weapon, this time slamming into the side of the direwolf. You can see between the blow from the bolt on the side of its head and the the Divine impact from the spell it's starting to rock its head, and you can see its eyes kind of rolling around in its sockets. It's a little uh it's it's a little beaten up and trying to get its bearings right now; it's not looking too good. Uh, anying gestur turn that brings us to uh Pterodon.",
            "start": 438.92
        },
        {
            "text": "of rolling around in its sockets it's a little uh it's it's a little beaten up and trying to get its bearings right now it's not looking too good uh anything gesturing turn that brings us to uh Pterodon you are currently unconscious and stz just go ahead and roll a D20 for me sure you died four all right you're fine all right cool I'm going to get a beer Julian you're up anybody need good thank you well I was going to heal Teragon but he just walked away still he's on the ground speaking to you from the dream state all right I'm in the space between spaces the others Julian Who's down and kind of like shielding from that fireball looks over and sees Pterodon, Master Cff please show some respect I kind of hobble over a little bit and I I put my hands on him and I I I cast lay on yeah lay on hands like kind of for how many hit points um where where you hand where you laying your hands um only in the appr awward Greg kind of this is Pterodon talking from an unconscious dream state God",
            "start": 494.92
        },
        {
            "text": "on hands like kinda for how many hit points um where where you hand where you laying your hands um only in the awkward Greg kinda this is Pterodactyl talking from an unconscious dream state God forbid its a wet dream for once in Pterodactyl's life I kind of hold his face kind of hold his hold his head and I I heal you for five hit points okay so you're now conscious you come to conscious your eyes come into focus immediately look up and see uh a dirt smeared Dwarven female face looking at you with a sly grin my foot is still on yours bur and I punch him in the face I say you're good and I punch him in the face okay roll an attack you're going to make him unconscious again I rolled seven he's prone so you have the advantage on it oh **** 9 + 7 so 15 15 uh 16 what's your armor class armor class 19 yeah so you go and you punch but it hits the armor and kinda hurts your fingers whatever you you all right I'm here I'm back yeah what's up everybody its me Teran on Master CL where",
            "start": 551.88
        },
        {
            "text": "armor class 19 yeah so you go and you punch but it hits the armor and kind of hurts your fingers whatever you you all right I'm here I'm back yeah what's up everybody it's me Greg on Master CL where is the Giant and Julian still he starts crawling away and it's just like **** Nick the Mage your all right here we go noong okay I'm just a dwarf what you got now can I ask a question before I pass is either the Scorching Ray or a Magic Missile going to **** everyone up around me no no they're both very specific to a creature Fireball is the only real dangerous spell you kind of came out of the gate with the uh the Spatial Awareness spell but but a hard lesson learned in the best way I want to use something called the Magic Missile classic yes yes a classic staple all right that's three missiles at level one so that's 3 D4 plus three you want to go ahead and get some get some force die over there another no those are they hit automatically you don't even have to roll",
            "start": 608.48
        },
        {
            "text": "that's three missiles at level one, so that's 3 D4 plus three. You want to go ahead and get some force die over there? Another no, those are they hit automatically, you don't even have to roll to hit because they're that awesome. So five, and then roll one more here, so eight plus three right? You said yep, 11. 11. How do you want to do this? So, so, that's that phrase means you got the final blow on this creature. I I want you to describe your epic cinematic destruction of this creature well Matt if you have to know this is what happened. This for the ladies my accuracy with magic Missile unparalleled as you all know as you all know straight into his mouth down his digestive tract blows out his everything all over the street hits a little bit on Teragon Mcleon over here damn it so he's just got wolf everything all over his face which actually based on that order gets mostly on Pterodon, a little bit on Jester, a little bit on Julian and a smattering on TOS Cobble damn it. Apologize matter",
            "start": 664.24
        },
        {
            "text": "just got wolf **** all over his face which actually based on that order gets mostly on Pterodon a little bit on Jester a little bit on Julian and a smattering on TOS Cobble damn it apologize matter bro sorry for the wolf matter you hear a dying giant say from across the Alley's final breath you got smattered bro all righty so you all sit there kind of catching your breath considering this brief scuffle the fact that this giant hand watered into town and you all look at yourselves surviving and figuring out what is the next course of action to take in this endeavor who's the dick **** that launched the fireball just It Dem Nick what were you thinking it was it clearly I panicked is everyone all right Nick the m has not been in a lot of high right seems like Ter Don is hurting pretty bad uh you know I mean I got one one hit point right now do you want me to heal you I'd love that what will you pay me you have gold what do you got you got gold gold you should have at least five hit",
            "start": 714.12
        },
        {
            "text": "You know, I mean I got one one hit point right now. Do you want me to heal you? I'd love that. What will you pay me? You have gold. What do you got? You got gold. Gold. You should have at least five hit points up there. 160 yeah oh really I should have five well when they brought you back to stabilize you it should have brought you to zero why oh to start from zero she stabilizes him and brings him to zero, you to zero Z okay right exactly okay so yeah do Nega so it should be 39 damage. You have 160 gold. Yeah I'm not giving that up don't think at all respect you want to give some of it up though which she says it like that never to you kill him fine stay bleeding out I don't care I'll pay you to heal him what do you want I would like 25 gold please fine bar an entire okay just like a typical French person getting taken advantage of by American heroes and I did you think I'm French wow um and I use my Prayer of Healing on on him and anybody else that's that's hurting actually I use it on",
            "start": 780.0
        },
        {
            "text": "French person getting taken advantage of by American Heroes and I did you think I'm French wow um and I use my Prayer of Healing on on him and anybody else that's that's hurting actually I use it on everybody anybody that's hurt not you you mother 28 plus no no you're good I'm good come on really the Mage Nick the Mage didn't think any d that's not how Fuing Obama Fine as well what the hell there we go that works 13 hit points to got to whoever's hurt technically 13 13 up to six creatures so did you take any damage Nick did you take any damage Nope yeah so just the you two you goes all right Democrat Obama fan your generosity is truly legendary thank you should we find where this terrible giant came from yes of course for there's more coin in it for all of us I agree is there you don't know that that's my assumption we just killed one of the guys we didn't get any golden I'm almost dead we didn't get anything away wait I thought we were going after giant rats in the sewer oh",
            "start": 833.08
        },
        {
            "text": "don't know that that's my assumption we just killed one of the guys we didn't get any gold I'm almost dead we didn't get anything away wait I thought we were going after giant rats in the sewer oh yeah I assume that guy's dead chilling Finnwell you wrote his name down I didn't know what I didn't know what was going to be important I thought this was like Clue we should talk to Fin we should should wait wait wait I want to loot the body yeah all investigation which one the dog with no anus or no I want which is a horrible image by the way it's like a dark slip and slide out there right now it's just in my werewolf form I'm sniffing The Refuge of the anus are you eating it no maybe checking it out a little nine nine all right as you pour through the body of poor Bog uh you manage to somebody else roll you find a uh a singular potion uh actually you find on on his person what looks like one of the creatures that Bog had eaten and kind of strapped the decaying REM remnants",
            "start": 901.0
        },
        {
            "text": "to somebody else roll you find a uh a singular potion uh actually you find on on his person what looks like one of the creatures that Bog had eaten and kind of strapped the decaying remnants of this traveler within a part of a package there's mostly broken glass but there is an intact vial that contains a Potion of Gashes Form plus one Potion for me, Gashes Form. Nice! I rolled when you said to roll, I rolled 11. What happened? For investigation, yeah okay all right so as you both are angrily searching through you find this potion as you go through and find what appears to be a mostly nodon human hand that contains a singular ring. Awesome, the ring is quite shiny and amongst all the rest of the dirty looking interior of this bag it seems to be unscathed by the filth around it. Hand over the ring. Pterodon, no I'll fight you for! I cast Charm Person on Pterodon. Hey what's up? I'm Charming now go ahead and make a wisdom saving throw five plus confidence four. You're my favorite.",
            "start": 961.84
        },
        {
            "text": "The Ring Pterodon no, I'll fight you. I cast Charm Person on Pterodon. Hey, what's up? I'm Charming now. Go ahead and make a Wisdom saving throw: five plus confidence four. You're my favorite; you are the MVP candidate, Terod. On Master Cliff here reporting from Hell, so... So, Teron looking down at your ring, you look over, and you realize truly your life was saved by this Tling woman. And all this time through all these moments of frustration, uh, you never understood why you didn't just allow yourself to like her and be a friend before. I don't know... I feel like we've always been friends, and you never realized it before. Jester, yes, that ring is very beautiful. Would you like it? I would love it. Oh my God, here you go. So much. This has been a pleasure; we should hang out sometime. We all the time... All right, I don't like Nick. I'll talk to you later. What is it? You also acquired a Ring of the Ram. Ring of the Ram. I put it on. What does it mean? All right, it has three charges on it. You can expend.",
            "start": 1010.48
        },
        {
            "text": "I don't like Nick, I'll talk to you later. What is it? You also acquired a Ring of the Ram. I put it on. What does it mean? All right, it has three charges on it. You can expend a charge on the ring to uh, to cause a spectral ram head to appear and slam into something within 60 feet of you to do damage and push it back. Waa okay, Jester, you look so good in that ring. Thank you. You ever want to... you try it out and ram somebody? I'm here. Wow, I let you know if it's of interest to me anytime. Just let me... I'm here. It's cool. Talk to your other friends now. Totally. Which one would you like me to talk to? Go talk to that little halfling man. All right, cool. What do you want? What do you want me to say to Nick? Tell him he's very small, cute. Hey, Nick, what's up? Like we were just talking over there. Did you know you're small? It's not that I'm small; the rest of you are just tall. That's what I'm trying to say. You're just abnormally... tall all of you, Nick.",
            "start": 1068.72
        },
        {
            "text": "we were just talking over there did you know you're small it's not that I'm small the rest of you are just tall that's what I'm trying to say you're just abnormally **** tall all of you Nick you're unusually small even for a half you know I'm a quarter my sheet here hey hey hey whoa TOEFL no yeah no tol I'm Finn Finn TOEFL that's me T ey armed by the giant boulder I'm I'm not the boulder I'm good from the boulder but those giants those giants right forget the rats we're on the bigger things here Borg **** whatever his name was what was my last name B yeah I know he's dead thank God but uh The Troop who brings me the heads of these menacing Giants shall find their pockets 1,000 G wa th000 G so many G's wait so oh but more importantly they're Pro they will prove themselves the better hires for all to know in Thun's Crest that sounds like something that you guys might want this interests me yeah I'm so into this if I get the Thousand G I can give it to Jester and what do you what",
            "start": 1121.88
        },
        {
            "text": "\"Hires for all to know in Thun's Crest that sounds like something that you guys might want, this interests me. Yeah, I'm so into this. If I get the Thousand G, I can give it to Jester. And what do you... what would you get for a thousand G? I don't know. She loves probably gold. Is G the gold well Finn GP is gold pie. Yeah, Finn. I don't know if I want to work with these Riff rff to be real. I don't. I don't care really. I just need these Giants to get taken care of. You guys couldn't deal with the rats freaking Boulders coming and stuff like that. I feel like we're a pretty good team, if... if this hling here can control his fiery look. You can't control his giant fiery balls. Balls you know. I would never never go against you but just remember I mean like Nick the Mage is so small that it's hard for him to see where he's throwing. He's so like behind all of us we are we are merely passing through perhaps if we join up this one time we can split the Bounty with\"",
            "start": 1176.68
        },
        {
            "text": "Mage is so small that it's hard for him to see where he's throwing; he's so like behind all of us. We are merely passing through. Perhaps if we join up this one time, we can split the bounty with these Bumblebees and move on our way quickly. Forget not that I damaged that beast. You did quite a bit; you did. These two idiots didn't do anything. That's true. Uh, don't forget he was distracted by my body. Am I right? Don't forget, don't forget that I paid for the body. You're reviving me, pay me back. He who got the bad deal there. I'm just saying you're always out here talking about your Universal Health Care. He does have a wolf nose. Can I use my my um my heightened senses to smell where this giant has come from? Jesus, yes, you can. Uh, yeah, uh, your form actually, because you've been transformed for about a minute now, and your form begins to revert to your human form. Ban exactly, but but but your hybrid senses... Banner, forgive me. But your hybrid senses are your heightened senses; they can be used in",
            "start": 1229.8
        },
        {
            "text": "about a minute now, and your form begins to revert to your human form. But, but, but, your hybrid senses... banner, forgive me, but your hybrid senses are eerily heightened. Your heighten senses can be used in your regular form as well, you know, Wolverine style. You still have really good senses that's my Logan nose here we go. So, go ahead and make a yeah what is that? It's a perception check with advantage because oh snap! Dragon 12, hey there you go! Plus my... what is it nipples and balls? It's your perception BS, balls. Mhm. I should make it survival for this one because it would be tracking technically UH-60. Okay, so as you guys are all having this discussion, uh, the once werewolf now no longer werewolf begins skiing across the ground. You pick up a trail. You now see the giant has wandered through the outskirts of this edge of town and after you guys kind of give a little bit of chase leads outside of the village down into a ravine and what looks like uh over the hill into a large, cavernous opening in the ground.",
            "start": 1285.16
        },
        {
            "text": "this edge of town and after you guys kind of give a little bit of chase leads outside of the village down into a ravine and what looks like over the hill into a large, cavernous opening in the ground. Wait, he's running; he's running off on all fours like a dog. No, no, no, like a human. Oh, just like our friend David Banner, why be confused when you have a cousin that emulates him at every turn? David, get back in the house! It doesn't take long before you actually begin to locate the heavy footfall and the footprints within the muddy hillsides here of the giant and the creature that you just fought, uh, leading down into this giant foggy ravine known as the Devil's Basin. Oh, oh my gosh, that was B now. Real quick, I'm throwing up the agreed-upon sign before we break us from our RPG haze and ask you a real question as a human being, not as Pterodon Master CL, who's also a human being, but well, yeah, you know? Anyways, is there an end to Dungeons & Dragons or do our quests go on forever? Uh, well, there is an end.",
            "start": 1331.48
        },
        {
            "text": "As a human being not as Pterodon Master CL who's also a human being but well yeah you know anyways is there an end to Dungeons & Dragons or do our quests go on forever uh well there there is an end to this quest okay cool I'm going to do a topic break here cuz then we have an hour so we can do two 30 minute chunks let's do it",
            "start": 1385.12
        }
    ]
}