{
    "id": 1680,
    "video_id": "jYpUeOhmnP8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Critical Role x Kinda Funny: Dungeons & Dragons - The GameOverGreggy Show Ep. 123 (Pt. 4)",
    "description": "The amazing Matthew Mercer, Laura Bailey, Travis Willingham, and Marisha Ray of Critical Role join us to play Dungeons & Dragons.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1460617201,
    "duration": 1064,
    "transcript_chunks": [
        {
            "text": "we return to The GameOverGreggy Show across from Critical Role and Nick, the mage, the tiniest little little Mage on the team, he's trying though. Greg, you're so small, show me what you have, destroy them! This music is so good; I would like to use something called the Scorching Ray. Scorching Ray? He yeah, yes, dude, get into this. You get to shoot three Rays; you can choose all at one target or a different Target. Chose that do I, the Mage? I think you need to use this one for this big dog. I think it might dent the table. Yeah, please, yeah, use it on the pad if you want what would you stab your I hit it but I hit that the point he did three Rs. Nick, what are you aiming them at? Let's aim them all at the big one. All right, the W right there which you can see go for it so go ahead and you roll roll a 3 d20s sounds like a stupid ass plan, Nick, the Mage. That's a hit; 17 second one 12 12 with this plus seven that hits the third time do it plus seven that hits all three hits roll six D6",
            "start": 2.85
        },
        {
            "text": "you roll roll a 3 d20s sounds like a stupid ass plan Nick the Mage that's a hit 17 second one 12 12 with this plus seven that hits the third time do it plus seven that hits all three hits roll six D6 fire damage on you okay where's my other one well he made your die work shut up that's the dice that killed me in in our Critical Role game I thought nobody ever died in Critical Role wasn't that something you guys said no I died I was just brought back to life oh okay so like Travis though made a big deal my 19 19 points of fire damage to W Mark that down as these BL goes streaking into the front face and chest area of this giant burning burning the CH and jawls of W Jws what the **** is a jwel it's Nick do you want to stay where you guys they wanted to be king and queen they're in love this is what we're doing murdering up in front of each other I understand no one else can understand but yes your turn oh sorry I was making a monologue over here I I starting to feel bad when we",
            "start": 65.76
        },
        {
            "text": "this is what we're doing murdering up in front of each other I understand no one else can understand but yes your turn oh sorry I was making a monologue over here I I starting to feel bad when we started off in this Quest I was just like you guys a male human fighter just here making his gold and living out but then I fell in love with the one and only Chet  and it started as a charm well as most things do you slip somebody something and then it all just happens it all just happens but here we are should we try to talk to them again kill them I'd like to talk Jester you understand the connection we have the high fives we've shared the gold I've put over your eyes I know it's wonderful the ring you gave me now kill them you got it your Cris I'm going to come at him right now of course with the people are you going towards W or you going toward oh yeah I'm going towards all right go for it roll High 17 that's a hit roll again damn it four great you do have a fighter",
            "start": 123.84
        },
        {
            "text": "now of course, with the players are you going towards W or you going toward oh yeah I'm going towards all right go for it roll High 17 that's a hit roll again damn it four great you do have a fighter ability where once per turn you can do action surge and get two additional attacks I'll do action surge sure all right go for it can I also can I also use my potion right now as a bonus action you can yeah and how many points does that restore for you right now three six eight points you heal okay I'm plus and you get two more attacks to attempt seven you can also add plus eight right 15 plus seven choose to add a d I'm sorry I'm sorry plus if both hands I'm sorry yeah so that and third one remember she bled you 11 11 plus yeah that hits they have three attacks go and roll damage three times on W with that other one you're going to use uh you're using both hands I assume right one d10 too much we too much he did good so eight on that one three plus five that's 3 plus 5 okay so 13 Ed",
            "start": 172.56
        },
        {
            "text": "on W with that other one you're going to use uh you're using both hands I assume right one d10 too much we too much he did good so eight on that one three plus five that's 3 plus 5 okay so 13 Ed eight plus 5 so so 13 again yep so 26 D damn y'all **** yeah get it get it yes sir and 3 + 8 so 11 another 11 damage on top of that so 37 right 37 points of damage Dam as you go rushing forward screaming Jester out in the middle of the echoing Cavern floor your blade comes down once twice Thrice gashing giant wounds into the front of w the giant **** your jws JS Jester it's your turn oh okay um I'm going to use my channel Divinity and call the traveler again and then make duplicity on myself and make my illusion appear between the two of those dicks yeah right there all righty and then I'm going to use my bonus action to cast spiritual weapon again where spiritual weapon going to drop right in front of the woman woman there you go how does it sound when it drops okay good just like that",
            "start": 236.6
        },
        {
            "text": "to use my bonus action to cast spiritual weapon again, where spiritual weapon is going to drop right in front of the woman. Woman, there you go. How does it sound when it drops? Okay, good. Just like that. Needed something all right. Go ahead and roll for your spirit weapon attack. Come on! Yes, that's great. That'll hit. Go ahead and roll 1d8 + 3. Okay, okay, okay. Come on, you... die. Four points of spiritual damage. That's all right. The in gester turn to the top it is D's turn. Dunda having backed up and had this frustration happened is going to rush forward to the werewolf that is rushing in the shape of a bolo tie that tightened around its neck, the horrible sacred bolo tie. The traveler all right. Dunda, an angry being choked by the strange mystical neck accessory, uh, is going to unfurl all of her wrath against this this werewolf form before her. Toss cobbles there we go. That is a 23 to hit. That'll hit. And a 19 to hit. That also hits. All right, so you take a total of 24 points of bludgeoning damage. My",
            "start": 300.08
        },
        {
            "text": "this this werewolf form before her toss cobbles there we go that is a 23 to hit that'll hit and a 19 to hit that also hits all right so you take a total of 24 points of bludgeoning damage my resilient high this is true so you take 12 points of leg damage total so werewolves man so resilient werewolves man so resilient and she's going to back away you know if you get damage if the if the roll just a little bit seeing you unscathed by it you get attack of opportunity on her got that hits go damage beautiful this goes first five plus 13 it 15es 15 points of damage the blade streaks across her front you can see now she's starting to look a little hurt but she's both scared and the fury rising up inside her this is her last stand and she's going to do whatever it takes to survive save WS she loves him so much Demi I didn't move I'm still I'm still distance so I guess I'll use the crossbow again okay do you want to roll us another stealth check to see",
            "start": 358.28
        },
        {
            "text": "loves him so much Democrat what do you got come on Demi I I didn't move I'm still I'm still distant so I guess I'll use the crossbow again okay do you want to roll us another stealth check to see if you can stay hidden sure that's be fantastic go for it using your bonus action to hide 20 yeah some now go ahead and roll your attack in the crossbow natural 20 natural 20 six plus you have Advantage because you're not seeing currently roll again roll again H the two 20 the double natural 20 all right so go go ahead and roll your crossbow bolt damage plus the 3d6 okay it's three * 2 plus well it's three and then and then roll 3d6 and then multiply all that times two your D6 well use my D6 Nick the Mage is going to go potty classic Nick the Mage Nick the Mage just like your small statue your bladder is small but your small hands Brar plus whatever your bonuses for your crossbow uh plus plus four all right 22 points of crossbow bolt damage no math yeah so you take 24 points of",
            "start": 420.28
        },
        {
            "text": "statue your bladder is small but your small hands Brar plus whatever your bonuses for your crossbow uh plus plus four all right 22 points of crossbow bolt damage no math yeah so you take 24 points of crossbolt damage cool W how you looking W not looking good not looking good at all all right ending democrat's turn Julian you're up oh all right oh hello oh hello hello W um I'm going to say w Hi D aren't you tired of being **** whipped by her I am right she's a **** and I like I like you you dwarf really I like dwarfs well then I like J Sal move it to me and go what do you want me to do to you attack D command you cast command I cast command make it wisdom saving throw okay I'm kind of into it though yeah yeah okay so make it with make disadvantage disant so make it with disadvantage because you're into it okay so so roll again take the lower of the two take the eight it's a failure yeah good with that you're too good for her wolf I know you're too good I know I'm going to hit you",
            "start": 474.12
        },
        {
            "text": "you're into it okay so so roll again take the lower of the two take the eight it's a failure yeah good with that you're too good for her wolf I know you're too good I know I'm going to hit you it down who do I need to hit just tell me I'll do it for you I love you I've always loved you Jester you're not jce the one I love is Juli so much you stay away from Jester you're joining the party with your burnt JS but I won't touch my woman I gave her a ring and that means something in this Kingdom and with that angrily sing forward and slamming into the side of Dundra doing 18 points of bludgeoning damage with a great Club against your once love who you've now discarded for the dwarf momentarily we can rule this city yes we can as soon as you bludgeon Wolf which which as soon as you bludge in D in the face she looks at you what are you doing fool and all a sudden shut off the magic Fades from your brain and you realize oh oh I shouldn't have done that that dwarf must have",
            "start": 543.36
        },
        {
            "text": "as you bludge in D&D in the face she looks at you what are you doing, fool? And all of a sudden, shut off the magic fades from your brain, and you realize, oh, oh, I shouldn't have done that. That dwarf must have tricked me. No, I'm so confused. No, I liked the Jourd but now she betrayed me. Who can I love? Will I ever find love? Give an existential crisis. Are the bill giant still up? Both D&Ds are still up; however, you did take damage this last round. I need you to go ahead and make a Wisdom saving throw as the anger of the werewolf is now building up inside you. Oh no, that's a fail plus a saving throw so 15. You don't have 15. You succeed. You managed to withstand the bloodlust and not go raging and tearing into Pterodon. That's good. Big fan of you doing that. So what do you want to do? Uh, I rush at her; she's on last legs, right? Yeah, she's looking pretty rough. Yeah, I would like to give her what for. Please. All right, that's a natural 20. Oh my God, the third one no, that's wacky. It's so wacky.",
            "start": 601.12
        },
        {
            "text": "She's on last legs, right? Yeah, she's looking pretty rough. Yeah, I would like to give her what for, please. All right, that's a natural 20. Oh my God, the third one. No, that's wacky. It's so wacky. And then add and then add your six times two. Wait, hold on. That's eight times two. Sixteen plus uh yeah, that's it. Yeah, it's sixteen with that. How do you want to do this on Dungeons? Oh my God, I love you. I sweep around behind Dundra's legs and lice into her Achilles heel. Ooh, I like it. Yeah, as you cut across her heels, D crumbles to the ground onto her knees and she looks over her shoulder as you're there behind her ready to deal your death blow. Yeah, I sweep around with an arcing swipe and just open her throat up. Dundas can't make any actual verbal noise as the blood sprays out of her throat wound. She collapses onto the ground into a heap of twitching muscle and bulbous flesh uh until she eventually goes still at your feet. W suddenly realizing this is not at all what you wanted, what now? **** W drops to his knees. It's your turn, W.",
            "start": 654.88
        },
        {
            "text": "of twitching muscle and and bulbous flesh uh until she eventually goes still at your feet. Sudden realizing this is not at all what you wanted, what now? **** W drops to his knees it's your turn W and just screams no my D how will I rule the kingdom without you do you do you continue to fight or are you giving up are you giving up the will to fight what are you do I'm giving up the will I'm just down and I grab my do I have do I have any weapon you you have you have a great club and you have and I pummel myself to death so I can die with the woman that I love oh my God I don't really know about I use my spiritual weapon to tie the bolo around both their necks together this is so cute Romeo and Juliet **** stoss no it takes you it takes you a good minute like hitting myself in the face W all the rest you're like oh as I scream her name d about 30 seconds his until waffles also non-moving form falls to the bottom of the cavern floor them forever now bound together in death Solace and love",
            "start": 711.16
        },
        {
            "text": "The rest you're like, \"Oh, as I scream her name,\" d about 30 seconds his until Waffle's non-moving form falls to the bottom of the cavern floor, them forever now bound together in death. Solace and love lost in this Cavern, and it was **worth** it. Oh, holy sh**, you guys! Holy sh**, guys! You guys managed to lop the heads from the corpses and bring them back to the uh, the one... oh yeah, no one has to know that kill himself; we can say we did it, guys. Let's all make an agreement right here, right now: we did it. One hit each. You you bring the heads back to the Moonstone Lodge, presenting them to the eager hands of the of Finley Toffle, the head of the of the tavern. What up, guys? It's me. How did that whole giant hunting thing go? It went well; it went really well. Both very got all right. It's unreal now. I'm proud of you; that's all good. Thank you, Finn. But to be real, I got a rat problem, so I'm going to need all y'all to go kill some rats. Loves me, and I need to win her back. And with that, the traveling Adventures of",
            "start": 765.28
        },
        {
            "text": "that's all good thank you Finn but to be real I got a rat problem so I'm going to need all y'all to go kill some rats loves me and I need to win her back and with that The Traveling Adventures of The Shits and The American Heroes this chapter comes to a close thank you guys so much for playing well done no no no deaths no yeah ex close call no permanent deaths no permanent deaths wasn't any deaths W and Dunda they died together died together that was a lot of fun G thank you Mike DeArmond for that topic cuz it made them come over and do this thank you guys for coming and do this for serious uh would you how do you think our skills compare with the usual schlubs you play with Ashley Johnson type amazing you guys picked up pretty quick I had no idea what I was doing but I like making noise saw tear start what happen I felt it you know I love D&D so much man it is a fun game to play with friends still if you can let go the more fun it",
            "start": 829.0
        },
        {
            "text": "Saw tear start, what happened? I felt it. You know, how much I love D&D. I used to play D&D so much, man. It's a fun game to play with friends still, if you can. The more you can let go, the more fun it is, I think. If you just agreed that we're all going to look like crap, then might as well film it. So, that's my question. I mean, we have a little bit more time here in the topic, so like, the question is: how did this begin? How did Critical Role begin in terms of becoming a show and getting everybody together and discovering everybody? Did everybody already like D&D? Most of us had never played it really, to be honest. Yeah, never done it before. I'd played since high school, but one of those things, an expert, I was an indoor kid, and uh... But but I loved it. It was such a big part of my life, and I love the whole communal storytelling and like it was a great way to keep your imagination engaged, and uh... I had the opportunity to run one shot for Liam and he",
            "start": 891.44
        },
        {
            "text": "big part of my my life and I love the whole communal storytelling and like it was a great way to keep your imagination engaged and uh I had the opportunity to run one shot for Liam and he invited a bunch of people over who hadn't really played before and so we got to introduce them for the one game kind of like this we did a one shot for one night and we had so much fun we decided to keep doing it as a campaign and then over 2 years of playing it privately we were asked by Felicia Day to possibly bring yeah she's never been to this house she's never called Kevin disgusting no probably not one day Kevin fingers crossed that's how it happened we just she asked we do it we like sure we'll give it a shot and uh it got crazy yeah didn't think it would go anywhere cut to a year later here we are and now you've all quit your day jobs Travis of course worked at a gas station Laura some kind of waitress Bara Starbucks yeah actually took over her job as a waitress red",
            "start": 934.24
        },
        {
            "text": "to a year later here we are and now you've all quit your day jobs Travis of course worked at a gas station Laura some kind of waitress Bara starbucks yeah actually took over her job as a waitress read this time around oh that's fun that's really well thank you all for coming thank you for having us Critical Role every Thursday twitch.tv/ sunry 7 p.m. Pacific Time catch it on YouTube every Monday youtube.com/ **** correct and if you didn't know ladies and gentlemen you've been watching The GameOverGreggy Show each and every week four sometimes eight best friends gather on this table each bring a random topic of discussion for your amusement if you like that head over to patreon.com kindof funny and toss us a few bucks to get each and every episode early along with a bunch of cool perks if you have no bucks to toss no big deal head over to youtube.com/ kindafunny where you post the show topic by topic day by day until the entire thing posts one big free MP3 in video on the following",
            "start": 975.76
        },
        {
            "text": "you have no bucks to toss no big deal head over to youtube.com/kindafunny where you post the show topic by topic day by day until the entire thing posts one big free MP3 in video on the following Friday this has been awesome I love you all very much for I just met you but I do love you I love you too you thank you Nick I'm sorry you're so small I know is can I ask a stupid can a mage be a normalized human being yeah oh yeah but when it's F you Ducker **** you next time Nick you you be a Goliath half giant half human but no until next time it's been our pleasure to serve you",
            "start": 1022.16
        }
    ]
}