{
    "id": 1692,
    "video_id": "K4d6USKMb18",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Our Cop Stories - The GameOverGreggy Show Ep. 124 (Pt. 3)",
    "description": "We tell our craziest cop related stories.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1461135600,
    "duration": 2674,
    "transcript_chunks": [
        {
            "text": "Nick yeah, what's your topic? My topic comes with the community, you have it, oh where is it? It's Tack Track Topic Three, Tack Track of course. Went to patreon.com kind of funny and supported us there to get his topic right on the show, just like you can. His topic starts very simply with police encounters. First I want to state that at one time I was a police officer but my career ended due to multiple gunshot wounds. I think he's probably not serious, wow okay, he's a rapper now of course everybody goes support TTR. Okay well secondly I want to advise that I am in no way advocating drunk or buzz driving please call a friend it's very important also if someone's putting poop on your car do not tell your friends on their podcast yeah make sure you but don't resort to violence we're going to find nonviolent means of dealing with the dude. You have no idea that guy will lose his mind when I just stand up like hey what the f***, I'll be really loud cuz I can get loud.",
            "start": 2.85
        },
        {
            "text": "We're going to find nonviolent means of dealing perfectly within the rules you have no idea that guy will lose his mind when I just stand up like, \"Hey, what the heck?\" I'll be really loud, cuz I can get loud, you know. And then seen it, you'll be drunk at this point, but what if he was like, \"Oh my God, I love your videos.\" Pop right in the face, awesome. Greg's in jail. It was a couple of months before I was to report to Police Academy. I was at a bar with a friend and we decided to continue the party at his place. I wanted to get a few things for my house first, I grabbed some items including a six-pack of Budweiser Ice uh on my way to my friend's place, I was pulled over in front of a convenience store. The officer asked if I'd been drinking, I said yes and just and I also let him know that I was about to enter the police academy. He ran my license when he came back, he asked if he could have someone pick me up, I said yes, he told me to pull into the convenience store parking lot and wait. I called my friend.",
            "start": 52.4
        },
        {
            "text": "enter the police academy he ran my license when he came back he asked if he could have someone pick me up I said yes he told me to pull into the conven store parking lot and wait I called my friend explained the situation and told him to come pick me up meanwhile the cop waited inside the store there's more the car pulls up and I start pulling my things into the back seat while I'm doing this I tell my friends the cop is letting me go so so let's go let's go get out of there all of a sudden I hear a voice laughingly say who are you I looked up to realize I was putting my things into a stranger's car I said to the stranger my bad and I gave him one butt ice can as an apology for the mistaken identity I got my stuff out of the wrong car and noticed that the correct car was pulling in behind me and then started putting my things into the correct car and my friend says what the hell are you doing in that guy's car I said never mind I'll tell you later before we left I told my friend",
            "start": 91.44
        },
        {
            "text": "me and then started putting my things into the correct car and my friend says what the hell are you doing in that guy's car I said never mind I'll tell you later before we left I told my friend I just need to get my license back from the cop (mind you he was watching the entire exchange from the inside) so I go inside and tell the cop that my friend is here and I just need my ID he said I never took your ID to which I replied have a good morning sir do you have any hilarious cop encounters to share or maybe some bad encounters? Oh, the but ice was the real kicker like you sure are in St Louis Missouri walking around there's you're almost 4% by the way I I know I'm I'm I'm saving it I think all my cop encounters uh usually end with me being overly polite I am as as much as you you guys have seen me get angry at the stupidest **** when there is an officer of the law involved I for some reason I'm cool as a cucumber I'm just like sir no sir I don't that sir yes",
            "start": 125.36
        },
        {
            "text": "much as you guys have seen me get angry at the stupidest **** when there is an officer of the law involved I for some reason I'm cool as a cucumber I'm just like sir no sir I don't that sir yes I will sacrifice all of not to jail want you that right now that's to and I've gotten out of things because of that and it's always a good rule of thumb be overly nice oh definitely a lot of s a lot of apologies never happen again I you know what you're right I probably deserve this I asked the cop one time I got stopped for a speeding ticket I was going through the Broadway tunnel and I was like is there I'm really late to a job I was going to a Microsoft thing at GDC like my first year working at IGN when I cared when I cared and I was like driving I was driving Brennan's car cuz we had a bunch he had an SUV at the time and we were I was driving really fast cuz I was late and uh they had a little sting operation on the other side of the bridge there was like five cops and they were",
            "start": 168.2
        },
        {
            "text": "a bunch he had an SUV at the time and we were i was driving really fast cuz i was late and uh they had a little sting operation on the other side of the bridge there was like five cops and they were just pulling people like they didn't he didn't get on his car he like this he just looked at me and went like here didn't even get on assault rifle radar gun yeah he was like boom boom get you and i looked and i locked eyes with him and he was like i'm like **** he walks up and i'm like officer i'm so sorry i'm late for a job it's my first day y y y is and i asked i always ask this cuz why not is there any way you can let me out of this and he was like i'll tell you what no i have to write you a ticket cuz i already started writing it and i was like all right i guess that's fine it's not like you can just scratch that out and he's like but i very seldom show up to court just to let you know and i'm like okay and sure **** he didn't show up so i got out of the ticket it was nice but i",
            "start": 210.48
        },
        {
            "text": "you can just scratch that out and he's like but I very seldom show up to court just to let you know and I'm like okay and sure **** he didn't show up so I got out of the ticket it was nice but I hired a lawyer anyway no you didn't did you more than the ticket well the speeding ticket would have been I was going I was going really fast he wrote me down you were driving on top of the black line no yeah I was like I don't want to cuz at the time I just started IGN I wasn't making you know that much money I'm making Kinda Funny money yeah well yeah now we're like sell that dog buy you 10 more um but I so why do we have to sell him I don't like the look of him uh no at the time I was like I don't want my insurance to go up so I was like hook or crook I'm getting this off my record because I don't want you know you put a ticket on there I was like it's going to skyrocket I was like 23 or 24 so at that point I didn't want it to go hella out of the way but um yeah hired a",
            "start": 249.48
        },
        {
            "text": "record because I don't want you know you put a ticket on there I was like it's going to skyrocket I was like 23 or 24 so at that point I didn't want it to go hella out of the way but um yeah hired a lawyer she called figured out the day he was off the cop was off scheduled the court date for that he didn't show up cost me like 125 bucks how much would the ticket of course you probably 115 but the insurance and and way less time by the way I probably could have well cuz you know I think now that I'm thinking about it I think I had already gotten a ticket and this was the second one so the first one in California I don't know if it's still the same thing but it used to be that if you got a ticket you go to driver school oh spend a day there and they it doesn't hit your insurance company but I think I'd already gotten one like the month before and I'm like I can't get another ticket my insurance will skyrocket and I can't go to school again for this so I had to hire a lawyer",
            "start": 294.68
        },
        {
            "text": "Company but I think I'd already gotten one like the month before and I'm like I can't get another ticket my insurance will skyrocket and I can't go to school again for this, so I had a hire a lawyer. Yeah, that was it, a riveting story, I know. Then there's all times my brother almost got arrested in front of me, but you guys don't want to hear about those. Yeah, we don't, we hate Matt Scarpino stories. What was he doing in front of you? Matt just... Matt is the opposite of me. So when there's a cop involved, Matt likes to escalate. It looks like a fake costume pig. Um, no, I can see him saying that. No, my my brother, I love my brother to death; he's one of the best human beings on this planet and he's been my best friend since I was born. But he thinks it's hilarious for some reason when I'm there to try and get into fights, so that me with the six months of kung fu that I took when I was 13 can back him up like I'm going to throw down and we're not going to get our asses kicked. So we were at...",
            "start": 337.6
        },
        {
            "text": "to try and get into fights so that me with the six months of kung fu that I took when I was 13 can back him up like I'm going to throw down and we're not going to get our asses kicked so we were at like we a random like like Starbucks in Riverside California one time and he just starts talking **** to some guy some guy starts talking **** to him Flash Forward maybe 20 minutes later they're all sitting on the curb handcuffed and I'm just laughing my ass off that's what happens yeah You' been there definitely is what happens yeah I've been I've yeah seen fights escalate and well youve had the swamp but you you had the what do they call it the uh uh they they have a they have a term for it when they when you get put on the hood of a car cop car no I'm not fa I'm usually the guy that's the whole thing is like all my cop stories stem from Missoula and the Antlers when we were at the party house what up Antlers and I've told I think my favorite one is the one where I tripped wasted in",
            "start": 375.64
        },
        {
            "text": "whole thing is like all my cop stories stem from Missoula and the Antlers when we were at the party house what up Antlers and I've told I think my favorite one is the one where I tripped wasted in the front yard got up the cop was like who's in charge here I said I was gave me the pamphlet at the party later on when I was thought I was going to jail for sure and I was wearing those jail pants that they sell at Halloween I came out and showed him the flyer and the cops were like good night and left and I was like I can't believe I got out of this but I had others where we had a huge party and I I'm the same way right where I first off in like now in hindsight as a 33-year-old right it's like man we **** made these poor guys' life such a living hell and all they are is babysitters you know what I mean for like for the most part I'm talking about you know Columbia cops right like Poli bad no no real real Columbia Police Department real cops real **** to worry about but inevitably they got",
            "start": 415.52
        },
        {
            "text": "I mean for like, for the most part, I'm talking about you know Columbia cops right, like real Columbia Police Department real cops, not the bad kind. But inevitably they got to go to 200 noise violations on Thursday night, you know what I mean? And there was one where someone called to break up our party, they showed up, I came out as leader, I'm like sorry officer, sorry sir, this everybody go home, blah blah, everybody's leaving and everything's totally chill. Everybody's leaving and then my one friend Eric came out shirtless, wasted, and just made some stupid crack and the officer's like oh yeah you're going in, you're going into the drunk tank tonight, blah blah blah, like a joke. You and the cop handcuffs him and this is still it was debated at the time we figured out eventually handcuffed Eric turns him around, handcuffs him behind his back right puts him in the back of the squad car and I'm sitting there and I'm like I'm sorry about that officer can we please",
            "start": 449.68
        },
        {
            "text": "out eventually handcuffs Eric turns him around handcuffs him behind his back right puts him in the back of the squad car and I'm sitting there and I'm like I'm sorry about that officer can we please get him out like he's one of my guys this isn't he's BL and like and finally officer is like I'll do it for you you know you're you've been really Cooperative da I'm like thank you so much and he opens the door and like even though I said all this stuff Eric incredibly athletic incredibly athletic jacked as a **** favorite thing to do at Antler tailgates was to get drunk as **** off paint can and then climb this giant tree sorry pause yeah drunk as **** off paint can paint can it's a drink you make in a paint can you have to secure a a stick from the woods I'll explain it later I'll make it for you one day no no you don't have to do that it's it's half a bottle of Everclear full bottle of Mountain Dew but we use Mountain Dew because it was cheaper then half a frozen limeade half a",
            "start": 491.16
        },
        {
            "text": "it for you one day no no you don't have to do that it's it's half a bottle of Everclear, full bottle of Mountain Dew but we use Mountain Dew because it was cheaper than half a frozen limeade, half a frozen lemonade you know the mini cans you buy you put them in there you put ice in there you put mint leaves in there then you get the stick from the woods then you stir it up and then you pass and this is all made in a paint can then you pass the paint can to your friends why do you have to have a stick from the woods why put Mountain Dew cuz it's cheaper we were broke college kids Mountain Dew can you not get like a spoon no cuz the stick adds something to it you want to understand that to the F this is one of our freedoms in America you wouldn't understand the best was though at Halloween you get the Halloween kid bucket like that candy bucket and make it in the air that's a damn good paint can that's a paint can you **** taste I apologize for interrupting you continue no it's great",
            "start": 531.64
        },
        {
            "text": "you get the Halloween kid bucket like that candy bucket and make it in the air that's a damn good paint can that's a paint can you **** taste I apologize for interrupting you continue no it's great so cop opens the door to let Eric go and Eric at some point had decided he wanted his hands in front of him so he had leaned while we're arguing no one's paying attention he had leaned back and wiggled his hands out and then got his feet out but he gave it away that his shoes were muddy and so the entire cop car on the inside was smeared in mud that he had kicked his feet up and done this and the officer like what the **** like why I was going to let you go why and Eric's like this is how I got cuffed and the guy's like no you didn't no you not at all this is not how you got cuffed oh my god did they take him away no they he got some ticket again they're just babysitters they're just there to SC I I felt so bad it's it's it's one of those things where like as I get older now I become the",
            "start": 575.24
        },
        {
            "text": "did they take him away no they he got some ticket again they're just babysitters they're just there to SC I I felt so bad it's it's it's one of those things where like as I get older now I become the guy that calls I used you know we all used to be the person who used to have the party and be like who's going to be sober enough to actually answer the door when the cops come and then who's going to be really who's going to got to be barely sober enough when they come the second time and they're really **** serious about this and like they're going to arrest someone cuz they come the first time and they're always like shut it down or we're come next time we come back we're arresting someone yep and then they come back the next time they're like I need to talk to the homeowner we're arresting you they never arrest I've never seen anyone get arrested you get a ticket maybe but you're not going to jail for that yeah yeah yeah you get tickets a lot um but now I'm the person that's like",
            "start": 614.24
        },
        {
            "text": "you they never arrest I've never seen anyone get arrested you get a ticket maybe but you're not going to jail for that yeah yeah yeah you get tickets a lot um but now I'm the person that's like I'm calling well that's the thing 10 10:01 that music's still on the cops are coming oh they're I think of like the time I wasted with the good Columbia Police Department thousands of hours and the one like and like seriously so like that story I got dozen with the time we like let's burn a couch in our backyard we got a bucket of water I have so many times these cops came to our house for parties to break them up and be stupid and this is before I was there years before you know what I mean like they we had a line-up and it turned out that one year at the start of the school year it's like literally like Animal House 2 the sheriff is or whatever chief of police is like we're cracking down on parties that is a party house **** and tell the guys like if you go by and anything's happening",
            "start": 644.76
        },
        {
            "text": "like Animal House 2, the sheriff or chief of police is like we're cracking down on parties that is a party house **** and tell the guys like if you go by and anything's happening you **** nail these guys so they'll stop doing this. And so we went to a tailgate had the paint can did our thing went to the Missou game came back, and as you do after drinking all day and being in the sun, no. We went to sleep; everybody came into the house and crashed except for like one of our friends who was sober brought the keg back put it down, and then one of our other friends showed up, and they were just drinking on our Porsche, just drinking on our Porsche, drinking off this keg or whatever. And I get woken up; she's just on my door, and it's like one of the guys: he's like Miller, you got to come out here. Like what is why? What I'm hung over, I'm **** tired, I'm exhausted. He's like the cops are here. I'm like what the f***, and I come on, what the **** did you do, and they're like nothing we did nothing this.",
            "start": 683.2
        },
        {
            "text": "what is why what I'm hung over I'm **** tired I'm exhausted he's like the cops are here I'm like what the f and I come on what the **** did you do and they're like nothing we did nothing this time FR and we went out there and the cop had had this guy go in and get everyone out of the house that lived there and put him on the porch and he's and he's just like giving this like militant speech like I came over here because I saw these people drinking on the porch and and the only thing he could get us for was that our K they in in uh instituted this I don't know if this is normal these keg uh plastic tabs like like little tickets on them you know what I mean so you knew the number of The Keg so they could trace it back to who bought it that kind of thing it was like year one of this and the only thing he could get us for was the fact that the the it was damaged and he's like I can't read the number and I'm like looking at it you can clearly read the number like I'm sorry sir but you",
            "start": 722.96
        },
        {
            "text": "the only thing he could get us for was the fact that the ticket was damaged and he's like i can't read the number and i'm like looking at it you can clearly read the number like i'm sorry sir but you can read i cant read and like this goes on and on and i'm totally just like yes sir no sir and of course other people are like trying to get smart about him like guys just let it go you know cuz what's he going do he's not going to get us for anything he's like we'll be watching this place blah blah blah blah and so that was saturday i wake up sunday morning to go watch the bears at big 12 campus and i get up an hour early to walk to the police department ask for a complaint uh paperwork and i sat there and wrote this three-page essay about how this guy was targeting us for no reason and the tag wasn't torn i drew a description and i had this whole thing of i i printed off things i'm like in my and i'm like being all **** asshole in it of course i'm like and now i'm like and i i'm no k",
            "start": 760.48
        },
        {
            "text": "We tell our craziest cop related stories. I drew a description and I had this whole thing of I printed off things I'm like in my and I'm like being all an asshole in it, of course I'm like and now I'm like and I I'm no K tab lawyer but I was able to use the number that I could clearly read to go to this website and find out who bought it and d and I had all these print outs and stuff and I asked for a stapler and turned it in or whatever, I asked for a stapler and then person immediately threw it in the garbage. No, two days later I get a call from the chief of police or whatever you're kidding me and he's like hey uh I read through your report I'm so sorry now you know to you as an adult to him I'm so sorry he's like I understand what you're saying he did I think act he did go over the line and but that's when he's like so you know we know about your house and yeah he crossed the line here probably but we're looking for you and we're gunning for you.",
            "start": 796.92
        },
        {
            "text": "act he did go over the line, but that's when he's like \"so you know we know about your house\" and yeah he crossed the line here probably, but we're looking for you and we're gunning for you, like don't **** around, like challenge accepted. exactly, exactly, you know where I sleep, neighbors. so then like 3 months later though there was like a community cop uh like meet and greet kind of thing at one of the houses or whatever to talk about neighborhood problems and I **** you not me and one of the other roommates came and we walk up this long path and as we get to the top of the stairs it's the officer that I put the report in about, and all I hear is he's talking to his other officer friend like looking at us and he's like \"yeah so then they filed the report\" and I got in trouble and I was like \"yeah **** you\" and then we just walked past him and sat down. that guy was probably 25 right maybe a couple how old, how much old, 30 I would say 30 and he's just",
            "start": 834.72
        },
        {
            "text": "in trouble and I was like yeah **** you and then we just walked past him and sat down and did that that guy was probably 25 right maybe a couple how old how much old 30 I would say 30 and he's just like Officer Valley **** kids you kids yeah no totally yeah I feel bad I feel bad for cops now I see cops now and I'm just like you're here's my thing man I I am sure that there is a ton of great ones out there I've never dealt with any of them not once in my while well it's because you thread the needle of what is and is not socially acceptable especially in terms to the automobiles that you drive no with dog **** all over it no your old car that was like had no windows no tires no doors no lights barely drove and you put that **** on the freeway for like all right everybody let him talk here's the **** thing man like I I've been I've had appalling situations with cops throughout my entire life and I'll be damned if I deserved a single one of them like I did not do anything like\n\nCorrected errors:\n\n- \"youe\" → \"you're\"\n- \"Officer Valley\" → \"Officer\" (assuming it's a generic term, as the actual officer's name is not mentioned in the metadata)\n- No changes to proper nouns or names, as they are already correct.",
            "start": 871.44
        },
        {
            "text": "Here's the thing, man. Like I've been in appalling situations with cops throughout my entire life, and I'll be damned if I deserved a single one of them. Like I did not do anything - the worst things I've ever done in life, yeah maybe those deserve some cop attention. They didn't stop me for those, though. Yeah, they're stopping me for some other stuff, and it's like my little brother; he's gotten into some trouble. But the crap that I've had to deal with because of that has been absolutely atrocious. I cannot believe they treat me the way that they're treating me based on that example. My brother gets arrested, obviously - that sucks, not something I want to deal with whatsoever. But I have to you know, I have to go try to get him out; I have to do all this stuff. They try to be the least helpful people in the entire world. Like, I'm just like, \"Hey, I don't know what's going on - I don't know why he's arrested.\" Can you help me? Nope, they're treating me like a ****.",
            "start": 917.4
        },
        {
            "text": "the least helpful people in the entire world like I'm just I'm like hey I don't know what's going on I don't know why he's arrested I don't can you help me nope they're treating me like I'm a criminal and I'm like this is this is garbage I had to come here and talk to you and they just treat me like not even second class citizen they they treat me like I'm evil and I'm like this is the last thing I need right now is to on top of dealing with all this crap on top of dealing with my like Mom who's just balling in tears I need to I I don't no one will give me a straight answer like that on top of that there's been so many interactions I have where it's dealing with cops that have nothing better to do than just mess with kids and they see kids so they're like these guys are are up to up to no good and this is back before my brother did dumb stuff him and his group of friends went and they're just uh hanging out at like just hanging out on the streets",
            "start": 960.48
        },
        {
            "text": "these guys are up to no good and this is back before my brother did dumb stuff him and his group of friends went and they're just uh hanging out at like just hanging out on the streets walking around doing stuff mid middle of the day after Middle School right I get a call from one of them hey the cops stopped us at this house at this um store they think that we stole stuff like I need you to come talk and I'm like sure I go there and they're like they they stole stuff and I'm like what did they steal I don't know but they definitely stole something I'm like there's no they didn't steal anything I know these kids they definitely didn't steal anything next thing I know I'm in handcuffs and I'm like and these these **** kids didn't steal **** like I know they didn't steal anything first off the store that that they were in it's like they're not **** stealing **** from there I'm like Jo-Ann Fabrics it was such a butchering of justice and it's like at the very end of the",
            "start": 1000.32
        },
        {
            "text": "first off the store that they were in it's like they're not stealing from there I'm like Jo-Ann Fabrics it was such a butty proven innocent and it's like at the very end of the day it's like they've wasted like 4 hours of my time putting me on the sidewalk in handcuffs because they didn't like me telling them that me asking questions it's it's always about the questions and I'm nice you know me I'm not talking to this you do have a prodding nature to yourself though when you ask questions that I feel like would I'm not saying it necessitates handcuffs handcuffs but I could see a cop being like this kid's got too many but he's trying to he's too smart he's getting he's getting me I'm just going to put him in handcuffs maybe a muzzle and shut him up for a second yeah I don't know about am I wrong about that Greg yeah you're wrong yeah like that's not that's not how that goes I don't know what I'm saying either but I would rather probably",
            "start": 1043.8
        },
        {
            "text": "for a second yeah I don't know about am I wrong about that Greg yeah you're wrong yeah like that's not that's not how that works say I don't know what I'm saying either but I would rather probably you deal with the cops than you if I were in trouble I would just think that not anymore look at Tim I don't I don't know man I mean definitely not it never ends well for me it's always bad like every single time the only good cop story I have is when same group of kids bought from that store a bunch of BB guns and we're in the streets shooting each other with BB guns because that's what kids do and some neighbor called the cops cops block off the street and pull guns on all of us so it's just a bunch of kids cuz they had BB guns that could have ended really really that could have ended very that story doesn't end with the laughs I mean well now looking back like that was the one that we didn't get in trouble like we weren't doing anything illegal at that point so it was",
            "start": 1082.72
        },
        {
            "text": "have ended very that story doesn't end with the laughs I mean well now looking back like that was the one that we didn't get in trouble like we weren't doing anything illegal at that point so it was like that was all all fun but then yeah you bringing up the car thing it's like yeah my car my old car is a piece of **** 1992 Camry I'd get pulled over every other night that I drove because they'd think i' i' stole it and that's the the problem is I didn't so it's like once they found out that I didn't they should have left me alone instead of trying to **** find reasons to get me in trouble the worst thing that's ever happened to me this is **** **** is I picked up one of my brother's friends this kid Armani who happens to be black and we're driving and I picked him up from Daly City BART and we're trying to like I'm just trying to bring him to meet my brother M and I'm at a stop sign that I've been here driven here forever I",
            "start": 1125.08
        },
        {
            "text": "Bart and we're trying to, like, I'm just trying to bring him to meet my brother M, and I'm at a stop sign that I've been here driven by for my entire life, this is right next to Kevin's house. I know there's a stop sign there; I stop at that stop sign and I keep going a block later, a cop - a cop's behind me, and Armani's like, \"Oh man, there's a cop behind you,\" and I'm like, \"It's all good, like, I didn't do anything wrong, we're fine.\" Whoa, I'm like, \"What did I do?\" He was like, \"Like what does this happen a lot?\" I'm like, \"Yeah, they're just going to run a thing, see if my car is stolen and it's not going to be, and they're going to give me crap, and then they're eventually going to go away.\" And he comes over, and this cop - I swear not - looks at me and just goes, \"So I ran your license and I thought it was stolen,\" and he looks at Armani, and I'm like, \"Oh no, this better not be going where I think this is going,\" and he was just like, \"And yeah, so it's not stolen.\"",
            "start": 1161.92
        },
        {
            "text": "ran your things and I thought it was stolen and he looks at Armani and I'm like oh no this better not be going where I think this is going and he was just like and yeah so it's not stolen so that's all good but you definitely missed that stop sign back there and I was like and Amman looked at me and at this point I'm not saying **** you know and I was just like I'm black of car I'm not I'm not talking I was like no I've never I definitely didn't miss it like I you know the think you're wrong you know I didn't say that I forgot what I said but I was like no like I did that I know that stop sign I know what you're talking about so and he was just like yeah know he you know honestly man honestly I'm doing this for you and like points to our money yeah he's like I'm doing this for you like you so much Injustice so much Injustice writes me a **** ticket he said so much Injustice so much **** Injustice is what I'll never forget that oh so he wrote the white guy",
            "start": 1199.72
        },
        {
            "text": "this for you like you so much Injustice so much Injustice writes me a ticket he said so much Injustice so much  Injustice is what I'll never forget that oh so he wrote the white guy ticket he wrote the white guy ticket to to that to balance the white dude White dude he's I mean I know I was like furious man it sucked like everything about that sucked and then I I had to go to court and do all the stuff and I had to pay out do you feel like that is is it is it profiling or do you feel like it's the area that you grew up in that that you get all that cuz I've like I definitely got probably in more involved with I probably got stopped a lot more when the police were I was living in Riverside than when I live in the marina in in San Francisco so do you feel like it's because of the South San Francisco Vibe well I mean no it's absolutely profiling I mean a lot of those stories were were San Francisco proper in I mean in the Richmond District and like that was cuz",
            "start": 1241.88
        },
        {
            "text": "because of the South San Francisco vibe well I mean no it's racial profiling I mean a lot of those stories were in San Francisco proper in I mean in the Richmond District and like that was cuz we were kids like that was profiling against kids for sure um which I mean it's you know it's hard like there are you did look like Eminem when you were growing up not at this point I didn't so it was like anyways and even if I did like **** that that's profiling see I'm I'm terrified of the police so like in London I I I'd been there all my life I had no care for don't carry guns they don't carry guns but I just never really had any running with them like I I don't have a cool cop story and then I've only been here for on and off for 2 years and like for me officers the reason the fear starts it starts at the airport for me Customs officers and immigration officers they **** love hardcore they were all they're so lovely to me it's because you took off a lot of boxes unfortunately",
            "start": 1285.2
        },
        {
            "text": "fear starts it starts at the airport for me Customs officers and immigration officers they love hardcore they were all so lovely to me it's because you took off a lot of boxes unfortunately exactly I'm a walking stereotype and I remember I literally two weeks ago coming into LAX um it was yeah I was that passport control or whatever and he was like why are you coming to LA I was like oh I'm here to do some press and stuff oh for what I'm in a TV show which one IZombie oh after The Flash I was like yeah that's my show man IZombie he's like I should watch that I didn't realize you're in that I was like yeah I am he goes do you travel much well I guess man Vancouver and stuff like you know CU filming how about Iraq or Iran or Pakistan and started listing all these countries and I was like oh that escalated like that's damn holy crap no and he was like cool all right off you go and I was like are you going to check with these guys if they've been to Iraq or just me",
            "start": 1328.04
        },
        {
            "text": "and I was like, \"Oh, that escalated quickly. That's damn holy s***.\" No, and he was like, \"Cool, all right off you go,\" and I was like, \"You're going to check with these guys if they've been to Iraq or just me?\" Like, and so having that experience, I just didn't ever want to mess with the police in North America full stop. Sure, and then I stupidly bought the Mad Max soundtrack and a Mustang for my season 2, and I was speeding during the Tom Hardy music, and I got pulled over for speeding at gunpoint. Gunpoint, which I thought again was excessive. No, that's not us; that's not how I get pulled over for speeding generally. So he pulled me over and was like, \"And so, so,\" and I was with uh an actor on the show, um, and it was like 5 in the morning we were driving to set, and you know, cuz I did drive like a s*** all I was being a s***, I was going way too fast. My car makes a lot of noises when it accelerates; it looks faster than it probably is, um, and we pull over and we hear screams which is not normal.",
            "start": 1377.64
        },
        {
            "text": "a **** all I was being a **** I was going way too my car makes a lot of noises when it accelerates, it looks faster than it probably is. Um, and we pull over and we hear screams, which is to put our hands outside the window, this is for speeding. So we are both like this with our hands out, and as he comes up, he's like so upset with me once I show him my license, I'm like cool officer it's in the backpack on the back seat there, and he's like reach for it slowly as he gets his gun out, this is all for a driver's license which I give to him. He asked me why I was speeding and this was the crazy thing: he once everything was done didn't write me a ticket, he let me go, and I was abusing that speed limit. And I could only think the reason he was pissed is because he had no way to prove it. Um, but yeah, I'm not I'm not do you mean that's weird, that's a hard situation to be in. That was him by himself or did he have a partner? He was on his own, yeah, so that's probably why either he just found out someone who",
            "start": 1431.2
        },
        {
            "text": "not do you I mean that's weird that's a hard situation to be in that was he was he by himself or did he have a partner he on his own yeah so that's probably why either he just found out someone who looks like me nailed his wife or oh he's the biggest Walking Dead fan we our show got canceled his show some **** I I aggression I got maybe and I got pulled over again for the Mad Max thing and I stopped listening to madx **** how you do that it's this one song called \"Live and Let Die\" no like brother and something like that it plays when they're like shooting shotguns on the motorbikes and stuff and I did it again I got caught with a speed gun this dude super sweet wrote me a ticket so I think this guy just really hated my face or my car maybe he just watched Gone in 60 Seconds and was like who the **** does this guy think he **** Mustangs **** Mustang pilot got cancelled because of got up is what color is the Mustang black the insurance people asked that cuz they said red is the car the one Red's the big",
            "start": 1479.32
        },
        {
            "text": "guy thinks he was speeding in a Mustang, the pilot got cancelled because of its color, is what color is the Mustang black, the insurance people asked that cuz they said red is the car, the one with the big flag for anything, one year that's unacceptable I was in all fairness like I'm not saying I was in I I was well I was speeding and in Canada everything's kilometers and I I drove my car from Los Angeles and I know this wasn't a good excuse for the police officer who kind of laughed when I told him I was like I thought it when it said 60 I didn't realize you know I was looking at my speedometer which is in Miles mhm so I'm always having to remember I'm that's not what I'm matching and that does that's I think that's a valid excuse that is valid like you look at a speed sign you're like 30 and I just remember oh no no no no wait cuz you know got to do math I think there's still kilometers though on your yeah but they're smaller I think they put I think they put them there",
            "start": 1525.72
        },
        {
            "text": "like 30 and I just remember oh no no no no wait cuz you know got to do math I think there's still kilometers though on your yeah but they're smaller I think they put I think they put them there though if I'm not mistaken I think my car there they're there yeah I agree they're smaller that's scary though I've never had a gun pulled on me before but what's awesome is is that we have um when we shoot on location the with The Vancouver Police are great they shut down this the block and they have to park you know just to keep traffic from going in and I'm still waiting for the dude who pulled a gun on me and my classmate to just be on set looking off and be like oh hey buddy yeah do you want something from The Craft Services you know you want muffins or some bad coffee and cold donuts oh wait that's good they don't want coffee cold Donuts what I don't know dude I'm tired it's been a long week what cold Donuts are fine that's what I'm saying I was going to say",
            "start": 1568.8
        },
        {
            "text": "and cold Donuts oh wait that's good they don't want coffee Cold Donuts what I don't know dude I'm tired it's been a long week what Cold Donuts are fine that's what I'm saying I was going to say coffee and I said coffee that's what I meant if it was iced coffee Cold coffee and like warm Donuts you guys ever tried poutine yeah oh my God **** like being in London like the Kebab is the drunk food like you get a Doner kebab uh at 4:00 in the morning 3: in the morning the poutine has just risen in rank for me like nothing beats it big on in Vancouver though cuz I I mean I've only had it in Montreal well Montreal is like the place right um it's still big really yeah it's just the best I I started I ate it four nights a week before we wrapped and that's why I'm now we're big we're a big pizza culture here after hours in San Francisco yeah it's obviously because that's all it's open like you get pizza or the street meat which you probably don't want that doesn't sound right",
            "start": 1614.56
        },
        {
            "text": "a big pizza culture here after hours in San Francisco, yeah it's obviously because that's all it's open like you get pizza or the street meat which you probably don't want that doesn't sound right no it's a hot dog no but it's people I call street meat because out there just on a little grill it's like made of tin foil she's cooking hot dogs and bacon I love oh not probably sanctioned to do it no she doesn't have a permit comes in with a little propane tank Little Grill and you can smell it from like block away yeah man she was serving paninis new one New Wave Colin you got any cop stories um yeah few the one I'll talk about is uh the one I'll talk about is uh Richmond airport in 2002 in Virginia I don't know I ever told told the story on this show um of course the most famous cop story we have is Ramon that he told about The Simpsons bong which is a classic I think I missed that one that was the one episode I was not on with Ramon with the Bart Simpson",
            "start": 1663.32
        },
        {
            "text": "We have is Ramon that he told about the Bart Simpson bong, which is a classic. I think I missed that one - that was the one episode I wasn't on with Raone. Yeah, when we were with Ramon with the Bart Simpson bong, it's a good one. Um, but uh, in Richmond Airport, I flew there; my sister has lived there for a long time. Dana, my other sister, and my mom all live there now too. But um, we were going to visit her, and uh, I was flying out of Richmond back to Long Island, and uh, this was like my first flight after 9/11. And uh, they wanted to go through my bag; um, and I said no, and got into this huge argument with the TSA. Um, my first of many arguments with the TSA - no, you said no, yeah? You can't say no, and uh, they were like \"through your bag,\" and I'm like, \"I have Fourth Amendment rights; it's an illegal search.\" Um, you don't have a warrant, and um, not going through my bag.",
            "start": 1711.72
        },
        {
            "text": "no and uh they were like you know I'm like they're like through your bag and I'm like I have Fourth Amendment rights it's an illegal search um you don't have a warrant and um not going through my bag you're an agent of the government and I was in I was a senior in high school at the time this is college I'm writing this down and uh I would I would I would recommend you don't do that and uh so the story's like kind of getting vaguer in my mind as as time goes on but I was like pulled over to the side and then these two like cops I think they were state troopers with like their like big hats came over like what's going on here son or whatever and I'm like and I'm like I'm like I'm just they want to go through my stuff and they you know no one's going through my bag you know and they're like do you know what happened in New York uh you know I'm like I'm like yeah I know I'm like I'm from New York yeah I know what happened and he's like well son do you understand the gravity you know like",
            "start": 1757.12
        },
        {
            "text": "do you know what happened in New York uh you know I'm like I'm like yeah I know I'm like I'm from New York yeah I know what happened and he's like well son do you understand the gravity you know like like this kind of stuff I'm like sir my father was an FDNY firefighter he was there do you understand what happened that day you know and and like all this kind of stuff I'm like I knew people that died do you know anyone like do you understand what happened that day and they ended up like after like some back and forth like go that was basically it that's awesome never yeah you're like my hero for that and I remember my sister like it's it was so long ago I mean was like 14 years ago now my sister I was with my sister Ally and I remember her just standing there and it's kind of it was kind of like a point of Pride I think for like you know my father being a very conservative man but also a New York City firefighter um I just thought it was like very condescending the way they were",
            "start": 1800.48
        },
        {
            "text": "kind of like a point of pride I think for like you know my father being a very conservative man but also a New York City firefighter um I just thought it was like very condescending the way they were talking to me and I was just like not really familiar with like the new protocols about going to the airport I'm like well you're not going through my stuff like that's we don't have that kind of contract that social contract in the United States like we have constitutional rights against government agents putting their hands in my bag you know right so like and I don't I have nothing to hide I'm a high school kid but just principle you're not going through my bag yeah and and uh that was the first of many a run-in I had with the TSA I'm going to go out on a limb every time we go to the airport together you have some interaction with the TSA that makes me glad I went ahead of you and not before you the best when he does let me get through first we get up just",
            "start": 1839.88
        },
        {
            "text": "time we go to the airport together you have some interaction with the TSA that makes me glad I went ahead of you and not before you, the best when he does let me get through first. We get up just into ear shot range. He goes okay time for security theater, and like the agents look at him like here we go. And I feel I would feel so bad for the TSA people if I didn't also hate them as much as you do. But it's not because I don't hate them because of any sort of like rights uh violation. I just hate them because I can tell they don't want to be there either, and but they're still enforcing these dumb **** policies that don't work. And every single time they're just like \"I have to\" like I have my pants cuffed and I go through the dick scanner, you know, the thing you shim they're like put your hands up a little more. I'm like yeah that's going to **** stop it cool boom get through. And I'm like that my pants are clearly cuffed. The guy's like \"I have to\" the woman was like \"I have to\"",
            "start": 1880.24
        },
        {
            "text": "your hands up a little more I'm like yeah that's going to stop it cool boom get through and I'm like that my pants are clearly cuffed and the guy's like I have to the woman was like I have to bring over male person to touch your ankle and I'm like cool I'll wait here for another five minutes you could touch my ankle if you want she's like no sir it doesn't work that way I'm like of course it doesn't work that way of course it doesn't work that way I got to get to my Starbucks come on lady the TSA I want to be really clear I've said this before the Transportation Security Administration has never done anything they've never stopped anyone these are the idiots standing in between us and al-Qaeda and us and Isis Isis and all the yeah I'm sure that the uh the really smart people that coordinated that in massive attack in multiple cities in in 2001 would have no idea how to deal with these Geniuses you know like give me a break like it's so it's so it's like so over the top and so ridiculous how",
            "start": 1926.44
        },
        {
            "text": "attack in multiple cities in 2001 would have no idea how to deal with these Geniuses, you know, like give me a break, it's so over the top and so ridiculous, how they like I get so Furious when I'm at the airport, you know, these are nice people, I'm sure they're mostly nice fine people had very kind interactions with these people, I don't, I do not antagonize them unless they say something to me, I really don't, I'm a pleasant and thank you, how are you doing, here's my ID, that's totally fine, let's not talk, I put my bag through the conveyor belt, I think that's totally fine, I'll walk through the machine, fine, don't talk to me, don't touch me, don't go near me, don't like, don't touch my bag, that's totally fine, but like we submit to this police state tactic meanwhile all their things are responses to things that happened because they didn't stop them, you know, like the shoe, the reason we take our shoes off is because a guy tried to blow up a plane",
            "start": 1961.56
        },
        {
            "text": "meanwhile all their things are responses to things that happened because they didn't stop them you know like the shoe the reason we take our shoes off is because a guy tried to blow up a plane with his shoes because they didn't stop him right so now they have to like do remember like the whole laptop thing is another like thing where put a laptop it's like these guys have no idea what the heck is going on they cannot as I tweeted out like for $7 billion a year they like can't even put a bag on a conveyor belt properly we give these guys $7 billion do every year and they and we pay our little 911 fees and all these kinds of things and then and and Richmond airport they're being condescending to me when I have a way closer connection to the the event of those days and they talk to me like I don't know what the heck is going on cuz I'm a kid you know like yeah I mean to be fair they do they do do they they manage to at least put the bag on the conveyor belt most of the time",
            "start": 1999.2
        },
        {
            "text": "to me like I don't know what the **** going on cuz I'm a kid you know like yeah I mean to be fair they do they do do they they manage to at least put the bag on the conveyor belt most of the time no yeah right they don't do **** **** come join me in San Diego airport and see how efficient that was when I was there trying to come to Austin to see you guys in Texas like the the point is like there's like people with jobs to do and all those kinds of things and I've never an I would never I honest to God I me we tell these stories but I've never just gone and antagonize someone for no reason but when I see them making someone an old person getting out of a **** wheelchair and searching there like leave them alone man you know like they're not these people aren't doing anything wrong but Colin like I and this isn't to excuse that cuz I remember my my grandmother had the same thing she she was taken out of her wheelchair to be searched but like for every the be the thing is the TSA",
            "start": 2035.68
        },
        {
            "text": "Colin Moriarty, like I, and this isn't to excuse that because I remember my my grandmother had the same thing; she was taken out of her wheelchair to be searched. But like for every the be the thing is, the TSA people, the people who do these jobs, the general public – there are some idiots and for every hour or time wasted, we have some idiot tried to bring a machete in their hand luggage and didn't understand why that was an issue. You know what I mean? I always feel like that's what I'm saying to myself: \"We don't know what kind of dumb stuff people try and pull.\" I mean, obviously the terrorist attacks and things like that – you know they weren't able to prevent those that have happened – but I'm talking about the carrying things on board, the dumb stuff that people try and pull. That's like, I'm always seeing a delay because some prick knows this bag isn't going to fit in here, and they're doing this for the 50th time that day. Dude, you need to check that; it's like that. I kind of always excuse that.",
            "start": 2072.24
        },
        {
            "text": "seeing a delay cuz some prick knows that this bag isn't going to fit in here and they're doing this for the 50th time that day of dude you need to check that it like that I kind of always excuse that and and and how anal they can be sometimes just because of how stupid people are yeah I I mean I get that and I want to be clear too when I go to other countries like I remember when I went to Germany one of the times I was in Germany they went through all my stuff and I'm like it's Germany yeah well it's not it's not only that I don't know what German law is but I'm like I'm a guest here like that's fine like if you want to search my stuff I've gone through customs in London I've gone through customs in Germany I've gone through customs in Iceland I've gone through customs in Japan it's like do whatever you want you know like I'm a guest in your country I don't have constitutional rights here but when I'm in the United States it's like well someone needs to stand up and there are people",
            "start": 2112.32
        },
        {
            "text": "do whatever you want you know like I'm a guest in your country I don't have constitutional rights here but when I'm in the United States it's like well someone needs to stand up and there are people that stand we were talking about PEN America and tell the other day because they're they're very like about this too where it's like you are just getting on us in this in this line like just going through our things cutting open our locks like doing all this kind of stuff to find these things and you guys haven't stopped anyone you know and I'm sure at some point Something's Happened that maybe we didn't catch wind of maybe you think that though for some good press they might say that that's probably uh so like it's like I don't mean to be a dick about the TSA and I wasn't I didn't mean to be a dick about those cops in in Richmond and I don't think I came off as a dick I think I came off as Stern like at the time and thinking about it such a long time ago like as Stern",
            "start": 2147.84
        },
        {
            "text": "mean to be a dick about those cops in Richmond and I don't think I came off as a dick, I think I came off as stern, like at the time, and thinking about it such a long time ago, like as Stern, and knowledgeable, and kind of put them back on their heels a little bit having not been in the post 9/11 environment. The only reason we were flying down there and not driving was because it was so cheap to fly - you guys remember, it was ridiculously cheap to fly in 2002 and 2003. I remember getting here and back from JFK for like literally $150 um in like 2003. So it's but it's one of those things where like someone has to stand up and be like well we don't submit to the terrorists by like removing our rights and like submitting to constitutional infringements because like they can be like well you when you fly you don't have Fourth Amendment rights, and it's like okay so do I have First Amendment rights when I fly or do I just give those to you",
            "start": 2182.76
        },
        {
            "text": "because like they can be like well you when you fly you don't have Fourth Amendment rights and it's like okay so do I have First Amendment rights when I fly or do I do I just give those to you too you know what's the stop saying well your speech has to kind of be toned down now too or like you can't express yourself anymore you can't wear a t-shirt or you can't say a certain thing anymore and I'm like well that's just not acceptable to me so you have to stop at the first line you know true again that's why so like I have no problem going through security think that's totally reasonable because it makes everyone else feel good but you're dealing with you're dealing with pretty chaotic and pretty sophisticated people if the Paris attacks and the Brussels attack show you anything you know and like it's just scary that we want to live in this sanitized and safe world when it's just not possible and to get there we have to go to an Orwellian place and I don't like it so I",
            "start": 2220.96
        },
        {
            "text": "you know and like it's just scary that we want to live in this sanitized and safe world when it's just not possible and to get there we have to go to an Orwellian place and I don't like it so I stopped when I was 17 years old I said that to them and I never had a conversation anywhere remotely like that with the TSA ever since then but I'll say a snide remark or two when I see someone getting harassed by some people when they're clearly just they don't even know what's going on some old man or some elderly woman or some single mom with four kids like just leave them alone you know like they're just trying to get from point A to point B as is almost everyone else and if like I don't know just it's so frustrating to me like this this culture of fear and it's like all perpetrated at the airport it's like a a lot of a lot of that kind of stuff starts and ends like if you go to a new location you're going through like that's the problem",
            "start": 2255.88
        },
        {
            "text": "It's like all perpetrated at the airport. It's like a, a lot of that kind of stuff starts and ends there. If you go to a new location, you're going through like, that's the problem though. Like trying, and we've been to a few instances now where they're trying new things right. I've been a couple times where Virgin America is trying to get you through without having to take your shoes off, and like we were in San Francisco, where they have the dogs that are coming around TSA has the dogs, which is great. And also now something I thought was weird is this is the first time I saw it there's a sign that was like, \"You can have bottle liquid if you put it through a different scanner.\" Really? And I was like, \"That's the first I've seen that.\" That's the problem is like, now they're changing all the rules. They make up the rules as you go. Exactly. Put your iPad on the thing, put your iPad in the thing, doesn't need to come out, put them in horizontal, put them in vertical... what are",
            "start": 2297.04
        },
        {
            "text": "they're changing all the rules, they make up the rules as I exactly put the iPad on the thing, put the iPad in the thing, doesn't need to come out, put them in horizontal, put them in vertical, like what are you talking about? true story, I've gone through the last three times with my hair gel and it's 3.4 oh my God and I managed to get that there, that was part of the pen and tell bit too, like their whole thing I brought back Colin Moriarty this little metal card that's the Bill of Rights or whatever that they want you to have in your pocket so you go through the scanners and **** it up and you make a big deal like giving your rights away but they went through all the things that like you can't take through and the other things you can and one of them was like this hairbrush that like clearly a shiv, like no problem there you can take that through because it's plastic and they would never know and it doesn't matter because it hides in you can buy they were selling all of it in the gift shop of like you",
            "start": 2329.84
        },
        {
            "text": "no problem there you can take that through because it's plastic and they would never know and it doesn't matter because it hides in you can buy they were selling all of it in the gift shop of like you can get all this stuff just to show them how meaningless they are it's just it's the same thing like it's the American tactics are always the same I hate to say it like the terrorist attacks in 2001 were one thing so we invade two countries right like we this thing happens at home so we make everyone try to feel better by like looking look at all the money we're spending and look at all the machinery and the people with the assault rifles don't you feel safe and it's like no I feel like you guys are like turning this place into Animal Farm you know and and like I and like I don't I'm just not comfortable with it I'm always going to fight against that doesn't mean you have to dislike I'm a son of a civil servant and I don't think you have to be disrespectful to I've never",
            "start": 2358.96
        },
        {
            "text": "just not comfortable with it I'm always going to fight against that doesn't mean you have to dislike me, I'm a son of a civil servant and I don't think you have to be disrespectful. To me, I've never had like super bad encounters with cops on a day-to-day basis ever. I know a lot of cops um and I know a lot of firefighters obviously and they deserve respect and they deserve the money they make and all those kinds of things. It's just to say like you should fight against a corrupt system, you know? My only issue is that I'm someone who looks like me, who I am, you know. I have a British passport, I have a name that has no kind of affiliation with the Middle East or anything like that - my name is completely Indian, um, with a work visa to do filming there, and still visually profiled, I'm being profiled visually, like the reason I'm being stopped and you are searching my luggage and the",
            "start": 2397.92
        },
        {
            "text": "is completely Indian um with a work visa to do a filming there is still visually profiled I'm being profiled visually like the reason I'm being stopped and you are searching my L my luggage and the reason why you're asking me if I've been to Iraq is because I'm Brown and I have a badge and it's so obvious and it's so just it's just on the nose and it's one of the only ex and it's kind of accepted it kind of is just the norm it's a punch line it's yeah and it's so it's just like if if you know I I I I I wasn't ever pulled over by the police now my best friend Hanes he's Jamaican he's a black guy as soon as I started going to drama school with him we got pulled over once a week and I was like **** you're right this isn't a myth you were pulled over way more than anyone and your car is so inconspicuous there's nothing about you not driving a **** Lamborghini people are wondering what you know how you d d you probably wouldn't get pulled over at all cuz people are like this guy's Rich",
            "start": 2434.48
        },
        {
            "text": "there's nothing about you not driving a **** Lamborghini people are wondering what you know how you d d you probably wouldn't get pulled over at all cuz people are like this guy's Rich unless you're black and then they something the worst exactly so like so in that respect the the same uproar there is with that it's happening at airports and Customs lines everywhere we I I've forever been taken away from from the line to go somewhere else because I have to have my bags opened and I know Colin you said like obviously when you're more accepting and I think you're right as well you are more accepting when you're in a foreign territory because you're you're a guest and you could be bringing foreign foods that you there are so many reasons you know to have those flags smug a koala and I am I am a guest here I am a guest in Vancouver in Canada I'm a guest in in America but it is still anywhere I go I still feel like it's it's it's visual it's it's I'm being profiled because of that yeah",
            "start": 2480.56
        },
        {
            "text": "I am a guest here, I am a guest in Vancouver in Canada. I'm a guest in America, but it is still anywhere I go; I still feel like it's...it's visual. It's being profiled because of that, yeah. And I get nervous when I'm on a plane. I feel like maybe then it gets in my head: I'm sitting next to them, and they think something. I have to be very careful not to look shady, 'cause then now I feel people around me are unsettled. The last time I put \"The Last of Us\" on the plane just so they'd look over at the screen for 10 hours; dude, look there's me. But maybe you think that's the new tactic is to get someone in a TV show you're playing along with, and you can just open your mouth too 'cause like people would be like visually scared: \"Oh, he's British.\" Even that dude at The Last of Us thing; he knew he was like, \"Oh my God,\" after The Flash. Yeah, but I mean, you can totally see that's just the wheels clicking in of like, \"Oh, I know you're cool; you're a TV guy, but you still look...\"",
            "start": 2519.28
        },
        {
            "text": "thing he he knew he was like oh my God after the Flash yeah but I mean that you can totally see that's just the wheels clicking in of like oh I know you cool you're a TV guy but you still look the certain way and I I'm talking about on a plane you got nervous next you like oh governor SP yeah I I remember the same thing in London we had the 7/7 attacks uh which took place on public transport and **** the the next year I had so much room on a tube or a bus the amount and it was it was real and I'd never experienced that I would get I would get on and I had a beard then I would get onto public transport and it could be rush rush hour and for some reason I'd still have a good foot of space just people were you could just feel it it wasn't like a huge thing people didn't get off the carriage but you could feel that tension and that you know suspicion and who do you I can't blame anyone for that I mean it's it's just in our nature I get you know it it's a tough one but it's still it's",
            "start": 2565.96
        },
        {
            "text": "but you could feel that tension and that you know suspicion and who do you I can't blame anyone for that I mean it's it's just in our nature I get you know it it's a tough one but it's still it's still profiling yeah it's what I think it was Benjamin Franklin said \"those who sacrifice security for Liberty deserve neither Liberty nor security\" and I think that's an AP quote I'd rather live in a more dangerous world that's more free like that's that's I'm always going to feel that way you know because you're you're going to get you're going to get like everyone looks at the United States and you probably have good insight into this because you're mean you have a lot of experience in North America um but a lot of people I think with our own fans when I'm on the Facebook group or whatever to talking about like they think it's like everyone's got a gun you know like it's like wild west out there everyone's got a gun strapped to them like it's",
            "start": 2609.44
        },
        {
            "text": "I'm on the Facebook group or whatever talking about like they think it's like everyone's got a **** gun, you know, like it's like wild west out there, everyone's got a gun strap on them, like it's really really not like that. I hate to tell you, you know. Put one pin in that because topic number four talks about that okay. Topic number four also comes from I'm going to run to the bathroom real quick can watch to sure there's another bathroom you want to go let's all take a bathroom",
            "start": 2649.72
        }
    ]
}