{
    "id": 1686,
    "video_id": "ozqlaYiCJpI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Who is Rahul Kohli? - The GameOverGreggy Show Ep. 124 (Pt. 1)",
    "description": "Rahul Kohli tells us all about acting in iZombie.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1460962800,
    "duration": 2529,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to the Game Over Greggy Show. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpino. I like when you touch me. I like it that you're I like that it's another Heather Gray shirt, but it's a Batman shirt this time. If you open up my closet, it is there. I have one shirt left with stripes on it. The rest of them are Heather Gray. 50 shades of heather gray. It is. It's weird. There's a lot of different shades of that heather gray and I have all of them over there in another amazing shirt. The pure one Tim Gettys. This is this is what is this one called? That is neon blue. No, there was a there was a weird name for it and it was good. It was a good laugh for a while, but whatever. I like the shirt a lot. I liked how Tim looked in that shirt until Kevin Colella. Lean in here and show them. Everybody show what's up. I hate Kevin so much. So yesterday we get these two shirts and one's goes to me, one goes to Kevin. And I",
            "start": 2.85
        },
        {
            "text": "in that shirt until Kevin Kohli. Lean in here and show them. Everybody show what's up. I hate Kevin so much. So yesterday we got these two shirts and one goes to me, one goes to Kevin. And I immediately this morning I look at it and I'm like I want to wear it cuz I'm on camera and it's a cool shirt. Kevin's 100% wearing this shirt. I'm sure. And I walk in, he just is so excited. I'm like I hate everything. Well, we had that we had that dialogue back and forth when I had ordered two of these, one for me and you had asked for one and Kevin said he had asked for one. I was like, \"All right, well one I remember asking for one and saying does anyone want one?\" Some one person said, \"Yes, I want one.\" Kevin gave me the the little pouty eyes and he was like, \"Yeah.\" In a similar cool shirt, Color Art Pride Long Island. Go Islanders. That's a PlayStation shirt. You can get that at the PlayStation gear store, whatever the hell it's called online. Coming for you, Pittsburgh Penguins",
            "start": 43.6
        },
        {
            "text": "Rahul Kohli tells us all about acting in iZombie.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.\n\nshirt, Color Arti Pride Long Island. Go Islanders. That's a PlayStation shirt. You can get that at the PlayStation gear store, whatever the hell it's called online. Coming for you, Pittsburgh and Washington, whoever the hell you end up facing in the playoffs. And then our very special guest, ladies and gentlemen. It's been budding on the internet for quite some time. Rahul Kohli. And I should point out your shirt's awesome, too. If you're watching, if you're listening, it's N64 shirt. Retro. Why not? You got to Yeah, retro is what it's all about. right team as well. By the way, we're getting old when N64 is retro, right? Do you ever think of that? N64 is retro as **** N64 has been retro for like 10 years, bro. I'm just saying we're getting old. I'm just I was just reflecting that I was literally playing it in 11th grade or whatever in 12th grade. That's uh Yeah, I don't feel like I was that I don't feel like that was that long ago, but I guess it was. Did you all expand the memory",
            "start": 81.2
        },
        {
            "text": "literally playing it in 11th grade or whatever in 12th grade. That's uh Yeah, I don't feel like I was that I don't feel like that was that long ago, but I guess it was. Did you all expand the memory when Tup had to I tried to I remember explaining it to my parents that I needed this for tour. It was the hardest cell ever, but I broke them. Good. You got to rock. Now, Rahul Kohli, of course, people know you from the hit CW show iZombie. Yeah. But I know you as one of the best friends. You're a fan of Kinda Funny. I am. You freaked out to meet me a long time ago. I did, but I shouted uh Beyond. You're allowed to say that. If Colin or I say it, we owe IGN a nickel, but other people can say it to us. That's fine. Yeah. We um we we were just shipping around the pilot. He just did that and we were at Comic Con and IGN were interviewing us and I saw you and just graciously shout beyond and that was it and a friendship was formed. Done. And two years later we did the video we said we'd do. Yeah.",
            "start": 118.08
        },
        {
            "text": "at Comic-Con and IGN were interviewing us and I saw you and just graciously shout beyond and that was it and a friendship was formed. Done. And two years later we did the video we said we'd do. Yeah. You're busy and we'll hear all about that. But first, ladies and gentlemen, if you didn't know, this is The GameOverGreggy Show. Each and every week, four, sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, head over to patreon.com/kindafunny where you can get episodes early. You can get exclusive access. You get cool perks. If you have no bucks to toss us, though, it's okay. Head to youtube.com/kindafunny where you can get the show broken up topic by topic day by day until the entire thing posts. The following Friday is one big video, an MP3. That was good episode. We nailed it. We nailed it. No, crushed it. So, I don't understand you. So, like I don't You're one of these types that I don't like. Okay. You're",
            "start": 160.0
        },
        {
            "text": "Is one big video, an MP3. That was a good episode. We nailed it. We nailed it. No, crushed it. So, I don't understand you. So, like I don't You're one of these types that I don't like. Okay. You're good-looking. Yeah. Successful TV show. Super tall. Beautiful girlfriend. Hot. And then y'all you like video games, too, apparently. Oh, and you're popular on the internet. Yeah. How did all this start? What are you doing? Where does where does your story begin? Roll uh Super Nintendo and then everything just sort of fell into place. I was a gamer. Like I before I can remember anything, I I just remember playing games. Uh in London, it's raining all the time, so outdoor activities are kind of Nobody does that. Yeah. Except in the summer, that's it. You're not doing anything. So I just Yeah. I I wanted to be into the gaming industry, but I wasn't smart enough. Oh, trust me, you don't need to be. Look at us. But this wasn't the whole streaming thing. That wasn't if you wanted to be in games",
            "start": 196.96
        },
        {
            "text": "to be into the gaming industry, but I wasn't smart enough. Oh, trust me, you don't need to be. Look at us. But this wasn't the whole streaming thing. That wasn't it if you wanted to be in games and back in the day, you had to code. Yeah. So, um that was always like this, I guess, the kind of main foundation of my life. Um and then I just fell into acting at about 18. I wanted to be in Star Wars. I wanted to be in the prequels, but they weren't made then. Okay. Okay. By the way, I didn't know what I was like I got to get an episode. Exactly. So I had no idea what I really did in episode one he's like I got to look into this video game again. Um but yeah and then I you know 10 years later um after not working and auditioning iZombie came along and then my character they made a gamer and then all of it just sort of came together and now I'm kind of representing gaming even though I don't have any kind of finger in making them or or anything. Just a hobby. You're just",
            "start": 245.52
        },
        {
            "text": "a gamer and then all of it just sort of came together and then now I'm kind of representative of gaming even though I don't have any kind of finger in making them or or or anything. Just a hobby. You're just you're just a fan. Just a big fan. But you're one of the popular fans out there. They can give you stuff on Twitter. They can talk to you on Twitter, I guess. Yeah. Yeah. Exactly. We can talk. So I feel like not about PC master race stuff. Don't come at me. It's your favorite topic, though. Have you updated your drivers? I **** hate PC. Updated your drivers. PC gaming is the worst. Dude, I was reminded of that when I went to try to play Horizon Zero Dawn: The Frozen Wilds this week and they were running on PCs and lo and behold, the PC we selected didn't work. So Kevin and I didn't get any footage and we didn't get to play the game. They just brought a **** PlayStation 4. I bet you it would have worked. But, you know, I digress. After a couple firmware updates",
            "start": 288.24
        },
        {
            "text": "and get didn't get to play the game. They just brought a **** PlayStation 4. I bet you it would have worked. But, you know, I digress. After a couple firmware updates, gaming, the firmware updates aren't that bad. They're **** horrible. You know, they're Your internet's terrible. You can't throw that. That's why my internet isn't terrible. My internet's just not good. And that's the problem is that I need to wait hours to do an update. Last night, I was trying to play Ratchet and Clank. Freaking disaster. I ended up playing, but then I was up to like three. Firmware. The the 3.5 on PS4 took me literally like 25 seconds to download and install. Yeah, it took me about an hour and a half. Now, see, here's suckers, bro. I'll talk to you. He's throwing out there that his internet's not bad. It's just not good. Right. Okay. Ask him if he's able to upload videos for Kinda Funny at his house. Upload videos for Kinda Funny. No. At your house. You know why? Why? Because there like we",
            "start": 328.0
        },
        {
            "text": "It's just not good. Right. Okay. Ask him if he's able to upload videos for Kinda Funny at his house. Upload videos for Kinda Funny. No. At your house. You know why? Why? Because there like we are the only people in the world uploading hour and a half, sometimes 2-hour long YouTube videos. Are you using dial-up? No, it's not. It's not. It's freaking Comcast. God bless Comcasters. There's no way it's Comcast. It seems like it's your fault. No, it's being honest. Maybe you're being throttled. Are you being throttled? Is Colonel downloading a lot of stuff? I hate you all. Is Colonel and Sherry downloading? Are their dogs using the internet? Yeah. Okay, back to you, Rahul. Do you really credit gaming with being like uh getting you on this path to where you are? You say it starts with Super Nintendo. Yeah, I'd say so. I mean, for me, I I can't even watch TV or film really. I say that you're on TV. I know. It's It's tough. I I don't really watch. I find it hard to",
            "start": 363.28
        },
        {
            "text": "Say it starts with Super Nintendo. Yeah, I'd say so. I mean, for me, I I can't even watch TV or film really. I say that you're on TV. I know. It's It's tough. I I don't really watch. I find it it's too hard for me to engage with. It doesn't keep my attention. Mhm. I I need far more kind of um stimulation from from from my heart. And so for years, gaming is the only thing I could do where I'm not falling asleep, you know what I mean? Everything else just puts me to sleep or I feel quite lethargic doing it. Whereas with gaming, I've always sort of taken to storytelling with way more interaction. So I literally am in this industry, but it's not my chosen kind of, you know, acting. And uh when you say this to other actors, do they get pissed off at you? No, they just count me as a nerd. They just write everything off. They're like, and I like I don't like theater. I I I like acting, but that doesn't mean I have to enjoy TV and film is like what I like. A lot of people will will be actors",
            "start": 401.76
        },
        {
            "text": "write everything off. They're like, and I like I don't like theater. I I I like acting, but that doesn't mean I have to enjoy TV and film is like what I like. A lot of people will will be actors, but they love music and they'll play guitar or for me it's gaming. And there are things now that are happening where I'm kind of segueing into performance in gaming, like conversations. You want to announce your first You want to announce your first role in a video game? Yeah, sure. Okay. Um, nothing. But there's conversations. Um, like there's there's some VO like talks of VO and and things like that and yeah, I'd love to I'd love to do that. What would be your your dream? Like what game do you want to be involved with? Oh, um, it just Red Dead 2. Well, that's not really Red Dead 2. Red Dead 3, but you know, he knows stuff. But like that that was I don't know why I I that speaks to me. And I love Telltale. I think the performances you get, the voice acting there is always stellar and and um",
            "start": 446.48
        },
        {
            "text": "but you know, he knows stuff. But like that that was I don't know why I I that speaks to me. And I love Telltale. I think the performances you get, the voice acting there is always stellar and and um I kind of always thought iZombie would work really well as a Telltale game. Um but that would be a bit of a dream for me. And also just like having your face in it cuz Game Face on EA or whatever that was, that wasn't No, that's not happening. That's not the dream. Black neck Tony Hawk's underground one when you can like send them a picture of your your face and they'll put it on your creative skater. Nah, that wasn't me. That was some weird **** Yeah, but I got to I got to you know, Troy Baker's up there doing everything. Sure, he's going to We need He needs a rival, but I'm just not talented enough to be that guy. Someone out there. But you can just tell people that you are and people will be like, \"Oh, that's his rival.\" And they'll believe it. You just got to fake it till you",
            "start": 488.48
        },
        {
            "text": "talented enough to be that guy. Someone out there. But you can just tell people that you are and people will be like, \"Oh, that's his rival.\" And they'll believe it. You just got to fake it till you make it. I feel like you can set up a nice rivalry between him. Oh yeah, sure. Let's get it going. Troy, you suck. Yeah. I will say that there's no shame in not consuming the content that you make, you know? Like I don't watch I've really never listened to a gaming podcast. I don't watch YouTube videos. I don't watch let's plays. I don't really even understand why anyone would watch a let's play. I mean that's just I've said that before in the past, but it's huge. Like so I just understand that I'm totally not in tune with what most people like and most people like watching TV, but you don't like watching TV. Yeah. So like I think that's totally acceptable if you make the content and you don't necessarily consume it. I actually think gives you an interesting perspective and I",
            "start": 534.48
        },
        {
            "text": "you don't like watching TV. Yeah. So like I think that's totally acceptable if you make the content and you don't necessarily consume it. I actually think gives you an interesting perspective and I said that a few weeks ago on the show about when we talking about Rooster Teeth and our collaboration with Rooster Teeth like I don't I don't know anything about them until I went down there and learned from them but uh doesn't mean we can't make the content valuable. I think actually your shit's not tainted so you don't have any expectations of what it should be like. Yeah. And it's original, right? You're not basing it on anything. And yeah, I no I agree. I don't think it's completely necessary. I remember when I was at drama school I was shunned for not enjoying theater. They're British. Yeah, you should totally don't you have your own opera glasses? But I I like I I loved being in Richard the Third. I loved playing Henry V. I don't enjoy watching a three-hour show where some other person's",
            "start": 570.64
        },
        {
            "text": "you should totally don't you have your own opera glasses? But I I like I I loved being in Richard III. I loved playing Henry V. I don't enjoy watching a three-hour show where some other person's doing it. It's **** boring and you can't like you can't move. And I and I always get nervous I'm going to cough and put the performance. I just hated theater. But yeah, I just gaming's just always it's and I don't even enjoy multiplayer gaming. No, you're No, you're in good company here. Really good company. And when everything went internet based and now I have to social. I used it as a way to shut off from the world and now everything I play is forcing me to engage. You got players close to you. This is happening. We're in division and Greg's over there. I'm like I don't want to talk to Greg Miller, man. Nobody does. Well, that I mean that's I I I sent you a request actually. Did you? It was an accident. I didn't mean to. I just tried to look at your player and I ended up Oh, we should",
            "start": 602.8
        },
        {
            "text": "man. Nobody does. Well, that I mean that's I I I sent you a request actually. Did you? It was an accident. I didn't mean to. I just tried to look at your player and I ended up Oh, we should we should totally go out there. Are you 30 yet? I'm like six. But that's that's my problem with with like I tried to play The Division. I'm like this is turning into another job. Like there's a lot of responsibility and a lot of uh stuff that comes along with having to play a game like that. You have to get a bunch of friends together. You have to go on missions and **** and try to achieve stuff. And I'm like game. No, but it's but but it's it's more than just playing a game, right? It's it's more than just sitting down and like and like you said, just turning off the rest of the world and just immersing yourself in this. Like you have you are your friends are there. You're going to talk and it's a different experience. And so I I I sympathize with that. I sympathize with your um not wanting to",
            "start": 645.6
        },
        {
            "text": "yourself in this. Like you have you are your friends are there. You're going to talk and it's a different experience. And so I I I sympathize with that. I sympathize with your um not wanting to watch TV because I'm getting really burned out on Yeah. a lot. There's some great shows, don't get me wrong, and there's still some really great TV happening out there, but even the stuff that I really look forward to, like uh we had the uh sorry to mention it, but the uh the rival zombie show um The Walking Dead on our DVR last night, and my wife was like, \"Do you want to watch it?\" I'm like, \"I don't know. I mean, it's I know what's going to happen. And they're going to it maybe there's some hope, but then eventually they're just going to **** wind up in a horrible situation. And like I've seen it before. It happens every season finale. This is the fifth one or sixth one or seventh one. What what the hell season are they in? That's what happens when there's you're watching a",
            "start": 682.8
        },
        {
            "text": "like I've seen it before. It happens every season finale. This is the fifth one or sixth one or seventh one. What what the hell season are they in? That's what happens when there's you're watching a show that's not about anything. Which is why I stopped watching The Walking Dead three or four years ago. Yeah. But I mean that's for the record. I think that's what's happening anytime you're not watching a BBC show cuz every American show will continue to happen and happen and happen and happen until no one's watching. This conflicts with me because I I grew up watching like like my biggest influence was like Ricky Gervais' and Steve Carell's The Office. I mean, you got something like 12, 13, 14 done. The whole thing's just put to bed. Luther's the same thing. You love Luther. Yeah. It's great, right? And but then as an actor, I want 22 episodes of iZombie for 10 years. Of course, I want you. Yeah. No. So, it conflicts with again. So that's why like when we're talking about consuming",
            "start": 717.76
        },
        {
            "text": "Right? And but then as an actor, I want 22 episodes of iZombie for 10 years. Of course, I want you. Yeah. No. So, it conflicts with again. So that's why like when we're talking about consuming like your profession and what you enjoy, they can be disjointed because as a as a viewer, I don't really want to see 22 episodes, 10 seasons of a show. As a as an actor, I I definitely want that. You know what I mean? I mean, it depends on the show. Obviously, I I vastly go back and forth. If it's Law & Order, I want that show to continue forever, but that's different, right? I know it will because that's there's a comforting level to the familiarity. The Law & Order was rarely about like what Stabler's family is doing. There was like a little bit of it, but you I what I loved about Law & Order is you could jump around on Netflix every one of them. It doesn't matter. Whereas like watching Walking Dead, you're going to jump ahead and see, oh well, that guy's dead. What would happen",
            "start": 755.6
        },
        {
            "text": "Order is you could jump around on the Netflix every one of them. It doesn't matter. Whereas like watching The Walking Dead, you're going to jump ahead and see, oh well, that guy's dead. What would happen there? And yeah, I mean there's definitely not like a main story happening throughout the entire season of any of the seasons of Law & Order. But there I mean for that I'm like that that is exactly the experience I'm talking about when I watch Law & Order. I'm like I'm I'm tuning into Law & Order to just shut out from the rest of the world. I just want to watch this. And more often than not, I'm actually not watching it. It's just noise and I've got my iPad in front of me and I'm googling what the hell is going on, something completely different on IMDb. It sort of seems like, and I I do enjoy The Walking Dead. I loved what I've seen. Um, I just haven't caught up. But it does seem like it's kind of turning into CSI",
            "start": 796.4
        },
        {
            "text": "completely different on IMDb. It sort of seems like, and I I do enjoy The Walking Dead. I loved what I've seen. Um, I just haven't caught up. But it does seem like it's kind of turning into CSI in that respect where it's it's it's it's not procedural in that respect, but in terms of like uh just it going on forever. Yeah. And then having spin-offs in different cities. Yeah. And I think based around the same kind of idea, Fear of the Walking Dead was a missed opportunity. Definitely should have been Fear of the Walking Dead LA and then season two season season two should have been Fear of the Walking Dead Chicago. And it should all start from as the outbreak starts to happen. Or not even that, just different time frames. Any I feel like it should have just been contained stories. Well, they got the they got the one on the the airplane. We finally got the conclusion of that last night. The big the big the big reveal. What happened? I didn't see it. You didn't see that part. No, it just",
            "start": 829.76
        },
        {
            "text": "got the they got the one on the airplane. We finally got the conclusion of that last night. The big big big reveal. What happened? I didn't see it. You didn't see that part. No, it just ruined it for me. Oh, no. It wasn't. I mean they they they show the plane like going down and then it cuts to Fear of the Walking Dead when um Nick the character is like he looks up and he sees a plane this guy and I think that was pretty much the only tie in the show for people online commercial show that would play that every week we'd get 30 more seconds and it was freaking garbage. It was like worst. It was like online and see the whole thing. It was the worst production value I've ever seen. I couldn't believe that Walking Dead had that. I thought it looked cool. I just didn't I just think that's not a great way to tell a story like The Walking Dead like in 15-second snippets every other week cuz sometimes they miss a week and sometimes you know I remember the first time",
            "start": 867.2
        },
        {
            "text": "I just think that's not a great way to tell a story like The Walking Dead in 15-second snippets every other week cuz sometimes they miss a week and sometimes you know I remember the first time it's hard to get emotionally involved when they debuted it the original Fear of the Walking Dead, right? Is that how long it's been going? Uh when I when the first one went up I was like oh that's a cool idea and I went on to YouTube expecting the rest to be there and it wasn't and I was like **** this. This is a terrible idea. Yeah. No. And so one of the characters I don't know which one I think it's the Asian girl, Rahul Kohli mentioned in the title, is going to be in for the Walking Dead now. I thought the plane just crashed. Yeah. I don't know. It didn't crash. You just see it. Oh, it may have landed. She was actually kind of cool. She was up to Yeah. You don't watch TV. You're all a bunch of nerds. What I was saying, y'all got nerds. So, wait, what I was waiting to say uh about what Rahul was saying is I think if more",
            "start": 903.36
        },
        {
            "text": "of cool. She was up to Yeah. You don't watch TV. You're all a bunch of nerds. What I was saying, y'all got nerds. So, wait, what I was waiting to say uh about what Rahul was saying is I think if more people were honest, they'd come to the same admission. I bet you there are a lot of actors at the Academy Awards every year that watch their own movies. I don't and I don't there's quite a lot of actors that don't even watch their own movies. I don't blame them because it's like it's the way I feel about games. It's like we do this every day. And so I don't want to live this in this world all the time like at all. Like I am not even remotely interested in living in the gaming world all day. So it's it's I think it's totally healthy for an actor to not necessarily you know consume that. I think it's healthy for someone in the gaming space to like I like to read and and play music and listen to music and just go off, you know? And I'm with you on that one. I think that's healthy. One",
            "start": 938.24
        },
        {
            "text": "it's healthy for someone in the gaming space to like i like to read and and play music and listen to music and just go **** off you know and i'm with you on that one i think that's healthy one of my favorite jobs ever was i was i think i was 17 i worked at the uk version of gamestop and it was like you know you take games home all we did was talk about games and sell them and play them last thing i wanted to do when i went home was play games it kind of killed that for me um and that's why i didn't take that job at that strip club as a barman when anything becomes what you just lose interest it's important to diversify yeah it's hard too i mean even with me like i love internet videos so much it's like when's the last time i've watched something i don't know i i'm too busy making it and it's just like then last when i get home like i don't know that's it's actually weird i've had the opposite right it's like the slow draw back to internet videos for me has been",
            "start": 973.04
        },
        {
            "text": "making it. And it's just like the last time when I get home like I don't know. That's it's actually weird. I've had the opposite, right? It's like the slow draw back to internet videos for me has been doing this and then watching like taking podcasts that are now internet videos. Like you know how obviously groups like us do video podcasts and you'll listen to them on iTunes. Now I've been actually going home, stopping it there and starting it on YouTube, which is trippy for me. I've never actually done this before, but I'm like I want to keep I don't want to turn the TV on anymore to get that traditional experience that I've had my entire life. I want to keep hearing what these guys have to say about the next Conor McGregor fight there and boom, there it is. Right. And I just sit there and watch and then I feel kind of weird. My wife will come home and I'll be like, I got to switch it back over to The Golden Girls or something so she doesn't think I'm weird for watching YouTube for like",
            "start": 1015.6
        },
        {
            "text": "and then I feel kind of weird. My wife will come home and I'll be like, I got to switch it back over to The Golden Girls or something so she doesn't think I'm weird for watching YouTube for like 2 hours. I got to wear a lot of weird **** going over here. And I do like The Golden Girls still. Don't **** judge me because The Golden Girls is awesome. I don't want to talk about The Golden Girls, let's not do that. I don't know because The Golden Girls is classic. How dare you? The Golden Girls is like one of the great shows of all time in terms of writing perspective from a right standpoint. A lot of people that wrote on that show went on to write some major shows. I'm going to be completely honest. I don't know if we've talked about this on the show before. We must have. But I you know The Golden Girls, I know it's a thing. Never watched it growing up. Just I think the time uh the eras was a little off there. So my first real introduction to The Golden Girls was when for was it your wife's birthday?",
            "start": 1052.16
        },
        {
            "text": "I know it's a thing. Never watched it growing up. Just I think the time uh the eras was a little off there. So my first real introduction to The Golden Girls was when for was it your wife's birthday? No, it was Christmas I think. Oh, it wasn't my wife's birthday. That's right. Cuz she's her birthday. So, for your wife's birthday, you you brought her and me and uh and Alexis, was it? Alexis and I think uh Eric and Jen came as well. It was and Migs came. I think we went to a big group out to the Castro where they do every year a um they do they pick one two episodes of The Golden Girls and they do a stage play of it, but it's all guys. So, it's like drag queens as The Golden Girls doing the the two episodes and it was fantastic. Genius. The Golden Girls is awesome. Never seen it. Oh, dude. See, I'm right there with you. You should come next year. This is why you're acting, but I've played Nino Schrank. So, swings and roundabouts. See, that's the weird thing for me. I guess",
            "start": 1085.52
        },
        {
            "text": "dude. See, I'm right there with you. You should come next year. This is why you're acting, but I've played Nino Culot. So, **** swings and roundabout. See, that's the weird thing for me. I guess not weird, but we've talked about it before is like video games are my preferred entertainment source as well, right? And I think it's what Colin talks to all the time is the fact that you only have so many hours in a day to do whatever you want to do. And so it'll be that I watch what's on the DVR while I cook or eat, but as soon as I'm done cooking or eating, it's like I turn it off. I pause it. You know what I mean? That's why it takes me like days to get through one episode of a show because I don't have that investment. I'd rather go invest that in the Division or Enter the Gungeon or whatever. Exactly. Exactly. Yeah. Last night we watched um Greg and I made dinner together. I stay here. The Post Pizza true friend. I love you. We watched the Justice League vs Teen Titans and you",
            "start": 1131.76
        },
        {
            "text": "Exactly. Exactly. Yeah. Last night we watched um Greg and I made dinner together. I stay here. The Post Pizza true friend. I love you. We watched the Justice League vs Teen Titans and you were getting a little antsy. I was. It was a long movie and there it definitely dips. There's definitely some parts today where I'm like, \"All right, what are we doing here?\" But it was still fun. I just drank more. I played more video games last night than I have in I don't even remember how long where I I just played like just a little bit of everything cuz like because of my internet situation, it was kind of a nightmare because your internet is bad while I was downloading. And it's not just the PSN's fault. It's admittedly bad. Oh yeah, whatever. Um that sucks as well, too. The firmware isn't the problem. It's your internet. So, um I played Kingdom Hearts, the uh the mobile game that just randomly came out, which is awesome. The um I played through the Final Fantasy XV demo to platinum",
            "start": 1167.92
        },
        {
            "text": "Problem. It's your internet. So, um I played Kingdom Hearts, the uh the mobile game that just randomly came out, which is awesome. The um I played through the Final Fantasy XV platinum demo, which was absolutely horrible. Played a bit of Star Fox because we got that and then I played uh Ratchet & Clank. So it's like I was like holy **** I spent about six hours total playing games. I'm like this feels good. Wait, so the Final Fantasy XV demo is not good, dude. It's so bad. I can't believe it. It's We'll talk about that on GamesCast. That's a thing for another time. But do you at least get to ride one of those cars? No, absolutely not. Anything of substance in the demo. It's Man, I want to ride those big chickens. I really wanted to play the demo. I was gutted by Dude, the demo's bad. The The game I'm so stoked for the game. I think the game's going to be great. You hosted something. We did. Yeah, we both did the uncover. Yeah. No, we did that. And then that's",
            "start": 1202.56
        },
        {
            "text": "\"bad. The game I'm so stoked for the game. I think the game's going to be great. You hosted something. We did. Yeah, we both did the uncover. Yeah. No, we did that. And then that's my problem is everything they showed I was like, \"Fuck yeah, man. I'm sold for the 10th time on this game.\" Like, I'm can't wait for this. Can't wait to get home and play the demo. And I played it. I'm like, \"Oh god, this is bad.\" It's really just makes me feel good. I couldn't get to it. So, no, you still got to play cuz you want carb uncle in the game. You can name him Portillo. I named mine Portillo. Damn right. Give me five. There you go. But, uh, it's best. I think I beat it in 28 minutes. I got short. It's there's not much there at all. You know, I was going to say something earlier about multiplayer. I think when I said that on it a little bit like one of the biggest positives that came out for me with multiplayer was because we film\"",
            "start": 1245.44
        },
        {
            "text": "was going to say something earlier about like multiplayer. I think I when I said that on it a little bit like one of the biggest positives that came out for me with with multiplayer was because we film and obviously my whole family are in London FaceTime calls right they kind of changed everything for people who travel and stuff like that like people want to see their families gaming has become my new Facetime uh being away from friends and family my girlfriend especially we we we will schedule a time during the week where we play either Battlefront or some just anything really together while talking and it's just completely It it it it it's closed the distance between us and that's been amazing. Like one of the positives to come out of New Generation and stuff is just how easy it's been to just sit like to game with someone when when I'm 5,000 miles away and that's been a huge huge positive of that. And yeah, we love it. As they've shoehorned it into stuff, it's it is that god this is",
            "start": 1284.16
        },
        {
            "text": "Sit like to game with someone when I'm 5,000 miles away and that's been a huge positive of that. And yeah, we love it. As they've shoehorned it into stuff, it's it is that good - this is a multiplayer. This is always online. But when it works, you know what I mean? Like right now The Division works for me and Fran. I'm talking to Fran as a friend for the first time in my life. Like Fran's always been a friend, you know what I mean? But like this is the first time where I'm like caught up on Fran's daily life and we're talking and then we went to a bachelor party together and was like, \"Oh yeah, it was like we picked up where we left off even though we left off two days ago kind of thing.\" Yeah. No, I love you, Fran. But I like who's playing Uncharted 4 - that feels bomb, you know? Yeah. Yeah. Some people were playing multiplayer Uncharted somewhere. Colin's out there. No, Colin would never. You do like The Last of Us multiplayer. Is that what",
            "start": 1325.92
        },
        {
            "text": "Feels bomb, you know? Yeah. Yeah. Some people were playing multi Uncharted multiplayer somewhere. Colin's out there. No, Colin would never. You do like The Last of Us multiplayer. Is that what it is? I like I love The Last of Us multiplayer. Yeah, but that was just for trophies. I did that for trophies, but I ended up liking it. I played for like 45 hours. Yeah. I loved Red Dead's one. Sure. Yeah. Yeah. Get everybody together and ride horses. Yeah. We were I remember I just remember Wild Fever food. Like I've got the weirdest plant name stuck in my head from when we had to get every plant. Me and my boy Aaron did everything that we had to do, every hunting exercise. Yeah, that was my favorite. So, is it weird now being this this gamer who still just wants to play games, but you're this famous guy who has to go up to Vancouver and split your life and you're doing this and you're torn away from your family. Oh, I'm not remotely famous. You're famous. You're on CW. Are you kidding",
            "start": 1362.64
        },
        {
            "text": "famous guy who has to go up to Vancouver and split your life and you're doing this and you're torn away from your family. Oh, I'm not remotely famous. You're famous. You're on CW. Are you kidding me? You're going to make that Tom Welling like um it's it's No, it's kind of um maybe I'm just I just don't overthink it. You know what I mean? Like um it's all just happened in quite a big rush. you know, I was literally living at my parents house till I was 28. Um, and I just everywhere I was becoming that kind of not to my family but to other extended family. So, um, that joke, you know, sure, he's still trying to act and he's making like $200 a month. But I was always quietly confident. I don't know why. I just always felt like, yeah, it's going to blow up. It's going to happen. It's going to be a whirlwind. And then it did. And then within a few months, I met Mike Tyson and he was giving me punching advice at Comic-Con and I was like, nice. I should have freaked out, but for some",
            "start": 1402.32
        },
        {
            "text": "to be a whirlwind. And then it did. And then within a few months, I met Mike Tyson and he was giving me punching advice at Comic Con and I was like, nice. I should have freaked out, but for some reason everything I don't know. It's just such a weird ride that I was like, \"All right, well, that's happening now.\" And then I met you guys - Greg, Colin, Tim, and Nick - and I used to watch you on IGN and stuff when you guys were there, it's all just been... I don't know. Like even sitting here now, I just rather than overthink it, I'm just like, \"Yeah, this is the deal.\" It's awesome. Yeah, it's awesome. It's great. And and and I spent 28 years with my friends and family. I spent 28 years in London. Time to get away from yeah. It's time to just branch out and see what everyone else has to offer. So then catch me. How does that happen? You're 28. You're in London. You're in this crap bag. Your parents hate you. Family hates you. Nothing's going right. So did",
            "start": 1443.36
        },
        {
            "text": "what everyone else has to offer. So then catch me. How does that happen? You're 28. You're in London. You're in this crap bag. Your parents hate you. Family hates you. Nothing's going right. So did you just send in an audition for iZombie or I mean No, it all started because of um 24. So they were shooting in London. I think John was on that one and I went up for a casting and I always **** talk this casting. It was awful. like I didn't get my my my audition my sides till I was outside the casting person's house. So they apologized for the mistake but then were **** to me when I was reading for it. So I came out of this audition flustered and angry like I can't be doing this anymore. They treat us so badly. Like I I I I don't know how much I've got left. I called my agent. He was like cool. Thanks agent. Yeah. All right. We got this thing called iZombie for you. And this was a Friday and I was so angry with just that. I went so I almost took it out on iZombie and I I worked",
            "start": 1479.92
        },
        {
            "text": "like cool. Thanks agent. Yeah. All right. We got this thing called iZombie for you. And this was a Friday and I was so angry with just that. I went so I almost took it out on iZombie and I I worked so hard that weekend on this audition for like literally just out of aggression and frustration. Monday I went into an office and they put me on tape and sent it to LA and then by Friday they cast me as the part. It just literally happened in a week. I remember sitting I was playing FIFA and I had to turn the phone upside down because I kept thinking every flash on the screen was my you know someone calling say I got it. I was in the running for it and eventually Yeah. It literally all happened in one week and then that was it. So that was a good week. It was a great week. So then so you get cast for that then you said you do the pilot, right? Yeah. And then so the series hadn't been picked up at that point. You were just going to do a pilot. Yeah. And I had never done a pilot before",
            "start": 1525.2
        },
        {
            "text": "get cast for that then you said you do the pilot, right? Yeah. And then so the series hadn't been picked up at that point. You were just going to do a pilot. Yeah. And I had never done a pilot before and I didn't realize how many pilots get rejected. I didn't know like six get made, seven get made per network and two get picked up. And so you got the job and immediately started calling your family like **** you uncle. I knew this was going to immediately go to the Lamborghini dealership. Yeah. And had no idea like, oh no, this could just all I could have just done the pilot and that would have been that would have been So how far Walk me through this then? How far between the pilot and the series being picked up? So we shot the pilot in March and the series. You flew to Vancouver for that? I flew to Vancouver. Yeah. And then I flew back home and then May was the announcement. Not bad. That's pretty good. Yeah. And but we go through this all the time. We're still going through it.",
            "start": 1570.0
        },
        {
            "text": "that? I flew to Vancouver. Yeah. And then I flew back home and then May was the announcement. Not bad. That's pretty good. Yeah. And but we go through this all the time. We're still going through it. Mhm. We we don't I thought once you get on TV and like unless you're a superhero, they're cool. They know they're gonna keep going because they're great viewership, great ratings, they're doing a great job. Whereas with us, while the show's been received really well, we still are on the fringes of the ratings kind of thing and the way that works. So even now after two three years I'm still trying to buy that Lamborghini. Yeah, get that Lambo. We're all waiting like, \"Oh, did we get our season pickup?\" And so we're still going through the same roller coaster that we had at the pilot. Does it still work the same where like because I know that prior to sort of the internet and Netflix and all that stuff. People would always say like you have to hit what is it three seasons to get picked up",
            "start": 1607.68
        },
        {
            "text": "still work the same way like because I know that prior to sort of the internet and Netflix and all that stuff. People would always say like you have to hit what is it three seasons to get picked up for syndication and that was 100 episodes wasn't it was 100 I think it's been reduced. I think someone said don't quote me on it. I think someone said it's now 60 for syndication. So you've lowered the bar. Is that still sort of a goal? Like is that a great goal for you to have like look as long as we get to that like at least I know my career can you know? Yeah. I mean, there's this weird like everyone has this weird way of looking at it that and I don't really understand the ins and outs of it, but once you get to a certain point, it actually makes more financial sense to invest in another just to keep the syndication going. And we just got confirmed for season 3. But again, I mean, thank you. One more step to the Lamborghini. Right. Exactly. Now, will it be a yellow Lamborghini or a purple one?",
            "start": 1648.08
        },
        {
            "text": "just to keep the syndication going. And we just got confirmed for season 3. But again, I mean, thank you. One more step to the Lamborghini. Right. Exactly. Now, will it be a yellow Lamborghini or a purple? It's going to be the one that Christian Bale had in The Dark Knight. Dope Lamborghini. Nice. Closest to the Batmobile you can buy. He thinks I could buy the actual Tumbler actually. I bet. You could buy any of them. I don't want the new one. That shoots people. Sorry. Shots fired. Literally. Literally. Um, but that's exciting though. So, and then it's just been How what is what is a normal week for you like cuz you live in Vancouver currently, right? And and then once you're on hiatus, you go back to London. Yeah. Okay. Um, so what how many days are you on set for this? I mean, or does it just vary? It all depends. Um because we obviously have our studio and that has like three or four locations that we use the most. If an episode means that the minute I'm outside that just becomes an extra day on your week. So the",
            "start": 1681.2
        },
        {
            "text": "obviously have our studio and that has like three or four locations that we use the most. If an episode means that the minute I'm outside that just becomes an extra day on your week. So the minute my character's seen at a crime scene, I know that's okay. Well, that's a day. And then if he happens to go somewhere else, like at a coffee shop, oh that's two days. So it can just turn into if I'm just in the morgue, I'll be on set maybe 2 days, 3 days, that's it, and I'm out. And then the rest of the time you just spend and what I imagine they get they got all of the CW people a giant building and you guys all just hang out with each other and you're all best friends. That'd be a reality show. Best friends. The pilot's great cuz the pilot everyone goes to this fancy hotel that I and the first day I got there, I open the door for Harrison Ford. Oh, that's fun. And I like I literally **** myself and I was like, \"Oh my god, this is insane.\" And they they they had this bougie hotel",
            "start": 1726.0
        },
        {
            "text": "first day I got there, I opened the door for Harrison Ford. Oh, that's fun. And I literally **** myself and I was like, \"Oh my god, this is insane.\" And they had this bougie hotel, but the minute you're picked up for a season, you go find your own place and pay your rent. So, we're all dotted around and like we all Yeah, we're all taken over. **** sucks. It's a job. They'll compensate you, bro. But yeah, you just don't get the hotel anymore. That's all they But we all live like it's kind of a funny place, Vancouver, cuz like you we're all downtown. So, you'll just see sort of Jared Padalecki chilling somewhere or you'll bump into you go to drinks in the night time and you'll see someone from Supernatural. like this. Everyone's out. There's like 20 shows. The CW cinematic universe. Yeah. But also we had Ian Somerhalder chilling somewhere. We had um Jason Priestley. Yeah. Well, he's on our show. One Tree Hill. Well, some of them. Chad Michael Murray. He played Clay. That's awesome. Did you not",
            "start": 1766.72
        },
        {
            "text": "One Tree Hill. Well, some of them. Buckley. He played Clay. That's awesome. Did you not know? I don't I'm not sure. We have We have some One Tree Hill people from from there. But um we also have like we had Minority Report out there. We like it's not just the CW. I think uh everything shoots in. Yeah. Um that's crazy. So how how many months out of the year are you there then? Um depends on the episodes. This season two we were there for 8 months. Okay. So it's a sizable you basically live there and then you pretty much. Yeah. And then we all I I couldn't like the weather in Vancouver. I couldn't just go straight back to London cuz I was just trading the same weather for the same. So I came to LA and just chilled out there for How do you like LA versus London versus Vancouver? Or you don't have to answer that question. I don't like it late. Really? A lot of people don't.\n\nCorrected chunk:\n\nOne Tree Hill. Well, some of them. Lucas Scott (Buckley) played Clay. That's awesome. Did you not know? I don't I'm not sure. We have We have some One Tree Hill people from there. But um we also have like we had Minority Report out there. We like it's not just The CW. I think uh everything shoots in. Yeah. Um that's crazy. So how many months out of the year are you there then? Um depends on the episodes. This season two we were there for 8 months. Okay. So it's a sizable place, you basically live there and then you pretty much. Yeah. And then we all I couldn't like the weather in Vancouver. I couldn't just go straight back to London cuz I was just trading the same weather for the same. So I came to LA and just chilled out there for How do you like LA versus London versus Vancouver? Or you don't have to answer that question. I don't like it late. Really? A lot of people don't.\n\nNote: I corrected \"Buckley\" to \"Lucas Scott (Buckley)\" as Lucas is the main character played by Chad Michael Murray, and Buckley is a surname of one of the characters in One Tree Hill.",
            "start": 1807.12
        },
        {
            "text": "same. So I came to LA and just chilled out there for How do you like LA versus London versus Vancouver? Or you don't have to answer that question. I don't like it late. Really? A lot of people don't. You're a transplant. A lot of people don't. As soon as I drove into San Francisco, this I felt at home. It has such a European vibe here. The weather's really similar. There's just a real nice culture here and and everything just looks great. And Vancouver's identical to that. This this also feels like Vancouver. I mean, it it just does except the whole up down hills and stuff. But yeah. Um, whereas LA's completely different and everything's spaced out and and being someone who walks everywhere in London, knowing that I, you know, just to go to a Starbucks, some people have to get into cars, it's just, it's no joke about that. We we were down there doing some stuff when they were at the Final Fantasy Versus XIII event. We stayed an extra day to do some other stuff. Um, and I'm like, I'm going to go",
            "start": 1852.96
        },
        {
            "text": "just, it's no joke about that. We were down there doing some stuff when they were at the Final Fantasy event. We stayed an extra day to do some other stuff. Um, and I'm like, I'm going to go for a walk to Starbucks. And there was a Starbucks a block and a half away from me. And there was one about I think it was eight blocks down. And I'm like, I'm going to be the better man here. I'm going to do the eight blocks down. But blocks in LA are not city blocks. It was a mile and a half. I'm like, am I still crazy? I actually thought about calling an Uber to just get me there and then wait for me and then bring me back. But I soldiered on. I made it. You guys will be happy to know I got my Starbucks. I'm glad. I was worried about actually getting it. But yeah, and that's the thing cuz every time I go down there, it's it's nice to visit. Yeah. But living in LA, but there are some great places. I know. Um like my buddy lives in Santa Monica and just that little pocket",
            "start": 1897.68
        },
        {
            "text": "the thing cuz every time I go down there, it's it's nice to visit. Yeah. But living in LA, but there are some great places. I know. Um like my buddy lives in Santa Monica and just that little pocket that area is just you just got to know where to be. And because I'm an idiot, I I always stay in Hollywood. Yeah, right. Chaos is right next to like the main place and so it's always a little bit of a sensory attack and um a bunch of people dressed as Elmo and Buzz Lightyear and people stopping me with Spider-Man costumes like Yeah. But um but it's you know the weather's a great trade-off. I mean they have incredible weather and they freak out when they have one day of cloud. I want to be that guy. We freak out here when it gets too hot. It was too hot the last couple days. It's too hot right now. It's fine. No, it got hot. It got hot outside. It's too hot, dude. Yeah. You know, it was like record highs in SF, but he's saying today it's too hot. Today's fine. Today's great. You know, I just when I was",
            "start": 1929.2
        },
        {
            "text": "No, it got hot. It got hot outside. It's too hot, dude. Yeah. You know, it was like record highs in SF, but he's saying today it's too hot. Today's fine. Today's great. You know, I just when I was looking for I was on my pilgrimage looking for relish. It was too hot. Too hot. What's Grant Gustin like? Is he cool? He seems like he's really cool. He likes his dogs. I like a dog. He really is like he since the day I met him, he's the sweetest dude. He really is like I I I you can they say you shouldn't meet your heroes. Anyone who's a fan of The Flash should meet Grant. Should meet him. He's the best. Okay, cool. He really is. Who sucks? Who from The CW sucks and you hate? Sucks in The CW. Oh, David Anders. Everyone, everyone, everyone's just so sweet. It really is. Um, yeah, I have nothing. So, now you're you're a go with the flow guy. So, if iZombie went away, what would the plan be? Would you come would you go to LA? Would you go",
            "start": 1968.64
        },
        {
            "text": "now you're you're a go with the flow guy. So, is for you, if and I'm not saying it's going to happen. If iZombie went away, what would the plan be? Would you come would you go to LA? Would you go to New York? Would you try to do video game VO stuff? I mean, I'd go to LA. Yeah. Yeah. I mean, I I I just want to be on screen. This is one of those things like now you have a foothold, right? Like now work. Yeah. I'm sure now I I I a move to LA and and going around the circuit would be, you know, a different experience if I was just going out for pilots. Well, are you still do you still audition for stuff? Yeah. Okay. Yeah. So, you're still actively auditioning even as you're shooting? Yeah. Cuz we always get this massive period in between. It's about It's not massive. I mean, you get three three months for but it doesn't have to do a movie or something like that. People tried to squeeze one in and stuff, but um you want coffee or water? Kevin's going on a run. I'll do water if that's",
            "start": 2013.6
        },
        {
            "text": "three months for but it doesn't have to do a movie or something like that. People tried to squeeze one in and stuff, but um you want coffee or water? Kevin's going on a run. I'll do water if that's cool. Thank you, buddy. Um yeah. Um but I went for some meetings for some some cool stuff. Some cool stuff. Tell us all about it. Well, my dreams to be in Star Wars is the reason I've been Please tell me you auditioned for Star Wars. Well, I went I I've been trying to I went for a meeting just to meet the the folks and and just say hi, but it's films in it. It doesn't work for our hiatus period, but it's not going to stop. They're going to keep making them, so you can keep doing that. Yeah. Just the Rogue One trailer just dropped yesterday. What did you think of that? I loved it. More than the Force Awakens trailer. Yeah. That's too no. Well, okay. Well, because I've had the Force Awakens the trailer. Are you kidding me? Dead serious. No way. I didn't want to see old Han Solo. Oh my god.",
            "start": 2058.96
        },
        {
            "text": "Force Awakens trailer. Yeah. That's too no. Well, okay. Well, because I've had the Force Awakens the trailer. Are you kidding me? Dead serious. No way. I didn't want to see old Han Solo. Oh my god. I I love this era that they love this trailer for the Rogue One trailer is amazing. But the trailer for Force Awakens, okay, but think of it this way. We have had seven films. Yeah, we've had seven films and we all fell in love with A New Hope, Empire Strikes Back, and Jedi. And we haven't had anything that's dealt with that era since the 80s. So like when we got the prequels, we were dealing with droids, the droid army, the Trade Federation, all of that stuff. WTO. Exactly. And then with the Force Awakens, we've moved away from that style obviously because it's much much later. Whereas this is the first legit re-entry back into that world, back into that time where we could have realistically Boba Fett in it. Or we could have we have Grand Moff Tarkin and Vader and stuff like they can do",
            "start": 2095.84
        },
        {
            "text": "the first legit re-entry back into that world, back into that time where we could have realistically Boba Fett in it. Or we could have Grand Moff Tarkin and Vader and stuff like they can do the most awesome cameos right at that time period. But episode 7 was the first time moving past it. That dude that if you're comparing the trailers, there's no question to me. And I think I think both those trailers are like 10 out of tens. But 10 is worth so much more than this 10. Well, the hype train obviously was built for like was was at an all-time high for the episode 7 trailer. This I hear I feel what you're uh saying though because it's it's it is for my childhood like it's like going back and revisiting my childhood. Did you cry, Nick? Did you cry? I did not. You're right. I did not cry. You cried during the cried multiple time like multiple viewings of it. You I cried during the Man of Steel trailer. But that's because amazing",
            "start": 2143.44
        },
        {
            "text": "Cry. You cried during the movie multiple times, like multiple viewings of it. You cried during the Man of Steel trailer. But that's because it's an amazing, fantastic trailer. I don't cry in trailers for me; it isn't a benchmark because I find like trailers evoke emotions, and their main goal is to try to deceive you to get you invested. The Rogue One trailer didn't do it, and I liked it for that. And also, the thing is Empire is my favorite film of all time. Seeing her in the tunnel of light, with a shot of a back to tank with the Emperor's Royal Guards there - those are Star Wars moments to me, way more than seeing old Harrison Ford. For some reason, I was really aware of it being this movie, a sequel for Disney, like The Force Awakens. Whereas with Rogue One, I don't know; there's something that felt alive. It felt like I was seeing a snapshot of that time. Yeah, exactly - a parallel story right from",
            "start": 2184.24
        },
        {
            "text": "this movie a sequel for Disney. Whereas with Rogue One I I don't know. There's something felt alive. It felt like I was seeing a snapshot of that time. Yeah, exactly. A parallel story right from there ripped out from from that era. I don't know. I mean I'm  It's amazing. I cannot wait. Yeah, there's something special about such a good time right now. This is great. So, we need to basically what you're telling us is start a campaign to get you in the next Star Wars. Everyone, everybody tweet it. George Lucas, I don't know who to tweet it tweet. Kathleen Kennedy, I would imagine. Does she have a Twitter? I don't know if Kathleen Kennedy has  I'm sure she does. We're going to look into all this and if anybody has a Twitter, we'll put it here with the message. We should like go for an actor in Star Wars that isn't massive. We'll see the tweet. Boy is massive. It has to be like No, we're  I'm verified. We can make it happen. We can make him see it for sure. Thank you, buddy. Cheers.",
            "start": 2229.52
        },
        {
            "text": "in Star Wars that isn't massive. We'll see the tweet. Boy is massive. It has to be like No, we're I'm verified. We can make it happen. We can make him see it for sure. Thank you, buddy. Cheers. No worries. We're also trying to get Dave Fennoy and Walking Dead. You want cream, too? Bring the cream in. Yeah. Have some fun, will you? It's a show. That's that's fun, though. I mean, that's that I think anyone who's ever dreamt of doing anything in TV or film, even, you know, on screen or offscreen as as like Star Wars is the golden goose. Star Wars is like if you could just be a part of a Star Wars film. And the the the great thing for me is like I've always wanted to, you know, write and direct uh films and it kind of sucks because now that's the show. Um can I see the dessert menu? Thank you. Um but now it kind of sucks cuz now there's no time limit for you. Like the concept of being a writer, you're always sort of putting it off, putting it off, putting it off. Now I can put it off",
            "start": 2267.12
        },
        {
            "text": "you. Um but now it kind of sucks cuz now there's no time limit for you. Like the concept of being a writer, you're always sort of putting it off, putting it off, putting it off. Now I can put it off indefinitely because Star Wars will be forever. It's forever. We all It's just going to keep guiding guiding guiding. Yeah, it'll be I mean that's why it was imperative for me to try to get in The Man in the High Castle now because as an extra because who knows how long. Yeah. Oh yeah, I might be able to I want we were talking to I think his name is Lee Shortall who is like one of the guy one of the Japanese Imperial guys on there and we were I think Greg asked him like no so to give you context for this Colin Colin was on the the hype train early. He was he was he actually he is the locomotive for for The Man High Castle. Everybody watch everybody watch everybody watch everybody watch it. And finally, yeah, this actor tweeted in response to one of our fans and then looked through it and saw",
            "start": 2308.4
        },
        {
            "text": "for iZombie. Everybody watch everybody watch everybody watch everybody watch it. And finally, yeah, this actor tweeted in response to one of our fans and then looked through it and saw that how many times Colin had recommended it and then tweeted at Colin thanking him for recommending it. And then Colin's like, \"Can I be can I just be an extra in the show?\" One of the Nazis or whatever. And the guy's like, \"I don't know if I have that much power, but I'll try.\" You know, it's shot in in Canada, right? Yeah. Like the crew had when they finished doing iZombie season one shot Man High Castle and the cast didn't I can we got to make this happen. Sure. I I want I want to just I would prefer not to be a Nazi, but I'll be a Nazi. Nazi or nothing. I feel like I want to be part of the resistance, but I got to be honest. There's only three sides and I can't be a Japanese person. Unfortunately not. So I feel like unfortunately for some reason the Nazi just feels right. Well, they",
            "start": 2348.72
        },
        {
            "text": "but I got to be honest. There's only three sides and I can't be a Japanese person. Unfortunately not. So I feel like unfortunately for some reason the Nazis just feels right. Well, they a lot of the show does take place on Long Island and that's Nazi occupied. So I enjoyed there was a tweet today too that uh Nick should be a cadaver on your show and I like that. Be a cadaver. Pull it out. Great sleeping. It's just lying on a table for 8 hours while we spit over you cuz we enunciate. That's totally fine. Play in the back of the room. Totally fine. Yeah. Yeah. Like, can I be naked? It has to be fully erect. But we can't show the dong, but we need to see the dong. Oh, I will show Let me just let me put this out of you. I'm willing to do whatever it takes to succeed. Perfect. Whatever. You're going to go far, Nick. Whatever it takes, Tim. And I'm going to I'm going to ratchet it up for man high cast. I need a speaking part. Oh, damn. For now he's getting Now he's getting bold. And I",
            "start": 2386.88
        },
        {
            "text": "going to go far, Nick. Whatever it takes, Tim. And I'm going to I'm going to ratchet it up for Man High Cast. I need a speaking part. Oh, damn. For now he's getting Now he's getting bold. And I like it when Colin gets bold. I like it when he rubs his mustache. Like a speaking part. That's asking a lot. I need a line. You what you need to do is get yourself on the show as an extra and have so much presence that whoever's directing that episode decides to give you a speaking. Yes. Open Group and Fure. Whatever they whatever that **** better than that. It's got to be better than that. I'll work on it. Work on it. Ask him for some pointers. He's been acting since he was four. I have no interest in acting or voice acting at all. But like when there's certain shows like if Jericho came back, I'd be like, I got to be on Jericho. You know, I'm responsible for literally 20 20% of the traffic that show gets on Netflix. I'm going to be on **** Jericho. True. And be like, you're probably",
            "start": 2426.88
        },
        {
            "text": "I'd be like, I got to be on Jericho. You know, I'm responsible for literally 20% of the traffic that show gets on Netflix. I'm going to be on Jericho. True. And be like, you're probably right. Well, I don't know that show is ever going to come back. But no, that window of that coming back passed about a year ago. You never know. You never know, though. They brought 24 back after like 18 years. Skeet Ulrich needs work. But the other guy, Norman Reedus, is on Walking Dead. Hawkins. Yeah, whatever. I never remember his real name. Also, I found out one of these British folks who plays iZombie and I didn't know that. Somebody said that. I was like, \"Oh, I didn't know Maggie was British.\" Yeah. Andrew Lincoln, we were having this conversation. Everyone's British. Corey Stoll in House of Cards has a Swedish accent. Is he really? Yeah. Oh, I didn't know that. He's playing the Republican nominee for president. So funny.",
            "start": 2460.88
        },
        {
            "text": "of Cards is like Swedish. Is he really? Yeah. Oh, I didn't know that. He's a RoboCop. Oh, yeah. He Yeah, he's a Swedish accent. Yeah. And he's playing the Republican nominee for president. So funny. Yeah. My wife uh loves the the British accent. And when she found out that Andrew Lincoln was British, it was just like, he's the perfect human being. Yeah. And I'm like, why don't you go **** marry him then? Okay. Why don't you leave me and you go marry him? Having sex dreams about Andrew Lincoln when I'm sleeping right next to you. Not cool.",
            "start": 2498.8
        }
    ]
}