{
    "id": 1905,
    "video_id": "09FItdx5c0w",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Greg and Tim Can't Be Quiet - Kinda Funny Plays",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nIn Stifled, you see by sound -- but be too loud, and your enemies see you. Well, Greg and Tim are screwed.\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1468080001,
    "duration": 966,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to another let's play here on youtube.com/Kinda Funny Games. I'm Greg, that's the pure one, Tim Gettys, and this is Stifled. It is what's happening here, Tim, is this is a game we saw uh people trying to get me play, I believe it on GDC is when I first ran into this game. And the idea here is eventually we're going to lose our eyesight, spoilers, and we will see through the power of echolocation. But there will be enemies in the area. Now when I say see echolocation, we have to make the noises. So we're like Batman, if Batman was loud, or if he was like a real bat. I guess they make noises though. You could just leave the I mean that's they don't they don't they go or something and like they it bounces back, that's how they see. So is that what we need to do? We can do that right now. We still, we've been in a car accident, we still have our sight, so we need to get into it. Now the problem of course is that there's going to be enemies in this game, so when we make the noise and the",
            "start": 0.12
        },
        {
            "text": "We still, we've been in a car accident, we still have our sight, so we need to get into it. Now the problem of course is that there's going to be enemies in this game, so when we make the noise and the game picks up our audio, our enemies will see us that way as well. Okay, over here there's some blood. There was not good. What was that, sonar? No, it's we still eyesight, Tim, we don't have to do. Yeah. Uh oh, what we got here? Looks out oral suspension. Tim, what do you know about oral suspensions? I mean it's never really worked out that good. It's kind of like, you know, 69, where it sounds better in concept. Oral suspension, like you're hanging upside down, she's hanging too. It's never quite the right amount of like friction you got going on. Okay, it's upsetting here. Now we're examining this is some Brandy, Greg. I want to I want to learn. I want to here, I'm pick it up. I I can't zoom on or maybe with the click wheel. This is World building, exactly, Tim. Here we go, there's a letter. Oh, here we, oh jeez, read it and go.",
            "start": 39.76
        },
        {
            "text": "Want to I want to learn. I want to here, I'm pick it up. I I can't zoom on or maybe with the click wheel. This is World building, exactly, Tim. Here we go, there's a letter. Oh, here we, oh jeez, read it and go ahead and read it. Dear Rose and Dave, how have you two been? It's been a very long time since from Mom and Dad. It's not going to be sexy. And we're getting a bit worried. Please do contact us whenever either of you have the time. We have some great news to share. We've had Jane and her husband over on weekends and done. We were apparently we were on our way to see Mom and Dad. I'm assuming I'm the man 'cause games are here we go. I'm fine, dear Mom. I'm fine here. I just been quite busy lately and weren't able to ride as much as I would have liked to. Happy to nope. Great to hear about Jane, really happy for her. As for the visit, it might not be possible as redacted. I'm going to assume she was talking about how she started this crazy career in suspended oral sex and everybody's like don't really support that.",
            "start": 85.64
        },
        {
            "text": "As for the visit, it might not be possible as redacted. I'm going to assume she was talking about how she started this crazy career in suspended oral sex and everybody's like don't really support that. Jane's a mom. Okay, Jane's a mom. Yeah. So what is this? So what does oral suspension do? I mean it really depends on who you are and like how you're how committed you are to the act. I don't I don't think it's the same thing you think is. All right, we're going off into the blood trails here. Oh, here we go. See, now it's dark. You can see our little voice down there. Okay, yo, Beyond sonar. Oh, this is fun. Kinda Funny, Kevin, mushrooms sucks. Sonar, Kevin. Okay, there's a bird. They **** things up with there. You think there's like crazy monkeys? I don't think. Oh, this fades away. It is like sonar. Come back. Tugboat, tugboat, tugboat, tug, tug, tugboat. See a tugboat? No, that's just a good word to say to get a lot of things going. Got tugboat. See, look at that. It's it's we're going up here 'cause this looks",
            "start": 129.24
        },
        {
            "text": "Tugboat, tugboat, tugboat, tug, tug, tugboat. See a tugboat? No, that's just a good word to say to get a lot of things going. Got tugboat. See, look at that. It's it's we're going up here 'cause this looks like a real look at that water. Now this, that ain't no water. This, there's a rock. This looks like Unfinished Swan but with sound, bit more finished. There's no swans. Swan, where you at? I'm in the water now, splish splashing around. Splish Splash. I was taking so they're introducing you to the mechanics here, Greg. This is how video games work. No enemies yet, yet. Here we go, go up here. Why not go to the cell? Why? Oh, where's the blood? So oh, there is blood. Why do you have this power? Is this the oral suspension? We don't know. I guess this is the oral suspension. I'm in a sewer of some kind. Daredevil has or oral suspension. Daredevil has oral suspension confirmed. May, is that something? Is that so someone else is yelling back at us? Yeah, but they they got red powerful. We should be quieter. It's Electro. No, it's",
            "start": 191.48
        },
        {
            "text": "Suspension. Daredevil has oral suspension confirmed. May, is that something? Is that so someone else is yelling back at us? Yeah, but they they got red powerful. We should be quieter. It's Electro. No, it's not even my footsteps are making noises. It's 'cause you're splish splashing around. You're being too loud to, Kevin, shut up. You're being too loud too. Everybody's being too loud. Nobody can hear me. Then why are you even talking? God, I hate you, Kevin. If this is how life was, I wouldn't like it. What you going to do? Stop? I don't know. Yeah, sit there, let it happen. I think that's that's oral suspension. You're right, you're right. Up here now. You think there's any little rat friends down there? There's got to be. Oh no. Oh, see, no, I would instantly leave. You have to figure out what's going on. Yeah, it's a ghost or something. Things aren't what they seem in this game of oral suspension. Try looking up. **** Echo Boys up in this ****. Oh man, that's a good name for us. We're the Echo Boys. What up? It's your",
            "start": 242.48
        },
        {
            "text": "Things aren't what they seem in this game of oral suspension. Try looking up. **** Echo Boys up in this ****. Oh man, that's a good name for us. We're the Echo Boys. What up? It's your boys, the Echo Boys. Yeah, Echo Boys in the house. We never come just once oral suspension. We keep coming and coming and coming and coming. I like that the echo ****. You're so clever. Echo, echo. Hey, real talk though, yeah, I miss Ecko, like Marc Ecko the dolphin. Oh no, not Ecco the Dolphin. I used to exclusively wear Ecko Shirts. Yeah, I know that. I know that's your shoe. Is this a scary game? Uh, it might be a scary game. It turns out you just said **** you to that shoe. That shoe didn't give me any viable information. I'm just waiting for the other shoe. Hold on, watch this. You ready? That was funny. Hold on, that was really funny. But here's how we should do the rest of the way. Spring break forever. Only use that word now to get things going over here. Spring break, spring break, spring, spring break. I that was weird.",
            "start": 314.64
        },
        {
            "text": "Really funny. But here's how we should do the rest of the way. Spring break forever. Only use that word now to get things going over here. Spring break, spring break, spring, spring break. I that was weird. I guess we're whispering too. Spring break. I can do this for you. Don't worry. I did they stop? Imagine playing this 30 hours. Mom breaks something on. Uh oh, uh oh. Don't yell, don't yell. Oh ****. How do you combat them with swear words? Night Bat. Who do you think the bad guys are? You had to take a guess. Raccoons? You think it's just raccoons? It's got to be other creatures of the night, right? What the **** is going on? Raccoons don't make that. Shut the **** up. Shut up. Be quiet. Raccoon, raccoon. All right, we're getting safe. He's not red anymore. Nope. Where did I put my mic though? 'Cause there's a little hole in the wall. Raccoons were looking through it. Little B, that oral suspension glory hole. Jesus. There we go. Oh, you're standing up. No more crawling, walking. Ah, ah. Oh God, she's shoeless. She's oh, and I'm down.",
            "start": 373.08
        },
        {
            "text": "In the wall. Raccoons were looking through it. Little B, that oral suspension glory hole. Jesus. There we go. Oh, you're standing up. No more crawling, walking. Ah, ah. Oh God, she's shoeless. She's oh, and I'm down. I'm in the water. Shoe just dropped. There it was. There it was. Told you. Oh my God. Oh my God. Just hold it and kick. Someone does it qualify with a as a kick? You hit someone with a shoe. I think so. Okay. Oh God, very quiet, very, very quiet. I don't think it's friendly. No. Oh yeah, ****, ****, it got me. It got me, guys. Scared me. It scared me. I hit it with a rock. Run. Yeah, get another rock. There's two, there's two of them. Yeah, they got me. I think you're done or not. We died. We should try to get past that part. Okay, we're going to be better than that. We are. Oh, right here. Oh, I use rock not as a weapon. It's a distraction. Where is he? B. Which one over there? We do. Are we? Can I don't know to do, Kevin. Oh my God, it's a little a door for mice. That's the mice door or Alice in Wonderland. Oh, it's that's",
            "start": 452.36
        },
        {
            "text": "A weapon. It's a distraction. Where is he? B. Which one over there? We do. Are we? Can I don't know to do, Kevin. Oh my God, it's a little a door for mice. That's the mice door or Alice in Wonderland. Oh, it's that's making noise. That's giving off some. Give me an an uh uh give me give me a guttural growl. Give me one of the ones you save for Gia. What? God, Gia, I'm so sorry. Stop it. Where y'all at? ****. You were talking a lot of **** a second ago, giving me them Godzilla screams. Now you gone looking like a like the Flood from Halo. They look like they look. Oh wow. Okay. I was going to say they look like baby uh baby uh chunk. No, Sloth from The Goonies. If Sloth and um PJ from Barney had a baby. Who's PJ? I don't remember PJ. PJ was the yellow guy. He was theie uh like the knockoff Barney. Did I just come through the back thing? Is my my Barney history correct, Kevin? Did I just go backwards? Yeah, you go backwards, Kevin. That doesn't sound right. I think is new. That's nope, that's right. Kevin's right. Plop, ploop, ploop. Häagen-Dazs. Go some",
            "start": 545.52
        },
        {
            "text": "Is my my Barney history correct, Kevin? Did I just go backwards? Yeah, you go backwards, Kevin. That doesn't sound right. I think is new. That's nope, that's right. Kevin's right. Plop, ploop, ploop. Häagen-Dazs. Go some ice cream using some big words like that. Where you going to get ice cream? I don't know, maybe just Walgreens. Get some Häagen-Dazs. To be fair though, I like Ben & Jerry's a lot more. Yeah, Mitchell's a good ice cream. Oh, Ben & Jerry's in the hate. E E Cherry Garcia. No, you want to do that Stephen Colbert one? Americone Dream. Too much. What's too much? That's too much. You're crazy. Americone Dream, Fish Food. It's a Phish though. Yeah, Jimmy Fallon has one. Yeah, I saw that. Wake me when Mike Jer has one. Rock blast. I bet going to make some noise. Bring out some creeper man. Uh oh. I'm going to go fast though. No, I should have gone faster. Oh my God. Yeah, I mean I can't make it go faster. Kevin left. That's my favorite part. Oo, or I going up moving stair, stairs, stairs, door, hands, tunnel, hands.",
            "start": 622.72
        },
        {
            "text": "Have gone faster. Oh my God. Yeah, I mean I can't make it go faster. Kevin left. That's my favorite part. Oo, or I going up moving stair, stairs, stairs, door, hands, tunnel, hands, rocks. Uh-oh. Oh, you're now you're on the other side. A little millstone. It was a drain thing, drain thing. It looks like like Twilight Zone, but like not one of the memorable ones, you know. Rock. No, I got to throw a rock the away. We don't want to go. They'll run away. I'm not quite sure what the goal was though. I was throwing it away from him. I was throwing it to the other side of me. No, you threw it right in front of you. Did you see there was a yellow and I didn't see the yellow exit sign. Oh, is it an exit sign? It said exit. See that blood? Where? Oh yeah. All right. I I've only identified shoes. The mouse died again. It's not a mouse hole, Tim. It was very clearly. All right, so here, so I'm going to throw it over there right while I'm here. Boom. Run. Is my don't yell more. Maybe I didn't see us. Ah, no. Jesus. No. Oh.",
            "start": 715.0
        },
        {
            "text": "Again. It's not a mouse hole, Tim. It was very clearly. All right, so here, so I'm going to throw it over there right while I'm here. Boom. Run. Is my don't yell more. Maybe I didn't see us. Ah, no. Jesus. No. Oh Lord. All right, there we go. Close it, close it. We here. Wii. Yeah, he out there. W. This isn't how bat see. 'Cause I like bats and this you like bats. Bats are kind of the homies. They're a little weird looking. Oh look, now it's back to normal. Oh, boom. Closing the door on that story. Go in the light and look at it. All right, shut up, Kevin. I'm sorry. I've been through a lot on this mission. It's a map. I there orphanage. Eat an orphanage. Oh no, Kevin, this game is scary. I'm sorry. I don't like this. Uh oh, there's a wolf now. Wolf. Wolf's also known for seeing with echolocation. Bark. Couch. Under, under, under the couch. Under that death dude. The the world's coming apart of the same the ****. Okay, there you go. We won the demo. We have survived. We have unstifled Stifled. I didn't think it was going to be that scary of",
            "start": 833.4
        },
        {
            "text": "Under that death dude. The the world's coming apart of the same the ****. Okay, there you go. We won the demo. We have survived. We have unstifled Stifled. I didn't think it was going to be that scary of thing. I thought it'd be like wolves in the jungle or not the jungle, the forest. I thought, yeah, like monkeys or some type of animals. Why do why they hang up on the monkeys? Well, I don't know 'cause there's trees. What hangs up in trees, Greg? I mean squirrels, they don't hang. Don't be stupid, monkey. Ladies and gentlemen, that's Stifled. According to their website, it's coming to PC and consoles this year, but that year is running out pretty quick. You can find out more information there on the internet. Let us know in the comments what you thought of it. And for all your information, just scream at the wall and watch the vibrations come back at you.",
            "start": 912.0
        }
    ]
}