{
    "id": 1922,
    "video_id": "4RpFzc6QZJA",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Patrick Fortier"
    ],
    "title": "Nick Loves Deus Ex: Mankind Divided - Kinda Funny Plays",
    "description": "Nick and  Greg play Deus Ex: Mankind Divided.\n\n Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1468866725,
    "duration": 1848,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to Let's Play here on youtube.com/KindaFunnyGames. I'm one of your hosts, Greg Miller. That's the producer, Seducer Nick Scarpino. Hello, this is Patrick. Patrick, you made Deus Ex all by yourself, Mankind Divided. It's all, it's your game. You did it all. Took him 84 years, but he crushed you and Elias. That was it. You, yeah, his voice and then my, uh, yeah, everything else. Patrick, what do you do for the game? I, you know what, I, I, I went to a barbecue recently and I found out that I, I do nothing. I, I spoke to a cousin, my, um, of my wife, and he was asking like, what do you do? Do you program? I'm like, no, I don't program. Do you, do you draw? No, I don't draw. Do you write the story? I don't write the story. What do you do? I'm the gameplay director. So you play, you're like, this sucks. And he's like, he's like, wow, that's fantastic. That's all I do. You do nothing. And no, I, I work with a, a fantastic team of, uh, gameplay programmers and game designers and AI guys and and a whole team of people",
            "start": 0.08
        },
        {
            "text": "like he's like, wow, that's fantastic. That's all I do. You do nothing. And no, I, I work with a, a fantastic team of, uh, gameplay programmers and game designers and AI guys and and a whole team of people and we make Deus Ex. Nick, yes, you're Mr. Deus Ex. That's why we picked you to play. You love Deus Ex. You're the biggest Deus Ex fan in the house. We're going to start, we're going to jump right into a cut scene. Hit it. They lied. This isn't a cut scene. You lied to me. It's not a cut scene. But guess what? Guess what's going to have to happen? What's going to happen? I'll give you one guess. You're going to hit somebody. Oh, you these guys. Aces Over the Pacific. Aces Over the Pacific is when you, you needed, no, I don't that an X-Wing. Um, so Patrick, what do people need to know about Mankind Divided? Well, Mankind Divided is, uh, the sequel to Human Revolution. So it takes place like years after the events of Human Revolution. It's kind of like the flip side of the transhumanism, uh, storyline that that we explored in in Human",
            "start": 41.48
        },
        {
            "text": "the sequel to Human Revolution. So it takes place like years after the events of Human Revolution. It's kind of like the flip side of the transhumanism, uh, storyline that that we explored in in Human Revolution. So before is the Cyber Renaissance, the dream of the augmented people. People are are going to decide of their, take control of their their lives, their bodies, their destiny. Uh, and and Mankind Divided is like the flip side of that after the events, after the Aug Incident that occurred at the end of of Human Revolution where people got hacked into, uh, they lost control of theirs and they just, you know, a lot of people got killed. There was a lot of tragedy. Uh, and now we're exploring that side of it, like how, what happens now? Like how people react to that. And it's created a big schism in society. Uh, and some people are are very afraid. Other people understand that, uh, the augmented people didn't have any control over what they did. Uh, but now like, uh, the power players in because it's all about",
            "start": 85.8
        },
        {
            "text": "uh, and some people are are very afraid. Other people understand that, uh, the augmented people didn't have any control over what they did. Uh, but now like, uh, the power players in because it's all about conspiracy. So all the the power players and the governments and corporations and stuff are trying to wedge that divine further and take advantage of way too much talking. You're telling them off, Nick. You want to get out there? You want to get to the action? She's just talking my ear. This is probably the cut scene we were like, it's going to start with and we just talked over it. So are you, are you, you know what you're going to do now, Nick? Yeah, we're going to, we're going to kick ass and take names, guys. That's what I like to hear. Lots of people. Now, how did you, you were a big fan of the first Deus Ex or, you know, I guess, you know, not the first, you don't eat me live internet, the last Deus Ex. How did you play? Did you play stealthy? Did you play take? I, I tanked up and then every time I went into a room I did",
            "start": 129.32
        },
        {
            "text": "know, I guess, you know, not the first, you don't eat me live internet, the last Deus Ex. How did you play? Did you play stealthy? Did you play take? I, I tanked up and then every time I went into a room I did the Rorschach line where I'm like, you think you're, I'm locked in here with you? You're locked in here with me. And they're like, the door isn't locked, Jensen. Stop it. It doesn't matter. I'm killing everyone. Do you expect to play this one the same way? I do. Okay. I don't know any other way. I did see you play Metal Gear. I do know that's you only know one one way that game. I think I'm not sure if it ended or not. No one really is. So this is some of what we're seeing right in terms of the haves and have-nots and in city. And this is right outside of, uh, Prague. And and this is kind of a, this this installation was, uh, set up for migrant workers, uh, working out of Prague. And then after the Aug Incident, they transformed it into a ghetto. Then people are are being thrown here for for different reasons. Uh, and you",
            "start": 168.08
        },
        {
            "text": "was, uh, set up for migrant workers, uh, working out of Prague. And then after the Aug Incident, they transformed it into a ghetto. Then people are are being thrown here for for different reasons. Uh, and you know, the the laws keep changing weekly and they don't have the right papers and they can't pay off the right people. And there's a lot of different excuses, a lot of different reasons. And if you there with the picture, Kevin Quello, everybody. Big, big Kevin Quello, the GoPro kicking everything off. What's up everybody? We're back. Kevin stood up and kicked the PlayStation off. So we've come back, but we've jumped ahead now. Correct, Patrick, to fight a bit. H, sorry, I was still mesmerized by by Kevin. Kevin is an Adonis over here. He's like a beautiful train wreck. Come get a hug, Kevin. Come here. All for it's okay. Don't worry. Deus Ex Go is so hard. I know Deus Ex Go hurt you. I know that. Let's play on youtube.com/KindaFunnyGames. Jump back in. Now you have a gun. Now you're to, you're, you're going to screw some up. You're screw",
            "start": 209.28
        },
        {
            "text": "okay, don't worry. Deus Ex Go is so hard. I know Deus Ex Go hurt you. I know that. Let's play on youtube.com/KindaFunnyGames. Jump back in. Now you have a gun. Now you're to, you're, you're going to screw some up. You're screw some stuff up. Not screw up. You're probably going to screw up. All right. You you've got all kinds of equipment right now. So, okay, so what have you given him here? What's happened? Yeah, so you have on the L1, you have the the Tesla, uh, gun arm. So you can, uh, you can actually hold that and then you can target multiple, uh, enemies at once. And you're going to see that there. Please do that when people come around. I'm definitely going to do that. But I keep entering this restricted area. I think you're have to. That's the game. The game is called restricted Deus Ex restricted. The top one there that you have is the is a Smart Vision. So you can toggle that on or off. Okay. Yeah. And then if you just want to see through walls and does this work for clothing as well or is that not you tar? No, I'm sorry. I, I had to ask. It's",
            "start": 262.76
        },
        {
            "text": "Smart Vision. So you can toggle that on or off. Okay. Yeah. And then if you just want to see through walls and does this work for clothing as well or is that not you tar? No, I'm sorry. I, I had to ask. It's a, it's a gameplay mechanic. You can actually like target some some NPC, um, while you have that on as well. So the one on, oh, **** yeah. Nick is just going to Tesla arm everyone to death. Yeah, there's little. I'm Tesla arming these guys. I was going to say these guys are begging for a Tesla arm. Look at this guy's arm. It's like, you can't deal with my Tesla arm. Yeah, this guy, this guy's upset because he, Nick, what I want you to do is give him a good Tesla fisting. I'm going. He just went up me there, buddy. There's nothing better than the Tesla fisting. Tell you that for sure. Coming here. So even though we're in a new setting with Jensen, you know what I mean? The games move forward, time different. It's the same idea, right? Where we're going through choices, a big deal. How are we going to play? It's the same philosophy.",
            "start": 299.48
        },
        {
            "text": "new setting with Jensen, you know what I mean? The games move forward, time different. It's the same idea, right? Where we're going through choices, a big deal. How are we going to play? It's the same philosophy. It's all about player freedom. It's all about choice and consequence. Um, you know, exactly what we were seeing before. Like we're, we're offering you a lot of things. There's a lot of characters. You can choose to talk to them. You can just go straight by them and just do some objectives. You can do a lot of side quests if you want. Um, even even like some of the the side quests themselves, um, you can reach a point of resolution where you think like, all right, you know, I'm happy with this. Other players are going to be like, maybe not. And they're going to talk a little bit more. They're, they're targ to do it all. Look at that. You got them all. Look at that. You're about to get blasted. My Tesla. Are they dead now or do I have to shoot them in the face? Well, if you want to kill them, yeah, they're, they're",
            "start": 345.92
        },
        {
            "text": "do it all. Look at that. You got them all. Look at that. You're about to get blasted. My Tesla. Are they dead now or do I have to shoot them in the face? Well, if you want to kill them, yeah, they're, they're neutralized. No survivors, Nick. No survivors. That's the place. Someone may have seen my face. No survivors. And you didn't make any noise. But there are other NPCs. So they didn't, they're not aware of what you. So you ran out of am. I'm this guy is going to get C in the face. Yeah. Oh, Nick, I love it. You have another gun armor as well if you want to try that on the on the right D-pad. You have a, you have a Nano-blade. So, oh, you have somebody on. I just like that there was no, you took no cover. You're like, I give no to take cover to be honest. Uh, just click on the L3. There we go. Okay. Thank you. Yeah. So you found the Titan Shield. Awesome. Very nice. Looks cool. What just happened to me? Um, you ran out of energy. Oh, I see. Yeah. What am I got? Oh, I got this thing. What is? Oh, ****. That's a Nano-blade. Yeah. So you can charge. You can",
            "start": 382.4
        },
        {
            "text": "awesome. Very nice. Looks cool. What just happened to me? Um, you ran out of energy. Oh, I see. Yeah. What am I got? Oh, I got this thing. What is? Oh, ****. That's a Nano-blade. Yeah. So you can charge. You can aim that at people and and they're going, you're going to like, I want on the wall. Yeah, yeah, yeah. Like that guy maybe. Oh, did I get him? Yeah, you did. Yeah, I did. Cause I'm **** grenade. Got to come over here. Let me take care of this guy real quick. Kevin, be very careful. Kevin, the Wrecking Ball. The actually, you can actually Nano-blade as well if you want. So you could, you could charge it up and then throw it like behind the guys and it's going to. These guys are wrecking me right now. Well, I say you also get shot to death. Well, to be fair, I'm not covering as much as I should. I'm mostly just running out and firing. You like the Terminator. I like it. We're going to load less or you train out the toys. I, I understand. You got, you got to get a feel for them, Greg. Cause they don't all drive like, you know, the",
            "start": 439.0
        },
        {
            "text": "and firing. You like the Terminator. I like it. We're going to load less or you train out the toys. I, I understand. You got, you got to get a feel for them, Greg. Cause they don't all drive like, you know, the Ferrari that you want them. Just some more like a truck, some more more like a tank. Talking about the powers and the guns and stuff. I'm talking about me talking about how I play games now. Yes, the powers and stuff. I got to, I got to get a feel for them. Okay. Feel for. I appreciate that. I appreciate what you're doing now, Nick. You're, you, you only find a select few games that you play. What about Deus Ex makes you want to play Deus Ex? Why'd you play the first? Why'd you play last? I just liked the world that they created in in, uh, Human Revolution. I thought it was fun. It's a good mix for me of RPG elements and actual really good combat. Um, yeah, I don't know. It's something about, it's just something about the Sci-Fi world, the sort of dystopia and future that they've got going on. It's really cool for me. We're going to",
            "start": 492.48
        },
        {
            "text": "good combat. Um, yeah, I don't know. It's something about, it's just something about the Sci-Fi world, the sort of dystopia and future that they've got going on. It's really cool for me. We're going to continue here as we go. That's that's smart. It's actually like, uh, there's like last time saw me, bro. He saw me. What do you want me to do? Last time I didn't take enough cover. This time spray and pray, man. Adam Jensen's off his meds. What what do you want from me? It's good to see you play like that. The combat is one of the the pillars that we tried working on and try to improve like just the responsiveness of it. Not bad. Not bad. Yeah, it feels good. Combat feels good here. Oh, God, this guy's jacking me up now. It's regenerative health, right? So if he can just get, you can get through it. But you could actually also if you hit the, uh, you're going shot. I'm going to try stealth this next time. How about that? I, I think it lasts one person. It last one person is how long the stealth run. I'm I, I, I wish you the best. I",
            "start": 529.2
        },
        {
            "text": "if you hit the, uh, you're going shot. I'm going to try stealth this next time. How about that? I, I think it lasts one person. It last one person is how long the stealth run. I'm I, I, I wish you the best. I hope it goes better than that. But I bet one person probably that same person who recognized you before. I'm going to be a little more strategic this. Okay. What's your, lay lay your strategy on? I'm going to figure out what the are first. That's first and for. Oh, you use the vision, the invisible vision. And then secondly, I'm going to go and blast. It's not stealth, Nick. That's the opposite of stealth. I'm coming, Greg. It's stealth. They know you're coming. That's just a surprise attack. All right. Sounds like he's going to go by now. Use the vision. Remember up on the D-pad. Up on the D-pad. Yeah, there you go. We see everybody there now. Why did you walk out and actually geted? If you do like aim down sides while you're doing this, you can actually like mark and track them as well. Oh, really? Okay. You just, you just Tesla",
            "start": 573.8
        },
        {
            "text": "there now. Why did you walk out and actually geted? If you do like aim down sides while you're doing this, you can actually like mark and track them as well. Oh, really? Okay. You just, you just Tesla arm the same person. You can see there the kind of loot that they have, the weapon that they have. And and the other one that you were targeting before had an augmentation. And you can actually see that like he has the, uh, this. How do I try? How do I tag him? Um, or do they just? Yeah, yeah, it should. Yeah, you just, you just did it on up. You see up in your HUD. You see. So now even if you turn off the Smart Vision, they're still going to be. Hold on. Mark that guy up there. Guy. Yeah. Don't tell me what to do. I'm just trying to help you. You're stealth play through. There's a guy all the way up there to your North. There's another guy down. Yeah, but I I to have line side on. Oh, no, he can just. Okay, cool. All right, cool. Yeah, I feel great about this, guys. This is the one, man. Really what got you last time was just not knowing",
            "start": 622.6
        },
        {
            "text": "another guy down. Yeah, but I I to have line side on. Oh, no, he can just. Okay, cool. All right, cool. Yeah, I feel great about this, guys. This is the one, man. Really what got you last time was just not knowing where the guys were. You kind of just ran out and shot at everything. That's this will help out a lot. You see the thing is they they wear clothing, Greg, that camouflages them to the, uh, futuristic environment. Oh, I didn't know that. See how that works? It's it's part. She clearly walking right. You why? What motivated you to come up right in the chest? Look, I got The High Ground now, Greg. And it's going to be fine. I worked out well for Anakin. She walked into your trap. She did get in the v. She has no idea what's up. No, get in the vent. Yeah, I'll get in the vent. Oh, God. Oh, they're coming at me. Yeah. So see those guys are augmented. So they can jump. They can just jump like. Yeah, there's a lot of verticality in this level as well. So there's a lot of paths up. You see how that got. Oh, ****. What are you doing?",
            "start": 664.96
        },
        {
            "text": "guys are augmented. So they can jump. They can just jump like. Yeah, there's a lot of verticality in this level as well. So there's a lot of paths up. You see how that got. Oh, ****. What are you doing? Yeah, it's going to take you four years to play through this game. No, I got to get a feel for it. You can see on the radar as well. Yeah, there's a lot of triangles around. You want to try it? Yeah, give me, give me. Why you run? You got to flip your inversion, Greg. You just remote hack something. I did. I didn't know I could do that. Well, when you don't just run in and shoot, a lot more to figure out this. There's a time, there's a time. Uh, there's no time spent on this. You take your time. Take him back. So yeah, you're running a little bit low on energy. Cause cause I was running my thing. Yeah, yeah. So now you now you kill him. Oh, I want to kill this guy big time. No survivors. Ooh, he had it coming. Story-wise, he did betray you. So, okay, good. So this all makes sense. It make sense. There we go. Don't need that. Don't need",
            "start": 709.2
        },
        {
            "text": "him. Oh, I want to kill this guy big time. No survivors. Ooh, he had it coming. Story-wise, he did betray you. So, okay, good. So this all makes sense. It make sense. There we go. Don't need that. Don't need that. Do this now. I now I did what I'll tell you is I bungled it before. So I do need to mark everybody. See, that's how you do it. See, I didn't see those two guys up there. I didn't know there was a vertical. You just ran. You have the luxury of seeing all the mistakes that I've already made and capitalizing off of them. So don't act like this. Oh, you're, I'm so smart. I haven't never seen this before. How does this game work? But you saw a pro play it and lose. And now you're just going to go ahead. It's like when I open the jars for you, a pick, Nick. I need a pickle. You come over and you do the thing where you knock it at the bottom to pop off the top that we learned on The Cosby Show before we exact. Well, he's a terrible person. Let's not talk about him. Allegedly, he hasn't been convicted yet, has he? That",
            "start": 757.64
        },
        {
            "text": "you knock it at the bottom to pop off the top that we learned on The Cosby Show before we exact. Well, he's a terrible person. Let's not talk about him. Allegedly, he hasn't been convicted yet, has he? That was bad. Uh, oh, Greg, now let the shooting start. Let the Bodies Hit the Floor. Hit the 'I' for popular song here in America. Long until they stop looking for him or do they? They're going to go to the last place that they they saw him. And then they're going to patrol a little bit around that. And then once they start doing that last patrol, then the the the meter is going to start. You're going to see the percentage before start giving up. You're telling me he just run right out there and and and kill them all. I was trying to knock one, knock him out. There's a lot of people. There's a lot of dudes out there, Greg. I don't think you can do this. I'm with. I only need. Look, I got three guys there. I only need three bullets. Headshot, headshot, headshot. We all go to Dairy Queen. I love Dairy Queen. Getting shot by a guy",
            "start": 811.8
        },
        {
            "text": "I don't think you can do this. I'm with. I only need. Look, I got three guys there. I only need three bullets. Headshot, headshot, headshot. We all go to Dairy Queen. I love Dairy Queen. Getting shot by a guy. Figure out the wall this. Remember the verticality, Greg. Yeah, but I thought I was in a secure room. You're not. The room is made of like literally potato sacks. How's that? Do get that guy right there. Get the guy right there. Yeah, took him down. Great. In your **** throat, mask man. How's that feel, you piece of ****? Going to need some. Got some jerk. I don't know what I'm saying. I don't know how to be an actor here. Take two of these. Call me the morning. So this is, uh, you you because of the difficulty, I can gauge. I'm guessing this is clearly the last level of the game, right? That you you've, uh, you've brought us to. No, it's actually like in the first quarter of the of the game. Are we playing on Die Hard? Is is like the hardest mode possible? Cause what you talking about? I'm doing way better than you. You're doing",
            "start": 861.92
        },
        {
            "text": "to no, it's actually like in the first quarter of the of the game. Are we playing on Die Hard? Is is like the hardest mode possible? Cause what you talking about? I'm doing way better than you. You're doing something all right. Hey, Patrick, you know what? I get nothing but **** from these guys all day long. Oh, look at him. He using, he's using Titan Shield. There you go. You rocked it. You killed it. He's doing really quite good right in the. Oh, you got those Robo balls. No wonder. Nick, more. Oh my God, you're fierce, man. When they talk to you, they'll talk you the guy that goes to the nuts and gut. You can actually go in the quick inventory as well and get some health. So you hold, uh, L3 or R3. R. Yeah, there you go. And then that's the augmentation. If you press R1 or or yeah, then that's the inv. And then, uh, oh, you don't have any. So you see the things on the the bio cells is going to reach in your energy. And then the hypo about to run out ammo though. So I should switch guns. Oh, doctor, is that the shotty Bugatti? What",
            "start": 909.36
        },
        {
            "text": "have any. So you see the things on the the bio cells is going to reach in your energy. And then the hypo about to run out ammo though. So I should switch guns. Oh, doctor, is that the shotty Bugatti? What is that? Yeah, that's a shotgun. Much better with. See, now they've lost him. So you see below the radar, it says threat lost, right? So they don't know exactly where he is. Cause now they know. Now the jig's up. And you know, just said they lost you. But I, yeah, they lost me. Sure. Do they understand? They don't. Oh, see there. I don't know where you need that jaw. Did you? No. Open casket for you. Your mom's going to be so sad when you can't see your face last night. Do much too much. Yeah. All right. It's fine. So you can also loot all those, uh, all those bodies that you took down as well. So they might have some, uh, some more ammunition and then some credits or energy or, uh, bio cells and things like that. So somebody's shooting at me right there. Yeah, that guy's got, he's got a beat on you. So what I recommend doing is run",
            "start": 959.6
        },
        {
            "text": "ammunition and then some credits or energy or, uh, bio cells and things like that. So somebody's shooting at me right there. Yeah, that guy's got, he's got a beat on you. So what I recommend doing is run out my strategy, Greg. Run out to the open and let them see where you're at. And then wait for all them. Bad strategy. Wait for all of them to come and then shoot one of those propane tanks. Yeah, you have those propane. And you can throw those as well. You know, oh, I dare you to throw a propane tank. You got it. It, Greg, if you're really cool, you throw it up in the air and shoot it as it's up in the air and causes. There is an augmentation that, uh, kind of slows down time a little bit. Oh my God, that's good. So you could, you could use it for that. You could actually use it to. Well, sorry, aim too high on that one. It was, it was the outcome we were looking for. Uh, it just wasn't the means. But it's fine. Is that a gas canister? Let's try it again. We're going to, we're going to move back. I'm I'm just looking for am. Oh,",
            "start": 1014.72
        },
        {
            "text": "was it was the outcome we were looking for. Uh, it just wasn't the means. But it's fine. Is that a gas canister? Let's try it again. We're going to, we're going to move back. I'm I'm just looking for am. Oh, machine pistol. Yeah. Okay. Might that. Oh, yeah. So you just tap it if you want to pick it up. If you hold it, then you bring up the the weapons management. My apologies. And then how did I? That was on me. That was on me, everybody. Sorry. How do I switch weapons? Um, you can do it through the, uh, the quick inventory you had before. Or there is a shortcut for it as well. And, uh, it's it's with the, uh, the reload button and the the shooting. Kevin, want the silenced one, the silenced. And just back and forth. Now, now, Greg, would you choose to play? Obviously, you're not, you're not trying to play as a Silent Assassin here. Trying to show you how to do this. When I play, I'll be very different and better. What you now. Touche. You can hold X to go around the corner. I'm just trying to figure out where these extra guys were.",
            "start": 1065.84
        },
        {
            "text": "trying to show you how to do this. When I play, I'll be very different and better. What you now. Touche. You can hold X to go around the corner. I'm just trying to figure out where these extra guys were. Remember? Yeah, they're still on the lookout. We're going to get up there, Nick, and kill him. Okay. I'm excited for. Figure out how to get up there. You're clearly showing me how it's done. You can actually, you have all the augmentations right now. So if you hold the L3, um, you're going to see like one of the augmentations is the that Dash on the left hand side there. Yeah, yeah, that one. Yeah. So you can assign that wherever you want. Okay. Or on the L1 is maybe. Yeah, there you go. All right. And then, uh, you can actually use that if you charge it up while aiming at that, uh, platform. Yeah, it just hold, hold the the D-pad. Yeah. And then there you go. And then, Nick, we are so killing these guys. Oh, that's awesome. That was awesome. So you can use that throughout the, uh, right in the face. Sniper rifle. What's up, dog? It's a.",
            "start": 1107.88
        },
        {
            "text": "D yeah and then there you go and then Nick we are so killing these guys oh that's awesome that was awesome so you can use that throughout the uh right in the face sniper rifle what's up dog it's a right in the back of the the mafiosos used to do it very nice some Uncle used to kill people it's a 45 whatever it doesn't matter it's the same thing 45 same same strength double the size great what's happening oh look at I'm coming in they didn't realize that I'm a Predator you're a bad **** and not like a child predator like the Predator from Predator like Predator from Predator not like now these were a lot of warning shots cuz I really didn't want to kill him you're doing great Greg I have a good feeling about this slow down time no have no hyp get that freaking shotty out tell what's up what am I shooting him with why am I shooting marshmallow you're shooting you're shooting EMP ammo it's probably the only ammo you have left on your in your shot why don't you uh yeah let's go",
            "start": 1165.4
        },
        {
            "text": "up what am I shooting him with why am I shooting marshmallow you're shooting you're shooting EMP ammo it's probably the only ammo you have left on your in your shot why don't you uh yeah let's go with a pistol gun I have four machine you might have to loot a little bit take that boy oh look at that beautiful pretty good yeah you're going have to go back you can actually like just aim at the bodies as well and see what they have on them okay I feel like the battle rifle I think you missed one there's a once you get that other person's too what this guy the one you killed over right there oh God there's another person Greg in oh again right in the ass Moriarty why do I keep saying Moriarty it's cuz we hate Moriarty we do hate him yeah so now you have some more ammo and you have his gun as well if and obviously you have a inventory system where you can't carry that many guns right yeah exactly yeah so you have to make sure you level that's actually one of the augmentations as well if you want",
            "start": 1210.88
        },
        {
            "text": "and obviously you have a inventory system where you can't carry that many guns right yeah exactly yeah so you have to make sure you level that's actually one of the augmentations as well if you want to increase your inventory so there was that that management as well that'll get him guys I think I saw him over there is he a giant backpack that would work you know if they didn't actually know that you were there if you haven't killed all of their friends there's one guy that would no matter what even if it kills him he wants revenge for the death of all those compatriots we going to use a stun gun oh no wait there go what are those bombs use a grenade for Christ's sake okay Stun gun does not operate the way I expected it to it's got a very short what are those grenades the grenades will not save me right now use a Grenade on yourself take them out with you all right now that isn't the worst plan ever but here yeah the B yeah this is your boy also maybe make a harder Target why don't you",
            "start": 1257.6
        },
        {
            "text": "save me right now use a Grenade on yourself take them out with you all right now that isn't the worst plan ever but here yeah the B yeah this is your boy also maybe make a harder Target why don't you take cover or something like that you know what I mean instead of just being uh Crouch out it's called a game of cat and mouse very nice get get hand to hand combat Greg nice oh you got him nice nice nice Well you certainly showed me done it professional hey I think we'll all admit it went pretty well from up until that point I mean it went better than me I'll be honest with you I I'll relent that at least you did better than I did oh a credit ship yeah the best part about um Deus Ex is that you get to rob people after you've killed them it really is the best like it's fun like you don't need that credit because I shot you 400 times up the ass sorry Patrick what yeah and there are stores actually in the in g c and then in the rest of the as well so you can you can find weapons you",
            "start": 1297.28
        },
        {
            "text": "that credit because I shot you 400 times up the ass sorry Patrick what yeah and there are stores actually in the in g c and then in the rest of the as well so you can you can find weapons you can find ammo and things like that but you can buy it as well and you can buy upgrades for your weapons as well Greg were you just shooting the water bottles thinking they were propane tanks I was hoping they were yeah I mean like like you can make fun of me but how that would have been dope shoot the Sparkletts water and hopefully maybe she'll trip over it fall down hit her head have to go to the ER get maybe she just remember she's thirsty that's to stop and they a drink hey everyone stop shooting for a second I need some Sparkletts damn there's a lot of people here yeah that guy's got funny robot legs so so what can you like infer from the augment so that person has legs can they jump are they are we expecting those enemies to jump higher or some people moving faster they can jump so that",
            "start": 1342.68
        },
        {
            "text": "robot legs so so what can you like infer from the augment so that person has legs can they jump are they are we expecting those enemies to jump higher or some people moving faster they can jump so that he can get up here now they can reach you and so so you're never really safe even if you're on the highest position cuz some people can probably reach you no matter what if you scope them out then you might actually be able to identify like which ones have it and not them we've already we've already established that I won't be doing any of that I like to go in just like my friend Jack Bauer from 24 and just no plan kill everyone very very very useful for that that was cool Greg yeah thank you you can use it on on lasers as well you can use it on use it on that laser you got lasers right there yeah use it on that thing right yeah right at oh turn it off you don't even need to well there you go that was an easy hack and the hacking's back in this right hacking it's like some more hazards as",
            "start": 1384.56
        },
        {
            "text": "yeah use it on that thing right yeah right at oh turn it off you don't even need to well there you go that was an easy hack and the hacking's back in this right hacking it's like some more hazards as well it's got some more soft some new software as well I will say that was probably the most nerve-wracking part of Human Revolution yeah it's been fine-tuned our designer working on it is like very very very perfectionist and sweat through my couch trying to get those things and we're playing through it and I'm getting a lot of like 0.5 seconds 0.3 seconds I thought I was in the clear but I'm not I'm not sure but I think that indicator means someone was it were they shooting no a guy a guy knew he got coming okay you start some stuff nice God this game looks beautiful a great job silencer right now is is very useful for for sound obviously but like if you if you hold the the square button then you can you can manage that on the fly so if you want to if you want to get rid of the cuz it does less",
            "start": 1424.36
        },
        {
            "text": "is very useful for for sound obviously but like if you if you hold the the square button then you can you can manage that on the fly so if you want to if you want to get rid of the cuz it does less damage as so if you have the more action oriented uh approach then that'll be beneficial my fault's on it Greg loud is better go loud my gut tells me take him down like a shotgun hey how you doing did you need the back of your spine cuz it's gone now that was your third vertebrae I apologize it's gone I take that and then the thing you can modify as well is like the ammo type as well so like uh EMP ammo sure when I was doing that when I was screwing that up before yeah and then you could use that on cameras or things like that or or you have some mechanical enemies in the game as well and then all of these things there are shortcuts for it uh on the on the game pad as well to just do it on the fly so if you do like square and and shooting you're you're going to flip back to your last uh gun",
            "start": 1476.0
        },
        {
            "text": "of these things there are shortcuts for it uh on the on the game pad as well to just do it on the fly so if you do like square and and shooting you're you're going to flip back to your last uh gun if you do square and grenade you're going to flip back to your last grenade if you do um square and the L1 then you're going to uh switch ammo types uh right on the Fly uh with your weapon right in the head oh didn't do it Greg he's got an augmented head turns out Larry had a plate installed in his skull nobody knew just sneak back with that no that didn't do it I was trying to scare him right there the fire fire extinguisher shoot that fire extinguisher he's gone now no point that's actually working out I think it's it's creating a a visual Hazard for them so they they didn't see you very nice right there oh my god look D this **** over another fun part of Deus Ex the sex positions what oh this was the one with the robot legs too are there multiple people there what's happening there that's",
            "start": 1520.24
        },
        {
            "text": "there oh my god look D this **** over another fun part of Deus Ex the sex positions what oh this was the one with the robot legs too are there multiple people there what's happening there that's one thought I'm sorry I thought she landed on on someone else I apologize for the sexual reference there's nothing that in this game it is just I mean it kind of looks sexual to me well but I'm just a I'm a messed up guy everybody knows that so am I I'm broken I got broken a long time ago by my Italian mother sexual just in the Catholic guilt kind of way I'm going to stop talking now everyone Greg how how you feeling so far about this I'm feeling great how am I looking you look great you made it 99% farther than I did so far in this let's play which is great nothing they say is a better use for a sniper rifle Than Close Range shots oh my oh good I got no oh what is that I I know how to fix it the whole yeah there you go nope there you go you're good they're playing music you don't need to",
            "start": 1574.0
        },
        {
            "text": "a sniper rifle Than Close Range shots oh my oh good I got no oh what is that I I know how to fix it the whole yeah there you go nope there you go you're good they're playing music you don't need to have your own music it's in the game oh oh oh God come for me hold on oh no they're all dead get their dog tags tell their friends you just stand there you want to get ready with another augmentation for cuz there's a lot of people surrounding can hold the L3 again and you might want to try the Typhoon in the upper right there yeah okay so once you know or you can even just uh run in there right in the middle it do it Greg do it I'm trying it's all I'm stuck I'm sticky there you go damn damn what's up now person has no eyes that was the non-lethal version it neutralized them all yeah see got die the temptation to just run in there and kill people is too strong well it's not my game you know what I mean when it's mine and I'm trying to be all stealthy and stuff it be a different story not enough",
            "start": 1627.28
        },
        {
            "text": "temptation to just run in there and kill people is too strong well it's not my game you know what I mean when it's mine and I'm trying to be all stealthy and stuff it be a different story not enough energy augmented arms no get cover get cover target next to this search there we go there's some energy right there now do you have to take that yeah you can you can Greg go take it okay uh going to kill me L yeah there you go you just got taken down for a ride my friend you got Jensen now how what's it like working with Elias Toufexis is he fun yeah he's a lot of fun he works more with uh the narrative team and the audio team they're like this guy's terrifying he's just crouching and shooting everyone why can't we kill him now he's great and that's the freaky thing when you meet him right he sounds exactly like oh I know it's crazy we had uh I think I forget I think we were at PSX and we hung out with him and had dinner with him it was weird you feel like you're in the game like I just",
            "start": 1695.0
        },
        {
            "text": "he sounds exactly like oh I know it's crazy we had uh I think I forget I think we were at PSX and we hung out with him and had dinner with him it was weird you feel like you're in the game like I just closed my eyes I was like saying some more stuff pleas record it you can make your own Deus Ex game I do in my mind yeah what's the plot Greg in my brain yeah pitch me your Deus Ex okay it's it's not the far future cuz that's too much for me to imagine it's like two weeks from now okay okay augmentation is not a thing but you can buy sex toys on Ad.com go watch love and sex stuff what that's don't give them an ad on the show they didn't even sponsor 9:00 a.m. Adam and Eve no what is it Adam and Eve Adam and Eve love and sex stuff 50% off use the code kind of stop stop doing this stop putting an ad in this let's play that way didn't pay well we we did consider things like that there's a red light district in Prague and uh there's one of the places there that you can explore and you can you",
            "start": 1749.52
        },
        {
            "text": "ad in this let's play that way didn't pay well we we did consider things like that there's a red light district in Prague and uh there's one of the places there that you can explore and you can you know you can realize that augmentations don't necessarily mean arms and the that's fantastic there's hope for us yet Kevin Kevin you need an augmentation on your parts the little Chihuahua is going to grow into a pimple Jesus all right all right I'll off that that might be a good place to end it I've killed a lot of people and Nick's offended even more so there you go Patrick thank you so much for bringing we can't wait for it wait it out uh August 23rd all right ladies and gentlemen that's Deus Ex what do you think of it let us know in the comments and of course keep coming back here like subscribe share to everything KindaFunny.com",
            "start": 1794.68
        }
    ]
}