{
    "id": 1886,
    "video_id": "6i_l96H_bbU",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Zelda and What Wasn't at E3 - Kinda Funny Gamescast Ep. 74",
    "description": "Thanks to Blue Apron for sponsoring this episode!\nGet your first 3 meals free with free shipping at\nwww.BlueApron.com/funny\n\n\nColin reviews Mighty No. 9, our reaction to Zelda, the biggest games, not at E3, and what we think is in store for the future of Marvel games? (Released to Patreon Supporters 06.24.16)\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1467378000,
    "duration": 4699,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to the first ever episode 74 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Lola's over here too, lolling around as she does. Lola around, L-gaging, L-gagging, L-gagging. Gotcha. Sounds sexy. It does sound, yeah, it does. It, yeah, yeah, I'm, I'm with that. Anyways, this is the Kinda Funny Gamescast. Each and every week we get together to talk about video games and all things we love. You can find it over on youtube.com/KindaFunnyGames, where every Monday through Thursday a topic's broken out. And thanks to you, we're now over 100,000 subscribers. Yay! Thank you, you, thank you very much. Yeah, E3 was awesome. Got a lot of growth there. Put out a lot of videos, 65 videos. Oh, doctor. They all performed really well, you guys. They surprised you. They, it was surprising how well they performed. Um, that was awesome. I hope you guys enjoyed that. If you did, please give us feedback. Let us know what you want more",
            "start": 0.34
        },
        {
            "text": "Well, you guys, they surprised you. They, it was surprising how well they performed. Um, that was awesome. I hope you guys enjoyed that. If you did, please give us feedback. Let us know what you want more of or less of next year at E3. And for just conventions going forward like this, there's not too many things like E3, but there's Paris Games Week, Gamescom. I think I'd like to do talking over the press conference bits. Oh, nice. Like that. They like that. And um, you know, if something crazy happens like Crash Bandicoot, you know, get that remaster being announced, then you get me freaking the **** out. It was a really fun E3. It was really good. It was, oh my God, it was an excellent E3. I came, I was thinking about it last night. I couldn't sleep. I was just like, man, last week E3 happened. It happened. It happened. And it was amazing. When we driving out to the airport, we drove past the convention center and I just had that deep sigh like, it's over. It happened so fast and it all went smoothly for the most part. It",
            "start": 54.68
        },
        {
            "text": "It was amazing. When we driving out to the airport, we drove past the convention center and I just had that deep sigh like, it's over. It happened so fast and it all went smoothly for the most part. It was, yeah, no, it was great. I mean, I, I can't believe all the announcements, all the trailers, all the everything. I thought it was just like a, it revitalized E3 for me. I mean, I'm always in love with E3, but this year I was just like, yeah, this **** going nowhere. This **** is here to stop. I got to say with the talking over, the talking over the press conference thing was thing I didn't like doing because I felt like I was being watched, watching something else. Like I was, if I was in a focus group, I didn't like it because like I like to like take my notes. People, I look at like, I have the same when I'm watching something or listening or paying attention to something, I have the same static look on my face and not sad or happy. I'm just, I'm indifferent. I'm listening and everyone's like, look at how sad",
            "start": 94.88
        },
        {
            "text": "Something or listening or paying attention to something. I have the same static look on my face and not sad or happy. I'm just, I'm indifferent. I'm listening and everyone's like, look at how sad or disappointing. I'm just trying to listen to what they're saying to me. So you cracked a smile when I freaked out? No, no. I like Greg who just sat there stoic and then talked **** great immediately. Crash Bandicoot, man. Yeah, we can't wait for more. We can't wait to play those three games very well. The camera some more. Not, I, I, I do, I am interested just as a tangential kind of thing with the Crash remasters. They said from the ground up. I don't believe for a second that those games are being remade. I think a lot of people think that like they're like they're going to be giving the Ratchet & Clank treatment. No, it's not. It's not. There's been, there's been a lot of rumblings, a lot of interviews going off here and there, like random little sources. He said from the ground up. That's a direct quote. But it's",
            "start": 130.36
        },
        {
            "text": "No, it's not. It's not. There's been, there's been a lot of rumblings, a lot of interviews going off here and there, like random little sources. He said from the ground up. That's a direct quote. But it's not. What they're doing is it? They're going in like they did with the Uncharted section where it is being remade from the ground up, like game wise, but it's not Ratchet & Clank. It is just an up-res. We'll probably get the widescreen. I'm hoping for an orchestrated soundtrack. Like, how are they going to do? I wonder how they even going to do widescreen. This is what I'm interested to, like, how they can't, I don't know, they're going to be able to do it. You know, it'll be interesting to see. No reason to. All you do is run straight at the camera the whole goddamn game. That's not right. Sometimes the camera's behind you. You run down a very small corridor. You jump left to right. You guys, you know, you've made me, you've convinced me that these aren't good games, but I'm like, no, **** you guys are wrong. You guys are",
            "start": 166.0
        },
        {
            "text": "You, you run down a very small corridor. You jump left to right. You guys, you know, you've made me, you've convinced me that these aren't good games, but I'm like, no, **** you guys are wrong. You guys are straight up wrong about this. I've been like, the internet is ablaze with excitement for these games. And when they come, they play for the, the internet's very easy to please. No, it's not very easy to please with these big announcement in so many ways. Sure. And and when they come out and they play them again, then you see the other side. No, these are fine. If all the the classic platformers of the the Super Nintendo Genesis era can stand up, like the the Disney games and all the other floating games that are **** awesome, this **** stands up too. Like, are they, is it Mario? No, it's not Mario. Of course it's not Mario. Yeah, but **** awesome. We have to be careful with the like what you asked for with these games too, with like, um, I was not always, but when Mega Man 9 was released, I, I, I thought to",
            "start": 200.56
        },
        {
            "text": "It's not Mario. Yeah, but **** awesome. We have to be careful with the like what you asked for with these games too, with like, um, I was not always, but when Mega Man 9 was released, I, I, I thought to myself like, why isn't this in widescreen? Then of course it changes the whole balance of the gameplay. Like the bullet stand the screen longer and so you can't fire quicker and stuff like that. So there's got to be reason like, and the game's rendered in a specific way. I don't know that they're going to be able to get those games in a widescreen unless they zoom in or something. Um, which they're not going to be able to do either. So I think, I think what you're going to get part comes in. I think you're going to get, I think you're going to get, but they're made within the frame of the, I don't know. I, I'm this ex, the excitement about Crash Bandicoot. I never, I never understood Crash Bandicoot, so I'm not going to pretend like people declare he had in 1998, 1999, he had a higher Q-score than Mario. Um, which was a significant",
            "start": 243.68
        },
        {
            "text": "Excitement about Crash Bandicoot. I never, I never understood Crash Bandicoot, so I'm not going to pretend like people declare he had in 1998, 1999, he had a higher Q-score than Mario. Um, which was a significant thing back in the day. It still is significant, but way more significant back then. He, he had a, everyone knew who Crash Bandicoot was. So I was definitely the minority on that. Those games sold huge. But I, I just feel like to the point about new Crash Bandicoots, which you're never going to get unless this sells very well. So people should go support this ****. This is exactly what I wanted. I've spoken about this many times now, but like, I didn't, I don't want a Crash 4 yet. I want these to come out. I want the remastered, the three good games. You want them revitalized. You want them have people understand what makes Crash special and then go forward and give us a new one then because or else we're just going to get a new Crash and it's going to suck. We all know that that would just suck. Yeah, so",
            "start": 271.88
        },
        {
            "text": "Makes Crash special and then go forward and give us a new one then because or else we're just going to get a new Crash and it's going to suck. We all know that that would just suck. Yeah, so there was a great like documentary video essay that just came out. Look it up on YouTube. It, Crash Bandicoot: Decline of an Icon, I think it's called. It came out in the last week. And uh, surprised you even watched it. Forgot his name. What do you mean? What? You're such, you just keep drinking the Crash Kool-Aid. Surprised you even watched this goddamn Crash Kool-Aid. It's awesome. It's like a 15-minute thing that kind of dissects what happened to Crash and why it went from good games to horrible games. And like, really, really fascinating stuff. And I didn't realize how well the original Crash game sold. All three, all three games, top 10 best selling PlayStation One games. All three of them sold more than Final Fantasy VII. Mhm. Bam. Was deal. 10 million copies sold. I, the, the, yeah, Crash Bandicoot was huge. They turn those games",
            "start": 313.48
        },
        {
            "text": "Games, top 10 best selling PlayStation One games. All three of them sold more than Final Fantasy VII. Mhm. Bam. Was deal. 10 million copies sold. I, the, the, yeah, Crash Bandicoot was huge. They turn those games around really quickly too. And the other thing too, they did back, the other thing that this video reminded me, and as I played a little bit this weekend, I was, I had to, there was jittery about the whole thing. Everyone's like, oh, Crash is this '90s relic and stuff. The like marketing was a '90s relic. Crash himself is like a Looney Tunes thing. He's like Goofy and and stuff. He's not like, I'm **** rad and cool. Like, yeah, he like idle pose. He does the DX DX thing. But besides that, he's more just kind of like not knowing what's going on and like weird and kooky and wacky and like animated with all of his stuff. It's, it's not like he's like this **** too cool for school. That was Sonic in the Adventure days. Yeah, Adventure days for sure, for sure. Just reiterate that. Um, anyway, anyways, moving on to other great",
            "start": 351.96
        },
        {
            "text": "It's, it's not like he's like this **** too cool for school. That was Sonic in the Adventure days. Yeah, Adventure days for sure, for sure. Just reiterate that. Um, anyway, anyways, moving on to other great, you know, successors to games we all loved, Mega Man, right? Let's talk about Mighty No. 9. Colin, what do you think about it? Um, I think that it's not good. And I think that, um, I think that was, I think it was pretty obvious it wasn't going to be good for a while actually. I think we just kind of avoided the reality of the game for a while. Um, I think that the first time I played it, which was years ago now, I knew that it wasn't going to be like this fantastic game. Uh, but I remember the first time you played it, you came back and you said, it doesn't, it isn't Mega Man. It's different. It's more action based. Yeah, it's not Mega Man. And and that's and that I think is a disappointing kind of thing. Um, you know, a friend of ours from Deep Silver, who's, you know, they obviously published the game,",
            "start": 395.2
        },
        {
            "text": "More action based. Yeah, it's not Mega Man. And and that's and that I think is a disappointing kind of thing. Um, you know, a friend of ours from Deep Silver, who's, you know, they obviously published the game, tweeted out today that he was disappointed with some people's reviews, which I understand. I mean, but saying that like people are expecting, are docking the game for not being Mega Man or whatever. And I'm like, well, no offense, but the game was marketed and funded as a successor to Mega Man. So we do expect a Mega Man game. I mean, I, I don't, I don't know like how else to put that. And there's some, there's some features of the game that are Mega Man-esque, such as the nonlinearity and and you get the boss's weapons and stuff like that. But um, the game is just a soulless husk. It doesn't feel like anything. It doesn't look like anything. It just, it looks cheap. It looks amateurish. It had voice acting is **** awful. The the um, storytelling is silly. They they had a chance to rectify what the technical",
            "start": 439.08
        },
        {
            "text": "It doesn't look like anything. It just, it looks cheap. It looks amateurish. It had voice acting is **** awful. The the um, storytelling is silly. They they had a chance to rectify what the technical limitations of the NES Mega Man games wouldn't allow them to do, which is to tell a cool story and have cool bosses. And which were, and and and it's so weird that like these 8-bit Mega Man games is **** on this game. There's **** on it. And from a graphical aesthetic, like Mega Man games have an identity, especially with like two and three and moving on from those games. Like they look like Mega Man games. They have a feel. They have uh, enemy diversity. They have geographic diversity. It's this 2.5D graphics garbage that makes that that really hurts Mighty No. 9, I think. And also, I think that it's just, it's easy. Uh, for the most part, there is one part of the game that we can talk about that's ridiculous. But it's easy. It, it, it's, it's score based. It's all these kinds of things. So I just, I don't, the more",
            "start": 481.88
        },
        {
            "text": "Easy. Uh, for the most part, there is one part of the game that we can talk about that's ridiculous. But it's easy. It, it, it's, it's score based. It's all these kinds of things. So I just, I don't, the more I play it, as I tweeted out yesterday, the more I play it, the more I don't like it. It, I never liked it, uh, beyond the the mere act of playing because I think there's a good gameplay hook there. I just don't understand how this is Mega Man. I don't understand how this is a successor than Mega Man. I don't understand how this this was funded to scratch the Mega Man itch. Doesn't Colin, you just got Tony Hawk's Pro Skater 5'd. Yeah, I didn't think it would happen. Usually it's me that, you know, wants these game, these games that we all know are going to be bad to be good. But this time it's you. How does it feel? I mean, it feels, it feels bad because feels bad, man, because well, that's what I was saying on on Twitter and I, I reflected a few people where I'm like, this is it. Like, I, I, I've kind of come to accept",
            "start": 528.08
        },
        {
            "text": "I mean, it feels, it feels bad because feels bad, man, because well, that's what I was saying on on Twitter and I, I reflected a few people where I'm like, this is it. Like, I, I, I've kind of come to accept this is the game. This is the game that they worked on for years that feel that I feel like could have been made as a **** school project by some programmers and some animators in at, you know, USC. That's the thing, right? We see so many indie games at PS that are doing Mega Man better than this does. They doing this kind of game, even if we don't, if you want to take Mega Man out of the equation, doing this kind of game better. Like, I just, the more I look at it, I just, I don't hate it and I don't think it's bad. I just think it's so mediocre and so unremarkable that it's amazing that it came out of Inti Creates, which is a studio that makes **** fantastic games. And that it came out of Inafune's mind, which is a man that designed, you know, helped design Mega Man, designed all these robots and this",
            "start": 565.32
        },
        {
            "text": "Of Inti Creates, which is a studio that makes **** fantastic games. And that it came out of Inafune's mind, which is a man that designed, you know, helped design Mega Man, designed all these robots and this gameplay. And um, helped produce some of the great Capcom franchises of the more recent years, like Onimusha and Dead Rising. Like, he's no slouch. And I don't understand how this game came out the way it did and the way it and the way it looks. And it makes me scared for these other 2.5D revivals, like like's uh, ritual, uh, uh, Bloodstained: Ritual of the Night. Although I think that that game's going to be way better. And that game was playable and people at E3 and people did like it. I didn't get a chance to play it. Um, so I don't know. I just think that Mighty No. 9 is a, what it is, is it's a **** huge disappointment. And uh, it's just, it's just so, like I said, it's just unremarkable. It's just so bland and boring. I just don't care about it. I don't even care about it now that you've moved to",
            "start": 606.48
        },
        {
            "text": "A **** huge disappointment. And uh, it's just, it's just so, like I said, it's just unremarkable. It's just so bland and boring. I just don't care about it. I don't even care about it now that you've moved to acceptance. What does it mean for Inafune as a creator? What does this mean for ReCore? What does this mean for that other game, the Red Ash or whatever? Is it, oh, Red Ash. Red Ash. Um, so I don't know anything about that like Red Ash or whatever. I saw ReCore at E3 and I think it looks fine. I think it looks again, generic. Yeah, I was going to say, does it look like Mighty No. 9 looked? Yeah, in a way. I mean, it just, I mean, it's different. It's an open. No, no, I don't mean, does it look? I mean, does it actually look? I mean, like, are you getting the same vibes of this is going to be a great game? I mean, they're charging $40 for it, which I am pretty sure was not their intention the entire time. Uh, I think that maybe it was, but I doubt it. Um, ReCore looks fun, but it looks just generic. So you look at like Inafune's",
            "start": 650.32
        },
        {
            "text": "Charging $40 for it, which I am pretty sure was not their intention the entire time. Uh, I think that maybe it was, but I doubt it. Um, ReCore looks fun, but it looks just generic. So you look at like Inafune's other games, like Soul Sacrifice. I think it was fine. It was good. It's just like, where is the magic? That's the kind of the question I have. And and a lot of people are asking, you know, you've asked and it's brought up like, is Inafune, does Inafune suffer for this? Yes. Like, you can't take away what he's done. And and the and he's a great man. Like, I, I, I, I remarked, uh, when I was at E3 that it's so weird. He knows who I am. He comes up to me and shakes my hand and all these kind of things. I love him. Like, like, he's a nice man. And he's like, and he means well. And he's doing his best. But as a creator, like, we expected more from him. And I feel like this game being pitched as a Mega Man successor, being pitched as some sort of Mega Man-esque, some sort of spiritual game like Mega Man, it's just not. It's just not Mega Man.",
            "start": 687.72
        },
        {
            "text": "More from him. And I feel like this game being pitched as a Mega Man successor, being pitched as some sort of Mega Man-esque, some sort of spiritual game like Mega Man, it's just not. It's just not Mega Man. I don't, I don't see what in this other than he pew pew pews out of an arm cannon and uses enemy attacks is Mega Man. You know, like the enemy attacks are **** lame. You know, like the the the the user interface is bad. The, I, I just, I just, I don't know. I, I just don't understand like how any, especially with Inti Creates. I don't understand how Inti Creates made this game. Inti Creates made Mega Man 9 and Mega Man 10. Those are **** awesome. And they're indistinguishable from the old Mega Man games. Like that's how good they are. Like you would not be able, as I said before, I think on PS I Love You, if you mix those games up with the exception of the first one, which definitely looks like the first one. But if you mixed up 3, 4, 5, 6, 9, and 10 and said to a person who just knows games but doesn't know Mega",
            "start": 728.4
        },
        {
            "text": "Those games up with the exception of the first one, which definitely looks like the first one. But if you mixed up 3, 4, 5, 6, 9, and 10 and said to a person who just knows games but doesn't know Mega Man, just doesn't know anything about games, find the two that were made in the 21st century. They wouldn't be able to do it. You know, like that's how, that's how awesome those games are. And uh, they make, they make Gunvolt, which is a great new franchise. And they make Gal*Gun. And they and and then they and they're working on Bloodstained: Ritual of the Night and all these games. And then they make this turd. So the only thing you can point to being the problem is Inafune, you think? I feel like I, I mean, when you look at it, I mean, I don't know. It's just like when you look at it with Comcept, which Inafune's company, Comcept, like Inti Creates has a great track record. Comcept doesn't. So like at some point you have to kind of call it out is is what it is. I don't think Deep Silver did the game any any any favor obviously with",
            "start": 771.4
        },
        {
            "text": "Like Inti Creates has a great track record. Comcept doesn't. So like at some point you have to kind of call it out is is what it is. I don't think Deep Silver did the game any any any favor obviously with its **** awful trailer. Um, and its lack of messaging about what was going on with the game during its delays. I think they totally dropped the ball there too. And I think that's obvious to everyone. But um, the game is the game is the game is the game. And it's going to sell or not based on the merits of the game. And it's and it's word of mouth. And it has bad word word of mouth. And and it earned it. It's not bad. Like I said, the gameplay hook there is cool. The idea of shooting enemies and then quick dashing through them to gain multipliers or whatever and killing them or whatever. It's cool. It's, it's a nice idea. Um, I just don't get it. I just don't get it. Like there's like, I feel like there's like 10 different enemies in the game. I feel like there's like no enemy diversity. I feel like that every",
            "start": 806.16
        },
        {
            "text": "A nice idea. Um, I just don't get it. I just don't get it. Like there's like, I feel like there's like 10 different enemies in the game. I feel like there's like no enemy diversity. I feel like that every everywhere looks the same. It looks empty and static. These 3D gra, these 2.5D graphics suck. You know, like, and there are games that look beautiful in that aesthetic. I know that that aesthetic is cheaper to make and that's why they do it. That's why they don't do 2D flat 2D with sprites and handdrawn things. Like, I, I understand all that. But the game suffers as a result. And I know the game didn't raise enough money to to be able to do that art. I know Inafune said the same thing. And they raised way more money for for Bloodstained: Ritual of the Night. So I don't know. I'll be interested to see like what, like it's only now getting into people's hands as we record this. And I'm interested to see like what if people disagree with the critics because the critical reception of the game is bad. And um, even Sonic's",
            "start": 843.88
        },
        {
            "text": "Only now getting into people's hands as we record this. And I'm interested to see like what if people disagree with the critics because the critical reception of the game is bad. And um, even Sonic's talking ****. Yeah, even Sonic's talking ****, which I thought was, I thought Sonic the Hedgehog tweet was both funny and in super bad taste. Yeah, especially because Sonic the Hedgehog categorically sucks. So like, I don't know. Yeah, but that's what his social account is. Follow him. He has embraced that like so. But I, I, I mean, it's just like, I know that, but at the same time, it's like, I don't know, it just seems a little tasteless to make for a developer or studio to sanction making fun of anyone else. Um, especially when you're Sonic. But that's, but that's, but that's my, that's my, especially when you're Sega and you're falling off a **** cliff. So and it was and it wasn't for Atlus, Sega has been falling off a cliff for so long that that's just their modus operandi at this point.",
            "start": 881.4
        },
        {
            "text": "My, especially when you're Sega and you're falling off a **** cliff. So and it was and it wasn't for Atlus, Sega has been falling off a cliff for so long that that's just their modus operandi at this point. That's all they know. That's their world. So I don't know. So to me it's, it's um, it's disappointing. And and I'm sad for me, but I'm also really sad for people that were looking forward to this. There were a lot of people there, millions of people really that seem to be looking forward to this game. And when that Kickstarter went off, everyone, he was in that, was that, I mean, people, I don't know if your memories span that long, but like that was like the first real video game Kickstarter that came around where everyone was like, this could be the future. If a creator you want breaks away, they could go do this. Obviously Double Fine found their success. But I'm talking about somebody coming out and being like, **** it, I'm going to make a game. I'm going to make the game I'm known for. And I'm going to do it",
            "start": 920.4
        },
        {
            "text": "Obviously Double Fine found their success. But I'm talking about somebody coming out and being like, **** it, I'm going to make a game. I'm going to make the game I'm known for. And I'm going to do it without anybody in my way. And everybody's like, yes, amazing. Here you go. I was there in the room when he announced it at the at PAX during the panel. And I remember everybody lost their ****. And again, granted, when you're in the PAX panel, people get excited about stuff. But even the the people with at IGN, like that was one of those things like, we need to do a conversation right now. Get this up. This is news. And then I remember that video did like, it was the highest performing video of the entire show. Yeah, which just shows the power of that that type of announcement being the first among Kickstarters, where now you can't get anyone to cover your Kickstarter with a 10 foot pole. Exactly. Uh, so if you could take a step back, if you weren't a Mega Man fan, do you think that this game holds up at all? No.",
            "start": 955.52
        },
        {
            "text": "where now you can't get anyone to cover your Kickstarter with a 10 foot pole exactly uh so if you could take a step back if you weren't a Mega Man fan do you think that this game holds up at all no because I I think I just think it's again it's unremarkable like why would you play it in other words if it has no if you have no if you have no connection to Mega Man or Inafune or Capcom games of which were some of the best games ever made at the time then why would you play this at all because it doesn't it's just it's just not fun it's like not the idea is that the game is fun enough and fluid enough to play but I asked the question why like I'm even asking my question like why like these characters suck, Beck sucks, you know, like Call sucks, the doctor suck like like like there's there's just there's just no heart and soul the game doesn't have a heart and soul so as fun as it is to play it's like playing like I love Civilization because it's fun to play and there's like these",
            "start": 991.08
        },
        {
            "text": "just there's just no heart and soul the game doesn't have a heart and soul so as fun as it is to play it's like playing like I love Civilization because it's fun to play and there's like these reasons and I know it's a jump to a PC strategy game but there's like this this this huge reason to play the game to learn it to like understand it because there's like all these different threads that make it worth playing but when you jump into Mighty No. 9 the only reason you would play it is because Inafune made it otherwise I don't feel like and again I don't want to say the game's bad because I think that like bad games speak for themselves and I don't think this game's bad I just think it lacks everything that makes a game good it's just mediocre it just exists it's just there and Inafune can do better and Comcept can definitely do better back to my point that Deep Silver is filling that void that THQ left of like here are all these mid-tier games that you have no real reason to",
            "start": 1037.48
        },
        {
            "text": "can do better and Comcept can definitely do better back to my point that Deep Silver is filling that void that THQ left of like here are all these mid-tier games that you have no real reason to care about but they're there Homefront, Mighty No. 9, yeah like if I had I mean I've only played if I only played Mighty No. 9 a few a couple stages and I thought it was fine or that was fun and I was excited to see the whole game I was excited to get back into these Robot Master type enemies and like to get the lore and really learn about the world and stuff but if I had Deep Silver only got involved with the game late and if I was playing the game and if I had access to the full build I play be like no way in hell we publishing this so like I don't see what what they were seeing or what they thought like this game was going to be maybe there's just a lot of money to be made again the money the game was paid for just the ability to work within a few people are going to buy it",
            "start": 1074.36
        },
        {
            "text": "or what they thought like this game was going to be maybe there's just a lot of money to be made again the money the game was paid for just the ability to work within a few people are going to buy it out of morbid curiosity Mega Man fans like you had already pre-ordered they were in yeah so I I I feel it's hard it's like it's hard because you I want there's no game I wanted to be great more than this and um this tells me that we need to take a step back from our nostalgic points of view about that if we're going to get these new games they need to be done right they need to be done the right way or they're going to ruin how we feel about the games to begin with and I really feel like Comcept in Capcom nailed it with Mega Man 9 and Mega Man 10 of which Inafune produced those games so it the troubling thing to me is like Inafune and I don't presume to know the ins and outs of his situation in Japan and a situation it seems like he burned so many bridges and obliterated so many mores",
            "start": 1112.84
        },
        {
            "text": "the troubling thing to me is like Inafune and I don't presume to know the ins and outs of his situation in Japan and a situation it seems like he burned so many bridges and obliterated so many mores of the Japanese gaming culture and the way Japanese games are made that it's like is he able to now go back to a publisher and like is he would Capcom take him back like could he get his $10 million budget to make a real Mega Man game could like these fences be mended so we can get the Inafune that we know in love and perhaps like that's what he he needs to be under that umbrella or is it like is he like Persona yeah exactly is he like he does he have the scarlet letter now because he did all these things and people wanted to see him fail and I wonder if people in Japan are happy that Mighty No. 9 is not good you know and I don't mean the gamers I mean like the people in the industry maybe some gamers who felt like he scorned them and their way of doing things so there's a lot of like",
            "start": 1154.72
        },
        {
            "text": "nine is not good you know and I don't mean the gamers I mean like the people in the industry maybe some gamers who felt like he scorned them and their way of doing things so there's a lot of like deeper questions than just the game I think with Mighty No. 9 about like where does Comcept go from here? Red Ash was a failure in terms of like getting the I think the anime Kickstarter was like all mixed up and **** up like there and and the way they're getting like there just seems to be a lot of confusion about where Inafune and Comcept stand and I think Mighty No. 9 is emblematic of that confusion because Mighty No. 9 isn't of itself a confused game that doesn't know if it wants to be Mega Man or not and it it dips its toe in the water and that's fine but dude you know what we want so just give it to us or don't pretend that you can that's all that's that's that's the long and the short of it and um for for the fun fluid score-based gameplay and all that kind of stuff that's",
            "start": 1197.68
        },
        {
            "text": "so just give it to us or don't pretend that you can that's all that's that's that's the long and the short of it and um for for the fun fluid score-based gameplay and all that kind of stuff that's there there's no reason to play it it's like playing on a gray screen with nothing interesting you know and I do want to say one of the worst design parts of a game I've seen in a long time is in is in Mighty No. 9 late in the game and I I was talking about a little bit on Colin & Greg Live and I just get I just I'll go back to it I'm was like **** this and I just started playing Grand Kingdom instead because it's just it's just a way better game um you get to this point a robot factory like late in the game the game's not some people are complaining that the game's hard I don't think the game's hard at all like by the way I think that like I my one of my complaints about Shovel Knight was that it was too easy this game's even easier than Shovel Knight so I don't know like I think",
            "start": 1233.32
        },
        {
            "text": "the game's hard at all like by the way I think that like I my one of my complaints about Shovel Knight was that it was too easy this game's even easier than Shovel Knight so I don't know like I think people are just losing their chops a little bit but there's one part of the game oh you never had him there's this one part of the game where I was like where the difficulty spikes from nothing to extraordinary and it's obnoxious and so there's a part in a factory where you have to use a dash ability over these like insta-kill spike pink spike things where you drop down then then Zoom right drop down Zoom left drop down Zoom right Zoom right Zoom right and get out of there whatever and I actually did it once and then I beat the boss and I died after that so I had to go do it again but sounds like a terrible checkpoint but there's no checkpoint there like you have to go back like two minutes before that or whatever which is not fine and and which so weird because Mighty No. 9 is like",
            "start": 1273.2
        },
        {
            "text": "like a terrible checkpoint but there's no checkpoint there like you have to go back like two minutes before that or whatever which is not fine and and which so weird because Mighty No. 9 is like super **** generous with checkpoints and lives and powerups and like the E-Tank type things they have in there like it's just like the game like wants you to beat it and um there's so the idea of the game is moving fast gotta gotta move fast fast and the idea is going fast so there's this part of the game like so the Mighty Numbers, the the Mighty Number One through Eight are the enemies that you beat already and they're your friends like you reprogram them and they become your friends and they appear on stages at various times and so there's this conversation where you're jumping up and like three of them are talking to each other and two of them are in the background and they're like chattering or whatever and everything's fine but you're moving fast so by the time you get to the point",
            "start": 1306.92
        },
        {
            "text": "three of them are talking to each other and two of them are in the background and they're like chattering or whatever and everything's fine but you're moving fast so by the time you get to the point where you're supposed to drop there's the A.V. Mighty Number whoever the **** cares is like over over the screen and he's blocking you and since he's talking to you he stays over your character model as he's talking you just want to move and then there's black boxes with text on the bottom and all this kind of stuff and I'm like so am I supposed to just sit here for 10 seconds on a speedrun waiting for this to pass or am I supposed to be able to see through the **** character and then through the the the boxes of text so that I can do this part which I'm going to die because you're distracting the **** out of me I was like who designed this this is awful like I was like this is just stupid like why is this happening on screen at this **** pivotal moment in time when I'm trying to",
            "start": 1345.64
        },
        {
            "text": "the **** out of me I was like who designed this this is awful like I was like this is just stupid like why is this happening on screen at this **** pivotal moment in time when I'm trying to beat the game quickly and you're challenging me with a a huge ramp up and difficulty I was like this is super symbolic of this of what the **** is going on in this game who designed this dumb question you can't turn it off is it one of those things for speedruns you can go into menus I and I don't I have no idea it doesn't matter to me like the point is that I'm playing the game normal game my normal first play through trying to just beat it over over again you get really good at that part before that before that cuz you're doing it 10 **** times trying to get through that part and these characters are on the screen bombarding you with **** sensory over Mega Man, Mega Man yeah and it's like I'm like who designed this got you know yeah maybe if you play EX Mode or something like that they",
            "start": 1378.96
        },
        {
            "text": "are on the screen bombarding you with **** sensory over Mega Man, Mega Man yeah and it's like I'm like who designed this got you know yeah maybe if you play EX Mode or something like that they remove all that stuff the point is that like no one's going to play that their first time through and you're going to find and you're going to encounter this thing and you're just going to be standing there waiting for them to you're going to figure out after one or two times that the character is literally hovering over you because he's talking to you like who designed this you know and that was that that to me is that was when I was like **** this I'm putting this down I don't even like and people were telling me like don't even you don't like don't you know you always say don't be up a game's ass you don't have anything to prove and I'm like I just want to I need to beat this game you know like to just see it through but the fact that they have ambitions for a sequel stuff like that yeah",
            "start": 1413.36
        },
        {
            "text": "ass you don't have anything to prove and I'm like I just want to I need to beat this game you know like to just see it through but the fact that they have ambitions for a sequel stuff like that yeah good luck you know like you have you better blow this entire game up and do it all over again if you want to have any chance of having a sequel that anyone cares about because it's wrong on almost every level it's just too bad they can take that gameplay and put it in another game with different and there would be expectations would be different but our expectations are totally set if if we have a problem as the insinuation has been that we are expecting Mega Man then that's your **** problem because you are the one who promised us a Mega Man successor you know and we are not getting it so yeah I'm I'm I'm pretty pissed about Mighty No. 9 but I also am conflicted about it knowing Inafune as a man not that we're friends orever but knowing who he is knowing the car content of who he is",
            "start": 1444.2
        },
        {
            "text": "yeah I'm I'm I'm pretty pissed about Mighty No. 9 but I also am conflicted about it knowing Inafune as a man not that we're friends orever but knowing who he is knowing the car content of who he is and like how funny he is and how kind he is and all those kinds of things it's hard to say like you **** up but I don't know who else who else's problem would be I don't think it's I I don't think Comcept is the problem you know I just don't I don't know about that so we'll find out when Bloodstained comes out and Gal*Gun and all those kind of games and we play them and if they're bad then they're bad and we know Gal*Gun's going to be Gal*Gun yeah but I'm giving this girl an orgasm with a gun that's that's that's the game game of the year so anyway um if it's not expensive so if you have a morbidly curious about it then you know more power to you but that's definitely a game that'll be on a discount sale no time you hold your horses on that one yeah and it's on like every system",
            "start": 1479.28
        },
        {
            "text": "morbidly curious about it then you know more power to you but that's definitely a game that'll be on a discount sale no time you hold your horses on that one yeah and it's on like every system ever too so yeah and they and to their credit they wa for that PlayStation Vita version yeah which we' haven't gotten and to to to their credit they did he is taking a lot of the blame I mean they did what was supposed to be a celebratory kind of stream that seemed he seemed super dejected and sad and was saying like you know BL people blame me you blame me it's my fault and all this kind of stuff basically and I'm and I'm paraphrasing um but Kotaku's got it all broken up you can yeah you guys can go read it there Polygon I mean scoops it's sad it's ultimately it's sad so you know hopefully if they do a Mighty No. 9 2 or whatever they call it um it's way better than this but this game in no way shape or form deserves a sequel not even close next up I want to talk about Zelda we never got a",
            "start": 1514.88
        },
        {
            "text": "do a Mighty No. 9 2 or whatever they call it um it's way better than this but this game in no way shape or form deserves a sequel not even close next up I want to talk about Zelda we never got a chance we never all got to talk about Zelda after we all saw Zelda we talked about it we did it was before I saw it it's before I I played it afterward oh you did too yeah we've all played Zelda tell me what you guys thought I liked it uh I wish the demo was a bit more like all right you're into this section now and here's how it's going to work when you talk to people let's talk to a Goron or whatever and go do something like that and said it was you know the all right you're just in this open area for 15 minutes run around figure out the controls and then start from pretty much the start of the game and play through and so I had to leave a little bit early so I did the first thing where I got the Spire out of the ground and then I had a jet or whatever but enjoyed what I played like I'm",
            "start": 1553.64
        },
        {
            "text": "the game and play through and so I had to leave a little bit early so I did the first thing where I got the Spire out of the ground and then I had a jet or whatever but enjoyed what I played like I'm excited for that game I do want to play Zelda uh it seems like it's interesting I like the idea of how Link just wakes up after being asleep for what is it hundreds of years they say 100 years you wake up there and you're like ready to roll out and go and you got a little tablet and you're putting in everything okay tablets are dumb Wii U GamePad's D but whatever whatever I'm there I'm ready I the thing I like about the tablet is I was worried about that when I first saw there was rumors on the internet over the last like year or whatever since they showed that first image where you saw it yeah and uh it it worried me that I'm like oh great there's definitely going to be GamePad you know it's going to be a huge part of it no I think it's just more of an aesthetic thing when you just a",
            "start": 1593.52
        },
        {
            "text": "yeah and uh it it worried me that I'm like oh great there's definitely going to be GamePad you know it's going to be a huge part of it no I think it's just more of an aesthetic thing when you just a fancy looking map so it's like all right cool doesn't seem like there's going to be more functionality than that so yeah that's exciting no I enjoyed what I saw the fire effects looked cool I like the idea of cooking food and doing all that stuff I like the idea of it being in open world Zelda I mean it won't be obviously I think it was pretty clear it won't be as uh fulfilling or as dense as Witcher or is Skyrim or anything like that but I'm still down okay cool I'm going to climb up there and then I'm going to jump on my shield and ride it down like a surfboard that's awesome yeah I think that's the the most exciting to me is that the all the physics based stuff and I I like that it is just kind of a big sandbox and it's less open world in the traditional sense of like there's a whole",
            "start": 1628.64
        },
        {
            "text": "that's the the most exciting to me is that the all the physics based stuff and I I like that it is just kind of a big sandbox and it's less open world in the traditional sense of like there's a whole bunch of different tasks for you to do and it is more like the original Zelda where it's just go there's a whole bunch of different stuff you kind of figure out what you want to do and uh I like that the you can cut down the trees and they fall in different ways so there's the physics there but then yeah also you can get on the the shield and use it as a snowboard um to go down the the hills and stuff and it's just like it's one of those games that makes you think can I do that let me try oh **** I can yeah and that's cool because it's been a while since I've experienced something like that especially in a Zelda games Zelda games have been so kind of just you know rinse and repeat same thing over and over which is why I'm happy that the demo wasn't what you were talking about like",
            "start": 1663.72
        },
        {
            "text": "that especially in a Zelda games Zelda games have been so kind of just you know rinse and repeat same thing over and over which is why I'm happy that the demo wasn't what you were talking about like you're in a dungeon go do the thing it's it's just that it's left me with this feeling right where I enjoyed the demo but I really haven't thought about it since then I didn't I don't I didn't find the demo remarkable or mind-blowing like it's it's it's fun sure yeah I'm totally in for another Zelda I want to play another Zelda but I haven't been sitting here being like man that was an awesome part and I want to play that but I don't want to go do that man I I got the demo excited me but what got me really going is afterwards like after post E3 being able to look at everyone else's demos and everyone else's gameplay footage that they posted and just reading about it the stuff that I didn't see cuz the Dem is huge is crazy there's so many different weapons you can pick up you can use any",
            "start": 1699.16
        },
        {
            "text": "everyone else's gameplay footage that they posted and just reading about it the stuff that I didn't see cuz the Dem is huge is crazy there's so many different weapons you can pick up you can use any weapon that the enemies drop and stuff in in My Demo I got to use the little magnet thing a little bit what I didn't know is that you can the magnet attaches to anything metal including your weapon so you can throw your sword pull out the magnet thing attach it to the sword and then use your sword as a **** like far away sword oh far away sword yeah better reach on your sword sure **** awesome that's super cool like you can do stuff like that because that seems like the type thing that would be out of limitations you know yeah 100% so that's super exciting and I I like the just kind of the the system where there's the stamina so it's like you can climb anything you can go anywhere you can run whatever you want but or swim whatever but it it's all based on the the time of that and",
            "start": 1732.36
        },
        {
            "text": "the the system where there's the stamina so it's like you can climb anything you can go anywhere you can run whatever you want but or swim whatever but it it's all based on the the time of that and obviously as the game goes on I'm sure get more you like level it up I think that's a really smart way to kind of contain the world and have it be open and very nonlinear and you know you can kind of go wherever you want straight from the start yeah while still limiting you from like going to the I that 100% like I I think it's a really cool idea where it was too where I you know at one point I jumped in and I into the water and I started swimming and he's like I don't know going to make it the guy next to me and then I'm like I'll make it and then I died I like well next time and I couldn't do it then I'm like all right well I'm not supposed to reach that now you know what I mean like it's clearly teaching me I'm not supposed to be doing that right now and that's how you figure it out yeah",
            "start": 1774.52
        },
        {
            "text": "it then I'm like all right well I'm not supposed to reach that now you know what I mean like it's clearly teaching me I'm not supposed to be doing that right now and that's how you figure it out yeah and I also like that it's it's Zelda enough and it's also different enough to keep me interested and be like oh **** like they they they're giving us what we asked for really see I feel like that's what I'm going to get when I sit down and play with it and go through a straight play through but yeah when I for this gameplay demo it felt like okay cool this is what I was looking for and I think it's I think it's pretty I don't think it's like gorgeous I think I think there's not a lot happening in the environments you know people have been arguing about this online if the game's beautiful or not I think the art style is beautiful I like the world of it but it is definitely you know sparse environments in certain sections and D I mean every last gen overall the sparse environment thing",
            "start": 1811.68
        },
        {
            "text": "or not I think the art style is beautiful I like the world of it but it is definitely you know sparse environments in certain sections and D I mean every last gen overall the sparse environment thing I'm not too hung up on because I'm not hung up on any of it none of this is like oh **** this game it's just like oh I I cuz I I would rather not be stuff than just all right here's NPCs that that have nothing really to say but they're there you know I like that it's it is more like the Wilderness there isn't people just everywhere you know I like that it is it it kind of just Everything feels like it doesn't necessarily need to tell you a story but there's a story to be made if you want there to be and I like the little pirate camps or whatever where it's like there's enemies and I there's a hundred shrines to go find and all that stuff and I like that it's like that stuff feels more important when there's not a bunch of random **** going on 100% when you jump on the map and you see",
            "start": 1842.04
        },
        {
            "text": "a hundred shrines to go find and all that stuff and I like that it's like that stuff feels more important when there's not a bunch of random **** going on 100% when you jump on the map and you see how huge the map is but you look at a section you see all the different skulls and treasure chests like oh I can totally see this being a Ubisoft game or a Shadow of Mordor where I set off and I'm going to go one by one to the yeah I'll get to the story or whatever but I'm going to instead go try to clear out all these different things MH I just I like that it's it's a really different approach and the whole the weather system and having to use the different like clothes and different armor and all that stuff giv you a reason to change yeah exactly which is kind of annoying cuz I was always a blue tunic Link of course once I got that water once I that water tunic I was rocking it all the time he looks dope as **** his armor though yeah he does look cool yeah what about you, Co, um I played",
            "start": 1876.88
        },
        {
            "text": "Tunic Link of course once I got that Water Tunic once I that Water Tunic I was rocking it all the time he looks dope as shit his armor though yeah he does look cool yeah what about you Co um I played it for about 15 minutes uh now the the big caveat for me is that the and this is shit tone deaf Nintendo shit is that you can't invert the Y-axis in the in the demo so like I could not play the game effectively like at all um and so I was like really struggling because I play inverted so I was like really struggling and this happens every so often like where a demo is like no you can't invert why I'm like you guys made a huge blunder on that one because we we do exist um we're breeding you out and uh So based on what I so I tried to like just play it uh keeping the camera kind of like level um so that I didn't have to think about it too much and uh what I found was a game that I that intrigued me a great deal um and uh I liked going into the menus and kind of you could tell how much more",
            "start": 1914.4
        },
        {
            "text": "so that I didn't have to think about it too much and uh what I found was a game that I that intrigued me a great deal um and uh I liked going into the menus and kind of you could tell how much more robust the game is not by the world necessarily but by the menus sure um that there's like a deep um deep there's a deep equipment currency in this game in terms of like you have lots of armor there are lots of weapon choices um equipment and gear and like like to me it was like this is a real role-playing game this this almost feels like a Zelda Zelda's actually a real role-playing game I mean we used to refer to Zelda as being a role-playing game or having role-playing game elements but it really doesn't it's really an action adventure game in its own way it's it's a Zelda game is a Zelda game um there's a little bit of nonlinearity you find that like Link to the Past there's a little bit of like obviously you're finding equipment you can buy find things and not find things or heart",
            "start": 1958.6
        },
        {
            "text": "game um there's a little bit of nonlinearity you find that like Link to the Past there's a little bit of like obviously you're finding equipment you can buy find things and not find things or heart pieces so there's a lot of collectibles and and optional thing so the the spirit's always been there but it's never literally been a role-playing game in my mind um and this seems to be with its Skyrim influence where its open world Western role-playing game influence which is obvious um and I'm glad that they finally looked outside and found that other people were doing their games better that they took that in so when I was running around just for that brief time fighting enemies and kind of just exploring this wooded area this sparsely wooded area I found that it was it was a I agree I think the art is really pretty I think the direction is really pretty the game is super dated looking anyone who thinks that that game isn't dated looking I don't know what for looking at different games",
            "start": 1997.96
        },
        {
            "text": "the art is really pretty I think the direction is really pretty the game is super dated looking anyone who thinks that that game isn't dated looking I don't know what for looking at different games but like the game play it looks like a PlayStation 3 game I mean you know like for sure doing that yeah oh yeah people people bristle when you say that of course oh yeah dude um I said that when I I I tweeted out I was like I played Zelda it looks super dated but I think it looks fun I'm I'm excited to play it and I am I'm gonna play it I'm going to play that game um but people got really mad about that I'm like dude I just saw the game with my own shit two eyes like it it looks like it it was made five six years ago like for sure so um but that doesn't matter the content of the game I feel like is going to be there um and it made me intrigued about Zelda I've been really down on Zelda because Skyward Sword just from what I saw I didn't feel it in Twilight Princess is real the real game I",
            "start": 2031.0
        },
        {
            "text": "is going to be there um and it made me intrigued about Zelda I've been really down on Zelda because Skyward Sword just from what I saw I didn't feel it in Twilight Princess is real the real game I really got my real Mainline console game from the series that I really got my my hands on on and was like I just don't like this game and with um even the handheld iterations like I didn't really like Minish Cap it was fine but like Minish Cap was okay the the Spirit Tracks and whatever the shit the other one was with the stylus on I I can't play games like that so I just feel like Zelda wasn't being made for me for a long time and when I played A Link Between Worlds which I enjoyed I was like okay this is great but this is I've been to this world I know this world um there's a nostalgic factor to this but it again where is Zelda like where is the Zelda we need and we want I feel like I feel like maybe this is that game so I'm I'm optimistic about it it brings back a",
            "start": 2068.84
        },
        {
            "text": "a nostalgic factor to this but it again where is Zelda like where is the Zelda we need and we want I feel like I feel like maybe this is that game so I'm I'm optimistic about it it brings back a sense of wonder to Zelda of what is over that hill and you can mark anything and get there so what will I find on that journey to that spot which I think's been missing for a while mhm yeah and I think that I I like I like the idea of them spreading their wings a little bit and making a different kind of Zelda game that I think is certainly going to be outside of their own comfort zone and I think that's why this game has taken so long to make and that's could be why the game's so antiquated not only because it's running on Wii U which is super underpowered but because it's been it was it's just been it's been gestating for so long as well so um you know I'm I'm interested to see like what the final products like I'm interested to see how long it is and robust it is um and uh the one thing",
            "start": 2107.64
        },
        {
            "text": "been it's been gestating for so long as well so um you know I'm I'm interested to see like what the final products like I'm interested to see how long it is and robust it is um and uh the one thing I'll say that I walked away from with this above all is and I don't know I don't know a lot of people out there can relate because I don't know how many people have been in Nintendo at E3 and played games there they need to like not be up your ass when you're playing games at Nintendo like that was actually like my biggest takeaway is the actual experience of playing the game no one did anything wrong the people that I dealt with were very nice people the man that was with me was very nice man that was how but it's like I've been playing games for 30 years almost like I'll figure it out like you're actually like putting a ton of pressure on me by standing over my shoulder and chattering in my ear and telling me what to do like just if you're going to give me all this time just go away like",
            "start": 2141.8
        },
        {
            "text": "actually like putting a ton of pressure on me by standing over my shoulder and chattering in my ear and telling me what to do like just if you're going to give me all this time just go away like I'll figure it out if I have a question I'll ask you you know and I felt I felt like it was a I know this is a weird like Insider gripe but it was just like I just played Horizon the day before and they like I figured it out like it took time but like I figured it out it was complex but and so that was the it made me not want to sit there and like really learn because I'm like this guy's judging me he wants me to see certain things I really just want to learn how to play the game myself what I really learned about this new Zelda game too is that it's super complicated like that that was that was the thing I I and he wasn't really he was trying to help me but I was like I could have just used a button map that would have really been helpful to me and it was there he tell you about the Wolf Link amiibo he",
            "start": 2180.4
        },
        {
            "text": "I I and he wasn't really he was trying to help me but I was like I could have just used a button map that would have really been helpful to me and it was there he tell you about the Wolf Link amiibo he did he put it on the screen but um you know it was just like let me just can I just I I hope Nintendo takes notes about this I'm sure they don't care they don't care about anything but but like you know let me just play and um if I have a question I'll ask you I'm going to play the game my own my own way and learn the mechanics my own way and I just feel like I felt so much pressure where I feel like I would have enjoyed it even more if I didn't feel like I was having this this person or these people around me like watching me everything I did as if I was going to run away with the Wii U console or something like that well someone tried to you see that oh I'm sure I'm sure I'm sure that's not the first time I'm sure was it Logic it was Logic that was probably Logic so that was so I so that's",
            "start": 2215.52
        },
        {
            "text": "or something like that well someone tried to you see that oh I'm sure I'm sure I'm sure that's not the first time I'm sure was it Logic it was Logic that was probably Logic so that was so I so that's just a minor Insider gripe that I thought people would enjoy hearing because I I just I only experienced that at Nintendo see I feel like the only the only the thing was that in that 15 minutes to do whatever you want they were doing that to me too and then when it was like you started the game they backed off I think they wanted you to get the mechanics down to an extent yeah they see mad at me they're like all right we'll go to the the theater first time I don't want to do anything that can we like just go upstairs and just like sit me at a kiosk and I'll play the game like I I'll you know I've played almost every Zelda game I'll figure it out um you missed the cool reveal though cuz then the the screen went away and they pulled up the thing and this door opened up like yeah it's",
            "start": 2251.84
        },
        {
            "text": "I've played almost every Zelda game I'll figure it out um you missed the cool reveal though cuz then the screen went away and they pulled up the thing and this door opened up like yeah it's just like we so we we had scheduled you had scheduled you had kindly scheduled the things on our our last day and that wasn't in the original schedule and I needed the time to do something else so I actually had to go quickly anyway I was only there for 15 or 20 minutes but so that was just my minor gripe but I so my takeaways Zelda is like uh I think it's pretty regardless of the fact that it looks dated I think that uh the open world of it although we've had open world Zelda since the very beginning I think the open world very open world nature I think will provide its own density even though I think the game looks scarce I think there will be its own density there I think that if you looked at Skyrim the same way you'll find that it's just as empty um it's just that there's little points",
            "start": 2281.48
        },
        {
            "text": "I think the game looks scarce I think there will be its own density there I think that if you looked at Skyrim the same way you'll find that it's just as empty um it's just that there's little points of interest I don't think you have to have this flooded shit field of things going on all the time so I agree with you there um and I'm really super intrigued by the complexity of the control scheme and the complexity of what you can do some of it makes sense some of it doesn't mapping sword for instance I think to a face button was weird but having and I'm sure you can remap things and having and having the arrow like you aim and shoot with the same button like there's certain things where I'm like this doesn't make any sense you have triggers you can use you know so like I have to wrap my head around the way that they were doing things and I think I'm right about the sword things I think you draw it and and slice it with the same things I think I kept like thinking I would I was I was",
            "start": 2313.08
        },
        {
            "text": "head around the way that they were doing things and I think I'm right about the sword things I think you draw it and and slice it with the same things I think I kept like thinking I would I was I was I kept pulling shit out of my sack or whatever there were definitely buttons there that were weird that I was trying to do it going to what naturally would be their I totally no problem at all playing I thought it felt great like any Nintendo game does it felt very intuitive to me and stuff also said that uh Pro Controller compatible yeah that's prob I play with because I it didn't feel intuitive to me at all I think it would have if I spent more time with it and it was getting I was getting better at it I was also just kept worrying about the shit Y-axis over and over again so um so yeah pretty game I think it's open for a good reason there's a lot of mechanics there and a lot of equipment and RPG elements that I think Zelda much much need I think this is a revitalization that Zelda",
            "start": 2349.16
        },
        {
            "text": "pretty game I think it's open for a good reason there's a lot of mechanics there and a lot of equipment and RPG elements that I think Zelda much much need I think this is a revitalization that Zelda needs I don't know that anyone's going to play it um because it's going to be stranded on Wii U and we do not know the nature of NX and if anyone's going to be interested in buying it yet I think that there might be I think there might not be interest so um that'll be interest so well we'll see we'll find out um remember that Skyward Sword is the last console Zelda and it didn't sell well so um and it was on its console with 100 million units so um they have much to prove here I think a marketing blitz will be smart I think that like letting people go hands-on in Nintendo store and other places EBL is losing her mind she's really excited about Zelda so yeah I was happy to play it I was really honored to play it it was cool it was like a nice little reveal for me I didn't expect that I was",
            "start": 2378.68
        },
        {
            "text": "EBL is losing her mind she's really excited about Zelda so yeah I was happy to play it I was really honored to play it it was cool it was like a nice little reveal for me I didn't expect that I was going to have time to do it so thanks for setting that up um but uh yeah also that little Insider thing about you know just like just leave me alone and let me let me do my thing tell me I can put the Wolf Link amiibo on there I don't care no one cares about amiibo and that functionality I'm excited to see what NX changes because I think that it can make a game that I'm already excited about even better I think that just if it gives me 1080 if it gives me 60 cool because this was 720 and I think that that's an obvious thing you know they're showing this game and it is running on Wii U so we're not going to get the the ultimate version of Ultimate Experience of it but I well if you had the NX right now and you had Zelda right now you could take it with you on the plane who knows little controll I",
            "start": 2414.84
        },
        {
            "text": "to get the the ultimate version of Ultimate Experience of it but I well if you had the NX right now and you had Zelda right now you could take it with you on the plane who knows little controll I thought it looked great I'm super excited about it and it again it it looks like a simplified version of a lot of these games that I I don't want to play because it looks like too much of investment but this looks like it has the dumb down systems that I want to get into it where it's like it's not overwhelming in a bad way it's hey here's this what's overwhelming is the the size and scope of it all but it's things that I want to do and it's not stuff that I feel like is chores to to get done yeah it's new for I mean what's cool is that this is new for Zelda you know like this is a I still feel like the most open Zelda we ever had was the original and um when you really think about and get back to get down to brass tacks and you don't think about Zelda in terms of its aesthetic or it's it's um",
            "start": 2451.84
        },
        {
            "text": "the most open Zelda we ever had was the original and um when you really think about and get back to get down to brass tacks and you don't think about Zelda in terms of its aesthetic or it's it's um uh its feel but rather its scope like the original Zelda was really super open and super nonlinear in its own way um and I don't know that we've gotten that we had that a little bit with Zelda but not much and we had that like a little bit with Link to the Past in the dark world and we had that a little bit with Ocarina of Time and a little bit with Majora's Mask but like we never had this like massive like world where it's like we're not going to tell you or gate anything off like you'll figure it out like you could really go to almost any corner of the map in the original Zelda if you wanted to as long as you had bombs and stuff like that so like I feel like this is the game this almost seems to capture the spirit ironically and interestingly of the original Zelda which I think is a super shit",
            "start": 2486.96
        },
        {
            "text": "as you had bombs and stuff like that so like I feel like this is the game this almost seems to capture the spirit ironically and interestingly of the original Zelda which I think is a super shit good game so that was the point yeah Aonuma was talking about how he that that one image the original image from the instruction manual from the first Zelda like that was the total inspiration for this game and you can totally see it visually and just in terms of the the scope and the gameplay elements and all that stuff um and they did an interview recently with Reggie and he was saying that you can beat the game without even having much of the story elements at all and I think that's cool I like that it's just like do whatever the hell you want tell your own story um I also think that they're taking a lot of the classic Zelda elements like bombs and stuff I don't know if you guys got to this a bit but instead of just being the normal bombs that we know there's two different types of bombs",
            "start": 2524.72
        },
        {
            "text": "taking a lot of the classic Zelda elements like bombs and stuff I don't know if you guys got to this a bit but instead of just being the normal bombs that we know there's two different types of bombs one rolls with the whole physics-based stuff and the another one is more of a square block that you just kind of put down like lay is a trap for for the enemies come by and stuff and it's just like little tiny tweaks like that I think really kind of flesh out the world and explain to you the type of direction that they want you to go but then let you go whatever direction you want I think that's the most important thing um I like being able to push the rocks and have it roll down the hill and might crush people and they teach you how to do that so that later on I'm sure in the game there'll be much more advanced things where you get to play with the physics and all that stuff um and in the same way that old Zelda's taught you if there's a crack in a wall bomb it there's a secret in there",
            "start": 2561.84
        },
        {
            "text": "much more advanced things where you get to play with the physics and all that stuff um and in the same way that old Zelda's taught you if there's a crack in a wall bomb it there's a secret in there anytime there's water and stuff when you have the magnet like already I know search the water there's probably some metal thing in there that I can pick up to complete a bridge that I can walk across to get a treasure chest and all that stuff and I'm very very very very excited about this game I gave it my one of my three game of the show free three and I definitely think it would be my top one overall of those three so stay tuned Zelda going to give it to you next up let's talk about the games that weren't at E3 where the shit was Hot Shots Golf PS4 why you hiding it Sony I want it so bad but no I knew it wouldn't be there but there were a lot of games missing for me there was a lot of games I got a list I got a list for you guys well first off hardware wise NX we knew it wasn't going",
            "start": 2597.24
        },
        {
            "text": "but no I knew it wouldn't be there but there were a lot of games missing for me there was a lot of games I got a list I got a list for you guys well first off hardware wise NX we knew it wasn't going to be there but it wasn't and PS Neo which we thought would be there up until the last until they until they officially announced it and then said it wasn't going to be there so that stuff's kind of underwhelming No Man's Sky we expected that we expected it because we heard enough of No Man's Sky delayed till August 9th what's interesting did you guys hear about the the story of the that they almost had to change the name mhm oh right because the legal battle yeah yeah yeah that illegal battle with a a British telecommunications broadcast company Sky who also fucked with Microsoft in 2014 and SkyDrive had to be renamed OneDrive it's like damn Microsoft lost but Sony won so cool No Man's Sky, we won yeah we won great The Gamers won we won uh yeah I guess we expected not to see that because",
            "start": 2640.32
        },
        {
            "text": "it's soon enough and like beating that drum over we've heard it enough here it's just starting to look like a failure if you keep talking about it every three Last Guardian I still think that game's way further out than people think but I hope I'm I hope I'm wrong uh but I don't I still think that game's not this year we get something we get another touch at PSX that'd be nice yeah I think that TGS probably oh TGS yeah so that's thing when we go through this let's think about when we think we're going to see it next and when do we think it's actually going to come out the thing about TGS though it did so much better in America so when you want to hold it you think for PSX with that audience that's rabid about it yeah maybe it did do much better in America but I also think yeah",
            "start": 2681.32
        },
        {
            "text": "TGS though it did so much better in America so when you want to hold it you think for PSX with that audience that's rabid about it yeah maybe it did do much better in America but I also think yeah uh the game was like almost like not even relevant at all in Japan interesting is that just relative to the other franchises over there or it was racism they didn't like Drippy no I just think it didn't sell very well so they released it on PS3 and it it sold okay and they released like a dumb down version on DS that or 3DS no it was DS that that didn't sell well and then so they released it here I think with no expectations but I think we just took to it in a different way yeah mhm Drawn to Death not a huge surprise I think they have to they have to handle the sort of games better uh the me they're showing these games way too much I I really do believe that the constant streaming beta always in beta early access like let's not stop talking about this game everything is a huge shit mistake",
            "start": 2723.12
        },
        {
            "text": "they're showing these games way too much I I really do believe that the constant streaming beta always in beta early access like let's not stop talking about this game everything is a huge shit mistake and I think that hopefully they're realizing that at this point that the stuff coming out of Sony San Diego is cool but like they're not managing it properly you can't get them you can't have the people playing it for two years and then expect them to give a shit when it comes out to get super excited about it like I just don't understand like how that's lost on people like yeah play it play it endlessly an endless betas and then it's out aren't you excited it's like no no one cares we played it like 7,000 it was it wasn't hard to get into it isn't hard to get to you can go to the DrawnToDeath.com get your code get in and start playing but you're not getting trophies I don't think that's the other thing I don't know what's happening really they need to do better with these games",
            "start": 2758.72
        },
        {
            "text": "to Death.com get your code get in and start playing but you're not getting trophies I don't think that's the other thing I don't know what's happening really they need to do better with these games like we were talking about it on Colin & Greg Live with Guns Up! which was which came out and some people knew but like I don't know how the shit we missed that we missed that completely like oh Guns Up!'s out I guess I felt like Guns Up! never came out or was always out one of those two things that was the thing is I felt like it was always out and that's the exact same problem so like when they started talking about it at PSX and announced that it's coming out we we totally glazed over cuz I've heard about Guns Up! if I wanted to play Guns Up! I'd go play Guns Up! right now but I don't want to play Guns Up! so I don't care about Guns Up! you know what I mean there's no newsworthy thing in there there's nothing interesting about it uh and that's the thing yeah I'm again not surprising I don't",
            "start": 2795.2
        },
        {
            "text": "to play Guns Up so I don't care about Guns Up, you know what I mean? There's no newsworthy thing in there. There's nothing interesting about it. Uh, and that's the thing. Yeah, I'm again, not surprising. I don't think that Drawn to Death wasn't there because it's one of those games that that I think you're seeing, you saw with this E3, how Sony wants to handle it, where there is the mainstream big budget, here's our E3 lineup, and then there's the, hey, here's our PSX thing for everybody who cares about V. If you're if you're a hardcore enough PlayStation fan to fly around the world and come to San Francisco for PSX or go to Vegas for PSX, you're going to care about these games. You're going to care that David Jaffe has a new game. And I'm not saying that no one will ever care about Drawn to Death or whatever, but it's just this weird messaging, right? I hope people do because I think it looks cool. All I'm saying is that like, you know, they're releasing Kill Strain for instance, in mid-July, um, and I'm like",
            "start": 2824.88
        },
        {
            "text": "but it's just this weird messaging, right? I hope people do because I think it looks cool. All I'm saying is that like, you know, they're releasing Kill Strain for instance, in mid-July, um, and I'm like, hasn't everyone played Kill Strain? Like I I like I it's a cool game, but like they're just not you have to go away and finish the game and not I understand they want feedback from the audience, but you are sacrificing the pop of releasing your game. I feel like Kill Strain had a better has a better shot than it. Guns Up, I felt like was Beat to Death over our head all the time. And then with Drawn to Death, you have Jaffe who's outspoken personality people follow talking about it all the time because it's his game. I feel like Kill Strain's in that thing where yeah, if I if I really care about Kill Strain, yeah, I've seen the streams they do every week or whatever, but as somebody who doesn't really care about Kill Strain, I haven't seen it since we went down there and did that let's or stream with them. What",
            "start": 2860.48
        },
        {
            "text": "I've seen the streams they do every week or whatever, but as somebody who doesn't really care about Kill Strain, I haven't seen it since we went down there and did that let's or stream with them. What about Paragon? What's the story there? I it was announced at PSX. I you know my game, so I totally stay out of it. Was it released this week? Yeah, but it's it's out in Early Access. It's the beta. What I'm saying, give me the disc, Kevin, hand me the disc over there. We have a disc for it or I don't even know if it might just it might just be an empty box, but the box will explain what we have. Thank you. Oh man, there is a disc in there. It's described as Paragon Essentials Edition. All right, includes a lot of stuff. This is Paragon. Paragon is a MOBA that puts you in fight of content includes Paragon Coins, instant beta access, five Hero Master Challenges, five rep. So it's in beta still. They're releasing a game on there's no disc in here. Yeah, there is. It sounds like it. We got to figure out they're releasing a game",
            "start": 2895.48
        },
        {
            "text": "access, five Hero Master Challenges, five rep. So it's in beta still. They're releasing a game on there's no disc in here. Yeah, there is. It sounds like it. We got to figure out they're releasing a game in beta on disc. Yeah, there is. I thought it was like a card. That's **** sad. Sorry, gentlemen. Video games 2016. That's sad, sad stuff right there. Okay, cool. But it's over $16 in value. This is exactly what you're talking about where it's just like, all right, things announced and then things are in beta and Alpha and this and that, whatever. Early Access. And then it comes out and no one cares. Yeah, just because they these games are overexposed. It's not that these games are bad. Paragon is probably not a bad game. It's just that like the messaging is bad, especially for console gamers. We're not used to this kind of stuff. You have to you have to do better. Otherwise you're saying these games have to die for I mean, I wonder how it's doing. I wonder if there is a fan base that's like all over. I mean, if 54 out of",
            "start": 2935.48
        },
        {
            "text": "of stuff. You have to you have to do better. Otherwise you're saying these games have to die for I mean, I wonder how it's doing. I wonder if there is a fan base that's like all over. I mean, if 54 out of fan base I saw from the beta that's been going on forever. I when I go online, Andrea Rene is playing it. She's all over it. She loves it. Yeah, but she is literally the only person I know. And I will tell you that probably now that I've seen so much of uh over no Overwatch and Battleborn, but before that, you could put them all into a into a screenshot gallery and I I still don't know what this game **** looks like. I'm looking at the thing right here and it just looks like generic **** Halo guys and whatever action. I don't know what Paragon looks like because they their reveal trailer at PSX, which made me think it was a year out, maybe more, was CG. I don't know what this **** thing looks like, but the MOBA bubbles popped in terms of oh yeah, let's bring it to consoles, make money off MOBAs. That's no",
            "start": 2982.4
        },
        {
            "text": "me think it was a year out, maybe more, was CG. I don't know what this **** thing looks like, but the MOBA bubbles popped in terms of oh yeah, let's bring it to consoles, make money off MOBAs. That's no poor bastards. If you're bringing your MOBA to **** console the next 18 months, don't bother. So Colin, this one's for you. Dragon Quest XI. Yeah, I don't think you're going to see that at either. I mean, that's a that's a Japanese game for a Japanese audience that will get here eventually, um, if we're lucky. Uh, so I I would expect to see more of that at TGS. And Dragon Quest is so huge that it's going to get its own events and stuff too. Mhm. Going along that line of the JRPG stuff, Kingdom Hearts III. We knew we weren't going to get it because we saw the 0.8 trailer and it ended saying more information winner. So we're going to get it once Kingdom Hearts 0.8 comes out. We we'll hear more about Kingdom Hearts III. And also you can assume they want to give Final Fantasy XV some yeah, give Final Fantasy XV some breathing room. Not hearing good",
            "start": 3022.92
        },
        {
            "text": "we're going to get it once Kingdom Hearts 0.8 comes out. We we'll hear more about Kingdom Hearts III. And also you can assume they want to give Final Fantasy XV some yeah, give Final Fantasy XV some breathing room. Not hearing good things about Final Fantasy XV by the way. And uh just the rumors online like persistent rumors from you know what people think are reliable sources, whatever is games. No, is Goofy again? Is Goofy giving us the information? I'll be I'll be I'm super interested to see if any of the **** that you're we're hearing about Final Fantasy XV is true because it's not good. But uh I still believe, but who knows who knows for sure. I'm I'm I hope it's good. Kevin, to uh Kingdom Hearts III always in there because it doesn't exist. Kingdom Hearts III. It definitely seen 0.8. I'm like, all right, there's the engine. They're we almost there. We are. We're at 0.8. Colin, how's that make you feel? 0.8 was awesome by the way. Got to play it. Super stoked about that December for Kingdom Hearts fans. I don't know why we're getting stuff as a non-",
            "start": 3065.6
        },
        {
            "text": "we are. We're at 0.8. Colin, how's that make you feel? 0.8 was awesome by the way. Got to play it. Super stoked about that December for Kingdom Hearts fans. I don't know why we're getting stuff as a non-Kingdom Hearts fan. What is 0.8? Is it what collection of **** is it now? 0.8 is the 3DS game, uh huh, plus a CG movie that tells like the earliest story of the whole thing to prep you for III. Plus it's a new thing that's Birth by Sleep 0.2, which is in the Kingdom Hearts III engine. That's a sequel to the PSP game. Yeah, so yeah, I remember the PSP game. A pro prologue, right? Going into Kingdom Hearts. That's what they had playable at E3. That's awesome. Great. I get to play. It's essentially like Ground Zeroes, sure, to the Phantom Pain. So I'm like, all right, speak my language. Now you're selling me on it. Sold. Totally sold on that **** Final Fantasy VII Remake. I totally thought we were going to see some trailer or something. I understand it's years out, but I still thought I mean, that's just it's such an easy",
            "start": 3107.8
        },
        {
            "text": "sold on that **** Final Fantasy VII Remake. I totally thought we were going to see some trailer or something. I understand it's years out, but I still thought I mean, that's just it's such an easy like cheap pop. Yeah, you know, PSX they had way more than I thought they would show. Totally expected them to just keep throwing a little bit more. But again, Sony's conference was so strong that they didn't need it, right? Save for PSX. Again, here's another 5 seconds from this game that's 5 years out. Yeah, and they they speaking on Final Fantasy VII Remake, they're saying that next time they talk about, they want to have a bit more substantial things to talk about. Sure. As in like, you know, the people that were working on the game know that they're doing it. Hopefully they have that in order this time when they when they talk about the game. That was still the funniest thing I ever **** heard in my life. Loved that. Square's so weird. What a weird company. The Japanese like publisher developer arm is like",
            "start": 3150.96
        },
        {
            "text": "when they talk about the game. That was still the funniest thing I ever **** heard in my life. Loved that. Square's so weird. What a weird company. The Japanese like publisher developer arm is like starting to scare me a little bit, to be honest. Dreams. No, not a huge surprise. Dreams. No one knows what it is. So it's it's I think and I think that Media Molecule and Sony have heard the message loud and clear, um, from us, from a lot of people that no one knows what the hell this game is. And uh you need to go make it now. And they were saying that I mean, and they were saying and they were saying the same thing like that at at GDC that like they were so concentrated on making the tools that they're going to make the game with the tools, but they hadn't even made it as of GDC. So you know, like people are going to get tired of seeing this game if and they what the **** and they have to manage it in such a way that um that that it will get that special pop that it needs. I assume you'll see the E3 next",
            "start": 3192.24
        },
        {
            "text": "to get tired of seeing this game if and they what the **** and they have to manage it in such a way that um that that it will get that special pop that it needs. I assume you'll see the E3 next year. I assume that's a fall 2017. I you think? I guess, but I don't know if you'll see it at E3. I mean, maybe when it's finally ready to go and roll. Sure. But they're going to save face the same problems, right? Alex talked to GDC about them wanting to do a beta this year and or maybe that was at PSX even. But it's going to be the same thing of like Dreams that and every be like, I don't know what the hell I'm doing. Yeah, I mean, I still my take is still like they showed it to us and I appreciate the art artistic nature of the studio and they make good games and they know what they're doing. But but uh I think this is a huge mistake. Like I I think this is going to end up being a big mistake for them. I hope and I hope I'm wrong, but I just don't see how this even fits like in what PlayStation's trying to",
            "start": 3231.28
        },
        {
            "text": "this is a huge mistake. Like I I think this is going to end up being a big mistake for them. I hope and I hope I'm wrong, but I just don't see how this even fits like in what PlayStation's trying to do. Like what is the game? What is why would I want to play it? I understand it more than they showed to me, but it didn't make me want to play it anymore. It's it's old PlayStation. It's PlayStation 3 where PlayStation 4 is if you're going to talk about exclusives and stuff. It's everything you saw E3. We're going to focus on these narrative driven, mostly third person, here is this game you can wrap your head around on what it is. Whereas this is very much still it's PlayStation 3. We're toying around with things. We're doing different ideas. We're making art. Vita. Just Vita in general. Just V. I got a point off that. I knew that was going to be there. First uh first um for at the Sony Booth. First E3 since 2011 that uh so that e uh that Vita was not at Sony's booth at all. Again, save her PSX. That's where that",
            "start": 3269.12
        },
        {
            "text": "off that. I knew that was going to be there. First uh first um for at the Sony Booth. First E3 since 2011 that uh so that e uh that Vita was not at Sony's booth at all. Again, save her PSX. That's where that audience is. Why waste the time now? Why waste the short floor space now? Just have people come by and go, oh, little Vita games. I don't care about these. Yeah, Deep Down. I don't think Deep Down exists anymore. I played Deep Down um in this is the Capcom one, right? Yeah, in 2014, 2013 is when it was first shown. Yeah, I think I played in 2014 um with a a Japanese woman who at the at TGS uh standing next to me that had no idea what I was saying or doing, which is not a huge surprise because she didn't speak English. Um I I feel like that game just doesn't is never going to come out and doesn't really exist. Like I I I I don't know. I could be wrong. I haven't read anything about it recently, but I just don't know. It wasn't even that interesting when I played it at all. So I don't know. We'll see. But I feel like I",
            "start": 3309.0
        },
        {
            "text": "I I I I don't know. I could be wrong. I haven't read anything about it recently, but I just don't know. It wasn't even that interesting when I played it at all. So I don't know. We'll see. But I feel like I wouldn't be surprised if you never saw that game. Dead Island 2. No, that that just changed hands, exploded on the hot plate and now they're trying to put it back together with a new or you know, a new team is coming at it. So yeah, no. Beyond Good & Evil 2 wasn't at E3, but right after the Ubisoft press conference, our boy Yves Guillemot, Yves Guillemot confirmed that it is happening. Yeah, still alive. And that the original creator, Michel Ancel is working on it. I mean, the Ubisoft show was such a a tight two hours that you just could have fit another announcement. I don't think you could have fit the thing that people cared about in there at all. So there's an awesome story. I think Jason Schreier wrote on Kotaku about all the times that they promised that Beyond Good & Evil 2 is happening going back to like 2009 or",
            "start": 3358.48
        },
        {
            "text": "cared about in there at all. So there's an awesome story. I think Jason Schreier wrote on Kotaku about all the times that they promised that Beyond Good & Evil 2 is happening going back to like 2009 or something like that game. Who who first of all, who who wants this game? Like I I like Beyond Good & Evil is fine. I had it on Xbox, the original Xbox and it was fine. Like do we really need another Beyond Good & Evil? And then so this Michel Ancel guy uh is not working at Ubisoft, but is working at Ubisoft. He's working on that game Wild. Oh yeah, Wild's the other game. So like I'm like, I don't know that you're getting any literally any of these games. But but uh yeah, I don't I don't know what's going. There's something weird going on with that guy and Ubisoft because he did the Rayman games, like the Revival Rayman games that were really good. I think I think he was the director on those games. Um and they were great. But I I think that um something's amiss with Beyond Good & Evil 2 and he's not even at Ubisoft in",
            "start": 3404.88
        },
        {
            "text": "that were really good. I think I think he was the director on those games. Um and they were great. But I I think that um something's amiss with Beyond Good & Evil 2 and he's not even at Ubisoft in a full-time capacity. I don't think because he's doing that game Wild, which is not a Ubisoft game. So and people were asking about that like where's Wild? And I'm like, I don't don't hold your breath. Don't hold your breath for that one either. Just like you shouldn't held your breath for what was that other game that was canceled from um Tequila Works' Rime. So although they're apparently took it back and they're going to make it. So I don't know who cares. But when Sony walked in and took their development kids. So like, all right, you're done. So yeah, I don't know. Beyond Good & Evil 2. Like I'll that's a game that is a game that I'll believe it when I see it. Like when it's out, I'll believe it. We'll see. Beyond Good & Evil. I feel like it's right up your alley though. It's good. It's good. I agree that it's like",
            "start": 3448.4
        },
        {
            "text": "that is a game that I'll believe it when I see it. Like when it's out, I'll believe it. We'll see. Beyond Good & Evil. I feel like it's right up your alley though. It's good. It's good. I agree that it's like it's it's one of those weird games where it seems like people wanted a lot more than I think the number of people actually do. Like Mirror's Edge 2. How bad? Very vocal group wants it and it comes on. Crackdown 3 was surprising. That was really surprising. I'm ready for Crackdown. I'm excited for Crackdown. And yeah, you'd think it would be there, but shows how far out that game is. I assume delayed to 2017. Rumored to be at Gamescom. Yeah, I'm sure it'll be. I was going to say like they have to manage the Gamescom kind of **** too. Exactly. A lot more shows to show stuff at. And CD Projekt Red said Cyberpunk 2077 wouldn't be there. Yeah, but that's they made so much money that I don't know that they're not going to disappear for a little while. Bro was there. Looks pretty Cool's coming out party. Um",
            "start": 3488.2
        },
        {
            "text": "Cyberpunk 2077 wouldn't be there. Yeah, but that's they made so much money that I don't know that they're not going to disappear for a little while. Bro was there. Looks pretty Cool's coming out party. Um but uh shout out to everybody who says they ripped off my face for that one character. Yeah, Cyberpunk. Cyberpunk will come out when it's ready. And I think that they've earned the right to do that. Um and uh have certainly made the money to be able to afford to do that. That's years though away. Everybody needs to get realistic expectations right quick on that **** game. Red Dead Redemption 2. No, I don't know why anyone thought this game was going to be. I have there a ton of rumors, man. I mean, we all know the Rockstar E3 thing, but like there was a lot going into it where people really thought this **** was going to be there. Yeah, I just don't I just never believed it. I just was like, why would why would Rockstar ever do that? That that like that made no sense to me. Like they announced it themselves when",
            "start": 3529.56
        },
        {
            "text": "going to be there. Yeah, I just don't I just never believed it. I just was like, why would why would Rockstar ever do that? That that like that made no sense to me. Like they announced it themselves when do you think that'll happen? I still feel like that game's coming out this fall. I I yeah, that's the thing. I could easily see the announcement within the next month and a half, two months for this fall. Yeah, God, that'd be **** cool. I still feel like they'll announce it like they could announce it in August and released in November, something like that. Even ear maybe August and released in October, something like that. I think before this year's I don't know. I'm not so bully on them actually getting it out to shelves in the fall. But I think before this year's over, you're definitely going to hear the announcement and it's going to be spring of next year. Last one here, Telltale's Marvel game. We heard about it a bazillion years ago and then we heard nothing about it. It's like I get that they're",
            "start": 3569.48
        },
        {
            "text": "the announcement and it's going to be spring of next year. Last one here, Telltale's Marvel game. We heard about it a bazillion years ago and then we heard nothing about it. It's like I get that they're focusing The Walking Dead, Batman, but Telltale's always been that type of thing where it's like it doesn't matter if they're doing a whole bunch at once. I wouldn't be surprised though if it is something to do with just maybe a deal somewhere with the DC/Marvel thing about how they promote when they just like, all right, Batman's this standalone thing and it's going or whatever the Marvel Universe though and the digital part of them thing too. They've talked about wanting to work in tandem with the movies better, right? I we know now. I shouldn't say because I had to argue this point that there's no way that Spider-Man game was going to be tied in the Spider-Man movie. They've confirmed that now. But I don't I think Telltale is actually somewhere where it could fit of like, let's work it in. So you have",
            "start": 3602.04
        },
        {
            "text": "that Spider-Man game was going to be tied in the Spider-Man movie. They've confirmed that now. But I don't I think Telltale is actually somewhere where it could fit of like, let's work it in. So you have to look down the line of what what movie would that work with? Is it the next Avengers? Do we put it out? I mean, I don't have the slate in front of me and you know, I'm not I'm not as up on it. It's not going to be Doctor Strange. You would have already announced it. Yeah, uh when's Guardians 2? Is is it going to be is it going to be a Guardians thing one day? Like there's a million ways it could slice up and go. But if and then of course, maybe it's none of that. Maybe it's a Venom game that's just a thing that they're doing that you know what I mean? There there's the thing about it is there's just so much to do with that Marvel Brand that it could go anywhere. But I could see them being one of the developers to jump in and actually make a movie tying game that doesn't suck, right? Let's fill in the gap",
            "start": 3643.0
        },
        {
            "text": "to do with that Marvel Brand that it could go anywhere. But I could see them being one of the developers to jump in and actually make a movie tying game that doesn't suck, right? Let's fill in the gap of something somewhere. But again, it could easily be we're doing our own. Here's a Fantastic Four thing. Yeah, oh man, I hope not. I know. But I'm I'm just saying like that's the thing. I it doesn't surprise me. Telltale is this brand that's everything. But at E3, they need to focus on the next thing, which is Batman. That's the summer. Absolutely. So speaking of focusing, Greg, want focus on cooking because you can now thanks to Blue Apron. Blue Apron, they make home cooking accessible. They deliver you all these recipes. You can make all this different stuff. Your first three free if you use the promo code I'm about to tell you later. We're talking variety here. New recipes are created each week by Blue Apron's culinary team and are not repeated within a year. We're talking flexibility, Greg. Customize your",
            "start": 3675.32
        },
        {
            "text": "I'm about to tell you later. We're talking variety here. New recipes are created each week by Blue Apron's culinary team and are not repeated within a year. We're talking flexibility, Greg. Customize your recipes each week based on your preferences. Choose delivery options to fit your needs. There's no weekly commitment, so you only get deliveries when you want them. So if you're Kevin, it's all the time. He's a he gets a delivery all the time. It's easy, you fat little man. Each meal comes with a step by step, easy to follow recipe card and pre-portioned ingredients and can be prepared in 40 minutes or less. So you're asking me, Greg, what are the meals available in June? I can tell you right now. Creamy Shrimp Fettuccine with Sauteed Green Beans and Spinach. I'm all over that. That's a good one. Sweet Chili Chicken with Tinkerbell Peppers. Oh, okay. Green beans and Jasmine rice. You're giving me Jasmine and Tinkerbell in one thing. Sign me up, Blue Apron. Sign me up. Spiced Steak and Tomato Avocado Salad with Creamy",
            "start": 3716.44
        },
        {
            "text": "with Tinkerbell Peppers. Oh, okay. Green beans and Jasmine rice. You're giving me Jasmine and Tinkerbell in one thing. Sign me up, Blue Apron. Sign me up. Spiced Steak and Tomato Avocado Salad with Creamy Corn Cabbage and Red Onion Slaw. That's a lot of words, but I'm in. Yeah, cool. For less than $10 per meal, Blue Apron delivers seasonal recipes along with pre-portioned ingredients to make delicious homecooked meals. They know that when you cook with incredible ingredients, you make incredible meals. So they set the highest quality standards for their community of suppliers. Family run farms. There's a lot of words here that I I'm not even going to try to read. Fisheries and ranchers. Withers Japanese ramen noodles, wild caught Alaskan salmon, heirloom tomatoes. Blue Apron's bringing you the best of those heirloom tomatoes. Great heirloom heirloom tomato. See, I'm trying. I'm trying. We happy to see you try. We're happy to see you. All right, here's the deal. You check out this week's menu and get your first",
            "start": 3757.96
        },
        {
            "text": "heirloom tomatoes. Great heirloom heirloom tomato. See, I'm trying. I'm trying. We happy to see you try. We're happy to see you. All right, here's the deal. You check out this week's menu and get your first three meals free with free shipping by going to blueapron.com/funny. All right, yeah, just funny. Cool. Then you'll love how good it feels and taste to create incredible homecooked meals with Blue Apron. So don't wait. That's blueapron.com/funny. Blue Apron, a better way to cook. Build it beautiful. Build it beautiful. Real talk, Blue Apron's awesome. I used it for a long time. Yeah, say I was going to say like I I've heard good things about Blue Apron for sure. Kevin, try me with something. I really think it would be funny to do an unboxing where he has to cook at do thing. God, it's easy. I know, but he's real bad at cooking. I don't think he just know that. No, I do. You've never seen me cook. I bet he's known you your entire life. Seen me cook. Yeah, and he's never seen me cook. I don't cook. I mean, he considers like making",
            "start": 3800.24
        },
        {
            "text": "I don't think he just know that no I do you've never seen me cook I bet he's known you your entire life seen me cook yeah and he's never seen me cook I don't cook I mean he considers like making cereal cooking I'm damn good at that **** he's very good at it how hard is it you pour the cereal into a cup you eat the cup you eat the cup all right ladies and gentlemen as always this final topic brought to you by Patreon so shout out to you Steven Inler you're the Patreon producer of this month and pretty much every month forever he continues to sit there he's awesome and I love you and support you as I look into Greg's eyes cause I love look look into my eyes but feel Colin and smell Kevin no I don't want to smell Kevin think about Nick please not I'm thinking about Nick I smell that it's debatable no it's not it's which part of you it's not debatable oh I found out yesterday his balls are really hot you got them balls yeah I came in I came the thing in he of course shoves everything as",
            "start": 3847.76
        },
        {
            "text": "no it's not it's which part of you it's not debatable oh I found out yesterday his balls are really hot you got them balls yeah I came in I came the thing in he of course shoves everything as close as he came to the door so then I was like I'll give him this is what he wants clearly so I sat on him and then I rub my butt around on him and I was like oh man your balls are hot damn that's **** erotic we at Starbucks today and he got one of those chizo sandwiches which are good but I can't stand them and I realized today why is because the smell the smell smells like Kevin and I don't like it smells like chizo and then he's no the the Starbucks chizo I don't know that it's real love not going to smell Kevin it's good but smelled my armpit he's like oh it smells like sweat and I'm like oh Kevin smells like sweat I don't that's a lie I get it he smell there's a difference it's not the like this you smell it and you're like damn you smell good I think let's play maybe don't believe it all",
            "start": 3889.44
        },
        {
            "text": "smells like sweat I don't that's a lie I get it he smell there's a difference it's not the like this you smell it and you're like damn you smell good I think let's play maybe don't believe it all right this topic all right of course brought to you by Patreon all the Q&A all that stuff this one's brought to you by Prometheus and Bob over the Kinda Funny Forums if you have a topic for us go to kindafunny.com/gamestopic leave your questions just like my boy Prometheus and Bob did it's a long one but a good one wait hold on Kevin's like frantically pointing around and grabbing his phone or frustrated oh and the Patreon people thank you very much didn't know we were doing that today but cool you're you're awesome you make things happen you get Kevin eating them chizo sandwiches that I love smelling so much since we're putting a bunch of screen we're doing a bunch of stuff right here the front Kevin put a frog face on me for the next five seconds feel like I'm in a bad dream all",
            "start": 3927.72
        },
        {
            "text": "I love smelling so much since we're putting a bunch of screen we're doing a bunch of stuff right here the front Kevin put a frog face on me for the next five seconds feel like I'm in a bad dream all right Prometheus and Bob asked is Marvel about to take over the gaming World last week Polygon spoke to Marvel Games vice president Jay Ong and asked him if Marvel vs. Capcom fans would finally get some relief from his team either in the form of a new game or a balance patch his response was vague but optimistic there's nothing we can say at this time let's just say that we hear that a lot we love our fans and we certainly want to please them beyond that we can't say anything at this time but who knows what the future holds Marvel Games has a lot of things in the works quite a few in the console space that are unannounced what has been announced is a game to the Marvel Universe from Telltale Games and a new Spider-Man from Insomniac Games for PlayStation 4 what do you guys think the answer is",
            "start": 3972.92
        },
        {
            "text": "space that are unannounced what has been announced is a game to the Marvel Universe from Telltale Games and a new Spider-Man from Insomniac Games for PlayStation 4 what do you guys think the answer is yes this goes back to I've said it a lot this past week but bring you all up to speed this goes back to you and I going to see Age of Ultron of that screening and Bill Rosemann coming out and being like what's up I'm in charge of Marvel Games here's the two other guys who are doing this we are out to make awesome games we have not done that in a long time we are aware of our shortcoming and I'm paraphrasing obviously we are out to fix this and make Marvel a force to be reckoned with in the video game industry the way it is right now in movies as it is on Netflix as it is on TV and the first that was when they announced The Telltale Game where I was like oh my God that's awesome and now they're announcing this Insomniac game and I think it's interesting because Insomniac for some reason to me",
            "start": 4017.6
        },
        {
            "text": "was when they announced The Telltale Game where I was like oh my God that's awesome and now they're announcing this Insomniac game and I think it's interesting because Insomniac for some reason to me means more than The Telltale one but they're the exact same level of let's take our properties that we care about and give them to the people that make the best kind of games for those things and this didn't didn't the connection Disney Infinity died and they're like we're getting out of this we're not going to do this anymore then it was like clicked like oh Marvel was just ahead of that in terms of like okay cool we're not going to just go to Activision and say Here's a multi-year deal if you get a game out every nine months all right great cool and then Beenox is making Spider-Man for Spider-Man for Spider-Man start really good and then go to garbage yeah exactly and so yeah I think we're just to the Tipping Point right now where you're about to see all and when I say about to see I mean",
            "start": 4056.6
        },
        {
            "text": "for Spider-Man start really good and then go to garbage yeah exactly and so yeah I think we're just to the Tipping Point right now where you're about to see all and when I say about to see I mean announcements you're about to see of all this to pay off what they so far we know Spider-Man and that's it really right we know that something's happening at Telltale we just talked about last topic no idea what it is but you figure if that's happening what are the be what think about the other best you know developers that are making third person action games first person whatever and what could that apply to a Marvel property where does that go like imagine an Iron Man game that's good yeah there's so much potential there 100% the flight and all that stuff that's awesome yeah I'm excited I'm excited for all this I I do kind of simultaneously worry and I'm super excited for a world where there's a **** ton of Star Wars games and a **** ton of superhero games where all the top developers",
            "start": 4092.4
        },
        {
            "text": "for all this I I do kind of simultaneously worry and I'm super excited for a world where there's a **** ton of Star Wars games and a **** ton of superhero games where all the top developers are just making these games but it's like whatever as long as they're good and that's the thing as long if if they take it to the way Star Wars happens where it's like all right cool we have this property we're going to give it to a bunch of developers we want them to be great like I mean think about like I know it's a long shot and I can't imagine it would have happened but you know like again Rocksteady isn't owned by WB so like what if oh man what if there's a conversation going on over there of them taking on Iron Man or some a Daredevil game whatever that'd be insane and that would be a game immediately that everybody's like yep on board with a thousand per. yeah what I what do you think Colin I don't know I inside other than I think that the proper M the proper management of expectations",
            "start": 4132.48
        },
        {
            "text": "that everybody's like yep on board with a thousand per. yeah what I what do you think Colin I don't know I inside other than I think that the proper M the proper management of expectations and with games with Rocksteady and DC showed and Warner Bros. showed that you can get great games that aren't Tethered to movies specifically and people still care about them I think Marvel runs way more of a risk in the movie in every realm of oversaturating and so um like I think you have to be very careful with the things you choose to do and the developers you choose to do especially because the gestation period of games is way longer than it is with a TV show or with even with a movie so um so you have to just make sure you're setting the seeds properly in a way that makes the most sense but I think that you'll see more from them um in the AAA space from developers that you know and I think that's a smart thing to do I would love to see a games Universe a Marvel Games Universe it's not tied",
            "start": 4172.12
        },
        {
            "text": "that you'll see more from them um in the AAA space from developers that you know and I think that's a smart thing to do I would love to see a games Universe a Marvel Games Universe it's not tied to the movies or the comics or whatever but the Spider-Man game is related to The Telltale Games is related to to whatever else we got out there well see that's what's interesting from the the previous topic we were talking about right and the fact that like we're talking about yeah the gestation period is so long right tell can move quicker does that mean they're working on something different than what uh Insomniac's working on with Spider-Man exciting times go to the best people giving the best stuff Rondine Baron says I had bought Wolfenstein: The New Order at launch and quickly grew B bored of it sorry it's all inversed uh I was very disappointed recently I decided to pick it up again and realized I had just needed to get through the awful beginning to have you ever with boot it off",
            "start": 4209.08
        },
        {
            "text": "B bored of it sorry it's all inversed uh I was very disappointed recently I decided to pick it up again and realized I had just needed to get through the awful beginning to have you ever with boot it off it after back years later years I don't know if it's ever been I I remember the best example and it's not even a great example is I played a whole bunch of Red Dead and then got to Mexico I was like Mexico's **** boring and left and then I remember and the usually when that happens especially nowadays if I leave a game I'm never coming back even if I have the best intentions of coming back and I did come back to Red Dead and I did get through it and then it got awesome again I thought personally Final Fantasy VI took a lot for me yeah I remember I started it and it was you know I played X first and then I went back to VII and then I played VI and for some reason I played first couple hours and I was just like not for me and then like years later went back and now it's one of my",
            "start": 4246.84
        },
        {
            "text": "X first and then I went back to VII and then I played VI and for some reason I played first couple hours and I was just like not for me and then like years later went back and now it's one of my favorites uh Metroid Prime was similar too where I've started that game probably six times before I actually went through and beat it all excellent game yeah I don't know I can't think of anything off the top of my head because I move so quickly that I rarely go back um the last game I I remember trying to go back to his Final Fantasy X and it didn't work out so well so it's not quite the story he's talking about but I told you you just got to get through that intro in Wolfenstein and it's and then you're and then you're golden SSJ Davey says hey Tim and the coolest dudes in video games when PlayStation All-Stars were announced everyone hated on it for being a Smash Bros. clone even though it didn't play like Smash at all my question is simple why don't Sony just rip off Smash property and",
            "start": 4288.08
        },
        {
            "text": "All-Stars were announced everyone hated on it for being a Smash Bros. clone even though it didn't play like Smash at all my question is simple why don't Sony just rip off Smash property and say **** it to the haters Crash Team Racing did it to Mario Kart and dare I say it Crash Team Racing is better so why don't just coach Smash with PlayStation characters and let the great gameplay of Smash mix with PlayStation characters yeah that's what I'm saying it's too late no no no the ship's out of the port now but back in the day I mean then it was earlier in the first to we were talking about Mighty No. 9 is like that's the problem is like it's Smash but it's not Smash I wanted to like PS Battle Royale more than anybody great give me more Smash and then you play it and you're like this isn't it it's not even almost there it's just like pretending to be almost there and I was like damn man and there's no Crash in that come on step your goddamn game up now it would happen in 2016 Crash",
            "start": 4327.92
        },
        {
            "text": "it it's not even almost there it's just like pretending to be almost there and I was like damn man and there's no Crash in that come on step your goddamn game up now it would happen in 2016 Crash would be there you'd be hanging out and everybody be happy about it and you're right Crash Team Racing is better than Mario Kart we **** said it damn it is not Double Dash oh it's better than Double Dash absolutely Chuck says hey guys I'm a big user of my local library it's how I read all The Walking Dead Saga and Invincible while searching for my next read I came across Call of Duty: Black Ops III I put a hold on it and a week or two later it was ready for pickup I have now put Quantum Break on hold as well as someone who creates art I'm a performer at the Second City I know what it's like to not always get paid for what you create I feel a bit conflicted is it a dick move to consume someone's work without paying for it thanks and I appreciate your hard work well he's doing it the right way I",
            "start": 4361.64
        },
        {
            "text": "always get paid for what you create I feel a bit conflicted is it a dick move to consume someone's work without paying for it thanks and I appreciate your hard work well he's doing it the right way I mean it's a library it's not like he's pirating out of the games you figure there's a barrier to entry for that he has to put it on hold he has to wait the library only has one copy of Black Ops or something one copy of Quantum Break there's a difference there in terms of like somebody who goes up and like the whole entitlement well I bought too many games this month I can't afford another one but I can go just download this game illegally and play it forever and be done with it uh I mean I think when he's not in the financial situation he is now you pay it forward and you buy more stuff right that's what we always talk about where it's like yeah 90% of the games we get are free so like when I do see something that I want and we're not getting it early I'll go buy it when I do when I play",
            "start": 4399.24
        },
        {
            "text": "that's what we always talk about where it's like yeah 90% of the games we get are free so like when I do see something that I want and we're not getting it early I'll go buy it when I do when I play a game and I'm not even sure if I'll ever get to what I want in the season pass but I've enjoyed the game like The Witcher I'll buy the season pass out of my own pocket you like it's my way I feel of contributing back to it the system that we're in yeah that's my thing with physical games it's like usually we'll get the code or whatever but I'm like I want to buy this and I want the physical one so I get that I think it's you know it's obviously money is very important but when these people that are making art want you to enjoy the art I think first and foremost at least a lot of them depending on who it is but I mean I think we're a perfect example right like I wouldn't call what we do art but we are creating something and we put everything out for free you know in some way shape or form",
            "start": 4435.2
        },
        {
            "text": "on who it is but I mean I think we're a perfect example right like I wouldn't call what we do art but we are creating something and we put everything out for free you know in some way shape or form eventually and I think it's like if you want to pay pay but otherwise just enjoy and spread the word I think that there definitely is a value in liking something and telling people you like it and going from there you even writing in talking about this is a good way to do that you know kind of spreading your enjoyment the analog to him taking games out of the library is taking books out of the library which has been happening forever where you could go and buy that book and you know great you get it money do this they Bank more books more second edition D I think it's in the same field where if we're if the library is meant to house works of art you know pieces of Pop Culture whatever then this is fine Tom Rosadi says Tom Rosadi hey guys first time posting just want to hear your thoughts",
            "start": 4470.32
        },
        {
            "text": "we're if the library is meant to house works of art you know pieces of Pop Culture whatever then this is fine Tom Rosadi says Tom Rosadi hey guys first time posting just want to hear your thoughts on talks of the Vivendi takeover of Ubisoft do you feel it could hurt Ubisoft or help them as much Flack as Ubisoft gets they make some really great games and allow for their smaller Studios to create games like Valiant Hearts and Grow Home Eont seems to be a very passionate CEO and losing him seems like it would hurt the company as well also that new Ghost Recon looks hella fun yes it does keep on being funny yeah you risk whenever you go public you risk hostile takeovers so that's just inherent it doesn't often happen but it does happen and if they are taken over by another company things are obviously going to change for them um I think you'll just have to pay attention to how things change Gameloft has already been taken over by Vivendi um you also have to remember that Vivendi was",
            "start": 4507.48
        },
        {
            "text": "obviously going to change for them um I think you'll just have to pay attention to how things change Gameloft has already been taken over by Vivendi um you also have to remember that Vivendi was in the space before with the Activision um and Blizzard right and in 2011, 2012 and they didn't didn't seem to pan out too well for them so um I don't know that their Partners at Ubisoft wants clearly they don't want them um but they're going to probably get them so um it's fascinating to watch I do think that it'll change what Ubisoft is because there'll be new people at the helm you know it would be what is the most important thing I don't think the games that are on the Slate now you have to worry about but you do have to worry about leadership change over people leaving being forced out what do you think it means for Beyond Good & Evil I I hope somebody walks in like no nobody wants this final question comes from MC Biscuits MC Biscuits 8675 hey guys what's your opinion on the",
            "start": 4549.56
        },
        {
            "text": "what do you think it means for Beyond Good & Evil I I hope somebody walks in like no nobody wants this final question comes from MC Biscuits MC Biscuits 8675 hey guys what's your opinion on the majority of PlayStation's big exclusives being third person action games the Uncharted series and The Last of Us are amazing and very successful but now most of their IP seems to be very similar Days Gone uh you know Horizon blah blah blah my favorite type of game so I'm all for it yeah it is it is weird but like what else are we going to have like the only the perspective the valid perspective in these shooty shooty boom boom kind of games is shooty shooty Boom Boom games first person shooters and they do those too with Killzone although we haven't gotten one recently I think that that's just the way a lot of games are played these days so they're not all the same like Days Gone and Horizon are open world role playing games uh God of War is a more linear tighter action game um The Last",
            "start": 4585.16
        },
        {
            "text": "the way a lot of games are played these days so they're not all the same like Days Gone and Horizon are open world role playing games uh God of War is a more linear tighter action game um The Last Guardian is not a third you know person become is not going to give you the action experience so I think that like you would just have to kind of get deeper into the genetics of the games as opposed to just looking at them aesthetically yeah they're all third person I mean it doesn't mean anything you're going to see second party Partnerships like everything that happens with Housemarque bring you the arcade titles that are sidescrollers or you know whatever 2.5D, Matterfall yeah yep it'll be there don't worry there you go and Paragon is there right now in beta access no one can tell anything about the game though this has been the first ever episode 74 of the Kinda Funny Gamescast thank you very much for joining us we will see you next week this has been fun like I have never seen any of",
            "start": 4627.08
        },
        {
            "text": "the game though this has been the first ever episode 74 of the Kinda Funny Gamescast thank you very much for joining us we will see you next week this has been fun like I have never seen any of these characters you got Jax over here with his red arms scuba man this just looks like this looks like the Overwatch gorilla but in a red outfit D kind of does look like Winston I'm a nerd now deal with it Greg hit me up on PSN at Tim Gettys",
            "start": 4665.04
        }
    ]
}