{
    "id": 1925,
    "video_id": "D42PJsiBRhE",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Song of the Deep Review - Kinda Funny Gamescast Ep. 77 (Pt. 1)",
    "description": "Greg reviews Song of the Deep.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1468846801,
    "duration": 1263,
    "transcript_chunks": [
        {
            "text": "Kinda Funny is going to San Diego Comic-Con. We're doing a meet and greet at Polite Provisions. I'm hosting panels for Deus Ex, Tomb Raider, Call of Duty, and more. And best of all, Kevin won't be there. Get all the details at KindaFunny.com/SDCC. What's up, guys? Welcome to the first ever episode 77 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi. Portillo's there chilling, chomping on a chomping on some little pig pig cat pink cat. Yeah, every it's one of the Lola toys he just took. Got a that toy actually Lola got that toy from someone in a hotel lobby, huh? So that toy has been making the rounds to is ****. Damn, son. Toy just doesn't care, man. Just goes wherever in everybody's mouth. Mhm. It's my favorite place. SL shaming the toy. Yeah, ladies and gentlemen, this is the Kinda Funny Gamescast. Every week we talk about cat toys and video games. Technically, it's a dog toy that looks like a cat. I meant like cat toys, a toy that",
            "start": 0.08
        },
        {
            "text": "toy. Yeah, ladies and gentlemen, this is the Kinda Funny Gamescast. Every week we talk about cat toys and video games. Technically, it's a dog toy that looks like a cat. I meant like cat toys, a toy that is a cat, not a dog. To you got me nailed. Theoretically nailed me. And also great. So you're telling me that this thing will **** whoever the **** it wants to, but it can't be play with by cat. Get in people's mouths. Oh, no, no cat would play with this toy. Cats play with that toy. No way. You don't know ****, Greg. Anyways, we talk about video games a lot. You can find it here on YouTube.com/KindaFunnyGames, or you can go to Patreon.com/KindaFunnyGames and get the show early for some reason, along with a lot of other goodies. Yeah, and things like that of that nature. Q&As, Q&As, fan mails. Uh-huh. What else is there? Just go look the page. Can you go look at the page? Just go look at the page, please. We spent a lot of time on the page. Thank you. It's a good page. I actually am a big fan of the page, but I want to",
            "start": 57.6
        },
        {
            "text": "there. Just go look the page. Can you go look at the page? Just go look at the page, please. We spent a lot of time on the page. Thank you. It's a good page. I actually am a big fan of the page, but I want to clean it up. It need it need some. There's a lot of things you want to do. Of course, there is a lot of things not going to happen. Never. Yeah, never. You know what is going to happen? What's that? A review of Song of the Deep by the one and only Gregorius Miller, ladies and gentlemen. I love Song of the Deep. Caught me off guard here. I'll be I also want to I want to lead with still haven't beaten Song of the Deep because it's way longer than I thought it was going to be, but I'll walk you through it. What Song of the Deep for me is hitting on something I didn't know I was missing. Uh, Saturday I woke up. I wanted to play something. I thought I was going to play Oxenfree. I was like, I'm going to platinum Oxenfree this weekend. We haven't been home in so long. We've been to so many conventions in a row. I was",
            "start": 101.72
        },
        {
            "text": "to play something. I thought I was going to play Oxenfree. I was like, I'm going to platinum Oxenfree this weekend. We haven't been home in so long. We've been to so many conventions in a row. I was like, I want to play a console game and I'd like to get some trophies. And I saw Oxenfree. I was like, I wanted to give that shot. Da. I jumped in, played a little bit. Oxenfree again, it just doesn't work for me. I've tried. I've given it a few shots. I played through it on Xbox or I guess Steam. Um, it's a fine game. I I wasn't in love with those other people. I I still like parts of it. So I closed it, went back to the media bar or whatever and saw a Song of the Deep chill in there. And I was like, I legitimately didn't know anything about Song of the Deep. I clicked on it. I mean, I knew it was Insomniac game. I remember when they were teasing the reveal. They put out the little trailer, whatever, but it wasn't even a trailer. It was just like the reveal of it being an underwater game. Clicked on Song of the Deep, got",
            "start": 138.92
        },
        {
            "text": "when they were teasing the reveal. They put out the little trailer, whatever, but it wasn't even a trailer. It was just like the reveal of it being an underwater game. Clicked on Song of the Deep, got into it it and immediately was fell in love with it, because it's it what I didn't realize I was looking for was something I talked about a lot with Unfinished Swan of gaming comfort food. Like that I always talk about, I think in my review of Unfinished Swan for IGN, I talk about, um, it's like a cup of cocoa and a blanket. Like it's one of those things like you want to hunker down with it and just spend it. And part of that I think is the fact that in Unfinished Swan, someone's telling you a story like very clearly, you know what I mean? They're talking about the boy. They're doing all these different things. And Song of the Deep is the same way where it's like, this is Marin and her father live. Her father's a fisherman. They live out here. She, you know, waits up from every night and one night he doesn't come",
            "start": 171.56
        },
        {
            "text": "Song of the Deep is the same way where it's like, this is Marin and her father live. Her father's a fisherman. They live out here. She, you know, waits up from every night and one night he doesn't come back. So she and like all this is happening in like storybook pages. Like really, really not intricate art, but storybook art. Like what I would expect out of that same color palette, same everything else. And so then you get into the game and the game is as beautiful as that, more beautiful than that. Like that's setting in the tone for what your color palette's going to be and how the game's going to be. But then the levels themselves, incredibly beautiful. Uh, the soundtrack, the the, you know, instrumentals that are going behind it, awesome, beautiful too. And then you have this really, really great narration from this Irish woman that I and I again, I haven't beat it. Maybe at the end it turns out to be her mother. Go Meli, oh Meli, oh Danny D, oh Gills. Big twist. Yeah, but it was totally hit this nerve. I I",
            "start": 205.64
        },
        {
            "text": "from this Irish woman that I and I again, I haven't beat it. Maybe at the end it turns out to be her mother. Go Meli, oh Meli, oh Danny D, oh Gills. Big twist. Yeah, but it was totally hit this nerve. I I didn't know. We always talk about, you know, games scratching itches that we didn't know we're there or whatever. And it totally got me. And sitting there and playing it and being in love with everything that was happening. And it's, you know, if you don't know, it's a Metroidvania game. You're in this little submarine submersible going through looking for your father. You can zoom out and see how huge the map is at any time. You're obviously running into plenty of stuff. You're like, clearly this is a door or a barrier that I can't get through with my current weapons. So I know that at some point I'll come back. And you're going and there's like little crevices to go in. And you're like, okay, am I going to be able to shrink the ship or something else? Turns out you get out of the ship eventually when you get",
            "start": 241.36
        },
        {
            "text": "and you're going and there's like little crevices to go in. And you're like, okay, am I going to be able to shrink the ship or something else? Turns out you get out of the ship eventually when you get this other thing. It's a it's a it's a beautiful game. It is a game that's speaking to me on a storybook level, which I really appreciate. And something I I was talking about because the, you know, reviews I saw, I didn't I didn't read any reviews beforehand. Started playing it and after like that first day with it Saturday, I jumped out to just look at scores and saw that it's getting like sevens and sixes. I understand that. I would I mean, I I would be, you know, high sevens or whatever, maybe an eight if I was still having to worry about that kind of crap. But I don't, thank goodness. So I understand that why I'd be getting that, because for me, in the good way, it's very much a game if that makes sense. You're playing it and there is I don't feel like there is this bigger message. It isn't pushing technology in a",
            "start": 285.88
        },
        {
            "text": "I'd be getting that, because for me, in the good way, it's very much a game if that makes sense. You're playing it and there is I don't feel like there is this bigger message. It isn't pushing technology in a different way. It's like, here's a fun Metroidvania game for you to play that theoretically should take you a weekend, probably, or two days, right? I spent all Saturday playing, jumped in on Sunday, did a couple hours, did a couple hours Monday night or maybe an hour Monday night. And so I still feel like I have I I think I estimated yesterday when we were talking about like four hours left if I'm guessing, which I don't know. But based on trophies and bosses that are still out there there and stuff like that. I think it's a really well put together package. It's a really interesting, fun world. Uh, there's, you know, like I'm I I'm playing on normal. There's a harder level, but I'm not getting to this point where I'm feeling like I'm pissed off at enemies. They're putting me in a room where it's like Gauntlet",
            "start": 325.6
        },
        {
            "text": "know like I'm I I'm playing on normal. There's a harder level, but I'm not getting to this point where I'm feeling like I'm pissed off at enemies. They're putting me in a room where it's like Gauntlet. And maybe I'll die and then I come back and kill everything. You know, it's okay, cool. The weapons are there. Upgrades are attainable. Like it's one of those, you know, Metroidvania are all about, you know, finding your new items, weapons or, you know, abilities and then maxing them out through your skill trees and stuff like that. Same thing here with taking the gold you found and buying from the shrimp man or whatever the upgrade you need. And it's it's fun. Like it's super it's simple and it's a game. And I think just the way I'm describing it, you know now what this thing is. But there's something about it. There's something special to it. You're not talking about mechanics though. So how does the game how does the game play? And what do you so you're in a submersible? Yeah, you're in a little submarine that you",
            "start": 368.08
        },
        {
            "text": "something special to it. You're not talking about mechanics though. So how does the game how does the game play? And what do you so you're in a submersible? Yeah, you're in a little submarine that you do. Um, and then, uh, you fire rockets with it or and stuff like that. You're eventually, yeah, your first basic thing is that you have a little hook shot basically that you can shoot out that you can you can use to grab things to interact and pull levers, levers to open doors and then release and then try to get over there and get out. So it's like from the basic level, yeah, it's the little grappling hook kind of thing that you're using that you can shoot into enemies and attack them that way and then flank them and do it again. You can upgrade that and, you know, make it more powerful, make all these different things. Then yes, you get Torpedoes at some one point and then you can upgrade them to have dual Torpedoes for one shot. Then you get the",
            "start": 405.76
        },
        {
            "text": "that and, you know, make it more powerful, make all these different things. Then yes, you get Torpedoes at some one point and then you can upgrade them to have dual Torpedoes for one shot. Then you get the this like, uh, you get a ice blast that can freeze enemies or like you can use it in puzzles, because there's puzzles to it too, obviously, where you can make when you freeze these like like, uh, I guess what do they call them? Warheads if you want or bombs, I guess mines. Once you freeze them, they can then can like they become buoyant. And so you can use them and move them around and blow stuff up like that. Um, yeah, there's a, uh, thermal detonation one out stuff like that. Uh, you have a boost to, you know, swim faster, which then comes because there's other times where it's like you got to try to fight the current, but you can't, but you can see that you need to at some point. So it's it's interesting. Like every Metroidvania, I think my favorite part is learning the mechanics and seeing things and like, oh, how",
            "start": 436.88
        },
        {
            "text": "but you can't, but you can see that you need to at some point. So it's it's interesting. Like every Metroidvania, I think my favorite part is learning the mechanics and seeing things and like, oh, how am I going to do that? So the first time it's like, all right, cool. I can boost this far. And now that I've upgraded my grappling hook, I can grab that thing and then, you know, pull myself around and swing over there. There's all that. And then eventually they start tossing. And the only the the downside to the game, I feel like is they put in some, uh, you're having this great time. You're in the submersible. Everything's really cool. Then they put in some of those like light puzzles. Like, you know what I mean? Like, all right, you have to get this laser up here. So to do that, you need to like move all these mirrors and bounce light around. They're super the old mirror laser puzzle, the old mirror laser puzzle. So they're they're not hard. You know what I mean? Again, it's it's a it's a it's a simple game. And I don't mean",
            "start": 473.68
        },
        {
            "text": "and bounce light around. They're super the old mirror laser puzzle, the old mirror laser puzzle. So they're they're not hard. You know what I mean? Again, it's it's a it's a it's a simple game. And I don't mean that as a a, you know, a way to distract from it. Sometimes I was over complicating it. But when I first got in this room and I have like two sets of red, two sets of blue, two sets of green that I'm trying to bounce all around all these mirrors. I was like, this isn't what I loved about this game. This isn't where where I wanted to be. But I got out of it fast enough to keep going. And the other thing is that it is long. I do feel I was looking for I when I started it, I'm like, I'm going to beat this in a day. And then when I did, I was like, oh, okay, okay. I'm going I'm going to go over Nick's, watch UFC. I'll beat it tomorrow. And then I got in for a little bit. I was like, man, there's still more. It's not overstaying it's welcome. But I think I was trying to power through it, not power through, but I wanted to",
            "start": 507.12
        },
        {
            "text": "beat it tomorrow. And then I got in for a little bit. I was like, man, there's still more. It's not overstaying it's welcome. But I think I was trying to power through it, not power through, but I wanted to get through it like I did Unfinished Swan where it was like a sitting and I was over it. Um, this has more lasting power. But that only agitates me more in the fact of why doesn't have a platinum trophy? Like why is this not being treated like a real game if it's on disc? It is long. It is. Are huh? When I saw that, we talked about that on PS I Love You. I think you weren't there, I guess. But we did talk about we talked about on Colin & Greg, I think as well. But we I talked about on PS I Love You that this game has no platinum trophy, which is really **** annoying actually. Like to me, like it's not bizarre anything. It's obnoxious that like the game this long, this deep, a Metroidvania game has 10 trophies or something like that. I know it's not important to a lot of people, but to a lot of people it is",
            "start": 540.6
        },
        {
            "text": "anything. It's obnoxious that like the game this long, this deep, a Metroidvania game has 10 trophies or something like that. I know it's not important to a lot of people, but to a lot of people it is important. And I thought that was a it's not a turn off. I want to play the game. I've had I the only reason I haven't played is because I haven't really been here, but I was on vacation. But um, so I've been playing VA. But um, that sucks when I saw like like like there's collectibles and upgrade. It's like there's a million different ways you could have fleshed this out. And that's the thing for now that I'm in the fact that it didn't have a platinum. And I started off and I'm like, oh, it has it's ringing like Unfinished Swan. I expecting that kind of experience. And now that I'm more geez, God, I don't know, eight hours in, we'll say, maybe, you know what I mean? I'd have to go look at a game clock or whatever. Seven, eight hours in. It's like, this is a full-fledged game. Like, so why isn't it being treated like",
            "start": 576.12
        },
        {
            "text": "eight hours in, we'll say, maybe, you know what I mean? I'd have to go look at a game clock or whatever. Seven, eight hours in. It's like, this is a full-fledged game. Like, so why isn't it being treated like that? Yeah, why is it that I'm going to upgrade all my things for a silver or whatever when it should be that I'm going through getting silly? How did the upgrade how does the upgrade system work? Because one of the complaints point I've seen in reviews of the game was that, uh, the upgrade system, I don't mind this kind of upgrade system, but I guess some people do is that like you have to kind of pick and choose the upgrades you have to you have to use. But eventually you are so experienced that you can just fill out the entire tree, which to me is fine. But a lot of people or like one review in particular I read really had a problem with that, that it wasn't as thoughtful as it seemed in the beginning. In other words, you have to make your choices. And then I mean, that's how I always do it, right? Like",
            "start": 612.4
        },
        {
            "text": "I read really had a problem with that, that it wasn't as thoughtful as it seemed in the beginning. In other words, you have to make your choices. And then I mean, that's how I always do it, right? Like for me, looking at an upgrade tree, it's always like, well, there's a trophy attached to it. And how does that work? So for me, it was I put everything into the hook shot. I was or the grappling hook I was using so much. And then when I got Torpedoes, I started putting everything into Torpedoes and ignoring some of the other stuff. And then now that I'm, yeah, making more money, because what you do is you go through, you beat the enemies, they drop gold or silver coins. Uh, your map when you pull out, which I I really love. I know some people want like Axiom Verge has so many hidden secrets and it's you don't you have to leave one or two markers for it. And it's kind of like, oh, man, I saw this. I don't never know how to get to it. This one, once you explore the map and fill it out, you see every treasure chest. You see",
            "start": 643.16
        },
        {
            "text": "to leave one or two markers for it. And it's kind of like, oh, man, I saw this. I don't never know how to get to it. This one, once you explore the map and fill it out, you see every treasure chest. You see every door. You know, like so it's like Shadow Complex, exactly. You know, everything's there. So for it's totally that carrot on the end of the stick of keeping me motivated where it's like, all right, cool. I've, you know, I got the three gems to do this. And now I need to go over there to do that. And I could take this really direct route, but I haven't I haven't been back up there in forever. So let's go. So you go through there and you're getting like gold or silver fish statues or pearls or stuff that give you more more coins. What what with some of the touch you're not a huge Metroidvania fan, right? So you've not played like a vast array of these games, correct? Yeah. So but for the touchstones that you have played, how big is the map compared to say Symphony of the Night or Shadow Complex or the games",
            "start": 675.52
        },
        {
            "text": "so you've not played like a vast array of these games, correct? Yeah. So but for the touchstones that you have played, how big is the map compared to say Symphony of the Night or Shadow Complex or the games you've you have played? Well, so I mean, we're talking about I've played Symphony of the Night, but that was a long time ago. And then more recently, Axiom Verge. Axiom Verge is huge. So so is it? It's not it's not that big. I when you zoom out, you you could look at it and be like, oh my God, it seems like it's huge. But you move so quickly through it. It's it's not again, I don't mean to insulted or anything. It's not baby's first Metroidvania, but it it is like a dumb it is a simple Metroidvania. You can wrap your head suggest that that is the entry. It could be an entry point. But I like that. And that's why it's working for me. And I totally and that's why I think having not even read the reviews, just seeing the score, I get where they're coming from that this isn't, but this is very much one of those games we would",
            "start": 708.72
        },
        {
            "text": "for me. And I totally and that's why I think having not even read the reviews, just seeing the score, I get where they're coming from that this isn't, but this is very much one of those games we would always talk about at IGN and right of explore the scale where yeah, not everything needs to be an eight or a nine or a 10. But like this game for me is is hitting on something, you know what I mean? I want to I don't want every game to be like this, but this is a kind of game I was missing and didn't know I was missing where I do want there to be like I'm someone's reading me a story and I'm just participating in it. What's the price point for it? Great question. I think it's 1999. Yeah, okay, cool. And but so what's the deal with the uh with the GameStop? So this is the GameStop publishing label label, right? Where they this GameTrust, yeah, GameTrust where they've partnered now with certain developers like Insomniac or whatever to put out games that way and try to I think it's, you know, it's GameStop trying",
            "start": 745.48
        },
        {
            "text": "they this GameTrust, yeah, GameTrust where they've partnered now with certain developers like Insomniac or whatever to put out games that way and try to I think it's, you know, it's GameStop trying to future proof a bit, right? So that if the stores do go away, they have other arms and other revenue streams. And so this is this was their first one, right? They this is their first Rime. They're doing well with them as well, the guys that made The Order. Um, so the game is available only at retail in GameStop stores, but you can buy it digitally on on downloadable services where where it is available. So PSN and Xbox Live. I think it might be Steam game as well. Um, not sure about that. It seems cool. Yeah, Insomniac is a studio I'm very close to, so I I uh it's certainly a game I want to play. I like to try to play everything that put out. But um, like I was telling you, it's not urgent to me. I have imsu now. It's not urgent to me at what I was telling you on Colin & Greg Live. I think still rings true is you",
            "start": 779.56
        },
        {
            "text": "to play everything that put out. But um, like I was telling you, it's not urgent to me. I have imsu now. It's not urgent to me at what I was telling you on Colin & Greg Live. I think still rings true is, you know, on PS I Love You a few weeks ago, we did the thing where one of the kid was like, you guys get to make a game, but you have to assign these developers these different parts. And I think it was I I always forget it. He put down fun or entertainment or entertaining gameplay. And my pick for that was Insomniac. And this is like the whole not not I had played this game yet. This is like the reason why though. It's like an Insomniac game. You know, you're going to sit whether it's Sunset Overdrive, whether it's this, whether it's a Resistance. You know, you're going to sit down and have a great time with it. It's going to be rewarding. A Ratchet & Clank. It's going to feel like, cool, I'm making progress and I'm I'm having a great time doing it. And that's exactly what's happening here, which is interesting",
            "start": 815.0
        },
        {
            "text": "it's going to be rewarding. A Ratchet & Clank. It's going to feel like, cool, I'm making progress and I'm I'm having a great time doing it. And that's exactly what's happening here, which is interesting, because I really feel the last time I was in a mood and sat down with a game and loved it was Ratchet & Clank, which was the same thing where I woke up on a weekend. I was like, I'm finally ready to play this game and played it for a day. And I was like, this is awesome. This is exactly what I want. Did you beat Ori? No, I never beat Ori. Oh, okay, cool. Because this game it seems kind of similar to that a lot. See the thing about Ori though, right? And this is even what I got from demos and talking to you about it was like in Steimer about it at the time was like how the difficulty spike where you got frustrated like, **** this, you know what I mean? You got mad at the game. I I've never had that. This is 100% like a chill experience. And that's what when I talked about the soundtrack being so good and I talk about",
            "start": 846.56
        },
        {
            "text": "**** this, you know what I mean? You got mad at the game. I I've never had that. This is 100% like a chill experience. And that's what when I talked about the soundtrack being so good and I talk about the voiceover being so good. I think it's just maybe it's, you know, as our lives are so hectic and they've been so crazy lately, uh, maybe that's what just it's calm and it's soothing and it's this. And it's it's when when I do die, it's not like, man, there's no way to get I'm never going to figure this out or get past it. It's like, no, I did something wrong. You know what I mean? Like the few of the puzzles with the, you know, you you make the mine float and then you have to move it around. But if it touches this, you know, there's like because there's like air pockets pushing things around. There's some really clever designed puzzles in there. Not impossible to beat. You see them. You can figure it out pretty much. But I like that. I do. I I like the idea of, you know, I I leave a room and I see something as I go and",
            "start": 878.6
        },
        {
            "text": "designed puzzles in there not impossible to beat you see them you can figure it out pretty much but I like that I do I I like the idea of you know I I leave a room and I see something as I go and then I see something down there like whether it be an object that I know I need to go put in this clam shell mouth or whatever and it's like oh that's how that connects and I come back and do it right away rather than like some games where it's like I've beat my head against the wall for 30 minutes trying to figure out what's here I must not have it yet or maybe I do and I just don't understand but I'll go away and figure it out like I'm I feel like what Song of the Deep is really great at is presenting you with these little challenges that you can you can conquer and feel good about it and then move on to the next thing or understand that I don't have what I need here like it's clear that I still you know in my playthrough right now I still have these glass walls which are like one of the",
            "start": 915.24
        },
        {
            "text": "move on to the next thing or understand that I don't have what I need here like it's clear that I still you know in my playthrough right now I still have these glass walls which are like one of the final barriers these like I I even have their glass whatever they like like green tubes or whatever and I don't have whatever I need to break them and so every time I see I'm like okay cool I know I'm not ready for that whereas before when it was like the lava wall I was like eventually I'll figure that out or again when it was like I know there's a I'm going to get small or something's going to get small to go through there to work there's a few things that turn me off about the way you're describing it though just in the sense that I mean I don't know for sure I've not played it myself I might interpret it differently it sounds easy which is a turn off now there are examples of easy Metroidvania games that are fun I think actually Shadow Complex is a great example that game is ****",
            "start": 948.8
        },
        {
            "text": "interpret it differently it sounds easy which is a turn off now there are examples of easy Metroidvania games that are fun I think actually Shadow Complex is a great example that game is **** easy as hell um and it's just fun because of the lore it's the world yeah it's a satisfying game to play it's just it's just a good game um so that might be nullified by you know the nature of the game as well the trophy thing obvious the trophy thing obviously turns me off as well um but that's kind of an ancillary and not important thing that's not going to stop me from playing the game um but yeah it seems like it's easy which is fine I like the idea of an entry point though for the genre because when you think about and I don't know if that that's the way they're pitching it you might just be good at the game for all you know um or whatever but what I think about the Metroidvania games that's that's a genre I explore readily the easiest one I can think of recently was um uh the **** was it",
            "start": 980.4
        },
        {
            "text": "at the game for all you know um or whatever but what I think about the Metroidvania games that's that's a genre I explore readily the easiest one I can think of recently was um uh the **** was it not Shinobi um the uh the one that Capcom released why can't I think of it the the ninja one Strider oh Strider that one was so Strider there was a Metroidvania Strider game like two or three years ago right around when PS4 came out and that that was a really easy game but it was also really satisfying as well just this good genre to explore like similar to like how Pokémon is a nice and traditional Pokémon is a nice gateway to role playing games for for gamers like I can't think of a way to say like this genre is really great but you should play Super Metroid or the Original Metroid which is **** really hard or something like that like or Symphony of the Night which is I think very obtuse to a lot of people you can miss half the game and never know um that's where I think Ori comes into",
            "start": 1013.92
        },
        {
            "text": "is **** really hard or something like that like or Symphony of the Night which is I think very obtuse to a lot of people you can miss half the game and never know um that's where I think Ori comes into play for me I think Ori is a good but Ori's hard well it gets it has its hard moments I wouldn't say it's hard overall I played one of those SPS we played yeah when you played that one demo but that was like and I was you do I mean you can do it but it's I'm like this is actually like shocking which is actually one of the turn-ons for that game for I was like great like yeah that was one of the the few moments that are that difficult but I think that Ori overall is a good entry point into getting into all those types of games you all ner should play Symphony of the Night though out there if you if you don't know what Metroidvania is or just not familiar with the genre that's Symphony of the Night is one of the great games of all time and easily easily the best Metroidvania game I think so um good",
            "start": 1054.96
        },
        {
            "text": "don't know what Metroidvania is or just not familiar with the genre that's Symphony of the Night is one of the great games of all time and easily easily the best Metroidvania game I think so um good play Super Metroid obviously a great place to jump in as well though I think Super Metroid a little cumbersome I didn't like it I overrated I mean like it's it's it's not overrated we talked about this in past right like there's a problem with 16-bit games generally that follow a style of old 8-bit games and that that's the this the um resol or not the resolution but like we're playing in 4:3 still but everything's bigger so like nothing it's and it's and sometimes even zoomed in because you have like these better looking pixel graphics so Samus is way too big in that game that was that's like Super Metroid yeah think about Metroid think about well that's I mean that's even worse on Metroid on Game Boy but think about the perspective of the Original Metroid and then think about Super Metroid",
            "start": 1089.36
        },
        {
            "text": "Metroid yeah think about Metroid think about well that's I mean that's even worse on Metroid on Game Boy but think about the perspective of the Original Metroid and then think about Super Metroid and and there's just less room to work that's a huge get in the way that's that was a huge problem to me even even when I first play comparing this to Super Metroid to Axiom Verge and then putting Song of the Deep in there one of the reasons I think maybe it is easier or it's you know more appealing to me in the fact is that you're not moving because when I with the Castlevania or Metroidvania games are talking about right now I immediately start thinking about stiff controls you know what I mean of the d-pad and the direction and that and even Axiom Verge is better at it but I still always had that problem where I'm trying to aim on an angle and it doesn't whereas with Song of the Deep being on the sticks or whatever and being your underwater you can totally",
            "start": 1130.68
        },
        {
            "text": "at it but I still always had that problem where I'm trying to aim on an angle and it doesn't whereas with Song of the Deep being on the sticks or whatever and being your underwater you can totally strafe around and do stuff and I feel like I'm in the I'm in I can control what's happening in a battle much better than I can Axiom Verge which I loved and played the **** out of on Vita on our trips like great game really enjoyable I still felt most of the time like man I'm this is going to be hard to get through these guy they're in control I feel as me and I'm in control of the battlefield when I'm in there cuz I do get to do the idea of shoot these jellyfish first or whatever then go after this fish who's throwing his bombs or get get far enough away so I can see their incoming attack attacks and strafe around and and get around is it a dual stick yeah so you're controlling that way well you're aiming or whatever moving yeah no that makes a lot a lot more sense cuz yeah like the the",
            "start": 1167.4
        },
        {
            "text": "and strafe around and and get around is it a dual stick yeah so you're controlling that way well you're aiming or whatever moving yeah no that makes a lot a lot more sense cuz yeah like the the controls specifically with the diagonals are a little bit hard on any of the games I think that's a problem even with like Shadow Complex and I think this is a bit forgiving maybe with hit boxes or stuff like that it's when you're shooting projectiles like the hook or the missiles or whatever you'll see a little like indicator on them go red meaning that like that's who you're going to be shooting at that's what's going to happen it's going to go that way any final closing thoughts on I think every we should give it a shot I mean if if what I've said sounds interesting if if anything I've said sounds like a turn off don't worry about it but like for me super enjoyable game like I really really wasn't expecting anything from it and I'm really really in love with it I'm really I can't",
            "start": 1206.24
        },
        {
            "text": "said sounds like a turn off don't worry about it but like for me super enjoyable game like I really really wasn't expecting anything from it and I'm really really in love with it I'm really I can't wait to beat it I can't wait to sit down again and get a big chunk of time to sit there and play through and finish it like it a lot check it out",
            "start": 1241.96
        }
    ]
}