{
  "id": 1929,
  "video_id": "HGfUQvkztXo",
  "show_name": "Gameplay",
  "hosts": ["Colin Moriarty"],
  "title": "Bloodstained: Ritual of the Night - Kinda Funny Plays",
  "description": "Colin plays Bloodstained: Ritual of the Night\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
  "published_at": 1469030402,
  "duration": 893,
  "transcript_chunks": [
    {
      "text": "Greetings and salutations, welcome to a Kinda Funny games let's play and my name is Colin Morard. Now today we're going to play Bloodstained: Ritual of the Night, the E3 version of the game. So this was the version that was basically being demoed last month in Los Angeles at E3. Um, I don't know. Uh, I'm excited to play it. Now there's some things that you should know just in case you want to take it my everything I say with a grain of salt. Number one, uh, I hosted The Bloodstained: Ritual of the Night reveal live stream, so that's something that you should know. Number two, I know EA and Ben Jud personally, so those other you should know so you can take everything I say with a grain of salt if you want, but I'm telling you right now I'm going to give you my honest opinion of the game. I have not played it at all. I am super stoked about it. I'm especially stoked about it although a little nervous about it as well because of Mighty Number 9 and how bad that was. Uh, I think that they're on a right track with",
      "start": 0.04
    },
    {
      "text": "all I am super stoked about it. I'm especially stoked about it although a little nervous about it as well because of Mighty Number 9 and how bad that was. Uh, I think that they're on a right track with this game though. I've heard good things about it from folks at E3, so let's get in. I don't know how long we're going to play. I don't know how long this demo even is, but uh I'm excited to see what it's all about, but I wanted to preface everything with that okay easy enough. I'm playing by the way with an Xbox One controller. We are playing obviously on PC, so we're on a pirate ship. This already reminds me a little bit of Castlevania 3. I got a long sword which is not equipped so I can probably press start. Oh yeah, all right, let's see equip the long sword. I got a tunic on my body. I got a scarf. I already love it. I already love what I'm seeing okay nice collect some coins. Oh it feels great guys it really it does okay cool and you can hit left bumper to back up as you saw here all right so we're",
      "start": 34.68
    },
    {
      "text": "love it. I already love what I'm seeing okay nice collect some coins. Oh it feels great guys it really it does okay cool and you can hit left bumper to back up as you saw here all right so we're going enemy morte or Mort so no accent so I guess it is Mort okay another Treasure Chest let see what's in it I got a potion maybe use that later I'm collecting coins although I don't know if I'm going to use them at all the shadow effects are subtle but really cool in the background you can see them there some sort of monster the .53 uh .5d thing rather doesn't look awesome but it'll do definitely prefer you know pixels Sprites D it's cool though watching these enemies kind of appear from the forground in the background can I keep going this way if I wanted to oh this guy's a Morning Star Doll Hammer douah Hammer oh all right see if we can take him out he's protecting some sort of treasure chest all right he's dead the treasure chest he was protecting contains a headband let's go",
      "start": 79.52
    },
    {
      "text": "Star Doll Hammer douah Hammer oh all right see if we can take him out he's protecting some sort of treasure chest all right he's dead the treasure chest he was protecting contains a headband let's go back in and equip cool so I get a little bit of a defensive boost by the way really love the art God man this is exactly what I want this is exactly what I want all right why cani just Shi the bed and didn't and stop giving us these kinds of games no now all right so we're back inside here let's kill these apparitions these are hold Amy another Treasure Chest another potion Kev what do you think so far good yeah if feels great it really does it feels great so we can slide like Mega Man and Mega Man 3 and four and five and six can we go through this door it looks like this is sealed off this is probably maybe something you're going to do in a regular game there doesn't seem to be an ability to look at a map which is understandable could be wrong though maybe we'll get to see it in a little",
      "start": 158.04
    },
    {
      "text": "probably maybe something you're going to do in a regular game there doesn't seem to be an ability to look at a map which is understandable could be wrong though maybe we'll get to see it in a little bit you think I would have leveled up by now oh wait did I just level up that's so weird that I just said that all right now level two so I'm doing a little bit more damage and I'm killing those guys in one hit Mort Cannon oh demon power that's been crystallized it cannot be handled by an ordinary person okay light the cannon there we go cool I kind of want to go back though I can see what I missed now you're getting into the head of K War already and how he plays games I can't I I I can't miss anything but maybe maybe if I just kept going left I don't know we're going to see like I feel like maybe I shouldn't be going down here yet nope see good I knew I was going to miss something so ether and a ring so let's go equip the ring accessory number one ring common cheap ring",
      "start": 218.32
    },
    {
      "text": "like I feel like maybe I shouldn't be going down here yet nope see good I knew I was going to miss something so ether and a ring so let's go equip the ring accessory number one ring common cheap ring gives me a two-point boost in defense I'll take it get this as well I'm accumulating a lot of funds here but I don't even see that the game is even counting it so I be collecting these coins for literally no reason but that's just the OCD in me that we so many of us share as Gamers all right God this is scratching an itch man I play games like I would only play games like this if there was enough of them the same way I felt about during the Golden Era of jrpgs in the '90s it's like all you needed almost all right so let's go back to where we saw the cannon see if we have to kill these enemies again looks like we do oh I didn't kill that Cannon quickly enough so I got damage that's the first hit I've taken all right so now we're in a new area of the ship that looks a lot like the",
      "start": 291.0
    },
    {
      "text": "enemies again looks like we do oh I didn't kill that Cannon quickly enough so I got damage that's the first hit I've taken all right so now we're in a new area of the ship that looks a lot like the old areas of the ship what is this thing Jesus buer so we're moving forward more of these Amy apparitions can I go up this way this is a wall this is really really slick also shout out to the music music's great Sema trust another ether G me a lot of ethers kind of want to kill those guys over there I feel like they're hiding something another level up level three now very nice cuz it didn't look like they were hiding anything at all actually didn't have to kill them but I did so we're moving left this ship sure taking on a lot of water by the way the subtle movement of the ship is really cool too I'll stay still so you can if you case oh let me kill this guy first in case you haven't noticed it so when the final game comes out uh there will be a uh Team Fat item in it for all you",
      "start": 351.12
    },
    {
      "text": "cool too I'll stay still so you can if you case oh let me kill this guy first in case you haven't noticed it so when the final game comes out uh there will be a uh Team Fat item in it for all you Kinda Funny fans out there which I'm excited about uh that you'll be able to acquire and I think that when you signed up to support the kickstarter you could actually have signed up on our team as well which is pretty cool so all that's important to know um in case uh you just feel like you can't trust me based on the game cuz I had to have a connection to it but I want to bring that all out into the open so you know what's happening so SEMA can now be killed in one hit cuz I'm level three which is nice all right some more chests Kung fuu and a potion so let's equip the Kung Fu shoes certainly the other accessory no kung fu shoes oh oh interesting so these let me kick I guess nice gave me an extra an added um point to my attack by equipping them so it is stronger than the sword I had",
      "start": 456.96
    },
    {
      "text": "the other accessory no kung fu shoes oh oh interesting so these let me kick I guess nice gave me an extra an added um point to my attack by equipping them so it is stronger than the sword I had equipped which is cool so I think the game's pretty cool it's a little repetitive like I I also feel like because I'm not because it it is a oh because it is um a demo I just feel like I'm not like contributing to anything that I'm supposed to be doing here right now but I think that's just the nature of playing game with this like I want to see the map I want to know what's going on but uh and I mean not just like the mini map or like I want to see like the full map like what am I supposed to be doing where am I going what is the goal is this going to be in the final game I have a lot of questions maybe some of them have been answered but I don't know those enemies are pretty cool the enemy designs are really cool the main character designs are cool this has shits on Mighty Number 9's design",
      "start": 511.96
    },
    {
      "text": "maybe some of them have been answered but I don't know those enemies are pretty cool the enemy designs are really cool the main character designs are cool this has shits on Mighty Number 9's design I'll tell you what man they're embarrassing what they're doing they completely embarrassing um what they did with Mighty Number 9 I say they because it's the same development Studio interestingly enough oh so this guy spawns these dudes I'm taking a little bit of damage here might have to use a potion another Treasure Chest a potion in it's a big ship wonder what kind of cargo they in haul in here and how this connects to the game so I got to give a shout out I mean uh EA kind of did explore this in other Castlevania games that he did um the symy night style kind of Metroid Vania games but uh got to give a shout out as well to um to Castlevania because there seems to be at least no tenuous connection necessarily to a just only a castle in this game which is similar to Castlevania 3",
      "start": 561.04
    },
    {
      "text": "but uh got to give a shout out as well to um to Castlevania because there seems to be at least no tenuous connection necessarily to a just only a castle in this game which is similar to Castlevania 3 which I shout out out earlier as well so it looks like I have to use the magic here again this will bust through the uh wall I'm back where I was I wonder does it I just go in a circle oh so there's a map here okay so I access the map by pressing the select button or whatever they call that on the Xbox controller I don't know okay okay oh so I can cast my own little Amy creature all right so it look like based on the map that I could go up here in a way I did not see before **** getting a little getting a little anxious here there we go oh I see I missed this completely okay well I collected a bunch of potions so I might as well use them huh so we're back on the deck of the ship level up again that level four now oh looks like a boss door but I can go",
      "start": 610.16
    },
    {
      "text": "okay well I collected a bunch of potions so I might as well use them huh so we're back on the deck of the ship level up again that level four now oh looks like a boss door but I can go down here first is there's anything going on down here and anything I need another Treasure Chest probably give me some potions High potion and a high ether so I'm at the boss door it's open looks like I'm going to fight this tentacle octopus like creature yeah this game looks great whoa the hell is that woman has some gratuitous large boobs on her all right let's see okay we don't want to have anything to do with that can I use like V verer something is her name you can see in the corner using my flame attack here does although I can just kick as well all right now something's happening here oh let's go into the inventory real quick and uh use an ether can I kick her in her boobs nope can't do it so can I attack this thing oh okay oh kicking her right in the stupy head looks like I killed",
      "start": 697.76
    },
    {
      "text": "let's go into the inventory real quick and uh use an ether can I kick her in her boobs nope can't do it so can I attack this thing oh okay oh kicking her right in the stupy head looks like I killed it that's it that's the let's play that's the Bloodstained E3 demo little late here in July our friends uh sent it to us uh from Fang gamerin creates um of course uh I hope you enjoyed uh the let's play Keep It tuned to youtube.com/kindafunnygames for Future Let's Plays of course and let us know what you think in the comments below about Bloodstained I think it feels great I think you should be excited about it I really do believe those things uh I hope to see you next time until then bye",
      "start": 816.16
    }
  ]
}
