{
    "id": 2276,
    "video_id": "BLryhWb4Xf4",
    "show_name": "Colin Was Right",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Great Switchpectations - Colin Was Right",
    "description": "This week's Colin Was Right explores the optimism surrounding Nintendo's upcoming console/handheld hybrid -- the Switch -- and tackles a few issues Nintendo needs to overcome to ensure the device's success.",
    "published_at": 1483635604,
    "duration": 459,
    "transcript_chunks": [
        {
            "text": "greetings and salutations, welcome to Colin Was Right. Allow me right off the bat to wish you and yours a very happy, healthy, and rewarding 2017. I hope it treats you well, better than Sony treated Vita anyway. So next week Nintendo is flying a group of journalists and games media types, including a couple of us from the Kinda Funny crew, to New York City to check out the Nintendo Switch. It's bound to be an exciting event, one that will finally give us an intimate glimpse at the hardware and allow people we know and trust to go hands-on with the device, the games, and the interface, and relay their thoughts. The NES is my favorite console of all time, and I was so far up Nintendo's ass for so much of my life that I nearly splashed down in a Japanese toilet bowl. But even for someone like me, a self-described recovering Nintendo fanboy who has long since moved on from the company, the Switch has me excited. Chances are it has you excited too. I mean how couldn't it? Whether or not it meets",
            "start": 4.0
        },
        {
            "text": "me a self-described recovering Nintendo fanboy who has long since moved on from the company the Switch has me excited chances are it has you excited too I mean how couldn't it whether or not it meets expectations what I'll now lovingly refer to as switchpectations the very thought of what the Switch could be has many of us giddy The thing is, I really think Nintendo can nail this thing. Sure, we're not talking about a company that has instilled a lot of confidence in the consumer base as of late. The Wii U was garbage, the 3DS isn't all that much better, and did you see the little cord on the NES Classic? Are they kidding me with this thing? Nintendo apparently manufactured 15 of these $60 consoles for the entire global market so if you're lucky enough to find one I hope you like sitting two feet from your television seriously look at it but then again this is Nintendo we're talking about they may make a case inally terrible hardware and other head scratching decisions but they've consistently",
            "start": 42.24
        },
        {
            "text": "from your television seriously look at it but then again this is Nintendo we're talking about they may make a case inally terrible hardware and other head scratching decisions but they've consistently made great games for decades some of the best of all time I'd argue in an era where games are often released partially broken and in some sort of disrepair Nintendo continues to take pride in releasing quality software that actually works not everything's a hit of course by most accounts Star Fox Zero would have been a tantalizing candidate for abortion but Nintendo typically means quality software and they absolutely release quality titles at a higher rate than both of their first and third party Rivals that in part is what has me so stoked about Switch but for me Switch represents much more than just first-party Nintendo games in fact it absolutely must represent more than that if it's to have any chance of succeeding in a competitive market as it dares straddle the line between",
            "start": 80.48
        },
        {
            "text": "more than just first-party Nintendo games in fact it absolutely must represent more than that if it's to have any chance of succeeding in a competitive market as it dares straddle the line between traditional console and hardcore handheld it's a comfortable place for Nintendo to be in my estimation and a place many of us have been pushing for them to go since it was clear the Wii would fail spectacularly in Switch Nintendo appears to have a device that can help it regain its lost glory all it needs is to deliver in a few key ways and all we have to do is keep our expectations in check because while first-party games are great and while I'm so excited to play Zelda and that Mario game they teased among others Nintendo cannot and will not succeed with Switch on its own and without making a few key concessions alterations and advancements to boot remember expectations for Switch selling two or even three times more than Wii U did would be a massive success for starters Nintendo must nail the",
            "start": 123.24
        },
        {
            "text": "key concessions alterations and advancements to boot remember expectations switch selling two or even three times more than Wii U did would be a massive success for starters Nintendo must nail the price of the Switch rumors have long circulated that it will cost $300 and some folks say 250 is even possible depending on skew for me $300 is the price they have to hit and I'd go as far as to argue that $250 is selling the device short all the while giving Nintendo little room to maneuver if the market reacts poorly and they have to cut the price down though I wouldn't expect that to happen either you can get a PS4 or Xbox one for cheaper than a Wii U right this minute that's a real thing that's not a joke anywh who $300 is the perfect Middle Ground the representation of an undeniably reasonable price while also telling the market that this is a premium device worth a small Financial investment I truly don't believe shaving $50 off and getting it to 2 50 is going to affect much of",
            "start": 159.64
        },
        {
            "text": "reasonable price while also telling the market that this is a premium device worth a small financial investment. I truly don't believe shaving $50 off and getting it to $250 is going to affect much of anything, but I could be wrong, even though that goes against the name of the show. So my prediction: $300 with a bundled in-game PRS. We shall see. One thing I hope they don't do is have more than one SKU game consoles should always come in one SKU, always. This isn't 2006; put your product out there and say this is it, support one device and support it well. Make your ecosystem as simple and as easy to understand as possible, leave no questions unanswered, and better yet, beg no questions to be asked at all. Nintendo must also emphasize that power isn't as important as it's often made out to be in gaming. Power is often used as a crutch when a game doesn't run properly or simply isn't fun, and also used as an excuse as to why games haven't come further yet. As I've said many, many times, there isn't",
            "start": 200.52
        },
        {
            "text": "power is often used as a crutch when a game doesn't run properly or simply isn't fun and also used as an excuse as to why games haven't come further yet as I've said many many times there isn't one game on PS4 that fundamentally couldn't be played on PS3 open world RPGs are still open world RPGs Shooters are still shooters sports games are still sports games the new consoles have produced prettier bigger games running at higher resolutions but they're still the games we've been playing for years prettier games running at higher resolutions doesn't make them more fun it's been generations since Nintendo truly stressed power remember they didn't even make an HD enabled system until half a decade after the competitors yet their internally incubated games are often cream of the crop Super Mario Galaxy is better than almost anything on last gen's HD twins not being 1080p didn't stop it from kicking everyone's Square in the face right what I'm getting at here is that Nintendo needs to tackle",
            "start": 242.16
        },
        {
            "text": "Galaxy is better than almost anything on the Legend of Zelda's HD twins, not being 1080p didn't stop it from kicking everyone's Square in the face right. What I'm getting at here is that Nintendo needs to tackle the Switch's inevitable lack of behemoth-like technical strength head-on and tell the masses why it's not all that important because it isn't. Some of the best games of all time are stranded on hardware created long before people in college right now were even born. Games are about gameplay, narrative immersion, fun - power can be additive to that, and we all want developers to be able to flex their muscles with the best tools available, but all of this isn't a major component to the puzzle. Super Mario World on SNES is a master class of gameplay today as it was 25 years ago; the Xbox One's power couldn't do one thing to that game to make it better. Power is tantalizing in one way, however, and it segues into the final point I'm going to make: Nintendo must attract third parties, and the Switch must allow some",
            "start": 282.24
        },
        {
            "text": "one thing to make that game better power is tantalizing in one way however and it segues into the final point I'm going to make Nintendo must attract third parties and Switch must allow some semblance of ports for machines that are undoubtedly more powerful than it otherwise they'll run headlong into the classic gaming industry chicken egg scenario that is to say third-party games don't sell on Nintendo Hardware these days but is there third party software worth buying on Nintendo Hardware Nintendo and its publishing partners have to find a fix for this which is going to be a heavy lift even though conventional wisdom in some corners indicates that people buy Nintendo products to play Nintendo games that's simply not true that's a significant piece of the pie shore but the most successful and beloved Nintendo products of all time were absolutely flooded with external support while the duds weren't NES was so popular with third parties and Nintendo was so scared of suffering",
            "start": 322.68
        },
        {
            "text": "successful and beloved Nintendo products of all time were absolutely flooded with exterior support while the duds weren't NES was so popular with third parties and Nintendo was so scared of suffering the same glut of games fade as Atari that the company literally limited the amount of games the publisher could release per year causing publishers like Konami to come up with some creative solutions such as the secondary publisher Ultra but I digress in any case if people really bought Nintendo hardware solely for Nintendo games then the math doesn't look too good for Nintendo fans because the Wii U sold worse than PlayStation Vita catering only to the hardcore Nintendo audience an audience that is clearly dissipating by the generation isn't a very smart tactic I'm sure Nintendo knows this which is why I truly believe they will get us all in the door with the allure of Nintendo's first and second party support and keep folks around one would hope with third-party offerings of both A",
            "start": 360.32
        },
        {
            "text": "this which is why I truly believe they will get us all in the door with the alert of Nintendo's first and second party support and keep folks around one would hope with third-party offerings of both a multi-platform and exclusive variety it's like how NES and SNES lured us in with Mario and Zelda but half of the games we talk about on both consoles were made outside of Nintendo Steel Doors Can Nintendo pull it off I really think it's possible Nintendo has cash in the bank smart people at the top a wonderful collection of top-tier developers a mountain of IP and plenty of experience in the market is Nintendo one major mistake away from putting its games on Sony and Microsoft consoles I think so many do will Switch be that mistake I hope not because a strong independent Nintendo is essential to a healthy gaming industry with Switch Nintendo has a chance to really Thrive again and I hope the company takes advantage of the situation we'll find out very shortly what excited you about Switch",
            "start": 398.16
        },
        {
            "text": "to a healthy gaming industry with Switch Nintendo has a chance to really Thrive again and I hope the company takes advantage of the situation we'll find out very shortly what excited you about Switch what are your concerns let me know in the comments I'm sure we'll be returning to this topic many times in the months and years to come in the meantime I hope you have a fantastic rest of your day thank you for supporting Colin Was Right",
            "start": 435.32
        }
    ]
}