{
    "id": 2313,
    "video_id": "Y4PrCVBvaLs",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Daniel Bloodworth"
    ],
    "title": "Let's Play Snipperclips on Nintendo Switch - Kinda Funny Plays",
    "description": "Sorry for the weird off-screen angle, Nintendo made us shoot this way.\n\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1484768079,
    "duration": 642,
    "transcript_chunks": [
        {
            "text": "what's up guys I'm Tim Gettys and this is Daniel Bloodworth from Easy Allies shout out to Easy Allies support them on patreon.com youtube.com/easyallies congrats on all the success by the way let's get right into it this is Snipperclips on the Nintendo Switch we've both never played so we'll see how this goes everyone who's been playing this though at the event this seems to be the sleeper hit of the event that's what I'm hearing that's word on the street okay so we're playing in the tabletop mode is what they're calling it correct tabletop mode all right so I'm the yellow guy Daniel's the little red one doing the tutorial here I like the little foot stops yeah little knee-high boots oh I see so we use ourselves to fill in the shape there we go we're professionals MLG Snipperclips how you get to cut the other character oh god oh that's oh wow that's interesting so it's like whatever shape is left there gets snipped away and then oh cool that's really cool yeah okay interesting that's a cool mechanic I think",
            "start": 0.28
        },
        {
            "text": "charact oh god oh that's oh wow that's interesting so it's like whatever shape is left there gets snipped away and then oh cool that's really cool yeah okay interesting that's a cool mechanic I the I like puzzle games a lot but I haven't seen one they used that that's a great anim I love the animation seem like a really good co-op game oh okay how do we yeah huh uh this seems complicated oh okay okay okay cut oh we have to do it at the same time dude now I think we need to switch to cut the other yeah so now now you reform the other way oh I don't know if we're going to get the full thing we all messed up yeah I think we messed up oh reform okay and now now hold on I'm going to rotate back oh wait that's perfect so we just snip at the same time I think we're good there we go okay lovely oh there we go work Makes the Dream Work yeah this is like Resident Evil 5 Co-Op right here all right great job on the tutorial yeah I feel good about this now the now the work begins this feels like",
            "start": 61.56
        },
        {
            "text": "oh there we go work makes the dream work yeah this is like Resident Evil 5 Co-op right here all right great job on the tutorial yeah I feel good about this now the now the work begins this feels like it's going to be a good let's play game all right all right so if you come over there so if you fill it is that enough can you just fill and cut oh no now we switch do the opposite I there we go go over go over there first go oh you're right I think you need to flip the other way okay and then cut I also do oh wait I need all me oh no kill them all all right hold on so now we'll go on top of each other right okay and then cut me but if I cut you then that's all of it right oh wait what cut yeah that's why I'm trying to figure oh whoa look at that so what happen to you so okay so let me flip this way and then you go down you crouch down uhhuh okay let's try that and then we did the we did the opposite all right I'm reform I'm going reform okay okay oh got it okay okay okay perfect and I",
            "start": 146.72
        },
        {
            "text": "this way and then you go down, you crouch down. Uh-huh, okay, let's try that and then we did the opposite. All right, I'm reforming, I'm going to reform. Okay, okay, oh got it. Okay, okay, okay, perfect. And I laugh about it; that's great. All right, hold on. So now you go the other way. There we go. Wait, I got to no, you had it. No, don't like flip, keep rotating and yep, perfect. There we go. There we go. Yeah, look at that thing. Oh, oh, so we make pictures. Yeah, I like it. Okay, nice. This is one of those games that makes you feel really stupid and then really smart, right? All right, we got to push the pencil. Oh, okay, you got to make me skinny. So, oh, I'mma, I'll cut you. Okay, so now you can get in there. There we go. Now we got to get a basketball in there. Huh, you're going to have to scoop it close; see if you can try to do it. I think we're on the wrong end of it. Cut me a bit. Oh, oh, okay, okay. You guys, press the pencil switch. All right, we got to figure out a way to get it on top of my head. You rotate right there and",
            "start": 240.92
        },
        {
            "text": "think we're on the wrong end of it cut me a bit oh oh okay okay you guys press the oh the pencil switch all right we got to figure out a way to get it on top of my head you rotate right there and then down and then up maybe it'll I think it'll go back if you uh go backwards a little bit I Feel So Close all right now out your head there you go damn that over ready if you can scoop it on top of my head somehow no cut a chunk out of your head okay right yeah can you cut got the yeah if you reform and then turn upside down and then go down no no no the other way okay yeah now like make a bowl in my head I'm not really oh okay okay okay okay so now boom there we go okay oh no too big of a scoop is it actually I think that'll be okay no oh there we go that there we go and then let it go there yes unconventional oh that's nice pum jump push jump where's the plus and minus it's right it's there oh okay it oh my God so clever this is really clever so one of us is got to get",
            "start": 350.4
        },
        {
            "text": "let it go there yes unconventional oh that's nice pum jump push jump where's the plus and minus it's right it's there oh okay it oh my God so clever this is really clever so one of us is got to get skinny yeah boom volum and penc over there we got to sharpen the P oh gosh one of us is going to have to catch it I'm going to yeah let let's do the same thing again where that's hold on I'll re form do you want me to cut you um sure uh do you want how do you want to do do you want to do the bu thing again I'll do the uh I'll do the button okay there we go but then uh how do we want to catch the pencil do you want to that try the other side try the bottom go all oh wait Dam it yeah yeah yeah hold on so that's what we need so yeah give me that there we go okay okay oh you got to balance it or or pass it or you could just c a deeper trench oh we're going to need a deeper trench okay you can use use your the top of the J nice nice nice to get in there yeah oh this is Snipperclips it's the Switch",
            "start": 465.12
        },
        {
            "text": "or pass it or you could just c a deeper trench oh we're going to need a deeper trench okay you can use use your the top of the J nice nice nice to get in there yeah oh this is Nasty - it's the sweet nasty all right I like that I like that oh no oh no you got it I think oh you got it you got it oh my God this is a balancing act Keep It Coming Keep It Coming oh yeah oh my God it wait what we doing okay we just got to flip it there we go there we go yeah oh yeah this game is awesome okay okay all right you want a there we go we'll have to come back later Daniel thank you very much for joining me again support them easy allies over everywhere on the all the internet stuff find us on Kinda Funny until next time this Nintendo Switch this Joy-Con you can",
            "start": 551.16
        }
    ]
}