{
    "id": 2326,
    "video_id": "ynk36LQ8J2U",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Kevin Coello",
        "Colin Moriarty"
    ],
    "title": "Inauguration Day 2017 - Kinda Funny Morning Show 01.20.2017",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1484956094,
    "duration": 4367,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to the Kinda Funny Morning Show for Friday, January 20th, 2017! I'm one of your hosts, Greg Miller, alongside Colin Moriarty. Why are you sitting on that side? Because we talked about it. That's where I sat now. You gave up the throne. We never talked about it. Alright, Kevin will you go to the archive for the last, the one that Colin and I were on at the table. Not yesterday when we were sick. Show begins the same way. Stop sipping your coffee. Why are you bothering me in every way you possibly can today? I don't understand. What have I done? I just wanna, I just wanna, I just want peace and quiet and tranquility in my life. Should we check out what's going on in the back room? The back room is the cityscape of San Francisco, Kev. I'm not gonna call him. Oh, sorry. What? Should we check out what's going on in the back room? Ah, you'll see it later. What is it? Go check it out. It's probably not that important. You're right",
            "start": 0.0
        },
        {
            "text": "I'm not gonna call him. Oh, sorry. What? Should we check out what's going on in the back room? Ah, you'll see it later. What is it? Go check it out. It's probably not that important. You're right, you're 100% right. Is it your driving thing? Yeah. Kevin's got his driving chair back there so he can VR. Have you used it yet, Kevin? I did. Have you sat down in the cockpit and done something? I used it this morning. What'd you think? Fucking awesome. Did you VR it too? I don't know what that means. You used the VR? Oh, yeah, yeah, yeah, yeah. Yeah, no, that's how I used it. So explain to people what you're doing back there. I was looking for that video for you. Gotcha. I guess I'll stop that. Okay. I have a VR, I wish I had a picture to show them. You should've done that probably, yeah. You're the one who let us down this train of conversation. You're the one who let us down. Wow, I wasn't gonna make a big deal about it. I was gonna stop it then when he was like, I don't know what it is.",
            "start": 61.64
        },
        {
            "text": "the one who let us down this train of conversation. You're the one who let us down. Wow, I wasn't gonna make a big deal about it. I was gonna stop it then when he was like, I don't know what it is. Here's what you do. You take out your phone, put on Periscope, go down there, second stream experience it. That seems really complicated. Really, it's not. You just turn on the phone, you put on Periscope. Cool Greg will take it for you. Can I give you a GameOverGreggy? Go grab the thing and bring it right here in front of you. Bring the driving chair in here. Yeah, that's a great one. It's a little heavy. Send it back to wherever it came from, actually. Where'd it come from? Portugal? UK. UK. Same thing. Send it back. Same thing. That's some country, the P, though, isn't it? I don't think so. No? I don't think so. Peru. No, that's where I came from. Oh, we're in Puerto Rico.",
            "start": 102.16
        },
        {
            "text": "I don't think so. Peru. No, that's where I came from. Oh, we're in Puerto Rico.",
            "start": 136.56
        },
        {
            "text": "We're in Puerto Rico.",
            "start": 139.56
        },
        {
            "text": "Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. Oh, we're in Puerto Rico. All set to go, so you can VR, let's play it up, do all your jazz. You excited? You gonna spend some time here this weekend, tonight? Well, tonight definitely, not this weekend though. Yeah? Yeah. So that's specifically for VR driving? No, you can mind",
            "start": 198.56
        },
        {
            "text": "your jazz. You excited? You gonna spend some time here this weekend, tonight? Well, tonight definitely, not this weekend though. Yeah? Yeah. So that's specifically for VR driving? No, you can mind television on it. Yeah. Oh, I see. But Kevin's all stoked for VR. I just put it together right now. I need to take my time and wire everything carefully, organize the wires. Who sent this to us? Simtech. And this is the Simtech chair and cockpit, a bunch of Logitech stuff, right? The wheels and whatnot. Yeah, Logitech G29, awesome wheels. We'll definitely be doing Let's Plays and videos about it. You're doing a time lapse build back there, you said? Yeah. Nice, good job. I don't know how to stop this fucking thing. Throw it on the ground, spike your phone on the ground as hard as you can, I think, and that shuts it down, shuts it down pretty well. Greg, you know I can't laugh, I cough too hard. Ugh, Jesus Christ. How you feeling? Way better than I was yesterday. Good. Holy shit, I thought I",
            "start": 229.56
        },
        {
            "text": "and that shuts it down, shuts it down pretty well. Greg, you know I can't laugh, I cough too hard. Ugh, Jesus Christ. How are you feeling? Way better than I was yesterday. Good. Holy shit, I thought I was dead yesterday. Yeah? Yeah, it was awful. Not good, Greg. No, not good at all. Okay. Oof, I was just at home, I couldn't move. Did Paula stay home? Did she take care of you? So, Paula was also sick. Oh. Which sucked for her because then she just became my nurse. Oh, so you, yeah, that's how it was. My degree of sickness. Now, was that because of, yeah, is that because of severity? Not just because of your gender politics. Right, right, right, right, right. Men can be nurses too. Oh, I know, I'm just saying, usually Strike Me is the type that would put someone above yourself. It seems like you'd get sick and then it all gets taken out of Paula. That's how bad I was, like how out of commission I was. Sure. I feel in the inverted pyramid of, you know, responsibility and levels",
            "start": 270.56
        },
        {
            "text": "like you'd get sick and then it all gets taken out of Paula. That's how bad I was, like how out of commission I was. Sure. I feel in the inverted pyramid of, you know, responsibility and levels, like, don't get me wrong, you're carrying all of us on top, but then it's you, but then it's Paula. And so I feel like if Paula got a limb chopped off and you had a hangnail, you'd still be like, honey, take care of me. No, no, no, I would take care of her. Paula Bear, I'm sick and I'll fit up with my hangnail. I was just constantly like, wake up gasping because my lungs were just covered in mucus I guess. Gross. Gasping, being like, I don't know what to do. And she'd be like, well, I've made you dinner or breakfast or lunch. Whatever meal, yeah. You don't know, it's just dog food. And I'd be like, yeah, put the TV back on and I'd pass out after like 20 minutes. And that's what I did all day. Gotcha. So it was exciting. Colin, similar in this vein of thought, where do you come down on",
            "start": 311.56
        },
        {
            "text": "like, yeah, put the TV back on and I'd pass out after like 20 minutes. And that's what I did all day. Gotcha. So it was exciting. Colin, similar in this vein of thought, where do you come down on the Mucinex commercials? These little fucking blobs in there. I'm not a fan. They don't get me as upset as the toenail fungus people. Yeah, that was a Super Bowl commercial. You lift it up and you're like, oh, oh. That's like a literal nightmare I've had where my toe comes up and it's got all the fucking shit coming. Oh, doctor, no thank you. Colin, Donald J. Trump's officially the president. What'd you think of the inauguration? I slept through that. Okay, okay. I haven't watched anything. I see a lot of snark on Twitter. That's going to certainly not buy him another four years. But yeah, I got to go home and watch all that. I was up very late to like three playing a game last night. Sure. Did you do some pushups too? No. Okay. I don't make pushups. What kind of question is that even? But",
            "start": 351.56
        },
        {
            "text": "to go home and watch all that. I was up very late till three playing a game last night. Sure. Did you do some pushups too? No. Okay. I don't make pushups. What kind of question is that even? But no. I'll catch up on all that later. I'm going to write a little piece about that that I'll put on Facebook maybe today as well that I wanted to write already, but I just kind of ran out of time last night because I was playing Final Fantasy Versus XIII. You were working. You were working. So yeah, I think that watching Twitter meltdown has been not even funny, but just kind of sad. Here's my question about the Twitter meltdown. Is that I understand my feed is cultivated for video game people, our friends, best friends, stuff like that. That's why I follow. New sources for that. So I understand that most of them, liberal on the liberal side of the equation, right? You follow plenty of conservative people. Not really. Is it as doom and gloom? But I mean for your political stuff. I mean I follow like a handful",
            "start": 395.56
        },
        {
            "text": "liberal on the liberal side of the equation, right? You follow plenty of conservative people. Not really. Is it as doom and gloom? But I mean for your political stuff. I mean I follow like a handful of them. Is it as doom and gloom from them? Is it as a star game? No. I don't think even some Republicans or conservatives like Trump. And there are some Democrats that do like Trump, clearly because he won a bunch of people that voted for Obama twice. But no, I mean I only follow like 200 people and most, I follow like organizations and there are a few people like my good friend Dave Rubin and some other guys that have more conservative leanings, whatever, but I don't typically follow like individual people because I'm not really super interested in hearing the things that, you know, that, like I don't need to read, it's like why I don't watch Fox News or something like that or enjoy, I don't know, some of these conservative blogs or whatever because it's like I don't know, I know how I",
            "start": 440.56
        },
        {
            "text": "I don't need to read it, it's like why I don't watch Fox News or something like that or enjoy, I don't know, some of these conservative blogs or whatever because it's like I don't know, I know how I feel or how I'm supposed to be. I like to see the other side so it's nice. It's just sad to me that this is going to be the resistance to a Trump presidency. And I think that it's sad and I think it's misguided. I think that, as I said yesterday and as I will write and the tenor of my piece today will basically be that like we need an honest, good, mind-driven, brain-driven resistance to this particular brand of conservatism and we are not getting it. And that makes me very sad because expectations are so low for Trump that he will exceed your expectations and because you've set them at the ground level. And as I said yesterday, you've got to just, you have to hit him, you know, if you really want to dismantle what he's doing then you have to set the bar high and running around calling Rex",
            "start": 482.56
        },
        {
            "text": "level. And as I said yesterday, you've got to just, you have to hit him, you know, if you really want to dismantle what he's doing then you have to set the bar high and running around calling Rex Tillerson, you know, an idiot. Newsflash, Rex Tillerson was the CEO of ExxonMobil, not a dumb man, you know, going after all the, every cabinet position is an idiot, every cabinet position is stupid, every cabinet position is evil. No, these are actually some, there's some cartoon characters on there, there's some very smart people on that cabinet as well. Let's keep things honest and grounded and then set expectations for these people to achieve things on behalf of all of us and if they don't then you have some ammunition to destroy them because clearly your ammunition didn't work. Sure. He won. Sure. You know what I mean? Yeah, no, for me that was the whole thing with this. Of course I'm not a Trump guy or whatever. For me I feel like today's the, all right, the slate's clean. The arguments",
            "start": 537.56
        },
        {
            "text": "Sure. You know what I mean? Yeah, no, for me that was the whole thing with this. Of course I'm not a Trump guy or whatever. For me I feel like today's the, all right, the slate's clean. The arguments that were made beforehand and during the election and in this run up to here didn't work and there's nobody cares about them so fine, let's move forward. In his speech today he said, you know, he's never ever going to let any of us down. It's like, okay, so now when he does let me down, keep track of that and go from there. Exactly, like go find what his policies were, his protectionist policies if you don't agree with them, his tax policy if you don't agree with that, his environmental policy, etc. and so on. Identify those things that bother you that you have expectations or things that you want to happen that he hasn't achieved and make sure he achieves them and then you can hit him on policy levels because clearly the personal stuff doesn't work and actually I really do believe Trump turns",
            "start": 584.56
        },
        {
            "text": "want to happen that he hasn't achieved and make sure he achieves them and then you can hit him on policy levels because clearly the personal stuff doesn't work and actually I really do believe turns people away. And so when I see that kind of stuff, that kind of rhetoric on Twitter, it's fun to do every once in a while but the hyperbole is only going to hurt you. It's not going to help you. Normal people in the country that don't do these things observe this particular brand of hyperbole, observe this particular brand of rhetoric. They're turned off by Trump but they're also turned off by the resistance and when that kind of stuff happens you keep the status quo, you don't change anything. So I just worry about people's ability to deal with this rationally in a way to get a win because I'm telling you right now, 2020 is anyone's game but what is the goal? You want to impeach Trump, okay so you get Mike Pence? And then you're going to impeach Mike Pence so you get Paul Ryan who could",
            "start": 615.56
        },
        {
            "text": "telling you right now, 2020 is anyone's game but what is the goal? You want to impeach Trump, okay so you get Mike Pence? And then you're going to impeach Mike Pence so you get Paul Ryan who could easily beat any Democrat running against him if he ran for reelection or ran for an actual, you know, Ford-like 76 election or whatever. I just don't get it and I want people to try a different way because I think a different way will work better. And maybe I'm wrong but I just don't, clearly the evidence says conflict. I hold onto the hope that for everyone freaking out today and existing in hyperbole and doing all these different things, it's similar to how election night and, you know, there's 24 hours of the election, right, we'll say, today was a punch in the gut, today's a punch in the gut, you get up, you dust yourself off and we go back to trying to be Americans and figure this out and figure out what we're going to do. Greg, I just gave you a clip that I want to run before this",
            "start": 658.56
        },
        {
            "text": "Gut, you get up, you dust yourself off, and we go back to trying to be Americans and figure this out and figure out what we're going to do. Kevin, I just gave you a clip that I want to run before this clip if you don't mind for the green screen here. Well, this is a browser clip actually, I guess more than a green screen. I'll throw this up; I want to show, we have two tidbits for you here, two things for you. Oh, I saw this. We're going to watch it again because you're such a big Bain fan. And giving it back to you, the people. And we give it back to you, the people. Your favorite Batman movie. Bain would have been a great president. Would he? He would have made America great again. So I will more eloquently explain how I feel and what I think the way forward is. Keeping in mind a very interesting thing, talking about the political loop instead of a line, the spectrum. Much of, and this is hard for people to wrap their heads around, but a lot of the economic message of Donald Trump is",
            "start": 703.56
        },
        {
            "text": "thing, talking about the political spectrum. Much of, and this is hard for people to wrap their heads around, but a lot of the economic message of Donald Trump is Bernie Sanders' economic message. They're indistinguishable actually from each other. So if you believe in that kind of economic populism then maybe pull for that. And what I'm wondering is what is victory for the anti-Trump movement, right? Is it that he fails because then we're all fucked? Like I voted for Obama in 2008, but in 2012 I voted for Mitt Romney and I still wanted to win, when Obama won, I still wanted to do well because it's important that he does well. And I felt the same way I voted for Bush, but you know, and I actually like George W. Bush, but the opposition, the Kerry voters that voted, it's like but we should want him to do well. Now he's our president, right? That's the thing. I understand having a- And that's what we talked about leading into this, right? That it would be the",
            "start": 752.56
        },
        {
            "text": "it's like but we should want him to do well. Now he's our president, right? That's the thing. I understand having a- And that's what we talked about leading into this, right? That it would be the test of metal of how many people were offended when Obama got elected and so many people put the he's not my president bumper stickers on, right? People are like that's so bullshit, he is the president, dah dah dah, it's our country. Well now the shoe's on the other foot and is it the same thing? That Trump's not your president? What do we do? How do you figure this out? So from like could there be a way that people could work together? Yeah. A portion of Bernie Sanders' economic message is again indistinguishable from Trump's, specifically in attacking NAFTA and manufacturing base buildings in the United States. And Sanders seems to be, although he hasn't really talked too deeply about it or didn't talk too deeply about it, seemed to be a protectionist. And so, you know, while the other half",
            "start": 793.56
        },
        {
            "text": "United States. And Sanders seems to be, although he hasn't really talked too deeply about it or didn't talk too deeply about it, seemed to be a protectionist. And so, you know, while the other half of his economic message was the billionaires and millionaire class and taxing them originally and that kind of stuff, which Trump doesn't do, could we find common ground or could those two sides find common ground? Because I've always been a protectionist. So it's could everyone find common ground in this thing? Could we work together in this way and affect positive change for people in that respect? Because it's over. You know what I mean? It's over. And whining in the streets isn't going to change anything. It's not going to change a goddamn thing. And as I said yesterday, doing that kind of stuff got out of control and handed the presidency to someone that people didn't necessarily want because he was the law and order candidate or he was the guy that kept order or the person being",
            "start": 827.56
        },
        {
            "text": "of stuff got out of control and handed the presidency to someone that people didn't necessarily want because he was the law and order candidate or he was the guy that kept order or the person being attacked. We have to learn from history and we also have to just be smarter about the way we go about things. And so I just feel like, you know, it's disappointing to me that the reaction is to attack his children or to attack the way he looks or whoever. It's like who cares? Like what is that? Is that relevant to what we have today? We also look at the positive things. Why did the market react positively to his election? And can we learn something from that? And can we garner something from that? And how do we, you know, we must have an honest and good and powerful liberal resistance. It's important that there are two sides and that they're basically co-dominant with each other so that one side doesn't, you know, necessarily dominate polity and dominate what they want and then and all that",
            "start": 873.56
        },
        {
            "text": "that there are two sides and that they're basically co-dominant with each other so that one side doesn't, you know, necessarily dominate polity and dominate what they want and then and all that kind of stuff, which is what happened. And what I'm worried about the most is that Democrats don't seem to understand, there's a lot of writing about this but a lot of people don't read deeply, is the Democrats have been completely wiped out at a local and state level. Like insanely wiped out. There's a great New York Times piece about this and an NBC News piece about this. And they have to rebuild from the ground floor again. They didn't expect to lose and what it did was expose the fact that this powerful federal facade in which there is very little Democratic power in the actual states. The Democratic Party is going to be in the wilderness for a while and they need to figure out why that is and that it's going to probably get worse in 2018 in the midterms. And that they can come out fighting",
            "start": 920.56
        },
        {
            "text": "Party is going to be in the wilderness for a while and they need to figure out why that is and that it's going to probably get worse in 2018 in the midterms. And that they can come out fighting and swinging with a message. It's very easy to beat Trump on messaging. You just can't get into the gutter with him. Just stay out of it. And beat him on the policy front. And so that's kind of how I feel about it. It's an interesting time for an interesting day. I thought what you're talking about when you're talking about the echo chamber, when you're talking about people whining in the streets as you put it, I thought it was one of the most powerful things in Obama's farewell address was when he was talking about don't argue with people on the internet, talk to them in real life. You know what I mean? Because that is the thing. I think we get carried away and you're talking about hyperbole and the way people act and treat and talk to each other. And it is yelling matches in cyberspace, which",
            "start": 958.56
        },
        {
            "text": "Mean? Because that is the thing. I think we get carried away and you're talking about hyperbole and the way people act and treat and talk to each other. And it is yelling matches in cyberspace, which you would never do in real life. You'd have a heated conversation for sure, but you would understand that this is a multifaceted person who believes more than just this one argument we're arguing about right now. And people lose sight of that and that's how far we got off track during the election, which is one of my big points I kept bringing up on Game Over Greggy and his show and stuff. How fucked the conversation was. Yeah, my feeling will be the same. I've lost elections and I lost this election too. I didn't want Trump to win. I didn't want Clinton to win either because she sucks as well. But the message is the same that we should want to have peace and prosperity and an uplifting message for all Americans and that we can fight on policy and all those kinds of things, but eventually,\n\nI corrected the following:\n\n- \"Game Over Greg\" → \"Game Over Greggy\" (based on metadata host names)\n- No other changes were made as the text was already coherent and grammatically correct.",
            "start": 1000.56
        },
        {
            "text": "But the message is the same that we should want to have peace and prosperity and an uplifting message for all Americans and that we can fight on policy and all those kinds of things, but eventually, hopefully people will kind of come together and figure things out because... For the good of the nation. Yeah, because there are imperative things that need to happen. And what I'll be interested in, we were going to do it on GameOverGreggy's show as I said yesterday this week and we'll do it next week instead, is I really want to see specifically how everyone feels about specific policies. When you remove the man, the facade of the man, what do you agree with and what don't you agree with? And go from there. The beauty is that Democrats have a really great high rung bench for people to run. You have Castro, you have Warren, you have maybe a very elderly Sanders, you have Biden, you have... So an older bench, but still a good bench for people to run in 2020. Would Spider-Man and Joe Biden",
            "start": 1032.56
        },
        {
            "text": "You have Castro, you have Warren, you have maybe a very elderly Sanders, you have Biden, you have... So an older bench, but still a good bench for people to run in 2020. Would Spider-Man and Joe Biden have run away with it if you ran against Trump? Yes, Biden would have won. I think so too. And I'm sure he knows that and I'm sure he regretted it. The last episode of The Circus, which I encourage everyone to watch on Showtime, a very great show, they have a very long interview, a very candid interview with him. You can see it on his face. He knew he would have won and he talks a lot about it really kind of candidly. Because his son wanted him to run right, but when he died or whatever. So, I don't know. And above that, I want to... I've been in politics for a very long time and I've studied politics and I like politics and I enjoy them. And it's always been a blood sport. It's been a blood sport forever. Long before the United States, long before, you know, a very long time.",
            "start": 1067.56
        },
        {
            "text": "politics and I like politics and I enjoy them. And it's always been a blood sport. It's been a blood sport forever. Long before the United States, long before, you know, a very long time. And that's the way it is. But I feel like we've moved into a very disturbing space of personal attacks and all those kinds of things. Not necessarily unprecedented, but certainly unprecedented in modern history. I want people to remember that, like, people vote their conscience, but they also vote for the same reasons. They want a good life for their family, the so-called pocketbook issues, the wallet issues, all those kinds of things. And I don't like the disparaging of necessarily voters that vote their conscience. And I know good people that voted for Clinton and I know good people that voted for Trump. And at the end of the day, they agree on 90% of the issues anyway. So I think we can find some common ground there. Well said. And I hope we do as well. If you didn't know, ladies and gentlemen",
            "start": 1111.56
        },
        {
            "text": "And at the end of the day, they agree on 90% of the issues anyway. So I think we can find some common ground there. Well said. And I hope we do as well. If you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv slash Kinda Funny Games. We run you through the nerdy news you need to know about before jumping into the chat to answer your questions, comments, and concerns in between those two segments. I give away a video game each and every day. You can win by being in a chat like you are right now or subscribing to us or supporting us on Patreon.com. Kinda Funny or Kinda Funny Games. As if manna from heaven, Colin. Yesterday, we watched some stuff and you said, I said I was gonna show you a Netflix thing. You said, is it the House of Cards teaser? I said, no. Doesn't exist yet. That'd be awesome. Today we get it. Big Kev dog, run this for us. We'll be the House of Cards up in this piece. It's super short. Not even worth green",
            "start": 1165.56
        },
        {
            "text": "of Cards teaser? I said, no. Doesn't exist yet. That'd be awesome. Today we get it. Big Kev dog, run this for us. We'll be the House of Cards up in this piece. It's super short. Not even worth green screen probably, but no big deal. One nation, under God, indivisible, with liberty and justice for all. Fucking beat. I miss it. They're a little late. Yeah, that feels way out. Well, I'm just saying I feel like the episodes would come out this time of year. March, February-ish, yeah. Nonetheless, I wonder if that'll be the last one. I hope so. It has to be, right? Like what is this? I forgot. Did he in the, spoilers for House of Cards. I don't even remember anymore. At the end of it, he comes, this is where he starts running with his wife as Vice President. But I forgot, is that his first four years in the bank already? I think he was running for re-election. Yeah, I think he was. Well, he didn't, he didn't. Oh, right, he got brought in. He was in after two years. This is his first",
            "start": 1197.56
        },
        {
            "text": "four years in the bank already? I think he was running for re-election. Yeah, I think he was. Well, he didn't, he didn't. Oh, right, he got brought in. He was in after two years. This is his first term. This is his first term. Huh, interesting. We'll see what goes on. Jumping back to the world of video games, over on IGN, The Dark Knight of News, Andrew Goldfarb reports, Nintendo considering video streaming services on Switch post-launch. Yesterday, we talked about the fact that no, the Switch will not have, or two days ago, yeah, with Nick, we talked about no, the Switch will not have Netflix out of the box. Nintendo gave IGN the following statement, All of our efforts have gone toward making the Nintendo Switch system an amazing, dedicated video game platform, so it will not support any video streaming services at launch. However, support for video streaming services is being considered for a future update. How's that fit you, Colin? This machine's not ready. I really",
            "start": 1264.56
        },
        {
            "text": "Support any video streaming services at launch. However, support for video streaming services is being considered for a future update. How's that fit you, Colin? This machine's not ready. I really don't understand, I mean, it seems somewhat obvious and somewhat clear that they're rushing it out, that they're putting it out prematurely. It seems, you've heard plenty of evidence that devs didn't even have dev kits until recently, some still don't. You heard the fact that, like, you can only take screenshots with it. The online infrastructure seems a little half-baked. That's why you're getting it as a demo to begin with and then charge it in the summer. I really do feel like Zelda specifically is what's forcing their hand with this machine. They gotta get it out, they gotta put it out. That they're damned if they do, damned if they don't. Switch probably should have been launched in the fall with Mario, right? Yeah. But if you release Zelda on Wii U, which they should have done already,\n\nI corrected the following:\n\n* Added capitalization to \"Zelda\" and \"Wii U\"\n* Corrected \"devs didn't even have dev kits until recently, some still don't\" to maintain the original meaning and grammar\n* Left all other text as is, including filler words and phrases",
            "start": 1301.56
        },
        {
            "text": "They're damned if they do, damned if they don't. Switch probably should have been launched in the fall with Mario, right? Yeah. But if you release Zelda on Wii U, which they should have done already, then no one's gonna buy Switch for Zelda, specifically, maybe. Maybe import it and maybe pick some people up. And I really feel like that seems, from my vantage point, somewhat obvious. That that has something major to do with it. That it just doesn't seem ready to go. Like, it doesn't seem like it's ready to go. And their PR excuses are just insane. Not that Nintendo's ever been very good at this specific brand of spin, but the quotes about, Reggie's quote about, and I'm just paraphrasing about why they came up with this elegant solution of why you can't voice chat on Switch. Sure, you're smart. Because you don't want to bring your bulky headset. It's like, who the fuck brings a bulky headset around with them? PlayStation 4 comes with a little wire thing. Like, you would listen. One",
            "start": 1342.56
        },
        {
            "text": "Smart. Because you don't want to bring your bulky headset. It's like, who the fuck brings a bulky headset around with them? PlayStation 4 comes with a little wire thing. Like, you would listen. One earpiece. Yeah. It's like, what are you talking about? What you're saying doesn't even make any sense. And it's the same thing with this. It's like, we're making a dedicated gaming machine. Well, Sony made a dedicated gaming machine and Microsoft made a dedicated gaming machine with options. Netflix is on your fucking toaster oven. It should be on Xbox, they just do not have the relationships. They do not have the wherewithal to figure this shit out. And the machine is clearly not ready to go. Well, this goes back to the core argument you always talk about. It's the fact that we're talking about third-party developers, but let's talk about third parties, right? Nintendo's worried about this thing running Nintendo games and doing Nintendo things. It doesn't think about the fact of, oh right,\n\nI corrected the following:\n\n* \"PlayStation 4\" is already capitalized in the original text, so I left it as is.\n* Added capitalization to \"Xbox\" since it's a proper noun.\n* Corrected \"third party developers\" to \"third-party developers\" for consistency with the rest of the text.",
            "start": 1388.56
        },
        {
            "text": "third party developers, but let's talk about third parties, right? Nintendo's worried about this thing running Nintendo games and doing Nintendo things. It doesn't think about the fact of, oh right, fuck, people probably want Amazon Instant and YouTube and Netflix and all these different things. That's not where their head's at. Their head's at, hey, we're going to get this thing out and we're going to time it with Zelda and we're going to do this and we're going to do that. And okay, well, people use chat that other way for them. We'll do it this way because who cares, we're Nintendo. It's that same insulated Nintendo that they've been forever. And Colin was right, yesterday he was talking about the fact that we hoped and thought this was going to be them taking a foot towards, okay cool, no. We realize we exist in a greater ecosystem and we can look at our competitors and our fans and understand what they want and what other people are doing in a different way and bring that in. And",
            "start": 1427.56
        },
        {
            "text": "No. We realize we exist in a greater ecosystem and we can look at our competitors and our fans and understand what they want and what other people are doing in a different way and bring that in. And clearly they did it again. No, they, R&D of a console takes time. It takes time and effort and they probably R&D'd multiple things and tried to figure things out. And things come and go. Remember when the PlayStation 3's Morpheus was shown Sony didn't even commit to the fact that they were even going to release it when they showed it. They wanted to gauge interest. And what I think is, what happened is that I don't think that they expected the Wii U to bomb as badly as it did. The Wii U was an abject failure for them, the worst-selling Nintendo console, mainstream console they've ever released. And with the exception of really Virtual Boy and some Game & Watch stuff, the worst-selling piece of hardware they've ever launched. And to me that was a canary in the coal mine in terms of their ability to plan ahead.\n\nI corrected the following:\n\n* \"Morpheus\" (a PlayStation 3 peripheral) to capitalize it as a proper noun\n* \"Wii U\" to capitalize it as a proper noun, and added an article (\"the\") for clarity\n* Added articles (\"the\") for clarity in several places",
            "start": 1452.56
        },
        {
            "text": "of really Virtual Boy and some Game & Watch stuff, the worst selling piece of hardware they've ever launched. And to me that was a canary in the coal mine in terms of their ability to plan ahead. That when you have a successful console like the Wii you're able to take your time. And they had to I think even push Wii U out earlier than they wanted to because the Wii just kind of died. And they let it die. And I think that with Switch particularly, I don't know that they anticipated having to launch it this quickly. And I don't know that they anticipated necessarily even launching this particular skewer, this particular type of machine. And they were listening I think to people wanting a hybrid and all these kinds of things. Kind of the obvious nature of the direction that they would go in. Serving both the strength of their IP and the strength of their handheld division. And merging that with their console division, or their console initiative I should say. In a way that makes more",
            "start": 1497.56
        },
        {
            "text": "In. Serving both the strength of their IP and the strength of their handheld division. And merging that with their console division, or their console initiative I should say. In a way that makes more sense, that's more salient to them. And so I think that they're just between a rock and a hard place. But unfortunately these kinds of situations similar to Saturn with Sega put people in a position where you release a Dreamcast that has some good ideas in it. But is half baked and ends up dying. And I really do feel that. I was seeing some predictions. One prediction had a lifetime sales of Switch at 50 million which I think is absurd. And another had, Nintendo I think it was, but I could be mistaken, was saying something like between 6 and 8 million sold in its first year. Which I think is way more reasonable probably towards the lower end. And if that's the case then it'll be on pace to be like a GameCube or an Xbox. An original Xbox. Maybe even an Xbox One but half or more, or less",
            "start": 1532.56
        },
        {
            "text": "Way more reasonable, probably towards the lower end. And if that's the case, then it'll be on pace to be like a GameCube or an Xbox - an original Xbox. Maybe even an Xbox One but half or more, or less I should say, units sold of PS4. It's just they're in between a rock and a hard place. And they're going to continue to struggle in this way as well. Let's jump over to some PlayStation news at GameSpot. Eddie! This is Uncharted: The Lost Legacy's tone, gameplay teased. This is Eddie boiling down a larger article from over at the official PlayStation Magazine UK. The Lost Legacy puts you in the shoes of the character Chloe who appeared in past games but not Uncharted 4. And hasn't really been fully explored. The sympathetic villain Nadine from Uncharted 4 is also in the game. But we don't know exactly how the two characters are connected. It's set in India, according to the creative director Sean Elsley. S-K-G? What do you probably want to pronounce that? S-K-G I would say? Sean Elsley I'd say.\n\nI corrected the following:\n\n* \"way more reasonable probably\" -> \"Way more reasonable, probably\"\n* Added missing capitalization for proper nouns like \"PlayStation\", \"GameSpot\", and \"Uncharted: The Lost Legacy\"\n* Corrected spelling of \"Elsley\" (from \"S-K-G\") to match the host's name\n* Capitalized \"PS4\" as it is a proper noun",
            "start": 1571.56
        },
        {
            "text": "how the two characters are connected. It's set in India according to the creative director Sean Sakaguchi. S-K-G? What do you probably want to pronounce that? S-K-G I would say? Sean Sakaguchi I'd say. S-K-G? Okay. It will be totally different but in the same context of the Uncharted world he said. Moving on he said yeah it's set in India according to him. The setting works well for Uncharted. India's got really nice icon... iconography. Hidden temples and weird deities we can play off of. So it's a perfect setting for Uncharted: The Lost Legacy he said. Game director Kurt, friend of the show, is also quoted in the story teasing that in terms of gameplay you should expect something different than Uncharted 4. Quote, I would say we're going a little more wide this time. I don't want to give too much away. But it's something we're really excited about on the gameplay side. This kind of contrast of an urban setting and a rural setting, a tighter experience and more open experience. He added that",
            "start": 1612.56
        },
        {
            "text": "Away. But it's something we're really excited about on the gameplay side. This kind of contrast of an urban setting and a rural setting, a tighter experience and more open experience. He added that Naughty Dog originally thought The Lost Legacy would be a DLC expansion for Uncharted 4 instead of a standalone game. The Lost Legacy launches in 2017 for PlayStation 4. Watch the extended demo here at Bump A Block PlayStation Experience. I'm excited Colin. Yeah, I'm looking forward to it. I don't really care anymore about it until it's in my hands. I don't need to read about it or watch any more videos and whatnot. It was just interesting to finally get some news after PSX we hadn't heard anything about it. I like the idea that it will be a bit different in terms of tone and stuff like that. Because it seems like just from that little bit, it seemed more espionage-esque. Right? Of like how you're going to be doing. Not what Nate was doing in Uncharted 4 for sure. Or Sam for that matter. Maybe",
            "start": 1654.56
        },
        {
            "text": "it seems like just from that little bit it seemed more espionage-esque. Right? Of like how you're going to be doing. Not what Nate was doing in Uncharted 4 for sure. Or Sam for that matter. Maybe a throwback more to Uncharted 3 or whatever. Some of their escapades going in doing stealth work. But we'll see what happens. And I always liked Limbo. Over on Playdead's Twitter, they're teasing a new game. Thanks for your warm reception of Inside since release Playdead founder Arnt Jensen and the team have been working on the next adventure. Looks like we got a man here. It's like an astronaut with a parachute dragging behind him. Some sort of meteor or asteroid or what not. Some collision. Give me a prediction. When are we going to see this game? When? Ummm. I'm going to say it's 2019 probably. I think it will be way quicker than the turnaround from Limbo to Inside for multiple reasons. One is that I think that the reason Limbo...",
            "start": 1692.56
        },
        {
            "text": "I think it will be way quicker than the turnaround from Limbo to Inside for multiple reasons. One is that I think that the reason Limbo... Limbo was a success when it was just on PC. It was just on Xbox 360. And everyone knows that was a great game. But they spent an entirely too much amount of time I think porting and dealing with ports and bringing it everywhere. Which I think was smart because it blew up the game and everyone played it and had it everywhere they were. But I don't think they're going to really have to worry about that this time around. Inside is already out. I don't think it's going to be anywhere else. And I also think, and I'm just speaking frankly I don't know they're a private company. Inside clearly didn't sell nearly as well as Limbo. It wasn't part of the gaming zeitgeist of the year really. I mean a lot of people loved it. I thought it was the best game of last year. But I think that they don't have the monetary cushion they did with Limbo to sit",
            "start": 1737.56
        },
        {
            "text": "the gaming zeitgeist of the year really. I mean a lot of people loved it. I thought it was the best game of last year. But I think that they don't have the monetary cushion they did with Limbo to sit around and take five or six years to make a game. I just don't think that they're going to be able to do that. So I think that there's two things to keep in mind. Sure. With this particular game. Who the hell knows. Do you think that Limbo did well enough to give them that buffer, that cash reserve where it doesn't hurt as much that Inside doesn't do as well? Maybe. I mean I'm sure Inside was still profitable. I mean people played it and I'm sure people bought it. I think their situation is just very different right now than it was out of Limbo. Although I'm sure Limbo is still selling copies and whatnot. But they just seem to take their time. But they also seem to be porting it everywhere. I'm sure they use port houses or some other people to help them. But I just think that showing the",
            "start": 1774.56
        },
        {
            "text": "and whatnot. But they just seem to take their time. But they also seem to be porting it everywhere. I'm sure they use port houses or some other people to help them. But I just think that showing the art this soon indicates to me that they're ready to go. Sure. We want to start stoking the fire and get you excited about it. But they are such a very deliberate team. And that's what makes Inside so good. That I take all the time you need. But I would say two and a half years. I'd say you'd see fall 2019. Okay. Good. Can't wait. Over on Deadline Hollywood, Mike Fleming Jr. says, Shazam to split into two films. Dwayne Johnson to star as Black Adam. We knew about the Black Adam bit but now they're breaking into two films which is interesting. The New Line DC property Shazam has morphed into two pictures. Black Adam has proven vibrant enough to become its own film to star Dwayne \"The Rock\" Johnson. Originally the plan was for him to play the character in Shazam, Which is the tale of a teen boy who can",
            "start": 1810.56
        },
        {
            "text": "Pictures. Black Adam has proven vibrant enough to become its own film to star Dwayne \"The Rock\" Johnson. Originally the plan was for him to play the character in Shazam. Which is the tale of a teen boy who can transform himself into a superhero by speaking the word Shazam. Black Adam is his arch nemesis and a complex anti-hero with a rich history of his own. As the studio began to figure out the movie they realized, why not a twin bill? Johnson, who was excited enough about his meeting last week at the studio to tweet it, has done well with New Line. Most recently teaming with Kevin Hart for Central Intelligence and the global blockbuster San Andreas. He's prepping more stuff. I didn't realize this one. He's prepping the monster destruction picture Rampage. The arcade game that I fucking love. That is New Line's 2008-2018 slate. I'm still heartbroken about this, Kevin. And let me explain why. Is the fact that when they were talking about the Shazam movie, they should have gotten Dwayne Johnson",
            "start": 1847.56
        },
        {
            "text": "Is New Line's 2008-2018 slate. I'm still heartbroken about this, Kevin. And let me explain why. Is the fact that when they were talking about the Shazam movie, they should have gotten Dwayne \"The Rock\" Johnson to be Shazam. He does, I mean, The Rock is so great at being this huge, rough, tough guy that for him to play a superhero who is a five year old, seven year old boy would be awesome. His eyes all wide like he does in Central Intelligence. It would have been perfect. And when they announced him as Black Adam I was like, oh that sucks. Scarpino tries to tell me that the reason they do it, of course, is that they can't afford Dwayne \"The Rock\" Johnson for all these movies. So they want him to come in here and not be the main character, get in, make people go see the movie and then get out. Now he's got his own movie? Now he's going to be in the second movie? When they came out of that conversation with DC and Warner Brothers and had the logo behind him and talked about how great the meeting",
            "start": 1887.56
        },
        {
            "text": "got his own movie? Now he's going to be in the second movie? When they came out of that conversation with DC and Warner Brothers and had the logo behind him and talked about how great the meeting was, I really, really, really, really, really fucking hoped it was going to be, alright, I'm going to be Shazam. I'm going to fucking step up and do this instead of being Black Adam. But he's Black Adam. Which is fine. Cool character. Love Dwayne \"The Rock\" Johnson. Glad to see him in the DC Universe. But if he would have been Shazam Kevin, that would have been fucking awesome. Prediction, this DC movie will not be the DC movie that will turn the ship around for them. I mean by the time they get to this movie, if they haven't turned the ship around they're fucked. This is way too far out for that. The ships are, they've been unmoored and are just drifting around in the bay. Someone needs to grab them and fix them. If Justice League isn't some kind of, alright we're getting on track, will this even happen? I",
            "start": 1931.56
        },
        {
            "text": "they've been unmoored and are just drifting around in the bay. Someone needs to grab them and fix them. If Justice League isn't some kind of, alright we're getting on track, will this even happen? I said it before, I respect the redundancy that a lot of people have heard this, but again I just see these characters from DC's slate, and then you see and hear the characters, Marvel's slate, and it's just, I'm not a Marvel, I like Batman a lot, but it doesn't seem like they're playing even on the same field, you know, like the same level. Just doesn't seem like the... In which way? That Marvel's outclassed him so much? Yeah, like it's just... Well Marvel did it right. Marvel took characters you didn't care about. Iron Man was popular but he wasn't like he is now, and they gave him a movie, that was awesome, and then they made him another movie, that was not as great but still you were happy to see the writing, and then they put him in Avengers and now he fucking matters, and that's how",
            "start": 1963.56
        },
        {
            "text": "that was awesome, and then they made him another movie, that was not as great but still you were happy to see the writing, and then they put him in Avengers and now he fucking matters, and that's how they all did it. But, but, to wit, the characters that you should care about in DC don't even seem that compelling, with the exception of a few of them. Like Aquaman? You know, like his appearance in, I laughed out loud when we saw Batman v Superman, I was like, that's so funny, it's so ridiculous, ridiculous character. Why is he, why are you hovering so long? No one in the editing was like, Zack, why would he hover, he's been kept, he's keeping himself a secret, but he's staring at a camera for 30 seconds? Why didn't he just be eyes, trident, boom, away, that would have been awesome. That would have been a great scene. I digress. There's just... Superheroes in general are corny, I mean that's part of the thing, that's part of what it is. Comic books are corny, yeah. That's not even",
            "start": 2004.56
        },
        {
            "text": "would have been a great scene. I digress. There's just... Superheroes in general are corny, I mean that's part of the thing, that's part of what it is. Comic books are corny, yeah. That's not even really meant in the negative way, that's just what they are, it's the same reason that like JRPGs are corny. There's a corniness level, there's a camp to it, you know? And to me, like, I look at the corniness levels of all of them and I'm like, man, these characters are so fucking corny, you know? Even, and I know people like Wonder Woman and stuff, but I mean when you look at these, I'm like, these characters suck. Like, Batman is so cool, you need more Batman characters, Batman's fucking rad, you know? But then you see the X-Men, you see the Logan trailer, you know, the Spider-Man, Fantastic Four, fantastic formula. Nobody likes Fantastic Four, don't worry about that. I just see a major disparity that I feel like is not going to be corrected. They should just double down on Batman",
            "start": 2048.56
        },
        {
            "text": "Formula, Fantastic Formula. Nobody likes Fantastic Four, don't worry about that. I just see a major disparity that I feel like is not going to be corrected. They should just double down on Batman because he's awesome. I mean, that's what they'd like to do, but Ben Affleck continues to want to make bomb-y fucking shit movies when he should just be making seven Batmen over the course of three years and staying in shape. I don't understand why it's so hard. Let me talk to Geoff Johns, I'll set it all straight. Over on Twitter.com slash PlayStation, PlayStation says, PS4 YouTube app has been updated to enable 360 videos when using PSVR. Find highlighted 360 videos here. That doesn't matter, just a nice little update for PlayStation VR, somebody talking about it and adding in something maybe that should have been there from the start, you'd say. But, similar to Switch, you gotta get out there with your product, I guess, and then start making your changes and stuff like that, whether it's",
            "start": 2085.56
        },
        {
            "text": "that should have been there from the start, you'd say. But, similar to Switch, you gotta get out there with your product, I guess, and then start making your changes and stuff like that, whether it's Netflix, whether it's YouTube 360. But, a nice, as we talk about PlayStation VR so much on PS, I love you, XOXO, and Kinda Funny in general, nice to see an update coming for it. I'm going to jump into tips now. Remember, Nick Scarpino fixed tips this week, finally. The war with PayPal is over. So we're going to start with Big Poop Monster69, who gave us a tip that says, Big Poop Baby. What are those? Are you going to take a big poop? Are you really? Are you taking the big poop because Big Poop Monster69 said Big Poop Baby? Also, look at you wearing a maroon sweatshirt too. Is your zipper open? He's Kevin. He's a walking calamity. Project Octomom Tumbler says, so Greg, you ever slam that big ham hock between your legs into a wicked hot sesh of Cooking Mama? Ooh, son, you know I play them",
            "start": 2124.56
        },
        {
            "text": "He's Kevin. He's a walking calamity. Project Octomom Tumbler says, so Greg, you ever slam that big ham hawk between your legs into a wicked hot sesh of Cooking Mama? Ooh, son, you know I play them Cooking Mama here and there. That's another Switch game we need back. Majesco. Where is fucking Cooking Mama? And I want another Animal Crossing. I feel like Majesco is Cooking Mama, right? And Majesco's gone. So who knows who owns Midnight City - They merged with a medical company or something like that. Did they really? I forgot about that. I remember going to their very sad E3 room a few years ago to play some very sad games. I don't know why anyone made me go do that. My time probably could have been better spent elsewhere. Nephi AZ says, any chance that Nintendo would consider a Netflix-style subscription for their Virtual Console catalog? Would it be profitable? My answer would be no, they won't consider it. That's far too forward thinking of an idea. And would it be profitable?",
            "start": 2177.56
        },
        {
            "text": "Subscription for their Virtual Console catalog? Would it be profitable? My answer would be no, they won't consider it. That's far too forward thinking of an idea. And would it be profitable? There might, there probably might need to be made on that in some way, shape or form. Maybe they might play a certain amount or whatever of a game. Do you think it's a possibility column? No. No, of course not. Hyrule Scribe says, here's my tax to celebrate my Platinum of Skyrim Special Edition. Holy shit, good work. Next up is Final Fantasy XV. Wish I could track my achievements when I 100% Breath of the Wild. No, there's no achievements to track because they won't be in the game. Don't worry about it. DJ Kento says, Bill Maher and HBO bought the ad space on Snapchat's inaugural feed. Every four or five snaps, he's there talking about how Trump needs the other half of us. Could you imagine anyone else doing that? Smart move. Seems like a waste of money. That's a great move. Did you see the ad for",
            "start": 2219.56
        },
        {
            "text": "snaps, he's there talking about how Trump needs the other half of us. Could you imagine anyone else doing that? Smart move. Seems like a waste of money. That's a great move. Did you see the ad for Last Week Tonight? No. Coming back, it's so funny. I'll bring that up and put it on the thing while you're on it. Sure. WinDextatron says, my girlfriend and I broke up today ending a five year relationship. I am 22 and haven't been single since high school. Any tips on what to do next? Take a deep breath. Your world isn't ending. With all due respect, this relationship was never going to last the entire time. You're very, very young and I know that nobody wants to be told that. But a relationship you began in high school wasn't going to carry you through most likely the entire way. So don't worry. Take a deep breath. The world is not ending. Breathe. Go hang out with your friends. Have a drink if you want to do that. Play some games. Chill out. Don't overthink it. It will come to you. Don't",
            "start": 2257.56
        },
        {
            "text": "Take a deep breath. The world is not ending. Breathe. Go hang out with your friends. Have a drink if you want to do that. Play some games. Chill out. Don't overthink it. It will come to you. Don't chase it. It will come to you. You will be okay. DPNE says, where did you get your shirt, Greg? So awesome. Oh, my Buffalo Original chicken wing shirt in the Stranger Things style. This was tweeted at me months ago by a fan in Buffalo, New York. They were doing a fundraiser out there for something or other. So this was a charity shirt that I bought and had shipped out to me. Big fan. Get a lot of comments on it. You should have been following me when I tweeted about it. Blazinghigh420, hey Colin, you have a pretty ass. Can you turn around and show me them big old buns, big boy? I don't like being objectified like that. If I was a woman, would you talk to me like that? I mean Blazinghigh420, he might. If I was a woman, would you talk to me like that? Stop with your reverse sexism. Dismissed.",
            "start": 2302.56
        },
        {
            "text": "objectified like that. If I was a woman, would you talk to me like that? I mean BlazingHigh420, he might. If I was a woman, would you talk to me like that? Stop with your reverse sexism. Dismissed. Got him. Fucking got him. Wait, isn't it just sexism, though? Is sexism... This is the famous argument. If there is such a thing as reverse racism or if it's just racism. That's just racism. Yes, I think maybe, but it's a fun term. I put in a new link that I need you to click on, please. Because of the poop? You look like you're losing weight. It's probably from not eating for the last two days. Oh, you've only not been eating for two days, never mind. You've been counting the calories, so they're at zero right now. Yeah. I'm actually really hungry. So what's hurting right now? Your ribs from coughing? Yeah. But you feel better today. Tim said something funny. Ah, that'll do it. Okay, okay, cool. Prep Colin's next link there. I'll keep going this way. Real Ratic 13 says, Colin and Kev, have",
            "start": 2353.56
        },
        {
            "text": "Yeah. But you feel better today. Tim said something funny. Ah, that'll do it. Okay, okay, cool. Prep Colin's next link there. I'll keep going this way. Real Ratic 13 says, Colin and Kev, have you guys finished Black Mirror season 3? I finished the episode about games. It was great until the very end. Also, why do you hate the white bear ending, Colin? I don't want to talk about it with that, because I'll ruin it. The white bear ending... Which one's white bear? That's the one with the prisoner. Ah, okay. Which they ruined at the end. The video game one is by far the worst one. This was a disappointing thing. There's two episodes left in season 3 that I've not watched. Me too. But everyone's like, oh, you've got to watch the one about VR and all that kind of stuff. That is, with the exception of maybe the Waldo episode, the fucking worst episode of Black Mirror. It's not even good. Everyone, just because video games is involved, everyone's like, oh, it's great. This episode sucks.",
            "start": 2405.56
        },
        {
            "text": "of maybe the Waldo episode, the fucking worst episode of Black Mirror. It's not even good. Everyone, just because video games is involved, everyone's like, oh, it's great. This episode sucks. It was really disappointing. I was super disappointed, because I think I might have told the story, but Erin's cousin, we were watching it, and she's like, I've never seen Black Mirror. I'm like, Kate. And I was like, oh, well, we're going to watch this next episode. We haven't seen it yet, so we all watch it. And I was so disappointed. I'm like, that episode is not indicative of how good this show is. And so, yeah. Are you prepared to show the last week tonight, Tim? Yeah. Let's do it. Oh, wait, wait, I'm unplugged. Can you help me here? Okay. All right. Yep. In 2017, HBO's biggest Sunday night show returns. Oh, wait. Oh, I'm sorry. You meant… Yeah, not you. Yeah, it's just I heard your voice, and I assumed… I said biggest. You did. 2017 also brings you the much-awaited fourth season of HBO's",
            "start": 2448.56
        },
        {
            "text": "returns. Oh, wait. Oh, I'm sorry. You meant… Yeah, not you. Yeah, it's just I heard your voice, and I assumed… I said biggest. You did. 2017 also brings you the much-awaited fourth season of HBO's smash hit comedy Veep. Oh, again. I thought you were talking about a different show. He said hit comedy. I hear that now. At best, you're an acquired taste. You have made your point. Sometimes we don't want a British man yelling at us about how the world is ending for a whole hour. Well, it's a half an hour show. Doesn't feel like it. And finally, it's the long-awaited return of the HBO show everyone's been waiting for. Oh, no. Oh, you thought that applied to you? Yeah, I did, because we've been off for a while. Well, you know, five years. Yeah, why have you been off for five years? I've been busy, okay? What have you been doing? Things. I love how he's eating a popsicle. Tonight with John Oliver. Don't even think about it. That's great. I think I'd be really great at it. Good on John Oliver. I",
            "start": 2506.56
        },
        {
            "text": "Okay, what have you been doing? Things. I love how he's eating a popsicle. Tonight with John Oliver. Don't even think about it. That's great. I think I'd be really great at it. Good on John Oliver. I always loved him on The Daily Show. When he branched off to do this thing, Last Week Tonight, I was like, we'll see what happens. And I'm glad to see it's found an audience. I enjoy it. It's funny. This is really the first time we've seen Larry David, like, from season nine, ten? Of Curb Your Enthusiasm. For five years. Season nine, right? Those are the last seasons. Oh, one, two, three, five, seven, nine, eleven, yeah, nine. I was just counting the years. For some reason I know the years, but I don't know the actual... Audrey gave us a tip and said, Greg, where'd you get that shirt? I need my life. Sorry that you wasted your money. Charity thing. Should have been following me on Twitter. Prince of Persia says, is it possible that finishing The Last Guardian and Gravity Rush",
            "start": 2567.56
        },
        {
            "text": "Need my life. Sorry that you wasted your money. Charity thing. Should have been following me on Twitter. Prince of the Universe says, \"Is it possible that finishing The Last Guardian and Gravity Rush sequel were legitimately just kind gestures to fans, or were both endeavors just risky, wishful thinking on the part of Sony?\" Um... Is it possible? They were kind gestures, or were they both just endeavors? Wishful thinking on the part of Sony. I mean, you had to finish The Last Guardian. That had come too long, and been too long. And then Gravity Rush, I think, there's an audience for it. Not huge. If you set your sales expectations and your budget correctly, then you'll be alright. Sony wouldn't make anything without wanting to make money on it. Exactly. It isn't a charity, they're not worried that much about their... They couldn't give a fuck less about anything but money. They're a corporation. Mark from the Red says, Colin, what are your thoughts on jury duty? I understand that there's a",
            "start": 2613.56
        },
        {
            "text": "much about their... They couldn't give a fuck less about anything but money. They're a corporation. Mark from the Red says, Colin, what are your thoughts on jury duty? I understand that there's a certain amount of civic duty involved, but I hate the idea of being forced to do something I don't want to do. Uh, it's essential. Um... This might be redundant to people who have watched this for a long time. Jury duty is very important. It is a unique... It's a unique institution that not everyone in the world gets to enjoy. In some parts of the world, you're tried by the state with no jury of your peers, and they just... It can be a kangaroo court and they can just fucking throw you away or execute you or whatever, and those things happen. The fact that we are tried by a group of people from society is an amazing thing, and I'll say this. Yes, no one wants to go to jury duty. I was on a jury once when I was in college, and it's annoying. You were a foreman, right? Yeah, I was the foreman",
            "start": 2658.56
        },
        {
            "text": "society is an amazing thing, and I'll say this. Yes, no one wants to go to jury duty. I was on a jury once when I was in college, and it's annoying. You were a foreman, right? Yeah, I was the foreman of the jury. And it's an obnoxious disruption in your life. And no one understands that, but if you ever want... If you're ever in trouble, and you did something or you needed someone in a civil case or a criminal case, you better fucking hope those 12 people in that box want to be there. So try to give them the respect of you wanting to be there as well. This is something that is going to happen to you. You're going to serve on a jury one, two, three times at the most in your life. I've been to jury duty several times, and they're just like, get the fuck out of here. In California, you call a little number. Yeah, I call in. I've called in every time and never ever been called or picked. You want to go in with an open mind, because if you ever needed someone, man, you better hope that",
            "start": 2695.56
        },
        {
            "text": "a little number. Yeah, I call in. I've called in every time and never ever been called or picked. You want to go in with an open mind, because if you ever needed someone, man, you better hope that they went in with an open mind. You don't want somebody to tap on their foot, look at their watch, like, let's just get this fucking over with. Try to project those kinds of positive things in your experience, and then, God forbid you ever need that, man. Yeah, exactly. You want everyone being like, I don't want to be here making excuses to get out of it. Not reading the paperwork, not paying attention to the testimony, all this dumb shit. Not okay. You gotta pay for it. Adamstar211 says, here's my tax for obtaining the Mad Max: Platinum. Greg, did Philip DeFranco ever get back to you? Thanks, Hale Colin. Me and Phil traded messages, but there's nothing locked down. I'll keep you posted. And then, final tip for right now, Horace1996 says, hey Greg and Colin, greetings from Belgium. I wanted",
            "start": 2733.56
        },
        {
            "text": "Colin. Me and Phil traded messages, but there's nothing locked down. I'll keep you posted. And then, final tip for right now, Horace1996 says, hey Greg and Colin, greetings from Belgium. I wanted to ask if it's worth it to buy VR for Resident Evil 7. Love you, keep up the good work. Of course, we can't talk about Resident Evil 7 if me had or had not played it, so we would have to wait until the review embargo lifts to tell you anything about that. But look at VR and decide if the library is enough for you to buy it. You shouldn't buy any piece of hardware for one game. Like the Switch, for instance. You have to look at the library and decide, is there enough things to play there? You can kill this one, Kev. Rich Hurts says, maybe I'll just not be a dick and commit crimes. Rich, that's a really moronic thing to say. What if you invested money in someone and they ran away with $15,000 or $20,000 of your money? You didn't commit a crime. I guess you're still gonna need a jury to get that",
            "start": 2759.56
        },
        {
            "text": "moronic thing to say. What if you invested money in someone and they ran away with $15,000 or $20,000 of your money? You didn't commit a crime. I guess you're still gonna need a jury to get that money back, though, right? Like, that's a pretty short-sighted and ignorant thing to say about jury duty. Most of the cases that go through courts are not criminal. They're civil. You gonna run? I think you should maybe not be here. If you get me sick, I'm gonna be very upset. You'd be past contagious by now. Did you put up the next story? I can't tell. No, I didn't. There's a PSN flash sale. A lot of games are under $5. There are games for PS4, PS3, Vita, and this is from, I'm reading Chris Pereira's story over on GameSpot. Including the sale, PS4 has the Y selection with $5 in Avenue, Sleeping Dogs, Definitive Edition, Bastion, Journey, Nidhogg, Injustice: Gods Among Us Ultimate Edition, Knack, or Tomb Raider, Definitive Edition, among others. Drop down to $4 and you can pick up Goat",
            "start": 2800.56
        },
        {
            "text": "Dogs, Definitive Edition, Bastion, Journey, Nidhogg, Injustice, Gods Among Us, Ultimate Edition, Knack, or Tomb Raider, Definitive Edition, among others. Drop down to $4 and you can pick up Goat Simulator, Psychonauts, or Risk of Rain. You'll also find a few PS2 on PS4 games for sale. If spending $10 to $15 on slightly updated PS2 feels like what you want to do, you can get Rogue Galaxy for $5, Star Wars Bounty Hunter for $4. Over on PS3 you have sales that include Street Fighter, Devil May Cry, Battlefield 4, Shadow of the Colossus, and then you can pick up right now, Colin Castlevania: Symphony of the Night for $4. It's a good deal. I paid $50 for it in 1998. You could have waited. No, 1997. Did you ever think about waiting? No. Couldn't wait. Saw it, had to have it. Kevin, can you bring up the trailer? Have you seen this guy? Yeah, I like it. I'm looking forward to this movie. This is the Colossal trailer with Anne Hathaway. Looks like an interesting take on a monster movie. I",
            "start": 2849.56
        },
        {
            "text": "Bring up the trailer? Have you seen this guy? Yeah, I like it. I'm looking forward to this movie. This is the Colossal trailer with Anne Hathaway. Looks like an interesting take on a monster movie. I thought we'd watch it together. Best friends. I just looked at the news and I think I'm in shock. A giant monster just materialized over Seoul. That happened like nine hours ago. You were just hearing about this. What have you been doing all day? You ever notice how it just keeps destroying everything in its path but it never looks down? It's like it's being operated by remote control. Gloria, you've got to see this. It's dancing. Is dancing like? Holy sh- Interesting teaser. I like Anne Hathaway. I like Jason Sudeikis. That guy from the Soggy Bottom Boys. I like him alright too. And finally, to toss up there. Our good friend Hunter Pence, who helped us launch Kinda Funny, is nominated for the Shorty Awards. If you wouldn't mind, it'd be great if you could go over to the Shorty Awards and give",
            "start": 2895.56
        },
        {
            "text": "to toss up there. Our good friend Hunter Pence, who helped us launch Kinda Funny, is nominated for the Shorty Awards. If you wouldn't mind, it'd be great for you to go over to the Shorty Awards and give a vote there for Hunter Pence. He's a good dude; he takes care of us. We want to take care of him. He's one of our best friends. He also did that Injustice Let's Play with us a long time ago. He's done a bunch of other stuff for us. Right, Kev? Yup. Thanks, Kev. He gave you my Injustice shirt. He gave you the Injustice shirt - cool, Greg? Wow. Look at that. Hunter Pence, man of the people. Come over here and show this Hunter Pence shirt. So you're telling me at some point Hunter Pence touched this shirt. Well, he almost took it all off. Here comes Cool Greg. Everybody model a shirt that Hunter Pence gave him when he went to do the Injustice stuff. There it is. This is an Injustice 2 shirt. I love Cool Greg. Cool Greg is my favorite. You missed the biggest piece of gaming news. Lay it on me. I put it",
            "start": 2976.56
        },
        {
            "text": "him when he went to do the Injustice stuff. There it is. This is an Injustice 2 shirt. I love GameOverGreggy. GameOverGreggy is my favorite. You missed the biggest piece of gaming news. Lay it on me. I put it in the document. MPDs came out for the month, for last month and for the entire year of 2016. Kev you can just scroll down. I don't know if you saw these. I tweeted them out yesterday. I saw you tweet them in. But for software for December, Infinite Warfare obviously won. This is I think, I don't want to mistake it, I think it's nine years in a row in December that Call of Duty is the best selling game in the United States. Final Fantasy XV number 2. Battlefield 1 number 3. I saw Watch Dogs at number 6 there. Pokemon Sun and Moon were separated, separate SKUs and no digital sales counted. That would be way higher if they were combined and they probably should be. As you can see The Last Guardian did not chart. Which is predictable. Of course. There's no Titanfall 2 there either or anything",
            "start": 3016.56
        },
        {
            "text": "would be way higher if they were combined and they probably should be. As you can see The Last Guardian did not chart. Which is predictable. Of course. There's no Titanfall 2 there either or anything like that. Some favorites being pushed away by some perennials like Grand Theft Auto. What are you reading into Watch Dogs 2? Also notice what's missing on this list for the first time in a very, very long time. No Grand Theft Auto V? No Grand Theft Auto V is on there. Look harder. It's too small. Look harder. Call of Duty. Oh Minecraft? I think this might be the first time Minecraft hasn't been on the list in years. It'll be back. I guarantee when these new releases fall off. I'd have to go back and consult. What's the big takeaway from Watch Dogs 1 on its way on there then? Probably a price reduction as well. Word of mouth? Because they're talking about units not gross revenue. Yeah, I think word of mouth has probably been strong. Although I'm still confused because you're the only person",
            "start": 3063.56
        },
        {
            "text": "As well, word of mouth? Because they're talking about units not gross revenue. Yeah, I think word of mouth has probably been strong. Although I'm still confused because you're the only person I really ever saw talk about it. That's very anecdotal. Sure, of course. There's obviously a lot of people out there that have played it and enjoyed it. I get tweets all the time now from people saying they started and they thanked me for the recommendation or whatever. So yeah, no Minecraft on there I think is the big takeaway. Final Fantasy XV. So the interesting thing about Final Fantasy XV, MPD started tracking statistics in the mid 90s, 1995. Final Fantasy XV had the strongest launch for the series since at least '95, perhaps ever. Probably ever. They can't say with definitive certainty in the United States. I think 18% over Final Fantasy XIII's month 1 sales. So good trending for Final Fantasy XV. Short I think of their, at least right now of their, they're very bullish. I think they want to",
            "start": 3101.56
        },
        {
            "text": "States. I think 18% over Final Fantasy XIII's month 1 sales. So good trending for Final Fantasy XV. Short I think of their, at least right now of their, they're very bullish. I think they want to sell 10 or 12 million of these and they're about halfway there. But still very strong sales for Final Fantasy XV. And what's interesting about XV specifically is that it seemed to have sold softly in Japan. And so Final Fantasy has officially become I think now as we go through the looking glass a Western IP. Interesting. All the otakus over here taking it on. I think similar to VII it's crossed the mainstream barrier again. I don't think you've had a, Final Fantasy is always sold appreciably but I don't think you've had a mainstream Final Fantasy game since 1997. And I think that XV is that mainstream Final Fantasy game. Gotcha. If you didn't know ladies and gentlemen this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv slash Kinda Funny Games. We come to you with",
            "start": 3140.56
        },
        {
            "text": "Final Fantasy game. Gotcha. If you didn't know ladies and gentlemen this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv slash KindaFunnyGames. We come to you with all the nerdy news you need to know about before jumping to the chat to answer your questions, comments and concerns. But in between those two segments I reach into my computer, grab a code and throw it to one of you. I give away a video game every day here and all you need to do is be in the chat. But if you want more chances to win it's simple. You can subscribe to us on Twitch which gets you the Kinda Funny logo next to your name. The private emotes. You get to talk to us privately each and every day. You also one day I'll play multiplayer games with us probably. And you get the show ad free but most importantly you get to enter it into the chance to win the game without actually having to be here. You can go do whatever it is you do everyday. Also you can support us for two dollars or more on",
            "start": 3188.56
        },
        {
            "text": "importantly, you get to enter it into the chance to win the game without actually having to be here. You can go do whatever it is you do every day. Also, you can support us for two dollars or more on Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames. And then the random number generator picks everything up. Kevin, are they seeing this right now? We're watching a game. Of course, Xbox has been great to us, giving us a whole bunch of games to give away to you. Today we're starting our run of Rise and Shine. You might remember I got a poncho from Adult Swim. With no information about the game, this is the game it turns out. Looks kinda cool. Jumping around, shooting shit, why not? So we're giving away a Rise and Shine code. Random number generator says it's going to a subscriber on Twitch. Random number generator says it's going to LethalSilicon. You get Rise and Shine on the Xbox One. Thank you for the clap. Thank you very much for the clap over there, Kev. That's big. That's",
            "start": 3221.56
        },
        {
            "text": "Twitch. Random number generator says it's going to LethalSilicon. You get Rise and Shine on the Xbox One. Thank you for the clap. Thank you very much for the clap over there Kevin. That's big. That's big. It does right? It looks cool. Adult Swim. Adult Swim doing interesting stuff with the games. They just came out and they were like hey we're gonna make games. Alright cool we're gonna do them all about your shows and stuff and then they started making original stuff. Alright go for it. I don't think they're great with the video game marketing yet. Here's a poncho with no information. Remember we got that tape recorder? I was like alright well. I still have that. I'm good. You using it? You making little talkboy videos like Home Alone 2? It doesn't record. I use it for FM radio to annoy Tim. You're still listening to terrestrial radio huh? Also you're eating Tostitos or something? Yep. Are these the ones they mailed us forever ago? Yep. It's been cold at home. I've been wearing those",
            "start": 3254.56
        },
        {
            "text": "You're still listening to terrestrial radio, huh? Also, you're eating Tostitos or something? Yep. Are these the ones they mailed us forever ago? Yep. It's been cold at home. I've been wearing those big old Tostitos pants I got. How are these pizza rolls going down again? They're really good. They're really good. There's like some nacho cheese ones and some pizza ones. Wow. That's what I needed. What do you want to do for lunch? Beeps? Beeps. Alright, let's see how the beeps order is going. Beep beeps! Hey Tim Gettys and Cool Greg. What's up, man? Do you want beeps? I'm okay. Yeah. Okay, thank you. What the hell is happening? This is the beeps order of music. I don't think it is. I'm surprised you didn't know this. You say you're a fan. So much louder than I want it to be. At least Colin's happy. You said at least Colin's happy. I wouldn't go that far. Oh! Quick aside. Thank you so much for watching Colin Was Right. That came out yesterday. It's already on pace to be I think the biggest episode of",
            "start": 3302.56
        },
        {
            "text": "at least Colin's happy. I wouldn't go that far. Oh! Quick aside. Thank you so much for watching Colin Was Right. That came out yesterday. It's already on pace to be I think the biggest episode of the show and should be our biggest piece of Switch content when it all settles with the exception of the post-show thing. Which is awesome and I really appreciate it. Keep circulating it. Thank you so much for your patience as I talked about Nintendo for two shows. So now that you've baked on it in the evening in a day, 24 hours, are you going to go do the Shovel Knight thing? I've got to still reach out to them to see if I can fit into another thing. We'll have to see. Okay. I think you should. But I appreciate your guys' support of the show. I really do. It's been fun and it's really lit a fire under my ass. It's reminded me of a great deal of what I enjoyed most about being in this industry. Which is taking the time to think about things and write about them and deliver some I think",
            "start": 3356.56
        },
        {
            "text": "a fire under my ass. It's reminded me of a great deal of what I enjoyed most about being in this industry. Which is taking the time to think about things and write about them and deliver some I think hopefully thought-provoking content. So I appreciate it. Back to the tips while Colin orders his beeps. DJ Khaled gave us two tips in a row here. The first one says please try to have Kumail Nanjiani on there and his wife Emily V. Gordon on. They used to have a gaming podcast, The Indoor Kids, but they haven't hosted in forever because of their shows. Please bring them on. Here's the problem DJ Khaled. I know Kumail and I know Emily and we were negotiating years ago when we were still in the spare bedroom before we left IGN to have them on and Southwest canceled their flight. We're going to have an Indoor Kids Kinda Funny crossover podcast. Southwest canceled their flight when they were coming up for Sketchfest and that never happened and then Kumail got huge. And I doubt seeing as how they",
            "start": 3417.56
        },
        {
            "text": "indoor kids kind of funny crossover podcast. Southwest canceled their flight when they were coming up for Sketchfest and that never happened and then Kumail Nanjiani got huge. And I doubt seeing as how they don't have time for their show if they're going to have time to come up and be on our shows, but we will continue to try. Don't worry. And then the second one from DJ Khaled was the director of Colossal helped me and the owner of CEO of the Alamo Drafthouse while in a human centipede on the red carpet of the Fantastic Fest Film Festival in Austin. I clicked the link. It's just them doing the human centipede thing. I don't know. I'm sorry DJ Khaled. I don't know. I don't know. Stevens underscore says, for those asking, the shirt Greg's wearing was from 26shirts.com. I'm one of the artists for them. Speaking of wings, used your recipe last night and my stomach loved them as much as my butt hole. Nice. Thank you. He says thanks to me. So 26shirts.com is where I got this. Unaware if it is still",
            "start": 3460.56
        },
        {
            "text": "Speaking of wings, used your recipe last night and my stomach loved them as much as my butt hole. Nice. Thank you. He says thanks to me. So 26shirts.com is where I got this. Unaware if it is still up. 26shirts.com. Waffle Socks says, greetings from Newfoundland. We're due for a blizzard this weekend. Upwards of 19 inches of snow. Any recommendations for games that can be completed in the weekend while we hide from the snow? I mean lots of games can be completed. Gravity Rush 2 is out now. That's fun. Try that. Yeah, you can complete it in the weekend. Song of the Deep, I like that weekend. Ratchet and Clank, that's a good cozy. I'm going to get cozy and have a throwback old school game thing. I'm enjoying 2064: Read Only Memories right now. I should pound that out this weekend when I actually have time to play games again. Those are my suggestions. Colin, you got a good weekend game? Hue. Yeah, really good pick. I did that a lot when I was in the cold winter up there in Quebec. And",
            "start": 3498.56
        },
        {
            "text": "have time to play games again. Those are my suggestions. Colin Moriarty, you got a good weekend game? Hue. Yeah, really good pick. I did that a lot when I was in the cold winter up there in Quebec. And final tip of the day and the week goes to Marco Kazama. Colin, thoughts on the Women's March? You seem against protest for the most part. Do you feel it is not beneficial? You seem to be the type that would be on the streets. I'm not against protesting. That's obviously your first amendment right. I know a lot of people that I went to college with, friends of mine, whatever, that are going to various marches in Washington and around the country. No, I'm not against it in principle. I just don't think that 9 out of 10 times they don't do anything. The last time there was a major massive protest that actually affected real change was 50 years ago. So it's, and that was for a powerful and important thing, civil rights. And so you have to be organized. You have to stay on the streets. You have to",
            "start": 3541.56
        },
        {
            "text": "actually affected real change was 50 years ago. So it's, and that was for a powerful and important thing, civil rights. And so you have to be organized. You have to stay on the streets. You have to have good messengers. Not for nothing. There are no Martin Luther King Jr. type people running around today that have that kind of air about them, that have that kind of respect about them, that have that kind of uplifting message for all people. So mostly, most of the time in the 21st century, protests evolve into violence. They evolve into looting. They evolve into stupid shit that counteracts what your goal is, which is why I think you have to be very careful. Look at Occupy Wall Street for instance. We were there. We saw it with our own two eyes in New York City that year. We were there for Comic Con. That helped nothing. That actually hurt the message. That actually made Obama's path to reelection more difficult. That gave conservatives fodder to attack people, to call them jobless, to",
            "start": 3581.56
        },
        {
            "text": "Comic Con. That helped nothing. That actually hurt the message. That actually made Obama's path to reelection more difficult. That gave conservatives fodder to attack people, to call them jobless, to call them hypocrites, to call them all those kinds of things. You have to be very careful about the reasons you go on the street, how you organize and all those kinds of things. And so do what you want. Be on the street every day if you want. But I can think of a million different protests that were out there that really affected no change at all. It makes you feel good. It's catharsis and I get it. Into the chat, Josh Graf says, Have they talked about Obsidian possibly teasing Fallout New Vegas in the past two days or did I just miss it at some point? No Josh, you haven't missed it. I looked into it yesterday. It's just that image of Obsidian teasing a game. We don't know what it is. Until there's more information about it, I didn't want to go into like, here's this thing. I don't",
            "start": 3632.56
        },
        {
            "text": "looked into it yesterday. It's just that image of Obsidian teasing a game. We don't know what it is. Until there's more information about it, I didn't want to go into like, here's this thing. I don't think it's going to be Fallout New Vegas. It'd be awesome if it was, but we'll see. Colin, do you think it's going to be Fallout New Orleans? I'm sorry? No. RadRigay05 says, Greg, what would DC have to do to bring you back into loving their properties again? I love DC properties more than anyone in this building. So don't worry about it. I never left. I'm the one over there on DC Island waving a flag saying, all is well. It's not that bad. And real quick, people were saying the Dakota Access Pipeline protest worked. You really think that's going to stick with this new administration? I want to be clear about what you guys are saying. You think that the Dakota Access Pipeline is just going to be, like that whole initiative is not going to be re-approached in the next year or two? I just don't understand",
            "start": 3669.56
        },
        {
            "text": "about what you guys are saying. You think that the Dakota Pipeline is just going to be, like that whole initiative is not going to be re-approached in the next year or two? I just don't understand that particular argument. Pressed? Pre-stoyed, I'll say. Just curious on your guys' thoughts about gaming while intoxicated. I know you guys don't partake in the dank muggs of nuggets, but how do you feel about drunk gaming? I feel like I haven't heard you guys discuss that much before. Thanks for the great shows. I don't like drinking and gaming. I mean getting drunk and playing video games. Because then I wake up and I can't remember where I am in the story or what was happening or what's going on. It's just like, well, alright, that was a waste of time. I lost part of the game. I like to be immersed in my games as much as possible. But I mean, for a party game it's great. For Smash Bros it's good. For TowerFall it's good. Cart, good. Yeah, I don't know anything about those nuggets. Kev, give",
            "start": 3709.56
        },
        {
            "text": "in my games as much as possible. But I mean, for a party game it's great. For Smash Bros it's good. For TowerFall Ascension it's good. CartRider is good. Yeah, I don't know anything about those Yarn of Nugs. Kev, give me my one real quick. Give me my one real quick. You gotta make the beeps happen. You don't sound right. You look like you're dying. Alright, beep's over. No, I don't know anything about those dank Yarn of Nugs. Why did you ask for the one but you look at the TV? Look at the camera. Because I'm wondering why my reflection, why it's the same problem I was having when Colin was right there. No, no, that's not what I'm talking about. My glasses. Yeah, I know. I'm trying to see where the reflection's coming from. Because if I go too high, this was something I was watching. I have to stay like this. But even then there's a reflection. This is the reflection on that, isn't it? Look down again. Not that severe. But I think because I'm seeing it in the glasses, I'm seeing the box. But",
            "start": 3747.56
        },
        {
            "text": "like this. But even then there's a reflection. This is the reflection on that, isn't it? Look down again. Not that severe. But I think because I'm seeing it in the glasses, I'm seeing the box. But also to kill the reflection, you turn off both TVs. You don't need the monitors. Yeah, I was going to say you don't need a comforter. Oh, that's not what I'm talking about. I'm talking about the... When you go all the way up? Yeah, when you look straight up. Oh yeah, sure. When you look straight up you get the lights. When I'm in the center, watch Colin was right. It's just something I noticed. I don't care. That's why I was looking at the TV. Thank you. Oh, if you care we can fix it. I mean... But you have to care. It's not really that important. You know, there were certain things we were worried about with the show, right? Like we talked about with the show. We don't want to make it too long. We got to do this and that. All these complaints ended up being for naught. People want them to",
            "start": 3806.56
        },
        {
            "text": "about with the show, right? Like we talked about with the show. We don't want to make it too long. We got to do this and that. All these complaints ended up being for naught. People want them to be long. No one cares about the glare in the glasses. No one cares. It's kind of nice. Right Tim Gettys 32 in the chat says, Colin, have you ever considered getting laser eye surgery? Me and my wife both got it. Best thing we've ever done. No, I have 20-20 vision actually. Me and my wife got it. Best thing we've ever done. Not getting married? Laser eye surgery. Alright, cool. Whatever floats your boat, son. I don't know if you have an answer, but we'll try. Generic Stew says, Hey Colin or Greg, did Tim Gettys ever talk about the Breath of the Wild controls if they were able to be inverted? I haven't heard anything about it since Colin mentioned it months ago. Hey Tim! I mean he didn't attempt to invert them. He knows how to play right now. I looked just for Colin and it was not. No inversion. No way to",
            "start": 3845.56
        },
        {
            "text": "about it since Colin mentioned it months ago. Hey Tim! I mean he didn't attempt to invert them. He knows how to play right now. I looked just for Colin and it was not. No inversion. No way to invert anything. But there was a whole menu that we just didn't have access to. But there was a menu that looked like where it would be. The first game released ever. Finally. Finally. That would be fucking awesome if they released that game and wouldn't let you invert it. Just 10% of their gamer base just gone. Is it only 10%? Yeah. Ah, some of them would convert. Anime Warlocks says, Hey Greg, what are your thoughts on a live action Young Justice slash Teen Titans show? Don't bother. We got a lot of good shows happening. We're getting Teen Titans back. I'm sorry, we're getting Young Justice back. We're fine. We're in sub only mode now. Justin Ryanbears says, God if there's no inversion I won't be able to play. I wouldn't be able to play either. I mean that was part of the reason why we had E3",
            "start": 3889.56
        },
        {
            "text": "We're fine. We're in sub only mode now. Justin Robergs says, God if there's no inversion I won't be able to play. I wouldn't be able to play either. I mean that was part of the reason why we had E3 last year when I went hands on with it. They were looking at me like, I'm weird. You guys understand you made a demo with no inversion. I've been in this industry a very long time. You guys are the weird ones, not me. You know? Because it's a great Colin tradition to invert the game and then walk away from the kiosk and then watch the next person play. Yeah, fuck everybody up. I mean that's a great, long standing Colin E3 tradition. Those days are marked. Two guys, one tank says, Greg I just bought a house in unincorporated Glen Ellyn. When can I hang out with Jamie Kennedy? Big ol' Jamie Kennedy of course. Congratulations on buying a house in unincorporated Glen Ellyn. I'd love to know where it is if you want to chime back in with street addresses.",
            "start": 3931.56
        },
        {
            "text": "of course. Congratulations on buying a house in unincorporated Glen Ellyn. I'd love to know where it is if you want to chime back in with street addresses. Big ol' Jamie Kennedy doesn't live in unincorporated Glen Ellyn anymore so just hang out and buy random Portillo's. She'll eventually show up. With me. Cherish the love we have. We should cherish the love we leave. Oh, cherish the love. We're gonna get a copyright strike for that. Because you're nailing it. You're just too close. Oh 53 in Butterfield. I know where you are. You're like south of where I grew up. But yeah, I know where you are. Oh, I'll tell, so these are all in the works right now but just a little glimpse into GDC. I've been working behind the scenes to get a few interesting people to talk to and we wanna, I wanna do one on one interviews with certain people. Our friend Jason Schreier's in. Oh nice. Talk about the state of games journalism. Adam Boyer. Good. Wants to come and talk to me about digital storefronts. So",
            "start": 3973.56
        },
        {
            "text": "one on one interviews with certain people. Our friend Jason Trier's in. Oh nice. Talk about the state of games journalism. Adam Boyes. Good. Wants to come and talk to me about digital storefronts. So we have a couple, and we have a few, a couple other people in the works as well. Reach out to Jim Sterling to see if he's gonna be around. Nice. I love Jim. To see if that's a possibility. I'm trying to think, I'm forgetting someone. I am definitely forgetting somebody. Let me think here. Let me think carefully. Oh, Jeremy Parish. Oh. Is gonna come in and do something with us I think. So that'll be fun. About old school games and retro gaming. So we have, I have a good little gamut of interviewees and I think that I wanna label them all Colin was right somehow but do like a Colin was right conversation. A conversation with Colin Moriarty was right. Okay. Something funny that we can do. Like that. Like that. Yeah. The questions have faded. It's over. This is the Kinda Funny Morning Show. Every",
            "start": 4024.56
        },
        {
            "text": "Conversation with Colin was right. Okay, something funny that we can do, like that. Like that. Yeah. The questions have faded. It's over. This is the Kinda Funny Morning Show. Every weekday at 11 AM Pacific time here on Twitch.tv/KindaFunnyGames. We're coming to you with nerdy news you need to know about. Jump in the comments if you're concerned. We cut off the tips, but of course you didn't listen. The final one comes from Justin Ryan Bear. He says, recently my father passed away. I inherited some money so I'm now going to PAX to see you guys. Until I read the what... dot dot dot. Until I read the will and saw that he left everything to bongos. You knew it was gonna be a bongo one there? Yeah. It's funny because I was as I was listening to it, I was like, oh man, I've really been desensitized to these things. And then there it was. And there it is. At the end, I was like nope, there it is. Yep. Piece of shit. If I read your name, you are a sub or a resub and we love",
            "start": 4080.56
        },
        {
            "text": "really been desensitized to these things. And then there it was. And there it is. At the end I was like nope there it is. Yep. Piece of shit. If I read your name you are a sub or a resub and we love and appreciate your support. We have Luminea Teps4. Uber Zong Longman. Indie Lion. PDXfresh. Babs Moon. AnF0012. Row 101. That guy named Joey G. I say we play Colin's inevitable inauguration music with bongos. Kyle Guy. Calling Dr. Dame. Mr. Straightfire. I was trying to see if it was Mrs. Something else. Proud to use Amazon Prime for you guys. Thank you. Butt Monkey. Loopy Tomb. Champ4k. Keep making great content. We will. 2MG1013. Giggity. Reanal. Karoogie0923. FrankenPanda. Patterson48. Monkey. FU. MB or EMB416. NWingman. Supervisor. Mr. Boo 1984. Woo. Guys it's almost Royal Rumble time. Who is gonna win? Let's go Styles. Hashtag beat up John Cena. We're gonna pull for Xavier Woods. Angel. Boogalari. I love you guys. You boy Angel from College Point Queens. Waffle",
            "start": 4136.56
        },
        {
            "text": "Royal Rumble time. Who is gonna win? Let's go Styles. Hashtag beat up John Cena. We're gonna pull for Xavier Woods. Angel. Boogaloo. I love you guys. You boy, Angel from College Point, Queens. Waffle Fries. Kinda funny as life. NOnline Earpeak78. JR Oliver. Opinions on Nintendo ceding the crown of couch multiplayer to their competitors by making the Switch, a one-person handheld console instead of a family gaming machine that's known for being made by Nintendo. It wasn't selling units before. King franchise88. TheIndyBoy. Thank you for the amazing content and your kindness at Kinda Funny Live. 2MarkFreeman. Anytime. Loyalty. jubjub388. Bongos. Thanks for the entertainment guys. Davis0141. Xtao84. The Juicy Dangler. Jesus. CrazyDomtar. You guys need to come to Kansas City. Zeel999. Zisakudet. Or Zisuzukadet. Zuzu? Zuzuzu. Zubi Zubi Zuuuuuuuuu. ProTally's Channel. AdamNorthwest. GoDunder. Almost got the Final Fantasy XV Platinum. Gotta go fishing huh? AdamMantoys. That was holding",
            "start": 4202.56
        },
        {
            "text": "Or Zosuzukadet. Zosu? Zosuzu. Zubi Zubi Zuuuuuuuuu. ProTally's Channel. Adam Northwest. GoDunder. Almost got the Final Fantasy XV Platinum. Gotta go fishing huh? Adam Mantoys. That was holding me up? That's punting me twice unfortunately. CrayTray1310. Hey thanks for 20 months of fun and yucks. Bgedwar2. Only certain death. I'm sorry you have a bad butthole Colin. My girlfriend also has a bad butthole. No gluten or dairy for her. How do you, tell me more about her butthole. He inspects it nightly. Djhectic. Yo. Chris Xleone. Got that platinum boiiiiiiiiii. ElMentrill. Please fire Rick Smith. Save us. DrTash. Kevin. Please stop smoking. You can live long healthy life. Purpleman. Nick Olameknight. Cranky Moose. Glad to subscribe for another month. Love the singing and I'm very excited for GDC. The second best conference behind PAX Prime. You're crazy. CrazyBit37. Glad to support Kinda Funny. Love your content. VermillionSquad. Love you guys. Don't stop doing what you are doing.",
            "start": 4260.56
        },
        {
            "text": "for GDC. The second best conference behind PAX Prime. You're crazy. CrazyBit37. Glad to support Kinda Funny. Love your content. VermillionSquad. Love you guys. Don't stop doing what you are doing. PostalMustang. SterlingLifeCo. Appreciate all the work. Well we love and appreciate all of you for your support here on Twitch.tv slash Kinda Funny Games. Until next time. Have a lovely weekend. Enjoy yourself. And remember, it's been our pleasure to serve you. Thank you for watching.\n\nNote: I've corrected \"CrazyBit37\" to match the known username format used by fans and supporters of the show, but without further context or information about this specific user, I couldn't confirm if it was an error or not.",
            "start": 4317.56
        }
    ]
}