{
    "id": 3980,
    "video_id": "fE12y9bkxfw",
    "show_name": "Reactions",
    "hosts": [
        "Tim Gettys",
        "Andy Cortez"
    ],
    "title": "Tim Gettys Crash Team Racing Remake and Smash Bros. Persona Live Meltdown! - Game Awards 2018",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1544175721,
    "duration": 343,
    "transcript_chunks": [
        {
            "text": "there are still lots of amazing moments coming up in the show we've got more performance and of course the game of the Year announcement rated E Joker on switch is that Zander mobis the announcement for Super Smash Brothers to steal a treasure I know is it like comes in addition coming to switch [Music] whoa I'm so sorry what the [ __ ] I'm so sorry Wow livestream fail first DLC character announcement no isn't that problem oh yeah what that's crazy dude what you throw your hat my hat I'm sorry glass cuz it wasn't that loud yeah yeah oh it destroyed two DS Nintendo Reggie Frey is your fault Reggie alright so super smash brothers coming out tonight but it looks like I know great choices shirt here Reggie the Internet is going crazy the announcement of Joker persona 5 coming to Smash Brothers everyone's in this game every once in this game right so we have said and so yes you know the the games about to launch were super excited were super excited to give the fans the opportunity to",
            "start": 0.8
        },
        {
            "text": "everyone's in this game every once in this game right so we have said and so yes you know the the games about to launch were super excited were super excited to give the fans the opportunity to summon a persona so you said challenger pack ones these are the DLC fighters that will come out correct and so this gives you a flavor of how we're approaching the deal Gaylords continues everybody is here tonight including crash bandicoot man just thought you deserved a trophy of your own thank you very much crash this is the standard Korea handsome if you want to go to our second David [ __ ] to me baby I just want to see check out the world premiere already make it's a new game while we get in baby [Music] dude [Music] [Music] I can't believe it's real so far these are all oh gee bubbles the sauce noodle [Music] I can't believe is real [Music] looks like what some nitro racers for nitro fuel right see the place is exclusive mmm I'll get a guitar please welcome this has just been an",
            "start": 148.32
        },
        {
            "text": "the sauce noodle [Music] I can't believe is real [Music] looks like what some nitro racers for nitro fuel right see the place is exclusive mmm I'll get a guitar please welcome this has just been an incredible year for gaming and video games and I'm just honestly for less results which have won this award and to bring joy to all the people who love the game so the trailer says who says no person in this room and every single morning it's all because the whole more yes so I mean here's to another incredible year 2019 thank you guys so much I appreciate it it's everywhere [Music]",
            "start": 276.58
        }
    ]
}