{
    "id": 600,
    "video_id": "0aHDHnAfpcM",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Colin and Nick Play Mega Man 2 AGAIN! - Teaching Tuesdays",
    "description": "Colin and Nick continue their Mega Man 2 quest!\n\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\n\nFollow us on Twitter!\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1423598401,
    "duration": 659,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations . My name is Colin Moriarty. This is the illustrious Nick Scarpino. Hello. We are back here for a Teaching Tuesday right here on Kinda Funny Games. Nick, we've been trying to blaze our way through Mega Man, one of those great NES games from back in the day and we've been beating it stage by stage by stage. No, I don't have a good memory, but I'm trying to figure out which, why would they design characters that are just all. That's because you beat Mega Man 7, this particular gentleman here. Okay, I see. So we started with I think we beat Bubble Man, Flash Man, and Metal Man early on. Then we went through guys like Wood Man, Quick Man, then Crash Man. And Tim and I just went through Air Man and now we are going to go through Heat Man. You only have one option left, Heat Man. Who is the robotic Zippo lighter. So go head and select him. So real quick before we get into that. Wood Man was my favorite. Heat Man is",
            "start": 0.11
        },
        {
            "text": "coming up on my favorite though. For a couple reasons, one he looks like he stoned out of his mind. As much. He is, he does look a little stony. He looks a little cross eyed. He looks bonkers. Well and, and what, what, so select plus. Select him and I like how he's just, he's lighter. Oh, he is literally of the lighter. Yep. Great. I'm coming at you Heatman. I'm at your heart. Now, now we, we've had the weapon for a while that we need to debe, defeat Heatman, which is the Bubble Lead. But we needed item two from Airman before we really dealt with him. Now we have it and so we can. We can continue on our way. The stage is, is somewhat difficult, but it's kind of metered too. There's just well, first of all, you might want to press start and metal oh, shit. You just jumped right in. Yeah, you got me, you got me, you got me wound up. That's alright. Should I press start and get the Metal Blades out? Press start and get the Metal Blades",
            "start": 37.67
        },
        {
            "text": "me wound up. That's alright. Should I press start and get the Metal Blades out? Press start and get the Metal Blades out because that'll be the, the suction cup dudes and floating enemies with one hit. And that's the essentially going to be the only enemies you're fighting here with a rare exception. So remember that these guys come out. Remember you can shoot up. So if you find yourself underneath them you could always shoot up when they're coming down like that. They come everywhere. Come correct, son. Nice. Good old sprinkle there. That was a really nice ship, nice sequence of shots. So yeah, you have to be careful with these jumps because these guys spawn. The good, the important thing to know is that there is only going to be three on the screen at a time. Nobody, I can't do it, I can't do it.. Videos. Okay, now you have to get off me, though, buddy. Here come to Carl. Here bring me, bring",
            "start": 76.11
        },
        {
            "text": "Nobody, I can't do it, I can't do it.. Videos. Okay, now you have to get off me, though, buddy. Here come to Carl. Here bring me, bring him to me. Alright. Sit. So yeah, be careful they can only spawn. Ow. So jump out, there you go, and you got an extra life, so, so you rebounded. There can only be three of these guys on the screen at once so you can always kinda-Oh, my God. gauge when they're coming from. Ahh. Oh, you're getting a little too se, you're getting'a little too. I'm getting a little too overzealous here. you're getting'a little too, I feel you're getting'a little shaky, like, you gotta just calm. Yes. down, center yourself. Okay. Good. Yes. Yes. Yes. Nice.. Thi, this is a, like, swarm attack. No, you gotta just count it, you have",
            "start": 116.14
        },
        {
            "text": "Good. Yes. Yes. Yes. Nice.. Thi, this is a, like, swarm attack. No, you gotta just count it, you have to balance attacking with keeping moving. This is what I'm trying to tell you. If you keep as many of these guys onscreen that are not bothering you as possible. Oh, okay. I see what you're saying. They won't spawn more. Gosh. I really, I, I lost it today. I've come undone. You have come undone, but it's, I mean, it is what it is, so let's just see. This stage has beat me. You have , this is your last guy already. So be careful. Yeah, I got it. I mean, I believe in you, if it means anything. Keeps going right? Yep, they'll just keep spawning. All right. Okay, good. O. O. What did I do? Sorry wrong one. Press uh , one. There. Nice. Alright. Okay, good, good, good. Okay, very nice, very nice. Keep going, off the screen. Now, here. Geez.",
            "start": 147.42
        },
        {
            "text": "off the screen. Now, here. Geez. You're gonna wanna go, yeah, what, these guys will speed up when you jump up to their level, so just quickly jump to the left. And depending on how you play here you might be able to scr-it didn't work, m-that guy sometimes gets scrolled off the screen. Yeah, go back now, he'll be gone. So, in here, switch up before you go down the ladder to. Your air A. What does this do? This is, you'll see, it shoots up 3 0 of those up and out. Okay. Oh, I'm sorry this is the wrong part, I'm thinking of the wrong part. Alright so . Oh, the. I hated this level when I was a kid. So yeah. And that's why we waited for-I hated it. That's why we are waiting for item two. I'm glad that, that we got to see this. I totally forgot about this part. I hated this. So the idea here on the bottom right square is to jump on that square and then quickly just jump up. I see. And again. It's easy.",
            "start": 244.76
        },
        {
            "text": "So the idea here on the bottom right square is to jump on that square and then quickly just jump up. I see. And again. It's easy. Just, you just have to be quick so wait. So like jump on it now and then jump up immediately. I see what you are saying okay. And then the guy on the left and then you can just jump over and out. Got it. Nice and the jump to the. Perfect! You had it. Okay, let's just patiently wait. Okay, perfect. Oh man, all right. This thing shakes your confidence, unless it's shooken. I should have played i Dart or whatever the hell that thing was. Nice, Nice, jump off, there you got it. Now you want to switch. I, I fooled you with the arrow, that's my fault, the arrow is not used until later. So you might want to go ahead to blades. So he knows I'm there. Down there, you know what I mean? Now there's, there's some options here that you might want to explore but I don't necessarily think you'd do, and",
            "start": 289.69
        },
        {
            "text": "So he knows I'm there. Down there, you know what I mean? Now there's, there's some options here that you might want to explore but I don't necessarily think you'd do, and we'll, and I'll show you in a minute. So that yeah, jump on over. Oh, go back and get that ah. What happened? You needed health and you could have used that health. I think I dropped it. Nice. Now see these platforms here, these special ones. Yeah. You can actually use Crash Bombs to destroy them, but you don't necessarily have to. You just need to be able to like jump, yeah. And over, perfect. Oh, close. You have the right idea. Oh. Oh, it spawned you off. All right. How can that even be a thing. Why is that a thing? Because two of those sprites cannot occupy the same space. Oh my god. Physics. So, we'll, we'll get through real quick.",
            "start": 336.25
        },
        {
            "text": "occupy the same space. Oh my god. Physics. So, we'll, we'll get through real quick . All right. Show me how it's done. All right. So, let's get through here. I feel like this, this stage, more than many others, is. Just about speed. Oh, I mean there's something about a stage, that just wrecks your confidence. Yeah, I, I was actually anticipating. This is funny. This is going to be a funny bit, I was actually anticipating that I was going to collect, the the energy data drop but my Metal Blades have not diminished at all. Oh. So he just ran right through. So yeah, I that, I think again, I think again getting through with speed there's, there's like something about it. It doesn't necessarily have to be done quickly. I, my brother kinda plays this stage a little more methodically, for instance, but the idea generally is to try to keep as many of those guys on the screen if you can, because the game cannot spawn more",
            "start": 383.35
        },
        {
            "text": "little more methodically, for instance, but the idea generally is to try to keep as many of those guys on the screen if you can, because the game cannot spawn more than three of them at a time. So you see like all those guys are on the, were on the screen at once. Right, that makes sense. And so, the game just doesn't have the memory to deal with it. And so it, it's just a different way to play, you don't have to play that way. Some people play it like really methodically, and I think this stage is somewhat difficult but once you get through Bubbleman's and Airman's stage, you should come here, and just get rid of this stage as quickly as possible. Because it's just a straight pain in the ass. Do you need a specific, a specific. Do you need a specific. Power to beat this guy? Bubble Weed's good to have from Bubble Man for sure because he's a pain in the ass without it. So we have that. But Air Man gives you an item too, which",
            "start": 422.34
        },
        {
            "text": "man for sure because he's a pain in the ass without it. So we have that. But Air Man gives you an item too, which is basically the Rush Jet of Mega Man, and with it, you'll be an entire part of the stage that we did not get to yet, but I'll show you. I'll show you what it's all about. Yeah, so let's wait for him to spawn. And I'll show you what I mean with the Crash Bombs. So, for instance, if you want to go here and just go like this, you can just get rid of those. Well, that's easier. It's not necessarily easier I don't think, like I don't, like, it is what it is, kind of. Like with this one it's actually not easier at all, just jump over it. Can actually the Crash Bombs even though I don't need it I am OCD. And we keep on moving. Now here's where you need item two. Now you want to see it. This is the scariest sequence of disappearing blocks in Mega Man history. Ok. And you can just skip it. If you go here, and just",
            "start": 464.03
        },
        {
            "text": "disappearing blocks in Mega Man history. Ok. And you can just skip it. If you go here, and just Oh , see that's easy. That's just way easier. But that's why, and this is why you need to beat Airman before you come here. Otherwise, you do that all on the blocks and it's hard. Oh, that's brutal. And so this is what I was talking about on your play through too. I made some mistakes here with you, which I apologize. This is when you need the arrow shooter. So you can go like this. And like that and then destroy his AT-ST kinda guy and then immediately just kinda put him down. You just had like, a, like a, finesse with this, don't you? Now, who are you now? So I'm, this is Bubble Lead, Bubble Man's stage. Some call it, some people call it Bubble Lead. I've heard. From good authority that it's Bubble Lead, not lead. I, I always called it lead as a kid, but I mean, you can call it Bubble Lead, it's the same thing. So he's going to do this attack where he",
            "start": 514.57
        },
        {
            "text": "not lead. I, I always called it lead as a kid, but I mean, you can call it Bubble Lead, it's the same thing. So he's going to do this attack where he shoots the fire and every time you hit him, he'll come at you like that and so you just plant the bubble like that. And since we're playing on normal difficulty he dies very quickly. Wow. And that's basically it. So all of the robot masters are done. Wow. And this brings us. And this brings us to Wiley's castle. And let's just, you know, let's just sit hear and really reflect on the experience, but also enjoy the intro, introduction to Wiley's castle, and then we'll play Wiley's castle. Sounds good. At a different time. I guess Greg's up next and get through the rest of the game. And of course, you get you know, three different times throughout the game you get different items. We had item two, of course, we had. Item through just a scrawl from Heat Man",
            "start": 558.28
        },
        {
            "text": "the rest of the game. And of course, you get you know, three different times throughout the game you get different items. We had item two, of course, we had. Item through just a scrawl from Heat Man you get item one which are platforms and you'll need them in Wiley's Castle. But I love the intro to Wiley's Castle and so, I just wanna watch it as we, as we end this video. I'm gonna post that for this. And this is what I hate especially when people speed run this game, or try to play quickly because you can not skip this stuff and it's just so. Annoying. So there is is, Dr. Wiley, and fairest Dr. Wiley. What's he doing with this sweet UFO? What happened? In this big ass cyber house. That's awesome. Looks like a twisted Einstein. He is. That's basically what he is. And so this is Wiley's castle. And, and And then you walk out and it looks like",
            "start": 591.24
        },
        {
            "text": "a twisted Einstein's castle. Like brilliance. To meets severe drug addiction. And we'll be going there next time on Teaching Tuesdays. So thank you for joining us. I'm Colin and this is Nick. Stay tuned on Kinda Funny Games. We appreciate your support. Until next time, goodbye.",
            "start": 634.14
        }
    ]
}