{
  "id": 617,
  "video_id": "6l4i1HbLvno",
  "show_name": "Gameplay",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino", "Colin Moriarty"],
  "title": "Let's Play Nidhogg - Multiplayer Mondays",
  "description": "We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to play games.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1424116800,
  "duration": 541,
  "transcript_chunks": [
    {
      "text": "what's up everybody welcome to another Multiplayer Monday here on youtube.com/ Kinda Funny games I'm Greg that's Tim that's Col that's Nick and this is N idhogg. We're going to crown a Nidhogg champion today. It's going to be me. No, no, I I wanted you to sing the Nidhogg song again. Nidhogg. Thank you very much. Uh we're going to go one-on-one. Tim versus Greg, Colin versus Nick. The winners will face each other in the Nidhogg Championship. There's a squirrel. Don't get distracted by it. Uh do you remember Nidhogg? So I this game looks like it peaks my interest but I never played it. All right, we run at each other, we stab each other, one win, one lives, one dies. Okay, I'm a yellow homie. This looks like a Tim Gettys style game. This does. Okay, hold on before we get all crazy crazy. Oh I I said before we get crazy Greg get him get him Tim get him yeah you stabbed his ass now go go go go go oh okay oh okay this is cool no it's very cool how do I throw I am oh I am the N uh you it's up and square wait no no he's going",
      "start": 0.08
    },
    {
      "text": "and square wait no no he's going the wrong way you got to go back you got to kill him and then you get to go that way no you knocked him down now you go go go go go be a winner oh no ladies and gentlemen I got go Tim go he's got no sword Tim I like your strategy of just jumping over him and confusing what are you what are you ninjaing it for oh damn it go go go kick him in the head kick him in the gut this is getting really cool I like how the a lot it is a great I'm so fast I'm so Furious I know what you're destroying you okay I did a little ninja jump on you I love the push and the like the push and pull of this game **** I just fought you and you died oh the door the door that's a novice mistake oh sh what was happening there it was all swinging ding oh damn swinging my dingling is what Tim said Tim what are you",
      "start": 39.6
    },
    {
      "text": "he got see swinging my dingling all right all right hold on you'll be right there there you go oh my God no I think uh Greg might be hipped to your Jive there buddy like he's he's he's understanding that your jump kick is your secret weapon you got to kill him get his sword get his sword get his sword fight him okay go Tim go go go go so this can last for hours yes oh my God it certainly can it won't things you're getting intense it might you guys are right where you started it won't yeah this is pathetic maybe Greg needs to step up a little bit great get there did you just what did you do to him on the ground you don't want to know I'm a nasty boy get there Tim get there get there keep him keep him Pace up with you like he thinks he knows",
      "start": 99.36
    },
    {
      "text": "you don't want to know I'm a nasty boy get there Tim get there get there keep him keep him Pace up with you like he thinks he knows what he's no Tim was have you guys ever played or watch Three Ninjas why do you guys keep throwing the swords at the doors starting to annoy me I only threw it once so I don't think you should be on me Papa call Colin our match will go a lot faster than this you will just destroy me n necessarily I mean it's a it's a game of you know some people are really good at this game I know people that are great at this game I'm okay at it what just happened this game will never end no this is going to be forever should we call for pizza now Tim go I'm going I'm going oh he's no dude that's a defensive position why would you do that it was going to be cool Tim stop throwing your damn sword don't tell them how to play everybody oh no no oh really yeah the game took pity on you guys the final [Music]",
      "start": 149.6
    },
    {
      "text": "really yeah the game took pity on you guys the final [Music] screen if you're wondering what that sound is that's coming out of Greg Miller's mouth that's the Jurassic Park theme that's what it sounds like I really like that though that a lot of fun much 3 minutes 12 seconds let's see if you guys can play longer than that oh God so what what are the controls here what am I do what am I get myself is X is Jump Right square is attack up and square throw your sword your sword okay that's all you need to good enough so we'll continue we'll go back to the castle how'you feel about that I felt good I really enjoy this game all right this is who's who here I'm sorry oh calling you yellow um no I'm orange okay oh man Nick you got this you got the eye of the tiger thr the fight oh oh **** oh no oh yeah down and down and square gets your weapon back this",
      "start": 197.64
    },
    {
      "text": "gentleman's game is it yeah is that how you describe n yeah I mean you see the the fire the candles and stuff oh I see so like Castlevania is a gentleman's game too yeah what's going on in the background though there's some freaking moart that's straight out of Cast levania 3 oh God whoa all right God the orange one looks so fast he's tripping like a dumb oh no stupid doors yeah these doors man they doors have all got in my way Nick Stand Tall yes you so far to advance oh **** now now it's an it's old Nidhogg standoff they call him oh jeez Nick Nick we believe in you go Nick Don't Look Back Nick now look forward Nick door careful the door God damn this thing oh nice job Nikki oh god oh oh **** my you got to do the Ninja Kick you got to jump and square no I can't pass this part X",
      "start": 246.8
    },
    {
      "text": "thought I gave up I did not give up my ass little TT off this is impossible get over oh you thought I gave up I did not give up no the Nick Scarpino damn it oh suck on that no what this is a game of inches oh sh I'm good at that game no what did you just do to me on the ground bro I know I think when you punch him and get him on the ground you can go over him and attack and kill him like break their necks God there's so many swords look at all the blood yeah just fall oh damn you thought I gave up I did not give up oh doors Guys these doors are deadly open yeah they they do so much things here we go Nick oh why are you eating my head that's how you kill somebody when you're not going to down fought boys valiant F that",
      "start": 310.6
    },
    {
      "text": "eating my head that's how you kill somebody when you're not going to down fought boys valiant F that was good that was good all right salvation the Nidhogg approves all right guys this game like ey darb will give me nightmares all right I enjoy I'm yellow all right cool yeah okay well this is trippy I there's a different level this one's not a gentleman's game this one looks a little **** more fruity you look like you're playing damn oh **** Jesus he's mowing through you Miller get your **** together oh man get off the thing get him what I feel like a good strategy oh my God probably not that it's not this oh destroyed you obliterated you sh doing the wave that's how quickly they can go that's how quickly the Nidhogg for Nidhogg first first I came for IDARB then I came for Nidhogg man oh man 34 seconds damn that was good damn ouch that hurt my pride no Nidhogg is a lot of fun yeah I like this it's",
      "start": 390.28
    },
    {
      "text": "pride no Nidhogg is a lot of fun yeah I like this it's crazy it's frantic you have no chance you have no chance to figure out what's happening before it's over and Colin's running to the championship it's cool though makes sense good job Col congratulations ladies and gentlemen what do you think of Nidhogg let us know in the comments then make sure you keep coming back here to kind of fun games we post a let's play every day every Monday Multiplayer Monday where we play with each other sometimes we play with ourselves though what do you like to play with joysticks guys I just noticed it looks like Greg's sitting on a throne above us it just looks like he's sitting on a stool or like a box let's get him a lower we got to bring that thing over there next time be on our level I'm always on this level that's the problem you're looking down at the",
      "start": 451.32
    },
    {
      "text": "'s why you just got destroyed by calling in 37 seconds yeah 34 seconds way to count damn it **** **** I had you on your on your heels the entire time yeah yeah no I had nothing you had way too much for me if done right no can defend Greg let's remember that if if 10 no see defend if done right no candy F no candy fin no candy F gotta go I already gave it the sign off this is all the cheddar on the cheese all right this is all the [Music] cheddar [Music]",
      "start": 491.36
    }
  ]
}
