{
  "id": 601,
  "video_id": "iT61yOEtDrE",
  "show_name": "Reactions",
  "hosts": ["Greg Miller", "Tim Gettys"],
  "title": "How Marvel Should Best Use Spider-Man - Kinda Funny Reacts",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1423597228,
  "duration": 458,
  "transcript_chunks": [
    {
      "text": "What's up everybody? I'm Greg Miller and this is the pure one, Tim Gettys. Tim, last night all your dreams came true. Spider-Man's coming to the Marvel Cinematic Universe. Tell me a little bit about how, how did you believe it when you heard it? No, this is one of those things, this is huge news. Like every once in a while you get the news will break that makes you go, uh-oh, what are we going to do ? Like we're the type of people that need to react to these things exactly. So you know when Star Wars news broke that, oh my God, 7, 8, and 9 are coming, that was like, wait, there's no way that's real, right? And like this is one of those things where there was, there was rumors about this for so, so long, the Sony hacks, all that stuff. So we're all like, this is what we want, yeah, but will they be able to make it happen? Last night I saw a tweet come out and I'm like, I don't trust this guy, this person tweeting this, I don't trust him. Then I clicked on it, then I saw marvel.com and I'm like, is that, is that really an L or is",
      "start": 0.08
    },
    {
      "text": "night I saw a tweet come out and I'm like, I don't trust this guy, this person tweeting this, I don't trust him. Then I clicked on it, then I saw marvel. com and I'm like, is that, is that really an L or is that a capital I? This looks like some fake website. No, this is legit and I lost my ****. I, I found out about it from your Tweet about it but it, your Tweet almost looked like you had been hacked so I didn't believe it either till I clicked through and went through and then I was like, oh ****, all caps, OMG. Yeah, exactly, that's me Greg, you should know better. Well I know but I'm just saying something about a dinner ring sh, we've been burned before . Uh of course the deal here is that Spider-Man will first appear they say in one of the Marvel Cinematic Universe movies. They don't say which one but we have a good idea of when or which one it will be because then he gets his own Standalone on July 28th, 201 7. Now if you click over then and you look at when these movies are coming out, right, what we",
      "start": 36.24
    },
    {
      "text": "we have a good idea of when or which one it will be because then he gets his own Standalone on July 28th, 2017. Now if you click over then and you look at when these movies are coming out, right, what we have on the Slate already, the next it seems like it's got to be Captain America Civil War which makes sense where Spider-Man has such a big deal in the Civil War storyline exactly. And so this is just a, it's a partnership between Sony and Marvel. It's not him, Marvel's not making this movie so Sony's still funding it and all that stuff but uh we got our boy Kevin, I have no idea how to say his name. We already went through this whole rigma roll, Fagy, **** we're going with Figy. We're going with Figy. Let us know in the comment knows when he comes on the Game Over show then we'll know how to say exactly. He is, he's the guy overlooking the whole MCU and so he's going to be helping to make sure that Spider-Man fits into that and that's all I ever, that's really it and that's one of those things I",
      "start": 73.2
    },
    {
      "text": "he is, he's the guy overlooking the whole MCU and so he's going to be helping to make sure that Spider-Man fits into that and that's all I ever, that's really it and that's one of those things I think everybody's been saying they desperately want seeing as how Spider-Man's been getting off the rails it seems for a while. The movie, there's going to be an Ant-Man movie, there's going to be a Venom movie, nobody knows what the hell going but that's the thing. So Amazing Spider-Man one, I liked it a lot. Amazing Spider-Man 2, the internet hates, critics really didn't like. I enjoyed it. I saw the first half on a plane. I thought it, oh this is fun. I thought it was fun, way too much crammed into it and there was Electro was a piece of **** things are bad but what really fell off the rails is they were like, oh Sony needs to build its own franchise like X-Men did so now it turned into this whole problem and Sinister 6 was one of those things so now we're at this point where it's like, all right we're going",
      "start": 111.52
    },
    {
      "text": "Sony needs to build its own franchise like X-Men did so now it turned into this whole problem and Sinister 6 was one of those things so now we're at this point where it's like, all right we're going to fix all of these issues, we're going to bring him into the MCU and just go from there. Um what we don't know is what's happening in Sinister 6, it's not canceled yet, yeah, but so we'll see but uh I mean it could still happen just down the line as part of this which that could be awesome. Yeah, um but then the other big question is, is Andrew Garfield going to be in? Everybody said it looks like no, they said coming out of this stuff that he wouldn't do and then even last night ver was saying probably not going to be him it probably won't happen. What are your thoughts on that cuz it upsets me? It's upsetting yeah because here's the problem with it is the fact that if you get rid of Andrew Garfield right then you have to start all over and if you're going to use Spider-Man in a Civil War storyline",
      "start": 146.52
    },
    {
      "text": "yeah because here's the problem with it is the fact that if you get rid of Andrew Garfield right then you have to start all over and if you're going to use Spider-Man in a Civil War storyline there needs to be drama, there needs to be weight to him pulling off the mask and saying I'm Peter Parker and I've been Spider-Man since I was 15 exactly. So I think that there's not too much of a problem with that though because it's easy to just kind of give that backstory quickly. We don't need another Spider-Man Rebo, we've gotten too many of them already. You don't even need the backstory. We don't need in Civil War an explanation of who Spider-Man is but if it is it's just you know whatever John Blow actor over here he gets out Jonathan Blow that's who I'm saying should do it . Jonathan Blow comes out he's Spider-Man and he's just like and he pulls off his masks be like well we understand that but you've only been Spider-Man for 45 minutes in my mind as it movie VI well there there's a big issue",
      "start": 185.36
    },
    {
      "text": "he's Spider- Man and he's just like and he pulls off his masks be like well we understand that but you've only been Spider-Man for 45 minutes in my mind as it movie VI well there there's a big issue already with the the Civil War in the movie Universe in that all the movie characters so far we know their secret identities there's not a secret they're know that no everyone does nobody knows who Hulk is burn most of them like the majority of them everyone knows Tony Stark everyone knows Captain America like these are these aren't like Secrets they're just identities that they have sure. Um so to build that up already has that issue sure. So I think an easy way to to get around all of this is just have some J Jonah Jameson goodness on news stories Daily Bugle stuff going on in the background of Civil War okay and uh just kind of explained that like oh the mass Menace blah blah blah and they kind of build up the fact that like saying don't even show Spider-Man in Civil War but oh no no have",
      "start": 223.32
    },
    {
      "text": "Civil War okay and uh just kind of explained that like oh the mass Menace blah blah blah and they kind of build up the fact that like saying don't even show Spider-Man in Civil War but oh no no have him in it but I'm saying like before like you can build up now Kevin F Fey I'm going with Fe this time f f see I was closer than anybody um that one he he knows what he's doing if you seen that the Hulk movie he just was like whatever pretend that other Hulk movie didn't exist we got a really quick little Montage in the beginning hey here's what Hulk is you get it you're not stupid you can follow along we can get that with Spider-Man so easily see him swinging around doing stuff with his mask people I wonder who he is and people will never know and then all of a sudden when you do get the reveal then it does mean something cuz you at least kind of understand then see the big problem is again about that reveal you need to have that what breaks my heart is that you can't do that have that",
      "start": 262.96
    },
    {
      "text": "then it does mean something cuz you at least kind of understand then see the big problem is again about that reveal you need to have that what breaks my heart is that you can't do that have that reveal and say I'm Miles Morales okay I've been Spider-Man for a year I'm still a boy that just doesn't work you can't do it and then the audience is going to go who's M morale he's an Amazing Spider-Man you should be reading yeah so Ultimate Spider-Man not Amazing Spider-Man um I said an Amazing Spider-Man yeah I know he's an Ultimate Spider-Man you make any sense is an Ultimate Spider-Man great anyway so the problem here is people are a lot of people are saying oh we want Miles Morales I love Miles Morales this not in this movie that makes no sense it has to be Peter Parker and I think most people assume it will be Peter Parker at least for the the Civil War one but then they're like oh maybe in the Standalone one will'll be Miles Morales it's like that doesn't make sense if it was",
      "start": 302.52
    },
    {
      "text": "most people assume it will be Peter Parker at least for the the Civil War one but then they're like oh maybe in the Standalone one will'll be Miles Morales it's like that doesn't make sense if it was Donald Glover for sure should play him of course a little old but whatever no he's old Andrew Garfield yeah but he I mean he plays young but Miles Morales is supposed to be younger than Parker you are correct yes that is the other problem M Mor is supposed to be 8 years old and that's an issue I have with him in the comics too where it's just like you're not doing 8-year-old things like you're acting like a grown ass man and it's just like you're only doing this like they only play up the 8-year-old thing when it's like convenient for the weird story lines and stuff otherwise they're just treating him like a normal dude he's going on dates and all this stuff it's like you're not 8-year- old Miles Mores yeah um but I I don't think that the the movies are ready for Miles Morales yet like I",
      "start": 339.76
    },
    {
      "text": "him like a normal dude he's going on dates and all this stuff it's like you're not 8-year-old Miles Mores yeah um but I I don't think that the the movies are ready for Miles Morales yet like I think that's definitely a down the line thing you need to build up the Peter and Peter needs to die for miles to mean anything true like or else miles is just a Spider-Man and that's not enough like miles needs to have the what he needs his Uncle Ben and his Uncle Ben was Spider-Man yep he need he needs that Peter Parker moment yeah all right so so we need that in terms of what after playing Peter Parker I want Andrew Garfield I always go for gold yeah me too confus know Andrew Garfield I love him a lot of people give him **** they're like oh he's too pretty he's not Peter Parker it's like guys have you seen Peter Parker in the comics like besides the 60s he nerdy dude like he's a goodlooking guy that's just like he's with black cat he's with Mary James with everybody he knows what's up no",
      "start": 375.8
    },
    {
      "text": "have you seen Peter Parker in the comics like besides the 60s he nerdy dude like he's a goodlooking guy that's just like he's with black cat he's with Mary James with everybody he knows what's up no wonder you like this no wonder you like this ladies and gentlemen what do you think of the Spider-Man joining the MCU news let us know in the comments share this video with your friends and of course keep coming back here to Kinda Funny each and every day for new videos and more of Tim oh you're webbing yeah at first I thought it was your middle fingers and then I was like it's not cuz you like it's more you gotta be like that it's more like that you were doing like this this is like no I was like hang you're just constantly spinning webs if you're still in the position the whole time m",
      "start": 413.92
    }
  ]
}
