{
    "id": 581,
    "video_id": "keXnh79MkcQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "8 Player Smash! - Smash Bros. Wednesdays",
    "description": "We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to play games.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1423080001,
    "duration": 732,
    "transcript_chunks": [
        {
            "text": "What's up everybody and welcome to another YouTube.com/kindafunnygames. Let's play. I'm Greg, that's Tim, that's Colin, that's Nick, and it's Smash Brothers Wednesday. You know we put up a Let's Play everyday here. Today we're playing Smash. Tim! Yes. What are the rules? We're ju-we're just playing eight player Smash. We got to choose our characters this week . Yeah. Unlike last week. Yeah. We are still going Omega though. Because we're not too cray-cray. Cray cray cray? You know what, let's go to Wily's Castle. Yeah, had a good Mega Man playthrough recently, where Colin beat the entire game without dying once. Oh, I died, I died. I don't remember that playthrough at all, cuz on Tuesday, we put up a segment of Mega Man every time until you beat it. I wasn't playing very well. We got three lives each, we got some",
            "start": 0.1
        },
        {
            "text": "the coms are on the. We said, they're dressed to the nines. Level nine, dressed to the nines, all the above. You, oh god, you are correct. I really feel like the humans should just chill out and not fight each other. No, no, no, that's no fun. Game and Watch right now, he's you know, he's being nasty. That's why they call him a nasty boy. Yeah, it is actually. I didn't know you knew that. There's a secret. All your secrets belong to. Damn, Villager! All right , I'm already dead. Oh, Nick, Nick. First blood! Humans are humans, oh, Nick, you did",
            "start": 32.13
        },
        {
            "text": "throwing that bacon. Oh, he's doing that nasty bacon. Oh man, yes. Dedede is out, Dedede peaced out. Aw. Oh dammit Timmy Tim. Oh yeah. Timmy Tim, Tim, Tim, Tim. Dammit. Aw, Tim. Yeah? Collin, no that wasn't-Collin has mounted me. He mounted you? He mounted me. After he mounted you? Aw man, I just got thrown to the ground. Damn Lucina. Dude the-the middle of the stage is so dangerous. Interesting. That's why I stay on the edge. Oh, no, I spoke too soon! Oh! That's why it's so safe on the edge, huh? Oh, no. Wow, I got bounced out fast. Damn it, I'm down to one. Me too. You can't help yourself from. Remember that song, Colin? Of course. No! Oh, oh my God, Collin you been practicing this or what? No",
            "start": 74.82
        },
        {
            "text": ". I told you that I was-we should have worked together. Wow. Now I get schooled by the robo. I'm just gonna look on the Internet when the robos are the ones who are beating this. That's what-are the robots are gonna come for us. It's what we've been talking about. This is what Bill Gates was scared about. Like, the Skynet is not what everyone thought. Instead of Terminators, it's the fucking Villager. Goddamnit. That's some bullshit. I was only, like, 50, 60, 70, 80, 90%. Alright, I need to be really careful here. It's all-it's just you guys versus a bunch of robots. I hope you're having fun. I'm at 151, I have one life. One life. DeDeDe's hanging in there, though. Oh, yeah. Colin, you gotta do this for the humans. Oh.",
            "start": 137.28
        },
        {
            "text": "Oh, yeah. Colin, you gotta do this for the humans. Oh. You gotta do this for the-the bone bags, the flesh bags. Colin, do you want me to sing Hanging Out with the Boys by Kenny Loggins? Yes, please. Hanging out with the boys. Such a great song. Oh no. Okay. Lucina's. Oh no. He likes to play the volleyball. Let's have some people with a ball. Collin, you're it. You're the only human left. No pressure. The internet will hate us if we lose this. Oh, this is-yeah , this is really sad. Well, you put a level nine CPU out there. I don't know what you guys expected with that. We should be better than a level nine CPU though. Yeah. Can you please kill Lucina for me? That's all I can do. I'll see what - I'll see what I can do. I mean-",
            "start": 180.4
        },
        {
            "text": "Focus on living. Just jumping around, all. The problem is this, these stages, the-the sides are too small, man. You just-I knew it would come down to this. Get bounced out so fast. You knew it would come down to what, Colin? Lucina. Good job, Colin ! Colin! Way to represent. Human, human, human. Human are-What the hell was that. What the hell was that? I was not even... That's the counter. She used trickery. Witchcraft. She just-she just countered you. So everybody. I did the best I can. Should we do it again? It's way. Yeah. I want a rematch. We need to do one more. I'm going to beat you assholes. I'm not happy about this. That was terrible. Aah. I don't. Oh, man. Port can't believe",
            "start": 220.96
        },
        {
            "text": "I want a rematch. We need to do one more. I'm going to beat you assholes. I'm not happy about this. That was terrible. Aah. I don't. Oh, man. Port can't believe it. The weeks are getting longer that's my problem. And I'm losing focus. Mm. But you know what? Excuses are like Portillo. They're useless. Damn. Shots fired. Yay. All right, let's go I'm down, I'm down with my same character out there? No, no it ain't time for that. Sorry, guys , Ooh, Wendy O Koopa, she knows what's up. Is it O Koopa? Why is it O Koopa? That's her middle name. Oh. I dont know. Oh Radfall, she was like, the Koopas from Ireland, it's like O'Ko opa. Oh, like O'Connor? That's right, that is right. It is not. Oh, you could put it out soon. Oh, I don't like this stage, this is no bueno for me. Why? It's all the same. It's literally all the same when it's",
            "start": 251.79
        },
        {
            "text": "wrong, no this is rounded, no I'm sorry, I was thinking of the wrong one. Oh man, I. I'm just a penguin! I'm just a cook. I watched Hard to Kill last night and I though of you Colin. Oh, thank you, I appreciate that. You gotta dig deep. He does. But he can't-Oh my God, what the hell just happened? Yeah. It was a big deal. No way. Fly! I haven't listened to that song in a while. There is a famous video that's only exists I think on Facebook of Greg and I playing Playstation Move volleyball to that song. I filmed that. Oh, did you? I think I filmed that, oh Greg was shirtless and wore aviators. Mm-hm, we were both shirtless.. Heh.",
            "start": 289.12
        },
        {
            "text": "was shirtless and wore aviators. Mm-hm, we were both shirtless.. Heh. We're the-Either that, or we did a Wii Fit thing one time with Greg, where he was. We did that as well. I was out of shape. And then Da-but I looked like Damon after I used it for a little bit. That was the pitch. Tim, get that shit outta here. I don't know why I go. I just keep using my up-B because. At the end of the day I need people to clear the hell out of here. Oh, God I-Ike, F off . Oh. . Oh no. Clearing out the garbage, guys. Dammit. Jesus. It's too late, it's just too late, there's too much pressure. Oh my God, this is too much. Oh. That was good. People are coming for me, get of me bro, what are you doing? You know how much they gotta make? Yep, I do. Okay. It's chaos in that corner",
            "start": 351.03
        },
        {
            "text": ". It's chaos in that corner. My only hope is to stay in the air. Cuz where penguins belong. Oh god, oh dear. Oh dear. Oh Wendy O Koopa word, you're just the worst but I like you. Oh my god. Thank you, god damn he was like on me . Stop it, Tim. He's hunting me everyone. You're everywhere on this page, Tim. I try to be. Cuz you're everywhere to me. Ike's got to go. Ike's really hard to out. I'll take him out. Damn it. Goodbye! All right, it's the four of us. You're done! The humans have their day. Thank God. Greg, get off me, bro. Uh-oh. God! I don't like this arrow business.",
            "start": 423.79
        },
        {
            "text": "the Shield. Remember the show The Shield? That was based on Vick. The Shield, I'm out. It's getting nasty out there. I basically just used up B the entire time, it's too. You were just like a wrecking ball. It's too scary out there. It's a scary world. No. That's that. Arovers arrow. Oh, man. That should have hit. Someone just breathe on the other guy and just get it over with already. That's it. No. Son! Aw, dammit. Phew, that was rough. Now it's Nick- Nick is the champion! It's Nick versus the nine- whatever, level nine computer, we'll sit a bit to see who the real champion of the day is. We all embarrassed ourselves out there, we suck. Yeah, that was bad, that was bad. It's really sad.",
            "start": 536.76
        },
        {
            "text": "who the real champion of the day is. We all embarrassed ourselves out there, we suck. Yeah, that was bad, that was bad. It's really sad. We should just blank out our names for the first match. And our faces. No one will know it's us. Shame. Okay. Shame. We'll just say we all played as the CPUs. They won't know that was-that was mine. Oh, I'm the only person that plays day to day like that. It's true. So. He only uses the mallet. Yeah. The mallet and the up-B exclusively. And sometimes the little spiky ball, and sometimes the suction. Ladies and gentlemen, that's how we do here on youtube.com/kindafunnygames. Smash Bros. each and every Wednesday, a Let's Play each and every day. A live stream over on twitch.tv. E-slash. Kinda Funny Games at each and every morning at 11am Pacific time and a whole bunch of other content across Kinda Funny, Kinda Funny Games. Thank you for watching this video we're",
            "start": 652.24
        },
        {
            "text": "Kinda Funny Games. Thank you for watching this video we're sorry we're bad at Smash, we understand you're better than us. You don't have to put it in the comments. Are people saying that in the comments? I don't really see that in the comments, I'm sure after this video they will be. Oh no, there's a lot. There's a lot of people saying that we're not good, that's fine. We should play with you sometime. In their defence, most people are better. Hey. I'm not saying we're good. Okay. All I'm saying is that I got six K.O.'s. Where you guys at? I got 4. I got 1. Needs to step it up. This is exactly what happened in Tetris. I got the 4 that counted. Ladies and gentlemen it's been our pleasure to serve you.",
            "start": 687.79
        }
    ]
}