{
  "id": 587,
  "video_id": "KGoeLS67BWM",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Disgusting Public Displays of Affection - The GameOverGreggy Show Ep. 61 (Pt. 4)",
  "description": "Tim Gettys brings up how much is too much when it comes to PDA.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1423123200,
  "duration": 1193,
  "transcript_chunks": [
    {
      "text": "Tim , yes, you're the final topic. Bring it home. Final topic for the day is public displays of affection, what AKA love them, PDA, love them , the worst. You love them awful. I don't like when other people do them. However, I'm in a very loving relationship with a woman that I call my wife, with a woman, and uh, I when it when I want to snuggle with her, I don't care where it is. If I'm at a Starbucks and the Lin's la and like she's standing in front of me, I will just put my nose up against her, snuggle in and show some affection. What? Yeah. What are we defining is p like grabbing her ass and there that that stuff's happening to oh at the Starbucks like I will I'll slide a hand. I'm joking. Damn SL the old just so you know it starts with the enable and I'm just joking. Um so where's the line drawn? Like what is acceptable? What's not? What scenarios change that? Like I my thing is if there's children present, there's like a a three- foot rule. You need to be three feet away from the person there children.",
      "start": 2.82
    },
    {
      "text": "what is acceptable? What's not? What scenarios change that? Like I my thing is if there's children present, there's like a a three- foot rule. You need to be three feet away from the person there children teach all of the children in America that kissing is bad. They have eyesight unless they're like myopic. Yeah. No, no, no, no, no from your significant other. Yeah, you need to be 3 feet away from that's what I'm saying. Like away kids need to grow up so they so they grow up knowing that touching is bad and like they would be ashamed of their bodies. You should not touch each other. Just grow up Catholic. It'll be perfect. I'm joking about that. But what I'm saying is you should be very when there's children around. I feel like even like **** those kids definitely nothing beyond beyond beyond beyond kissing and it has to be like a PE KISS. Sure. And what's beyond kissing by the way? Um Extended kissing. Yeah, you should be making I mean so you are not okay with making it out in public. I mean there's rare",
      "start": 82.04
    },
    {
      "text": "and it has to be like a PE KISS. Sure. And what's beyond kissing by the way? Um Extended kissing. Yeah, you should be making I mean so you are not okay with making it out in public. I mean there's rare exceptions at a bar when you're just you're just getting you're just like all drunk. No, I'm not. I'm just saying I'm not going to fault somebody at a bar 12:30 in the evening. I almost said after fault you at 12:30 in the afternoon the evening that's fine. You're you're it's some Club. I don't go to the clubs. I don't know what they're like. I assume they're like and it's like lights and stuff and there's foam coming. I've only watched The Real World Las Vegas and I assume it's like that and that's that would be fine exactly like that whatever but like yeah like no at Starbucks no you're not no don't tongue kissing. You know what i'I would rather anybody do okay this is my pet peeve that I see so a lot I would rather see people tongue kissing and dry humping than a guy doing this to to a girl you",
      "start": 123.96
    },
    {
      "text": "tongue kissing. You know what i'I would rather anybody do okay this is my pet peeve that I see so a lot I would rather see people tongue kissing and dry humping than a guy doing this to to a girl you know the old neet grab it's like a like a Vulcan neet grab like of ownership it's kind of like a y I see guys doing that all the time yeah no especially I see this a lot when a girl is at a bar and like another guy would come up to her or hit on her he's talking to it one these hey like this and you're or or walking like this like she's in a yoke s really weird I've see I see this a lot if you haven't noticed it just look that seems a little girl exactly it's a weird dominant thing that guys do and I'm like don't that is really weird I just consider like an oxen with the thing on sure sure sure um I would rather see dry humping than that okay I mean I'd rather see dry humping just period I'm a fan of Dr when last time you saw dry humping in public well okay so the reason I bring up this",
      "start": 168.52
    },
    {
      "text": "um I would rather see dry humping than that okay I mean I'd rather see dry humping just period I'm a fan of Dr when last time you saw dry humping in public well okay so the reason I bring up this topic is I have this friend and this friend just like his his ideas of what is acceptable it just really K I mean I'm not going to he's the one nodding and like an idiot deny this but it's just like what goes through his head like his needs and his Desir I almost spit and his whatever he wants at that moment which let me tell you whenever his girlfriend is present is that is just it's ridiculous like the it's gry is the only term you can use to to describe this oh it's it is it is like on the businesses you're just like noit especially if they're driving now they're driving with you in the car so here here's the thing I'm with them Conant like their son he's like but it's one of those other things where even if it wasn't me if it was someone else I don't think it would be a different story",
      "start": 216.96
    },
    {
      "text": "so here here's the thing I'm with them Conant like their son he's like but it's one of those other things where even if it wasn't me if it was someone else I don't think it would be a different story like if it was if it was you if it was Nick if it was Colin if it was anyone we will never send Kevin and your girlfriend to pick you up together here's the thing he's he's not Nast well let me take that back I was going to say he was is going on he is pretty nasty but he's he's a good good guy very respectful super like it's not like it's bad you know what I mean it's not like she doesn't want it like when like when you're ched into going consensual on but here's the thing there's been multiple times where we've been at you know nice little Vietnamese restaurants maybe Thai restaurants just all these different things you had a restaurant yeah but at no point does it matter theine does I'm specifically saying it happened at these two places and I'll just hear lick my tongue e what the",
      "start": 269.44
    },
    {
      "text": "all these different things you had a restaurant yeah but at no point does it matter theine does I'm specifically saying it happened at these two places and I'll just hear lick my tongue e what the **** wait what your friends are disgusting and I'm like why would you do that like just your friends are disgusting Kevin wrong with you to the best thing is that reaction wait wait wait I just want to see if she would do it well here's the thing the first you you're disgusting you're disgusting but then but it's one of those things where it's like the second time she licked his tongue she did not do it not how you lick a tongue how has that even happened Pokemon yeah but it's you know it's one of those things where he gry might be a good nickname for him and it's like it I just const how she feel about it she I mean she's she's still with him and like they've been together a long time to how many yeah like three years two and a half years does she seem reluctant to do these things or",
      "start": 311.12
    },
    {
      "text": "she feel about it she I mean she's she's still with him and like they've been together a long time to how many yeah like three years two and a half years does she seem reluctant to do these things or definitely very reluctant so does she she has different she has a different level of he's forcing her to do things that she's uncomfortable like no no no no no maybe you know what we should probably talk to her about that but no no no weal she she understands what she's getting into and it's if she she loves him enough to do these things it's like when Christine watches WrestleMania with me she doesn't want to watch WrestleMania but it's very similar to that because there are lines where she'll be like no and he'll be all right see like yeah you guys are carry this whistle around and just whenever you see something like not acceptable yeah oh I mean she be blowing the whistle a lot this is like Pandora's box of P yeah again I'm I was you know I'm just picturing a tongue licking another",
      "start": 368.92
    },
    {
      "text": "you see something like not acceptable yeah oh I mean she be blowing the whistle a lot this is like Pandora's box of P yeah again I'm I was you know I'm just picturing a tongue licking another tongue and just dry heing inside at the restaurant like please don't my there's a lot of fish paste in those things my Tong in the I'm looking yours each other you can't I don't want this beard by default if one tongue's licking the other tongue the other tongue is licking the other tongue I don't think you can lick a tongue without the tongue that's moving is the one doing the licking and the other tongue could be stone or anything else it doesn't matter you know I'm an epican see this is what I'm talking about when I I'm never having sex again go internalizing the PDA question I immediately thought of you know Christine and I and like that's just like like you know walking back from breakfast today like holding hands like rubbing her back or something like that her rubbing my back or whatever",
      "start": 412.2
    },
    {
      "text": "of you know Christine and I and like that's just like like you know walking back from breakfast today like holding hands like rubbing her back or something like that her rubbing my back or whatever like I was ready **** lose it at the post office today she called me down rub my back not like a you know like a massage just like you know a little little much affectionate touching that you wouldn't do with a friend right okay I think but I mean not there's not like making out making out there do that this is an issue PD are an issue of taste right that's it not the taste of a tongue looking another tongue by the way but just taste level well it's taste level or expressing dominance over your partner sure do you know what I'm saying cuz girls would do the same thing she's they're like come up and just grope you to like establish like this is mine you know girls and guys more guys would probably do it but yes I've SE girls do it a lot exctly yeah this is my territory it's like peeing on",
      "start": 452.76
    },
    {
      "text": "up and just grope you to like establish like this is mine you know girls and guys more guys would probably do it but yes I've SE girls do it a lot exctly yeah this is my territory it's like peeing on a a fire Hy very insecure exactly insecure on either part uh but to me like I draw the line you know I think Cheryl is more comfortable with PDA than I am and I I like I just try to like think about what I would want to see and then I try to put that into the world so like holding hands is fine I don't need to see anyone kissing each other I don't need to see like anyone doing it's fine if you want to do I'm not saying you're going to go get thrown in jail for doing it I'm just saying like what in the confines of good taste I think that like you know there should be no vulgar physical contact of any kind like a tongue looking another like exact exactly no one goes out to a nice Thai restaurant expecting to see that where do you come where do you come down on just an occasional tush grab",
      "start": 494.28
    },
    {
      "text": "of any kind like a tongue looking another like exact exactly no one goes out to a nice Thai restaurant expecting to see that where do you come where do you come down on just an occasional tush grab like a like a little just a little it's funny like if you're fun it's but I understand what you're saying you know what I mean like like like cuz sometimes I do it I like it is something that I don't I don't do it on purpose I have developed this habit over the seven years of being with my wife where with my hands on her lower back every once in a while I'll give it just a little squeeze h k just you a little like a still know about no one can see your hand but you're just giv me the full the fullon impression here give you the business Nick's been knowing to grab my ass from time to time too I think he just maybe likes butts and that's friends boobs they're great I like what does that feel like like a not you know I don't do that in Starbucks but everyone want you should grab your friends",
      "start": 535.68
    },
    {
      "text": "think he just maybe likes butts and that's friends boobs they're great I like what does that feel like like a not you know I don't do that in Starbucks but everyone want you should grab your friends butts like butts are great they're hilarious it's what we sit on they beg to be pinched a little bit watch Bon what was that what was iton oh yeah the what the body mass I feel like high school has a very different interpretation of this like High School High School there's no rules r no rules because recently I haven't been around high schoolers I I haven't um not by choice but the Recently I was at this bus stop and um I hope it's not by choice Tim by the way any watch an hour ahead by the way oh this thing's just totally off it's in Spanish the date's not right it's total a why that is it just an hour off no it's everything off yeah it's just off it's just why do you do that the way I like to live my life and also he just got into a conversation with you it's It's A Conversation Piece",
      "start": 575.0
    },
    {
      "text": "just an hour off no it's everything off yeah it's just off it's just why do you do that the way I like to live my life and also he just got into a conversation with you it's It's A Conversation Piece if you didn't notice Tim is all Conversation Pieces what's wrong with your haircut why does your shirt have pictures on it why doesn't your watch work really you're really smart people like to talk flaws are your assets exactly oh I know that I know how to use that to the bank anyways I see this guy and well this girl jumps up on him there's like the straddle he's pulling her and they're just making out at a bus at Daily City Bart station which is like there's many bus stops there there's a lot of people there and I'm just looking at them like wow but you understand that in high school yeah like you figure you're finally not under the supervision of your teacher or your parents so it's if you're getting nasty at the Daily city bus station you got to do it that's how you make it happen",
      "start": 619.52
    },
    {
      "text": "like you figure you're finally not under the supervision of your teacher or your parents so it's if you're getting nasty at the Daily City Bart station you got to do it that's how you make it happen again i'I've been there I've thought about it I've never done it at the Daily City Bart station but bucket list yeah oh exactly that's the re Buck that's that's a good point though it does bring you back to being 15 16 17 and like you just have to and wild the oh my dad's upstairs like that was like literally like my that was like my life when I was like 16 17 with my girlfriend jackets just meant that people couldn't see you at all yeah you know what I would do if I had a kid and they were 1 5 I would buy them apartment next door and be like there you go no way really the coolest mom ever I would totally be like there you go just don't become a heroin addict or get pregnant yeah see because I I feel like 15y old taking all the fun out I was ready to get out like at 14 I was like well",
      "start": 662.36
    },
    {
      "text": "I would totally be like there you go just don't become a heroin addict or get pregnant yeah see because I I feel like 15y old taking all the fun out I was ready to get out like at 14 I was like well here's the boarding school no we don't have money okay well here is an alternative thing I found an apartment and I'm like you know I'm 14 or 15 I feel like would have been fine just living wait are do you have any siblings I have a younger brother yeah okay so you're the oldest I think that's the difference I'm just a year old yeah it's weird well for me I had an older brother and he he was that person and I was like I'm sitting here forever I got it all figured out yeah they're already focusing on him cuz he's the one that's **** up all the time and I'm just going to chill and sneak girls in the back door Matt Scarpino was **** up oh yeah that picture Matt Scarpino sent us by the way oh my God was just really my brother I love him to death but he was the one he's taught me so much",
      "start": 700.52
    },
    {
      "text": "in the back door Matt Scarpino was **** up oh yeah that picture Matt Scarpino sent us by the way oh my God was just really my brother I love him to death but he was the one he's taught me so much more about like so much about life good and bad which I think is very important right he was the one that made a lot of mistakes that I didn't have to make I chose to make them of course cuz we all do we're stupid I'm like I've seen my that have a severe repercussion I'll try it nope same same percussion um but yeah he took a lot of heat from my parents and so when I was growing up my parents were like all right we've been down this road with your brother like if you we're going to go out of town we put alcohol in the house don't go anywhere if you're going to have friends over have them sleep here like don't do it but we know you're going to do it cuz you're a **** anyway does that take out the fun of it no actually do you just do it just because it's like you you're told not to no cuz I",
      "start": 735.4
    },
    {
      "text": "like don't do it but we know you're going to do it cuz you're a **** anyway does that take out the fun of it no actually do you just do it just because it's like you you're told not to no cuz I did other things too like I smoked cigarettes and I did like you know you you'd go and experiment with different things but then once you had that party house and me like it's awesome like your friends are like dude party at Nick Scarpino's house right now I'm like that makes me feel like I am in like you know Can't Hardly Wait or some other cool movie from my my childhood um Aaron Carter music video yeah back to school concert where Oingo Boingo was playing that's that was the of I wanted to throw that party so badly they playing dead man's party was so good the only Oingo Boingo song anyone knows Weird Science oh do they Weird Science apolog I take it all back Colin extra points if you can get this what's their full name okay Oingo boingo's full name yeah Oingo Boingo is they they",
      "start": 772.88
    },
    {
      "text": "knows Weird Science oh do they Weird Science apolog I take it all back Colin extra points if you can get this what's their full name okay Oingo boingo's full name yeah Oingo Boingo is they they eventually Boingo oo Boingo to Boingo but they were something before I don't know it was something weird like the like the something nights of the oo boo oh yeah that might that that might sound Vaguely Familiar all I know is that the singer did all of Tim Burton's yeah Danny Elfman Danny Elfman yeah okay awesome that's who's Jenna Elfman's uncle no way yeah really or wait daughter-in-law something they're there's a she married uh she married somebody in his family okay wow interesting that's all I know that's good yeah how was a dynamite drop in I I thought we were losing you we were losing you with Theos and then there was no I really spaced out I was like I don't know bands it's really I don't really know bands either I just know bands that appeared in'80s movies cuz I love'80s movies a",
      "start": 807.76
    },
    {
      "text": "Theos and then there was no I really spaced out I was like I don't know bands it's really I don't really know bands either I just know bands that appeared in'80s movies cuz I love'8 0s movies a lot all right all right I think we got a lot done here today whether PA freedom of speech Felicia Day's book which is available where Felicia Day book.com it's good please pror it means a lot it's a good URL yeah it is we were like well Felicia day .com was already taken yeah jerks I mean I took it oh yeah I I tried to get a Snapchat the other day finally I was like no you're way too late on that bet so late but I I still don't I don't like it is that an old thing to say I mean that's not an old thing to say there's too many **** things I can't do it all we we are late on I mean I'm I chat's a whole thing man it's it's not but if you nail it it it'll get it Nails you good yeah I tried to get Snapchat yeah and when I couldn't get game over game like I'm not going to do this I didn't either well no",
      "start": 854.56
    },
    {
      "text": "man it's it's not but if you nail it it it'll get it Nails you good yeah I tried to get Snapchat yeah and when I couldn't get game over game like I'm not going to do this I didn't either well no I did a while ago I I probably somebody had already got my which just like what yeah so and then the same thing happened on Tumblr and I tried to get my name there and the girl tried to charge me $ 10,000 like you know Screw you so I got this The Guild wasn't that successful this Felicia Day and why I have this fo day on Snapchat but I'm like I'm not I'm not going to put effort into that at Le cuz underscores are just what the cool people do really I think underscores are terrible they are terrible awkward remember when you tweet Nick Scarpino at Nick Scarpino carbon copy all tweets to Nick Scarpino as well he's a genius that got everything he got the.com he got the only thing he didn't get was was YouTube he's a really nice gu here here this is this is you're going to have to take some logic",
      "start": 899.12
    },
    {
      "text": "as well he's a genius that got everything he got the.com he got the only thing he didn't get was was YouTube he's a really nice gu here here this is this is you're going to have to take some logic leaps with us all right stick with me so yeah Nick's always had this thing about having the underscore and there's this other guy named Nick Scarpino who has everything he worked Google forever and he had Tech and so whenever people would tweet topics at us they'd accidentally tweet this Nick scrapo who works at Google and he'd respond he had fun he'talk about the show every so often and keep on going yeah yeah then now here's where it gets really weird and shows you how small this Earth is Nick Scarpino leaves Google to go work the real Nick Scarp ino not me yeah yeah the real from now on Nick Scarpino is Nick Scarpino if I say Nick uncore scarpo the fake Bizarro Nick Scarpino leaves Google to go be like head of marketing for Portillos which is my favorite restaurant where I grew up at and",
      "start": 941.24
    },
    {
      "text": "scarpino is Nick Scarp ino if I say Nick uncore scarpo the fake Bizarro Nick Scarpino leaves Google to go be like head of marketing for Portillos which is my favorite restaurant where I grew up at and that this dog is named after what the hell and it's like out of all the the weird threads in our lives this guy we only know because people Mis tweet at this Nick Nick Scarpino now goes to work inst like bested me again here's what you need to do this no this is what you need to do okay you need to go legally change your middle name to underscore oh my god oh **** and then but just the underscore yeah or do I spell it uh I think you'd have to spell it okay so you go Nick Scarpino would be your official name yeah and you would best him in every way yeah and it would be cool I like that I like that a lot Tim let's get on this starting Monday I'm now going by would you just call me underscore then yeah that would be your nickname and can we make a lot of cool references like this",
      "start": 978.24
    },
    {
      "text": "I like that a lot Tim let's get on this starting Monday I'm now going by would you just call me underscore then yeah that would be your nickname and can we make a lot of cool references like this underscores my life oh what I don't know really it's endless it's endless the possibility you're a genius that's why you're like a superstar and we are just sort of crowded around you not at all it's amazing like if you look at the framing everyone's separated from you because you amazing light it's probably my Bo is that what sleep smells like no it's it's I'll never forget that the horror I had just for a second I was like what what I do it really awkward I am I asleep and it was his fault it was his take to the camera that I felt the energy of it was no I felt something I felt I feel things not in a weird movie G that but I could tell there was something going on behind my back as an actor you always have to be aware of **** that's going on behind you so you don't miss stuff",
      "start": 1022.24
    },
    {
      "text": "things not in a weird movie G that but I could tell there was something going on behind my back as an actor you always have to be aware of **** that's going on behind you so you don't miss stuff so I was like I know what's going on over here and then looked innocent you looked like you wanted to be innocent and then I was like it was I didn't do anything so you feel things like mentally as opposed to Kevin you who who feels things with his Tong only through with his tongue he's like he's like P Kevin I know you seriously it's hot oh don't cry come on it's hot Kevin come on he's breaking down you're doing God's work ladies and gentlemen that's the game over grey show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your music if you like that you can get the show super early on Friday over at patreon.com kindof funny or you can go buy it on band cam Vimeo all those things if you don't want to give us any money no",
      "start": 1066.68
    },
    {
      "text": "music if you like that you can get the show super early on Friday over at patreon .com Kinda Funny or you can go buy it on band cam Vimeo all those things if you don't want to give us any money no big deal you can go to youtube.com/ Kinda Funny Monday through Thursday where we break the show out topic by topic before posting the entire thing as a video and MP3 on podcast Services yeah so go to iTunes and search for Kinda Funny both of our podcasts will come up there Felicia Day thank you so much for gracing us with your this has been amazing thank you it was really fun I'm going to steal your dog okay that's fine don't worry everybody everybody threatens to really Veronica has tried many a times she's got a pretty cute dog I know she does yeah her dog is pretty a my dog is pretty awesome except he's old so Downer Downer and down how old how old is the dog he's at least 13 and he can't get up and off the ground very easily and he's deaf and Pella is 10 this summer and he's going",
      "start": 1107.76
    },
    {
      "text": "except he's old so Downer Downer and down how old how old is the dog he's at least 13 and he can't get up and off the ground very easily and he's deaf and Pella is 10 this summer and he's going blind oh no that's why he likes me he's what sleep smells like uh go pre-order the book Felicia Day book.com subscribe to geek and sunry yes uh watch The Guild on Netflix or yeah or the YouTubes and I have my own channel fich day twitch everything I'm everywhere and I'm inside you wow well there you go you that's the reason to subscribe right there ladies and gentlemen until next time it's been our pleasure serving you",
      "start": 1144.08
    }
  ]
}
