{
  "id": 648,
  "video_id": "kR6_DdR1FAA",
  "show_name": "The GameOverGreggy Show",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino", "Colin Moriarty"],
  "title": "The Legend of Freak Nasty - The GameOverGreggy Show Ep. 64",
  "description": "Mike Drucker wants to know Nick's daily hair routine, Colin Moriarty delivers part one of the Kinda Funny survey results, Greg Miller wants to know our craziest sleep deprivation stories, and Tim Gettys has beef with bumblebees cause they are dumb. (Released 02.20.15)\n---\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1425019290,
  "duration": 6949,
  "transcript_chunks": [
    {
      "text": "[Music] what's up everybody? Welcome to the GameOverGreggy Show . I'm one of your host, Greg Miller, alongside the producer, SL Seducer, Nick Scarpino. Ola Ola indeed. You're one one of your favorite your favorite video shirts. This is my this is my happy shirt. This is the Wolverine shirt. Why are you happy today? It's just a good day. It's Tuesday, isn't it? Wednesday? It's Tuesday. We did a great 24-hour live stream yesterday. You did a lot of that. I did four hours of that. Oh man, you really pull burned the midnight oil on that one over here. Here the pride Long Island colore y hello. Hey, how are you? I'm good. How are you? I'm good. I like your shirt a lot. Shovel Knight. Thank you. I picked this design out . You can find it on uh on the internet. So you're admitting to being in the money hat for Shovel Knight? No, you're you're admitting to being in the T-shirt hat for Shovel Knight. Shir you're in you're admitting to liking designs. Yep. All right, we got them. We nailed them over there. The P one, Tim Gettys, let's get",
      "start": 2.82
    },
    {
      "text": "you're you're admitting to being in the T-shirt hat for Shovel Knight. Shir you're in you're admitting to liking designs. Yep. All right, we got them. We nailed them over there. The P one, Tim Gettys, let's get nasty now. T Jesus God, the new thing. I think so. You're a nasty **** according to that. Let's play that. That got a lot of pickup. A lot of people were tweet me about that ****. Um before we go any further with this show, I'm sorry people listening to MP3, you got screwed over. Tim, you're wearing a new shirt. I am wearing a new shirt. Thanks for bringing this up. No problem. I know it means a lot to you. It's not a pigeon shirt and it's not a black v-neck. It's not. It is a it's the new blue v-neck from Express turquoise. Every year they uh they have yes yes, but every year they have three different Blues. This is uh the new shade, so I had to get it. I'm pretty excited. Is this a real thing? Like they say this is the new hey, we're expressing this is the new you just notice I like like had before very very",
      "start": 71.12
    },
    {
      "text": "this is uh the new shade, so I had to get it. I'm pretty excited. Is this a real thing? Like they say this is the new hey, we're expressing this is the new you just notice I like like had before very very happy about it. You look good on camera. The color of Native American beads. This is what it reminds me of. You know, like you see Native American uh a good friend of mine told me the Native Americans like to be called Indians. They do me yeah, so why you backing down Indian? Because Indian beads is like a little well like you can use the word Indian to describe Native Americans and in fact that is not offensive at all. But if you're talking about something that could be Indian from India yeah, Indian jewelry then then we're not talking about Indian jewelry. We're talking about Native American Jewelry. Understand what I'm I do. I think you explained it very well and I like to shake your hand. I appreciate working with you but but turquoise always reminds me of of Native American children. Yeah yeah I",
      "start": 108.52
    },
    {
      "text": "understand what I'm I do. I think you explained it very well and I like to shake your hand. I appreciate working with you but but turquoise always reminds me of of Native American children. Yeah yeah I don't know why reminds me of just broke ass shirt. It's not no broke ass shirt. B ass shirt. I was thinking that uh we should just sell black v-ex and call it I was going to say this happened yesterday. Uh we did if you didn't if you're in a time capsule overnight, we did do a 24-hour live stream Pretty 19 hour 19 hour live of The Walking Dead where I played it through Walking Dead seasons 1 400 Days in season 2 and everybody's when you guys popped in I'll head a little bit different but you did come up with the idea that we need to sell the Tim shirt on districtlines.com that is just a black v-neck yeah it's genius and that's all it is like we went that sounds like a great idea that's I man I'm I'm right behind it I'm good for it I think we should do it also on you black v- ex up on the site",
      "start": 148.56
    },
    {
      "text": "yeah it's genius and that's all it is like we went that sounds like a great idea that's I man I'm I'm right behind it I'm good for it I think we should do it also on you black v-ex up on the site by the time this posts I can I can try I'm putting it down I can try I think this is a brilliant idea what if we do it as just the limited edition Tim shirt on kindafunny.com you only do 50 of them like we did with the Portilla shirts all right there you go there you go go to kindof funny.com store our are really working right now look for the Tim the official Tim shirt what are they calling it The what what's up the Tim shirt yeah it's the Tim shirt the Tim shirt put it up as the TT let's call it the The Legend of Freak Nasty shirt no that's cuz Legend of Freak Nasty needs to be his own thing that's I got I want to put something on the shirt though can I put like just an out like a very faint outline of view just like I mean but that's like that's not that's the opposite of what we're",
      "start": 188.0
    },
    {
      "text": "that's I got I want to put something on the shirt though can I put like just an out like a very faint outline of view just like I mean but that's like that's not that's the opposite of what we're saying you're right take your design and shove it up your ass we see we're going to sell three of these but the good news is that we won't we won't eat any of the costs cuz they literally don't have to print any exact exact genius it's a really good idea but what you really should buy is on kindafunny.com store this guy oh yeah oh yeah the panda Ghostbusters 2 painting that's hung behind us here on the game over grey set forever so many people have been tweeting at us like when can we buy this poster can we buy this yes now you can at ky.com store and it's really cool I got my room the T Tim t-shirt the Tim v-neck bu the Tim v-neck too yeah do you really have one in your room of this yeah of course I do are you kidding me frame it with pride and put it in your bedrooms yeah as well replace the",
      "start": 231.28
    },
    {
      "text": "the Tim v-neck bu the Tim v-neck too yeah do you really have one in your room of this yeah of course I do are you kidding me frame it with pride and put it in your bedrooms yeah as well replace the pictures of your children I'm sure Tim you know gets has a drink in him just the one he has a Zema and then he brings the girl back to the brings the girl back to the crib and she opens they open the bedroom door and there's a **** a painting of him shirtless with four other shirt first question always where are they where are they I'm just like let's go let's go to the studio uh you brought up something interesting I usually do you you are a very interesting fellow please tell this the legend of freak nasty you gave the legend of freak nasty the story on the live stream but I worry not everybody gets the Twitch video on demand I don't want this to Fade Into Obscurity I'd like this to be part of the this is a big part of my upbringing really uh when I was young me and my little brother",
      "start": 269.04
    },
    {
      "text": "gets the Twitch video on demand I don't want this to Fade Into Obscurity I'd like this to be part of the this is a big part of my upbringing really uh when I was young me and my little brother would go to buy Pokemon cards and on the way to the card store there was this like Park that you had to walk through um similar to Golden Gate Park but smaller and we walking Park yes we we're walking through it I was maybe 12 my brother maybe 10 and um all of a sudden this homeless man comes out and starts speaking to us and he wasn't really asking us for money he wasn't really like asking us to do anything usually homeless people ask you to do things um he was just telling us stories and he was just telling all this **** and like we were just kind of like he just walking alongside you walking with us just kind of talking we weren't scared of him he was like just like all right you just you're just a dude doing this and then all of a sudden he started getting like s Tom about women and like",
      "start": 311.32
    },
    {
      "text": "us just kind of talking we weren't scared of him he was like just like all right you just you're just a dude doing this and then all of a sudden he started getting like s Tom about women and like women he's been with so we're interested cuz we're 12 and 10 um you you stop at this point well no no no we're still walking I mean we weren't going to stop in the park with this guy like we weren't scared but we weren't like completely not scared you know what I mean so we we just we're like also we need to get our Pokemon cards of course those first edition booster packs like What's happen Charizard you got to get them so we're on the way and then uh then all of a sudden he just things get they just take a turn for the worst really or the best I'm not really sure but all of a sudden he just goes they call me nasty for weak nasty and I'm all about getting in that ass we were like holy **** and at that point do you think he meant that figuratively or literally getting in that he wasn't",
      "start": 350.6
    },
    {
      "text": "goes they call me nasty for weak nasty and I'm all about getting in that ass we were like holy **** and at that point do you think he meant that figuratively or literally getting in that he wasn't talking about us though like that's the thing a lot when I've told the story before people are like you were about to get raped by a homeless man no no he was about getting the asses of just other Royal the Royal we but yeah freak dasty okay the legend will live on for getting up in that ass who is ass ladies and gentlemen this is the game over gregy show each and every week four sometimes five best friends gather on this table each bringing a random topic of discussion for your amusement if you like that the whole show posts each and every Friday on patreon.com kindafunny for Early Access if you don't feel like giving us money no big deal over on youtube.com/ kindafunny it's broken out topic by topic day by day until we post the entire thing on MP3 services and YouTube on Friday we're",
      "start": 385.64
    },
    {
      "text": "you don't feel like giving us money no big deal over on youtube.com/ kindafunny it's broken out topic by topic day by day until we post the entire thing on MP3 services and YouTube on Friday we're everywhere we're everywhere now whever you want to be everywhere [Music] toing him or are you like is that like the the waves in the no I'm shushing I'm definitely shushing him I don't want to hear thatone you remember Michelle Branch yeah how could I for got to dive AC crush on Michelle you remember Stacy Oro no shout out to Stacy Oro I don't know if I remember her got to be more to life who Stacy Oro there's got to be more to life it's kind of insulting that you're bringing this woman up in the same breath as Michelle bran michan start start picking your words St Rico and um Vanessa Carlton Vanessa Carlton contemporaries might as well be freaking still very **** insulting because no the Stacy woman I've never heard of Stacy was the kind of hip-hop one that did some **** with jyn shout",
      "start": 433.52
    },
    {
      "text": "Carlton contemporaries might as well be freaking still very **** insulting because no the Stacy woman I've never heard of Stacy was the kind of hip-hop one that did some **** with jyn shout out to JY shout out to Too Fast Too Furious it's insulting that you're doing this I'm sure Stacy Stacy had to come along after Michelle Branch and Vanessa Carlton they burst on the scene when I was like 2001 when I was when I was all about them I would think about all of them at the same time in M like in a timeline or like in a fantasy fantasy okay that's fine that's They're all playing music and you're just dancing in the S she baby dance it making my way down it's actually a really good song oh my God that album was good too they made her change one of lyrics though when she got on the album like I this is right when lime wire hit so I could get all the you know stuff before it was like I got all of her like live stuff when she was trying to find a label and then you went and listen to the",
      "start": 482.4
    },
    {
      "text": "I this is right when lime wire hit so I could get all the you know stuff before it was like I got all of her like live stuff when she was trying to find a label and then you went and listen to the album they put out and they had to change a bunch of stuff divide and conquer this world that's not the real lyrics that's not what it was supposed to be then Michelle Branch I bought her album through I assume her mom or somebody cuz I bought her like like her independent like pressing you know what I mean where I was like oh cool I mail away for this and then it came back to me in like a handed addressed envelope or whatever I thought that was dope cuz that the original one not 1,000 miles it was like just 900 miles that now you're going back to the wrong person they change van you know come on I surprised me that she had an independent career at all she had record label written all over her Michelle Branch I I think it was like you put out your first album and then you you sell that oh",
      "start": 529.12
    },
    {
      "text": "on I surprised me that she had an independent career at all she had record label written all over her Michelle Branch I I think it was like you put out your first album and then you you sell that oh yeah I I I always assume she was just totally manufactured the big mystery the big mystery about Michelle Branch and I'll tell you and this is without ever having looked at her Wikipedia page or but I've read a lot of interviews about her is that on that album I got right broken bracelet this independent label she put out all of the photos all the promo photos of Michelle Branch she had um why were you so into Michelle Branch loved her music she's an amazing artist she was beautiful of course but that was just the her music spoke to me much like T Swiss she was no station Rico though anyways she had I like I would say a birth mark or something it looked like around her her eye like gof yeah some of that I was it was like the photos on the broken bracelet album sleeve were all black and",
      "start": 562.92
    },
    {
      "text": "she had I like I would say a birth mark or something it looked like around her her eye like gof yeah some of that I was it was like the photos on the broken bracelet album sleeve were all black and white so it was always is it a shadow I don't think so because it's in every photo that's an impossible Shadow that's impossible not how Works something always floating around but then never every professional photo you've ever seen of her never had it I follow her on Instagram for a while when I Instagram yeah recently recently **** Instagram back Michelle Branch has an Instagram right but she's all she now she's all like about being a mom and like oh my God healthy eating stuff and it's like I had bail I had a bail out nothing worse than that yeah no so I don't know I when I meet Michelle Branch and we have her on the game over gy show question number three will probably be what's up with your face on the Spirit Room album sleeve that's all I want I'm sorry broken bracelet Spirit was",
      "start": 598.16
    },
    {
      "text": "Branch and we have her on the game over gy show question number three will probably be what's up with your face on the Spirit Room album sleeve that's all I want I'm sorry broken bracelet Spirit was one afterwards sorry broken bracelet is one I'm interested in I don't you should ever there's a fascinating fascinating story in the sleeve about broken bracelet cuz it was named after about broken bracelet right it's this album's named broken bracelet it was because Jewel's manager when she he saw her perform or met her whatever yeah je remember in he G yeah that was a later song but yeah was okay thank you she was hot in that video if I remember there was the freaking water going everywhere yeah she was actually like really hot like surprisingly hot in that video okay good juules manager gave Michelle Branch a little bracelet to wear and he said when this breaks you'll be famous and it broke the day she signed the deal for the album that bro was amazing man are you done the legend of",
      "start": 637.72
    },
    {
      "text": "gave Michelle Branch a little bracelet to wear and he said when this breaks you'll be famous and it broke the day she signed the deal for the album that bro was amazing man are you done the legend of Michelle Branch Michelle Branch is it Liv the legend of freak nasty the legend of Michelle Branch Legend of Michelle Branch sounds like a like a hidden object Adventure game on PC please name this episode The Legend of Michelle Branch AKA freak nasty freak nasty get up in that ass Nick yes what's your topic my topic of course always comes from our lovely Community which you can find me if you have a topic on Twitter Nick Scarpino if you have topic suggestions please send them forward and we might be able to put them on the show but Greg yeah that's not the only Community we have on YouTube we also have a very we have a we have a thriving community on Patreon community oh my God yeah yeah it's thriving the whole Patreon Community is the whole reason we're able to do this now it's our",
      "start": 675.0
    },
    {
      "text": "we also have a very we have a we have a thriving community on Patreon community oh my God yeah yeah it's thriving the whole Patreon Community is the whole reason we're able to do this now it's our full-time job if you want a Surefire way of getting your topic on the show you can go to patreon .com of funny and there is a tier where you will we will allow you if you if you buy into it to get your topic just like an old friend of ours Greg of came out of the woodwork to spend money on us to be's not doing anything actually he's probably shiftless lay about he's not working on anything in in in particular at all yeah he's probably this close from just ending it all if I had to guess Jesus God who what friend do we have this big of a failure it's our old friend Mike Drucker oh yeah lead writer on up at noon the original up at noon writer so and literally after that it was all downhill for there he got some other job on someone's show I think his name was someone like Jimmy Kimmel or Fallon",
      "start": 718.44
    },
    {
      "text": "on up at noon the original up at noon writer so and literally after that it was all downhill for there he got some other job on someone's show I think his name was someone like Jimmy Kimmel or Fallon or something like Jimmy Fallon he writes for The Tonight Show M writes for The Tonight Show yeah he's actually super successful Mike we love you uh so this was chump change when he gave he when he bought this was he found some pocket lint and threw it at Patreon and and he bought us for an entire 30 minutes that's how cheap we are um but thanks to Mike trucker we now have this lovely uh topic to to throw at for all you know our suggestions and amusement uh Mike Ducker says I would like the three of you the three of you okay uh to comment on a live stream of Nick Scarpino's morning hair ritual now we can't do a live stream because that would require a lot of setup and my bathroom's not quite big enough for that but Greg if you want to open up your laptop I've prepared a little bit of a",
      "start": 756.24
    },
    {
      "text": "now we can't do a live stream because that would require a lot of setup and my bathroom's not quite big enough for that but Greg if you want to open up your laptop I've prepared a little bit of a video for you guys to watch Jesus and before we get into it yes I was naked the entire time this film who filmed it I waited so long for this no I didn't film I wasn't invited put oh did your wife do it that makes more sense I had to have my wife do Superman's back there by Leon from Resident Evil 4 if you're looking for him which by the way there's nothing more uh humiliating than having to film something in front of your wife that doesn't think you're very funny I just want everyone to know that I want everyone to know too Colin's girlfriend Cheryl right now has begun blending something M she's making orange juice but putting an apple in it yeah I don't know how I feel about that it's like solving racism Greg or poverty there's been fights between orange juice and apple juice for years oh so",
      "start": 795.16
    },
    {
      "text": "orange juice but putting an apple in it yeah I don't know how I feel about that it's like solving racism Greg or poverty there's been fights between orange juice and apple juice for years oh so she this is fight too who who who would drink apple juice over orange juice Fu blunderous fuing your blunderous **** journey through life that brings you to apple juice is the homey and it always has been apple juice I'm not saying apple juice ain't a homie I'm just saying that what what does that make orange juice like the Monarch basically because it's it's the ultimate orange juice is that like Punk on the corner that you don't want nothing to do with d first or second grade at lunch I mixed in a cocoa packet to a thing of apple juice barfed on the bus on the way barfed on the bus on the way home so sick did you cry man you you're a childhood dude like I I want to just go to Illinois one one week and just talk I want to do nothing but talk to your parents and your old teachers and some",
      "start": 832.76
    },
    {
      "text": "home so sick did you cry man you you're a childhood dude like I I want to just go to Illinois one one week and just talk I want to do nothing but talk to your parents and your old teachers and some select friends to see just how **** twisted your your childhood was because there's something there's a Common Thread between all the stories that you tell whether it's you throwing pee on your wall whether it's you buying two of every action figures that you keep on in the package about you showing your girlfriend your toys when you're like 16 years old the Common Thread is that some switch is loose in your head Greg that's the Common Thread yeah there's a there's some sort of circuit or transistor there game over gregy show is well aware that there's a switch loose in my head all right here comes the video from [Music] Nick what's up everybody it's me Nick Scarpino and I'm going to show you how I do my hair in the morning here we go okay the first thing you want to do is start off with",
      "start": 874.52
    },
    {
      "text": "comes the video from [Music] Nick what's up everybody it's me Nick Scarpino and I'm going to show you how I do my hair in the morning here we go okay the first thing you want to do is start off with a nice clarifying shampoo like my wife's kist get all that nasty stuff from the night before out is your girlfriend sweat filming this brother get all up in there a little Mohawk action my girlfriend now that we've shampooed it let's go style [Music] it when it comes to drying I like to air dry like Cuba Gooding Jr from the movie Jerry McGuire I get a little light towel but I never blow dry because blow drying destroys the hair before we get to styling I want to talk to you a little bit about hair loss prevention there are two main drugs in the market right now you can use for that one is called finesse dag which is the generic version of tracia the other one is called Rogan which I'm sure you've seen the men's hair Rogan commercials all that stuff before you use either of these please",
      "start": 917.72
    },
    {
      "text": "finesse dag which is the generic version of tracia the other one is called Rogan which I'm sure you've seen the men's hair Rogan commercials all that stuff before you use either of these please consult your doctor for Best Practices it might not work for you so go talk to a professional but I'll show you how I do it now propa is a pill that you take by the mouth once a day not anally as I came to learn the hard way it tastes like a pill I just started using this next product so jury still out as to how well it works I stand by the propa but as far as dran is concerned we got a month or two before I can actually tell anyone if it's working for me but the goal is to really fill in these little spots right here and try to get my drum major hairline back I'll show you how I do that take a little bit of this back boy right here all right you got about 1 ml I know these are a little dab it on a little bit right here now the goal of course is not to necessarily grow back what I had when I",
      "start": 965.44
    },
    {
      "text": "bit of this back boy right here all right you got about 1 ml I know these are a little dab it on a little bit right here now the goal of course is not to necessarily grow back what I had when I was but we're going to try to get that hairline a little bit thicker just so that when I'm on camera I don't look like everyone's old grandfather who perversely tries to hug young girls a little too closely we going do the same on this side don't worry man you got to make sure this stuff's only FDA approved for the back of your head but I'm I'm I'm a rebel I'm going I'm going hardcore the front of the head and I think the reason they have it FDA approved for the back of the head and not the front of the head is because if it gets in your eyes it burns like hell so you're going to want to make sure you take a little bit of this J and just kind of sop up the extras here don't laugh at me and that is the r like I said you can check back with me in a month or two and I'll let you guys know how it",
      "start": 1005.76
    },
    {
      "text": "you take a little bit of this J and just kind of sop up the extras here don't laugh at me and that is the r like I said you can check back with me in a month or two and I'll let you guys know how it goes now let's style now once your hair is adequately dried I like to apply two products one is this kerastas molding paste this is a nice lightweight paste that throughout the day is going to kind of dissipate so you're not going to go to bed and feel like you got a lot of heavy stuff in your hair in case you don't shower at night the other is this Bumble and Bumble hair sort this is a very lightweight hairspray you want a little bit more of a hold you can go with a purple this thing is like will shellack the sh out of your hair take a little dabble little dollop like so get it all up in your palms and you kind of just kind of rub it in a little bit start to sculpt as you go if you want to Def find that part now is the time to do it make sure it's kind of where you want it I'm going to",
      "start": 1047.96
    },
    {
      "text": "palms and you kind of just kind of rub it in a little bit start to sculpt as you go if you want to Def find that part now is the time to do it make sure it's kind of where you want it I'm going to make sure it gets a nice little hold in place wow you really go all in huh and that's it there you go that's my morning hair ritual thanks so much for watching everyone a special thanks to Mike Dreer for making this happen Mike we miss you and we want your body I don't know what I expected when duer requested it but I didn't expect it to be that good that was fantastic that was great so now I have a quick question that will already be answered in evidence to the people watching this are we going to show that in direct feed or I'm GNA direct I'm gonna **** around in a bit I don't think that we should show it I think we should put a link to it and we're gonna upload that video separately really yeah I think we should upload it separately yeah but I think we should b roll it here I think we",
      "start": 1089.04
    },
    {
      "text": "should show it I think we should put a link to it and we're gonna upload that video separately really yeah I think we should upload it separately yeah but I think we should b roll it here I think we should be roll it okay cool cool cool cool but for the audio version yeah sorry you got to come watch that video YouTube youed to film that the iPhone you I was going to say it looks like you used our our $8,000 camera no I just used my iPhone I was going to use my wife new iPhone but she quote said you'll get it all icky so she would not let me use what is that a five this is my 5S yeah I thought the quality was yeah they just announced they announced today that uh an episode of Modern Family is going to be shot entirely keep hitting this thing entirely on um iPhone products or Apple products so MacBooks I and iPads **** Le's coming in to direct it with his iPad I wanted to actually test my wife my wife just got an iPhone 6 uh not the plus you got the regular 6 I wanted to test it and",
      "start": 1137.04
    },
    {
      "text": "so MacBooks I and iPads **** Le's coming in to direct it with his iPad I wanted to actually test my wife my wife just got an iPhone 6 uh not the plus you got the regular 6 I wanted to test it and see if it's if it's actually a better Clarity versus this but it ended up working out you know when used to film with like the fours and it would give you that 956 by like the weird something ass weird resolution it was always disgusting this actually turned out nicely it it's nice the six is way better you can't quite make out the the the hair on my shoulders cuz I was going to have my wife Nar me before I did it and she was like I thought you said quote unquote own you're going to own this and I was like all right this is this is where I'm at so if you look closely you can see some uh I needed to manscape a little bit more so we've seen it now yeah you heard it now yeah now we get to commentate on it sure it was very good thank you uh you do use a lot of hairspray I do I I I do well",
      "start": 1178.12
    },
    {
      "text": "needed to manscape a little bit more so we've seen it now yeah you heard it now yeah now we get to commentate on it sure it was very good thank you uh you do use a lot of hairspray I do I I I do well here's here's the reason I don't like the purple hairspray because it actually stays in your hair too much when when you wake up the next day it's still in it the that that light Bumble and Bumble hairspray it actually goes away after a while I can run my hand through my hair I don't feel like it's a hair helmet and then it gets kind of a little bit more volume in it not not right now but throughout the day as you kind of keep rubbing your hand through your hair that all that stuff kind of stays and gets a little more volume to it um but yeah that that's that's that now come talk to me about the hair loss so yeah was there concern number one of admitting to using Rogaine or anything no I mean that's what I like to hear you're yeah I mean the fact of the matter is I've been using talked",
      "start": 1211.76
    },
    {
      "text": "the hair loss so yeah was there concern number one of admitting to using Rogaine or anything no I mean that's what I like to hear you're yeah I mean the fact of the matter is I've been using talked about propia for a while I don't know if I talked about it recently but uh back in the day my brother's bald my dad's bald um so I started thinning and I was like I'm going to go I'm going to check ask my doctor if there's anything that he recommends because I really don't want to lose my hair it's kind of not great um and it still continues to thin but the great part about the propa it doesn't grow the hair back it just it stops the thinning it stops the actual hair loss and my doctor was actually cool I went to him I was like hey this prous like 100 bucks a month is there any like should I take it and he goes well don't take that but if you take finesse ride which is actually a pill you take for prostate cancer if you take a smaller dosage of it every like day or every other day um and he",
      "start": 1250.36
    },
    {
      "text": "it and he goes well don't take that but if you take finesse ride which is actually a pill you take for prostate cancer if you take a smaller dosage of it every like day or every other day um and he gave me the correct dosage and you have to cut the pills in half but he's like that is an actual generic version of it and it's only like 10 bucks a month so for $10 plus I get like free refills you're fight cancer I I don't know if you are or not I super you're over you're double jeopard you can't get it can't ever get yeah I can't ever get any type of cancer now you got the antibodies thanks largely this no that's not correct at all um yeah I I don't know why for some reason you people your anti cancer Vision I'm like I'm fascinated by the concept of Rogan so I'm going to try and use it um again it's only really supposed to be it's only FDA approved for the back of your head which is interesting so you're going rogue though I love it well I read a bunch of reports that said the only they",
      "start": 1283.72
    },
    {
      "text": "it's only really supposed to be it's only FDA approved for the back of your head which is interesting so you're going rogue though I love it well I read a bunch of reports that said the only they just didn't they had to do these crazy clinical trials that cost a lot of money so they only did it on one part they just didn't waste any money on the front of the head sure um but everyone says that it sort of works follicles but the concept behind Rogan is that exactly it's the same skin same follicles is that it's supposed to actually physically regrow the hair so I'm just fascinated about I'm trying it for a couple months if I get anything if if I don't get anything I'm not going to waste the money on it but they also have another generic version that you can buy too cuz it's just it's one it's like two simple ingredients like water and like monoxil 5 which is just or 5% monoxil whatever this chemical is so I'll probably downgrade to the generic version if I see enough tick in the old",
      "start": 1318.28
    },
    {
      "text": "it's like two simple ingredients like water and like monoxil 5 which is just or 5% monoxil whatever this chemical is so I'll probably downgrade to the generic version if I see enough tick in the old hairline but we'll see okay I've always been interested in your hair because you're you're very self-conscious about it I feel more so than you should be cuz your hair I would describe with many adjectives and they're all good yeah yeah all positive all of them like you're I would say you have awesome hair thank you it is amazing hair the thing about it is this though and this is why you know Greg when you asked me to this video I was like should I show the full shebang the whole thing and I think it's important just because if you notice that you are having signs of hair loss and this happened you know I started like looking at my hair and thinking it was thinging right around the time I was like 24 25 um start go to your doctor and ask him you know ask him if there's anything you can do",
      "start": 1347.68
    },
    {
      "text": "you know I started like looking at my hair and thinking it was thinning right around the time I was like 24, 25. Um start go to your doctor and ask him, you know, ask him if there's anything you can do about it and he might recommend some of these products and I I think Propecia works. I think at least it stops the hair, but you know, again it or the hair loss. Again, it's it's not 100% in everyone . Everyone has different there are some side effects so make sure you talk your doctor. One of the side effects that says uh when you read online is a loss of sex drive, which I have not found to be the case. Um as my wife, your wife's like begging, praying every night that that kicks in. She would like me to stop pawing at her like a dog humping the furniture. Um but yeah, I don't know. To me , I think it's just important that everyone kind of sees this as far as my hair is concerned. Yeah, I mean it used to be thicker. If you look at that picture I tweeted out when I was a drum major, you can see I had I had a",
      "start": 1387.16
    },
    {
      "text": "important that everyone kind of sees this as far as my hair is concerned. Yeah, I mean it used to be thicker. If you look at that picture I tweeted out when I was a drum major, you can see I had I had a ridiculously good like deep Widow's Peak and the hairline was just so thick and it's just not that thick anymore. So we'll see, we'll see if we can get it back or at least some of it back. Hold on, I'm putting down the drum major photo. I need to insert what's also interesting is your beard. Like I feel like a lot of your you have probably the most full beard I've ever seen. Thank God for that. But you know how it always goes when you start losing it up top, you start growing it on the bottom. So from literally the chin down, I'm just I am just a Sasquatch. If it ever comes to the point of giving in, give in at Halloween. This goes Max Payne 3. I could do that. Max 3. I might just go as John Mclane from Die Hard 4. Well no, but oh, did he have a beard in it? No, he just uh well shav well Max Payne has the beard like",
      "start": 1426.28
    },
    {
      "text": "at Halloween this goes Max Payne 3. I could do that. Max 3. I might just go as John Mclane from Die Hard 4. Well no, but oh, did he have a beard in it? No, he just uh well shav well Max Payne has the beard like you have and then anyways, um so let's talk a little bit about the phases of your your hair though cuz there's there's a very clear Line in the Sand when you go back and look at old IGN videos or you look at old photos from us being friends or whatever and then there was this point where you jumped and where you went from being I don't know fat Vin Diesel to being like Oh my god, well put together Nick Scarpino. Now Nick Scarpino now has his **** together. He's a lady killer. He looks amazing. And then just when fat Vin Diesel, he was he was a heavier guy in a track suit with a shaved head. Yeah, there was a when I I started IGN and I was like I think I was about 23 lbs. Um and I'm only 5'8 so that's that's a that's a squatty looking human being right there when you're when you're pushing 200 lbs",
      "start": 1459.76
    },
    {
      "text": "was a when I I started IGN and I was like I think I was about 23 lbs. Um and I'm only 5'8 so that's that's a that's a squatty looking human being right there when you're when you're pushing 200 lbs or above and you're not six six foot and some some change uh you're not feeling good about yourself and I just started watching my diet started working out a little bit more um start this started right around maybe like the first year Well IGN when you ever start working on IGN you always gain IGN 15 like the Freshman 15. Did you guys go through that at all? Remember the old off when everything was a quarter and you could just I used to eat like three packets of Pop-Tarts a day. I'm like I'm hungry I'm get a snack I'm **** two Pop-Tarts throw those in. Oh, there's strawberry haven't had one of those in a while throw that bad boy in. But yeah, I just uh I started I actually got some free Fitness training from 24-Hour Fitness where I go to the gym and they were like Hey we're offering like three three",
      "start": 1500.36
    },
    {
      "text": "a while throw that bad boy in. But yeah, I just uh I started I actually got some free Fitness training from 24-Hour Fitness where I go to the gym and they were like Hey we're offering like three three like personal training sessions if you guys want them for free and I was like sure I'll try them and the guy was really bad so I didn't go after three but he recommended an awesome thing to do which was you download an app called My Fitness Pal and there's multiple apps like this this one's free and all you do is you log your food he goes I just want you to log your food don't change how you eat don't worry about anything because I thought I ate pretty healthily and he's like just don't worry about it just just just log your food and we'll come after a couple weeks and we'll look at it and it turned out that I had I was eating probably about 1,500 calories maybe 1,000 calories a day that I didn't need not that it was necessarily bad food it was just calories that weren't you know it wasn't",
      "start": 1540.8
    },
    {
      "text": "out that I had I was eating probably about 1,500 calories maybe 1,000 calories a day that I didn't need not that it was necessarily bad food it was just calories that weren't you know it wasn't lean proteins it wasn't vegetables it was just some extra stuff that I was I was throwing down in the old gullet and anyone tell you you need a calorie deficit of I think it's like 3,500 calories a week in order to lose a pound a single pound so I was like all right I'll give that a shot and slowly but steadily surely I mean it wasn't that hard it was like you know you shave off a couple hundred calories or you know 3 400 calories a day which is really just a couple Cokes or a couple pieces of candy or whatever not into it and you and I started losing weight and I got down and now I'm at about 180 my goal weight is really 175 170 but with a little bit of muscle on me we were talking to Courtney last night who is my personal trainer who lives in New Zealand um never met him this is in the Twitch",
      "start": 1571.8
    },
    {
      "text": "goal weight is really 175, 170 but with a little bit of muscle on me we were talking to Courtney last night who is my personal trainer who lives in New Zealand. Um never met him. This is in the Twitch chat. Yeah, we're in he was in the Twitch chat. He's coming out in March. I'm excited and I was like some woman in courtne he says she sent you this you're like what and then you had to read like oh no that's my personal chainn uh no he's he's he's cool he reached out because he heard me talking about my struggles with weight loss and just staying fit in general as we you look great thank you um but you know it's hard right like every day come here bustering the energy to do anything other than this job that's true that's true um and so he was he was kind enough to reach out and say hey I'll put you know how many days can you work out can you won't I said two and he goes okay well here's a couple exercises you can do here some routines you can do for those two days of workout and then he's like",
      "start": 1609.36
    },
    {
      "text": "know how many days can you work out can you won't I said two and he goes okay well here's a couple exercises you can do here some routines you can do for those two days of workout and then he's like are you doing the paleo diet I'm like kind of and by that I mean not really considering you know cannonballing all sorts of caffeinated Beverages and occasionally just hiding some sweets behind my um teeth um in my throat I just love it when you get going this is what we're talking about Nick gets going he's doing everything fine then he just doesn't know where he's about to go so he's like hiding sweets in my teeth right every like um so yeah I'm just getting back into working out I've just started sort of following his his uh guide uh and it's working and I started doing like I was telling Tim the other day I started doing yoga again with my wife just to increase flexibility yoga is really hard and it's really really rewarding though you just feel great afterward yoga you can teleport",
      "start": 1644.84
    },
    {
      "text": "Tim the other day I started doing yoga again with my wife just to increase flexibility yoga is really hard and it's really really rewarding though you just feel great afterward yoga you can teleport and shoot fire yog you can if you if you actually get up to the higher levels of it um you can get cool like face paint tattoos and just start shooting fire and like teleport all the place so here's the question though in between Vin Diesel look yeah Nick Scarpino look was it a definitive thing of like you're I'm going to get I'm going I'm going to lose some weight I'm going to do all this stuff and I'm going to grow my hair out and grow a beard the beard came as I think you'll probably find in a lot of people that have beards uh Colin can probably attest to this Tim can probably test to this from sheer laziness yep AB that's 100% true you just at a certain point it grows out and you don't it's too hard to shave because at a certain point it gets too long you have to trim it first before",
      "start": 1680.32
    },
    {
      "text": "from sheer laziness yep AB that's 100% true you just at a certain point it grows out and you don't it's too hard to shave because at a certain point it gets too long you have to trim it first before you shave it and I got to the point where I was like I I hate shaving and I hate specifically shaving my neck cuz I have very sensitive skin on my neck and it always gets razor burn so with the beard you can go an extra without having to shave and I shave this once a week and the rest of it grows out and then eventually it grows out to what I call the Colombian drug dealer look um where it's so bushy that you just can't even you can barely see my eyes behind it so I can kind of hide behind it in a movie theater and my wife hates it and that's when I know it's time to kind of trim it up a little bit but also it's very invogue like it's a lot of people have beards now you know magazines are writing about it it's very invogue um you've got people I it's called The Lumberjack or the lumber",
      "start": 1718.08
    },
    {
      "text": "bit but also it's very invogue like it's a lot of people have beards now you know magazines are writing about it it's very invogue um you've got people I it's called The Lumberjack or the lumber sexual called The Lumberjack Lumberjack L sexual the lumber sexual that's what I meant um or the I guess the one is the urban Nomad where you just kind of look like you've been camping out but in the city for the last 6 months and you can go anywhere you have a cool backpack that like it doesn't latch it like ties shut you've been on a Shaman's quest to develop your new app yes I'm trying to be going you've been going through so much I'm trying to trying to the sherpa of online video I want you to have a man bun a man bun I think I can do the problem is like my hair's it's a little too long so now it's a little floppy and it's not it's a little bit thicker flops though yeah I just I got to get a cut a little bit character I got to get a cut but yeah and that's where I was at you know it's just",
      "start": 1753.12
    },
    {
      "text": "it's a little floppy and it's not it's a little bit thicker flops though yeah I just I got to get a cut a little bit character I got to get a cut but yeah and that's where I was at you know it's just been a slow and steady like weight loss progression for me um if you if you're trying to lose weight the best way to do it is really just diet diet and exercise there's no really fans or buts about it you got to just watch what you're eating and make sure you work out two to three times a week and you'll lose weight you will okay that was good thanks anything else to say about your the hair the commentary on anything no I think Nick I I think Nick's very well put together it's funny I've known Nick for a really long time and like I picture and think about Nick back in the day and it's just a different Nick like somewhere along like n Nick that I used to know doesn't exist anymore you exists inside of him of course I think it's one of those things where like a lot of people talk **** and",
      "start": 1791.68
    },
    {
      "text": "Nick like somewhere along like n Nick that I used to know doesn't exist anymore you exists inside of him of course I think it's one of those things where like a lot of people talk **** and myself included about marriage I always joke about it where I always told Tim to stay single for as long as seemingly possible because marriage sucks the soul and you're you're willing to live out right through your ass um but it sucks it through your ass just that's that's how kind of sounds hot I give I give marriage I give marriage a lot of a lot of grief but I really like being married and part one of the benefits of having a full-time sort of live in significant other is that they they tell you when it's time to do stuff like they tell you when it's like hey those jeans you've had since College you should throw out and also that fauxhawk that you're rocking is no longer in vog you should go ask I used to everyone had a fauxhawk back in the day I used to have a faux hawk well I had the makings of",
      "start": 1823.8
    },
    {
      "text": "should throw out and also that fauxhawk that you're rocking is no longer in vog you should go ask I used to everyone had a fauxhawk back in the day I used to have a fauxhawk well I had the makings of a fauxhawk if I had more hair would have been fauxhawk it look more like a just little like a little little Spike that was in you know up there in the rest was kind of mess um yeah my wife really kind of watches it and she she keeps a a good a Keen Eye on when my shirts are getting a little ratty or when it's time to stop wearing the Wolverine shirt I was going to say how much did she hate this Wolverine shirt your Happy shirt like it you have to hide under a floorboard when she leaves you pull it out wear it run to our house I'm pretty sure this is the last wear so I have I'm going to get like two or three days of more out of it and then she's going to get out know it'll it'll just become a workout shirt eventually and then I'll sneak it out of the workout yeah it's true um but no that's",
      "start": 1867.28
    },
    {
      "text": "two or three days of more out of it and then she's going to get out know it'll it'll just become a workout shirt eventually and then I'll sneak it out of the workout yeah it's true um but no that's that's part of the reason is I met my wife about seven seven years ago um and we've had that sort of honest discussion back and forth but and for her as well you know we've worked out together we go for walks together we try to eat a littleit better we are each other's sort of um Inspirations as far as that is concerned so you know I'm going shopping for her tonight CU she's starting a new diet where she wants to kind of slim down a little bit it's all protein so I got to go trade her DRS and get all that stuff for her and she does the same for me um but it really does help having someone else that's kind of a cheerleader in your corner um it's hard to do anything by yourself which is why you all need friends or significant others get damn friends y'all get them damn good friends okay the",
      "start": 1901.36
    },
    {
      "text": "that's kind of a cheerleader in your corner um it's hard to do anything by yourself which is why you all need friends or significant others get damn friends y'all get them damn good friends okay the only I just want to say the only thing I learned from your hair routine is that I always was really I wasn't self-conscious with my hairz I my hair but I was always like what is it like to have hair that you have to do something to because I've never had like I have no choices with my hair I have no choices like it's either like I have to cut it I have to shave it that's the thing you think that but then you do like cuzz I was in the same boat as you for a long time where when I was younger I had just had long hair like I did this the Sea Hunter obviously and then eventually eventually I would like try like you like a butt cut but like comes down and hangs over his ears and stuff so you would do that um but then eventually I started spiking because all my friends were Asian kids and that's",
      "start": 1932.8
    },
    {
      "text": "like try like you like a butt cut but like comes down and hangs over his ears and stuff so you would do that um but then eventually I started spiking because all my friends were Asian kids and that's what they all did and so I like thought I was one of them so I did that for a long time which was just putting gel in it which you could do too it good it just happened but then then I went to this for my what Nick calls my hip-hop phas and um that was that was for a long long time that I did that and I was just like I just can't do anything like when I grow it out it's just fluff and it doesn't look good and like it's just really bad but then I was like oh if I just **** do this **** this happens yeah yeah I just I just I just don't know I mean Greg I think knows better than anyone like I just feel like my hair is in a spot where it's just all **** up you know like it's just it is just he does have text thi it is just thick afro like Brillo it doesn't there's nothing to be done",
      "start": 1968.64
    },
    {
      "text": "I just feel like my hair is in a spot where it's just all **** up you know like it's just it is just he does have text thi it is just thick afro like Brillo it doesn't there's nothing to be done here right now it just feels like a shaved head but like if he if he lets it grow it out to where I like it where it was right before this and you feel it it feels like a Brill pad and it feels like looks like bcro it's Cory Matthews hair and what can Cory Matthew what can what can Ben Savage do with his hair the same hair forever it's just a complicated thing but regardless of I'm sure there's an option I'm sure that there's somewhere out there some someone has we I can go on some sort of spirit Quest if you went if you went to a a stylist or or you can go to my person that I go see named Masha she was my Russian stylist exorbitantly expensive so I'm probably not going to go to Herer you just talked yourself out of con um I bet if you went to a stylist though or a barber and you",
      "start": 2004.72
    },
    {
      "text": "named Masha she was my Russian stylist exorbitantly expensive so I'm probably not going to go to Her er you just talked yourself out of con um I bet if you went to a stylist though or a barber and you grew your hair out they would tell you grow your hair out and you have to get past that transitional phase once it's long enough you might be able to do more of a traditional like um like man's barber cut like that's very popular now which is the barber cut of like having the part having the Don Draper style you know where you have the hair I have no prayer of that Greg bring make sure to bring up the picture of me when I did grow out my hair the one where you like this yeah okay when I didn't cut my hair for like literally almost a year uh yeah it's just but I regardless like I like it's like the same thing I think about with with women every once in a while where it's like they have to you know they don't have to but a lot of women get ready and they put on makeup and they prepare",
      "start": 2044.6
    },
    {
      "text": "like the same thing I think about with with women every once in a while where it's like they have to you know they don't have to but a lot of women get ready and they put on makeup and they prepare whatever and I'm just like whatever you know I just I just like cut my hair whatever I think I think I'm I clean up okay but the one thing I was noticing is that you know uh I think I'm I think I might be starting to lose my hairline a little bit you're not you got a great hairline you're fine I hope I hope it's solid because here's the thing my dad is balding he's you know he's older but the rumor at least the wife's tale was always that you get your hair from your mother's dad yeah so and my mom's dad had i'absolutely have his hair and even when he was he had cancer was getting chemo like had a full head of hair so I was like I'm like this just weird it doesn't make any sense and uh I think I think my hair situation is going to be okay I think you're going to be okay although I will say",
      "start": 2077.96
    },
    {
      "text": "a full head of hair so I was like I'm like this just weird it doesn't make any sense and uh I think I think my hair situation is going to be okay I think you're going to be okay although I will say that the old that old wife still doesn't hold true because my my mother's dad uh on on yeah my my Italian Grand my mother was adopted so I can't I have to remember which dad but her actual biological father had a great full head of hair and my brother is Bal so is my dad so I think I got that Gene from him because I have like my uncle Vince's hairline where it's like super receded but they they do call him Vin Vinnie call him Vin my God you have an uncle Vinnie yeah he's he's an ex cop holy **** yeah he used to be a cop oh oh Colin yes what's your topic uh so on uh Patreon for our Patreon supporters we thank you and appreciate you very much um I thought it would be fun to solicit information from them about what we're doing right what we're doing wrong and also kind of just get just",
      "start": 2114.36
    },
    {
      "text": "supporters we thank you and appreciate you very much um I thought it would be fun to solicit information from them about what we're doing right what we're doing wrong and also kind of just get just general details of who the hell these people are because I'm really curious about you know the demographics of the our Patreon supporters and if there's any you know themes or anything that we can work towards fixing or or continue to do and whatnot so we put out a survey for our Patreon supporters that was live for four days last month and I guess it was actually earlier this month and so February yeah and uh I had some there's some interesting things that I want to share with you guys because you guys don't I've actually been staring at this thing like it's the Matrix for like the last two weeks but you guys have not seen any of any of it so I thought I'd share some of this information with you and this is specifically only going to be the kind of numeric field question so like um you",
      "start": 2160.08
    },
    {
      "text": "weeks but you guys have not seen any of any of it so I thought I'd share some of this information with you and this is specifically only going to be the kind of numeric field question so like um you know things that you can select in other words no essay questions because there are essay we'll go into that later we're doing it as an exclusive episode aren't we yes Patreon exclusive episode will be going into all that Friday the 26th but I'm gonna bring up my gigantic lap right no you're recording Thursday oh you're right that's the point cool yes Jer so I'm bringing up my gigantic laptop here no problem Friday the 27th if you're a Patreon Subs subscriber if you give us $1 or more there'll be an exclusive GameOverGreggy show up that will be this the essay answers this numerical answers okay so uh the first thing I wanted to share with you guys was uh the gender of our audience and this by the way I should preface this by saying this is just Patreon supporters and specifically Patreon",
      "start": 2197.72
    },
    {
      "text": "so uh the first thing I wanted to share with you guys was uh the gender of our audience and this by the way I should preface this by saying this is just Patreon supporters and specifically Patreon supporters that decided to answer Hazard survey oh yeah it's definitely where it's like because it's the goal was like it was a volunteer or whatever yeah it's it's not it's not there's nothing well it's somewhat scientific but I don't know what the uh the I don't know it wasn't a random sample of Patreon users it was the political science person is coming out a little bit so gender not surprisingly overwhelmingly male we do have a uh female listenership at the but our male listenership it it creates about 9 8% of our Patreon oh w 98% yeah according to this now we not every Patreon spoter answered uh but 98% of those that answered were male interesting how old are you this is an interesting thing I thought too uh so the if you want if you want to guess the preponderance of people all so the",
      "start": 2238.16
    },
    {
      "text": "uh but 98% of those that answered were male interesting how old are you this is an interesting thing I thought too uh so the if you want if you want to guess the preponderance of people all so the fields are this I'm not looking 18 or under okay or under 18 so 17 and under 18 to 21 22 to 30 31 to 40 41 Plus I say 22 to 30 is the overwhelming yeah and that also is because that's that's the biggest field as well but yeah a thousand also the coolest field out of 18 out of 1,850 people 1,38 of them between 22 and 30 uh so under 18 is about 4.5% of our audience uh according to this poll 18 to 21 is 22.9% and then 22 to 30 is 57.3% uh 14.4% for 31 to 40 and uh small number I don't I let me see if I can click on it here because it doesn't show up in the field yeah wow it's small uh 41 plus uh is very small let me see if I can find here 0.9% so that's I thought that was interesting yeah skewing a little bit older than I thought actually I don't know if you how you guys feel you thought it was",
      "start": 2281.4
    },
    {
      "text": "very small let me see if I can find here 0.9% so that's I thought that was interesting yeah skewing a little bit older than I thought actually I don't know if you how you guys feel you thought it was going to be what you thought that 18 that's actually pretty close I'm looking up the statistics we have on on YouTube and that that's pretty on par with our audience on YouTube which is a much you a much bigger audience obviously um I think we have yeah the bulk of our audience on YouTube I think is between 18 and 24 though I that might be the difference because we get like a vast percentile of people in that range yeah that's I think that's the key demographic to yeah for if you're an Advertiser or whatever right uh country that you reside in thought this was interesting too please say it's not 100 % UK otherwise they're all going to hate Greg USA so 63.7% of respondant live in the United States not surprising Canada uh is 10.9% and right underneath that is the UK at 10.8% MH and then you",
      "start": 2344.56
    },
    {
      "text": "100% UK otherwise they're all going to hate Greg USA so 63.7% of respondant live in the United States not surprising Canada uh is 10.9% and right underneath that is the UK at 10.8% MH and then you have Australia at 4.8% but 99.9% come from other countries and I went into the this I went in and looked at every one of the Sol every one of the right in fields to figure out which countries were were dominant in that other field because I thought this was really interesting there are two countries in particular that stand out I'm curious if you guys can guess which two countries they are New Zealand yes that's one of them bam the other one anyone Japan Germany Norway Germany's Germany's up there Norway's up there too Ireland so 26 respondents come from New Zealand 20 come from Ireland 14 from Germany 13 from Norway 10 from Mexico 10 from Sweden and then you go down 51 countries responded it in in in the survey 51 countries United Arab Emirates had someone Trinidad and Tobago had someone",
      "start": 2384.36
    },
    {
      "text": "Germany 13 from Norway 10 from Mexico 10 from Sweden and then you go down 51 countries responded it in in in the survey 51 countries United Arab Emirates had someone Trinidad and Tobago had someone respond Luxembourg Hong Kong Czech Republic Egypt Egypt couple people from Russia a couple people from Puerto Rico this is the one thing I struggled with the United States technically own Puerto but they are sovereign right now so I counted that as separate and they wrote it into separate so two from Puerto Rico gotcha some Polish guys some Colombians argentinians Danish a lot of different people 51 countries Israel Etc so I thought that was pretty cool so we have so we have a we reach many a Countrywide Mr World wides that's all for we are worldwide now Legend of Freak Nasty spreading to all corners of the globe now this Tim can we can we call ourselves worldwide internet Stars uh not yet okay yeah we havent hit all of the places okay now this I thought was an interesting question and",
      "start": 2434.6
    },
    {
      "text": "corners of the globe now this Tim can we can we call ourselves worldwide internet Stars uh not yet okay yeah we haven't hit all of the places okay now this I thought was an interesting question and this is what I I I didn't this is not what I expected to get for this particular question I asked if the subscriber was from Kinda Funny K inda Funny Games or both how many people percentage wise do you think subscribe to both Patreons it's a pretty high percentage if I had to guess maybe 90 really Jesus really I'm going to say 43 yeah I think 40 67.6% of people that that were in the survey subscribe to both Patreons that's awesome guys the original Patreon Kinda Funny has 12 6% only subscrib to that and then 19.7% subscribe to Kinda Funny Games so even if you combine them together the Prepon the preponderance of people that answered the survey subscribe to both sorry what we we the preponderance the preponderance yeah **** a so big word we so people two out of three people that",
      "start": 2478.08
    },
    {
      "text": "Prepon the preponderance of people that answered the survey subscribe to both sorry what we we the preponderance the preponderance yeah **** a so big word we so people two out of three people that subscribed to us on Patreon according to this survey subscribe to both Patreons and for that we thank you very much thank you very much uh thanks for filling out the survey too yeah I appreciate it a lot of people subscribe wrote to me and said they had they had fun answering it which I I do appreciate everybody love the last question yeah the last question is from Nick and we'll go into that in a minute uh this question was how long have you been consuming Kinda Funny content and the fields were there were six-month Fields with the exception of the first field which because we started the first episode of conversation with com went live August 2012 so I did August 2012 to December 2012 and then January June July December for all the other years so there are there are five of those",
      "start": 2522.64
    },
    {
      "text": "the first episode of conversation with com went live August 2012 so I did August 2012 to December 20 12 and then January June July December for all the other years so there are there are five of those choices and then since 2015 uh what I found was that the biggest portion of those people at 36 .1% have been with us since the beginning damn which again appreciate 668 respondents about family call the fewest number of people not about an it's about family about family 10.4% of the people which is the fewest uh in in terms of the fields answered out of those six options have been with us only this year since we went since we went rogue yeah so we have a longtime loyal audience that's cool though that 10% that's bigger than I thought it would be for the last two months and here's what's even more interesting to me is that the number goes down the further away you get from the founding which means that we've actually had a lot of people with us for a longer periods of time uh 273 with us",
      "start": 2559.44
    },
    {
      "text": "more interesting to me is that the number goes down the further away you get from the founding which means that we've actually had a lot of people with us for a longer periods of time uh 273 with us since January to June of 2013 and then 274 from July to December of 2013 and then 238 and 205 from Q1 and Q2 to Q3 and Q4 if that makes any sense 2014 so the numbers get lower which means we've had a lot of people since the very beginning that support us on Patreon so again thank you for that thank you now this is these are technically this I'm I'm going to get ahead of myself the next question after this is technically I really wish you were wearing a lab coat that's the only way this could be better I asked the audience which is their favorite Kinda Funny show uhuh every show we do including the ones on Twitch are on there so the a Conversation with Colin Colin and Greg Live Follow the Leader Kinda Funny Gamescast Kinda Funny Plays Kinda Funny Reacts Kinda Funny",
      "start": 2603.76
    },
    {
      "text": "we do including the ones on Twitch are on there so the a Conversation with Colin Colin and Greg Live Follow the Leader Kinda Funny Gamescast Kinda Funny Plays Kinda Funny Reacts Kinda Funny Streams which would be our streaming content on uh that's not Colin and Greg Live on Twitch Kinda Funny Unboxings Oreo oration special one- off so that would be like 100 P 100 Pence signs and the Monopoly tournament stuff like that and then the Game Over Grey Show any guesses on which our most popular show is and it's overwhelming Conversation with Colin no G of a great show yes really this show 45.6% of respondents say that this is their favorite show that we do 844 out of 18 1,850 say that this is their favorite show that's awesome thank you um and so there are really only four shows that stick out in terms of the ones that got lots of votes yeah so number one's Game Over G yep number two does anyone have guess it's got to be Conversation with Colum no **** **** a really or or let's",
      "start": 2644.72
    },
    {
      "text": "out in terms of the ones that got lots of votes yeah so number one's GameOverGreggy yep number two does anyone have guess it's got to be conversation with column no **** **** a really or or let's play oh Greg Way of course the The Runaway oh yeah Greg Way's not on here that's yeah it was it's just we do that in a million other way the one-offs the special ones no no no I don't think that would get that many votes Colin and Greg live is our second most popular 433 respondents or 23.4% say that Colin and Greg live is their second is their favorite show then you get to Kinda Funny Games cast which is a new and embryonic almost show that Tim hosts that's the third most popular show uh that's at 12.1% where the **** conversation with conversation with Colin is number four 11% 204 respondents say that that is their favorite show and then the drop off is pretty significant for what's the least favorite show the well we're gonna get to that because there is a least favorite Kinda Funny",
      "start": 2689.2
    },
    {
      "text": "say that that is their favorite show and then the drop off is pretty significant for what's the least favorite show the well we're gonna get to that because there is a least favorite Kinda Funny show field and I think that question is technically invalid every every it's the exact same unboxings got the fewest amount of votes with four reacts got five special one-offs got five and then everything kind of bumps up from there Follow the Leader 14 so but again this is just asking you what your favorite is doesn't mean you don't like the other one yeah yeah exactly this was the major problem with the next question and a lot of people brought up that this is technically an invalid question because I gave I didn't give them an option to say none of the above oh well which would have made me throw out the thing but what I was saying so this next question is what is your least favorite Kinda Funny show okay and I didn't put I got multiple tweets like lots of them to both at Kinda Funny",
      "start": 2731.28
    },
    {
      "text": "out the thing but what I was saying so this next question is what is your least favorite Kinda Funny show okay and I didn't put I got multiple tweets like lots of them to both at Kinda Funny vids and to me at no taxation saying but I don't want to vote for any of them and I'm like but I have a least favorite 311 record even if I like I like the 311 whole catalog I do have a least favorite I love all you but there's a least favorite of it all makes sense is it Tim it's Tim it's call so the least does anyone have a guess on what our least favorite our least popular show is Accord unboxings just because there's no not many of them not many well or streams kind of streams Follow the Leader is the least popular show 32.5% say it's their least favorite Kinda Funny show yeah I think I mean it's a departure from what we normally talk about and that's to be expected probably there's something interesting about all these stats when it comes to the favorite and least favorite is really it",
      "start": 2765.92
    },
    {
      "text": "it's a departure from what we normally talk about and that's to be expected probably there's something interesting about all these stats when it comes to the favorite and least favorite is really it kind of boils down to how many of them exist and how often we put them out GameOverGreggy Show and Colin and Greg live that those are daily things Gamescast daily I'm choking on something why you going to vomit I don't know Tim don't passion some **** and a conversation with call and something that blew my mind recently is like I noticed there's over a hundred episodes of that show so it's like just by sheer numbers it's like it's going to be a lot of people's favorite because we've done so much of them and like saying with GameOverGreggy which with breakouts at this point there's hundreds Gamescast there'll be a hundred soon which is crazy that's nuts because there's four technically five a week with the full episode four sometimes five so we episode 25 yeah it's um what I what I",
      "start": 2809.6
    },
    {
      "text": "Gamescast there'll be a hundred soon which is crazy that's nuts because there's four technically five a week with the full episode four sometimes five so we episode 25 yeah it's um what I what I thought I mean I I appreciate what people were saying about not giving them an option but I wanted to know like if you had to answer this how would you answer and so that was and and you know to be fair I was just curious about this I didn't expect it to be Follow the Leader I knew Follow the Leader would be one of the least popular ones but I will be honest we're doing more Follow the Leader and I think that well again least favor just means it's like exactly but I think that follow the leader performed okay but I think that some of the episodes like oldfashioned one for instance which is a drink a lot of people are interested in through this show this particular show um is well above the mean in terms of average views of a show we do so I think we just have to do better about promoting them",
      "start": 2844.88
    },
    {
      "text": "a lot of people are interested in through this show this particular show um is well above the mean in terms of average views of a show we do so I think we just have to do better about promoting them and we kind of were learning along with Eric about what that show is going to be and I think the second season going be much better um but the other show do you guys have any yeah so onboxing is number two 336 uh people responded that's 18.2% saying that was their least fair but again this is like it it's a weird it's a weird question I don't know if I really I I I wanted to share this data but I'm not sure that this question is really useful because who the **** goes on YouTube and says like I want to watch an unboxing video right I don't really feel like you look for them unless something is out there that you want to see unboxed in other words if we did 25 unboxings would you watch all of them you know as a series I don't think so so I'm not sure the validity of this particular",
      "start": 2880.56
    },
    {
      "text": "is out there that you want to see unboxed in other words if we did 25 unboxings would you watch all of them you know as a series I don't think so so I'm not sure the validity of this particular question right I feel like Reax would be another one that's low there but that's just because especially once this survey was made there was only a handful of reacts videos even up but if you look at the the data on the reacts videos that we've made even since then and even before like they all per outperform pretty much everything else we do I think react is going to be one of those things especially like a year from now people are going to like it a lot but they're still not going to say it's their favorite because of what you're saying yeah they like the 50 Shades a great one but they didn't watch any the other ones their thing but like people are still going to stick to the GameOverGreggy Show or whatever it is it's complex I mean like from there uh so unboxing Oro oration is the third",
      "start": 2915.36
    },
    {
      "text": "watch any the other ones their thing but like people are still going to stick to the GameOverGreggy Show or whatever it is it's complex I mean like from there uh so unboxing Oro oration is the third least favorite show according to this post but again it doesn't it doesn't add up right it's like you said it's about those things that you're looking for because we're going to continue to Oreo oration 2 um what's interesting to me is that the numbers for favorite and least favorite don't necessarily Jive what I mean by that is um for instance we were talking about how GameOverGRE Show is by far the most popular show um but when you talk about the least popular show 35 so 35 people which is like a minute amount of people out of 1,850 said it was their least favorite the the show that was that did best on least favorite is conversation with Colin which is exactly what you thought would be on the other one so there's like somewhere in the middle I think it's just the top three shows or",
      "start": 2948.76
    },
    {
      "text": "that did best on least favorite is conversation with Colin which is exactly what you thought would be on the other one so there's like somewhere in the middle I think it's just the top three shows or whatever people enjoy and we continue to give them to them so I thought this was interesting data but I'm not necessarily sure of the validity of this question well again like you said the lead off least favorite doesn't mean you don't like it exactly exactly and we and people were loud and clear about that but we asked the question so I wanted to share the data um where or how do you consume our content this is the first question where people can can can answer in multiple ways and I talked to Tim about this question before I put it up because there's really only three ways to get our content YouTube twitch podcasts right right or and I put other and I wasn't I I don't think that I even I wonder if I made people even fill the field 97% said other and we're like what does that mean yeah",
      "start": 2988.96
    },
    {
      "text": "YouTube twitch podcasts right right or and I put other and I wasn't I I don't think that I even I wonder if I made people even fill the field 97% said other and we're like what does that mean yeah and I'm curious like what that means and I got I'm going into the data now um uh like basically it doesn't matter because not not all people said other 256 people people said other or 256 anwers said other um because you can have multiple answers here but 37.8% of our audience gets our our content on YouTube so 1,782 so about one this is interesting it's about one and three and then one and three get it on Twitch 32.3% and then a little less than three got in a podcast form 24.4% so it seems like it's spread out pretty evenly except for the fact that our podcast numbers seem to be seem to indicate that a lot of people listen to those podcasts but when you're on patreon supporter seems like you're more in- depth into the day-to-day kind of **** which would bring you to YouTube well no see",
      "start": 3019.64
    },
    {
      "text": "that a lot of people listen to those podcasts but when you're on patreon supporter seems like you're more in- depth into the day-to-day kind of **** which would bring you to YouTube well no see that's that's interesting I would feel like the patreon people are most with the audio stuff for the um podcast like we the audio the numbers on patreon are much higher for people that are able to get the audio than are able to get the video yeah video numbers are never super crazy yeah like like there's like what you figure it's open up to like we'll say there's 4,000 patrons you figure I would say thousand of them can get the video is that really the number I thought it would be more than that no I apologize and I will I I think like 2,000 can get the AUD Nick doesn't respect you I do respect I need another I need some caffeine that that live stream just caught up of me last night can you give me a coffee too hey you want a coffee does anyone else want a coffee no I'm fine thank I'm fine um",
      "start": 3064.6
    },
    {
      "text": "need another I need some caffeine that that live stream just caught up of me last night can you give me a coffee too hey you want a coffee does anyone else want a coffee no I'm fine thank I'm fine um I think 700 people about a week listen to the podcast early audio wise yeah but video Wise It's like 300SE it was like 300 or less so that's interesting to me but what's really interesting to me is Twitch because we don't really offer anything twitch exclusive on patreon so the fact that and we'd love to how do you do that because there's no way for us to get twitch and patreon to split rev and do all this different stuff yeah like trust us we're working on stuff we're trying but I don't know how it's going to work but onethird of the people on patreon say they consume us through twitch mhm that's really 32.3% 1,524 respondents uh say that so pretty interesting numbers there social media platforms what if any do you follow us on uh dominant Twitter numbers 52.1% follow us on Twitter uh",
      "start": 3107.72
    },
    {
      "text": "that's really 32.3% 1,524 respondents uh say that so pretty interesting numbers there social media platforms what if any do you follow us on uh dominant Twitter numbers 5 2.1% follow us on Twitter uh and again you can answer more than one 8222 on Facebook 529 on Instagram so that that breaks down a 52.1% Twitter 25.9% Facebook 16.7% Instagram and then 5.3% say other but I'm not sure exactly what that means cuz we are not anywhere else Google plus but I don't even do anything there do you but they count yeah I do Google I have 2 million followers or whatever now um but those numbers don't mean anything over there I'm really I'm really interested with Google plus like I don't understand that's the one one of those rare things Google tried to shove everyone down everyone's door and they're like no like we don't want this yeah it's so weird one day it's going to click I don't know one day they're going to do something and it'll make sense like people need to use it um the phone next question",
      "start": 3147.24
    },
    {
      "text": "no like we don't want this yeah it's so weird one day it's going to click I don't know one day they're going to do something and it'll make sense like people need to use it um the phone next question and we're going to I'll Blaze through the rest of these Google Fiber how do you find new Kinda Funny content and again multiple answers are allow the and this is not surprising for us it's a pretty even split between YouTube and patreon um YouTube is the highest at 29.6% and then patreon is at 27.9% so when new content goes up people are finding it either through their YouTube feed or via postings on patreon which we're terrible what are the other options Twitter is this is the next one at uh 23.1% interesting and then it it falls down significantly podcast service kind of morphus podcast service is 8.7% and then it falls down from there to Facebook 5.2% our Facebook Community is not huge the one that we own but our Facebook community that is run by the fans is actually way bigger um or",
      "start": 3191.76
    },
    {
      "text": "is 8.7% and then it falls down from there to Facebook 5.2% our Facebook Community is not huge the one that we own but our Facebook community that is run by the fans is actually way bigger um or way more active I should say um so active and what I've learned what I've learned from posting on Facebook is that videos don't do well there um pictures do really well there whenever you post a picture of anything it's just like it does Real Estate it's just it's weird Google 74 people have responded that they get it through Google which is a minute amount um and then other 204 so I mean I'll have to go to the stats to see what that means what's interesting to me about that is is Twitter like I feel like for me I consume most my content through Twitter yeah me too you click on link someone post them stuff so I'm surprised that number is not higher I'm surprised that the patreon's higher than that but I guess they get emails yeah it could be that I mean they're pretty even and they're like",
      "start": 3236.16
    },
    {
      "text": "them stuff so I'm surprised that number is not higher I'm surprised that the patreon's higher than that but I guess they get emails yeah it could be that I mean they're pretty even and they're like within the margin of error of each other so it really is like YouTube and patreon we have to figure out a way to serve pat reon better in terms of getting stuff up there because it's just all moving in so many directions like kids have spoken out that they don't want the daily breakouts on there because like they've already got the early episode most of them so that doesn't make sense for them um but then like we put up a let's play every day and we put up a Callin and Greg live every day and it's like I try to get that over to patreon but it's like yeah spinning so many other plates that we can't do it I think I mean just weekly Recaps might be the best thing to do we've talked about that before but if we want to drive videos if you want to if people are using it so much right to get it",
      "start": 3278.56
    },
    {
      "text": "can't do it I think I mean just weekly Recaps might be the best thing to do we've talked about that before but if we want to drive videos if you want to if people are using it so much right to get it it'd be nice to drive into that content on a daily basis too I don't know we'll figure it out maybe we get more help yeah um all right three more questions and these are all heartening questions I think for all of us um that I want to go through today as and I asked I asked the audience as a patreon supporter do you feel that you receive your money's worth with your subscription to Kinda Funny Kinda Funny games or both 97.9% of respondents Say Yes 97% 97.9 that's awesome uh so uh 2.1% say no so it's 1,812 to 38 I got to I'm going to go more like we have to go into the questions about what we're doing right and wrong which we're not going to go through here go through on our patreon exclusive episode but Friday but I wonder February 27th I wonder why these people don't think they're",
      "start": 3315.12
    },
    {
      "text": "we're doing right and wrong which we're not going to go through here go through on our patreon exclusive episode but Friday but I wonder February 27th I wonder why these people don't think they're getting their money's worth and and I think that's totally valid answer yeah no we want to fix that we want you to we want 100% to feel like they're getting their money but n noet 90 97.9% approval rating for someone that people that are paying you is extraordinarily High even for very successful companies um so so you're saying were the new Coke that's exactly what I'm saying Coke would kill for a 98% approval rating uh but so nonetheless I thought that was interesting and then two final questions um that we'll go through today these are even better for us I think and uh are pretty good do you intend on supporting Kinda Funny and or Kinda Funny games on patreon into the future 99.8% say yes 99. 8 yeah 1,846 to four four people yep Man Four respondents we find out who those four people",
      "start": 3353.8
    },
    {
      "text": "intend on supporting Kinda Funny and or Kinda Funny games on patreon into the future 99.8% say yes 99.8 yeah 1,846 to four four people yep Man Four respondents we find out who those four people are we could we go to their house no no just talk actually was totally bad way their house and like convince them to actually I I the the data uh was garnered intentionally totally anonymously so I can't even track any of it unless they signed it um because on on survey Planet you can have it where they have to sign in with emails and Stu I was like that's stupid I want people to be able to be honest um and I feel like there's going to be like you know we I'm gonna find them or something make jokes about ex exactly right so yeah 1,846 to four man do you intend on supporting Kinda Funny and Kinda Funny games on patreon in the future 99.8% and then finally would you recommend Kinda Funny and or Kinda Funny games to a friend 98.8% say yes 1,828 to 22 um so that's the data I found so",
      "start": 3392.32
    },
    {
      "text": "Kinda Funny games on patreon in the future 99.8% and then finally would you recommend Kinda Funny and or Kinda Funny games to a friend 98.8% say yes 1,828 to 22 um so that's the data I found so far now uh there's going to be other fields and we'll go through them uh other feedback you'd like to leave was one question what shows if any would you remove from the repertoire or add to the repertoire two other questions that are really interesting and what are we doing right and what are we doing wrong thank you so we'll go into those on the on the patreon exclusive Kinda Funny uh but I wanted to share that data with you guys and what I thought was fun is that you guys have never seen that data so yeah that was really cool that was cool thank you again for everyone filling that out everybody of course supporting us on patreon doing all that awesome stuff I'm exced Ed to do the part two on Friday this isn't a plug for it but to actually hear like in their own words what's working",
      "start": 3436.4
    },
    {
      "text": "of course supporting us on patreon doing all that awesome stuff I'm exced Ed to do the part two on Friday this isn't a plug for it but to actually hear like in their own words what's working what's not working what they want what they don't want yeah there's a lot well I'll tell you guys there's themes what people are saying and I think that and both in right and both in wrong what they want what we they think we should stop doing a lot of people for instance and just to tease it like when I say like what are we doing wrong most of the respon say nothing yeah um but there are things yeah what would you change a lot there's a lot of things to do with Colin Greg live and other things that we have to I was going to say I imagine it's just as somebody who goes on our patreon wall every day I imagine it's going to be why why isn't Colin and Greg live on iTunes why isn't it on YouTube things we have to talk about and figure out because that's definitely one of the issues um but anyway I",
      "start": 3473.24
    },
    {
      "text": "I imagine it's going to be why why isn't Colin and Greg live on iTunes why isn't it on YouTube things we have to talk about and figure out because that's definitely one of the issues um but anyway I want to share that with you guys you know I thought it was enlightening um get some hard data about our patreon supporters specifically which I think you could kind of sprinkle out in some respect maybe not scientifically but to the audience as a whole um maybe in terms of age um for instance or this significant gender gap that we have um and uh and I think that that might just exist generally in spaces like this unfortunately but um you know there's some things that you can Garner and kind of figure out and how to you know some interesting details about the wider audience but um I wanted to ask people those questions because I was curious and and a lot of those questions shook my own belief about the way people digest our our stuff and who these people are in particular um you know I love",
      "start": 3506.88
    },
    {
      "text": "people those questions because I was curious and and a lot of those questions shook my own belief about the way people digest our our stuff and who these people are in particular um you know I love the idea that for instance we have a bunch of people like us in their 30s like listening to the show I love that um we have overwhel support from our patrons that they seem to be very happy as of the beginning of this month yeah um and that's why I started the poll in the beginning of the month because I want to make sure that one cycle went through MH um so when you have a 90 what is it 98.9% approval rating whatever there's nowhere to go but down one of us should run for president no you've already lost remember it was it's it got decided the the T-shirt votes are in no the party shirt sucks every loves us we got a Star Wars film to get we got an Avengers film we got a lot of stuff that's what you're that's what you're marking these are the markers to you that's what our campaign our",
      "start": 3548.68
    },
    {
      "text": "every loves us we got a Star Wars film to get we got an Avengers film we got a lot of stuff that's what you're that's what you're marking these are the markers to you that's what our campaign our campaign is built on the same thing that fast and furious is built on family and love and speaking of family and love I was thinking and I probably shouldn't say this on a show but you know what **** it is there any way we could like rent out a theater for Furious 7 yeah we should look into that okay cuz that could be cool when's Furious 7 out April I don't know the exact date April 7th I want to say okay because we're trying to do our live event at the end of April H well that's a little too late well you what you can't do another showing with all our best friends that makes sense we're we're g to watch it more have aund or few hundred people in town might as well make sense yeah we all went and saw it together let us know what you think about that I'm going to put some I'm going to put",
      "start": 3591.2
    },
    {
      "text": "g to watch it more have aund or few hundred people in town might as well make sense yeah we all went and saw it together let us know what you think about that I'm going to put some I'm going to put hold on I keep forget to do this hold on there we go that'll be my reminder one's fast one's Furious both are running for president 2016 time for my topic co-presidents um no we're not doing there co-presidents uh before we go any further we just did a whole topic about patreon we of course want to thank everybody who supported us in January here your names running through if you did your uh support there if you hit the tier on patreon to support us patreon.com of funny thank you so much for your support there's your name send a screen cap to your mom be like this is what I do with my money put yourid you should be investing in a 401k instead no don't do that um my topic is simple I'm dying I am so **** tired right now I did the I did the live stream for the Walking Dead which meant that",
      "start": 3632.76
    },
    {
      "text": "yourid you should be investing in a 401k instead no don't do that um my topic is simple I'm dying I am so **** tired right now I did the I did the live stream for the Walking Dead which meant that Monday I woke up got ready for calling live I woke up probably you don't know what 8:30 9 what time I roll out of bed I have no idea kiss you on the Sheek and come to work no okay anyways spoon me for just a few more waning minutes 8:39 I wake up get ready so going to col live 12:30 I start uh The Walking Dead live stream and then I went for 19 hours that's right that's what I said you said yeah 19 hours like no no it was 7:30 we ended right around there and then went to bed for 3 hours woke up did Colin and Greg live again and then I've just been running on a coffee since then and that's why I had a Coke today a little bit of sugar here in the afternoon to keep me going because we did two unboxings then we did that packed up a bunch of **** in here did all sorts of stuff so I'm dying",
      "start": 3674.4
    },
    {
      "text": "I had a Coke today a little bit of sugar here in the afternoon to keep me going because we did two unboxings then we did that packed up a bunch of **** in here did all sorts of stuff so I'm dying I'm very tired I'm wondering how much I got to beat the order tonight for sure I have a whole checklist of things I need to do on top of that Nick needs to make me this graphic that was running so we make sure get yeah we'll get that but my question is I want to talk about sleep deprivation in stories related to it your own lives M cuz like right now this isn't bad I've been I've been more tired than this I've run I've done more on less sleep than this but I am hurting and it hearkens back to dumb things I've done where I stayed up too late yeah you know what I mean this is really interesting to me obviously we all have stories we'll get to those but what's so interesting is the fact that you don't seem that bad right now because knowing you and knowing how you handle things and knowing how",
      "start": 3721.8
    },
    {
      "text": "me obviously we all have stories we'll get to those but what's so interesting is the fact that you don't seem that bad right now because knowing you and knowing how you handle things and knowing how things can get for you when you get stressed you can get pretty damn stressed youve not gotten stressed at all a day you've been super fun fine like you just went with it and like you don't seem tired you're not like **** up what you're saying and **** and that's crazy in my head I feel like I am you're not you're I wouldn't even know that you the other thing for me is like you know how fast I talk generally when I feel like I'm like in the beginning of intros I notic when I was like the Seducer producer Nick Scarpino like granted that's just normal person pronunciation but for Greg Miller that felt like it was taking way too long and I think I watch videos of myself where I think I'm **** things up like there's been plenty of times where uh in interviews it'll be like as I live and",
      "start": 3759.28
    },
    {
      "text": "that felt like it was taking way too long and I think I watch videos of myself where I think I'm **** things up like there's been plenty of times where uh in interviews it'll be like as I live and breathe and I'm like what's this person's name and I think it's a pregnant pause and I'm **** up and then it kicks in and I go but like you watch the tape back and it's just like no that's probably how normal brains function I'm just not used to working on that level I'm usually down here or I think if I just run really fast through it the Sonic method yeah everything will be okay in the end I think the thing I I know about Greg after knowing him for so long and working alongside of him so long is he only gets really stressed out and frustrated when when it's least off no that's I mean that's all of us right there's there's never a great opportunity when you're like now is the time for me to lose my **** if ever there was one and great not that Greg ever loses his **** per se yeah a",
      "start": 3798.52
    },
    {
      "text": "all of us right there's there's never a great opportunity when you're like now is the time for me to lose my **** if ever there was one and great not that Greg ever loses his **** per se yeah a little bit here never really never really 100% I've never lost my **** here I want to put that out there for the day that I do we can make a big deal out of it that sounds good well after it's done at the time when you're losing your **** no one wants to hear oh losing his **** no um oh I've lost my **** here uh but I think I've seen Greg this is the key I think to to you sort of keeping at constant pace is that you pack way too much on your shoulders on a daily basis but I think the re a you like it and B I think the thing that keeps you saying is that when you schedule it out and you have a plan no matter how much the content is you just kind of look forward until you have that breaking like okay I'm good I've noticed that when you get frustrated is when there's a little hiccup in",
      "start": 3836.44
    },
    {
      "text": "a plan no matter how much the content is you just kind of look forward until you have that breaking like okay I'm good I've noticed that when you get frustrated is when there's a little hiccup in that plan and it throws off all of that planning you've done for the next like hour or two or three or week or whatever and you're like **** now I have to go back and redo all that because you run on this like freight train mentality that's going forward and if if that train has to stop it throws off the schedule for everything and it pisses you off the business has been eye openening since we've launched on our own I I I I'll tell you like nine times out of 10 I open emails now with hey sorry I used to be better at emails than this yeah cuz now emails sit there and chill for like two weeks just it's just like yeah we're at that point I was describing it to Colin's girlfriend Cheryl the other day and on a walk home from a pizza restaurant while Colin was running ahead to poop his pants that",
      "start": 3876.04
    },
    {
      "text": "it's just like yeah we're at that point I was describing it to Colin's girlfriend Cheryl the other day and on a walk home from a pizza restaurant while Colin was running ahead to poop his pants that I'm sitting there in front of the goal and I'm the goalie and I used to be so good at stopping every ball or Puck that came by and now **** are just flying by me and I'm just like I'm doing the best I can this is the best I can do you know what I mean there's just a shrug of shoulders and that's what it is but I mean so today is like totally one of those acceptance days they just like it's not going to be what I want it to be like I didn't have these things but what am I going to do I'm I going to freak out I mean I think there's two mentalities for that right we can try to do everything but I think history will teach us that that's just a a good recipe for failure or you can prioritize and that's what you has to do in business right and we prioritize I think fairly well as a group I",
      "start": 3913.56
    },
    {
      "text": "but I think history will teach us that that's just a a good recipe for failure or you can prioritize and that's what you has to do in business right and we prioritize I think fairly well as a group I think we talk we sit there we have an honest discussion of what we should be doing and we let everything else fall by the wayside and that's just what's going to have to happen sometimes um we put out a ton of content we really do and and that it's it looked like not so much when we were planning it when we were sitting there on that one weekend when're like okay let's do our production schedule and see what's going to happen um and Colin has brought this up multiple times he's like I don't understand why we can't just get it to a place where we shoot like two to three days a week and the rest of the rest of it's just free not necessarily free time but time to do the administrative stuff and the planning and all that stuff and that's the right mentality but then it's all it's almost like",
      "start": 3946.48
    },
    {
      "text": "of the rest of it's just free not necessarily free time but time to do the administrative stuff and the planning and all that stuff and that's the right mentality but then it's all it's almost like you still have to give something up to make that plan to do that yeah um and that's it's hard it's not easy I mean and there's no road map there's no one sitting there there's not a CEO of this company going ah you messed up guys go back and do it again it's like oh we screwed something up and we didn't get the patreon video up and now people are like not pissed but they're not happy and that's our business and we got to make sure people are happy and we got to make sure cut VI out of the equation **** man they were **** up huh the the uh and so the market spoke uh I think that when we traded our jobs in at IGN when we weren't administratively responsible for the company that there was a level of predictability there so like I used to go I used I had a I had a cycle like a",
      "start": 3980.24
    },
    {
      "text": "when we traded our jobs in at IGN when we weren't administratively responsible for the company that there was a level of predictability there so like I used to go I used I had a I had a cycle like a system every day when I go to IGN I'd get there I was most productive in the morning yeah and I would get there and I would answer all my emails in fact like PR people I think especially were astonished how quickly I answered emails because I was like the faster I can get through these emails I can just get them off my plate and then I can play this game or review this game or do whatever I have to do and now I look at my inbox which is not nearly is full but because we have so many other things to do and I'm like you know for for me whatever I'm like trying to deal with the social media and just do talking to people and making sure people are happy and and like learning a lot about the audience I think it's somewhat relevant we just saw in our last um in our last uh topic somewhat relevant",
      "start": 4013.28
    },
    {
      "text": "do talking to people and making sure people are happy and and like learning a lot about the audience I think it's somewhat relevant we just saw in our last um in our last uh topic somewhat relevant to to the success of this company is how they're doing whatever so I try to answer every tweet and I I have like Facebook message like go back and forth with people and all these kinds of things and then I look at the clock I'm like **** like what I realize is that where did today go by the way well that's what I realize is that like it's just for me like because what I'm doing is writing all day still not creatively or whatever but like writing all day I'm writing tweets I'm reading tweets I'm writing emails to fans and Facebook messages and posts and all these kinds of things I'm like I look at my email inbox I'm like **** like I don't want to answer any of these emails right now and then I have these gusts of energy that come out of nowhere for an hour at like at midnight because I",
      "start": 4050.24
    },
    {
      "text": "at my email inbox I'm like **** like I don't want to answer any of these emails right now and then I have these gusts of energy that come out of nowhere for an hour at like at midnight because I do a lot of random ass work at night Greg will tell you like I just sit there at night I'm just like doing random **** and I'll just like answer all the emails and then another week will and always answer mine I'm sorry for the delaying getting back to you that's like how everyone of my emails starts now and then I just and then it and then all the emails are done the inbox is clear and then it slowly Stacks up and I just don't have the propensity right now to get like to to to nip it in the butt as I used to with IG because there's just all this other **** that has to be dealt with you know what I mean like it's just not the way it used to be and I I don't want it to be the way it used to be because we weren't happy but like the I'm happier now but feeling overwhelmed sometimes as well",
      "start": 4087.0
    },
    {
      "text": "what I mean like it's just not the way it used to be and I I don't want it to be the way it used to be because we weren't happy but like the I'm happier now but feeling overwhelmed sometimes as well and I said this before and I'll say it again to all the social media managers out there and all the people that deal with Twitter and Facebook whatever new found and infinite respect for what you do because it is I really used to look at like Social Media stuff and be like it's a job and it needs to be done you need to interact how hard can it possibly be yeah you know the fact is is it is **** ultimately and infinitely timec consuming you know and to do it right to do it right to do it right and I think we are doing it right and and I think we're doing it Beyond right because I go I try to go on Twitter every eight hours or so and I'll go and I'll answer every tweet you know and like that's the way I think Twitter is meant to be whatever but man it takes time but it makes you it makes",
      "start": 4121.84
    },
    {
      "text": "go on Twitter every eight hours or so and I'll go and I'll answer every tweet you know and like that's the way I think Twitter is meant to be whatever but man it takes time but it makes you it makes the audience out there because they so valuable feel valuable it's not just me saying you're valuable it's me giving you the time but man it's just a complicated rig moral you know out there right a rigamarole um yeah but I mean to kind of backtrack to the original to your topic Greg I mean this is this is how I feel like the first month I think was a little harder than this month it's been a little bit easier yeah now we have to well now it's just again I'm just like whatever it's going to happen it's going to happen we have to I mean we have to fulfill a lot of the goals on Patreon which we were actively doing um which is great that's a good problem to have um but I felt there was there was a period there where I couldn't like I think I would hit like Saturday and just sleep all",
      "start": 4158.28
    },
    {
      "text": "we were actively doing um which is great that's a good problem to have um but I felt there was there was a period there where I couldn't like I think I would hit like Saturday and just sleep all day and that was like that was pretty brutal but as far as ultimate sleep deprivation goes there's one period in my life that I specifically there two periods actually that I really really remember and a lot of people who have worked on um like done a professional shoot that goes longer than one day we'll we'll tell you about this God we did uh we did when we were doing Not Another Zombie Apocalypse uh **** **** we were which is a web series we did at IGN and it was a sponsored web series and a lot of the way these sponsorships go are you know they go hey we want to partner with you guys we've got a certain amount of budget and a certain amount of time and what do you guys have and we go okay we want to do this cool idea and it's going to be this it's going to be that and they go cool then",
      "start": 4190.52
    },
    {
      "text": "got a certain amount of budget and a certain amount of time and what do you guys have and we go okay we want to do this cool idea and it's going to be this it's going to be that and they go cool then you don't hear anything from them for a while and then like a week before the First episodes do they go cool go for it and so you have a week to mobilize and in this particular instance we we were fortunate enough to C partner up with Capcom and they gave us a decent lead time but they they what they wanted was fairly aggressive they wanted a 15-minute piece of narrative they want it broken up into three episodes and they wanted it to be reminiscent of the Resident Evil series to to um get you know promote brand awareness of Resident Evil because I think the was it was it remasters or was it four Revelations Revelations that's what it was excuse me not four um so yeah they were like we need you to do this and it needs to be 15 minutes long now 15 minutes in standard script writing format",
      "start": 4230.64
    },
    {
      "text": "four Revelations Revelations that's what it was excuse me not four um so yeah they were like we need you to do this and it needs to be 15 minutes long now 15 minutes in standard script writing format is means you're writing about 15 pages of narrative which means you have enough space in there to do a complete story with a little bit of character development which we chose not to do per se are you kidding me we had was Greg we had grew Alfredo did grow but for the most part it was it was pure Shenanigans um but what that meant was we only had really budget in time because we had to start doing post on it uh immediately basically was that we only could really shoot for three days and I only had budget for three days so we had to do five pages a day and anyone who does any shoots will tell you that's kind of that's a recipe for disaster if you're asking for five pages at most you can shoot two to three pages a day of narrative unless you have a really really big crew or big production",
      "start": 4262.44
    },
    {
      "text": "you that's kind of that's a recipe for disaster if you're asking for five pages at most you can shoot two to three pages a day of narrative unless you have a really really big crew or big production crew and most of it dialogue we had I had a decent sized one um but not not nearly as big as I would have not nearly as much prep time nor do you ever have any enough prep time for any project you ever do you can always use more can always use more post and I always use more money um so the first day we went four hours over and it was a night shoot so we went till about God I think it was 5 or six in the morning on the roof of IGN um barely finished the last shop before the sun started coming up and then I had to break my crew and we're not a union shoot but I try to adhere to Union rules which means you have to give from the time the last person gets home eight hours in order to allow time to sleep and come back to work so I had to push the next day shoot which pushed that back so by",
      "start": 4301.92
    },
    {
      "text": "which means you have to give from the time the last person gets home eight hours in order to allow time to sleep and come back to work so I had to push the next day shoot which pushed that back so by about the third day you were just dealing with delirium and you're tired and you got to get good performances out of your your talent which in this case was Tim and Alfredo and Alexis and Naomi and to their credit they did the best they could but I didn't give them a lot of time to actually sit and memorize the material so that that kind of added some added layers of frustration we almost let the building on fire that was a little bit chaotic for a second we old uh that was not Sean's fault that's something that you learn the hard way only once is that if a light's been sitting there for a while you need to make sure you change the bulb out because it probably has dirt on it and if it has dust on it it's going to it's going to spark and L on fire that's crazy um yeah there's a lot there's",
      "start": 4340.72
    },
    {
      "text": "you need to make sure you change the bulb out because it probably has dirt on it and if it has dust on it it's going to it's going to spark and L on fire that's crazy um yeah there's a lot there's a lot of weird things you to wor about that light ever doing that no cuz we turn that line on a lot so it's and it's pretty much enclosed you don't have to worry too much about it but the if the bulb sits there it's an open face lamp cuz there is just bulbs that are exposed with little screens in front of them it will accumulate dust and after a while when you turn it on you you're like what's that smell and normally it burns off like you'll smell an old light like oh that's fine but you have to watch it and in this instance we looked up and I was like that light looks weird it's flickering oh that's cuz there's fire in the lamp and we uh our our gaffer Tess had to go up there with a fire extinguisher and blow it out and I was like oh we're all getting fired because we used the fire",
      "start": 4381.36
    },
    {
      "text": "oh that's cuz there's fire in the lamp and we uh our our gaffer Tess had to go up there with a fire extinguisher and blow it out and I was like oh we're all getting fired because we used the fire extinguisher and no one ever noticed um now they go back something's going to happen now at IG and they're going to do it it be like it'll shoot out confetti yeah like how even do that um so that was one of the the instances where I was like I am I you know after that I was like I'm really tired but I had to come in the next day and start on Monday start doing post for it well that's the thing about with these shoots is like not only is the production the most intense thing you ever freaking do and you're just like like E3 week is similar in a lot of ways you're just like go go go go go there's no stopping and you party then you go back and you just keep going going going going with shoots it's like the production is the hardest thing you'll ever have to do but in addition to that you also",
      "start": 4411.2
    },
    {
      "text": "no stopping and you party then you go back and you just keep going going going going with shoots it's like the production is the hardest thing you'll ever have to do but in addition to that you also didn't sleep the 48 hours before cuz you're planning and you don't sleep the 48 hours after because you're planning the edit and you're like getting that all started and it's like it's like a week of a couple hours of sleep not even at night just randomly at different and this I mean and this is a small internet shoot can you imagine if you're on a film that shoots for six weeks straight like God and you're basically like if you're the director of a film or a TV show or F I'm most I'm more familiar with the film workflow not so much for a TV but if you're director of a film you have to shoot for 12 hours which if the days go like they usually go means you're going to go a few hours over then you have to come back and watch the previous days dailies so you get them back from the lab if you",
      "start": 4445.36
    },
    {
      "text": "12 hours which if the days go like they usually go means you're going to go a few hours over then you have to come back and watch the previous days dailies so you get them back from the lab if you shot film if not you get them back from you you have them there and they probably do a little letter of color treatment on them and you have to sit there and watch the dailies to make sure you got everything before you move on to the next setup and so your day is literally I was listening to a great interview with the guys that shoot Game of Thrones and they they would have to like watch the dailies as they're on planes to the next location um and coordinate with the other directors and their days were like 20 hours long you're talking about a 20-hour day where you're like sleep when you can get back up and go um and they always say it's hilarious because I've read an interesting book about this where the director was like the first three days of production everyone loves you then the middle",
      "start": 4480.56
    },
    {
      "text": "back up and go um and they always say it's hilarious because I've read an interesting book about this where the director was like the first three days of production everyone loves you then the middle like the next 20 to 25 days everyone hates you and then right around the time the film's about you're doing the credits for the film everyone loves you again cuz they call up and they're like hey can I get a different credit can I get this like you know kind of get a promotion on the credit and stuff um and it's pretty true but I did another shoot um for a friend that was a little too ambitious and um it was right after I had done a couple freelance projects I was doing extra work on top of IGN um and the next day after that shoot cuz it went really long I think it went like four or five hours over and the next day my wife's like I hadn't SE me for like 2 weeks and she was like we need to spend some time together I'm feel disconnected from you and it's not good for our relationship I was",
      "start": 4515.04
    },
    {
      "text": "over and the next day my wife's like I hadn't SE me for like 2 weeks and she was like we need to spend some time together I'm feel disconnected from you and it's not good for our relationship I was like I'm really tired you really need to let me sleep I can't see you straight and she's like I need you to come out with me let's just we need to just go I need to go shopping I need to do something with you in the sun I was like okay and I got halfway through walking around the mall the outdoor mall in pal to with her and I just had to sit down and literally I had to sit down I mean like my leg started giving out on me remember and I just kind of collapsed and sat there for a second I was like I need you to go get me like an apple juice or something that'll Spike my blood sugar orange juice **** yeah or orange juice it's something that you can just I I just need something that's that's going to get my system going and I had to sit there for like an hour and just kind of like not debate",
      "start": 4553.04
    },
    {
      "text": "yeah or orange juice it's something that you can just I I just need something that's that's going to get my system going and I had to sit there for like an hour and just kind of like not debate what you were doing with your life yeah and my wife's like what's going on I was like I just I'm working myself too hard and this is this is not good and it's not getting me to where I want to be um so that was those were two times in my life that were very very telling for different reasons yeah yeah that was I mean that was literally to the point where I almost cried because I was so tired and so depleted from the night before and I really you know I try I was ading to shoot and the and uh being an assistant director is the is one of the hardest things to do on set because you are responsible for the schedule so that the role of the AD is to make sure that the director has his shot list and his coverage plan in place for that day shoot and then you have to tell all the crews and the actors",
      "start": 4585.04
    },
    {
      "text": "the schedule so that the role of the AD is to make sure that the director has his shot list and his coverage plan in place for that day shoot and then you have to tell all the crews and the actors and the talent where to be and you have to run the day so if the day starts falling behind it's on you so you basically have to be the most hated person on set CU you have to yell at people and be like hey you're **** up get the camera over here now or hey get out of makeup you're ready or why don't you do your lines things like that uh man production's hard we chose a hard lifestyle this is not easy we should event eventually Colin just be on Talent camera on camera talent and we won't have to worry about it it'll just be you you then you'll get new PAs and DAs and Rs and they'll take care of everything so you would think that shout out to the Rs you would think that but the problem with us is that we're very we want all the money we don't want to let go of anything no it's not even that",
      "start": 4621.8
    },
    {
      "text": "everything so you would think that shout out to the Rs you would think that but the problem with us is that we're very we want all the money we don't want to let go of anything no it's not even that it's I won't like I'm like no **** it we don't need anything you look at what we're you look at what we're I'll be craft Services too my my my hope is that we can do and I hope with any business that that you know I think we're all in alignment and how we want to run this business is that we don't want to operate on a mo as more mentality right sure right now we have a very good steady amount of content that we could double if we wanted to we could put out five videos a day but I don't think that's the best thing for the audience and so as we if we eventually get to the place where we can add new people to our team I just hope that we can sort of keep the same status quo but Elevate the content to a higher level of quality that will then grow the audience that way versus is creating more",
      "start": 4658.56
    },
    {
      "text": "new people to our team I just hope that we can sort of keep the same status quo but Elevate the content to a higher level of quality that will then grow the audience that way versus is creating more content because we can no the more content thing doesn't work and it's not interesting and and it overwhelms the user and and I think when we're we're getting messages on Twitter and Facebook saying like you guys are already doing too much and I can't keep up with it and I'm like that's funny to me because I like I don't feel like we're doing that much at all I what I was I tell Tim this all the time because we sit next to each other at the kitchen table all the time is that like I look at our videos on Kinda Funny especially Kinda Funny Games and I'm like it's so cool that in that 16 or 20 block kind of view you get when you click on videos on YouTube or whatever it's just like everything from like the last three weeks I'm like this is awesome you know like because it's good content",
      "start": 4694.84
    },
    {
      "text": "20 block kind of view you get when you click on videos on YouTube or whatever it's just like everything from like the last three weeks I'm like this is awesome you know like because it's good content it's not just **** whatever you know like and that's what I like about so even if people are feeling overwhelmed I appreciate that and that's great and that's fine but at least they're being overwhelmed by content that we really believe in as if you feel overwhelmed too remember that we redesign KindaFunny.com where it's everything in one place usually when I feel the people are talking about being overwhelmed there's when not they're talking to me specifically it's about the fact that it's a headache to keep up with when stuff posts on on Kinda Funny when to post some Kinda Funny Games and when there's stuff on Twitch and like you got to look on our Twitters to see if there's new we didn't think that went through very well but the but we got we got that to the point where it's",
      "start": 4731.48
    },
    {
      "text": "and when there's stuff on Twitch and like you got to look on our Twitters to see if there's new we didn't think that went through very well but the but we got we got that to the point where it's the best we could do I mean like it was like just way we could have just we could have just left everything on Kinda Funny but then yeah there would be seven videos a day or whatever and then it's like no no yeah yeah I just think that we no I think that the way the content goes out is well planned and thoughtful we didn't we did not think through at all how we were going to tell people oh sure sure you know what I mean like it's hard lot of different places to get a l I don't think we thought that went through I mean like and I think that it's just because of the kind of the rapid fire nature of the the content is really what's most important but the end game of getting the content out there is important too and I just think we were so caught up in the the embryonic stages of Kinda Funny",
      "start": 4766.04
    },
    {
      "text": "the the content is really what's most important but the end game of getting the content out there is important too and I just think we were so caught up in the the embryonic stages of Kinda Funny that we were not worried about the end the end goal the baby coming out of the wzor you know like it's like we were just like well the baby's in the like just dating it's F we wanted to conceive the baby first we had the room ready and stuff but just like we had no plan for existing so we thought the the products themselves are great like Gamescast and and and the show I think are really good and it's just yeah the end the end result needs to be cleaned up more and I think that the new KindaFunny .com I agree is like a very thoughtful way to see the entire product including what we're doing on Twitch which I think is really cool I don't know how the hell you guys did that but um **** wizard well the Glorious thing now is there's this thing called Google and everyone always makes fun of",
      "start": 4799.48
    },
    {
      "text": "Twitch which I think is really cool I don't know how the hell you guys did that but um **** wizard well the Glorious thing now is there's this thing called Google and everyone always makes fun of it but I just type questions into it and it gives me answers it's awesome what I love about I was I was talking to Greg about this too is my favorite thing about Google is that right now is that it used to be like uh Look up the definition of this word and it'll be like it would bring you to Dictionary.com or something now it just tells you the answer they're just like cutting everyone out it's just like oh you don't need that you don't need here's websites if you want it but here's the actual answer like it's like when is Valentine's Day and it's just like February 14th that's it I love that love that like and it's just probably murdered all these sit sh oh dude it's my favorite thing because I I'll I'll a lot of the times like you guys know when is Valentine's day.com is **** you know a",
      "start": 4835.52
    },
    {
      "text": "that like and it's just probably murdered all these sit sh oh dude it's my favorite thing because I I'll I'll a lot of the times like you guys know when is Valentine's day.com is **** you know a lot of the times like you know to be a man you have to know your own shortcomings right and one of my shortcomings is definitely spelling I spell I cannot see spelling errors right not only that but I I don't know if I'm using the word the correct word for the correct context so often times I will type said word and then Define in and that is something I noticed that it's so fast because it just has a little white box in that plain non not really well designed because it was put out there by engineer not an artist like apple that plain text which is like this is the definition of the word you're like nope okay I was using that wrong so so I'll go back to the Dr board find it's crazy how Google saves you with just that fundamental difference a click a search which could save you 10 clicks a",
      "start": 4869.04
    },
    {
      "text": "like nope okay I was using that wrong so so I'll go back to the drawing board find it's crazy how Google saves you with just that fundamental difference a click a search which could save you 10 clicks a day which can save you hours at the end of the week a day yeah like like a day of your of your year basically of of it's kind of interesting um to your question Greg the SE it's funny because the the the most recent time I remember being truly sleep deprived was when we were in Vegas and we went to Toronto to see Frank oh God and I was **** wrecked you know you could sleep on the plane I can't sleep on plane so this was the funny this was the **** stroke of Genius though was was we we flew we we had our whole day in Las Vegas last PSX and we did Podcast Beyond and we met all these people then we went to dinner with Drinkbox the guys do Guacamelee and and S and all that and then we got on a plane and this by this point it was like 11 o'cl at night so we'already been like 14 hours then",
      "start": 4906.2
    },
    {
      "text": "we went to dinner with Drinkbox the guys do Guacamelee and and Severed and all that and then we got on a plane and this by this point it was like 11 o'cl at night so we'already been like 14 hours then we flew from Vegas to Toronto we landed at 6 00 or 7 in the morning there Timex Social Club was on the **** I was delirious time social club was an obscure New Wave group from the 80s out of Berkeley their song's playing we're W tram I'm like **** Delirious like what is this song we get to this hotel we sleep for literally 2 hours we had hotel rooms for two hours yeah we get back in there's a car waiting for us we drive we have a great time with Frank we get back now the great thing about this was at this point we were up forever we were with Brian Alano who had a normal night sleep and all this kind of stuff too so I don't think he was not in the same boat Sean was with us too Sean yeah they got into normal so they were like not in this like I like we were so tired by that point that by",
      "start": 4954.0
    },
    {
      "text": "kind of stuff too so I don't think he was not in the same boat Sean was with us too Sean yeah they got into normal so they were like not in this like I like we were so tired by that point that by the time we got back to the airport to come home in Toronto I was like fine again but we got on an Air Canada flight that was empty all right and it's so rare to have that anywhere especially at a huge Hub like that and so like my whole row is empty it's like a five and a half or six hour flight from Toronto to San Francisco and I just zoned the **** out and I was so tired I was afraid I'm like I got to stay I got to stay up so I don't **** up my sleep schedule but I was so tired that we got home at like 11 o'clock that night and just went back to bed and I was totally fine I was totally well adjusted again but when I was younger in high school there was a couple years of weird years uh my hockey team used to practice in the mornings on certain days and so I would stay up like when I",
      "start": 4992.96
    },
    {
      "text": "well adjusted again but when I was younger in high school there was a couple years of weird years uh my hockey team used to practice in the mornings on certain days and so I would stay up like when I lived in New England for a while and played hockey up there we would practice after school but we would practice before like like 5 or six in the morning on like random days like Sundays and **** like that so I would stay up all night and then and then play hockey and then come home and go to bed and if I had school I would basically stay up do everything go to school and then sleep after school and then wake up at like 9 or 10 at night and then like like so like school was the end of my day B Jesus it was like totally weird warped way like that's like how a 15 or 16y old kid lives his life I I had my computer and my video games I I was **** I was like I was like this is great uh don't have talk to anybody I did that I did that right out of college too I right out of college I got a",
      "start": 5026.88
    },
    {
      "text": "I I had my computer and my video games I I was **** I was like I was like this is great uh don't have talk to anybody I did that I did that right out of college too I right out of college I got a job shooting wedding videos and so they didn't give a **** when you edited it was all done from home I had a little home office set up and slowly but surely my schedule because I would get oh God I was like it was impossible to motivate to edit back in the day I was like I don't know what doing it's it's not thrilling material either cuz it's an hour and a half long piece when you're done with it and it's someone's wedding and you're just like uh so my schedule went from you know because during Monday to Friday we edit and because no one gets married during those days and Friday night Saturday night and Sunday or Sunday you'd shoot some combination of either one or two weddings and my schedule went from waking up starting around 2 to waking up messing around starting around 4: and then",
      "start": 5070.8
    },
    {
      "text": "night and Sunday or Sunday you'd shoot some combination of either one or two weddings and my schedule went from waking up starting around 2 to waking up messing around starting around 4: and then 600 and then I would start editing around 8 and then I would edit all the way until the time when my when my one of my roommates who had to get up early for work would get up and I'd hear him going to the bathroom and I knew it was time to go to bed and it was the weirdest schedule cuz I was opposite I I would go to bed at like 8:00 in the morning and sleep till 3:00 or 4 in the afternoon and you just don't even feel like you're a part of society at that no but there's something about that I think **** I got to wake up cuz the store is going to close in an hour that's like a thing I don't know anybody that does video stuff that hasn't experienced that where it's like there's something about editing at night or even writing at night like being creative in that way at night that just is unlike any",
      "start": 5109.48
    },
    {
      "text": "that does video stuff that hasn't experienced that where it's like there's something about editing at night or even writing at night like being creative in that way at night that just is unlike any other time well there's a lot less distractions for one especially if you have roommates so when I was editing I had two roommates and they would be around at 5 o'clock you know they'd come home at like 5 o'clock 6 o'clock and they would just be screwing around watching TV playing whatever So eventually they would cool down around 10 or 11 that's when I would sit down and start editing and then you just kind of get into the groove and forget what time is and they're just gone what is time yeah I used to write I mean I used to write facts on GameFAQs and then my guides for with freelancer I wrote I wrote by the time I was 2021 22 it changed a little bit cuz I had like real jobs and like was working historical society and stuff but my GameFAQs especially because of my **** up sleep",
      "start": 5146.84
    },
    {
      "text": "I wrote I wrote by the time I was 2021 22 it changed a little bit cuz I had like real jobs and like was working historical society and stuff but my GameFAQs especially because of my **** up sleep schedule when I was in high school I wrote everything from like 10: at night to 5: in the morning you know like basically like if you read any of that work on GameFAQs from back in the day when I was a kid when I was 14 15 16 years old there's all references to the Moon I was like I was basically that was all written in the middle of the night I remember clearly because I remember that I used to have a thing where I'm like it's 5:00 a.m. I have to go to bed now you know like it was just I don't know what the **** was wrong with me at that point it was just weird it was just a weird it was just weird weird like cuz even when I would go out with my friends in high school and college and like you know party or whatever and then I get home and it would be like 2 in the morning be like",
      "start": 5177.72
    },
    {
      "text": "was just weird weird like cuz even when I would go out with my friends in high school and college and like you know party or whatever and then I get home and it would be like 2 in the morning be like well just going to hang out now I watch Like cheaters yeah eat like you know I used to just take paint of bar and jelly into my bedroom with Saltines and just **** spread down the saltine just eat them and watch Joey greo on **** cheaters getting stabbed and thrown in the water uh yeah I mean I mean yeah for me it was always like it was always just a sort of some level of procrastination that pushed the time later and later and later Into the Night and I hate it I mean I just for the longest time especially after college I was like I just do not want to work I just wanted someone to come around and recognize the talent and just pay me to be me and I had to wait exactly years later we found you well so that's crazy so for me there's a I'm sleep is very important to me like I think I",
      "start": 5213.56
    },
    {
      "text": "around and recognize the talent and just pay me to be me and I had to wait exactly years later we found you well so that's crazy so for me there's a I'm sleep is very important to me like I think I like sleep everyone loves sleep but like I really enjoy sleep probably it's I think it's unhealthy how much I enjoy it and how much I want cuz like healthy is probably what seven hours maybe 8 hours whatever like if it was up to me I would sleep 13 hours a day like if I had that time that would bees um I can't sleep on so like traveling if I have to travel across the country like to New York that always messes up my schedule and I always feel sleep deprived and that's all bad um there's been a couple video game scenarios like I remember waiting in line waiting in line always causes problems I had to stay up all night to get the Wii and like that **** my day up the next day and all that **** came home played godam we **** my day up it does that um but really for me it's more about",
      "start": 5249.32
    },
    {
      "text": "I had to stay up all night to get the Wii and like that **** my day up the next day and all that **** came home played goddamn Wii **** my day up it does that um but really for me it's more about there's three distinct things there's production like Nick was talking about and I remember being in college and having to well of course there's always school sure gone out of that yeah having to freaking write essays and stuff and I'll never forget like writing these things and being like I just want to write this video instead I don't want to do this I want to write this video and then I'd finish the essay and then start writing a video just because it's like it's what I want to do and it's just like I love that now that's what's keeping us up so we did we did we did something right where it's like I still have those nights where I don't sleep just because I'm like I want to do this I start listing lists because that's all I ever **** do with my life and like I'll stay up all night",
      "start": 5287.76
    },
    {
      "text": "it's like I still have those nights where I don't sleep just because I'm like I want to do this I start listing lists because that's all I ever **** do with my life and like I'll stay up all night doing that I'm like that's great so I get sleep deprived sleep deprived for things I like um but video games are another big one I'm going to lump video games in with friendships and sleepovers because Tony Hawk's Pro Skater like Halo all these games you just start playing with your friends and then it just turns into a let's just stay up all night yeah that's a great idea and it never is never is that worth it but it's just like oh whatever we'll just it's already two we might as way still can we see the sunrise we don't give a **** about the sunrise why do we say that but like we always do that and you push yourself then you make fun of the first person that falls asleep J sleepover all we should do a topic just on sleepovers maybe next week that'll be fun yeah I was going to say there",
      "start": 5326.44
    },
    {
      "text": "that and you push yourself then you make fun of the first person that falls asleep J sleepover all we should do a topic just on sleepovers maybe next week that'll be fun yeah I was going to say there is there was a time in my life right after college like right when I had I literally had nothing to do because I could edit whenever I wanted to where my buddies and I would stay up till 6 7 o'clock in the morning yeah I mean there was there was a summer where Alfredo stayed over at my house every single day and man our schedule was so **** up but we would just stay up for no reason every night it was just fun um but I think the the biggest cause of sleep sleep I can't even **** say this I have problems with this sleep deprivation deprivation deprivation deprived **** my life is women like when you're there's two different two different scenarios where this is a problem okay um one is when you're first talking to somebody and it's that the initial Chase and you're doing the text",
      "start": 5362.92
    },
    {
      "text": "like when you're there's two different two different scenarios where this is a problem okay um one is when you're first talking to somebody and it's that the initial Chase and you're doing the text back and forth or the AIM messages or the freaking Telegraph pigeons or whatever the hell you had to do back then um wow but it's it's it's staying up all night and constantly like for me I remember for me it was like uh like MySpace messages and stuff like that or AIM specifically AIM where it's just you stay up all night you're not even saying anything it's just **** how are you just trying to figure out how you can send a dick pic through AIM yeah exactly but it's like you stay up all night and it's not worth it but it makes you feel so good and you get to that point where it's like you want to hang out yeah what do you want to do I don't know what do you want yeah exactly all night but it's something that it feels nastier when it's at night it's just like it's just good we want to do",
      "start": 5404.56
    },
    {
      "text": "to hang out yeah what do you want to do I don't know what do you want yeah exactly all night but it's something that it feels nastier when it's at night it's just like it's just good we want to do want each other that's one of them but the other thing is when you're you're with a girl and you know you start fooling around fooling around I think is the best way to put it cuz fooling around is never a quick thing no fooling around is going to last all night and it's going to mean your your day the next day is going to suck yeah and it's like there's that moment that goes through your head where you're like man I have work tomorrow I got a lot of work tomorrow like I need to be on point tomorrow but bud I really want to do this you know and then that's that moment where you're like tomorrow's going to suck I'm going to want to sleep so bad I'm not going to get it so so like present you present you is like I don't care and future you is like I'm going to be so pissed at present you",
      "start": 5448.4
    },
    {
      "text": "going to suck I'm going to want to sleep so bad I'm not going to get it so so like present you present you is like I don't care and future you is like I'm going to be so pissed at present you right now I'm going to be so pissed at you pres me knows that but doesn't give a **** pres me always makes that choice I told you the story I got a car accident because that one time no I didn't hear that so my I I was visiting my parents house when I was in college uh my dad was like hey you you probably need new breaks come over let's check your brakes out cuz I was like they're squeaking he's like I'll do your brakes for you which I love my dad he's a very handy man he knows a lot about braks and and being a mechanic in general dad loves breaks knows a lot passion for breaks he did not know well my dad's like one of those guys who like why would I pay someone else to do this I can I can do it myself I've been doing this for years but I had a Jetta at the time and it was like a souped up like",
      "start": 5489.4
    },
    {
      "text": "my dad's like one of those guys who like why would I pay someone else to do this I can I can do it myself I've been doing this for years but I had a Jetta at the time and it was like a souped up like VR6 version of the J etta so the brakes were like way different my dad's like uh and he just kind of stared at him for a while and he's like well maybe let's just do this tomorrow before we have to go to work and it was Saturday night Meanwhile my friends were like Hey we're hanging out at my my place my the parents were out of town cuz we're all at in college at this point so no one gave a **** who was going coming or going and my buddy's little sister was there we'always had sort of always the Buddy's little sister yeah and she was I think she was a think a freshman or sophomore in college at that point and we you we'known each other for a really long time CU we went to high school together too but it was just that one night when I was like Hey and she was like Hey and we spent the",
      "start": 5525.72
    },
    {
      "text": "at that point and we you we'known each other for a really long time CU we went to high school together too but it was just that one night when I was like Hey and she was like Hey and we spent the whole night kind of fooling around yeah um and when I said the whole night I mean like oh the sun's coming up and I had work the next day but I had to finish my break so I go home my dad used to be meticulous about this he would go he would just wake me up at like nine like we got to do this because you got it's going to take us a couple hours and you got to be to work and I'm falling asleep while I'm watching like like looking trying I'm sitting on a like a a bucket and I'm falling asleep watching my dad do these breaks and eventually he was like I can't figure out how to do these we're going to have to put it back to where they were before and like we we you have to come back cuz borrow my car and go so I took my dad's 4Runner and I was on the 91 Freeway and I was just like it's just so",
      "start": 5555.76
    },
    {
      "text": "to have to put it back to where they were before and like we we you have to come back cuz borrow my car and go so I took my dad's 4Runner and I was on the 91 Freeway and I was just like it's just so warm right now oh no it's just so warm and there's like a little dull drone on the radio and I was like oh this is so good and I opened my eyes and I was approximately 3 ft away from the car in front of me going about 40 mph and just plowed into him and like I break luckily I break like I break enough to slow the pace to not hurt anyone but I hit that car probably going 20 mil hour they hit the car in front of them who hit the car in front of them and of course it's all my fault and so my insurance and I total my like pretty much total my parents 4Runner God and I was just like that was not worth it but then six months later after like the Catholic guilt for my mother was gone for having total her car it was totally worth it yeah because no one because no one got hurt and it was okay but",
      "start": 5586.6
    },
    {
      "text": "it but then six months later after like the Catholic guilt for my mother was gone for having total her car it was totally worth it yeah because no one because no one got hurt and it was okay but and and his sister little sister than that it was third scenario in a relationship or a with girl is when it's just things go wrong and you argue all night or you get in the fight or even talk okay we won't talk about this that is so upsetting **** hate that when when you're sleep probably the next day because of the **** arguments or whatever it's like you're on the phone and you haven't said anything for like 10 minutes and it's just like all all right then I mean you know you're not going to hang up now Oh no you're not hanging up it's like all right I'm not hanging up do you have anything else to say it doesn't matter if I have anything else to say you should know what I want to say you just you just yeah you you know what I'm going to say here you know you should know well we should",
      "start": 5626.76
    },
    {
      "text": "else to say it doesn't matter if I have anything else to say you should know what I want to say you just you just yeah you you know what I'm going to say here you know you should know well we should have a whole topic about breakups at one point I feel like we have to have done that before I don't know if we have or not but I I I broke up with a girl one time uh while I was we should do this topic one day here's my here's what I'm going to say I'll say it we should do a topic part I'm going to add it to the list because i'there's we've been doing it um what the you Nick had a really serious one as far as being sleep deprived yeah mine mine was just going to be uh when when Soldier Field was being renovated Chicago Bears played in Champagne Illinois which is you champ University of Illinois stadium and that you know where Chicago was six hours away from Columbia Missouri champagne that was only four hours away so me and Nunan a friend who was at Illinois State he would shout out to Pat",
      "start": 5667.36
    },
    {
      "text": "stadium and that you know where Chicago was six hours away from Columbia Missouri champagne that was only four hours away so me and Nunan a friend who was at Illinois State he would shout out to Pat Nton he would we bought like four sets of tickets or whatever so we could see the Green Bay game and a couple other games and I went back there and the Green Bay game was a Monday night game which meant it ended and then it was already super **** late let alone to drive back four hours in the middle in the dark on I70 and all these other things but I did it and I remember yeah getting close to nodding off and stopping at a Denny's and getting like steaking eggs and drinking a coffee or whatever and then getting home and literally it's one of those things I pulled up into the house in college I slammed the door I'm like oh thank **** I'm finally home I can finally go to bed and I got up to the door and touched the knob and I'm like I locked my keys in the car so then I had to call I had",
      "start": 5706.16
    },
    {
      "text": "I slammed the door I'm like oh thank **** I'm finally home I can finally go to bed and I got up to the door and touched the knob and I'm like I locked my keys in the car so then I had to call I had to call around I called the cops and like hey can can you come do the thing and they're like we can't do that anymore that's not what we do and I'm like oh I'm like well the officer still carry them and they're like well sometimes or whatever I'm like okay so then I hung up and went I my roommate had left the back door open I went there but I didn't want to leave my keys in the car overnight I went in there called from the house phone and said somebody's trying to break into a car out front and they're like are you sure he didn't just lock his keys out I'm like I'm like I don't know so then I was out there with a coat hanger just **** around it until the cop pulled up and I'm like oh hey sorry I locked myself like oh he's like let me see if I have a blackjack and he didn't so then I",
      "start": 5743.48
    },
    {
      "text": "I was out there with a coat hanger just **** around it until the cop pulled up and I'm like oh hey sorry I locked myself like oh he's like let me see if I have a blackjack and he didn't so then I still had to call on all night tow company I like **** I like it that was pretty scheming you like that that's I'm a schemer too I can scheme once in a while and I need real good I think I've told the story before that reminds me when I went to the Summer Sanitarium I told you guys the story I've only been to one like a handful of concerts in my life my buddy like hey do you want to go see Metallica yeah and I was like sure I don't care and they did a Summer Sanitarium tour uh which was at the col the Coliseum down by USC in LA and I had a load in the next day my brother used to hire me out to just carry **** cuz I was pretty much all was good for in college cuz I had weight so I could just like use that weight to carry other weight my brother had this set that he was loading into San",
      "start": 5776.04
    },
    {
      "text": "just carry **** cuz I was pretty much all was good for in college cuz I had weight so I could just like use that weight to carry other weight my brother had this set that he was loading into San Capistrano down Mission at San Capistrano and it was this hulking like two-story set that he made out of steel so every piece of it weighed like 300 lb and he's like are you sure you're going to be back in time for this thing because you got to drive all the way from LA when the thing's done and we're our load in starts at like 6:00 a.m. cuz we got to go and I'm like yeah I'm going to be back Drive in I get there at probably 5:15 in the morning and just enough time and he'd run in hotels for everyone down there so people could sleep overnight and start really early in the morning just enough time for me to lay down and people started to get up and the entire next day was a 1 4-hour day like hour load in and he tells the story of how one of his friends looked over at one point and I was so",
      "start": 5811.4
    },
    {
      "text": "time for me to lay down and people started to get up and the entire next day was a 14-hour day like hour load in and he tells the story of how one of his friends looked over at one point and I was so delirious that I was Shadow Boxing in the middle of a field I was just like doing katas right and he was like and the guy was like what the **** is your brother doing and my my brother was like I don't know just he's an idiot there today like when I when my alarm went off I killed it but there was some like that sleep like it was such a deep sleep like my body needed it to come out of that was so weird and then like I nodded back off and then you came over and I heard you shut the door and say something to Colin and it was just like man it felt like I had been I just shut my eyes but then you open up and I had all this energy all of a sudden it was crazy you were freaking r as rain this morning I ready go I I had my little things yeah the thing I like about working about you guys",
      "start": 5849.44
    },
    {
      "text": "then you open up and I had all this energy all of a sudden it was crazy you were freaking r as rain this morning I ready go I I had my little things yeah the thing I like about working about you guys obviously there's no you don't have to hide anything we all love each other we're all family all this other **** and whatever and I've gotten all this other gar Colin and I have obviously been around the block long enough with each other that like I I've I've done the thing where I bite Colin's face off like Colin always gets the raw end of my emotional spectrum because like for him especially now now especially you **** are on the list too where I don't feel like I have to hide it or whatever if something's wrong and I bite Colin off and then he but Colin always like don't **** talk to me that way and then I apologize so today on the Greg Live show I did something and I was playing I was playing with it a bit where I was pounding table how how how I click open a window or whatever",
      "start": 5891.12
    },
    {
      "text": "way and then I apologize so today on the Greg Live show I did something and I was playing I was playing with it a bit where I was pounding table how how how I click open a window or whatever you're like you're grumpy blah blah and I just in my head I'm like I must be if Colin's saying it I must be so I just calm down let's dial it back a bit like Colin helped write me a little bit there with a little nudge those are two of my favorite interactions like that's my favorite interaction to watch in this household is when Colin will fire back but he does it in a very kind joking manner but with a Stern fatherly voice and it kind of snaps Greg back into into line back into like reality it's pretty funny to watch we're we're a good couple gravity oh there you go Tim yes what's your topic all right bumblebees like from Transformers no like the bug you mean the giant the the Monstrous bee the puffy bee so here's this evolutionary mistake exactly that is my whole thing with this what the",
      "start": 5925.88
    },
    {
      "text": "right bumble bees like from Transformers no like the bug you mean the giant the the Monstrous bee the puffy bee so here's this evolutionary mistake exactly that is my whole thing with this what the **** is their deal the Bumble they piss me off because it's like all right how much must it suck to be a bumblebee must be no one screws with the Bumblebee you think other insects are screwing with a bumblebee that huge they're **** little fat **** of fluff that don't do anything yeah they pollinate okay go great go pollinate now here's the thing how how would you feel if you were a bumblebee m hm and you're chilling here and your your family includes wasps and yellow jackets I don't know if that's how that oh I see you're talking about just like genealogy and okay I thought mean like family like they all live together so you see they they're like the little **** you're saying they're like they got the short they the Hufflepuff no I of the the bee family I feel like the regular bee is",
      "start": 5965.92
    },
    {
      "text": "like they all live together so you see they they're like the little **** you're saying they're like they got the short they the Hufflepuff no I of the the bee family I feel like the regular bee is the Hufflepuff what the of regular bee the normal regular bee the honey the Bumblebee is a the big **** that's like this big if you would to say B yeah I think of bumblebees I to me Bumblebees are the default be and all the other ones are just like the superior Su I think the drones and stuff are like the the regular bee yeah that's just a be there's a normal bee that's about you know it's about this big you're talking maybe a 3/4 of an inch not very big they have one st inger and B which is the world's worst self-defense mechanism it's awes kill themselves it's so weird like that's so **** weird I don't understand cuz a hornet or YJ will stab you over and over they just keep going on your ass I've been I've been **** by like by Hornets you know like like wait wait wait and I mean",
      "start": 6011.12
    },
    {
      "text": "weird I don't understand cuz a hornet or YJ will stab you over and over they just keep going on your ass I've been I've been **** by like by Hornets you know like like wait wait wait and I mean that literally un figuratively this giant bee just comes I was I landscaped for a long time and I've had encounters man with with horns where they like they are not they don't **** around they will destroy especially when you accidentally Disturbed The Nest you don't know you did I had a I there was a nest a hornet's nest that was like in shrubs in my buddy's backyard growing up and you remember when you were growing up you would like you would do stupid **** like just run down Hills to see if you could make it and you're like oh I made it let's try it again like I attempted fate once and I F you keep doing it until you don't realize that your body's EV going to get tired and your legs are going to give out and you tumble and your head lands in a hornets nest and that's what happened to",
      "start": 6055.64
    },
    {
      "text": "F you keep doing it until you don't realize that your body's EV going to get tired and your legs are going to give out and you tumble and your head lands in a hornets nest and that's what happened to me and that **** thing exploded with hornets and they came out and we all ran for our lives inside killing them as we're going there was a couple inside and I had like five sting the good thing is they don't leave the Stinger in you the bad thing is my head like the back of my head like swelled up and it was so incredibly painful I was like take whatever you have in the in the freezer and put it on my head right now so I can't I don't have to feel my skull yeah it was terrible yeah getting stung hurts I mean be Beast things are like Beast things are are nothing like the only weird thing is when you get Su by be you have to like look and you usually see it its guts hanging off you have like kind of pull it out you got get that stinger out too cuz it has that little like nerve that keeps",
      "start": 6094.12
    },
    {
      "text": "when you get Su by be you have to like look and you usually see it its guts hanging off you have like kind of pull it out you got get that stinger out too cuz it has that little like nerve that keeps digging into your yeah but Hornets man like like it's so funny man like one or two of them will just be like like like like like a few like a few times then they just it's like Jesus Christ drive by **** I get it you know what I mean like you got me you got me I ran over a hornet nest when I was on a ride on mower once and it was bad news jum off the M yeah I was like **** yeah no man those things just keeps going it's a mower that's like the mower of death surrounded by F of **** no one can stop it it's a town nightmare It Go I got I got stung in the the eyelid One Time by one of those yellow jackets and that's traumatized me when I was young and I remember me Kevin and my brother used to like just you know do dumb **** like run down Hills and stuff but we saw a a beehive thing",
      "start": 6133.12
    },
    {
      "text": "yellow jackets and that's traumatized me when I was young and I remember me Kevin and my brother used to like just you know do dumb **** like run down Hills and stuff but we saw a a beehive thing let's throw rock it that wasar and we threw the rocket it and then it exploded and they like it's like they knew they **** know came for us and I've never been that scared like I was so I have been that scared when a couple the times there was one time a goose chased me and I was fearful for my life but but then at the last second your dad ran in and beat the **** out of the goose no my dad ran in grabbed me and ran off and the goose bit him in the ass nice so **** that goose um but anyways the the bees started chasing us and I was so scared like I I started like it was I wasn't crying but like I was like so emotional because I had seen my girl recently and that scared the **** out of I was like I'm going to die me Kevin and my brother are going to die right now we didn't",
      "start": 6175.84
    },
    {
      "text": "crying but like I was like so emotional because I had seen my girl recently and that scared the **** out of I was like I'm going to die me Kevin and my brother are going to die right now we didn't thank God but bees are so **** scary but like hornets and wasps and all these they look so cool and like when you think about them you're like they're **** badass they're pretty bad they look bad Helm helmet they're like the Boba Fetts of the freaking insect world to me if you when you look at a wasp up close it is like looking at millions of years of EV like Evolution telling you to stay away from this thing it's a weapon it is a a flying living weapon Precision weapon it's like the sniper of the insect Community there's a a video um that I saw recently it's a slow motion video of and I'm going to get the freaking genuses and families and all that **** wrong but **** you crap um there's like I think they're honey bees and there's like 10,000 honey bees in a little in their house",
      "start": 6219.2
    },
    {
      "text": "going to get the freaking genuses and families and all that **** wrong but **** you crap um there's like I think they're honey bees and there's like 10,00 0 honey bees in a little in their house the **** it's called five and um there's five wasps or hornet or whatever I think I showed you and they come in and just **** wreck shop and they kill all of them no **** they just **** kill all of them and it's so violent and it's like it almost looks like a choreographed movie where they're just **** grabbing them biting their heads off and throwing them away and just **** stinging **** with their butts and **** it's **** crazy I'll tell you the only thing in Colin will test this the only thing that can beat the WASP big wasp oh no it was the ant the other have you ever seen an ant take down **** P just a bunch of ants D the scary ants are **** scary I like I want to see like an ant Hornet and um the scorpion scorpion but that's not what I'm was talking about",
      "start": 6265.84
    },
    {
      "text": "seen an ant take down **** P just a bunch of ants D the scary ants are **** scary I like I want to see like an ant Hornet and um the scorpion scorpion but that's not what I'm was talking about scorpion crab what is this what's he um for those of you watching at home Tim is just like he have Chef on just trying toe praying mantis yes praying mantis like that would be the best fatal fourway I've ever seen I don't think that I don't know that the praying mantis is that fearsome of a creature when compared to like when I say ant I mean you not One Singular ant he's not going to do anything I'm talking about like a ton of fire ants like when they get on something they can take down small pets yeah they're phermones will guide everyone towards the target it's cool yeah man I I mean bees are funny because they're just they're essential like I I've been reading a lot about about um like be bees are becoming scarce in the United States they're scarcer and they're like and it's called what what",
      "start": 6308.88
    },
    {
      "text": "because they're just they're essential like I I've been reading a lot about about um like be bees are becoming scarce in the United States they're scarcer and they're like and it's called what what the **** is it called it's um it's not quite called this but it's like the honeybee disappearance or whatever like it's a thing oh yeah there's a lot of Buzz about that yeah and like what they're saying is that like what what's happened is that there are beekeepers what the **** is it called I know you're talking about you know what I'm talking about there's things like where like hives just disappear like entire colonies just disappear millions of bees are just gone and and uh they think it's because of some diseases and some of the pesticides we're using and all this kind of stuff also the the Africanized honey bees and RB's kind of comingling and stuff like that but I thought it was also climate too like yeah CL could be like they don't really know like it's like they're like what is",
      "start": 6352.4
    },
    {
      "text": "the Africanized honey bees and RB's kind of comingling and stuff like that but I thought it was also climate too like yeah CL could be like they don't really know like it's like they're like what is happening that like is making this happen and there's a lot of there's actually quite a few documentaries on Netflix about it which are really interesting that like people will drive in trucks now that like have be colonies that are like stable and will drive from like Grove to AR like they have like a whole thing where like they're selling their bees basically to different Growers and agriculturalists because they they without the bee without the honey bee like all of American uh agriculture like collapses it's just not possible and they were saying how like they're even trying to train people like migrant workers and whatever how to maybe pollinate like apple trees and stuff like that like they have to do it by hand because like the bees like aren't there it's insane that's crazy so like",
      "start": 6392.48
    },
    {
      "text": "like migrant workers and whatever how to maybe pollinate like apple trees and stuff like that like they have to do it by hand because like the bees like aren't there it's insane that's crazy so like so like like and they're like without like the honey bee just seems like this anoculus kind of annoying thing and they're pollinating your flowers in front but the fact of the matter is like in the Central Valley for instance like they have the poll like they are endemically pollinating the almond trees and the oranges and and like without them nothing happens and so like it they were saying like like some people say like well climate change and all these things are like really scary war and terrorism whatever they're like dude like without like the honeybee without the honey bew like agriculture collapses without this this is a serious without I know it's just funny the the the setup to was like terrorism terrorism like they're around the coffee shop like I'll tell you what not this",
      "start": 6430.88
    },
    {
      "text": "collapses without this this is a serious without I know it's just funny the the the setup to was like terrorism terrorism like they're around the coffee shop like I'll tell you what not this terrorism but but the way they were putting was really interesting I'm like all right so like you can't eat like some flowering plants and stuff like that which is almost everything but they were saying like Okay so uh the corn crop collapses uh who's going to feed the cows to give you beef right and without the beef who's going to you know so it's like domino domino yeah it's like a cat they're saying like it's a **** catastrophic issue it's really all goes back to the bumblebe it's really fascinating and they're trying to figure out like what happened like it's like yeah it's crazy like they don't know you know like it's just one of like is it climate is it is it pollution is it the pesticides like what the **** happened because it's like literally just the last 10 years I'm still going to",
      "start": 6467.44
    },
    {
      "text": "know you know like it's just one of like is it climate is it is it pollution is it the pesticides like what the **** happened because it's like literally just the last 10 years I'm still going to go out on a limb and say it's all it's the ridiculous amount of overpopulation we have and all the cars that we're driving I really think that I have no scientific data to back this up good that if we just all drove electric cars we'd be okay everything would be fixed the bees would be cool just they'be like oh those cars sound like us they're buzzing what electrically buzzing okay buzz buzz all right going back to the Bumblebee though how much of a **** he is but like damn all right for for all the **** that I'm talking about him I will say I have a weird fascination with them okay because yeah I like their colors they they're really yeah they have a nice look to them and like I remember like there's nothing funnier than little kids in Bumblebee costumes yeah that's true like those",
      "start": 6503.52
    },
    {
      "text": "yeah I like their colors they they're really yeah they have a nice look to them and like I remember like there's nothing funnier than little kids in Bumblebee costumes yeah that's true like those little dudes remember Blind Melon they'll just be R what Blind Melon the morning that's blond sorry all I can say is that my life is pretty L plain not lame lame plane plane yeah there was a bumblebee girl who danced you remember this you're way too young for this but you probably saw like on Behind the Music I saw it on yeah like I love the something yeah yeah I love the **** I'm too old for I think it I love the'90s by the way it's called colony collapse disorder yes I was looking it up it's good name and uh they're saying yeah CCD in parenthesis there you go is a phenomenon in which worker bees from a European honeybee Colony abruptly disappear and they're saying it's over 50% of all bees Nick are gone can you make a movie about this no I think they did I think it was a uh Mark Wahlberg",
      "start": 6541.72
    },
    {
      "text": "from a European honeybee Colony abruptly disappear and they're saying it's over 50% of all bees Nick are gone can you make a movie about this no I think they did I think it was a uh Mark Wahlberg film yep that's right the Shamong one was it the DreamWorks one no no the Whispering Winds or whatever one where wood that was about the trees coming alive and killing all the humans that was the one it's similar to that had nothing to do with bees though oh really I don't think so I ever watched it okay I was not going to watch a Mark Wahlberg movie where he tries to seriously act oh useless wow it says um that's not what I want from Mark Wahlberg in 2005 people paid $200 billion just to pollinate their crops because the bees they like couldn't get native to do it it's incredible I don't know why this is so funny to me for some reason you're starving you'll see who's laughing when you have no Coke yeah you can't get that coke dude that'll really yeah the corn the corn syrup in the coke",
      "start": 6583.8
    },
    {
      "text": "why this is so funny to me for some reason you're starving you'll see who's laughing when you have no Coke yeah you can't get that coke dude that'll really yeah the corn the corn syrup in the coke telling you right now have to get it with real sugar it's so weird like like we talk about all these problems that are going to undo Society or a lot of people do like what is it terrorism and War and all that kind of stuff and some some **** random thing like that is going to cause like a massive fat it will be the Bumble bees a weird thing about bumblebees is you know there's the the classic piano song flight of the bumblebees and what's really weird is that bumblebees can fly at all because it doesn't make physical sense for their the size of their body compared to their wings like they shouldn't be able to fly but they can is this something real or is this something this is something that I did just read on Wikipedia I'm trying to sound like Colin that's fine I was making I just thought I",
      "start": 6624.2
    },
    {
      "text": "be able to fly but they can is this something real or is this something this is something that I did just read on Wikipedia I'm trying to sound like Colin that's fine I was making I just thought I didn't know if you're just going off what you envision a bumblebee to look like and then you're like it's weird God's creatures I've told you the story before but I'll tell it again because it was one of the most terrifying events ever happened to me to this date I was playing soccer in my buddy's backyard I don't know why I looked up and I saw a branch that had like like it was like a pepper Branch the red peppers that used to like in the tree I was like I kind of want to like mush those in my hands right now and just I don't know why you just subc you want to destroy nature understand and I'm like huh and I reached up and I grabbed it and I felt something moving in my hand and I opened up my hand there was a bumblebee in there and it looked up me I mean like huge it was the when I was a",
      "start": 6660.32
    },
    {
      "text": "like huh and I reached up and I grabbed it and I felt something moving in my hand and I opened up my hand there was a bumblebee in there and it looked up me I mean like huge it was the when I was a kid it was the size of my palm basically and I swear to God that thing looked at me before it stung me and was like this is happening now you're **** now here's the thing Nick and I was trying to sh in recorded history to get stung by a bumblebee oh dude I didn't even say this maybe was bumblee in my brain it was a giant hairy bee monster that still haunts me and it could have just been a nor just a big it was probably not a bumblebee cuz that's my thing is just like if you got stung by a bumblebee just leave get the **** out I've been stung by be before I'm pretty sure I I'm pretty sure it was Bumble presumably bring me up an image of what you're when you say bumblebee I'm big in the fat **** **** yeah yeah you know what I mean fat **** **** I really fluff yeah I know who",
      "start": 6695.48
    },
    {
      "text": "it was Bumble presumably bring me up an image of what you're when you say bumblebee I'm big in the fat **** **** yeah yeah you know what I mean fat **** **** I really fluff yeah I know who you're talking about I talking your skinny little dudes those those sting pretty sure they sting and I'm pretty sure their Stingers are huge and it's really painful my sister Ally this is a weird thing my with the big bees you're talking about uh when I lived on Long Island we lived in you know a nice house you know surrounded by a lot of flowers so we we attracted quite a few bees and birds and things of this nature and and she used to walk up to and was able to pet the bee because you know how they have like like they're so docile and **** like that actually like you don't **** with them really she like used to like touch them and like pet pet their backs whatever and they would move or whatever it was like so weird that's weird so I used I was like can you that make me laugh that",
      "start": 6731.2
    },
    {
      "text": "really she like used to like touch them and like pet pet their backs whatever and they would move or whatever it was like so weird that's weird so I used I was like can you that make me laugh that **** that's not a bumblebee that's a drawing of a bee that is a bumblebee that's a bumblebee yeah yeah that's what I was thinking about that's what it looked like oh God I like how terrifying that thing is Bubbe they are weird looking but they don't sting you they do sting you no they don't though I did with compedia research they do sting but only if you really **** with them so I guess you did really **** with cased it in his sweaty they have to be they have to be self-aware that they're going to die when they do it imagine so it must be for the good of the colony you know like yeah take care imagine if if if someone if a giant hand right now reached in thinking we were berries and grabbed all of us what would you do to that hand to survive bite yeah that's the probably sh myself",
      "start": 6766.16
    },
    {
      "text": "care imagine if if if someone if a giant hand right now reached in thinking we were berries and grabbed all of us what would you do to that hand to survive bite yeah that's the probably sh myself what is this big hand what is happening it's Godzilla it's Goeta so they say it in Japanese ladies and gentlemen that's the GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement if you like that you can get the whole show early each and every Friday over at patreon.com kindafunny but if you don't have any money to give us no big whoop you go to youtube.com/ kindafunny Monday through Thursday kind of Monday funay Monday why don't we say that more I liked it broken out topic by topic day by day for your amusement until we post the whole thing for free on Friday on YouTube on MP3 services like iTunes and SoundCloud and such it's everywhere by the way like people we talk about iTunes a lot but",
      "start": 6800.36
    },
    {
      "text": "your amusement until we post the whole thing for free on Friday on YouTube on MP3 services like iTunes and SoundCloud and such it's everywhere by the way like people we talk about iTunes a lot but it's it's on Beyond Pod Beyond it's on um freaking Stitcher it's on it should be on the the not Xbox Microsoft Marketplace for the zoom people okay people are telling me it's not but I've seen it so I don't know no no one knows how to use the Zoom marketpl is what you're saying you should stop using Zoom to be honest everyone go to kindafunny.com see all the content we put up each and every day go to kindafunny.com Store buy the new Tim shirt which is just a black v-neck we've put up buy the painting too yeah before that shirt comes up on we put the **** shirt up my God it's so easy they a limited run a limited run 50 v-u that's it that's it just do it all right there you go what what just do it did you hear how he talk to you like like just **** do it no you don't got it man Greg's",
      "start": 6845.4
    },
    {
      "text": "limited run a limited run 50 v-u that's it that's it just do it all right there you go what what just do it did you hear how he talk to you like like just **** do it no you don't got it man Greg's at the Tipping Point again just let him go L be like hey do you have a box of 50 v-neck that you haven't put any Sil screen on 4XL shove them up there who cares I'm I will make I like I do with everything else here around here you make you make the world spin you do it all for us like a Top Spin round right won't care won I won't you're right I'll never give you the credit you deserve I don't want it to go to your head Greg's got to be the unsung hero I am the unsung hero this place mhm ladies and gentlemen until next time it's been our pleasure to serve you on the Michelle Branch damn it the legend of Michelle Branch I couldn't **** remember what it was gonna be nasty I'm going to **** bed good night [Music]",
      "start": 6890.68
    }
  ]
}
