{
  "id": 630,
  "video_id": "l9R7ZpEeltw",
  "show_name": "Gameplay",
  "hosts": ["Tim Gettys", "Colin Moriarty"],
  "title": "Let's Play Super Mario Bros. 3 Part. 1 - Throwback Thursdays",
  "description": "Mario 3 turned 25, so Colin and Tim take a look back at the masterpiece.\n\nPlease support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1424376002,
  "duration": 687,
  "transcript_chunks": [
    {
      "text": "Greetings and salutations , my name is Colin, this is Tim Gettys, and we're here to play a little Mario 3. Now Tim, Super Mario Brothers 3 is a game you and I both hold near and dear to our hearts. It just turned 25 here in the States. 2, well it's it's just as old as you, which is a little disturbing cuz I remember getting this game when I was a young man, a very young child of youth as they sometimes call it. So I figure what we do Tim is this week I'll play through world one, we can blaze through it really quick, and then next week you can play through world two and blaze there. We'll just show people some of this classic NES game from'88 in Japan, but it didn't come out here until'90. So let's let's uh play. So 90 or 89, 90 right? Oh really? I mean, I don't know. I was born in'89 and I'm 25, but I guess there's a little overlap. Yeah, a little over, that's how things work. Yeah, I think it's early 1990 s when it comes out. So we'll play and we'll have fun. I haven't played a Mario game in a long time. I don't know",
      "start": 0.08
    },
    {
      "text": "a little overlap. Yeah, a little over, that's how things work. Yeah, I think it's early 1990 s when it comes out. So we'll play and we'll have fun. I haven't played a Mario game in a long time. I don't know about you. It's been a while since I played a flat 2D Mario. So as I've said many times, my uh first console that I owned myself was a Super Nintendo and it came with Mario All-Stars. So to me all the original Mario games, the All-Star versions are kind of like my childhood. So it's always weird seeing the NES one, which I know is blasphemy for yeah, know I mean, but you know, I'm I'm kind of coming to terms with the fact that I'm just so old, uhhuh, that uh you know, at 30 years old that I'm just a lot older than a lot of people and I can't really judge them anymore for not having played uh certain games or whatever. So I'm not going to hold it against you, Tim, you know, no one oh God, I lost it all. No one oh jeez, oh no. Oh, there you go. Um no one thought that you would be born in 1989 or 1 990. You didn't ask to",
      "start": 37.04
    },
    {
      "text": "so I'm not going to hold it against you, Tim, you know, no one oh God, I lost it all. No one oh jeez, oh no. Oh, there you go. Um no one thought that you would be born in 1989 or 1990. You didn't ask to be born 1989 or 1990. You were asked to be, you know, you could have been born in 1970. Yeah, I didn't want that though. I asked, I specifically asked not to be born in 1970 and it worked out pretty well. Cru and I I absolutely adore this. I mean, this game is just a master class and we could we could let's see, I don't know, you got to get the the full speed going. Oh, you do getting little uh secrets over there. Yeah, why not? Why don't show people what's going on? Show what's up you. Yeah, it's so funny that this game little three m this game is just it's just muscle memory and I think just also you just remember where everything is exactly. I feel like it's a little there we go. Yeah, not crazy about playing on the Wii mode. I don't think I've ever played this game on anything but the NES or SNES of course. Yeah, oh",
      "start": 78.68
    },
    {
      "text": "everything is exactly. I feel like it's a little there we go. Yeah, not crazy about playing on the Wii mode. I don't think I've ever played this game on anything but the NES or SNES of course. Yeah, oh so we got the star beautiful. So what's really cool about this game, you've heard the theory about the play, right? The entire thing is the play. That makes sense. But no, I don't think I've heard that. When you start in the beginning, you know, you see like the drawings and stuff and a lot of the architecture in the levels is being held up by like uh set pieces and all that stuff. That's interesting. I never heard that. Pretty cool. That is pretty cool and uh at the end like when the credits roll it's like it says like act one, act to all that stuff. So yeah, know I never heard that. That's actually kind of cool. Mhm . So we'll do a little see what we can do this. Oh, oh see I love uh this is the first level you get the uh the star in Mario 3 and you do the badass little flips. I always love that. Yeah, the",
      "start": 125.08
    },
    {
      "text": "of cool. Mhm. So we'll do a little see what we can do this. Oh, oh see I love uh this is the first level you get the uh the star in Mario 3 and you do the badass little flips. I always love that. Yeah, the animations are really cool in this game. I just I don't know man, even though I like Super Mario World more than this game this this is what started it all. I for I mean and obviously there was a Mario and Mario USA and and and lost levels and all that kind of stuff, but this is really the game that oh I'm like Wait playing way to OCD already. This is the game that really began the formula of Mario that I think we know in terms of the layout of oh **** the layout of the game. Yeah, um what I mean by that is it's not like world one one world one two world one 3 with no kind of context damn um but rather a game with maps and a game the world map and all the secret yeah now I'm wondering if I should just should I just go straight down and get that little toad house I don't know I want I remember",
      "start": 160.96
    },
    {
      "text": "a game with maps and a game the world map and all the secret yeah now I'm wondering if I should just should I just go straight down and get that little toad house I don't know I want I remember level four always used to **** with me yeah level four is pretty hard Auto scrolling one those are a little now this this level has a really cool secret uh it's the the first whistle in the game and honestly like do we want to get it it's isn't it over here no no no it's later towards the end what's funny I was going to say was like I barely remember some of those whistle secrets and what's funny is that the last FAQ that I wrote on IGN or on GameFAQs was a whistle location epic and it's got all these asky maps you can kick some of these can't you some of these things there we go um it's funny how you kind of just remember some of this **** um but I don't know oh there we go the uh the memory of uh of yeah it's over here it's this white one right there you duck right you just yeah just hold",
      "start": 203.32
    },
    {
      "text": "you kind of just remember some of this **** um but I don't know oh there we go the uh the memory of uh of yeah it's over here it's this white one right there you duck right you just yeah just hold down for like 10 seconds or whatever then you fall back which is another thing of like this is like looks like a play where it's like all the different things so now you're in the the backdrop which is awesome you have to press up right am I overall I think you just have to keep going right I think I might have messed up there we go there cuz I jumped over it one toot on this whistle will send you to a faraway land so you can find this whistle and there's two more whistles and it allows you to beat the game very quickly maybe we'll maybe we'll do that at some point but yeah but not today no not today but we'll get him though yeah because it's fun yeah why not and The Wizard taught us the wizard did T us how somehow he knew yeah um why is it there we go feel like I feel like I got to be",
      "start": 246.52
    },
    {
      "text": "not today but we'll get him though yeah because it's fun yeah why not and The Wizard taught us the wizard did T us how somehow he knew yeah um why is it there we go feel like I feel like I got to be honest with you I feel like the buttons are all messed up on this weo you'll tell me when you play yeah we'll see not could be making oh Jesus who could you keep it toad **** want all right so we'll Dodge four for time also for time might as well do this thing yeah look at him got got a gut a little Tanuki tail though little **** ass snoy tail oh damn messed that up yeah it's all about oh that was terrible that's the worst possible one you can get um all about timing yeah timing not very good there all right so here we're in the Fortress man this level used to stress me out too when you get to the part where you go through the door and then the spikes come down yeah I love the lava animations here yeah I was watching a video of this of the game recently we don't want that I don't want",
      "start": 291.48
    },
    {
      "text": "to the part where you go through the door and then the spikes come down yeah I love the lava animations here yeah I was watching a video of this of the game recently we don't want that I don't want that at all um and I was so enamored by like the animation of for some reason of the lava like it just looks so cool it's very well this game is very well made and this game really captured a lot of people's imaginations I feel like when we were kids I mean for me I think I told a story on the games cast once um that you go it's like the girl in The Wizard like get the whistle Jimmy and Jimmy's all like **** how the **** you know about that **** this is very obscure of a secret to figure out with the game you've never played before not out in this country he just he used his he used it's intuitive that for him so we got both whistles not going to use them we could if we want to but I let not let's just let's just go through okay so this is an interesting this is always fun too yeah",
      "start": 348.52
    },
    {
      "text": "intuitive that for him so we got both whistles not going to use them we could if we want to but I let not let's just let's just go through okay so this is an interesting this is always fun too yeah you just kind of destroy destroy those guys right off the bat this game is great too you can even see just in the gameplay that like it really teaches you how to use the different functions that you didn't have in the other ones cuz you could never do that before in Mario one two yeah it does like this level really teaches you hey this thing and the second level kind of does also but like I like that in the second level you did it where just Naturally by muscle memory where you run and Duck and you kind of slide underneath the things they get the PE the yeah and it's like it's cool that even in the second level the game kind of like pushes you to figure that out yeah I mean that's what it's so intelligent about a lot of these game designs on NES games and even as NES games is that there",
      "start": 392.04
    },
    {
      "text": "in the second level the game kind of like pushes you to figure that out yeah I mean that's what it's so intelligent about a lot of these game designs on NES games and even as NES games is that there wasn't a lot of room for tutorial or anything at least overtly so you had to teach people to do things in in more clever ways and I I always kind of love that as well I mean I think Game Grumps were the guys that talked about oh jeez about Mega Man and how how it teaches you how to play Mega Man Mega Man and it's awesome without yeah without roll coming in or something and annoying the **** out everyone and I think that like games like that just aren't really designed like that anymore I feel like even old school games um today with rare exception uh care here yeah we don't want to one of these is a I think it's a if you jump up you oh I know isn't one of these a um yeah yeah I already hit it so now it's going to be all done it's funny I'm playing like I'm just enjoying myself you know",
      "start": 428.72
    },
    {
      "text": "is a I think it's a if you jump up you oh I know isn't one of these a um yeah yeah I already hit it so now it's going to be all done it's funny I'm playing like I'm just enjoying myself you know that's what happens to Mario 3 man yeah one of these is there we go oh oh I missed it we don't need it no we're good um I'm just enjoying myself yeah it's funny so next week I'm going to be playing World 2 I'm a little interested about that because I cannot remember the last time I played World 2 cuz usually when I play this game I get the two whistles go straight to the world eight and just kind of go from there like I remember it's the the desert world so we got a lot of that stuff going on but I believe in you yeah I think I think we'll be okay okay another thing that's interesting about this game is levels are so damn short they are but you're blazing through them I mean it's the old trick right of just holding B down M even then though like if you compare the levels in this to world or",
      "start": 465.6
    },
    {
      "text": "game is levels are so damn short they are but you're blazing through them I mean it's the old trick right of just holding B down M even then though like if you compare the levels in this to world or even to one or even well two two had really long levels um but they're very short let's see here God damn it damn it look at this hodge podge of garbage I love that the whistles are the Zelda whistles this music's badass too **** oh all right now I love this guy I mean so this is the stuff that I was saying before when I cut myself up before this really captured my imagination when I was a kid um Toad's **** he's like not having bugging out but this really captured my imagination when I was a kid and I was I talked about I think on the gamescast how I used to just take my Legos and build these airships with the old plane propellers and stuff these levels are just so damn cool 69 coins just so you know you don't get a bonus for that but you should yeah and some of the the airships later",
      "start": 507.72
    },
    {
      "text": "airships with the old plane propellers and stuff these levels are just so damn cool 69 coins just so you know you don't get a bonus for that but you should yeah and some of the the airships later on just get out of control yeah which is awesome the game poses a pretty good challenge did you ever see that the tool assisted speedrun of Mario 3 like the original speedrun thing where it was like 11 minutes speed in the game and like he was just **** bouncing on all of the different things in the final God that **** was cool oh yeah saw that coming here we go who do we face off against first is Iggy I think yeah yep that's my boy Iggy I wanted oh jee z I wanted the um the fireflower now here's the key Colin yeah you got to jump and catch the wand no no there you go yeah there we go you has to bounce first it's beautiful all right that's world one of Mario 3 we Blaze you were pretty quick I always love this part dude this is just such a beautiful little fall Mario safe though no fall",
      "start": 560.24
    },
    {
      "text": "to bounce first it's beautiful all right that's world one of Mario 3 we Blaze you were pretty quick I always love this part dude this is just such a beautiful little fall Mario safe though no fall damage see some Shovel Knight in this if people played Shovel Knight you can see some of this little inspiration here and a lot of Mario 3 actually in that game uh Tim thank you for joining me I do appreciate it this is Mario 3 for all you guys out there and gals that might want to download you can download on pretty much anything if you don't have it on NES or SNES you can get on Wii or Wii U or 3DS um so enjoy it it's a great game if you haven't played this play this absolutely this is a must playay game you get the get the pewing here which maybe you'll find out a little bit about later on uh she was toad stool yeah Princess Toad stool pulling this Peach **** yeah I don't know when did that happen 64 64 when at the end she gives the letter she's like princess Toad stool right right right",
      "start": 622.8
    },
    {
      "text": "she was toad stool yeah Princess Toad stool pulling this Peach **** yeah I don't know when did that happen 64 64 when at the end she gives the letter she's like princess Toad stool right right right that's a good point that's a good point Tim I hope you had a good time I had a good time play Mario 3 happy birthday Mario uh and we will see you soon right here on Kinda Funny games AR [Music]",
      "start": 657.44
    }
  ]
}
