{
    "id": 626,
    "video_id": "Qn44ZbDKzwI",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "New E3 Press Conferences - Kinda Funny Gamescast Ep. 07 (Pt. 3)",
    "description": "Bethesda announces their first ever E3 press conference.\n---\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1424268002,
    "duration": 834,
    "transcript_chunks": [
        {
            "text": "[ Music] yeah catch other things people like a lot. Bethesda, no people really really like Bethesda . Now Bethesda did announce something a little crazy this week that they're going to have their own press conference at E3. Yeah, we talked a little bit about this over on youtube.com/kindafunnygames. We had a react video, we're talking a little more about it now. Yeah, you you guys talked about it and thought talked about what you thought was going to be there . Let's do a quick recap on that. What do you guys think is going to be announced there? Make a note on your phone so I know how to edit this. God, you're bad at being a host. What do you mean? Jeez, what what do I need to make a note of the break? Oh no, I got that. Sure you do. This guy doesn't know what he's doing ladies and gentlemen, episode seven it shows uh Fallout 4 of course. Yeah, that's a lock. I would say it's lock of the week. That's got to be. I mean that's got to be it. It's I mean you imagine shocked everyone would be. Can you imagine the **** Fury",
            "start": 0.31
        },
        {
            "text": "uh Fallout 4 of course. Yeah, that's a lock. I would say it's lock of the week. That's got to be. I mean that's got to be it. It's I mean you imagine shocked everyone would be. Can you imagine the **** Fury that would happen on the internet? Don't announce it. They are not. I'll burn that place to I'll burn Hollywood to the ground. They're going to announce Hollywood. You're going to burn an entire city to the ground. It's not even happening in Hollywood. It is it is oh that's where that's where they're having their their press conference press conference. Yeah, Burn It To The Ground. Burn It To The Ground. Thank you. Yeah, no that's the thing is like what a cockes if this isn't person I'm sorry if this isn't Fallout 4 it is it's going to be other things but it it it is fall I mean they're not stupid. This is the first time they've ever done this and they're not going to do it to be like oh Doom and this is another thing like the Persona thing we're talking about is that Fallout is an event. Fallout is a",
            "start": 45.8
        },
        {
            "text": "the first time they've ever done this and they're not going to do it to be like oh Doom and this is another thing like the Persona thing we're talking about is that Fallout is an event. Fallout is a thing you throw your own press conference for this kind of exactly and I think that is the the biggest deal here is these event games Grand Theft Auto 5 showed something you know it comes out it's not an annualized game and it did huge and we're seeing Persona 5 not a game since 2008 and like when it comes out it's going to be huge but Bethesda does the same thing like they don't just release their games like year after year after year when people when they announced Skyrim people lost their mind exactly so this year like obviously they're having their conference they're going to show something so we're probably going to see Fallout 4 we're probably not going to see another Elder Scrolls but we might I think it's possible possible and I I I mean I I don't know what you're going to say maybe",
            "start": 81.36
        },
        {
            "text": "we're probably going to see Fallout 4 we're probably not going to see another Elder Scrolls but we might I think it's possible possible and I I I mean I I don't know what you're going to say maybe you're going to say the same thing but remember that New Vegas was done by Obsidian and this was done while Bethesda Game Studios was doing uh Skyrim and then now they're working on Fallout 4 and it's possible I mean we don't know they're working on Fallout 4 they're clearly working on Fallout 4 the other of course Trump the other of course Trump cards that maybe they're just doing the eldest Ro six which you also cause people to freak out bur Hollywood to the ground be point but I think it's possible that I don't want to say it's Elder Scrolls six but I think Bethesda would be somewhat silly not to find a studio like Obsidian and I don't think it is Obsidian because they are quite busy um but a studio like that to say like here is the engine go make an Elder Scrolls game here's Skyrim City",
            "start": 117.52
        },
        {
            "text": "to find a studio like Obsidian and I don't think it is Obsidian because they are quite busy um but a studio like that to say like here is the engine go make an Elder Scrolls game here's Skyrim City Stories like yeah something like like maybe not a maybe not a Canon like Oblivion or Skyrim kind of game but I wouldn't be shocked if like some studio somewhere is making a Elder Scrolls game that is not that is a stop Gap is that more likely or is it more likely that they're doing Skyrim PS 4 Xbox One well I'm sure that I I feel like that's probably happening too regard I mean I would irregardless I'm not sure I'm not sure if Skyrim's the game or Fallout 3 and New Vegas were going to be the games that come over or all of them but I think that there's money to be made to re-release those games in anticipation of Fallout 4 yeah 100% but and you've joked around about them putting them all on one disc you could fit them all on one dis so it's it's just a matter of thousands of hours of RPG",
            "start": 157.04
        },
        {
            "text": "in anticipation of Fallout 4 yeah 100% but and you've joked around about them putting them all on one disc you could fit them all on one dis so it's it's just a matter of thousands of hours of RPG content on a one disc um I think that would be I think that that would it's the same thing we say about Uncharted right like yeah like wouldn't it be kind of obvious to just release Uncharted one two and three on and just send it to Blue Point or one of these one of these Port houses and have them re-release it for $ 40 a few months before Uncharted 4 comes out I mean Sony does that over and **** over again they did it with Sly they with Ratchet they do it with you know they did it with Team Eco collection when they thought the Last Guardian was going to come out uh you know so like they've done that over and over again so I think that that makes sense so I think the same thing would happen with Bethesda the more exciting and interesting thing I think cuz Fallout 4 is so **** obvious is that what",
            "start": 200.88
        },
        {
            "text": "over and over again so I think that that makes sense so I think the same thing would happen with Bethesda the more exciting and interesting thing I think cuz Fallout 4 is so **** obvious is that what else are they going to announce because it's not only going to be Fallout yeah people are talking about Doom people are talking about Dishonored I think Dishonored is a little more likely yeah Dishonored super likely well Doom's in development so I don't know like what and it's been in development for a while so I don't people forget what's the beta what isn't there beta stuff to that you what what was which game did you buy to get into the Doom beta wasn't it Rage was that was that it I thought there was something more recent than that hold on you were trying to go towards event games yes exactly so you want to know other event games no just like is that the future is that is that the future and is what so not only that is Bethesda so this is their first press conference this puts them in a",
            "start": 237.56
        },
        {
            "text": "so you want to know other event games no just like is that the future is that is that the future and is what so not only that is Bethesda so this is their first press conference this puts them in a different leak because up until now it's just been there's the big three so we got Nintendo Sony Microsoft then there was always Ubisoft and E then that was it I was going to say they used to be Konami right Konami kind of did it for a while and then they tapped then it got way more and more similar to like a Nintendo Direct sure sure sure sure sure which wasn't bad um it's fine it's fine and it's like that you know that's very representative of Konami of where it was at compared to where it is at yeah and the types of things that it does Bethesda is now like **** you guys we're stepping the **** up not was it Wolfenstein Skyrim prey to a new Direction that's out of this world Game Spot maybe it was Skyrim it was one of those games I thought I could have sworn it was Rage I thought it",
            "start": 276.96
        },
        {
            "text": "**** up not was it Wolfenstein Skyrim prey to a new Direction that's out of this world Game Spot maybe it was Skyrim it was one of those games I thought I could have sworn it was Rage I thought it was more recent I thought it was something super recent I love this this is **** awesome I'm going to Google I'm going to Google this game doesn't exist anymore what the hell happened to that game nobody wanted it pray to they're talking about for the audio listen oh yeah for the audio listeners so uh here's the thing Tim about what Bethesda is doing specifically you guys talking about Konami I don't think they were capable of really obviously they weren't Wolfstein it was Wolfenstein okay pre-order so quite not 2 011 um so the thing about Bethesda that I think a lot of people Overlook and I why I think this is a smart Optical game for Bethesda to be playing is that they really do have the same status in terms of Studios owned as EA and Ubisoft who do their own conferences every year with much",
            "start": 319.16
        },
        {
            "text": "I think this is a smart Optical game for Bethesda to be playing is that they really do have the same status in terms of Studios owned as EA and Ubisoft who do their own conferences every year with much success and I think they have things to show off so they own Arcane they own ID you know they own these Studios they own machine games so what are they working on and like so Fallout 4 will obviously be this big temp pole exciting thing that they're clearly gonna clearly gonna insert into they start or end with it no they end with it that's Uncharted PlayStation remember yeah but that was dumb see like that was that was I it gave the people what they want so they there all everything came I'm Greg Miller I want him shed everything that came at that was a really bad pacing everything that came after it was not was not as good nothing they showed so many different levels nothing they showed was as good as Uncharted it was a that was to me a bad move it was exciting to see it it should was it",
            "start": 368.04
        },
        {
            "text": "it was not was not as good nothing they showed so many different levels nothing they showed was as good as Uncharted it was a that was to me a bad move it was exciting to see it it should was it the coming out on PS4 no that that was the biggest troll of all time was that was that was the best I'll never forget that as long as I live I was like oh my God because just for about 5 seconds I'm like they're going to do it and this is and I'm like and they're like oh like oh my God you guys you guys are the funniest **** people like Square is just the funniest excited for E3 but Bethesda owns these you know so Dishonored 2 has been long rumored I think Dishonored 2 is probably going to come out this year so I think that like they they are ready to show that Doom has been incubating forever and even though software has lost some of their key people um including some of the you know going to Oculus and **** like that which is you know makes sense for you know John Carac who um obsesses over",
            "start": 408.28
        },
        {
            "text": "though software has lost some of their key people um including some of the you know going to Oculus and **** like that which is you know makes sense for you know John Carmack who um obsesses over frame rates and things like that it's just funny that you know like that's where he belongs obviously he's going to do some tech stuff now I think that um you'll see Doom 4 I think you'll see Dishonored 2 I think you'll see obviously Fallout 4 and then I think you're going to see some you know some acknowledgement of maybe there you know machine games which was which was purchased by Bethesda before Wolfenstein even came out that was their first game I think that they'll obviously make a sequel to Wolfenstein um to the New Order and I think you'll probably see a new IP so I think that there's going to be probably five or six games the thing I don't want them to do is do what EA did and we talked about this on Colin and Greg I think which was EA just showed you **** you know I don't think here",
            "start": 448.84
        },
        {
            "text": "to be probably five or six games the thing I don't want them to do is do what EA did and we talked about this on Colin and Greg I think which was EA just showed you **** you know I don't think here here's an Adat for a game that might come out in like four years if you're not caught up last year the press conference for EA was a bunch of vignettes about games like hey this is what the Mass Effect team's kind of working on hey we don't know what exactly we're going to do more things here's what the Star Wars guys oh here's that yeah it that I think is a different experience because my question about this Bethesda event is there one next year and I say no right like I think they're doing this because hey we have this giant slate of games we need to announce and tell you about awesome here they are next year they don't have that again because what we're talking about is that games need to be event games if you have event games you can't make a conference every year like EA last year",
            "start": 485.08
        },
        {
            "text": "they are next year they don't have that again because what we're talking about is that games need to be event games if you have event games you can't make a conference every year like EA last year where they're like **** here's what the Criterion guys are working on too you know what I mean like they can't sit there and say do it churn do the churn of here it is this what we're doing this year this what we're doing this year and have a giant slate to show well couldn't they do that they don't need a giant slate though if it's event games right like if they have these big yeah but it's weird three this year three next year like well that even that I mean like event games though is different than three games you know what I mean but I mean even all the games that we just mentioned like so obviously Elder Scrolls obviously Fallout but I mean Dishonored yeah it's not so much like an event game but just the fact that but that would pad an event a conference yeah exactly I think I think",
            "start": 524.2
        },
        {
            "text": "obviously Elder Scrolls obviously Fallout but I mean Dishonored yeah it's not so much like an event game but just the fact that but that would pad an event a conference yeah exactly I think I think the reason we think it's going to be Fallout and other and it's Fallout and friends right is because it's weird in E3 conference for one game that doesn't happen right all the ether conference is to show you a million games unless they have a huge expense to put out for if you're going to do one game then just have your one St alone event outside of E3 unless unless they have something so substantial to show for Fallout 4 that they think that 45 minutes and it's out tomorrow yeah that'd be awesome I still I mean I still stand by the fact Fallout 4 comes out this year like I really I there's something in me that says that they're ready like you know like that the game has been in development for a long time you know and that that maybe they like I don't see I often wonder if this long 12 to",
            "start": 558.64
        },
        {
            "text": "in me that says that they're ready like you know like that the game has been in development for a long time you know and that that maybe they like I don't see I often wonder if this long 12 to 18 month lead time that we go with a lot of games doesn't injure some games and that they don't need to do that and I think we said we we called out you know Charles Anette's uh statement about Half-Life 3 which always stuck with me which is that Half-Life three is one of those games where they can announce it the day it comes out and it won't affect anything oh yeah you know they'll sell millions of copies of that game because people are just crazy about it and Steam or Valve is crazy enough to do it where they'll be like hey Half-Life 3 we're ready to talk about it it's **** on Steam right now it's done you know be and and and yeah exactly and I think Fallout 4 is one of those games where they can say it's coming out in four months we have a huge secret the game is in beta right now internally and it's",
            "start": 598.64
        },
        {
            "text": "know be and and and yeah exactly and I think Fallout 4 is one of those games where they can say it's coming out in four months we have a huge secret the game is in beta right now internally and it's coming out in November and we're going to show it to you now and we'll have the press play it in August and we're releasing it in November and people would flip the **** out and it's not going to affect anything I mean if anything that's going to help just because there'll be so much media Buzz about oh my God there's this huge surprise everyone should know about it do it do it Bethesda but but of course of course the other thing is that I want them to take their time if they need time and they need another year do it Fallout 4 right you know but I really feel like the quiet out of that studio is very interesting to me you know like like Bethesda as a publisher isn't so quiet but Bethesda's internal development Studio that makes sky that makes Elder Scrolls and makes Fallout are Qui",
            "start": 636.84
        },
        {
            "text": "studio is very interesting to me you know like like Bethesda as a publisher isn't so quiet but Bethesda's internal development Studio that makes sky that makes Elder Scrolls and makes Fallout are Qui they're quiet and Todd Howard is not saying **** nope and so I think that that studio is hunkered down obviously working on the game the game has been rumored to take place in Massachusetts what they call the Commonwealth and Fallout war and I think that you're those rumors have been happening forever yeah exactly somebody what was it somebody from MIT posted that like hey they're here checking out our school and doing all these different things so I think that you know it's not beyond the realm of possibility and I'd like to see I'd like it as a test bed to see you know it's the same thing with Grand Theft Auto like Rockstar really strung that out and it was good and it worked out for them but I'm not sure they had to do that there are just certain games that don't have to do that and I",
            "start": 678.48
        },
        {
            "text": "Grand Theft Auto like Rockstar really strung that out and it was good and it worked out for them but I'm not sure they had to do that there are just certain games that don't have to do that and I think Fallout 4 is in the pantheon of games that are anticipated that we know is going to come that doesn't need this long lad time long time I think Fallout 4 or Fallout and Grand Theft Auto aren't the exact same thing because I think GTA you need to to have time to spread it to the main stream because everyone knows GTA right and there's some kid out there some 30-year-old who would buy a PS4 Xbox One or PS3 you know what I mean at the time whatever buy the system to play it Fallout 4 I think strikes me as another hardcore game right anybody who knows games and loves games is probably going to be excited about Fallout 4 yeah so I think it's I think I think that makes it more likely that it's like it's here's your first look event whenever game right away shorter lead time yeah it's exciting",
            "start": 716.28
        },
        {
            "text": "excited about Fallout 4 yeah so I think it's I think I think that makes it more likely that it's like it's here's your first look event whenever game right away shorter lead time yeah it's exciting man and and frankly as a secondary thing I like Doom and I'm excited to see Doom 4 you know like see what they can do in the post Carmack World um and see how they can deliver the graphical Fidelity that and and the engine Fidelity the 60 frame smooth 60 frame thing that they're that they're known for cuz Rage um I liked Rage I remember being really excited about as you remember probably and I played it for like 15 hours and I just kind of was like I'm going to move on to other things but I thought it was a good game I'm not sure it was C it showed what they were capable of a game like Doom if it's like Doom so kind of like a corridor linear kind of shooter with secrets and stuff like that but more like Wolfenstein like what machine games did with Wolfenstein I think that can resonate",
            "start": 750.52
        },
        {
            "text": "if it's like Doom so kind of like a corridor linear kind of shooter with secrets and stuff like that but more like Wolfenstein like what machine games did with Wolfenstein I think that can resonate people just want a pure shooter like that and they can deliver it so I'm actually I'm I'm almost as curious to see that as I am fall to be honest I have no interest in it cut it Loose Fallout only or I burn Hollywood to the ground you have my demands Bethesda you have until July to respond the complete difference between the two of us I would be way excited to see it Doom CU you have no tasting games that's very true damn Dam all you want to do is shoot stuff with shotguns [Music]",
            "start": 792.12
        }
    ]
}