{
  "id": 625,
  "video_id": "Wfhd7iRYTEA",
  "show_name": "A Conversation With Colin",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "American Revolution RETRIBUTION - A Conversation with Colin",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\nThanks to our location, Tempest Bar in SF: https://www.facebook.com/TempestBar\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nThe final season of A Conversation With Colin begins!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic By Tonedeff: http://www.twitter.com/Tonedeff",
  "published_at": 1424278806,
  "duration": 499,
  "transcript_chunks": [
    {
      "text": "England was the greatest Empire in the world, you know, the Sun never set on the English Empire, um, in the 18th, 19th centuries. Now all we talk about is Kate Middleton's butt. Exactly. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate , Colin. Now sometimes Colin says crazy stuff, so thanks to your support on patreon.com/kindafunny, we're doing a final season where I reach into my random topic pile, pull one out, toss it at him, and we talk it out for your amusement. If you like that, like the video, subscribe to us on YouTube, share us with your friends, support us on Patreon. Colin, are you ready? Yes. Today's topic of conversation is American Revolution again. It was submitted by Marco Baron who did this on Patreon. This is the one he bought to say it has to happen. So American Revolution again, will we ever have another and what would it take? Uh, guess it's always possible to have a revolution again. Yeah. Um, I think that, uh, Americans are so complacent and becoming so",
      "start": 0.28
    },
    {
      "text": "American Revolution again, will we ever have another and what would it take? Uh, guess it's always possible to have a revolution again. Yeah. Um, I think that, uh, Americans are so complacent and becoming so stupid that it's, it's hard for me to imagine that they would get, they don't get upset about anything, like the things that they really, really should be upset about. Now it's nice to see some consciousness with like, um, the racial Injustice in Ferguson or what happened in New York City as well with the cops there and you know, different things like this. Exactly. Like, you know, there it's nice to see like those kinds of that that poll still running through American society. But, but this is a conversation we've had on the GameOverGreggy Show about Ferguson in particular, that when I see these I get so upset because I don't know what what to do and I don't think the things people are doing are going to have an impact because in a week and a half there's going to be a school shooting and so the",
      "start": 44.32
    },
    {
      "text": "so upset because I don't know what what to do and I don't think the things people are doing are going to have an impact because in a week and a half there's going to be a school shooting and so the national conversation will flip to that. We have to stop school shootings. Then a week from that there'll be a plane goes missing again, we have to talk about that. Then we'll be back to another racial Injustice and it'll all start again. But I I get frustrated and flustered because I don't even know as a cognizant American, someone who isn't trying to be apathetic to everything that's going on, what to do and we can say vote, but I feel like I vote for people and nothing changes. Yeah. I I you know, I thought a lot about this in the terms of I don't think it's about modernity, like I don't think it's about because we live in like a modern connected world that we are jumping from one thing to the other and therefore can't focus on the things that matter because there are modern",
      "start": 86.92
    },
    {
      "text": "I don't think it's about because we live in like a modern connected world that we are jumping from one thing to the other and therefore can't focus on the things that matter because there are modern revolutions like what happened in Ukraine is and and and all like yeah, there's a lot of different countries that have had uprisings against you know, tyrannical governments, governments that you know, are Beyond The Pale. I mean our government is not Beyond The Pale beond uh and so you know, it's possible to rally behind something that really matters. I mean what's happening in Hong Kong especially as as as you know, a good example, young college kids that have everything to lose in a totalitarian government where they can really pay the ultimate price for what they're doing and they're doing it. Um, I really think has a lot to do with American society, you know, and the fact that like we are, um, comfortable, you know, fat society and I don't mean fat in like the literal sense, I mean like fat in the",
      "start": 123.32
    },
    {
      "text": "really think has a lot to do with American society, you know, and the fact that like we are, um, comfortable, you know, fat society and I don't mean fat in like the literal sense, I mean like fat in the sense that we just don't, we want for very little. Like people are not starving to death in the United States, right? You know, that doesn't happen here. Um, you know, there are homeless people of course, but like people aren't like it's not like giant epidemic. It's like dust bowl exactly. Like it's like we're not, it's not like complete destitution here. It's not, we haven't gotten to that that level. Now are there things that there should be like a huge Revolution over? No, but we should have, you know, uh , a Reformation in a way, something that that, um, uh, brings us back into constitutional Norms, uh, and makes our government smaller in our society freer. But how would that possibly happen? Um, I think that you have to have transformative leaders, right? Like and I think that people thought Obama was going to be a",
      "start": 159.24
    },
    {
      "text": "government smaller in our society freer. But how would that possibly happen? Um, I think that you have to have transformative leaders, right? Like and I think that people thought Obama was going to be a transformative leader, but he was just another dude that is in the same same mold. Um, I think that there are really interesting people out there that can be transformative leaders that are different on both sides of the spectrum. I think Elizabeth Warren on the Democrat side is a very compelling person, like a very like populist old school populist like almost FDR like political figure in the sense that she doesn't believe in big business in the banks and thinks that like corporate welfare is wrong, which I agree with. I agree with some of the things she says. Um, I think she can be like one of those transformative figures if she can get a base of a rally behind her. Of course it's like there's a lot of cartoon character caricatures you can make of someone like that as well. But and on the other side",
      "start": 202.88
    },
    {
      "text": "figures if she can get a base of a rally behind her. Of course it's like there's a lot of cartoon character caricatures you can make of someone like that as well. But and on the other side, I think that like the libertarian guys on on the Republican side like Rand Paul are are different interesting dudes, dudes that are willing to go to Berkeley to to speak and get standing ovations with those people because people realize there's a lot of crossover between um the way they the Libertarians feel the way liberals feel. Um, but it's tough because but yeah, are any of them going to be make any movement? The two- party system, the strangle hold of this, the fact you have to be extreme one way or the other at least during elections, right? If you're a Republican, abortion is the worst thing in the world and you love Jesus Christ and if you're not over here then you you are totally pro-abortion put pot in the schools, let all these kids do LSD. Well that's I'm not briefed on the liberal mov yeah, I mean",
      "start": 242.96
    },
    {
      "text": "and you love Jesus Christ and if you're not over here then you you are totally pro-abortion put pot in the schools, let all these kids do LSD. Well that's I'm not briefed on the liberal mov yeah, I mean that's that sounds about right to me. Um, but uh I think that yeah, the the 50-50 split on politics in the United States also makes difficult for anything to get done because we really are essentially two different countries. Like I think I honestly think that A revolution is less likely than this country actually splitting amicably into multiple parts really and um I think that that's totally possible in the next 100 years. Like I I there's very little people I mean it's a generalization but people in like Montana have very little in common with people in San Francisco. Sure. You know, and people in LA have very little in common with people you know, in New Hampshire, but that's putting it very extremely because at the end of the day everyone cares about their family, they care about their",
      "start": 275.52
    },
    {
      "text": "in LA have very little in common with people you know, in New Hampshire, but that's putting it very extremely because at the end of the day everyone cares about their family, they care about their pocketbooks, they care you know, people when when you remove politics away from the equation everyone's very similar, but since we since that that's the the Baseline which we talk about everything as a society then that means that we all hate each other and that nothing can get done. Um, so is it possible? Sure. Uh, is it likely? Very unlikely I think. Um, unless something traumatically bad happens in the United States, I think the closest we would have gotten to the conditions that would be necessary for Revolution was 2008 and because that was yeah and because that was remedied whether or not it's permanent or not, I think that that stopped it from happening . Yeah. Um, but you have to remember, I mean Revolution is also uh in the eye of the beholder, the the Confederates thought that they were revolutionaries",
      "start": 317.0
    },
    {
      "text": "or not, I think that that stopped it from happening. Yeah. Um, but you have to remember, I mean Revolution is also uh in the eye of the beholder, the the Confederates thought that they were revolutionaries so it's some you know, um you don't want you don't want uh the country to split up and you don't want these things to happen. What you want is is for a peaceful um solution to all these things, but it's just everything's so **** up that and no one trusts each other that it's it's interesting like the United States is in a really interesting place. I mean a lot of people think we're in severe decline like an Empire decline like a similar Roman kind of yeah, I mean whether or not that means that we're going to go away. I mean England was the greatest Empire in the world, you know, the Sun never set on the English Empire um in the 18th, 19th centuries and now all we talk about is Kate Middleton's butt exactly. That's exactly right . But but England still exists, they still have a proud history, they're",
      "start": 358.72
    },
    {
      "text": "the English Empire um in the 18th, 19th centuries and now all we talk about is Kate Middleton's butt exactly. That's exactly right. But but England still exists, they still have a proud history , they're just they're they're not they're not what they once were. Yeah. And I think that that's that's the likely outcome for us is that we are a a republic, a relic of of of the Enlightenment that um will always exist but not in the way it was once was and I don't know if that's necessarily a bad thing either. I think we have to kind of we didn't come to the we didn't the the revolutionaries didn't fight in the 1770s and 1780s so that we can police the world and and dictate what the hell is going if we eat some Humble Pie and if to bootstraps ourselves back up maybe that's the thing right? Yeah, the beauty is that our system leaves us open to great things and it also leaves us open to Calamity so it's it's uh that's that's the uh that's kind of the beauty the American system. Well yeah, I hope everybody in",
      "start": 400.72
    },
    {
      "text": "that our system leaves us open to great things and it also leaves us open to Calamity so it's it's uh that's that's the uh that's kind of the beauty the American system. Well yeah, I hope everybody in North Korea likes YouTube and keeps supporting this show. Colin, thank you for your time. Yeah, no problem ladies and gentlemen, is America in Decline? Is there ever going to be an American Revolution? Let us know in the comments then make sure you subscribe to our Channel, share us with your friends and support us on patreon.com/kindafunny just like Marco Baron did. Marco, thank you so much. Everyone here is going to sign the card, the commemorative card for A Conversation, a picture of Greg. I did they could not print conversation with conversation within Colin did nothing for this entire shoot. Now he's going to come at me about the God damn card. Well if you remember GameOverGreggy is where all this started. All right, Kinda Funny Games get the **** out of here ladies and gentlemen, we love hanging",
      "start": 439.52
    },
    {
      "text": "going to come at me about the God damn card. Well if you remember GameOverGreggy is where all this started. All right, Kinda Funny Games get the **** out of here ladies and gentlemen, we love hanging out with you. You're one of our best friends, support everything we do, we'll see you next time. [Music]",
      "start": 477.16
    }
  ]
}
