{
    "id": 607,
    "video_id": "yH5Va1USN-Y",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Animal Would You Domesticate? - The GameOverGreggy Show Ep. 62 (Pt. 3)",
    "description": "Nick Scarpino wants to know what badass animal we would domesticate.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1423641601,
    "duration": 878,
    "transcript_chunks": [
        {
            "text": "Nick , yes. What's your topic? My topic, of course, comes from our wonderful community of people who uh study the facts and form opinions. Um, yes, you know, very smart opinions, sometimes wacky opinions. Uh, this is a kind of riffing off that topic of of uh very important issues that the world faces. Colin's already laughing because I'm completely, I'm completely full of ****. Um, keep Klingon, he got an earring. Don't listen to him. Keep Klingon. Keep Kong says topic for the Go Show. Remember, if you have topics, please tweet him at me, Nick Scarpino on Twitter. Uh, if you could domesticate any animal, what would it be ? Now, I'm assuming we're talking about animals that aren't already domestic. I got one, Nicki Minaj. Wow. Yeah, I don't think you can physically. I don't think that there's any world. Her and Kesha were meant to run free. They need to just own it, Al. She does use a pee pad, so that's good. Does she use a pee pad? Yeah. Oh, yeah. I know, Nikki. No, I don't. I'm just, I was like, wow, you never will anymore. You're",
            "start": 37.28
        },
        {
            "text": "Meant to run free. They need to just own it, Al. She does use a pee pad, so that's good. Does she use a pee pad? Yeah. Oh, yeah. I know, Nikki. No , I don't. I'm just, I was like, wow, you never will anymore. You're shoot. Like, here's the thing, no one would ever call you out on it between that you need to start telling people you know Nikki and Miley. Would that be it? You, let's be clear, you dig Miley, right? Everyone digs Miley. Okay, it's a \"Wrecking Ball\" video. Everybody's dug Miley. No, I, yeah, yeah, yeah. Um, since I saw all the tattoos, I was like, I get it. You can't just see a part of the painting. You have to see the entire canvas, the Mona Lisa, you know. It's very true. Like, if you just saw like one of her, you know, eyes, I guess it's a good eye, but you back. I want to put my pierced tongue too. That, let's just hold on. Let's unpack. Just don't even unpack it. Just keep on, keep going. What about you forever? I think since high school, I've always said if you want to make a billion dollars, figure out a way to crossbreed",
            "start": 82.8
        },
        {
            "text": "unpack. Just don't even unpack it. Just keep on, keep going. What about you forever? I think since high school, I've always said if you want to make a billion dollars, figure out a way to crossbreed maybe a cat, but I think even like a gerbil with a ko ala. And if you can get, hold on, talking about how did you go from a cat to a gerbil and a koala? I'm saying I want a koala this big. A little koala. A little koala that just chilled out and climbed around and stuff and she ate eucalyptus, that'd be dope. But the problem is that koalas are like, they're like big. You don't want a koala that big just **** all over the house. I've heard, I'm not informed on koalas, but I've heard the koalas are like extremely scary. Yeah, they're, they're vicious and very violent. They're not vicious. They have huge claws, don't they? Because they climb. No, they're not, no, they do have big claws. Eww, because they get stoned. It's something like 9 3% have chlamydia because just why would you stop koalas from having sex and getting chlamydia?",
            "start": 123.24
        },
        {
            "text": "because they climb. No, they're not, no, they do have big claws. Eww, because they get stoned. It's something like 93% have chlamydia because just why would you stop koalas from having sex and getting chlamydia? My last girlfriend's first name was Chlamydia. Is that a problem? All right, get him down to the size of that though. And then if you're, if you're crossbreeding them with a cat, they would know how to use the litter box and then you, you could, you don't need to crossbreed something to teach it how to use a litter box. Doesn't, why you in crossbreeding even the question? Jurassic. I don't want a full-size koala. I don't want a full- size koala. I want a, I want koala. Yeah, even I mean even like Pella is a good size for being a dog, but like this, this would be too big for a koala. I feel like cuz koalas like lumber around like this and I don't want this lumbering at me . You like to hear the voice of a little caller? Yeah, he's like this. He's got Greg, come here. I want to **** on the floor. Let him **** on the",
            "start": 170.04
        },
        {
            "text": "around like this and I don't want this lumbering at me. You like to hear the voice of a little caller? Yeah, he's like this. He's got Greg, come here. I want to **** on the floor. Let him **** on the floor. Greg, I'm going to find out if they're mean or not. I'm mean, they're very mean, very mean. Greg, I'm going to bite your face off here. Come here, Greg. It's me, I'm a little koala. Time Me Kangaroo Down Sport. Time Me Kangaroo Down. It's for you, Greg. Thank you, thank you. Well, look at me, I just pe ed on your bed. Tim, yeah, what would you domesticate if you could domesticate any animal? I mean, my go-to answer when it comes to a lot of animal things is always the flying squirrel and I feel like they already, they already are domesticated. You think you can though? Sugar gliders. Sugar gliders are similar. Here we go. Okay, but like I'm talking about a wild animal that you'd have to tame. Like, I'll throw some options out there for you. Yeah, an elephant? No, a rhinoceros? Are elephants are domesticated, I guess they are.",
            "start": 214.88
        },
        {
            "text": "go. Okay, but like I'm talking about a wild animal that you'd have to tame. Like, I'll throw some options out there for you. Yeah, an elephant? No, a rhinoceros? Are elephants are domesticated, I guess they are. Okay, how about this, monkey about? I mean, well , your whole pad would be a pee pad like and you could name him Simba and he would just be Simba and he would be hanging out with you. The, can I ride him? Can you ride a lion? Imagine riding a lion. Oh my God, I always do. I always imagine riding a lion. I was doing it. We were **** talking drive on a lion. Yeah, I like that. She like Del Taco like, yes, you forgot my chili cheese fries. Simba attacks. That's you got a hair trigger. Oh yeah, I'm not **** around with no one can take me. It's like you got a tank to take Simba down. Yeah, that's what I'm putting out though. Nice. Sharks. Sharks. Oh, sharks. I don't want a shark though. You want a domesticated shark. There must be a shark. You a lot of space. Why does it even matter? You put in the bathtub with you. Just put a real",
            "start": 255.28
        },
        {
            "text": "nice. Sharks. Sharks. Oh, sharks. I don't want a shark though. You want a domesticated shark. There must be a shark. You a lot of space. Why does it even matter? You put in the bathtub with you. Just put a real shark in a tank. It doesn't even matter. Yeah, I guess you're right. I, I take it back on the shark. That won't be that fun. Yeah, it's going to be hard. I don't know for, for me, like, like what came to mind immediately and I don't know why I'm just going to go with it is the penguin. Oh, yeah. That I just feel like it would be fun to have a penguin. You just hang out, he's just chilling. I've told you this story before. I think I've told you the story before. I didn't mean that by the way, chilling. Sorry, like good. See what you did, just cooling off. Yeah, yeah, it nice. Um, I went to, uh, I went to, uh, uh, SeaWorld with an ex-girlfriend of mine. I think it was like right after college, right after high school and we got to go on the ice and and pet p like meet the penguins. I did, I ever tell you this? No, I think I, I, I",
            "start": 303.24
        },
        {
            "text": "an ex-girlfriend of mine. I think it was like right after college, right after high school and we got to go on the ice and and pet p like meet the penguins. I did, I ever tell you this? No, I think I, I, I swear I've told this. I'll tell it again. We go to the penguin exhibit and I was like, I just want to see a penguin. I just want to see a penguin. All I want to see is penguins. I don't know why like fixated on penguins, right? Yeah, and I'm like screw the killer whales, whatever. Um, I have and let me tell you something, they don't like it. No, no, no, do they? I mean, you got to get dinner a movie. You must be pretty big to make an impact on a killer whale. Listen, I'm hung like a light switch, but once you get him drunk, it doesn't matter. They don't remember it. You, you go Cosby it. Um, hey Shamu, come here. I want to show you something. I'm pretty bam PR proud of jump through this hoop, baby. Damn. Go ahead. Yahoo Answers say koalas are totally cool. Yeah, the, the Wikipedia page was really hard to find any information cuz it",
            "start": 340.36
        },
        {
            "text": "you something. I'm pretty bam PR proud of jump through this hoop, baby. Damn. Go ahead. Yahoo Answers say koalas are totally cool. Yeah, the, the Wikipedia page was really hard to find any information cuz it just doesn't get boil temperament of the Kal. Koalas are not mean animals. They sleep a lot and spend the rest of the time eating eucalyptus. Yeah, they do. I was in Australia doing a show and they had smell like eucalyptus. They have a tendency to pee on you deliberately, right? Well, deliberately, that's just funny though. Stesha says no way koalas are very tame peaceful animals. Oh yeah, said it. So we make sure that says Yahoo Answer says koal is pretty cool. Yeah, can we do that? Yes, we can do whatever we want. We can make sure it's America. We can do whatever we want. So your, your answer is the penguin. That's a, that is a great answer. I didn't first jump to dinosaurs, but I guess I'm dumb just like Greg and don't listen to the question and just come make up **** like you can do a din. Oh, I'm going to",
            "start": 378.96
        },
        {
            "text": "a, that is a great answer. I didn't first jump to dinosaurs, but I guess I'm dumb just like Greg and don't listen to the question and just come make up **** like you can do a din. Oh, I'm going to cross things. I'm saying the perfect just fine domesticate a regular koala everybody and have it be **** walking. That's like having a four-year-old walking around all the time. No, thank you. You're very, you're very passion fcking. Thank you. Want more information? Dope meerkats are dope and here's why because you could keep it like behind you and whenever something interesting happened he could like pop up, you know, or like a prairie dog, like prairie dog up. What are you, what's up? What's that? Who's there? Come here. Oh, I love that. No answer the door. Yeah, hello, it's me, the koala. The whole time Tim would love that. He would love that if it made that boys he'd be like like Tim shut that **** think like I can't do it. He's domesticated, but I don't own him . Oh man, reminds me of someone I know. I just like that",
            "start": 426.68
        },
        {
            "text": "that he would love that if it made that boys he'd be like like Tim shut that **** think like I can't do it. He's domesticated, but I don't own him. Oh man, reminds me of someone I know. I just like that two of two of the five of us. Greg immediately jumped to crossbreeding something. I don't know why and I want it smaller and then and then Tim went to an animal a species that's been extinct for hundreds of millions of years. Good. So we need to, we need to uh you know you can Bo you said the dinosaur is possible you just have to you got genetic makeup of them and create them. Yeah, exactly. So I want a little dinosaur too like a little compy. Yeah, I crossed it with a cat apparently to make a small one cuz that's how you get small animals. Anytime you want something miniaturized, you crossbreed it with a cat. Smaller trees. Have you ever seen the the \"Island of Dr. Moreau?\" Yeah, that's, that's a great show. This is very appropriate for this. Take a couple of vicin and some of that Maker's Mark just get in",
            "start": 475.2
        },
        {
            "text": "a cat. Smaller trees. Have you ever seen the the \"Island of Dr. Moreau?\" Yeah, that's, that's a great show. This is very appropriate for this. Take a couple of vicin and some of that Maker's Mark just get in there off you go baby start flirting with whales. Um, I have two. My, my first instinct was to go with the obvious which is cougar, right? Just to have a badass cougar with you all the time. There are plenty of them, LA. Oh, you mean the, there's a couple of them the Marine up here too who would dig you B. Yeah, but then I watched the documentary on a on a beast that is both Majestic and cunning and dangerous. It's called the honey badger. Oh, yeah. Are you familiar with this beast? Yeah, we know honey. Yeah, we got famous for that interview that that that big viral video interview were you to say the interview interview with the honey badger got got famous for famous for that viral video that went around \"Honey Badger Don't Care\" honey badger and it's true if you watch any anything about the honey badger there's a",
            "start": 515.32
        },
        {
            "text": "with the honey badger got got famous for famous for that viral video that went around \"Honey Badger Don't Care\" honey badger and it's true if you watch any anything about the honey badger there's a great documentary on Netflix called the \"Honey Badger\" um aply named they are ingenious little **** they can escape anything they could get to anything they are incredibly intelligent so I feel like if I could domesticate that I could actually teach them to like rob banks or do crazy **** for me and like who's how am I going to go no one's going to put me in jail if my honey badger robbed a bank I'm like I could train him to do that or can I they'd put him down though I'll just get another one okay honey badger you can't take down a honey bger honey badger literally has evolved have you played \"Far Cry 4?\" I've played \"Far Cry 4\" and I've been killed by many honey badger it can it will take on beasts like 18 times its size it'll take on lions it'll take on yeah and it goes crazy on them and goes",
            "start": 559.36
        },
        {
            "text": "\"Cry 4?\" I've played \"Far Cry 4\" and I've been killed by many honey badger it can it will take on beasts like 18 times its size it'll take on lions it'll take on yeah and it goes crazy on them and goes like straight for the balls like it literally will like again guil they they have footage of these things and they lose more more often than not but they will take on the Lions they will also take on cobras they'll take on are they indigenous to Africa or yeah I believe so oh no um we we'll have to fact check that uh they have footage of them taking on like cobras and these deadly snakes and the snake will bite them they'll kill it and then the Venom their bodies have evolved to a place where the Venom just puts them to sleep and they literally you'll see them like kill the thing and then go and then like three hours later they just pop up like what the what that was a **** crazy little journey I went yeah uh so I would go honey badger cool I think awesome uh looks like yeah you're look",
            "start": 601.36
        },
        {
            "text": "then like three hours later they just pop up like what the what that was a **** crazy little journey I went yeah uh so I would go honey badger cool I think awesome uh looks like yeah you're look you're looking at like Africa I think they were in Australia when they India Saudi Arabia yeah that's where they're they're getting that's distribution I I I bet it was shot in Africa probably Africa my guess so koala wins koala cross Beed crossbreed it wasn't AA with a wolverine maybe because I love Wolverines they're pretty gnarly out of all these I'd want to go over to Rob's house because he's got Miley Cyrus and Nick C so that's right Miley Cyrus he is oh but wait is the you all a wolverine because of the Michigan yeah well because yeah I I went to Michigan for about an hour and a half before decided to be in the moveing pitcher business um but uh yeah there are I don't think there really are any Wolverines unless they're way up north in in the upper peninsula Peninsula yeah but they're",
            "start": 645.52
        },
        {
            "text": "decided to be in the moving picture business. Um, but uh yeah there are I don't think there really are any Wolverines unless they're way up north in in the upper peninsula Peninsula yeah but they're they're intense Critters so you you would actually go with a you would try I would yeah I mean that they're badass Critters man I mean you name him Logan because you'd have to name him I would name him Bo Schembechler you don't remember see you guys Bo for Michigan fans I would name him Bo because Bo Schembechler was the coach of Michigan when they were really uh they don't well now we've got you got Jim Harbaugh dra back so we'll see if that helps but yeah Wolverines are gnarly ass Critters they're cool looking I would domesticate anything the question is like you know if you could domesticate I don't want to be like trying to calm down a wolverine yeah you ain't going get me no be calming down no Wolverine you had me to calm down no Wolverine you're saying it because you I think I think you",
            "start": 689.4
        },
        {
            "text": "I don't want to be like trying to calm down a wolverine. Yeah, you ain't going get me no be calming down no Wolverine. You had me to calm down no Wolverine. You're saying it because you I think I think you equate domesticating something with like enslaving it. You got to break it. No, you got to break it. It's like a horse. It's like a wild horse. Yeah, but I mean let's say we're not going to do that. Let's say we'll we'll do it like millions of years of evolution of domesticated canine, right? Where it's like it started off first you you saw that great episode of Cosmos where they talk about how wild wolves turned into throughout many many years of of sort of uh being around human beings they eventually got more more and more bold and got closer and closer and closer and then formed that Bond and then eventually thank God that you were domesticating Beast it worked out like this I was to say the original domesticated dogs were used by the were kept around by the humans to uh to ward off other bigger beasts",
            "start": 727.28
        },
        {
            "text": "thank God that you were domesticating Beast it worked out like this I was to say the original domesticated dogs were used by the were kept around by the humans to uh to ward off other bigger beasts whereas ptil was kept around by the humans so that when people come in he can pee on the ground he Wards off people who ring the buzzer too yeah he does he lets people know if pops up his little chest and his little tail starts flattering and he just barks and then he runs away it's really good if you had the koal it would be better because then you would deliberately pee on people that would scare them the koala could just Arc it out the window and hit you in the face when you're downstairs the koala isn't Cheetos it doesn't have these arang Cheetos I would have said Cheetos but let's be honest no one can own Cheetos no one can domestic ske Cheetos all you can do is listen and follow Cheetos Cheetos are are fake orangutang INE okay got it there's a debate for the I was really starting to",
            "start": 767.68
        },
        {
            "text": "no one can own Cheetos no one can domestic ske Cheetos all you can do is listen and follow Cheetos Cheetos are are fake orangutang INE okay got it there's a debate for the I was really starting to go man these dudes have been drinking the bong wild we've separated into two camps for the upcoming election there's the ticket of Mori Miller or Scarpino's Gettys they're the they're the party their whole platform is partying with the Zut Tang and Cheetos Colin and I want social forms we want taxes we want to just make sure that the the country has the appropriate amount of love that is say there is no appropriate amount of love the more love you can have the better and Cheetos embodies that okay Cheetos is a free spirit I don't know where the hell he is most of the time does he eat his own poop he eats whatever he wants to eat okay he pops up on Twitter every once in a while sometimes peeing into his own mouth not gonna judge well again don't knock it make your vote hurt at kindafunny.com",
            "start": 805.08
        },
        {
            "text": "poop he eats whatever he wants to eat okay he pops up on Twitter every once in a while sometimes peeing into his own mouth not gonna judge well again don't knock it make your vote hurt at kindafunny.com store one of shirts yeah a lot of **** goes out in the water tower that you don't want to know fun topic thanks Community thanks Community beautiful",
            "start": 850.32
        }
    ]
}