{
  "id": 398,
  "video_id": "65hgQ19DEGY",
  "show_name": "The GameOverGreggy Show",
  "hosts": ["Tim Gettys", "Portillo"],
  "title": "How Would You Use a Death Note? -  The GameOverGreggy Show Ep. 42 (Pt. 5)",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1411628402,
  "duration": 618,
  "transcript_chunks": [
    {
      "text": "[ Music] Tim , yes, what's your topic? So my topic for today, I forgot it for one second, but I just remembered it and that would have been weird. A good one. If you had a Death Note, what would you do with it? Now, I know seven people at this table might not know what that means. Thank you. So a Death Note, we you still, we still haven't watched each other's series. It's the anime thing you talked about that one time. It's now on Netflix, so you should watch one. Watch, yeah, yeah, it's on Netflix. So it's a notebook that if you write someone, there's rules to it. If you write someone's name down, they will die. If you just write their name, then uh, I forgot what it was in 30 seconds they die. Uh, I think it's in 30 seconds they die of a heart attack. It's like the default. So the default is heart attack or you can write the way of like how they, you can specifically say what happens. So gets hit by a car and then at, and you can put a specific time. So it",
      "start": 1.1
    },
    {
      "text": "like the default. So the default is heart attack or you can write the way of like how they, you can specifically say what happens. So gets hit by a car and then at, and you can put a specific time. So it could be like down the line, so you can control it as much as you want. Sure. But if you just write their name, they're going to die, but you need to know their name and face to be able to do this. Okay, so those are the rules. Having said that, if you had a Death Note, if it just fell in your lap, yep, would you use it? No. And how? No , I wouldn't use it. Criminals? No, that's not, this isn't how it works. I'm not going to be some like, I'm not some **** vigilante just killing people from my desk. I don't know what happened. There's, there's a system here. There is a system of trials, juries, judges. I don't agree with it. I've talked about it on the shows before. It should be all right, you've been found guilty, you got to, you get to appeal twice. You don't, you step to the side and they immediately shoot you in the",
      "start": 46.08
    },
    {
      "text": "it. I've talked about it on the shows before. It should be all right, you've been found guilty, you got to, you get to appeal twice. You don't, you step to the side and they immediately shoot you in the head and you are erased from the Jeep pool. I'm just saying this is how it should be. You had your shots. I'm sorry, we're not going to put you in there. You, you're dead. It's over and then we just move on as a society. Okay, okay, cool, that works. I would put the death, not the Death Note in a social security box and just be away from it. Just, yeah. Okay, so that, that is another thing. If you're not going to do anything with it, like how would you, like you can't destroy this thing. That's another thing. So what would you do with it? So Security Box, okay, and just be clear, you said that I can write, I write down and I can choose when they die. Yes, when that's how I'd go out. I'd, I'd write my own name down at 150. See, that's what I was about to say. Yeah, yeah, I'd write all of us down and say, think you can extend, but",
      "start": 89.16
    },
    {
      "text": "I can choose when they die. Yes, when that's how I'd go out. I'd, I'd write my own name down at 150. See, that's what I was about to say. Yeah, yeah, I'd write all of us down and say, think you can extend, but there's no way. But we writing down how, wait, sorry, yeah, that is a rule where you can't, um, if they die before then, they just die before then. Like they were predetermined to die. Like you do have a lifespan. Okay, cuz if it in that case, I'd be like 100, but I'd write very specifically still y aked, still looks like Hugh Jackman. So you have to eventually become that. Yeah, like becomes Hugh Jackman at 50, dies looking like Hugh Jackman at the age of 150 millionaire. B, that's there was also the uh, the aspect of the sh not even get into that. Okay, that's just, that's too much. Start watching that tonight. What would you do with it? Are you going to write down CRI? Well, that's my thing is it's, it's just like, you know, after thinking about it and especially after watching the show, I ain't using that thing, you know.",
      "start": 127.2
    },
    {
      "text": "you do with it? Are you going to write down CRI? Well, that's my thing is it's, it's just like, you know, after thinking about it and especially after watching the show, I ain't using that thing, you know. But the initial reaction would be like, okay, I know like if I could kill these people that are bad, doing bad things, why not? No one's going to know it's me, right? Until they find the Death Note, until they don't know ****, right? How I have a notebook, how are you going to know that I'm killing people with this damn notebook? It's true, true. All the names in the notebook written down, how they died. Yeah, but that could just be he's listing things you that afterward too. It's true. He's, he's a journalist. Yeah, so there's a lot of things like that. So early on in the show there the guy is like watching the news and seeing when like criminals are being reported on the news and he's trying to send a message to all the criminals out there. Yeah, so he kills like a whole bunch of them at once so the crime stops.",
      "start": 177.0
    },
    {
      "text": "and seeing when like criminals are being reported on the news and he's trying to send a message to all the criminals out there. Yeah, so he kills like a whole bunch of them at once so the crime stops. You know, I mean, like cuz people are scared that they're going to die of a heart attack cuz like some force is killing them all right, right, right, right. So off that idea like he decided he wanted to be Justice and he was going to do all this stuff. Do you guys like, do you think that you have the, I don't have it in me the will. I mean, what if some dud was like holding up a preschool? I don't know his face. I still think that there's like you have that information. I still caught a shot of him from the window or something. Okay, but I still feel like there's a way to end that without anyone dying like peacefully, right? I mean, my brain initially goes to like what about the situation uh that's happening with ISIS right now and maybe I could stop that somehow, but I don't know. I just feel like that's not I",
      "start": 215.48
    },
    {
      "text": "right? I mean, my brain initially goes to like what about the situation uh that's happening with ISIS right now and maybe I could stop that somehow, but I don't know. I just feel like that's not I feel like it's it's always a cycle like that that sort of thing like Crime and Punishment and Justice is a cycle that's supposed to never end. It's never going to end. There's never going to be peace. There's never going to be any rectifying that and if uh sitcoms or uh Breaking Bad has taught me anything it's that doing the bad thing a bad thing for the right reason is still a bad thing and it will eventually lead you uh to spoilers becoming a drug King. What sitcom taught you this? What episode of Full House did I miss where like I'll just kill this one guy and oh they always have the one they always have the episode of like growing pains were like you know the drug addiction orink like I just bought these drugs for my friend cuz he really wanted them and like I just wanted to be cool or something",
      "start": 255.52
    },
    {
      "text": "the episode of like growing pains were like you know the drug addiction orink like I just bought these drugs for my friend cuz he really wanted them and like I just wanted to be cool or something like that you're it's not cool it's not a good idea idea you're going to jail you're not get Harvard if you if you don't get out of it twice you get shot in the head oh my God I like your mental I like your your your concept I think it would solve a lot of problems it's very um it would scare people into not doing crime now my sociology friend PO he always says he's a doctor at sociology whatever that means and he always says that wouldn't work and Y I'm like well let's just try it let's roll the dice and do it for 5 years and see what these crime rates are like that can happen hey you going to steal that gum no I will get shot in the head as soon as I find we look at that tape I don't even get two retrials EXA it's just bam it's over damn Judge Dre I feel like I would boom but I feel like",
      "start": 297.76
    },
    {
      "text": "steal that gum no I will get shot in the head as soon as I find we look at that tape I don't even get two retrials EXA it's just bam it's over damn Judge Dre I feel like I would boom but I feel like there'd be situations that would push me to mhm like come someone's coming after you and I have the opportunity to stop that how about you get off your ass and stop writing your little book and go help how about that uh I mean there's a easier solution than see I got too much probably being Tim getting stab I the thing about this though is there's this like um Anonymous factor to it where people you could kill somebody without them knowing you did it yeah but I don't I've never wanted to kill somebody me neither yeah yeah I mean like so that's the whole thing I guess is like just the fact that I guess I have too much DC Comics in me some would say right like I don't want to kill these criminals I want to stop them for sure but I don't need like the power is it's too tempting it's too much",
      "start": 334.36
    },
    {
      "text": "I guess I have too much DC Comics in me some would say right like I don't want to kill these criminals I want to stop them for sure but I don't need like the power is it's too tempting it's too much power cuz it would be once you justify it once then it just becomes a slippery slope of well I can just keep I can keep icing people Death Note it's a great show watch it that's good I'm upset that Bobby beat me in Madden today and I just like you don't deserve to him we got is is the internet interesting enough no I was trying to remember a term that I can't my brain's dead sorry I apologize everyone what were we talking about we were talking about another episode of the GameOverGreggy Show being in the books thank you everybody for listening and or watching thank you for supporting us on patreon.com gameover grgy no SL Kinda Funny Kinda Funny God **** damn it somebody pointed out in the comments on the Kinda Funny announcing how long is going to be to they all screwed up be",
      "start": 378.72
    },
    {
      "text": "patreon.com gameover grgy no SL Kinda Funny Kinda Funny God **** damn it somebody pointed out in the comments on the Kinda Funny announcing how long is going to be to they all screwed up be train wreck this week and I like no it won't and I immed you said it earlier in this episode too at some point patreon.com Kinda Funny I think you said it wrong I'm pretty sure you said it wrong might have everybody go to kindafunny.com there are links to everything you need to get to to get to things to do stuff got our faces on it it probably has a billion if you find a spelling mistake tweet at me and let me know it's there we you can use that nice little handy uh email for me dud yeah also I don't know if you checked it a lot of people have written in to tell you how their day is there are a lot of emails like my day was pretty good today thanks for asking so thanks for put that than guys thanks for letting us know I like to I'd like to have you know hear how you guys are doing",
      "start": 427.36
    },
    {
      "text": "are a lot of emails like my day was pretty good today thanks for asking so thanks for put that than guys thanks for letting us know I like to I'd like to have you know hear how you guys are doing that's it's a good idea remember every week ladies and gentlemen four sometimes five best friends gather around this table feigning a random topic of conversation for your amusement every Friday we post the MP3 and now the video version one's on Vimeo one's on Bandcamp you can figure it out of course you can just go to patreon.com Kinda Funny you get one of the perks there you get all the stuff delivered to you never have to go to another site it's amazing uh if you don't want to give us any money because you don't think we're worth it don't worry we don't think we're worth it either that's why over on youtube.com/ Kinda Funny we break out every part of the show topic by topic day by day the Monday starting the Monday after everything posts on Friday and soon iTunes SoundCloud Stitcher is",
      "start": 465.32
    },
    {
      "text": "over on youtube.com/ Kinda Funny we break out every part of the show topic by topic day by day the Monday starting the Monday after everything posts on Friday and soon iTunes SoundCloud Stitcher is that gonna be next week all the it's not going to be next week okay that is it's a process figure out we goture stuff I am working on it right now there's approvals and stuff and it's just a time thing but it will happen it's going to happen would you like to apologize to everybody yes I'm sorry if you think that's acceptable you let us know if not Kevin will yell and insult at Tim again it doesn't even really matter cuz2 you get on the Patreon thing everything's there you can buy on pan another week you think it'll be two weeks I don't know it's on iTunes Apple oh we're waiting approvals from them we're a lot of just there's just approval processes all right Alfredo thank you for joining us thanks for having me this was fun man we got to have you back this is this was an experience I love",
      "start": 500.2
    },
    {
      "text": "them we're a lot of just there's just approval processes all right Alfredo thank you for joining us thanks for having me this was fun man we got to have you back this is this was an experience I love it you're like this is funny he's like this was an experience this is the difference between Alfredo and I look at my hair versus his right now mine's just been deflated and his is still perfect well that's because you threw yours on the other side you're just like I did I have my mar I had like a dead Marmet on my hair some girl once said it was like a com over like a bad com over and I was like it is kind of like a bad com over were you impressed with that no I was really kind of heartbroken she kind of emasculated me a little bit but what are you going to do we're now up to 915 patrons $110,000 10 I keep screwing this up $1,124 still that 32 thank you to whoever gave that no one has gotten a Kevin yells at Greg perk yet because no one understands what that means just yet I'm sure well",
      "start": 543.84
    },
    {
      "text": "10 I keep screwing this up $1,124 still that 32 thank you to whoever gave that no one has gotten a Kevin yells at Greg perk yet because no one understands what that means just yet I'm sure well we have we haven't actually told people yet know did I just say that did I just say that they didn't understand it it was just clarified not you better I'm going turn this camera off and beating your ass it's finally happening ladies and gentlemen thank you so much for watching another episode of the GameOverGreggy Show until next time it's been our pleasure to serve [Music] you I'm going to turn this camera off and beating your ass",
      "start": 578.04
    }
  ]
}
