{
  "id": 380,
  "video_id": "iwX5QaR461o",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Vasectomy - The GameOverGreggy Show Ep. 39 (Pt. 4)",
  "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1409727602,
  "duration": 968,
  "transcript_chunks": [
    {
      "text": "[ Music] my topic I want to talk about vasectomies and should I have one? Yes, chump move. No, **** chump. I'm not a chump. That's a good point. I'm taking notes like those chumps that tried to recall Scott Walker. They all had my mom's a huge fan of the GameOverGreggy Show. Sorry. So Greg, where does this come from? I don't want children. Mhm. And I'm like, I ran out of the other day, not in like, not in like, like, oh, I was, it was actually right after he got back from Scott and Sydney. Guys, guys, that is when I ran, not like a, no, this is me, this is me patting my pockets, but I'm sitting at a table. Oh, I'm out of condoms. What do I do? You're a 16-year-old boy, you got a condom in your wallet. No, exactly. Remember like, you remember the days in like college when you have to go like your roommate's room and like knock like, hey, got a condom? Like you have that weird thing of like, I guess that's weird . I guess wasn't the weirdest usually like had like a quiet high five, loud high five, and then he hands you this, he",
      "start": 1.1
    },
    {
      "text": "like, hey, got a condom? Like you have that weird thing of like, I guess that's weird. I guess wasn't the weirdest usually like had like a quiet high five, loud high five, and then he hands you this, he hands you the cellophane wrap from the kitchen. He's like, wrap it up. Yeah, yeah, enjoy. Here's a hefty bag. Uh, I'm over, I'm over. I don't want to use this condom anymore. I don't want to do it and I don't want kids. You know what I mean? That's the one thing like I've known forever. I don't want kids ever since The Family Man with Nicholas Cage. We've talked about this in the show before. Everyone remembers this seminal film, his life. Everyone remembers that. Where you know, you remember this Marty? Oh yeah, AB ta Leone, exactly. Thank you. So hot. I love Le the best thing. I love Mar La. Do you remember her terrible show on Fox for a while and she was like, oh, it doesn't matter. She's married to Davidy are seact. I know use condoms. Yeah, he doesn't use anything. Yeah, he's a raw dogger. No, so over the cond and then it's",
      "start": 50.64
    },
    {
      "text": "on Fox for a while and she was like, oh, it doesn't matter. She's married to Davidy are seact. I know use condoms. Yeah, he doesn't use anything. Yeah, he's a raw dogger. No, so over the cond and then it's just like, I don't want kids, right? So what am I waiting for? Well, I've already made that decision. I'm 31. Is that going to change anytime soon? No, you know, I mean, no, you're still going to be 31 until your next birthday. Shut the **** up. You know what I mean? Glee. I don't want the kids. So like it's not, what it's not, what am I waiting for? What's the deal? Why do I care? Remember when I got, when I caught the cancer and they're like, all right, now you should freeze your sperm. It might make you sterile. I was like, that's good. Like, what do you mean? I'm like, I don't want kids. He's like, well, you're too young to decide that. I'm like, I'm pretty sure. And he's like, and then he gave me the brochure for freezing your sperm and that shit's expensive. And I was like, remember that? I'm not going to do this. I'm not. And then",
      "start": 92.6
    },
    {
      "text": "that I'm like , I'm pretty sure. And he's like, and then he gave me the brochure for freezing your sperm and that shit's expensive. And I was like, remember that? I'm not going to do this. I'm not. And then I was kind of like hoping and then you were like, can you help me fill the bottle up? And I was like, no, I, I wouldn't. You just toss an ice cube train. That was the last conversation with Colin you ever recorded and the reason the show doesn't happen was just two of us anymore some for protection. So I don't know. I want to know one if I, what your thoughts on vasectomies are in general because it's, it's a weird thing. I don't like anybody fooling around down there with a knife. Put that out there right now. Yeah, that's doesn't sound fun. There's two things you don't like people fooling around down there with a knife anding my pH, your pH. How'you know? CU we're the same **** person just playing on your phone. Yeah, I don't like people playing on my phone. Oh, I don't like people playing on my phone, Dave.",
      "start": 132.64
    },
    {
      "text": "with a knife anding my pH, your pH. How'you know? CU we're the same **** person just playing on your phone. Yeah, I don't like people playing on my phone. Oh, I don't like people playing on my phone, Dave. Keeping it real goes wrong. I keep it real. It's also mentioned in a Tech N9ne song. Everybody should listen to Tech N9ne. Tech N9ne. Why don't you get him on the show? Why am I here? I'm working on Tech N9ne. Everybody tweeted Tech N9ne. Come oname. Yeah, Tech N9ne is not a chump. No, Tech N9ne is not a, not at all. Yeah, not at all. I'm, I'm, uh, I'm against vasect omies for me or in general, uh, for you. Mhm. I feel like, uh, the winds change every once in a while. Yeah, I know you're 31, you don't want a kid right now, but, uh, for VAs, it's sort of like a, a Dun bun can't be undone. I guess you could get a reverse. Yeah, but that that's not 100%. They say sure. Um, to me, like, I don't, I don't want a kid now and I absolutely don't want a kid now and I've been with my girlfriend for four years, give give or take nine months. Um, when you had the kid that",
      "start": 169.08
    },
    {
      "text": "say sure. Um, to me, like, I don't, I don't want a kid now and I absolutely don't want a kid now and I've been with my girlfriend for four years, give give or take nine months. Um, when you had the kid that was a weird, yeah, we we were broke up for nine months in the middle of it and that's always a weird span to explain to people like it just happened to me nine months. She said she had to take care of something that she was for month. Yeah, it was weird. Um, but yeah, I mean she has a ring and that's the best and I haven't used a condom in three years. Sorry, what did you just say? Never ring. I think she's maneuvering. She's maneuvering. She she really good at like moving somewhere she dodg and sper or it's wait no, it's not maneuvering, it's an IUD, an IUD. I she has an improvised explosive in her. Wait, what's why aren't you what's up? Wait , what's the that's the way I want to die. That's the way I want to die. An awesome way. How did Greg die? He was **** in Hidden improvised explosive device. Well, that was the guy",
      "start": 215.44
    },
    {
      "text": "you what's up? Wait, what's the that's the way I want to die. That's the way I want to die. An awesome way. How did Greg die? He was **** in Hidden improvised explosive device. Well, that was the guy with the watch. All right, good point. This all comes, okay, IED and IUD was what was in Ground Zeroes. That was the wrong right. You're confused video games with sex. Yeah, with sex. Yeah, an IED. Uh, yeah, no condoms. I I don't know my condoms. I don't knock in my random room. You got condoms. Yeah, yeah, see the thing was like Christine, first off, you're talking about your current girlfriend. I'm talking about independent of relationships in other relationships. I know I don't want a kid. Like it's not just something I've come to terms with with Christine, it's something I've known for a long time. Oh, gotcha. So that's ever. Yeah, you make a good dad. A lot of people say that. I think I'd make a good guy with a lot of money on his own in Independence. You would be a You'probably be a good I I could do stuff at Missouri. I",
      "start": 262.28
    },
    {
      "text": "ever. Yeah, you make a good dad. A lot of people say that. I think I'd make a good guy with a lot of money on his own in Independence. You would be a You'probably be a good I I could do stuff at Missouri. I could spend money for people and things. But what about just there's just a random chance that maybe things don't work out. You find a new, you know, you date someone else in the future and she wants to have kids and that's really important to her. Yeah, now you can't live in the future. Yeah, but I want I want you to see that I want you to have one just cuz I think it would be funny one and two. Wait, what part of it's funny that you're going to have a vasectomy? I want to Chronicle the whole thing and two, but I mean like are you going to make fun of me for like you fire and blanks over there Spiderman D the **** Ed. Uh, but uh two, I've only known one other person that's ever had a vasectomy. Tim the Tool Man Taylor had a vasectomy. I Believe In Home Improvement. Yeah, otherwise I've never met anyone",
      "start": 305.0
    },
    {
      "text": "D the **** Ed. Uh, but uh two, I've only known one other person that's ever had a vasectomy. Tim the Tool Man Taylor had a vasectomy. I Believe In Home Improvement. Yeah, otherwise I've never met anyone that had. But he's your hero. He is my hero. Yeah, also, but he already had three children. So that's like a different game. That's true. That's true. And was there forth by the end of that show? No, I don't think they just every other show the reboot there will be. Oh my God, Wilson. I would totally go for another Home Improvement. Is Wilson dead? I think so. I mean he died canotic in the show. The fence fell on him. That wasend that. See again though, it comes down to the fact that I think now if I if you know Christine dies in an plane explosion or something, she dies of a a sex device. Um, or maybe you just things change in the future. You just don't want to you don't want to. Oh, she's not getting out of this life. I don't want you to tie yourself up, but stick with me , literally stick. Okay, but I I understand that",
      "start": 343.44
    },
    {
      "text": "change in the future. You just don't want to you don't want to. Oh, she's not getting out of this life. I don't want you to tie yourself up, but stick with me, literally stick. Okay, but I I understand that but I'm I think first date kind of conversation from here on out of course being in our 30s now. Oh, what do you want to do with your future? I'm I don't want to have kids. I'm I'm very upfront about that . You know what I mean? But is that the first line? Yeah, no kids pretty much. Okay, she's like, hi, my name is you want you want a baby one day? You want a baby one day until she answers introduced myself and I how many fear of of something that is a part of you like would you adopt? No, I mean I just don't want a child. I do not want to have to worry about a kid every they're they take up a lot of your time. I would say that I'm too selfish for a child and I I don't know when that's going to change right? I don't feel like I'm a good dad to Patillo. I don't feel like I'm a good",
      "start": 389.36
    },
    {
      "text": "take up a lot of your time. I would say that I'm too selfish for a child and I I don't know when that's going to change right? I don't feel like I'm a good dad to Patillo. I don't feel like I'm a good boyfriend to Christine most of the time right? Like we all Colin terrible boyfriend to me. Yeah, well no you and I are pretty good actually. We're probably the best most healthy relationship out of all the relationships house. But that's the thing like you know I'm always going to want to sneak off and do this podcast or go stream a video game or just play a video game or go on a trip or do something you know what I mean? Like I don't want and maybe that I mean it's definitely going to change one day where I don't want to travel as much you know what I mean? But like right now it's like oh like you know uh Danny Shephard from the Nightwing Series right? He's like oh come to the premiere of Nightwing . I'm like yeah I'll totally do that. Now turns out it's on a Wednesday so no I'm not going to do that",
      "start": 429.8
    },
    {
      "text": "uh Danny Shephard from the Nightwing Series right? He's like oh come to the premiere of Nightwing. I'm like yeah I'll totally do that. Now turns out it's on a Wednesday so no I'm not going to do that. But like on a weekend right to go to Vegas to do something great and the only thing is where we going to put the Patillo you know where you going to put the little wiener dog and that's what I say he's just at times he's a little bit too much responsibility for me. It's like **** I'm going to go out tonight with so and so but I got to go home first and walk the dog or I got to ask Christine to walk the dog or on the the worst day possible I got to ask Colin to do it. I've only done it twice in our career. That's not true. I used to walk your dog all the time. You stopped you stopped doing it a couple years ago. Okay so in recent memory murder someone. Yeah, so that's the thing like got a kid on top of that like about that and all the **** you have to do Ian I'm not trying to Har on kids or",
      "start": 463.6
    },
    {
      "text": "couple years ago. Okay so in recent memory murder someone. Yeah, so that's the thing like got a kid on top of that like about that and all the **** you have to do Ian I'm not trying to Har on kids or whatever put the diaper on Port. It's like a movie The Bad late 80s you know romcom when Greg Miller needed to go to Vegas on short notice he turned to his best friend Colin Mor. We got to get to the other part of it. You're we're going to the Montage too early. But yeah, like I you know I don't nothing about a child sounds attractive. What if it's a hot child? But you know I don't want to raise them. I don't want to deal with it. Like when kids get to the part where they're cognizant and can't have a conversation with you it's like all right you're pretty cool. You know what I mean? Like when I I just went back to Missouri for a wedding right? One of the kids there now is old enough to sing the Missouri fight song and he he plays baseball and he does all this thing and he talks and know he's funny",
      "start": 492.8
    },
    {
      "text": "went back to Missouri for a wedding right? One of the kids there now is old enough to sing the Missouri fight song and he he plays baseball and he does all this thing and he talks and know he's funny and he blah blah he does it's great you know what I mean? But then the his little brother is still just little **** did you smoke a duo with them? Oh my God the first thing I did like you do a pull a jack yeah you ever get wet? Yeah no that was from Training Day that was Ang PCP Sherman hel sure sure sure yeah of course of course uh forever that's a great movie yeah incredible uh so here's the thing mhm um I I think I want to have kids in the future I don't want to have them right now uh I think my girlfriend's much more ready to do it than than I am I think a lot of that's biological for a lot of women um they feel like that there's like a literal time that they're you know ready to do it but I do find myself I used to kind of cringe around kids and I really I don't want to like really be",
      "start": 541.28
    },
    {
      "text": "of women um they feel like that there's like a literal time that they're you know ready to do it but I do find myself I used to kind of cringe around kids and I really I don't want to like really be around them but when I see like a dad or a mom walking with their little boy or their little girl whatever and like they're doing something funny I always kind of smirk and like laugh I feel about it differently supped like h **** hate kids now I'm just like oh that's funny that that little girl's funny thing like she's being funny you know and I'm like oh that's that's cute and I'm like what and then like I have like you know I'll be like I'm like maybe you know maybe that's just the way it goes and and I like I like the I've said before I like the idea of bringing a couple Mori Aris into this world you know and and just freaking Havoc with them see there's there's just that thing I'm joking about the little brother being a little **** right? He's just he cries obviously and he does all",
      "start": 581.2
    },
    {
      "text": "world you know and and just freaking Havoc with them see there's there's just that thing I'm joking about the little brother being a little **** right? He's just he cries obviously and he does all that stupid stuff you got to change his diapers you got to put him in a b do all this dumb stuff that I definitely never want to just raise him tough yeah but like there's that and then like um uh Arthur Parsons who's like in charge of the Lego video games right? He has a daughter named Lily who's I'm G to get that wrong Nish 10ish whatever she came to E 3 and she she was awesome awes she's at ComiCon she ran the ComiCon that's what I'm thinking of sorry not E3 Comic-Con yeah she played the demo for her dad's game and did all the stuff awesome she was fantastic you know what I mean? Like at that point you're like that's awesome I can I skip to just getting a 9 or 10-year-old that loves you that I CO's 9-year-old yeah yeah yeah exactly but even then I'm like all right I don't know if I want to",
      "start": 614.04
    },
    {
      "text": "you're like that's awesome I can I skip to just getting a 9 or 10-year-old that loves you that I CO's 9-year-old yeah yeah yeah exactly but even then I'm like all right I don't know if I want to take care of y'all time yeah cuz then you 13 to 16 good Lord now yeah I got to get a shotgun scare off all the boys yeah is that how works I like I I do want to be a father someday I don't want to be for quite a while but I think part of it is like I I have a lot invested in nostalgia in sort of like certain memories and and images of my childhood stuff like like Halloweens and Christmases and Summers and and sort of summer vacations like the the the time when I was like 5 through 15 and I would like to I feel like that's the instead of harping on **** like that like the the easiest way to sort of I either relive that or capture some of that same Essence in another way is to have a child eventually be able to do some of those same things and not like pigeon ho okay like you're going to be",
      "start": 653.16
    },
    {
      "text": "of I either relive that or capture some of that same Essence in another way is to have a child eventually be able to do some of those same things and not like pigeon ho okay like you're going to be the baseball player I could have been like I want you to enjoy Halloween like I did I want you to have rad Christmases that is the big thing of like I I like when I was walking uh in Missouri through the toy aisle like that I haven't been through in years right and you get to like the Fisher Price like set not like the baby toys but not like the action figures but there's this like mid-range tier of and they had this giant wall and it was like obscure DC Comics characters and I'm trying to convince the two little boys who are into sports to like this and they want nothing to do with it I'm like you don't understand like this is this is literally what I used to dream about that there would be a world like this I remember looking reading Superman comic books and when they get into a fight and",
      "start": 700.64
    },
    {
      "text": "you don't understand like this is this is literally what I used to dream about that there would be a world like this I remember looking reading Superman comic books and when they get into a fight and toy store and there'd be Superman toys on the wall i'be like if only to live in that universe and buy those you know what I mean? Here they you can buy a Brainiac and a Green Lantern are you kidding me? Like do this. Um yeah no I feel I feel I feel that though you know like I like we've said on on the show before many you know all my siblings I have three siblings all of them have kids they all say you know you don't you're never ready to have a kid you're just going to have the kid and then you're ready and then everything changes and you suddenly realize why you must have this kid and how you care about it or whatever the one thing about the toys though I always go to toy section when I'm in Target or something oh yeah I have to go and GI Jo's man were $3 when I was a kid three ****",
      "start": 739.88
    },
    {
      "text": "you care about it or whatever the one thing about the toys though I always go to toy section when I'm in Target or something oh yeah I have to go and GI Jo's man were $3 when I was a kid three **** dollars and now they are like 10 or 12 dude they like get the **** **** like are you kidding me? That's insane. It's I feel like it's harder and worse to be a kid now but there's more points of articulation there is I love points of articulation I know you do I really do I don't make no sense little video games are cheaper what'you say? I'm sorry I'm sorry I thought I thought you were done I just going to say I want a little girl that's the end of my point one day yeah there's going to be a little little girl you don't want a little boy little boy would be cool but like I think I'd do good with a little girl sure I was telling this to to you have a lot in common when you like what you like about movies yeah it's going to be great I I I tell this to my girlfriend like I I would I would",
      "start": 774.68
    },
    {
      "text": "with a little girl sure I was telling this to to you have a lot in common when you like what you like about movies yeah it's going to be great I I I tell this to my girlfriend like I I would I would rather have a girl than a boy too because I think little girls are funny like like I think like whenever I see like a little boy is usually being like like you know four five sixy old boy I we were all that was kind of like a dick you're loud you don't really care I think like I think girls are smarter and they grow up quicker and may become like little funny people in your family quicker you know what I mean? Yeah I got that yeah yeah you know what I mean? Like they just they're just more mature so like like I feel like uh a father daughter relationship is like really kind of special you know same way with a mother and a son that's the way I feel about my mom of course and even though I love my dad too uh you know I so I always I always kind of gravitate towards that like where it's like I",
      "start": 814.56
    },
    {
      "text": "way with a mother and a son that's the way I feel about my mom of course and even though I love my dad too uh you know I so I always I always kind of gravitate towards that like where it's like I just think it would be funny to have like like you know like watch this little girl grow up you know and it'll be quicker and easier I think but maybe that's not true I don't know maybe it's easier to raise a boy but i'I've heard that boys are much harder to ra my my sister Dana has three boys that are what are they seven five and two it's like oh man I'm sorry I think it's the learning curve thing cuz like with the with the boys I think it's a lot rougher in the beginning and like through until they're like 12 or 13 I feel like with girls it's the opposite where it's like it's easy and then all of a sudden it becomes impossible yeah and you're just kind of like you're like okay okay you beat me CHP weapons out oh man go on your CHP Purge see the concern about and this is be my sole concern",
      "start": 849.96
    },
    {
      "text": "of a sudden it becomes impossible yeah and you're just kind of like you're like okay okay you beat me CHP weapons out oh man go on your CHP Purge see the concern about and this is be my sole concern which I'm not really concerned about but is concerning would be the fact that if I don't have kids and everybody else has kids then it's like uh you know hey you want to go do this you want to go do that no I have a kid no what's going to happen to this show when you when you two have kids you're just visiting you can do whatever you want you're going to get a babysitter for the night you two though I don't know everything goes to hell be on the show they'll be on the show mhm I do we have we're going to have other significant others that can take care of the kids while we're doing this sure but they're going to guilt you on it they'll be waving the rolling pin oh man how great would that be oh my God game babies will you die they all have the same conversations I like it yeah I can't wait",
      "start": 893.08
    },
    {
      "text": "they're going to guilt you on it they'll be waving the rolling pin oh man how great would that be oh my God game babies will you die they all have the same conversations I like it yeah I can't wait for you to turn your little baby daughter on to all the Disney movies and then I just send the YouTube link to her of the princesses her dad wants to **** things happen man things happen man that's the one [Music]",
      "start": 932.52
    }
  ]
}
