{
    "id": 381,
    "video_id": "K433jX7nGTs",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Back To School Memories - The GameOverGreggy Show Ep. 39 (Pt. 3)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1409641202,
    "duration": 995,
    "transcript_chunks": [
        {
            "text": "Um , Tim, yes, what's your topic? You're not dead. I'm not dead. So this week, a lot of people are going back to school . Oh, yes. This holds a very special place in my heart cuz at one point I had to go back to school. I had a school to go back to and that was always a really big time in my life as I'm sure it is for many of you. There's a lot of thinking that went into it for me. It was all about the strategizing, which classes am I going to take to make my schedule easiest? What am I going to wear the first day of school? More importantly, what I'm going to wear the second day of school cuz all the chumps wear the new stuff on the first day. You're supposed to wear it on the second day. When I get in, where's the hot girl sitting so I can sit diagonally behind her cuz the chump sits behind her or next to her. You want to sit diagonally behind because then you can get the full scope of what's going on. Yeah, what is what is the diagonal offer you? You get this, you can see the front and the back. Oh,",
            "start": 1.1
        },
        {
            "text": "next to her . You want to sit diagonally behind because then you can get the full scope of what's going on. Yeah, what is what is the diagonal offer you? You get this, you can see the front and the back. Oh, you're just looking at her. You're not trying to like share pencil or talk. You're being creepy. You're also, but you're still you're in, you know, you feel the situation. She might be crazy. Diagonal diagonal space is never getting any like talking. You're not getting you're not getting, hey, do you have a mechanical pencil ? Like you how much lead I've borrowed the diagonally. Oh, I thought you got to put on like a terrorism watch list by saying that. But no, the diagonal look back is worth a thousand times more than the horizontal or vertical accidental. But if you get one of those, it's just like , okay, yeah, sure. In also in that's like in with her. Oh, there's a chance this happening. Okay. Um, e gotcha. No, where did you grew up with so many chumps? What's up? You grew up in a place with a lot of chumps? Grew up",
            "start": 43.2
        },
        {
            "text": "sure. In also in that's like in with her. Oh, there's a chance this happening. Okay. Um, e gotcha. No, where did you grew up with so many chumps? What's up? You grew up in a place with a lot of chumps grew up in San Francisco. One of my so one of my favorite stories that I might have you actually said on the show many times, one of my best friends, Alfredo Diaz, I met him via this whole predicament, the scheme where this I look over and I'm like, okay, cool, I see who's sitting to the left. I see who's sitting behind who's the the other diagonal. Oh, it's this guy. That's my competition. We're both doing this and we both looked at each other and I could tell he looked at me. He's like, that's my competition. And that is a true story and we competed and then I don't really know. He prob you started the chump Busters Club. Yeah, it's where you're busting chumps, busting chumps left and right. Busting chumps makes them feel good. What? Yeah , in a world where chumps are busted every little she does. Alfredo Diaz, Tim Gettys,",
            "start": 88.04
        },
        {
            "text": "Club. Yeah, it's where you're busting chumps, busting chumps left and right. Busting chumps makes them feel good. What? Yeah, in a world where chumps are busted every little she does is Magic song. It's the only song our production company can afford. So every montage for our trailer has to be put together. That's a that's a probably a really expensive song. So we probably could afford other songs. Is that the Police? Yeah, yeah. Well, we blew our wad on that. All right. That's where all the money went. That's where all the angel investment money introducing Greg Miller as Rosie O'Donnell chump number one. Yeah, so that I mean like see it's interesting none of those are my when I think of school at all really. Yeah, that was so important and I have two giant like I mean well so I have two things lately I've been thinking a lot about college and missing college but like thinking back to where you are like junior high grade",
            "start": 132.32
        },
        {
            "text": "important and I have two giant like I mean well so I have two things lately I've been thinking a lot about college and missing college but like thinking back to where you are like junior high grade school all that that's all one one school for me of course and I wore uniforms so when I think of going back to school I always remember that super depressing August day of having to go to Rumple shirt skins or whatever the hell it was called it was Rumple shirt skin I think is what it was called to get my uniforms these like stupid cardboard like powder blue shirts and then uh navy blue pants that you bought and they had such a distinct smell I remember these school uniforms you'd wear and everyone is in there buying the exact same thing because it's a racket you're all paying the money to Dennis Uniforms or whatever to get these goddamn yeah Dennis Uniforms I remember that yeah they all the Press little the pleats in them and whatever that's so funny dude I haven't thought about that in a",
            "start": 178.12
        },
        {
            "text": "Uniforms or whatever to get these goddamn yeah Dennis Uniforms I remember that yeah they all the Press little the pleats in them and whatever that's so funny dude I haven't thought about that in a long time I remember that sucked and then you go into school one day to uh find out what classes you were into and I when I say classes I mean like what room you were in it wasn't even like I don't I I forget anymore it's been so long how grades K through uh 8 worked but it was you went in and you figured out basically what home room I guess you're in but then you all just got shuffled around together at a different classroom that's exactly yeah that's so you go there exactly you go there and you see the list of who you're with that year if you're with your friends or whatever nobody there's two teachers for every grade to break it up into classes and then uh you'd buy all your books and stuff and I remember the big deal was always getting the assignment notebook for the year and getting the",
            "start": 219.72
        },
        {
            "text": "teachers for every grade to break it up into classes and then uh you'd buy all your books and stuff and I remember the big deal was always getting the assignment notebook for the year and getting the new pencil case that was always the dopest thing cuz the new pencil case was like INF possibilities you get the same petril pencil case it was blue with the white writing on it and then you know You'spend the next year writing things on it and doodling and doing all these different things to it Ghostbusters logos on it of course lot of Superman logos Superman logos Batman like that one s the Stussy thing oh the S thing was that sty was that what that was it was not Stussy no I think it was just an S it was just a weird you're talk s sort of diamond oh okay okay yeah see you reminded me of the of syllabi oh syllabus yeah yeah those **** that to me that is the most challenging thing about school you get that that's the real test how can you look what's the minimum amount of work I can do",
            "start": 256.52
        },
        {
            "text": "of syllabi oh syllabus yeah yeah those **** that to me that is the most challenging thing about school you get that that's the real test how can you look what's the minimum amount of work I can do to get an A that first day you get that paper you're just like okay I can miss three days see I mean like everything you're saying this many times is so foreign to me cuz that was College like and that was a serious deal cuz in I mean in 12 through or I'm sorry K through 12 you weren't missing days you weren't late to class you were once you're in the school you're in the school we didn't get any passes to go off campus to go to lunch or anything so you're from K to 12 yeah so for me K to 8 sure yeah but High School yeah my I mean I went to I went to St. Pete's for K through 8 and then I went 9 you know through 12 over at St. Francis and that's when like you know it's a little bit different but it's pretty much the same thing like that was the first time ever where oh I got a schedule and what",
            "start": 297.36
        },
        {
            "text": "know through 12 over at St. Francis and that's when like you know it's a little bit different but it's pretty much the same thing like that was the first time ever where oh I got a schedule and what I'm in this class during this period what class are you that it was the only time it was different otherwise it was always the same you're just whoever you're in with your home room and you're in the rest of the day whereas now you're bouncing around doing all these different things wow but there was never like I got I have a free period here I'm going to go leave you know like he study hall you and your friend would go play basketball like that was never any I just had lunch with him the other no way option for and just the quick as side of that I saw my friend Charles that he he and I were buddies he graduated a year ahead of me in 2001 so I guess that's your year right you graduated in 2001 and uh I graduated high school in 2002 but we went out to dinner and him and I for two years had",
            "start": 342.96
        },
        {
            "text": "he graduated a year ahead of me in 2001 so I guess that's your year right you graduated in 2001 and uh I graduated high school in 2002 but we went out to dinner and him and I for two years had study hall together and we would just leave school and like go play basketball or go like to Wendy's or whatever and uh we were talking and he's like I haven't seen you in 13 years wow and I was like what and he's like I haven't seen you since because he knows my dad's a firefighter he's like I haven't seen you since before 911 yeah and I'm like that's **** insane we're old we're very old people so I just wanted to throw that out there like falling back in the same Groove though was it like one of those but oh yeah know we snap back into it was it was great to see him uh but I just I was thinking about that and I was like holy **** we're **** old well see that's the using numbers like 13 years is like I well that's the thing jumping from now thinking of like you know when I'm buying",
            "start": 378.16
        },
        {
            "text": "about that and I was like holy **** we're **** old well see that's the using numbers like 1 3 years is like I well that's the thing jumping from now thinking of like you know when I'm buying folders and stuff at Walmart you know to get ready for whatever everything before College then to college now you know uh it's kids are back on campus at Mizzou and so like they did the whole thing of like there's this whole thing when you when you're incoming freshman you run through the columns for the the big event they do or what whatever and then when you graduate you walk through the other way like going out into the world or whatever and so symbolic exactly exactly thinking through all that I'm like oh man that's awesome blah blah and then like they're hashtagging it like class of'18 and it's like class of'18 are you **** kidding me I when they graduate I been gone for 13 years it's like holy **** are you like that's insane to think about that's just made up it feels so like",
            "start": 418.68
        },
        {
            "text": "and it's like class of'18 are you **** kidding me I when they graduate I been gone for 13 years it's like holy **** are you like that's insane to think about that's just made up it feels so like yesterday you know what I mean and you were making fun of me for watching Glee yesterday which is actually a movie called Pitch Perfect Happ amazing oh my God that is the the purest form of Glee is Pitch Perfect did you like pitch I love pitch I think it's incredible I kept telling Colin he'd actually like it it's a legitimate was getting mad at me because I kept making fun of she wasn't mad at she was like shut up well I think she's wanted to listen to the movie that's that's the worst Christine shut up shut up shut your mouth that was pretty good but I'm watching them and they're like having their like first like K or whatever the the Acappella I don't know whatever they're drinking red cups after initiation I was kind of explaining like oh that's kind of like when I you know we were",
            "start": 452.2
        },
        {
            "text": "their like first like K or whatever the the Acapp ella I don't know whatever they're drinking red cups after initiation I was kind of explaining like oh that's kind of like when I you know we were antlers and y y I'm like oh man like I kind of missed that I was like what I could never go back to that now like I'm this 31y old drinking with all these kid Noe that that's a experience in my life you can never have again you have you so you go you go back to Mizzou every once in a while for events for weddings have you ever wandered into a house party like a young house party so I have in the past year oh my God uh I graduated from UW Milwaukee in Wisconsin uh we went back and we were walking to a bar from a friend's house and we heard this house party going on and we were just sort of like my buddy's same age like he's I think he's uh 28 I'm 27 we're like **** it let's go in let's see what's going on that was the most surreal event ever do not do that everyone seems like children I felt",
            "start": 499.08
        },
        {
            "text": "buddy's same age like he's I think he's uh 28 I'm 27 we're like **** it let's go in let's see what's going on that was the most surreal event ever do not do that everyone seems like children I felt bad for everybody um it was it was sort of terrifying and I did I wanted to like cuddle them and I wanted to be like well no I did this but you shouldn't yeah course and here's why it's a different world man the story I always tell is that uh last year after I want to say the Mizzou bowl game I was drunk and coming home and they won or whatever and I'm tweeting about it and like all people on my feet who are Mizzou people are tweeting about it too including the antlers who you know the group the student group I was in or whatever and I'm talking to one of them through direct message or whatever and I'm like yeah man you know let me know anytime you're selling merch I want to make sure I get new new merch and bl he's like yeah anytime you're back come to tailgate come do this and I'm like",
            "start": 535.88
        },
        {
            "text": "and I'm like yeah man you know let me know anytime you're selling merch I want to make sure I get new new merch and bl he's like yeah anytime you're back come to tailgate come do this and I'm like yeah when's caps when's cap when's caps tournament this year when's antler Fest and caps tournament is the annual drinking event that's in Memorial to this antler who passed away years and years years years ago and it's this thing that's this huge event and bl I'm like yeah we'll come back and we'll play and like this is going back I'm like at Peteza at the bar I'm coming all the way back out here and like I'm here I'm brushing my teeth TW you know back and forth these DMs and I'm like yeah when's antler Fest which is like they're getting ready for antler Fest now right it's like the first huge house party of the Year everybody goes to it's this giant thing he's like this I'm like a and I I like slowly I'm sobering up while I'm brushing my teeth and I like spit and I walk out to Chrissy I'm",
            "start": 576.6
        },
        {
            "text": "house party of the Year everybody goes to it's this giant thing he's like this I'm like a and I I like slowly I'm sobering up while I'm brushing my teeth and I like spit and I walk out to Chrissy I'm like I'm stupid right she's like what do you mean I'm like I can't go back to Mizzou and party with the she's like no you can can you imagine one photo of that of like the internet Miller and I'm like holding an 18 you're up for a keg stand and like one of them goes to for alcohol poisoning and I'm like and then it dawned on me that like when we were in school Iowa State's coach was Larry usachi and this is don't worry the name doesn't matter he got in trouble for when they came to Mizzou for a road game he went out to a house party and photos of him like drunk with Bush Light and like all these like 18-year-old girls surface not scandalous said he was with girls Scandal said he's drinking with underage people and I'm like I would be Larry St like I I I almost didn't learn anything from",
            "start": 609.08
        },
        {
            "text": "like 18-year-old girls surface not scandalous said he was with girls Scandal said he's drinking with underage people and I'm like I would be Larry St like I I I almost didn't learn anything from watching a real adult go down in flames while I was there of like holy **** I can't do that you know what I mean like that was crazy to think about humbling yeah that being said you should go do it I'm gonna go do it yeah totally I I'm going to send I'll send somebody in before this a pillowcase get all the phones put them in there and then I'll come in do my Pope wave chug a beer do my Pope wave like just like John Paul II would do that **** oh John Paul would have been **** shotgun and beard be drinking **** what's going back school mean to you uh shotgun beers uh different time different things for different times I I it used to be terrifying when I was younger I **** hate like I I I did really well in school but I I just hated going um so I'd like try to crank through my G video games",
            "start": 650.48
        },
        {
            "text": "for different times I I it used to be terrifying when I was younger I **** hate like I I I did really well in school but I I just hated going um so I'd like try to crank through my G video games and being in complete denial for as long as possible I played a lot of hockey when I was a kid so I would be traveling a lot for that too by the time I got to college um well late in high school we would hang out with my friends we'just all get drunk and be like well we can't do this until the weekend now it's like okay uh and then in college I just never left after that first year I went home but after that I just stayed in Boston and so summer didn't really count then I don't really remember college that well because it was just a blur a **** show yep in a lot of ways and a **** show I I can't possibly replicate as a 29y old man like not not even for reasons that you're saying but for reasons that I just can't do that anymore I don't know how yeah like I just like don't know it wasn't",
            "start": 695.92
        },
        {
            "text": "possibly replicate as a 2 9y old man like not not even for reasons that you're saying but for reasons that I just can't do that anymore I don't know how yeah like I just like don't know it wasn't like any crazier than a lot of other people but it's just like how do you drink that much yeah well that was the thing like we you know this weekend we went out for Scott and Cindy's goodbye and it was like when we went to this awesome Brew Pub it was great I'm having a great time but yeah like four beers in Christine's like you want to go play Diablo I'm like yeah proba yeah I'm done you know what I mean like what am I going to do keep it's like 3 in the afternoon yeah I know right but then you went to sleep no you slept that day no I didn't you did you went to sleep damn coward if I respected you so much for playing Diablo if I would have no I did we did we played it with Adam boys there's a stream that exist yeah but you woke up later you got home and you went to bed well I don't think much",
            "start": 735.48
        },
        {
            "text": "so much for playing Diablo if I would have no I did we did we played it with Adam boys there's a stream that exist yeah but you woke up later you got home and you went to bed well I don't think much sleep was oh **** all right be shut up shut your mouth shut up I'm trying to watch Glee Marty yeah I mean to me like my K through 12 was sort of the normal you know I got I got less excited I wasn't like looking for chumps I don't know if just Madison Wisconsin have chumps heard there's a lot of chumps yeah got got trumps yeah Scott Walker that that a chump all the people I tried to recall him bunch of trumps he called m a chump they lost your mom lost the recall election how do you CH and only chumps lose um I was less about like the cloth game and like the situation game more about I was like about the marker game color pencil game I like my Trapper Keeper game I did love new supplies new school supplies a absolutely man getting to high school and getting like a five rank binder I'm a ****",
            "start": 770.72
        },
        {
            "text": "the marker game color pencil game I like my Trapper Keeper game I did love new supplies new school supplies a absolutely man getting to high school and getting like a five rank binder I'm a **** adult yeah the five subject notebooks **** this is all I need this notebook is going to be everything uh then by the end of the year it's just awful and I just have like Tic Tac Toe games and **** and like I threw a penis at some point PA always tells the story of like mid sophomore year of high school I was like I'm done doing homework and taking books home and I would just drop them I didn't I didn't even bring a backpack anymore I'm like I'm not doing this no I so that's to me college is the the either the decline or the incline if you will of it was me freshman year being so like I'm like I'm this film major I'm going to be pretentious I'm going to learn my craft and then I realized I was just the worst ever in sophomore year I was like well I'll still do that but I'll do some",
            "start": 829.44
        },
        {
            "text": "like I'm this film major I'm going to be pretentious I'm going to learn my craft and then I realized I was just the worst ever in sophomore year I was like well I'll still do that but I'll do some writing on the side and junior year I'm like well this is all the dumbest **** ever none of this is ever going to help me in the rest of life so I'm just going to enjoy it and by senior year I just never brought a backpack anywhere and I was just like well I'm done I'll yes I guess I'll be a creative writing and film major and just get me out the **** out of this state forever um forever forever and so that happened and then you sung Incorporated we're going to do it there's only a few shows that take place in Wisconsin we got to we got to identify those Laverne and Shirley not chumps no oh my God **** Laverne's no **** chump working class ladies trying to get by you know who is a chump Eric Foreman That'70s Show was a chump he's Ching oh yeah that takes place in Wisconsin yeah he was a chump",
            "start": 870.0
        },
        {
            "text": "Laverne's no **** chump working class ladies trying to get by you know who is a chump Eric Foreman That'70s Show was a chump he's Ching oh yeah that takes place in Wisconsin yeah he was a chump Red he ain't a chump yeah now Red oh my God we have a bronze statue the F in downtown Milwaukee right along the River Front the F the F is the best he's the best yeah he's I used to just love watching Happy Days and fans was like first of all fans was 15 years older than everyone in that show he looked like he was 35 years old he's the Nick Scarp ino of that show and he and he was just such a character man like that there's no no one like that you know just banging on the **** juke box meeting people in his office which was the men's room Greg yeah stop it I'm trying to watch Glee that was just an outo field segue until you said Glee I thought that was like a weird a weird happy happy reference don't you know the Happy Days the Happy Day show where where jumped where Richie and poy are trying to",
            "start": 913.84
        },
        {
            "text": "field segue until you said Glee I thought that was like a weird a weird Happy Happy reference don't you know the Happy Days the Happy Day show where where jumped where Richie and poy are trying to get get into seeing Glee you don't remember that episode [Music]",
            "start": 965.2
        }
    ]
}