{
  "id": 386,
  "video_id": "RB30bqr8Oks",
  "show_name": "Announcements",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Freddie Wong",
    "Harley Morenstein",
    "IJustine"
  ],
  "title": "Please Help Support Us on Patreon!",
  "description": "Support us here! http://www.patreon.com/kindafunny\n\nGameOverGreggy has evolved into Kinda Funny. Find out all the cool perks you can get by helping support us.\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1410764402,
  "duration": 102,
  "transcript_chunks": [
    {
      "text": "What's up, everybody? I'm Greg Miller. Over the past two years, we have grown the GameOverGreggy YouTube channel to be more than I ever imagined. But somewhere along the way, it's stopped feeling like a silly side project and started turning into a real thing. And that thing isn't just me , it's Colin, it's Nick, it's Tim, it's all you best friends out there. And I realized that the name GameOverGreggy doesn't accurately describe us, what we do, or more importantly, what we want to become. But what are we? You're Kinda Funny. I, I don't know, Kinda Funny. You're, you're kind of creepy. So ladies and gentlemen, we are now officially Kinda Funny. But what does this mean? New shows, higher production value, more ways to get the podcast. It's everything we love doing, but better. We got all kinds of stuff there from you perks ranging from getting the video version of the podcast early, getting your topic featured on the show, bringing back a conversation with Colin better than ever, making custom videos",
      "start": 0.0
    },
    {
      "text": "there from you perks ranging from getting the video version of the podcast early, getting your topic featured on the show, bringing back a conversation with Colin better than ever, making custom videos just for you, a one-on-one Google Hangout, or you actually being a guest on the show. Hell, I'll even make my mom's sauce for one of you. But we need your help to make better shows, we need more resources, and that's why we need you to head to patreon.com/kindafunny and support us. And just in case you're wondering, why are they changing everything? We're not. We're not taking anything away. In fact, you're only getting more. The GameOverGreggy show will still be free the week after it comes out, and we're even bringing it to iTunes, SoundCloud, Stitcher, wherever you get podcasts. All the content you love from us will still be here, but patrons are going to get exclusive Early Access to us and our content at patreon.com/kindafunny. With your support, we've built something special on GameOverGreggy and",
      "start": 41.04
    },
    {
      "text": "from us will still be here, but patrons are going to get exclusive Early Access to us and our content at patreon.com/kindafunny. With your support, we've built something special on GameOverGreggy and we're incredibly excited to take the next step forward with all of you is Kinda Funny. Yeah, hopefully we can live up to that name. Shouldn't be that hard. Until next time, we'll see you guys at kindafunny. com.",
      "start": 79.92
    }
  ]
}
