{
    "id": 395,
    "video_id": "ulyk3ZZNQNs",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Alfredo Diaz",
        "Portillo"
    ],
    "title": "The Secret to Talking to Women - The GameOverGreggy Show Ep. 42 (Pt. 2)",
    "description": "Support us here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1411369202,
    "duration": 1392,
    "transcript_chunks": [
        {
            "text": "Alfred o. Yeah . You're the guest. What's your topic? The guest dour . That sounds good. My topic is what's the secret to talking to girls? Confidence. Confidence. Damn. I would say good hair over anything else. Just good hair. I'm just joking. Your hair look I'm just going to walk up to a girl and just be like, \"Let's go.\" Uh, I would say I would agree with Greg. I'm going to Yeah. I mean, funny fun answer is hair. Real answer is confidence. Like fun answer is hair. I'm going crazy tonight. Hair. Tim, I just need you to think for the rest of the podcast on what our outfit's going to look like. Just plan it. I need either a super deep V to the point where you can actually see my belly button from up top or we need like hipster uh uh tank tops. Oh no. Oh yeah. Yeah. Hipster tanks like Party Rock. Sun's out, guns out. So, the whole thing, Alfredo, is confidence. You got to fake it so you make it. Like I say with everything else, you got to walk up to a girl, a man if you're a girl,",
            "start": 1.1
        },
        {
            "text": "Party Rock. Sun's out, guns out. So, the whole thing, Alfredo, is confidence. You got to fake it so you make it. Like I say with everything else, you got to walk up to a girl, a man if you're a girl, the opposite sex or even the same sex, whatever you want. Walk up to whatever you want to have sex with. That's what we're saying. And you walk up and you have confidence and you talk and you're clear and you say, \"Hey, what's up?\" You don't beat around the bush. You don't sit on the sidelines being some twerp. the you know you know I I'm in a committed relationship and I love my girlfriend very much. But my my success story was once me and Mike Mitchell were out at the at the bars when I was single and there were these two girls who walked and sat at the bar and we I was like hm Mike I'm going to buy those girls shots. We're going to have shots with them and Mike said I don't know and I'm like no we're going to do this. I brought the waiter over. I got shots for them. I got shots for us.",
            "start": 56.32
        },
        {
            "text": "to buy those girls shots. We're going to have shots with them and Mike said I don't know and I'm like no we're going to do this. I brought the waiter over. I got shots for them. I got shots for us. What's up everybody? Ah they screamed and maced me. They got they maced me and it burned. No but they turned around. They laughed and then turned back around and I was like, \"All right, Mike. It didn't work out. No big deal.\" Took the shot, did our shots, then they turned back around, came back like, \"Oh, you took your shot. Yeah, we saw you laugh like, \"Oh, no.\" And then they sat. We hung out the rest of the night. You just got to own it. It worked. Confidence. See , that's the thing that Tim and I didn't do when we were at a bar and Nick sent those two Asian chicks our way. What happened? Oh, this is how this is going to go. Is that Is that what you guys talked about before this? We're going to tell all the fun Nick Scarpino stories, the comic club. Before we even say this, this is so",
            "start": 91.2
        },
        {
            "text": "Oh, this is how this is going to go. Is that Is that what you guys talked about before this? We're going to tell all the fun Nick Scarpino stories, the comic club. Before we even say this, this is so funny. This is your topic because you are like from everybody that knows Alfredo from this show of him not even being on the show, every story you ever hear is just him getting girls. Yes, you're the only one. I want to know your secret. Stop. Here's how he does it. That's it. That's all he does. He does nothing. You walk into a place and you're all like spelt and you're looking good and you're a little hipster and you got the hair thing that like just goes to the right 3 0° angle to the left. Never to the right. Yeah. Tilt it. No, to the right. never to the left. I think I'm going left, which is that's what I'm doing wrong. I'm married. Uh and you just walk in and girls are like, \"Who is that? Why does he not have my number firm?\" He's pretty firm. You are firm. I've seen you a lot. There",
            "start": 127.52
        },
        {
            "text": "is that's what I'm doing wrong. I'm married. Uh and you just walk in and girls are like, \"Who is that? Why does he not have my number firm?\" He's pretty firm. You are firm. I've seen you a lot. There was there was that one time where I told you remember like I passed by this this girl's eye. I passed by and then I was like, \"Huh, I felt something. I sat down. I was like, I think that girl grabbed my butt.\" Yeah. It was at In-N-Out. That was the thing that happened. So, as you guys know, coffee shops and In-N-Out, they're like the Alfredo Kryptonite. Really ? At Inn Out, you have multiple In-N-Out stores. Oh, there's there is multiple In-N-Out, especially the one in Daily City. That's the one I'm kryptonite. But the thing, but the thing is the thing is happened there. Yeah. It's like Alfredo's hunting ground in Predator. But, but regardless, like I don't know how to I don't know. I don't know how. This is a disaster. This is great. I know. I love it. the best disaster. I mean, with all",
            "start": 167.84
        },
        {
            "text": "hunting ground in Predator. But, but regardless, like I don't know how to I don't know. I don't know how. This is a disaster. This is great. I know. I love it. the best disaster. I mean, with all that said, I don't know how to how to talk to a girl when you how do you get numbers and butt squeeze, you know, the butt squeeze doesn't count. How do you get girlfriends and how do you I've known Alfredo now for a lot of years, 12, 13, something like that. Yeah, something like that. And as long as I've known him, girls just like Nick says, kind of flock to him, but it's never that apparent. It just kind of happens. Somehow he'll get their number, not even tell me, nothing will go on. And then a week later, he's like, and he'll bring it up super casually, too. He's just like, \"Oh, yeah.\" I'm like, \"What are you doing today?\" He's like, \"Uh, I think I'm going to go hang out with that Janine chick.\" And I'm like, \"Who's Janine?\" And he's just like, \"Oh, that girl from In-N-Out last week.\" And",
            "start": 208.56
        },
        {
            "text": "\"What are you doing today?\" He's like, \"Uh, I think I'm going to go hang out with that Janine chick .\" And I'm like, \"Who's Janine?\" And he's just like, \"Oh, that girl from In-N-Out last week.\" And I'm like, \"What?\" He's like, \"Yeah, we've been hanging out.\" I'm like, \"What do you mean you've been hanging out?\" He's like, \"Cuz then Tim's a pure one.\" Yeah, Tim is the pure one. He's going to be judging. That's why you guys work so well. You're the ying and yang cuz you are filthy. Filthy human being. I've seen the videos. Oh, you haven't? Have you really? I have seen the videos. This is my favorite Alfredo Diaz story. It's the one I tell all the time. Wait, ask. Are we allowed to tell this story, Alfredo ? Well, keep keep let's protect names and sizes. Weird ass thing. So, we went to Alexis's house. This is totally serious the story. It was a housewarming. I got there early in the IGN kids. Let me preface. They live together. You guys This is before then, wasn't it? This is before. How",
            "start": 249.76
        },
        {
            "text": "house. This is totally serious the story. It was a housewarming. I got there early in the IGN kids. Let me preface. They live together. You guys This is before then, wasn't it? This is before. How about you just sit on the **** sidelines, old man, and let me tell the goddamn story. Huh? Yeah. Get a little bit shorter. My god. Are you going to tell me to go to bed and go to bed like you told Portillo to go to bed? Are you not Are you going to not listen? Like we need to film that one day. That should be another milestone. Watch Greg send out to bed and what a travesty that is. That's the worst the cutest thing on the planet. We go to this party. It's at the time the Alexis's roommates at the times. They're adult friends who are doctors and whatnot. So I'm like I got no one to talk to. It was supposed to be like a wine and cheese party too. one of these like we're trying to be trying to be one of these adult things and then all of a sudden like you know you Faulner all the all the",
            "start": 291.88
        },
        {
            "text": "It was supposed to be like a wine and cheese party too. one of these like we're trying to be trying to be one of these adult things and then all of a sudden like you know you Faulner all the all the young kids showed up. I ordered a giant pizza at this point. Amarie showed up. You showed up with a giant bottle of whiskey. The party got started. Everyone was finally having fun. Christine and I are there. We and Bib and a few beverages. So we're we're we're drunk at this point. Yeah. We're in a good place. We're not wasted. We're just we we're happy to be out outside away from our wiener dog. And so I start talking to Alfredo. Me and her do and blah blah blah blah. We're going through the fact that Alfredo is this ladies man. He gets he gets around. He does all these he does all these things. He sees all these people. Mhm. And finally it dawns and I'm like, \"Wait a second. I I I watch I watch the 60 Minutes. I know that texting and the texting and the pictures and the whatnot. This is",
            "start": 331.52
        },
        {
            "text": "He sees all these people. Mhm. And finally it dawns and I'm like, \"Wait a second. I I I watch I watch the 60 Minutes. I know that texting and the texting and the pictures and the whatnot. This is before the whole leaks are a big deal. I know that this is a thing. You you have photos. I guarantee it. Show you know who show me some of these photos of these people you're with or whatever.\" And Alfredo being the gentleman he is is like I don't want to show a photo unless I'm in it. I'm like that's no big deal. It's not it's whatever. I'm not worried about that. He's whatever. And he's going through he's trying to find something. And Christine's egging him on too of just like we're we're in this relationship. We only see each other naked. It's not it's no fun. This weird thing and and so we're like, you know, let me see how this younger half lives. Is this really a thing? He's like, it's really a thing. You know, so he starts going through his little vault here of photos to find out where",
            "start": 367.12
        },
        {
            "text": "like, you know, let me see how this younger half lives. Is this really a thing? He's like, it's really a thing. You know, so he starts going through his little vault here of photos to find out where is he find a good one. He's like, \"All right, I have a video.\" And he it's and he's like, \"It's fine cuz you can't see any faces or anything.\" I'm like, \"That's perfect. We're not trying to be weirdos or creepers . You're here. We just want to see the naked photos on your phone.\" And he says, \"Okay, we're not trying to be creepers of you naked.\" Well, then he and then he's like, \"Uh, okay, but you might see my dick in it. A little a little bit of my dick is how I described it.\" And I'm like, \"Oh, okay. No big deal.\" You might have undersold that. And so then he shows me this video and it is Alfredo. It was Alfredo having sex full on from behind there. He was pulling out. Don't pull that off your phone cuz someone's going to hack you like that and have an Alfredo sex day. And that was when I",
            "start": 407.68
        },
        {
            "text": "It was Alfredo having sex full on from behind there. He was pulling out. Don't pull that off your phone cuz someone's going to hack you like that and have an Alfredo sex day. And that was when I was like, you you lived up to all the even in my head when I was like, Alfredo's going to have some crazy something story just something to show me. And there it was. It was crazy. Please tell me it was it was straight out of American Psycho where he was looking. No, it wasn't. I mean, no, because that was the thing. It was this phone, which I won't touch, but it was just this angle. It was this angle of him having sex. It was It was first person. Please tell me the girl at least knew you were doing this. The POV version, of course. Yeah. Okay. So, you had her consent. Yes. I'm just I'm making sure there is rules. You must follow the rules. I'm just saying this like consensual sex tapes are the way to go. But now the epilogue to this story is that we watch an Alfredo sex tape, which I did not",
            "start": 442.72
        },
        {
            "text": "there is rules. You must follow the rules. I'm just saying this like consensual sex tapes are the way to go. But now the epilogue to this story is that we watch an Alfredo sex tape, which I did not expect to see. I barely know Alfredo still, but at the time even less than. Hey, they wanted it. You just kind of got to deliver at that point. Exactly. I mean, you have it. You got to deliver. So, I've seen Alfredo's dick now. We finished watching and we're like, \"Oh, yeah. That's your dick. here. Okay. Yeah. Thanks, man. We passed it back. And then we went just talking about video games or whatever, blah blah blah. Chrissy and I shared a cab home , didn't talk about it. Came in like brush your teeth, do everything, go to bed. Next morning, we wake up like, wait, do you remember we watched our first sex tape last night? We're like, oh yeah, we did. That was weird, right? That was a weird thing how nonchalantly he just showed us his sex tape. Yeah, but I'm grown up now. So, it's been a long",
            "start": 480.8
        },
        {
            "text": "first sex tape last night? We're like, oh yeah, we did. That was weird, right? That was a weird thing how nonchalantly he just showed us his sex tape. Yeah, but I'm grown up now. So, it's been a long 6 months. So, reevaluate sex tape. How many ballpark it for me? How many of those do you have? How many of those have you made in your life? You don't have to answer the question. There's nothing about being on the show that makes you have to answer you ranges. Never mind. We're not going to. Forget it. No, I want to know now. I want I'd say over 10. Okay, that's not as terrible as I thought it was going to be. Yeah, I thought you were going to be like 400. Is that a lot? We talked about this the other day. Yeah, we talked about this the other day with the fapping when we talked about that on the show. Just the fact that like for Nick and I it's like well this just wasn't a thing when we were dating when we were out there. You're getting mostly cuz when we were dating like smartphones had",
            "start": 520.0
        },
        {
            "text": "the show. Just the fact that like for Nick and I it's like well this just wasn't a thing when we were dating when we were out there. You're getting mostly cuz when we were dating like smartphones had just come out. Yeah, exactly. Yeah. Exactly. That's what I'm saying. Yeah. Yeah. Yeah. That this just wasn't the thing. Whereas like then you then Tim on the show was the young man in the crowd. He's like this is everybody has a sex. Everybody has Well, I keep trying to leak my nude photos out there, but it's just it's not taken. Yeah, TMZ is like, who is this guy? He's really big on Twitch. What? What? Or the entire one picture a day of TMZ until they post them. Cease and desist from TMZ. Yeah. I remember one time Tim was like, \"Hey, I got a paper cut.\" I was like, \"Where?\" Oh. And he I was like, \"Where ?\" And he was like, \"Oh, on my uh on my penis.\" And then he had a photo of it. Yeah. I told the story on the show before. I was dancing one time. Yeah. No, I took a picture of it. I I",
            "start": 565.16
        },
        {
            "text": "was like, \"Where?\" And he was like, \"Oh, on my uh on my penis.\" And then he had a photo of it. Yeah. I told the story on the show before. I was dancing one time. Yeah. No, I took a picture of it. I I guess I might not have brought that up, but I did take a picture and I showed a fair amount of people that picture people. What part of how much the paper cut was right across? Yeah. So, I mean, is it a is it a head on of your urethra or is it I was holding it up and you were cut by the looked like a little plus sign. Like a plus sign like you could take a screwdriver. Oh, don't even make me think of that. Jeez Louise. I remember the as as as Tim and I have gotten to know each other well over the years. One of the my best stories and actually Kevin was took part in this too . It was one of the first times I interacted with him uh was when I had to go to Florida for a wedding and I wanted to read start reading uh Invincible and you guys were cool and you kind of brought over this cool",
            "start": 602.4
        },
        {
            "text": "the first times I interacted with him uh was when I had to go to Florida for a wedding and I wanted to read start reading uh Invincible and you guys were cool and you kind of brought over this cool you're like hey I got iPad mini if you want to borrow it I'll load it with all the Invisible comics you guys you can go read it and it was awesome and then after that I started buying them cuz it's an amazing series that everyone should read. Kev's like hey did you happen to flip through the pictures on that iPad mini? And I was like, \"No, why would I do that?\" Hold on. You're missing You're missing a key part of this . Yeah. This iPad belonged to It belonged to one of our female friends. Yes. And uh And so I just assumed me and Kevin assumed that Nick would look through the pictures. See, my thing is, and here's how stupid and old I am. I don't even know that the iPad mini has pictures on it. I wouldn't cuz who I mean, only tourists take pictures with their iPad. Spikely when he meets the",
            "start": 647.12
        },
        {
            "text": "is, and here's how stupid and old I am. I don't even know that the iPad mini has pictures on it. I wouldn't cuz who I mean, only tourists take pictures with their iPad. Spikely when he meets the president, right? Is that a thing he did? Yeah. That's wild. It was a real iPad. It wasn't wild any. Stop saying that. Wild honey with Brook Burks. Um that she hasn't hosted anything on E in years. She was so wonderful when she was alive. Anyway, so I So Kevin's like, \"Hey.\" And Kevin and I had just met. We did a little gig together and I was like, \"I'm warming up to this fellow. He's a nice kid.\" I like how we like literally it was like only one week where we're like, \"Let's not talk about Kevin.\" And now he's so part of the show. We need to just get him one a mic over there just to talk into. Um, we give him a god mic. He's just like, \"Thanks, guys.\" Uh, and Kevin's like, \"You got to look for the pictures.\" And the first picture was black. I don't know why, but I guess that was just to have",
            "start": 687.76
        },
        {
            "text": "we give him a god mic. He's just like, \"Thanks, guys.\" Uh, and Kevin's like, \"You got to look for the pictures.\" And the first picture was black. I don't know why, but I guess that was just to have two more than one picture. So, so that way when I swiped over to the other picture, it was a picture of Tim wearing a tube sock and that is all. And that is not the only time I've seen Tim's body. You two are unabashed. We've never claimed to be the smartest kids out on the block. Literally, there was one time Tim text me a picture of himself and he's like he's like this and it's totally fine, but if you look closely behind him in the mirror, he's not wearing any pants. Yeah. So, you see my butt and the the caption was happy cuz it was a Monday. What? Like, would you do this? I would do this. No, but again, we're from a different generation. This is why talking to them is like you're interviewing someone from a different culture and why like me and Christine are just like, \"Oh, hey Alfredo,",
            "start": 729.92
        },
        {
            "text": "but again, we're from a different generation. This is why talking to them is like you're interviewing someone from a different culture and why like me and Christine are just like, \"Oh, hey Alfredo, do you have I remember we were like, \"Do you have nudes like of yourself of people?\" You're like, \" Yeah, of course I do.\" Yeah. Well, that's awesome. That's awesome. And here's the thing. I'm thinking, am I We just had the whole fapping conversation. I I talked about how this is the first time where like these things got leaked and I was like , \"No, that's wrong and I won't do anything with it.\" And you look back at Blake Lively and I was like, \"Oh, I want to see those.\" And now I've grown up and yada yada. Was I being super immature there or is that a different context than them being leaked? You know, I think this entire thing seriously is a very complicated subject where it's like it is all wrong completely. But then again, it's like it's all society stuff. So, it's like it's only wrong",
            "start": 777.44
        },
        {
            "text": "You know, I think this entire thing seriously is a very complicated subject where it's like it is all wrong completely. But then again, it's like it's all society stuff. So, it's like it's only wrong in certain societies. I mean, if everyone does it, is it wrong? I mean, that's that is the very philosophical question. Yeah. I mean if like like traditionally through the generations of course everyone that's old always thinks that the people that are coming up early that are younger than them are doing stuff wrong. Mhm. That's always how it's been is are leaked photos are like sexting each other. Is that the new rock and roll? Well again I mean there is a difference between leaked photos and this because the consent thing. Yeah. Here's my question then on your you've sent news I'm assuming. Yeah. You seen you sent your painting around. Yeah. Do you expect those? Do you call it Captain Falcon? Cuz I wish you a name for it. It's called Captain Falcon now. It speaks for itself. That's how",
            "start": 811.52
        },
        {
            "text": "Yeah. You seen you sent your painting around. Yeah. Do you expect those? Do you call it Captain Falcon? Cuz I wish you a name for it. It's called Captain Falcon now. It speaks for itself. That's how he gets girls. See, it orders for him at Starbucks. When you send them, do you expect other people other than the recipient to see them? See see them. Do I expect anyone else to see them? Yeah. No, cuz usually it's like someone you're dating at the time. Well, right. And and they just they don't want to show that to anyone else. Sure. Like they don't want to show that to their girlfriends because women are emotional like that. It's emotional like that. Like you mean they're emotional? I know. I read text from last night. People are women are sharing dickpicks. They are more than you don't care. Share, comment, subscribe, you know. You have to also understand that we are not him. We do not look like him. Naked. Yeah. Oh, yeah. I know. Uh if I did, I would probably be much more naked. I",
            "start": 851.28
        },
        {
            "text": "care. Share, comment, subscribe, you know. You have to also understand that we are not him. We do not look like him. Naked. Yeah. Oh, yeah. I know. Uh if I did, I would probably be much more naked. I mean, I'd be shirtless right now, but I would be a lot more uh uh willing to share pictures of myself in that form if I had a six-pack. I can't believe we didn't make Alfredo shirtless for the show. I'm upset about that. Oversell. We got the Patreon. $20,000. Alfred does the show naked. I don't even know if it's a thing of like being like we don't want to show our anything. It's just like why would anyone want to see any of this? I take off my shirt all the time. Like when you take your shirt off, it's a gag. It's a gag. It's a joke. It's funny. You're a beautiful man and I love you and I'll hug you . Uh but you don't take your shirt off and have what I call the Hemsworth effect like Alfredo does. See, I get naked for the comedy, too. You do, but you have a good body. That's a very No, you",
            "start": 893.36
        },
        {
            "text": "you. Uh but you don't take your shirt off and have what I call the Hemsworth effect like Alfredo does. See, I get naked for the comedy, too. You do, but you have a good body. That's a very No, you got a good body. I like your body. I mean, you're not a freaking mixed ethnicity god like this guy is over here. Like, you're not like AC Slater from Save by the Bell. But, you know, he's he's pumping it out. This is It's an interesting time. All of this. Has this helped anybody talk to girls? I'll tell you the one. That's how Alfredo talks to girls, though. I will say he's the master of the text. That's what it is. It's like if he gets the number, it's a done deal. It's just constant conversations, listening, you know, and it's not it's not like my goal is to sleep with every woman in the world. That's a good goal. But I mean, it's the kind of thing just I just I don't know like I hit a point in high school where just I was talking to a lot of girls and I was getting a lot of attention and",
            "start": 938.16
        },
        {
            "text": "That's a good goal. But I mean, it's the kind of thing just I just I don't know like I hit a point in high school where just I was talking to a lot of girls and I was getting a lot of attention and it was I didn't know what how to handle it. I didn't know how to was like, \"Oh, this girl likes me. She's cute. This girl likes she's cute. Like, what do I do?\" And then, you know, now I was stared in the right direction. It's good. You matured a little bit now. Oh, you're just better about it. Yeah, just totally better about it. Sticking to one girl and just So, here's my question. You You just said that you would you you don't expect anyone to share the photos to one girl. You know what he means. I know exactly what he means. You're saying you don't expect your nudes to get show showed to anybody. I mean, no. But then you show you showed Well, is that a special? you went out of your way to make sure nobody's faces were shown, I guess, in these nudes. Is that the difference there? That's I",
            "start": 982.08
        },
        {
            "text": "I mean, no. But then you show you showed Well, is that a special? you went out of your way to make sure nobody's faces were shown, I guess, in these n udes. Is that the difference there? That's I think that that is a definite um like unwritten rule is the face thing where it's you don't show faces to people and like if you specifically tell I'm not going to show anybody this, you shouldn't show anybody, but you definitely don't show faces. There was that one video with the splurge on the face. See, I'm interviewing him like he I feel like this is like I feel like I was You literally got in like your interview stance. Well, I'm I'm fascinated by like he's like Tim doesn't have anything cuz he's the pure one, but this guy knows what's happening with the kids. I've done I've done enough for Tim and I combined. Yeah, combined. See, this is what I was talking about. You know, we had a topic on the show once like who would you bring back and show stuff to. I was like I wanted to bring",
            "start": 1024.24
        },
        {
            "text": "for Tim and I combined. Yeah, combined. See, this is what I was talking about. You know, we had a topic on the show once like who would you bring back and show stuff to. I was like I wanted to bring Benjamin Franklin up and I feel like that I'm Benjamin Franklin in this and you're the future man and I'm I want to know what the rules are. How does this go? It's the rules have changed. Those things are just not as like you just make make feel comfortable. Yeah. You know, it's not like my goal is to like take it and go like check this out. Like no, it just happens. It's part it's part of the dating ritual now is what you're saying. According ritual. I mean to be extremely fair cuz I think we might be painting this in a little too light of a light. But in my entire time of knowing Alfredo, like it's not like he I've seen millions of pictures from him. You know what I mean? It's just like about as many as you have. Right. So, you've seen no photos, just a dick having sex. Alfredo. This",
            "start": 1067.52
        },
        {
            "text": "like it's not like he I've seen millions of pictures from him. You know what I mean? It's just like about as many as you have. Right. So, you've seen no photos, just a dick having sex. Alfredo. This wasn't even a video of a girl. This was his penis. A video of his penis doing. It's like a real a demo reel. Jeez. Pretty much tape. So, my thing is this. As far as I mean, going back to normal guys that that don't look like Greek Adonis, freaking Greek Brad. Uh, Greek Brad Pitt. I like that. Confidence is a big seller for me. What I used to do, and I think we've talked about this a little bit, but I I love talking to people, even if it's failing at doing that. And I think that in order to have confidence, what I used to do when we'd go to bars is I would pick the best looking person I could possibly find, try to strike up a conversation with her, fail miserably, then go about my night, and try to talk to every single girl I could that I thought was cute, fail maybe two to three times, but",
            "start": 1104.0
        },
        {
            "text": "find, try to strike up a conversation with her, fail miserably, then go about my night, and try to talk to every single girl I could that I thought was cute, fail maybe two to three times, but on the fourth time, someone would be interested. And it's because generally I would have gotten all the nervous stupid energy out where I'd say something dumb or be a little too desperate or just not be in that flow of also there's also a lot of things that your brain has to do in order to have and hold a conversation right you have to kind of get through that I don't know if you got to shake off the rust a little bit every time every night going out with a big group of friends is also a huge huge huge uh benefit because you have people that you can talk to right you can always if some girl is not talking to you got a wing man he comes up he starts and then you can get out have a conversation without feeling like an idiot. And that's why your wingman is a very very important thing, too. If you",
            "start": 1150.96
        },
        {
            "text": "talking to you got a wing man he comes up he starts and then you can get out have a conversation without feeling like an idiot. And that's why your wingman is a very very important thing, too. If you have an excellent wingman, you can go far in life. Yeah, it's very true. But yeah, I had a I was actually I told I told you guys this I was actually at a club in the Castro uh with some friends and they were like, \"We want to go to the Castro. Want to go to gay club?\" And I'm like, \"Let's go.\" And a guy hit on me and I was like, \"I'm sorry , you know, I'm I have a girlfriend and not I'm not gay, but nothing wrong with that.\" And he goes, \"No, no problem. If you're not getting if you're not,\" I believe he said, \"If you're not getting shot down five times a night, you're not trying hard enough.\" And I was like, \"Fuck.\" And Nick was like, \"I've I've rethought it. I don't have a girlfriend.\" No, literally. Like, it's it's crazy to think, but that small shift in my mentality went from, \"Hey,",
            "start": 1189.6
        },
        {
            "text": "And I was like, \"Fuck.\" And Nick was like, \"I've I've rethought it. I don't have a girlfriend.\" No, literally. Like, it's it's crazy to think, but that small shift in my mentality went from, \"Hey, there's so much writing on this conversation with this one girl to eh, I mean, I'll just talk to everyone. And if this doesn't work, then there's probably going to be like odds are there's going to be another cute girl that comes in at some point with a bunch of her friends. We'll buy them shots and hang out with them and talk to them or whatever. And by the end of it, literally from that point on, by the end of every night, I would have a connection with someone. It wasn't like a it didn't have to be like sex or or making out or anything, but at least met someone who I was like, \"That was cool. Good night.\" Like, and then one of our friends would probably hook up and he was usually like the person you'd least expect or Yeah. So, that's like this confidence. I totally agree. But at the same",
            "start": 1221.2
        },
        {
            "text": "\" Good night.\" Like, and then one of our friends would probably hook up and he was usually like the person you'd least expect or Yeah. So, that's like this confidence. I totally agree. But at the same time, I feel like I'm pretty confident. You've got more and more You've gotten way better at talking to girls though over the last few years. I I don't think I have. I think I'm just as good as I used to be, which is I think they just kind of walk up to him and put condoms in his I was going to say that's the thing. Yeah. What are you talking about? Like it's I don't know. It's weird. I'm not good at the whole me I'm Alfredo vibes where girls are coming up and talking to you. It's a newer thing. I've seen it . It is. It's cuz you you know you have to look now. Your hair's going to the right the right way where it's supposed to. 30°. It's perfect. It is the hair. You were right. It is the hair. I'm telling you, I'm putting it out there. No. So, whenever we see Nick come in one day and his",
            "start": 1261.92
        },
        {
            "text": "right way where it's supposed to. 30°. It's perfect. It is the hair. You were right. It is the hair. I'm telling you, I'm putting it out there. No. So, whenever we see Nick come in one day and his hair's off to the side, we're like, \"What? What's wrong at home?\" No. Okay, good. He went back the right way. Oh my god. Nick has so much like his hair is so big. Wow. Damn, son. Have this like weird hipster cut. Like your hair has to be really long. I don't know. I don't know how long your hair is, but my hair has to be super long. Well, I'm also very receding. So, you can see that pair like this is going to be back here soon. So, you got to keep it going. Keep it going. Thanks for listening to the audio version of the podcast. My god. Why is it still hot? This is really fun and we're only 56 minutes into it. Oh, you get me some, too? You want? Yeah, sure. Anyone need anything? Any want a piece of pizza? No, we're fine. Fill me with the water. Uh, do you want us to move on? Yeah, go for",
            "start": 1299.12
        },
        {
            "text": "minutes into it. Oh, you get me some, too ? You want? Yeah, sure. Anyone need anything? Any want a piece of pizza? No, we're fine. Fill me with the water. Uh, do you want us to move on? Yeah, go for it. All right. You all set? That was a good topic kind of. I mean, it's all No, it's not. It's all good in the hood. Painting me in like the worst picture right now. No, no, no. Alfredo is a great dude and he has gotten a lot better. Not that he was bad. People learn, people do things. You're young. How old are you? What are we? 25. We're 25. Okay. Yeah, we're 25. I had to look at I'm like, how old are we? Years has just been rolling. Mhm. You know, things just don't stop. Like Limp Biscuit songs. I was thinking about that. Rolling, rolling, rolling, rolling. What? Rolling, rolling, rolling, rolling. What? Yeah. [Music]",
            "start": 1341.68
        }
    ]
}