{
    "id": 871,
    "video_id": "0-QBLqFpAgw",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Fixing Bad Movies and Coca Cola - The GameOverGreggy Show Ep. 76",
    "description": "Tim Gettys has a love affair with Coca Cola, Tim Gettys' love affair with Coca Cola continues, Colin Moriarty wants to know if we will be voting, and Greg Miller asks us how we would change bad movies to make them good. (Released 05.15.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1432278000,
    "duration": 7542,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to the Game Over Greggy Show. I am one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. He's gone invisible. Now it's Kinda Funny live week, ladies and gentlemen. I guess just gentlemen over here. Yeah. Pride of Long Island, Colin Moriarty. Good to be here. Thank you. Good to be here with you. I've missed you. Don't rub me with your hands. I don't like it. It's one of the things that you say that no touching. You mean it. You don't like being touched. No, Cheryl gets me all the time. I was making her laugh yesterday because she was, you know, she ended up getting a place closer to work. So she's only going to be here usually on weekends now because her commute is like insane. So she was like, you know, can you lay with me or whatever? You know, can you lay with me? Like because I usually say she goes, she goes to bed really early and I go to bed late, but I'm trying to hang out with her a little bit more because you know",
            "start": 30.0
        },
        {
            "text": "You know, can you lay with me? Like because I usually say she goes, she goes to bed really early and I go to bed late, but I'm trying to hang out with her a little bit more because you know, she's not going to be around. Sure. Quality time. And then she was like, so I laid down with her and I started reading. She's like, can you come up with, she wanted to do position two and no position. She wanted to do position one actually. And uh, I was a little, and uh, I was, uh, I was like, oh, I agreed to lay with you, but I didn't agree to be touched. Ah, she got a little mad. That's a long winded story and really not worth telling Greg, but no, it was good. But nonetheless, I'm glad you told everybody over here at the pier with Tim Gettys. I don't like being touched either. It's a big thing in my life. How do you guys not like being touched? I think it's because I grew up with Kevin and this motherfucker likes to touch way too much and it's really uncomfortable and he gets really close.",
            "start": 78.56
        },
        {
            "text": "in my life. How do you guys not like being touched? I think it's because I grew up with Greg and this motherfucker likes to touch way too much and it's really uncomfortable and he gets really close. That's what they described him. Disgusting. Greg is disgusting. It is. It is kind of scarred me and I feel like it's, it's came with me and followed me through my life and uh, and yeah, it's the same way. POTUS doesn't like being touched. You're all weird. Yeah. It's why you like being touched. Yeah. Like what does that mean? I mean like if, if Christine rubbed my arm and I don't like when Nick touched me cause Nick's got hands like sandpaper. Yeah. He's getting, he's never moisturized. He's a man. He's a manly ass man. There's a certain amount of Lubiderm in this house. So it's, it's shocking to me that, that he doesn't use Lubiderm more because it's almost everywhere you look if you just look hard enough. And it's funny too, cause like Christine's had me on this regimen for the face",
            "start": 115.72
        },
        {
            "text": "to me that, that he doesn't use Lubiderm more because it's almost everywhere you look if you just look hard enough. And it's funny too, cause like Christine's had me on this regimen for the face lotions, the hand lotions, the lotions in general cause I never used this crap before. I used to complain that my hands hurt. She's like, well, it's cause they're dry. You idiot. And so then like I thought it was just like her as a good natured human soul that she wanted people to be better. And so when I noticed Nick's hands were so bad, I told her at night one night, I'm like, Hey, you got to come up with a moisture plan for Nick. And she goes, why would I do that? I was like, Oh, I thought you just like helping people. I didn't realize it was just because you love me. I thought you just enjoyed giving people skincare tips and things. So last week, my girlfriend went to Disneyland to do this, this marathon and uh, which is ridiculous. Now there's a couple of things about this I don't like.\n\nNote: I corrected the spelling error in \"Luberderm\" to \"Lubiderm\", assuming it was a phonetic mistake for the brand name \"CeraVe or Lubiderm\" (a moisturizing cream), but since CeraVe is not mentioned anywhere else, I left it as is.",
            "start": 150.56
        },
        {
            "text": "giving people skincare tips and things. So last week, my girlfriend went to Disneyland to do this, this marathon and uh, which is ridiculous. Now there's a couple of things about this I don't like. One, she paid to go run. That's ridiculous to me. That makes zero sense. Two, she went to Disneyland without me. Did she go on rides and stuff too? Or she just went? Oh, she went, yeah, she did it all. Was this plan before she met you? Was this plan before she met you? It was, it was planned. Okay. Well that's excusable. Yeah, exactly. The other thing is I was, I was invited, but the problem was I was planning Kinda Funny Live. We were doing all these things, working really hard and all this stuff. But then, so I didn't see her for like a couple of days. Then I do see her and I'm tired as hell because I've been editing all these videos and staying up to like four 30 every night. And then we're trying to go to sleep and I'm trying to go to sleep. You know what I mean? You want to go",
            "start": 184.6
        },
        {
            "text": "as hell because I've been editing all these videos and staying up to like four thirty every night. And then we're trying to go to sleep and I'm trying to go to sleep. You know what I mean? You want to go to bed, not get frisky. Well, it's not even about that. I'm just trying to go to sleep. And she is just like a damn magnet. Just like following me around the bed, just like latching on. I'm just like, I don't want to be touched right now. Like I didn't say it because I'm like, Colin, I don't express my feelings. The relationship's too young. Yes. You haven't been dating her for a long time. Yeah. So I'm just like high school sweethearts and together since elementary school, high school sweethearts that have been together since elementary school. But yeah, so no, that was my life. And uh, I haven't slept for probably a month because I'm Kinda Funny live and this incident. So to bring everybody up to speed, if you didn't know, Kinda Funny Live is Saturday. So if you're a Patreon",
            "start": 222.04
        },
        {
            "text": "I haven't slept for probably a month because I'm Kinda Funny Live and this incident. So to bring everybody up to speed, if you didn't know, Kinda Funny Live is Saturday. So if you're a Patreon subscriber who did not come to Kinda Funny Live, you're hearing this hopefully on Friday, if everything works out and you're enjoying yourself Saturday, we go crazy. We go hog wild with Kinda Funny Live, a million things planned. Then Kinda Funny Live will be in the aftermath when this starts posting on YouTube. So right now this is being recorded on Wednesday. The first two days of the week I was gone in LA playing Metal Gear. You guys have been working nonstop. Can you say that yet? Yeah, I can say that's confirmed on Twitter already. I can give you no impressions till June 9th. Cool. This is my first rodeo. I know. I know. So I come back today. We have to do two shows, a Patreon Q and A, then Colin's cooking sauce as we speak right now for Justin, the fan who on Patreon sponsored us at",
            "start": 259.32
        },
        {
            "text": "my first rodeo. I know. I know. So I come back today. We have to do two shows, a Patreon Q and A, then Colin's cooking sauce as we speak right now for Justin, the fan who on Patreon sponsored us at the get sauce level. So he's here for Kinda Funny live. And that level doesn't exist anymore. No, that's removed. So that's a one. This is like a once in a lifetime thing. It's a rare Pokémon. So we have those four giant things happening. On top of that, we heard your cries. Love you so much. We heard this insanely complicated soundboard that you guys decided to set up today. Yeah. As if there wouldn't be a time crunch. Yeah. Things happen. It's how we do it. It's always the thing that the beauty about the four of us is that at all times where we all have our own agendas and we all have our own idea of what should be done at that moment. Right. And we all do them at the same time. Yeah. I think it upsets when everyone else isn't on the same page. I don't think we get upset. You get",
            "start": 293.56
        },
        {
            "text": "our own idea of what should be done at that moment. Right. And we all do them at the same time. Yeah. I think it upsets when everyone else isn't on the same page. I don't think we get upset. You get stressed out and then something happens. Yeah. It's less upsetting each other, but it's more stressful. Sure. Yeah. That's 100 percent true. That's 100 percent true. So now the concern is how do we get the games cast fit in today? Because if we don't, then we've got to do it tomorrow. Colin and I alone, which is a great one. But if we don't do that, then there's not going to be a table or a camera or anything else to film with. Kevin's given us a timeout. What do you want, coach? All right. We got to put a pause. Put in a pause, everybody. Hey, Nick's here. Hey. So yeah, we were bringing everybody up to speed about the timeline and how crazy it's been. Yeah, it's been a little nuts. Instead of that, it's even getting like we have to get all the stuff done today. Right. Like really early",
            "start": 335.64
        },
        {
            "text": "up to speed about the timeline and how crazy it's been. Yeah, it's been a little nuts. Instead of that, it's even getting like we have to get all the stuff done today. Right. Like really early tomorrow. Right. So that you can take everything out tomorrow. Yes. And then put it up at the Kinda Funny Live set. Correct. A lot of things going on. That's the funny thing about us is that we we decide to do all these crazy things we've never done, like the Kinda Funny Live and like all this stuff. But then we also need to do our normal job of like doing the shows and posting all that stuff. It's like it's so weird. We just keep touching the stove is the problem. We know it's hot. We just keep touching it like a munchkin. It's not even touching. Like, there's a new rule. No touching. But no touching. We're just like diving on that rule. You and I consulted. You weren't here to help. You're not allowed. Oh, your hands actually feel softer today. Yeah, I know. You started. You started. Yes.",
            "start": 370.64
        },
        {
            "text": "We're just like diving on that rule. You and I consulted. You weren't here to help. You're not allowed. Oh, your hands actually feel softer today. Yeah, I know. You started. You started. Yes. You told me you gave me a complex about it. So I started using like this like Nivea shea butter. Yeah. Like did you see stuff? My wife hates it, too. Just FYI. She hates you. You're oh, you're scary. Yeah. She doesn't like, you know, lizard man. I immediately, of course, whenever I go to touch my wife, try to touch her and like smooth this parts like the lower, like the lower back of the arms or like, yeah, I'm a very touchy kind of guy. Yeah, you and I both, brother. And so the second this hits her, like her neck, you know, because I'll try to give her the next carpe diem look like what's up? How you doing? She's like, don't it doesn't matter. The next carpe diem look doesn't involve a wink. I don't believe that. There you go. Well, you can't see on the other side. Yeah. Anyway, she's been giving me",
            "start": 405.44
        },
        {
            "text": "She's like, don't it doesn't matter. The next carpe diem doesn't involve a wink. I don't believe that. There you go. Well, you can't see on the other side. Yeah. Anyway, she's been giving me a lot of shit about that. So she's leaving me subtle hints like, hey, with like post-it marks, use this right now. Subtle, very subtle. And post-it marks everywhere. Your hands feel like rock. You can't break steel, Greg. You can't break steel. Rocks aren't steel. And your hands aren't either. You can't break rock, Greg. You can't break rock. They're more inclined to get infected, I bet, because the skin's all cracked and stuff. You can get stuff in there. Well, I'm not doing anything like that anymore. You're touching doorknobs. Infected. What's on your doorknob? That's so disgusting. Doorknobs are gross. A million hands have touched stuff. Does your doorknob have herpes? Yes. Anyway. Yeah, I heard what you guys were talking about earlier. It does seem that we piled an unnecessary amount of",
            "start": 445.48
        },
        {
            "text": "are gross. A million hands have touched stuff. Does your doorknob have herpes? Yes. Anyway. Yeah, I heard what you guys talking about earlier. It does seem that we piled an unnecessary amount of work on ourselves this week. Having said that, though, that's every week. Guess what next week is going to be starting? Keep continuing to plan E3 and that's going to get crazy. Because now it's down to the higher earth. How cool are we? We're the fucking coolest people in the world. We're not cool. We're having so much fun. This is awesome. I don't know we're the coolest people in the world. We're pretty damn cool. When Kinda Funny Live is done, people will understand that it's on another level. I will say that something Greg said was salient, which was people don't expect what we're about to do at Kinda Funny Live. No. They think it's going to be like a live podcast and kinda funny beyond 300, which was very lo-fi and fun. We had a great time, but it was like very not what",
            "start": 482.16
        },
        {
            "text": "to do at Kinda Funny Live. No. They think it's going to be like a live podcast and kind of like Podcasts Beyond 300, which was very lo-fi and fun. We had a great time, but it was like very not what we're doing at Kinda Funny Live. Right. One concern I want to air before we get into the topics, because we should really start rolling now. Yeah. Greg was playing with the camera for the last two minutes or so. Greg, are you fucking with things that shouldn't be fucked with? The levels look low, Greg. I'm looking at the levels. They look real low in that camera. Low? Low? Low? Low? Low? Low? Low? Greg, tell me what to do in this show. This is my show. I'm almost positive. No. Nonsense. I'm almost positive that this is my show. Game Over Greggy Show each and every week. Four, sometimes five best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like",
            "start": 520.4
        },
        {
            "text": "gentlemen, this is The GameOverGreggy Show each and every week. Four, sometimes five best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that, we post the entire thing early on Patreon.com slash KindaFunny each and every Friday. So throw us a few bucks. It's worth it. I got a couple of dollars. Warriors! We're all at the wall. Come out and play! If you don't want to give us any money, no big deal. We post the entire show topic by topic over on YouTube.com slash KindaFunny before posting the entire thing for free on the following Friday on YouTube and MP3s. So there was another cut. We've debated it. What do we do? Do we stop it? Do we restart the show? But I think we had fucking lightning in a bottle right back there. I mean, it's your show. It's not called The Nick Over Greg Show. It isn't. It never will be. Nick Over Greg. There's something there. That was a mess up",
            "start": 564.72
        },
        {
            "text": "There. I mean, it's your show. It's not called the Nick Over Greg Show. It isn't. It never will be. Nick Over Greg. There's something there. That's actually a good name. That was a mess up right there. I just want to be clear about one thing Kevin was saying before. This is Greg's show. Now I want to be, I want to be real clear about one thing. I want to be real clear. Hey, the format of this podcast was my idea and I didn't want to name it Game Over Greg. But because Greg's ego is so large and unwieldy, we had no choice but to name it after him. I just want to be clear about those kinds of things. It was a very revolutionary idea. No. I'm just curious. People say this and I'm a little upset about it. They said it over when I would say like the conversation thing at IGN too. If it was such an obvious idea, why didn't no one come up with it until I did? Now here's the other thing I want to ask Kevin. If it was such an obvious idea, I want you to name one other podcast where",
            "start": 608.74
        },
        {
            "text": "it was such an obvious idea, why didn't no one come up with it until I did? Now here's the other thing I want to ask Kevin. If it was such an obvious idea, I want you to name one other podcast where the idea was four random people bring four random topics to a podcast. I want you to go ahead and name it. Hit me with all those guys. I do like that the prequel to your podcast idea was you just going, we should all podcast. And for a long time, that was just you were just like, we should do a podcast at home. And I was like, what about? You're like, what about anything? I was like, we need more than that. And then like a year later, you're like, what if everybody had topics? I'm like, that's a brilliant idea. Let's go. Yeah. I mean, I feel like, I feel like people are kind of, I'm not, I'm not looking for fucking no, you are for first prize. A lot of jokes about Greg's ego. Looks like somebody else has pretty sure there's no podcast with that format. Your idea. I'm saying it is now",
            "start": 648.14
        },
        {
            "text": "I'm not looking for fucking no, you are for first prize. A lot of jokes about Greg's ego. Looks like somebody else has pretty sure there's no podcast with that format. Your idea. I'm saying it is now Greg's show. Greg hosted it. Henry Ford invented the car and you drive it. It's your car. I'll tell you who invented the internet is Al Gore. When Al Gore invented the internet, that's when things really got hot. So we can go back and say, Al Gore is actually responsible for this podcast because without the internet, there would be no podcasts. Thank you Al Gore. I just want to give a shout out to Greg. I don't know what just happened in the last 60 seconds, but there was about three ridiculous breakouts of Greg Millerisms that are going to be gifts. That's what you got to do sometimes. I'm back. I'm feeling good. I was, I don't know if you noticed today on Colin and Greg live one of my best performances of the year. I didn't notice easily. I didn't notice. I didn't notice. Oh, I hate when",
            "start": 678.1
        },
        {
            "text": "I'm feeling good. I was, I don't know if you noticed today on Colin and Greg live one of my best performances of the year. I didn't notice easily. I didn't notice. I didn't notice. Oh, I hate when you do that. I hate when you do that. I'm just sick of being told that the idea for the podcast was so odd at all. So what a revolutionary idea. I just want, I just want, I just want to be honest. You did say that Kevin. What I'm saying is that originally you wanted to cut this. We would have never gotten to this. I was wrong. This is like the bone marrow. I can admit when I'm wrong. Unlike Kevin who apparently likes to just keep riding that dead horse. What do you want me to do right now? You're doing it right now. You're doing a great job. Still losing too much weight. I don't like that. You're losing weight, buddy. That's what we're all saying. You're the first time I can fit in the shirt. Real quick, I like that beforehand we're doing the podcast set up, we're doing the board set up",
            "start": 721.28
        },
        {
            "text": "losing weight, buddy. That's what we're all saying. You're the first time I can fit in this shirt. Real quick, I like that beforehand we're doing the podcast set up, we're doing the board set up, right? And the one thing we're talking about is how this board is so great that you won't be able to hear anybody off the room. And we're like, well, Kevin shouts and he shouts something where you stop and we're like, that's enough. And then this whole show has been talking to Kevin off camera. So we're done now. Fun fact, I don't know if we caught all of this. It's fine. It's fine. So we'll see how it works out. But I listened to the clip you gave me while we were on that other break. It sounds great. This is the best sounding podcast we've ever had for sure. Well, we'll see about that. Yeah, absolutely. Yeah, that's a jury. Kevin, any other alternate history you want to provide us with Kevin before we go on to the first topic? You did put a lot of words in his mouth. Kevin, who won World War",
            "start": 764.18
        },
        {
            "text": "Yeah, that's a jury. Kevin, any other alternate history you want to provide us with Kevin before we go on to the first topic? You did put a lot of words in his mouth. Kevin, who won World War II? Is that something that we're going to revisionist history right now? Whoa. That's why. Wow. Right? I'm not saying I wanted them to win. I was talking about a little bit. I hate you guys. Can't wait to see. Oh, God, in my leg. I think I saved Greg's life actually. That almost went right into Greg's mouth. My goal tending instincts kicked in for just a moment. You didn't even click it shut. Well, I was going for the kill shot. Oh, well, OK. Tim. Yes. What's your topic? OK, my topic is very near and dear to my heart. Very, very, very, very near and dear to my heart. It is the only thing that's been keeping me going this last week as we had the Kinda Funny live. It's soda. Soda. Soda. Some people call it pop. The Midwest calls it pop.",
            "start": 796.2
        },
        {
            "text": "keeping me going this last week as we had the Kinda Funny live. It's soda. Soda. Soda. Some people call it pop, like in the Midwest they call it pop.",
            "start": 828.8
        },
        {
            "text": "Greg Miller asks us how we would change bad movies to make them good, like Coca Cola.",
            "start": 843.8
        },
        {
            "text": "Greg Miller asks us how we would change bad movies to make them good, like Coca Cola.",
            "start": 844.8
        },
        {
            "text": "NO Wines combining with 1984 threaten murder of God have a son them. Who is it people? It's like at a league that is with their parents. It's... that it's made from corn? Exactly. It's natural, and like sugar, it's fine in moderation? It's not natural, it's a byproduct. It's a chemical byproduct. Fine in moderation! It's not fine in moderation! Well, everything's fine in moderation. Smoking",
            "start": 1295.8
        },
        {
            "text": "and like sugar, it's fine in moderation? It's not natural, it's a byproduct. It's a chemical byproduct. Fine in moderation! It's not fine in moderation! Well, everything's fine in moderation. Smoking cigarettes is fine in moderation. You're in for a sweet surprise. Ask Kevin. Heroin's fine in moderation. Nope, nah, it's not. Clearly it isn't, you know? Methadone means... Clearly that's not true. Look, I'm not gonna go too deep into this, because I actually don't. I haven't done a ton of research on it. You're just like the lady in the commercial. You're just like the lady in the commercial. Yes or no, Mr. Scarpino. All I know is this. From a calorie standpoint, you are ingesting more calories if you eat high fructose corn syrup. Now, I don't know anything... I don't know what aspartame does to you, because not a lot of people do. There aren't a ton of studies out there yet. Like I said, they're trying to link it to Alzheimer's and all sorts of fucked up things that happen in your",
            "start": 1451.48
        },
        {
            "text": "does to you, because not a lot of people do. There aren't a ton of studies out there yet. Like I said, they're trying to link it to Alzheimer's and all sorts of fucked up things that happen in your brain, and cancer. Like, they're actually starting to have studies that come out now that are like... If you... like, they give aspartame to rats and within like three weeks... That's been forever, though. That's been forever. Well, rats get, by the way, rats get tumors. My brother's ex-wife used to get rats. She loved rats. I don't know why, but she kept them as pets. But no, within like a year, every rat would die. Maybe like two years, every rat. They'd be fucked with the whole lineage of rats by just injecting with every human byproduct. Well, we didn't let them out into the wild. It wasn't like, okay, let's just eat a rat and let him go out. You think some escaped and now rats are gonna take over the world? I'm pretty sure you've seen Teenage Mutant Ninja Turtles. Oh. Did we teach him",
            "start": 1486.88
        },
        {
            "text": "like, okay, let's just eat a rat and let him go out. You think some escaped and now rats are gonna take over the world? I'm pretty sure you've seen Teenage Mutant Ninja Turtles. Oh. Did we teach him kung fu? We taught him ninjutsu. Give it time. Give it time. These things happen over time. I think that... Listen, soda's great. And to your point, I used to go through about a two liter of Coke a day when I was a kid. And that went on for years. And that was because I had a metabolism of like... That's when I realized when I moved out here and I gained all that weight. I was just eating the same exact way my whole life and then suddenly my metabolism just shut off. And that's when I had to be more cognizant. There was a little time when I was drinking Coke Zero, which was fucking awful. And then I was like, you know what? I'm just gonna have a Coke a day. If that. Instead of just having a two liter or a couple cans. See, that's fine. That's a hundred and eighty... I think it's like 220",
            "start": 1525.08
        },
        {
            "text": "then I was like, you know what? I'm just gonna have a Coke a day. If that. Instead of just having a two liter or a couple cans. See, that's fine. That's a hundred and eighty... I think it's like 220 calories. Moderation. But they say if you cut out Coke completely, soda and probably juices of some sort, you'll lose a pound organically a month. Oh, you will. Didn't you do that? Juices are the worst. No, I mean it's a fucking fact. I drink an obscene amount of soda for a human being. Let me put it to you this way. And this is how I always equate it. What does your body... What liquid does your body need to function? Coke. Did you say cum? Coke. Okay. No. Your body does not need... Water. We're not like people hunting and gathering our own food. What did we ingest? Water. We had no other substitutes. It wasn't like we were mashing together oranges to make orange juice. And then like purifying them and adding sugar to them. No, we need water. All our bodies need is water. Anything you're",
            "start": 1560.28
        },
        {
            "text": "It wasn't like we were mashing together oranges to make orange juice. And then like purifying them and adding sugar to them. No, we need water. All our bodies need is water. Anything you're putting in it other than that from a liquid standpoint is... It's extraneous and it's probably just gonna cause problems, truth be told. I'd like to think of my ancestors, you know, my chromatin ancestors in Central Europe just taking like an apple and like... A banana and they're like smoothie. Just like bashing it. It was like a time lapse photo and then suddenly like a little juice dripped out of it. And it's like... And then like flash forward 2000 years and your ancestors opened juice it up. You blew my mind recently, Nick. I do that all the time. Yeah, you do. You really... Incredibly inaccurate facts. I know. So one of them that I'm not sure I want to question you now. Sure. Is this accurate or are you just trying to make a point? Sure. Because you often do that. I do that. I hyperbolize",
            "start": 1595.28
        },
        {
            "text": "Facts. I know. So one of them that I'm not sure I want to question you now. Sure. Is this accurate or are you just trying to make a point? Sure. Because you often do that. I do that. I hyperbolize for... You said that Coke Zero has one calorie and that Diet Coke has zero calories. Diet Coke doesn't have any calories. But Coke Zero has one? There was a Coke... No, Coke Zero doesn't have any calories. Because you did say it was like... No, no, no. There was a Coke Light that they tried... Or Coke 10, I think it was. It had 10 calories. And I think they still serve it. You said, end quote, \"Coke Zero actually has one calorie.\" One of them had one calorie. They've been trying to figure out how to like get off aspartame and like by doing that, they've been mixing in other things and trying to figure out if like what the public will allow in their Diet Cokes. Like is 10 calories okay? But people want zero. Like diet, it's a hard fact. Like you want that to have no calories if it's a \"diet\"",
            "start": 1634.28
        },
        {
            "text": "figure out if like what the public will allow in their Diet Cokes. Like is 10 calories okay? But people want zero. Like diet, it's a hard fact. Like you want that to have no calories if it's a quote unquote diet product. It tastes like shit. Yeah. It's all water. We have Kevin. Kevin, look it up. How many... I think it's Coke 10, right? Isn't it Diet Dr. Pepper 10 or something? One of them has one calorie and it's hilarious. Coke Life is what that one is. Is that Life? Oh, Coke Life. I do remember Coke Life. I will tell you this. Now, back in I think the 80s was really when the Coke Pepsi rivalry was coming to a head. Remember when they had the commercials where they were like the Pepsi Challenge and all that stuff and like Coke had like the raisins. What was the raisins thing? The California Raisins. That was Diet Pepsi. Was that Diet Pepsi? You picked the right one baby. He was so good. You picked the right one baby. I'm going to fucking buy that commercial now. He's",
            "start": 1665.28
        },
        {
            "text": "Raisins. Was that Coke? That was Diet Pepsi. Was that Diet Pepsi? You picked the right one baby. He was so good. You picked the right one baby. I'm going to fucking buy that commercial now. He's up against the wall guys. That was really when it was big and Pepsi had what I thought was one of the most innovative things ever to hit the soda market which was Crystal Pepsi. Do you remember this? Yeah. It was Pepsi. That was the artificial... It was so gross. All it was was Pepsi but it didn't have the brown... Was that the pep? It wasn't pep. Pepsi. It's a whole different subject. Oh, you're right. Yeah. But I often wonder why do they feel the need to put these artificial... Because that's the other problem too is like these dyes aren't great for you either. It took you five minutes to find out. No, it took five minutes to start for some reason. Oh damn. Look at that can man. I wish they still made that can. It's like the old school Pepsi can. Pepsi says one calorie on it in Ray Charles",
            "start": 1713.28
        },
        {
            "text": "No, it took five minutes to start for some reason. Oh damn. Look at that can man. I wish they still made that can. It's like the old school Pepsi can. Pepsi says one calorie on it in Ray Charles' days. So I want to give a shout out speaking of commercials. We're talking about Coke a lot but you know back in my day 7 Up was my jam. 7 Up's still good. No, 7 Up's not so good. No, 7 Up's fucked up now. Yeah, they fucked it up. It's all natural. When I was in like seventh grade they made it all natural. It was fucking bullshit. It's such a bad turn to be saying. It was because... I think they did it because they were realizing that Sprite was the preferable lemon lime soda kind of thing and then obviously Sierra Mist was like really coming up in the 90s. Where's Squirt? What about Squirt? Squirt is a forgotten relic. Yeah, Squirt is also... Squirt reminds me a lot of... I feel like first of all Squirt is probably geographically isolated in certain places. To what? Just California? Well no, we",
            "start": 1761.28
        },
        {
            "text": "A forgotten relic. Yeah, Squirt is also... Squirt reminds me a lot of... I feel like first of all Squirt is probably geographically isolated in certain places. To what? Just California? Well no, we have it out east too but I don't feel like it's everywhere. The one thing I was surprised when I was in Iceland was that they had... I was making the people I was with laugh because they had just Coca-Cola. Coca-Cola is huge in Iceland. I don't know why. It's huge. And they had like a huge Coca-Cola thing and then a huge Pepsi thing at the supermarket and then they had RC Cola. RC Cola fucking sucks. I'm sorry. I'm sorry. I don't know how... They're holding on. They're holding on because your aunt goes to get pizza and she comes over to RC and you're stoked about the goddamn pizza and then she comes in with that RC Cola two-liter. There was a local pizzeria in Chicago. There was a pizzeria we got pizza from each and every week and they gave you a two-liter of RC Cola with every pizza.",
            "start": 1809.28
        },
        {
            "text": "that RC Cola two-liter. There was a local pizza place in Chicago. There was a pizzeria we got pizza from each and every week and they gave you a two-liter of RC Cola with every pizza. Just keep it. Like how do... I have no idea how this was happening. Stop. Stop. Put that back over the counter. Just keep it. If I got two pizzas, can you give me at least a 20 ounce Coca Cola? I'll take a can. Just pour it in my mouth. Pour it in my hands. Let me walk away with it. So I love 7UP a lot and I think one of the big reasons was Cool Spot. Yeah. He's dead. The fucking coolest little dude ever. Smart marketing, man. It was so good. When I was a little kid I was like... Was he the coolest little dude ever? He was. What did he do exactly? Between his... I mean he was pretty... He had the sunglasses. He had shades and he looked like a pepperoni. I know who he is. And Chester Cheeto? Yeah. The Cheetos guy? We've covered this before. What? He's a cat character of some kind. He's",
            "start": 1834.28
        },
        {
            "text": "the sunglasses. He had shades and he looked like a pepperoni. I know who he is. And Chester Cheeto? Yeah. The Cheeto? Cheeto. We've covered this before. What? He's a cat character of some kind. He's a cheetah. Oh, we had this argument. This argument's running back. I don't even know what the hell we're talking about. I'll remember this. We did this on this show where it was like this. I get confused because you know I've been watching a lot of Planet Earth on Netflix. Oh, I did not know that. Yeah, I'm big into documentaries. And in Planet Earth they always... They're like this. The most illustrious and elusive of all characters. The Snow Leopard. And it looks like a damn leopard. They all look exactly the same. How do you know? Like something's a leopard or a puma. Like pumas have spots when they're in this... It's all the same shit. It's a cat. It's a big cat. Fucking house cat got out. That views you as supper. You are dinner to this cat. Okay. And if you're left alone with him in a",
            "start": 1882.28
        },
        {
            "text": "They're in this... It's all the same shit. It's a cat. It's a big cat. Fucking house cat got out. That views you as supper. You are dinner to this cat. Okay. And if you're left alone with him in a room and one of you's a little drunk, oh man, you're getting taken advantage of. Getting some cat puppies. Cat puppies. You just had like a Nick moment there when you went somewhere and then fucking just derailed. Yeah, it got down. It really is just the watch. It's a crazy thing. So the reason I brought up this topic is because I've been drinking a lot of soda recently. Stay awake. I'm just breaking. Why do you drink coffee? It's not even to stay awake. The caffeine. I drink so much that the caffeine doesn't affect me. Gotcha. But it's just more to have something to do. I don't even know. Do. Yeah, sure. But I realized that soda is such a big part of my life that when I go to restaurants and stuff, one of the biggest factors of the experience to me is how quick the refills are. And is there",
            "start": 1916.28
        },
        {
            "text": "I realized that soda is such a big part of my life that when I go to restaurants and stuff, one of the biggest factors of the experience to me is how quick the refills are. And is there free refills? Because if there's not fucking... Yeah, that's not... If I go to a restaurant and I go, oh man, Chinese restaurants, it's just like... They bring you a can. The day that I go to a Chinese restaurant and they don't have cans, I'm done. I will never leave that place. That will be my new home. And it will just be the best because you always get a can of just like... More than MSG and Coke. Like dinner... There's a bowl of MSG and a gigantic Coke. One can of Coke and a plate of Chinese food is just not enough for me. No. I don't always need two cans though and that's my problem. I feel like a little bit more would have been enough for me. So all these issues are just... This is what I live with. You know I love fountain beverages, right? Yeah, they're good. If I could, if I had the",
            "start": 1959.28
        },
        {
            "text": "like a little bit more would have been enough for me. So all these issues are just... This is what I live with. You know I love fountain beverages, right? Yeah, they're good. If I could, if I had the disposable income in a house, I would put a fountain in my house. I would even have all the flavors even though I don't drink any of them except for Diet Coke. Would you get that crazy Coke machine that's digital that you hit? No. I hate that shit. I fucking hate that thing. There are some things that are perfect. It's complicated. The Coca-Cola, Coca-Cola. That sound? Perfect. This shit doesn't... No, see I love it. I don't understand what this is going on. In my experience, the mix has been better than a normal one. Almost always. I don't know how the system is or whatever. Yeah, that's just what's happening in there though. Like sometimes... Well hey, it works for me. The Wingstop in Daly City has that thing and it's a cumbersome piece of shit is what it is. Because at the end of the day, like",
            "start": 2007.28
        },
        {
            "text": "Happening in there though. Like sometimes... Well hey, it works for me. The Wingstop in Daly City has that thing and it's a cumbersome piece of shit is what it is. Because at the end of the day, like Nick said, all I want is Coke. Why do I have to press all these buttons and then wait and then sometimes it's out of it? Or you get a little bit of flavor of like the Cherry Coke that was in there. I don't want that. I don't need that spigot. That shit's a little... Sometimes you don't fuck with good things. And that brings me back to my original point. Everyone in the world should be importing our fine corn byproduct known as high fructose corn syrup. They should be putting it into their Coca Cola products and their Pepsi Coke products. And we can all have a fine tasting drink. I mean, everyone's like, well I don't like the way this Coke tastes. I like the way that Coke tastes in Europe. Well newsflash, that shit was invented in the United States and the way it tastes here is the way",
            "start": 2045.28
        },
        {
            "text": "like, well I don't like the way this Coke tastes. I like the way that Coke tastes in Europe. Well newsflash, that shit was invented in the United States and the way it tastes here is the way it's supposed to taste. Except that's not true because it used to be made with sugar before it was made. Yeah, it used to be made with sugar. Actually it used to be made with cocaine. Well, a very long time ago. Cocaine! So, I don't know. I agree with you. Coke's important. We're doing our sauce thing with one of our viewers tonight where I made sauce. He's been stirring it. Kevin's been getting up and stirring. Give it a few more minutes. Kevin, you look relaxed right now. Feel it out. Feel it out. And I feel like, because it reminds me of Sunday dinners, remind me of going to my grandma's house. Football games are on, whatever. My grandma's laying on the couch, everyone's hanging out. And the sauce is ready. The grandma's laying on the couch? No, my grandpa. And everyone's hanging out, maybe in",
            "start": 2080.28
        },
        {
            "text": "games are on, whatever. My grandma's laying on the couch, everyone's hanging out. And the sauce is ready. The grandma's laying on the couch? No, my grandpa. And everyone's hanging out, maybe in the backyard, maybe in the living room, whatever. And things are going on, but when everyone sits down, the sauce is there, the meat's there, the pork chops, the chicken cutlets, all these kinds of things. And then there's the two liter of Coke. Because that had to be there. That was part of the experience. So whenever I have pastas, Greg will tell you, I have to have Coke because... Whenever you have any meal you really like. Yeah, I feel like wings aren't right, pizza's not right. Coke just goes with everything. Speaking truth, man. There's nothing about you that I ever... This whole thing. I get linking the foods to the Coke. It's just the fact that you'll crack it, you'll have a glass. A glass and a half out of it. And then just leave it out. And you're just done with it. It's dead to you.",
            "start": 2115.28
        },
        {
            "text": "linking the foods to the Coke. It's just the fact that you'll crack it, you'll have a glass. A glass and a half out of it. And then just leave it out. And you're just done with it. It's dead to you. It's only good that one time. Again, I'm so obsessive about that, that I get it. I totally understand. It's like, every single Coke experience, how it's packaged, makes it taste slightly different. Like a one liter tastes different than a 20 ounce. Like even plastic bottles. Like there is a difference. I prefer one liter. One liter Coke, my damn favorite. But, and this is just a random thing, I won't say it's my favorite just because... Very European of you, by the way. Huh? Very European of you. The one liter is huge in Europe. Oh, the 33.3 fluid ounces? Yeah, the two liter is a very American thing. They have smaller fridges in most places. Yeah, two liters is... I don't know, they don't have the same taste to me. But there is absolutely nothing more perfect than it being a hot day and",
            "start": 2147.28
        },
        {
            "text": "Thing. They have smaller fridges in most places. Yeah, two liters is... I don't know, they don't have the same taste to me. But there's absolutely nothing more perfect than it being a hot day and you drinking a perfectly cold can of Coke. Absolutely. The cold can, man. You're talking again. Hot day. I gotta go to that gas station, get that fountain beverage. I gotta have the straw, fountain, giant. I wanna be able to put it on my face to cool down the left side of my face, the entire part of it. Here's what I'll toss at. Here's what I'll toss at. I'm not a big soda fan. I was in my younger days. There's certain things. When I think of Chicago Pizza, you get these huge slices of pizza back in the Chicagoland area. It would be paired with a Dr Pepper and ECW. That's what we would do every Friday when we came back home. Isn't that a wrestling thing? It is. Yeah. It's what me and my friends used to do. We didn't get laid much. Shocking. Moving on from there, it'll be a blue moon where",
            "start": 2185.28
        },
        {
            "text": "Friday when we came back home. Isn't that a wrestling thing? It is. Yeah. It's what me and my friends used to do. We didn't get laid much. Shocking. Moving on from there, it'll be a blue moon where I'll be like, I want a glass of Coke off of this bottle of Coca Cola. I'll feel in the mood for it. You know what I mean? But the one Coke I can never turn down is the best Coke of all time that I did not run into until three, four years ago, maybe less than that. At a pre-E3 judges week thing where you went in and they gave you the tiny aluminum bottle. Oh, yeah. This shit is like the private reserve. And I don't know what Mr. Coke is just like off his own spigot and then tossing them out of you because they are fucking amazing. It's the right one where it's not too acidic. Yeah. It's just sweet. It's like syrupy. It's here. He's in the Coca Cola house. Yeah. Just finding the finest barrels of Coca Cola. I thought you were going to go even a little bit further, which was when you go to the fancy",
            "start": 2225.28
        },
        {
            "text": "It's like syrupy. It's here. He's in the Coke Zero house. Yeah. Just finding the finest barrels of Coke. I thought you were going to go even a little bit further, which was when you go to the fancy hotels or places like really nice to get the little glass, glass, glass, little glass bottles. Those are two ways. You just pop it. It's done in like three seconds. You're like, wow, it's $10. It just makes you it's just very, it makes you feel very premium, like very, you know, like, yeah, this is what Lady Gaga would do. I love that. I love when you walk in and that's what this what happens to every gaming event that we still go to. They still do this where it's it's catered. You look over and it's like a little bit of, you know, something, whatever, something to eat. And then there's just a look at that spread of the bucket of ice, the glasses and then the little box. And you're like, oh, I'm going to try me. Yeah, I got it. Yeah, I got it. And I'll fuck around with the Sprite a little bit. I'll",
            "start": 2266.28
        },
        {
            "text": "spread of the bucket of ice, the glasses and then the little box. And you're like, oh, I'm going to train me. Yeah, I got it. Yeah, I got it. And I'll fuck around with the Sprite a little bit. I'll do this and the other thing I just to Greg's point to closing out of my own opinions of this. The reason nothing bothers you more than having the two-liter must be. By the time the two liters cracked, you have about an hour to 90 minutes because otherwise it's all fucked up. I don't understand how people don't understand that. Like I understand. Cheryl will milk a glass of a bottle of Coke for days sometimes like I'll just leave it in the fridge. She'll drink it. And by the time you're pouring it and there's nothing there's no suds. There's no I'm like, that's gross. That's disgusting. You can't drink that. I'm drinking it and I'll go get another two-liter. I don't even want to watch you drink it. Yeah. I mean, that's how that's how I just your gag reflex. Like right in my core, my",
            "start": 2303.28
        },
        {
            "text": "You can't drink that. I'm drinking it and I'll go get another two liter. I don't even want to watch you drink it. Yeah. I mean, that's how that's how I just trigger your gag reflex. Like right in my core, my soul. It offends me. I mean, you know what? Make your jokes about 9/11 all you want. You know, I mean, make your jokes about all these kinds of things. I know. Don't look at me when you say make. But not you. Not you. Not you. I'm saying people out there make your 9/11 jokes. Make fun of you know, do all the things that would make me. You think I'd be really sensitive about those things. Don't bother me. You drink a fucking half full bottle of two liter of Coke in front of me that we did in the fridge for three days. Oh, oh, you know, it's even worse. Yes. And Nick, don't make that 11/2 joke. I don't like it. I'm not making occasionally. And I've caught my wife saying, Jeff, you will doesn't burn beeps. Wow. So what did a different direction? The other day I had a can of diet root beer that I",
            "start": 2344.28
        },
        {
            "text": "like it. I'm not making occasionally. And I've caught my wife saying, Jeff, you will doesn't burn beeps. Wow. So what did a different direction? The other day I had a can of diet root beer that I had opened up and I drink so many of these like I'm still to this day. I'll drink. I'll get like three at the supermarket. I'm like, I'm going to I'm going to want another one and I'll drink two and a half. But I'm like, I just can't drink a third diet soda in one sitting that I'll just kind of leave it out. And the other day I found it. It went from being out to being in the fridge to being gone. And I'm like, did you drink that flat can of like diet root beer? My wife's like, yeah, it was good. I'm like, but so like the can was open. Oh, it's gross. Terrible. It's terrible into the refrigerator. So it tastes like everything in the fridge now. Well, it's it's that. But it's also it's just syrup at that point. It's just water and syrup because there's no carbonation left. And she was like, it",
            "start": 2387.28
        },
        {
            "text": "So it tastes like everything in the fridge now. Well, it's it's that. But it's also it's just syrup at that point. It's just water and syrup because there's no carbonation left. And she was like, it was only a little bit left. I poured over ice. But it reminded me of my grandpa. Says the man who pours Coors Light over ice. I pour everything over ice. I love ice. But when you're talking about when you're talking about dinner at grandma's house, I used to do that. It was the exact same experience, except my grandmother, God, God lover, would just hoard stuff like there was a zombie apocalypse. But she would never check the like the best buy dates like born on dates. And so you'd go back there. You'd have to root through to find stuff that was actually edible because you'd have all these candy bars that like you'd go to break it off. And you just it would crumble in your hands because it was three years ago. She was very against putting soda in the refrigerator because this is back in",
            "start": 2429.28
        },
        {
            "text": "bars that like you'd go to break it off. And you just it would crumble in your hands because it was three years ago. She was very against putting soda in the refrigerator because this is back in the day, like you're talking Depression era like woman where she's like, we have one fridge space and there's limited. I'm not getting another fridge. It's going to suck all this power. So all the sodas stored in the pantry. You want a cold soda. You got to pour it over ice. So it was like every time I have a can of Coke that's warm, I pour over ice and I drink it. It immediately makes me think of my grandma's car. It's so funny you say that about the pantry because my grandma's, you know, my grandfather died. My, my, the Moriarty side grandparents died. My grandma died when my dad was 19 and then my, uh, his father died when I was very young. So I grew up with the Reggiero's, the Italian side, which is why I'm so Italian. My grandfather died of colon cancer when he was, what was like 1996.",
            "start": 2461.28
        },
        {
            "text": "my, uh, his father died when i was very young. So I grew up with the Reggio's, the Italian side, which is why I'm so Italian. My grandfather died of colon cancer when he was, what was like 1996. But my grandma was alive until 2004, 2005 and she had Alzheimer's and stuff like that. So when, when she passed away, we went into her house to like clean it out. We sold it. Unfortunately, it was very sad. But I remember going into the basement, into the pantry and there were things that were in there still. I think at this point I was, Oh God, how old is I was like 21, 22 years old. There were things in there that were there when I was like six or seven, like straight up. Because I used to go down there and play and like walk around. I'm like, I remember this can of tomato juice being here forever. And I remember like trying to like be like, yo, can we keep some of this stuff? One of the things I did keep was a, she had a bottle of Molson Canadian beer that was down there. That was literally",
            "start": 2501.28
        },
        {
            "text": "And I remember trying to be like, \"Yo, can we keep some of this stuff?\" One of the things I did keep was a bottle of Molson Canadian beer that was from the 1960s. Like, that's awesome. And I kept all this stuff. My mom said, \"You can't keep all that.\" I was trying to keep old food. Yeah, that's awesome. Yeah. So it's just so funny. That's an Italian grandmother. Oh my God. My grandma's thing was gum. She used to go to March Air Force Base with my grandfather, who worked there in the military. He was actually in the Air Force. And so my grandmother would shop there once every six months and buy stuff for some reason, including a lot of gum.",
            "start": 2542.28
        },
        {
            "text": "the base and get stuff for tax free and all this stuff. So she would do all of her shopping there, but she was old. So she would shop like once every six months and she would buy for some reason, the following cans of regular soda that had labels on them. And I'm like, that's from 1963. Why they're still selling that label is beyond me. Hershey bars, love Hershey bars. Like the ones that are just the bricks. No, no, no nuts in them. And Juicy Fruit gum. And it would get to the point where you would pick up a piece of gum, like basic unwrap it and you could snap it with your finger. That's that's how stale this stuff was. And if you put it in your mouth, you'd instantly throw up. Your gums are getting cut up. That was part of the fun. My brother and I, cause my brother and I used to love to eat. We still do. And we'd go, the first thing we do is head for that pantry and just like root through it and see what was new. But we'd always keep the old stuff in there. God forbid the little shit",
            "start": 2571.28
        },
        {
            "text": "We still do. And we'd go, the first thing we do is head for that pantry and just like root through it and see what's new. But we'd always keep the old stuff in there. God forbid the little shitheads actually help Grandma out and throw the food out. That was bad. No, no, no, no. We'll let Grandma eat it. Maybe choke on it. Just watching The Golden Girls. We were shitheads. Before we switch off, I want to give a special shout-out to cans of Coke on an airplane. Coke tastes so much better on an airplane. You know, something about the pressurization to me. That airplane is the one place I don't like Coke. You know what? That's not even fair to say it's not that I don't like Coke. It's just that the airplane is for the ginger ale. The can of ginger ale over ice. My God. Yeah. My God. It's good. I discovered something even more bougie than that the other day. I was I was down in L.A. going to L.A. for that gig I did. And we do get gigs in L.A. And I was with my buddy Colin. Not not this",
            "start": 2614.28
        },
        {
            "text": "I discovered something even more bougie than that the other day. I was I was down in L.A. going to L.A. for that gig I did. And we do get gigs in L.A. And I was with my buddy Colin. Not not this call. My other friend Colin. And he we're on Southwest. There could only be one. He knew he's flown Southwest so much that he knows kind of the thing. Oh, that they're going to be annoying as fuck. I sing some stupid song and make a bunch of dumb jokes. Just get us there without crashing. This one was straightforward. This one was like we were there. We were out. But he goes, I'll take a water. But I want the whole can. And I'm like, what? They have cans of water on Southwest - it's Dasani or, oh, yeah, I know. I know that. They bring you the whole can. And I'm like, this has to be carbonated or something. I open it up and I pour it into the glass. It's just water. And I'm like, this is the biggest waste of resources I've ever seen in my entire life. Because it's water.",
            "start": 2658.28
        },
        {
            "text": "carbonated or something. I open it up and I pour it into the glass. It's just water. And I'm like, this is the biggest waste of resources I've ever seen in my entire life. Because it's water. It's a can. So you're done in like five, six. You're like, well, that was water. But isn't it the opposite? Because then they can crush it down and like they it's less waste on the plane. I mean, I guess. But I mean, my assumption is when they usually they have water, the big jugs. So it's just I don't know. I'm not I'm not a scientist. I don't know what's better for the environment. You know what a Southwest Airlines scientist think? I just think in the lab, trying to get water. But I guess you're right. We're mining something from somewhere because you don't have a spigot. Some incredibly annoying person, probably pushing fifty-five and a pair of khakis is going to be giving this water out. How do we make it as unappealing as possible? More more unappealing than our bullshit seeding system. We're",
            "start": 2696.28
        },
        {
            "text": "probably pushing fifty five and a pair of khakis is going to be giving this water out. How do we make it as unappealing as possible? More more unappealing than our bullshit seeding system. We're going to be having them mine asteroids in 30 years. So Coca Cola could put fucking water in their metal fucking cans. The one thing the one thing I want to say about airplane drinks is that I use I typically go in different directions because I typically get apple juice. And the reason I do that is because I never buy apple juice. So I'm just like, I'm not fucking apple juice. Here's the thing when you order orange juice or apple juice on a plane with and they and they you I just do it out of fear now because there's just some fucking random ass shit going on in airplanes where I'm like, I want the apple juice. No ice, please. Who puts apple juice over ice and who puts orange juice over ice when they give you orange juice and it's an ice? I'm like, what do you do? I'm like, it's like morbidly",
            "start": 2729.28
        },
        {
            "text": "apple juice. No ice, please. Who puts apple juice over ice and who puts orange juice over ice when they give you orange juice and it's an ice? I'm like, what do you do? I'm like, it's like morbidly offensive. I'm like, I'm like. Like they had like putting the ice in or you like seem to go like, no, no, no, it's orange juice. You just pour it in the glass. They're sleepwalking through their day. Oh, absolutely. I think it was walking. Fucking have to deal with farts and babies vomiting on them all day long. My mom was a flight attendant for a very long time before she, you know, when she was a broker, when she worked at Delta. Well, she like became a manager and putting up other people's shit all the time. And then she became like head of a bunch of flight attendants. But but she yeah, I mean, she she she was that's a very hard job. Oh, yeah. I have a lot of respect for God. Yeah. For flight attendants because they also don't get paid a lot of money at all. Well, I also know that how",
            "start": 2761.28
        },
        {
            "text": "mean, she was a very hard job. Oh, yeah. I have a lot of respect for God. Yeah. For flight attendants because they also don't get paid a lot of money at all. Well, I also know that how difficult I am to deal with when I'm in my cranky mood. You know how sometimes I get no, I know that. Well, Kevin knows it really well. I take it on Kevin's because he's looking at the way he's smiling. But you just want to you still got so much, so much joy. I don't want to just bully it out of him. I'm going to crush his soul so badly. It's a hard job. I will say this, though, for the record, this is the final topic. This is the final part of the soda conversation. The final part of the final part. Now we've gotten it. It's because as a topic we have to have everything over ice. Everything in America has to be on ice. You don't realize that until you go to Europe. And they're not they're not ice crazy like we are. Everything has to be like cold. So like that's probably what they",
            "start": 2802.28
        },
        {
            "text": "in America has to be on ice. You don't realize that until you go to Europe. And they're not they're not ice crazy like we are. Everything has to be like cold. So like that's probably what they respond to is just the natural inclination is everyone's going to want to ice point. Everything over ice. They try to pour like I'll take tomato juice on ice. But you're right. If it's already cold, it's juice. Yeah, it's just it's already cold. That's the thing. That's the thing that bothers me. I love fountain Coke, too. But you know, with the ice and then I'm like, it's already cold, you know, like it's like nothing coming out of a fountain. Warm or lukewarm or even room temperature. It's cold already. I just don't feel like there's an issue of displacement. And then there's an issue of watering down the Coke. And I don't I won't have it. I won't allow it. And it's not it's I have my diet Coke on ice, but I have to have that if I'm on a plane. All right, guys. Also, I'll back up on the juice",
            "start": 2843.28
        },
        {
            "text": "down the Coke. And I don't I won't have it. I won't allow it. And it's not it's I have my Diet Coke on ice, but I have to have that if I'm on a plane. All right, guys. Also, I'll back up on the juice thing, though, because I always every time I get on the plane, I just feel depleted. I'm like, I need something. I need something. Yeah. Vitamin shake it up. There's some sugar or something because this that the half an hour I had to wait in the airport and then the line I had to wait. And it's just too much. And you're staring at the fucking digital map and your plane isn't moving. You're like, is this fucking plane even going in here? And you're just flying at 40,000 feet. You're looking down. It looks like you're not moving at all. And I'm like losing my goddamn mind because we flew back from Boston when we came back from Iceland, San Francisco. It was almost a seven hour flight this time of year and going, you know, obviously east to west is worse because of the jet stream. So I was I",
            "start": 2876.28
        },
        {
            "text": "Boston when we came back from Iceland, San Francisco. It was almost a seven hour flight this time of year and going, you know, obviously east to west is worse because of the jet stream. So I was I was like losing my mind. They just kept it, you know, like just I need more apple juice. Give me some apple that. All right. Time to pay a bill. Tell you what our sponsor is Corner Finest Association. Remember, I free turtles. Coincidentally. It's not that bad. It's not that bad to brush your teeth with it. That's a free one on us, guys. Tim wants to break this topic into. Well, I'm saying that just because I just got the official runtime from Kevin and it's about 52 minutes that we've been talking about. We're having a good time. We're having a good old time. I'm just saying, all right. You want to make that one topic? Yeah. OK, cool. It's the funniest one because it'll be Coca-Cola for 52 minutes. What's your topic? But time out already on that. Nick, will you introduce? We never even introduced the",
            "start": 2909.28
        },
        {
            "text": "one topic? Yeah. OK, cool. It's the funniest one because it'll be Coca-Cola for 52 minutes. What's your topic? But time out already on that. Nick, will you introduce? We never even introduced the second member of the team. I don't know if he wants to be entered. OK, then we want to be in a shagging around. We have a we have a good friend of the family here named Ryan Hunter. A best friend. He is has generously donated his time to help us set up and get going. Our Starship Enterprise mixing board that he recommended for us. He reached out to I don't know if you guys remember, but probably not. I was on calling Greg live a while back and I was like, we need to make some board. If anyone knows anything about audio, please reach out to me on Twitter or send me an email. And Ryan sent us an email saying, hey, I'm down to help out. And he was graciously kind of dealt with all of my frantic like, but what about this? What about this? He's like, just buy this board. It's fine. I'll come set",
            "start": 2953.28
        },
        {
            "text": "saying, hey, I'm down to help out. And he was graciously kind of dealt with all of my frantic like, but what about this? What about this? He's like, just buy this board. It's fine. I'll come set it up for you. So he has been here all day setting this up. If you're wondering why this sounds way better than usual, it is because neither myself nor Kevin had anything. No offense to Kevin. Had anything to do with it. Kevin had something to do with it. Kevin is learning right now. And Kevin will be responsible for the audio going forward. Whether that is a bad thing is on Kevin. He's still smiling, though. No pressure tomorrow when Nick wants to take everything out of the room. Small puppy and not kidding. But anyway, Ryan, thank you so much for coming. It's been awesome. Thank you, Ryan. You're a good best friend. We're very stressed out right now. And you have sort of kept your cool. I did forget to eat crazy. Thank you. And now I'm going to stir the sauce. Oh, you just did. Oh, OK. All",
            "start": 3000.28
        },
        {
            "text": "a good best friend. We're very stressed out right now. And you have sort of kept your cool. I did forget to eat crazy. Thank you. And now I'm going to stir the sauce. Oh, you just did. Oh, OK. All right. So, Colin, what's your topic? I want to tell us what turn is usually that you want to give a shout out to who you work for. Do you not care? I work for Canaan Sound Light. So he works for Canaan Sound Light. Sacramento area. Sacramento area. You need some sound or lights. Go to Canan. C a n a n. Do you know C? C a. Canan. C a n a n. Gotcha. The bomb dot com. Is it? Yeah, I got the book and I've had the Bomb.com. That's the shit. Pretty good. That must have cost them pretty penny. Colin, I apologize. It's OK. It's it's quite all right. Mad season is upon us. If you're in the politics and I am like the primaries are heating up. People are starting to argue with each other. Primaries are coming up. I was just basically curious if you guys plan on voting in either the primary or the",
            "start": 3033.28
        },
        {
            "text": "and I am like the primaries are heating up. People are starting to argue with each other. Primaries are coming up. I was just basically curious if you guys plan on voting in either the primary or the general election. This is going to be a pretty huge election. This election is going to be substantial. And you guys will you guys aren't engaged in paying attention yet, but you'll find out soon enough. So I was like, what he says, soon enough like that, like it's like there's an apocalypse coming. We don't know about it. We're going to call and go. The amount of people involved in it and the amount of money being raised is going to make sure that this is in your face. And there's no incumbent running. And these are the best elections. These are the fucking best. This is this is when it really counts. Yeah. And an incumbent is somebody who's already in office. So like in in 2012, it was Obama who was the incumbent versus Romney. So he has, you know, just like Bill Clinton or whoever",
            "start": 3083.28
        },
        {
            "text": "counts. Yeah. And incumbent is somebody who's already in office. So like in 2012, it was Obama who was the incumbent versus Romney. So he has, you know, just like Bill Clinton or whoever, like Bush. You have a huge advantage. Yeah. The incumbent, a huge advantage. It's very difficult to say, hey, you don't know what it's like to be president. Yeah. President for hard to get fired. Like this is the incumbent. Isn't there some ratio with the company? The incumbent generally wins. Yeah. The incumbent generally does. Yeah. So and that's just not always I mean, the incumbent gets knocked out. Jimmy Carter got knocked out, for instance, and Bush got knocked out. But that was the last. So if you think about so many things since World War Two ended, you had Truman run twice. Well, actually technically ran once. We run again. Eisenhower ran twice and won both times. Kennedy ran once. Johnson ran once. So the only people that really lost were Carter and Bush. So, yeah. Yes. The",
            "start": 3121.28
        },
        {
            "text": "technically ran once. We run again. Eisenhower ran twice and won both times. Kennedy ran once. Johnson ran once. So the only people that really lost were work. Carter and Bush won. So, yeah. Yes. The answer is yes. For the record, Al Gore doesn't count as an incumbent, right? Because he was vice president. No, no, no, no, no, no, no, no, no. I wouldn't count that as incumbent. Not technically. He has an advantage, too, though. He did have an advantage. He probably still won that election. He invented the Internet. He did invent the Internet. So I'm just curious if you guys were going to get involved at all in the polity of the day, in the primary, or going to vote next year in the general, regardless of what the outcome is. You have to assume it's going to be Clinton, probably, but maybe not. I mean, I want to. I have to. My wife is very political. She she's the one person that's like every day she comes up, she's like, oh, man. And she'll start talking about some news story. I'm",
            "start": 3158.28
        },
        {
            "text": "not. I mean, I want to. I have to. My wife is very political. She she's the one person that's like every day she comes up, she's like, oh, man. And she'll start talking about some news story. I'm like, I don't know what you're talking about. She's like, well, you see this trailer? The other day, she's like, hey, she's like, did you hear about she brought it up like it was casual. I was like, wait, there was an earthquake. Like, you know, I didn't I just I don't follow that kind of political. Well, she knows she just somehow knows everything before. Like I come home and I'm trying to make it a point now to watch MSNBC or CNN at night. I'll turn it on if I'm dead by eating and just like I got to just have some sort of concept of what's happening in the world or at least the United States right now. My wife is really into that and she's really energized by that. And so she will. She's the one that kind of puts the ballot in front of me is like, let's sit down. Let's let's look through",
            "start": 3197.28
        },
        {
            "text": "right now. My wife is really into that and she's really energized by that. And so she will. She's the one that kind of puts the ballot in front of me is like, let's sit down. Let's let's look through these like all these all the positions. Let's figure out what proposition also. Then I just go like this. Just fill it out and I will copy you. So I'm saying the same thing to you when you go and vote for the primaries. I'll just go with you and we'll just cheat that little. You know how they have whatever the divider is, sometimes it's a curtain, sometimes it's a weird phone booth, like sometimes it's the weird urinal stall that's just a little too high. You can't see your friend, but you can still see his penis in pants. OK, penis. I wasn't judging you. Do I. You zoned out for a second like you were thinking about seeing my penises. That's great. I'd like to. But I think it'll be fun because it'll be fun for me to hear through your perspective, sort of what the polarizing issues",
            "start": 3231.28
        },
        {
            "text": "you were thinking about seeing my penises. That's great. I'd like to. But I think it'll be fun because it'll be fun for me to hear through your perspective, sort of what what the polarizing issues are. Does. Do your wife's political beliefs line up with Colin's political beliefs? Will there be problems at home when you're like, well, I already voted and voted the way Colin wanted? No, generally. Your ballot. The thing about Colin is this. Colin has likes to indulge in in the the mythos of having extreme views, but he's actually a very fair and balanced person when it comes to politics. Like he is a fiscal conservative, but generally pretty liberal everywhere else. That is exactly what my wife is. And that's pretty much what I am, too. Like you can't live and run a business in San Francisco and not kind of have an understanding of like, OK, I'm going to leave a little bit more to the right when it comes my money and way to the left when it comes to everything else. And I think that's",
            "start": 3270.28
        },
        {
            "text": "and not kind of have an understanding of like, OK, I'm going to leave a little bit more to the right when it comes my money and way to the left when it comes to everything else. And I think that's just kind of especially because we're sort of a product of this environment now. We're all kind of friends. And San Francisco is known for that. I think we're all pretty, pretty on the same page. I don't think she would lean as far right as Colin leaves as far as being a constitutionalist. I don't know that she would go that far into it, but it's going to be I mean, I don't see Rand Paul winning. So I don't think we have you know, you're pretty hardcore libertarian, right? Yeah. Yeah. I just vote Republican because that's because that's kind of pragmatic win. Yeah. So that's that's the problem is, you know, no matter what your beliefs are, you really have two choices. You can either vote whoever the Democratic nominee is or the Republican nominee. That's it. There's really like there's no",
            "start": 3310.28
        },
        {
            "text": "Is, you know, no matter what your beliefs are, you really have two choices. You can either vote whoever the Democratic nominee is or the Republican nominee. That's it. There's really like there's no real third party. Correct me if I'm wrong. No, there is no real third party, but that's not necessarily a bad thing. I mean, we'll just look what happened. I mean, I understand people want more choice and choice is good and all that kind of stuff. But third parties don't necessarily solve problems to look what happened in Britain with the parliamentary election last week. I guess it was now at this point, not maybe when people are listening to this, though. I mean, like there's five or six different parties represented. Everyone's splitting the votes. The Liberals are splitting their votes between all of these different groups. And so the Tories end up winning and a majority of parliament. And so that's destructive in its own right. People like people ask for more choice. And",
            "start": 3350.28
        },
        {
            "text": "votes between all of these different groups. And so the Conservatives end up winning and a majority of parliament. And so that's destructive in its own right. People like people ask for more choice. And that's that's fine. I accept that. That's great. But third or fourth or fifth party is going to make things more convoluted. I think. Yeah, no, I'm engaged. I'm excited. We can't vote in the primary together unless you're a Republican. See, that's my thing. I'm not I won't vote in the primaries because I'm registered independent. Yeah, you can't vote. I don't I'm not going to switch it just to go vote for somebody. Yeah, you can't vote in the primary. Then I let all you chuck. I pick again. I got to look at the register and I'll write in panda bear. Yeah, I registered Republican when I was in Orange County because it's the only Republican county in all of California. I don't know. I had a check and see what I'm registered as. I'm not actually going to go with you. There's a fire station like",
            "start": 3380.28
        },
        {
            "text": "County because it's the only Republican county in all of California. I don't know. I had a check and see what I'm registered as. I'm not actually going to go with you. There's a fire station like two blocks away. Oh, yeah. You can't just go vote anywhere you got to give you where you got to. Yeah, I vote out of a garage. It's really weird. It is weird. It's kind of cool, though. Yeah, something very like that's old school. Yeah, it's very specific. Yeah. This is a question that a lot of people probably will ask myself included. And I think it's interesting to to to answer. Does it matter? Is what you often hear is like, does it matter if the individual votes? Because we are we have the electoral system, right? The electoral college. Does it really matter if I go and vote in the primaries or even in the in the general election? Well, the primary definitely matters. Yeah. In 2008, P.Diddy came out and he said, Vote or Die. And if you don't want to die, Nick, you should vote. The",
            "start": 3414.28
        },
        {
            "text": "or even in the general election? Well, the primary definitely matters. Yeah. In 2008, P.Diddy came out and he said, \"Vote or Die.\" And if you don't want to die, Nick, you should vote. The electoral system, of course, is a bit confusing. Yeah. The electoral system does confuse me, though. I think it confuses a lot of people. There's a conversation with Khan about this. You can watch on YouTube. Yeah, I won't go into it too much now. Yeah. I mean, there's not there's not the electoral college thing bothers me in the sense that I like the electoral college. And I'm not saying that people that don't like the electoral college uniformly don't understand it. I will say with some certainty that most people that don't like the electoral college don't understand why it exists and probably don't understand how it works. So that's the that's that's the one thing that really bothers me. It protects the small states and the people in small states. And that that makes that makes sense to me because",
            "start": 3453.28
        },
        {
            "text": "how it works. So that's the that's that's the one thing that really bothers me. It protects the small states and the people in small states. And that that makes that makes sense to me because California, Texas, New York, Illinois, Florida would dominate every election. If that is the majority of the population. Yeah. Yeah. Like so like what about the 500000 people in Wyoming? Their votes are relevant. You know, so like they get just a little kick up. They have three electoral votes, which are still small. But by person, it still counts a little bit more. So at least they have a voice. You know, California, your vote counts a little less. So but is that is that just to even out? I mean, why? Let's let's go top level here. Why doesn't it just a vote as a vote? That's democracy. We're not a democracy. We're a republic. Got it. So in that regard, we have to have representatives voting for us. Right. Which is the way the Romans did it somewhat. But like the yeah, like a direct",
            "start": 3484.28
        },
        {
            "text": "not a democracy. We're a public public. Got it. So in that regard, we have to have representatives voting for us. Right. Which is the way the Romans did it somewhat. But like the yeah, like a direct democracy would be we'd vote generally, which is what we do on a state level. Like for so we have like direct election of governors or direct elected officials who then represent you in the federal government. Right. Who then cast their votes on your behalf. It's just it's just less messy that way. I have no problem with that. We're not a direct democracy. Direct democracy really don't exist. You think it would just be too chaotic because we have to vote on everything and it would be just like constant craziness? Yeah. Maybe on us, maybe in a smaller country that would that would be reasonable, but not in a country of three hundred twenty million people. That would be that would be chaotic. Yeah. And you don't you don't necessarily want that either. And we can and we can leave that to a",
            "start": 3525.28
        },
        {
            "text": "but not in a country of three hundred twenty million people. That would be that would be chaotic. Yeah. And you don't you don't necessarily want that either. And we can and we can leave that to a discussion of another time. But the Electoral College, if we got rid of the Electoral College, we'd have to we'd have to amend the Constitution. That's not going to happen. The small states would never go for that. So like the Electoral the Electoral College is there to stay forever. Right. It's not going anywhere. We would have to I do believe that in our lifetime we can have a new constitution. But that would like a new constitutional convention, a new constitution would be like an incredible experience. It would probably be a little scary. They do go over that actually in Jericho where they write a new constitution. Really? But yeah, like because some people might be like, well, we should have a constitutional convention to talk about. Yeah. What do we what are we doing with this document",
            "start": 3561.28
        },
        {
            "text": "a new constitution. Really? But yeah, like because some people might be like, well, we should have a constitutional convention to talk about. Yeah. What do we what are we doing with this document? I don't believe that that should happen, but I don't think it should happen either. I think it'd be a pain in the I think it's terrifying. You don't want to do just because it'd be complicated. No, it would be the same. It's the same thing that every every you know, every political agenda is pushed by someone. Right. And that's that's the scary thing about what's going on and what's always gone on in the states is that, you know, you start having these politicians who are backed by lobbyists go out there and start, you know, putting policies out there that are really just to put money in people's pockets a lot of time. So the Constitution is one of those things you really shouldn't screw with because that was probably the only pure thing we have. Everything else is sort of tainted by the",
            "start": 3592.28
        },
        {
            "text": "pockets a lot of time. So the Constitution is one of those things you really shouldn't screw with because that was probably the only pure thing we have. Everything else is sort of tainted by the circumstances of our era and our time. Yeah, that's unfortunate. Going back and fundamentally changing that, well, then we're never going to get something like, you know, the electric car. We're not going to get that because everyone, people that have the most amount of money that's thrown on the United States and calling again, correct if I'm wrong, because I might be just wildly speculating here, I would guess is big oil and probably tobacco and big pharma and big pharma. So pharmaceutical companies, tobacco companies and alcohol companies, excuse me, oil companies run our frickin country. So you're going to go out there, you're going to say, well, the one thing that we're not allowed to touch, then they can they can now touch with their trillions of dollars, their annual revenue that they",
            "start": 3618.28
        },
        {
            "text": "going to go out there, you're going to say, well, the one thing that we're not allowed to touch, then they can they can now touch with their trillions of dollars, their annual revenue that they have. No, thanks. No, please keep that by itself, because that's something has to remain untouchable. Otherwise, we're kind of screwed. You have people like the Corn Refiners Association stand up for the little guy out there working for us. Yeah, they would definitely stand up for the guy. What do you think, Tim Gettys? Are you going to vote in 2016? Yeah, definitely. In the primary you're going to vote? I honestly, I'm going to talk to Colin Moriarty about a lot of things. OK. Get educated. Talk to Nick Scarpino because I respect him and he has a good... Are you registered Republican Democrat? Independent? Independent. OK, so there would be no primary for you. How did that happen? Yeah. We just go in there and write Perot every time. Win. Win Perot. I wish. The primary system itself is really funny, too. In the",
            "start": 3671.28
        },
        {
            "text": "So there would be no primary for you. How did that independent? Yeah. We just go in there and write Perot every time. Win. Win Perot. I wish. The primary system itself is really funny, too. In the United States, it's just very different than it is in a lot of other places, like the order of the states vote and stuff like that. Like Iowa, New Hampshire, Florida, South Carolina always go in that order. So like I would like so all the evangelicals go to Iowa. Why now? Why is Iowa the most? Everyone's always in Iowa. Like they're everyone's in Iowa right now. The caucus fundraising corn. Why is it so important, though? Because Iowa goes first. So if you win if you win in Iowa, that just gives you a strong statement. Yeah. OK. But the funny thing is that those four states are so different. The first four states that go and then states to kind of trickle off until Super Tuesday, which Super Tuesday is when like a lot of states go, like 20 of them. Because California doesn't really matter",
            "start": 3699.28
        },
        {
            "text": "first four states that go and then states to kind of trickle off until Super Tuesday, which is when like a lot of states go, like 20 of them. Because California doesn't really matter, right? California is part of Super Tuesday. OK. So you should make a Super Tuesday t-shirt on that Tuesday. Only sell it on that Monday. It's pretty much decided by then what's going to happen. It's like Romney was definitely going to win or whatever. I mean, Clinton and Obama were decided on Super Tuesday, but in 2008. But I was important and people dumped money into Iowa and New Hampshire. Those are the two states, really, because those you have to win one of those states. It's like you don't if you don't win one of those states and you get all the way through Florida and then when you're done. And that's like when people start dropping out, because if you can win in Iowa or New Hampshire, then you're going to start convincing donors to give you more money and big, powerful businesses to",
            "start": 3743.28
        },
        {
            "text": "And that's like when people start dropping out, because if you can win in Iowa or New Hampshire, then you're going to start convincing donors to give you more money and big, powerful businesses to get behind you. Whatever. If you have to go all the way to South Carolina or Florida to win, which is something like Jeb Bush is probably gonna have to do. You're going to be in a lot of trouble. The problem is, is that New Hampshire is super libertarian and Iowa is super evangelical. So the people that win those two states are typically not the right person for the party. Right. For instance, Rick Santorum won Iowa in 2012, who had no prayer of being the nominee at all. No prayer. But he won Iowa anyway. It was a statement. Who won in 2008? Mike Huckabee, who was like another guy who had no prayer. So it's just important. New Hampshire really is a more grounded place. New Hampshire is paleo conservative and more Rockefeller conservative kind of state. So if you win New Hampshire, you have a",
            "start": 3778.28
        },
        {
            "text": "So it's just important. New Hampshire really is a more grounded place. New Hampshire is paleoconservative and more Rockefeller conservative kind of state. So if you win New Hampshire, you have a lot of credentials. And then you go to South Carolina, Florida. Gotcha. Right into the other states and Super Tuesday. But so I like that system. It's weird. It's weird. When there was a time when South Carolina was trying to go first and there's like all of this procedural traditional order. And they're like, no, you can't. It's like E3 press conference. Yeah, like you can't. So you can't go after. So you can't go before Microsoft and New Hampshire can't go before Iowa. Iowa also caucuses. It's not technically a primary. But so that's just a brief aside for the nerds out there. Do you see a set of circumstances in the future where you would vote for Jeb Bush? No, no. Do you think he has a chance to be a strong candidate? Is he a contender? No, definitely not. Is Romney back in it?",
            "start": 3818.28
        },
        {
            "text": "set of circumstances in the future where you would vote for Jeb Bush? No, no. Do you think he has a is he going to be a strong candidate? Is he a contender? No, definitely not. Is Romney back in it? Romney, I think, is going to come back. He's going to come back. I like they apparently had. So he was going to who was announced already. Hillary. Hillary announced Hillary announced. And Bernie Sanders announced on the left. I think that's it. OK. And on the right, maybe O'Malley. No, no. Chris Christie, the governor of New Jersey, coming in with a shot. No, Rand Paul's declared. Marco Rubio's declared. Ted Cruz is declared. And nut job. And I think that's basically everyone that's evangelical. No, he's not. He's like the Texan senator who's like he's evangelical. But he's just he's just a little too much. And by a little, I mean a lot too much. There's going to be other people in there. Chris Christie will declare eventually. Who was the one with the with the bridges? The guy in the bridge",
            "start": 3857.28
        },
        {
            "text": "too much. And by a little, I mean a lot too much. There's going to be other people in there. Chris Christie will declare eventually. Who was the one with the with the bridges? The guy in the bridge controversy. Chris Christie. Who's my dude? He's my dude. Even though he likes to shut down bridges. He didn't do that. He didn't do that. Colin doesn't drive. So he doesn't care about bridges. No, no, no. He didn't do that. His staff did, though. And you have to have control over your staff. There's definitely something we said. I mean, yeah. Chris, Chris. I like Chris Christie because he just does his thing and just says what he means. I kept saying early on that before the bridge gate happened, that Hillary Clinton and Chris Christie would be a fucking incredible, incredible, incredible, incredible season for for the summer and the fall. Like those debates would be insane. Those debates would be fucking insane. But I don't think I don't think and like Romney destroyed Obama in the first",
            "start": 3901.28
        },
        {
            "text": "season for the summer and the fall. Like those debates would be insane. Those debates would be fucking insane. But I don't think I don't think and like Romney destroyed Obama in the first debate. But then Obama kind of schooled up and it was a very boring, very I love that if you just replaced those names with wrestler names, everything. No, you understand. Like when Obama ran, I legitimately got into it. And I was I watched every debate and I was it became almost two people who are really into politics. It's like a sport. It's like the Super Bowl because it only happens every four years. And so it's one of those things like just like the Olympics. But it is it is a big, epic event. Yeah. That like every four years happens. And if you're in any way, shape or form interested in it, it is. Yeah, it's fascinating in general. So fascinating. Like the debates are awesome. It's just hard because from it, like looking from an outsider's perspective, someone who's not maybe politically",
            "start": 3935.28
        },
        {
            "text": "It's fascinating in general. So fascinating. Like the debates are awesome. It's just hard because from it, like looking from an outsider's perspective, someone who's not maybe politically energized or charged is the same for me with like football. Or I'm like, sure, I'll watch the Super Bowl. But like I'm watching the regular season. I don't know who these teams are. I really don't really know quarterbacks. Baseball. Forget about it. I'm not going to. I don't even know who's playing for the Giants other than Hunter Pence because we know him. Right. But yeah, it's one of those things where like it's not it is like a sport. It's unlike a sport, except in the fact that it actually has real consequences if we put the wrong person in office. I.E. we might go to war or the you know, our states and our entire country might face bankruptcy. But so it's fascinating. It's like basically the Super Bowl, if it were the Super Bowl and Hunger Games together. That's how I view political",
            "start": 3978.28
        },
        {
            "text": "our states and our entire country might face bankruptcy. But so it's fascinating. It's like basically the Super Bowl, if it were the Super Bowl and Hunger Games together. That's how I view political elections. It's live or die. OK. Do or die. Sure. Join or die. Join or die. Vote or die. Vote or die. P Diddy. What do you think, Greg? Yeah. Energized? No, not for the primaries. Like I said, I'm not going to vote. I'm interested to see what happens in Seattle. And that's when the primaries. Hillary, for sure. And then, yeah, Republican. I don't know. It's tough. I'm still not convinced Hillary Clinton's going to win. Who's going to use serve? I think I think if Elizabeth Warren gets in, she's going to win the primary. I really think that this is the right if the right people get involved in this way, keep telling people, because I know they're tired of the shit and stuff like that. But you know what? Like. How do I put this eloquently? We've had the wrong person in office for 16 years",
            "start": 4014.28
        },
        {
            "text": "this way, keep telling people, because I know they're tired of the shit and stuff like that. But you know what? Like. How do I put this eloquently? We've had the wrong person in office for 16 years, you know, maybe more. And like it's because people get fed a bill of goods that is media driven and biased and all these kinds of things. The fact of the matter is Bush probably shouldn't have won in 2004, but they just had them vote for Kerry and they ruined him. Right. They totally ruined John Kerry. And it was and it was and people who don't know what swift boating is should look it up. Like that was a very serious line of attack on a man who served in Vietnam. What did they do? He was like, like, burn his medals and like, yeah, he was like all these like the renounced like the war. Like there's like crazy footage of him in that in that the Vietnam documentary I watched on Netflix, where it's actually him in front of Congress or some",
            "start": 4050.28
        },
        {
            "text": "Like there's like crazy that there's great footage of him in that in that the Vietnam documentary I watched on Netflix, where it's actually him in front of like, I don't know if it's Congress or some hearing. And he's in his like he's in his fatigues and he's talking about how horrible the war is and how we should not be there. And it's like, holy shit, that's that guy. Like 30 years later, would run for president. Yeah. And like that's that was I mean, there's there's a lot to the story. But the fact is, is like and the same thing with Bush and Gore. I mean, like. I wanted Bush to win that election when I was in high school, whatever, and that happened. But like he the election was kind of stolen and like, I don't know, like how anyone can possibly think that there wasn't some shady shit going on in Florida and Ohio. Well, Florida and Ohio in 2004. But and then you've got Obama who was basically like anointed by the media. And, you know, Clinton was probably and I would say certainly",
            "start": 4095.28
        },
        {
            "text": "going on in Florida and Ohio. Well, Florida and Ohio in 2004. But and then you've got Obama who was basically like anointed by the media. And, you know, Clinton was probably and I would say certainly the better candidate for like someone who had experience. And she was ruined because, you know, she she she was the anointed one, which is what's happening or again, which is why it's so dangerous. And then in 2012, Mitt Romney was made to look to look like an idiot because the media like just kept talking all this shit about him. And that's why he destroyed Obama in the first fucking debate, because no one knew who the hell he was. Yeah. And that was the only thing you knew about him was he was like Mormon. Right. Which they blew it out of proportion that he was Mormon. He's a Mormon. I'll be scared of the Mormon, be scared of the religious guy. And also I'd also be scared of the guy with the business. And he runs Bain Capital and they lay people off and all this kind of thing. And then",
            "start": 4130.28
        },
        {
            "text": "scared of the Mormon, be scared of the religious guy. And also I'd also be scared of the guy with the business. And he runs Bain Capital and they lay people off and all this kind of thing. And then he goes in and he's like, this is the first time anyone sees him. And he destroys Obama. Yeah. Yeah. You know, and the media. So insanely good looking. Yeah, he is. But that was he looks and he looks like a president. You drive to a Batman comic book. Oh, no, he looks like the president. And that's like the kind of I'm not saying he didn't. He ran a bad campaign, all those kinds of things. But I'm saying like the media spins and has complete control over things. Yeah. And what I want to happen for fucking once is for is for people to get together and be like, no, it's not going to be Hillary Clinton and it's not going to be Jeb Bush. We don't have royal families in the United States. We're going to get Elizabeth Warren on the Democrats and we're going to get Rand Paul on the on the Republican side",
            "start": 4171.28
        },
        {
            "text": "Clinton and it's not going to be Jeb Bush. We don't have royal families in the United States. We're going to get Elizabeth Warren on the Democrats and we're going to get Rand Paul on the on the. And then we're going to have a socialist and a libertarian run for president and one of them is going to win. Yeah, it's not going to happen. But that requires it. That's the thing that bothers me. It can it just requires people to pay attention. But then even if it does, like I hate this thing like Obama. Hey, there's just so much money behind these people. So much money. I forget what the last fundraising tabulation was for Hillary Clinton, but what is it? Isn't she like trying to raise like three or four billion dollars like that for a campaign? Incredible amount of money. It's insane. Slush fund they have. The foundation. The problem with that is once they they can say whatever the hell they want until the president. And it comes time for all those checks that you just cashed, you got to repay",
            "start": 4199.28
        },
        {
            "text": "have. The foundation. The problem with that is once they they can say whatever the hell they want until the president. And it comes time for all those checks that you just cashed. You got to repay those somehow. Right. And this is what they say about Obama is that Obama had all these great ideas for you in office and couldn't execute on any of those because they want that back. You know, you're backed by big oil, so you can't end wars. We're going to protect big oil in the Middle East because we paid you and we bought this thing for you and you have to repay us. Now, you're in office because of us. You got to repay us. So I don't know. It would be fascinating if someone you know, that's why you always bring up Ross Perot. That would have been fascinating. Like you guys beholden to no one who can set his own policies and push those through. That was that was and that was why the 1992 election is so fun and so funny to read about and interesting and fascinating. One of one of the most",
            "start": 4246.28
        },
        {
            "text": "who can set his own policies and push those through. That was that was and that was why the 1992 election is so fun and so funny to read about and interesting and fascinating. One of one of the most fascinating elections ever. A man who is independently, he's a billionaire. He spent all his own money and he almost won. And yeah, money drove that. But it had to because the Republicans and Democrats both wanted to squash him. And it was way worse. It was it's way worse now than it was then. So for someone like him to come through, he was able to buy TV time and do all these kinds of things. Probably didn't choose the best running mate in James Stockdale. Who was his running mate? Admiral James Stockdale. There's famous. Well, I'll bring these. There's awesome. I don't even know why I'm here. Yeah. There was awesome clips. I was like, oh, man, what are you doing? But even when I was like a kid watching this, I was like eight years old and I was like, oh, Jesus. Do you remember Ross Perot when you",
            "start": 4282.28
        },
        {
            "text": "Was awesome clips. I was like, oh, man, what are you doing? But even when I was like a kid watching this, I was like eight years old and I was like, oh, Jesus. Do you remember Ross Perot when you were good lord? You were like, what, three. When were you born? 89. Yeah. So you're three years old. You don't remember. He was crazy, but awesome. No, he was awesome. You have like charts and graphs like he was a businessman. He was like, hey, I want to show you right now. They have these charts. Yeah. And he and he and in the summer, so in the summer, 92 was Bush, Clinton and him. And he was splitting the vote with both parties and he was winning. He was fucking winning like and he dropped out of the race for some reason. And then he decided to come back in and it was too late. But he still won 20 percent of the vote. Can you imagine a third party getting 20 percent? That was why Clinton was elected and not Bush, because he was taking more conservative votes, obviously. So it money is a big",
            "start": 4320.28
        },
        {
            "text": "20 percent of the vote. Can you imagine a third party getting 20 percent? That was why Clinton was elected and not Bush, because he was taking more conservative votes, obviously. So it money is a big player in politics. There's no doubt the biggest player. But it's that's an excuse also, because that's the way you get to lazy people through commercials and radio spots and all these kinds of things. If you engage and work your way through the bullshit and see the candidates, then the money doesn't matter. Money hasn't bought me shit. I actually donate. I donate to Ron Paul. I donate to Mitt Romney. So I understand that they need money. But if you can cut through the bullshit. Then you get to different conclusions. Sure. Elizabeth Warren is an incredibly powerful speaker, and she I don't think she wants to run, because frankly, I think she's afraid of not going head to head with Clinton, but of damaging Clinton because Clinton can win. And I think she's",
            "start": 4353.28
        },
        {
            "text": "Greg Miller, and she I don't think she wants to run, because frankly, I think she's afraid of not going head to head with Clinton, but of damaging Clinton because Clinton can win. And I think she's pragmatic. That's the problem is the Clintons are I mean, you say we don't have royal families here, but they are a royal family. Everyone loves Bill, you know, and they you think about the layman. You think about the person that's out there that maybe doesn't really want to read up on the issues. And I'm using you as an example here, Tim Gettys, because I know you're probably not going to read Politico. Do you know Elizabeth Warren? Have you heard of Hillary Clinton? That's the problem right there, right, is that she's the loudest. She is the one who's been she has been running for the presidency for the last 16 years. Right. Like ever since Bill was a senator. Yes. No. Governor. She's been aiming for this. She's an incredibly smart person. She's an incredibly rich person. And they have been doing",
            "start": 4395.28
        },
        {
            "text": "last 16 years. Right. Like ever since Bill Clinton was a senator. Yes. No. Governor. She's been aiming for this. She's an incredibly smart person. She's an incredibly rich person. And they have been doing they have been building their way toward this for forever now. So it's like there's no doubt it's almost clandestine almost. Someone sees it. There's no doubt that during the impeachment hearings and all that, she was like, listen, like, we're not we're sensibly not married anymore. It's the same thing that happened with FDR and Eleanor Roosevelt. Like, we're sensibly not married anymore. I'm staying with you because I can ruin you when you're out. I'm running for senator in New York. You are going to get me through that and then I'm going to become president and you are going to stand by me and we're going to make this happen. If you don't do that, I'm going to ruin you. Yeah. And that was and I'm sure those conversations are guaranteed. So so that's what happens. That's completely not",
            "start": 4433.28
        },
        {
            "text": "we're going to make this happen. If you don't do that, I'm going to ruin you. Yeah. And that was and I'm sure that those conversations are guaranteed. So so that's what happens. That's completely not in love. They do not care. That's the conversation that happens after like year two of marriage to my wife. So you sit down with your wife. She's like, I'll fucking ruin you. You know, I'm just joking. I'm sure I can't be a fly on the wall. The White House in 1999 or 2000, man, like, like, I like I mean, it was unbelievable. Like he almost got impeached and all that stuff is very historic. Well, yeah, there was there was but that wasn't because of the sexual stuff. It was because of Whitewater. Right. Well, he just lied about it. He lied under oath about Monica Lewinsky. So it wasn't even the act of him. It was that. But it depends on what your definition of Whitewater was. Earlier, Whitewater was bad, though. White water is really bad. But they got that was a real estate boondoggle.",
            "start": 4473.28
        },
        {
            "text": "Act of him. It was that. But it depends on what your definition of Whitewater was. Earlier, Whitewater was bad, though. White water is really bad. But they got away with that. And that goes way back to like their time in Arkansas. But this was over this was specifically over the hearings over Lewinsky in which he lied. And I did not have sex with that woman. But they didn't obviously impeach him. Ken Starr, all these like fucking random ass people that were awesome name for a senator and a porn star. Ken Starr was the special prosecutor. Remember, he was a star reporter, like wanted Clinton. He like wanted to kill Clinton. That's also how Judge Judy came to prominence because Judge Judy broke the story of Monica Lewinsky. Time passed on it, which is the famous thing. I have no idea why. Why do I have to maybe want to protect him. And that's what I'm talking about. About with biased media. Nonetheless, if you get through all the",
            "start": 4507.28
        },
        {
            "text": "on it, which is the famous thing. I have no idea why. Why do I have to maybe want to protect him. And that's what I'm talking about. About with biased media. Nonetheless, if you get through all the bullshit, you get to someone like Elizabeth Warren and people. She's fascinating. She she's the she's the populist. You don't have any of those anymore where she's like, the game is rigged. That's like our whole thing. Like the game is rigged. It is rigged against you. You will never win. You know, in the system, the banks don't care about you. Big business doesn't care about you. The government doesn't care about you. If she could just say that and people listen, she would win her primary. Rand Paul's on the other side saying, listen, the government's too big. They steal all your money. They're all up in your business. Who cares what the government thinks about this? That and the other thing. We don't want the government in our lives at all. If people paid attention to him, he'd win. And",
            "start": 4545.28
        },
        {
            "text": "all up in your business. Who cares what the government thinks about this? That and the other thing. We don't want the government in our lives at all. If people paid attention to him, he'd win. And what would that fucking election look like? That's a real choice. You know what I mean? And that's what I want. I want that election so bad. All it requires, even if Elizabeth Warren won, I would accept it. And I think she probably would, you know, because her like, listen, her speak. She's very she's, I think, more eloquent than Obama, even. And she has more resonant things to say. And she's not, frankly, a liar like Obama has proven himself to be. Because like you were saying, he's beholden to all these special interests, which she is not. You know what I mean? So that's all that requires. That doesn't require money. That requires you to pay attention. And frankly, if she just ran and was on a primary stage with Hillary Clinton, that's all the exposure she needs. She would go all. Maybe",
            "start": 4578.28
        },
        {
            "text": "doesn't require money. That requires you to pay attention. And frankly, if she just ran and was on a primary stage with Hillary Clinton, that's all the exposure she needs. She would go all. Maybe Warren would go fucking ham on Hillary Clinton. And that would and that was hard, though, man. I mean, Clinton is like, I mean, you're talking about people like that, like they're fighters. Right. But if you were talking about the UFC fights, I mean, Clinton's been she's got like that 33 and one record. She is knocked out almost all of her opponents. She might not be the best fighter. She might be the person that deserves to win, but she'll find a way, you know, and that's she's a scary human being. No, she's she's very she is a political beast. And I have no doubt. I have little doubt that she'll get through. But I hope that she doesn't. And I feel like she might not. I feel like there are other candidates that can be Bernie Sanders. Bernie Sanders is an interesting dude. He's a senator from",
            "start": 4611.28
        },
        {
            "text": "get through. But I hope that she doesn't. And I feel like she might not. I feel like there are other candidates that can be Bernie Sanders. Bernie Sanders is an interesting dude. He's a senator from Vermont. Vermont is called the People's Republic of Vermont for a reason. It is very weird place. I don't know if a lot of people probably haven't been there. I've been there many times. He's a socialist. Straight up like he doesn't describe to be a Democrat. He caucuses with the Democrats, but he is a socialist. You know, interesting. And he's running. So like maybe it's time to hear some different voices and try to get some different opinions. But what you're gonna end up getting is Hillary Clinton, who's in the center, maybe slightly to the left, but not really. She's really not a Democrat. And you're gonna get some like Jeb Bush or fucking Marco Rubio or some boring ass like who can't like people. I don't say anything. And they say that they say that they say that thing where they're",
            "start": 4650.28
        },
        {
            "text": "And you're gonna get some like Jeb Bush or fucking Marco Rubio or some boring ass like who can't like people. I don't say anything. And they say that they say that they say that thing where they're just kind of talking around issues and they're saying exactly what you want to hear. And you're like, you're not going to do that. You're not. That's what I like about Romney, because Romney came at it when he was in that first debate where he was like, no, I'm a business person. You want to solve like the biggest problem in our economy right now. You want to solve the issue. Here's how you do it. Same way I would solve an issue at my multi-billion dollar corporation. Like, well, here it is. Everyone was like, huh? You know, it's not like it's not like the grandstanding shit that most politicians bring to the table. None of this stuff. Well, he did. I think he did this. You know why they do that, right? Because it's rude to point at things. Oh, that's exactly why. Like, you can't you don't",
            "start": 4682.28
        },
        {
            "text": "bring to the table. None of this stuff. Well, he did. I think he did this. You know why they do that, right? Because it's rude to point at things. Oh, that's exactly why. Like, you can't you don't do this because that's an aggressive gesture. Everyone does that. They do that or they point with. Like this. Yeah. Disneyland made that popular. I can't back that up. But if you go to Disneyland, they actually never point. They either go full hands or or this because apparently I guess maybe it's another in other countries. Like if you do this, it's like, hey, give me all your money. Maybe that's just in New York. Yeah. Welcome to welcome to the United States. Yeah, I don't know. I just want I feel like this election has the ability to be transformative. I really do feel like this can be 1976. This can be I mean, or 1980. This can be 1912, like really big, really important or 1932. Big important elections that are like that that matter that have really weird people. And for that, if you",
            "start": 4714.28
        },
        {
            "text": "This can be I mean, or 1980. This can be 1912, like really big, really important or 1932. Big important elections that are like that that matter that have really weird people. And for that, if you don't know, since they're laughing, 1912 was a three-way race between Teddy Roosevelt Taft and Woodrow Wilson. 1932 was between the incumbent Hoover, who was responsible for a lot of the depression versus FDR. 1980 was Reagan, who's been trying to run for president ever, destroying Jimmy Carter, destroyed him in like one of the worst fucking like a. I want people to go look at that electoral map. You'd never you'll never see a map like that again. It is red. People didn't like the entire fucking map. Carter was terrible. Oh, Carter was awful. That's what I'm saying. You need and Frank, I don't think Obama's terrible, but Obama's a bad president. So like so you need this is this has the ability to be a transformative sort of election. People must engage. Well, then that's the thing. That's",
            "start": 4757.28
        },
        {
            "text": "think Obama's terrible, but Barack Obama's a bad president. So like so you need this is this has the ability to be a transformative sort of election. People must engage. Well, then that's the thing. That's the wild card right there is this is the height of social media now. Granted, when Barack Obama ran, social media was in full steam as well, especially this last time he was the incumbent. But like, that'll be really telling to see how all these candidates use social media, like Twitter and Facebook. You guys know social media isn't going to define that for you. We're clearly amazing at it. It'll be fascinating. It'll be fascinating to see Hillary Clinton's Instagram. I mean, they're going to do it right. They have to go on Twitter, selling that poster with her on her cell phone when she wears sunglasses like she gets it. Yeah. But to me, it's like Hillary Clinton is fake. She doesn't answer questions from the media. She's very scripted. She has way too much money to the point where",
            "start": 4799.28
        },
        {
            "text": "on like she gets it. Yeah. But to me, it's like Hillary Clinton is fake. She doesn't answer questions from the media. She's very scripted. She has way too much money to the point where she has just people surrounding her all the time. She kept her personal emails on her personal server. Yeah. Also, there's all the scandals like the way they're going to rip apart her using her personal email at State and then Benghazi and all that kind of stuff is going to be a disaster for her. But I think she probably gets through. But she's going to get through it. But if people engage, then she doesn't. And this is the thing I've been trying to tell people. It's not because it's a Democrat that is like the presumptive nominee this time. It's just that why are you letting the media tell you who's going to win? You choose. And remember that in 2008, they did the same thing and people chose and they chose and I feel like it was it was a rubber band effect against the media. The",
            "start": 4837.28
        },
        {
            "text": "tell you who's going to win? You choose. And remember that in 2008, they did the same thing and people chose and they chose and I feel like it was it was a rubber band effect against the media. The only reason Obama won is because they didn't want Clinton to win because the media was saying, like, Clinton's going to win. So like, no, he's not. You know, like ultimately, you don't choose that. We choose that. And I think that that really helped Obama, not to mention he was a very great speaker and all that kind of stuff. But he was supposed to lose. You know, I don't think he was extraordinarily great at the debates and all that kind of stuff. People have to kind of go back and watch and remember these things. But I don't know. So I think that it's. Engage and this thing will be this election will be awesome. Like, I'm so excited about this election. Yeah, but I'm going to be so fucking bummed if it's Clinton and Bush. You have to be kidding me with this shit. Now, it's both of them at",
            "start": 4877.28
        },
        {
            "text": "will be awesome. Like, I'm so excited about this election. Yeah, but I'm going to be so fucking bummed if it's Clinton and Bush. You have to be kidding me with this shit. Now, it's both of them at the same time. And then eventually one of them will have a child, Chelsea, who will be old enough to run and she will run 20 years. You know, how old do you have to be a president? 35. Chelsea's, I think, my age. So I think she is maybe 35 now. Yeah, she could be. Maybe the VP. She'll be next. Not the VP, but she'll be 20 years from now. Like, that was a real that was a real statement for me. That's hilarious. No, they'll pick some old white guy, probably. Lieberman back at it. To your guy's point, I mean, there was an awesome piece not too long ago that I was reading where it was like, Rand Paul is already falling into the trap of having to win the primary. You know, like he's already sounding like a Republican again, like saying things that he doesn't mean. And like, and I'm like, this is",
            "start": 4912.28
        },
        {
            "text": "is already falling into the trap of having to win the primary. You know, like he's already sounding like a Republican again, like saying things that he doesn't mean. And like, and I'm like, this is just like what happened with Mitt. Yeah, like where it's like they have to say things to win. And like, that's the bummer. But that's the unholy alliance that is the Republican Party. I know because I'm part of it. It sucks. You have to the fucking evangelicals need to hear what they need to hear. The fiscal conservatives need to hear what they need to hear. The libertarians need to hear what they need to hear. And it's just like and at the end, you're just like, all right, I don't even know what you mean anymore. But I still think that one side, at least one side will get the nominee you don't think they're going to get. I hope so. And I think that unfortunately, if it's someone if it's something like Clinton and a random Republican guy or whatever that shouldn't win. Clinton's going to get",
            "start": 4954.28
        },
        {
            "text": "think they're going to get. I hope so. And I think that unfortunately, if it's someone if it's something like Clinton and a random Republican guy or whatever that shouldn't win. Clinton's going to get a steamroll. So you've got to be careful about that, too, if Clinton's becoming presumptive, then we need someone like Mitt Romney to jump back in. Like that's and I think that that's going to happen. Like Mitt Romney was going to run and then he wasn't going to run. And then he just last week had a had a meeting with a bunch of political strategists and donors in Utah. And like he's going to run. Like, I think he I think he looks at the landscape and he's like, no, I got to do this for my party and my country. I'm just afraid. Watch my documentary. I'm just afraid he's going to become more like an Al Smith figure or something who like a guy that just like runs over and over again and loses. And then that's like all he's going to be known for. It's not going to be known for like the",
            "start": 4989.28
        },
        {
            "text": "like an Al Smith figure or something who like a guy that just like runs over and over again and loses. And then that's like all he's going to be known for. It's not going to be known for like the things he did, the better things he did. The businessman he was, it's just like he ran for president three times. Yeah. Yeah. But and he has the stink on him now, which is unfortunate. The loser. When he when he lost the primary, he was he didn't have the stink. But when you lose the general, you do have the stink. And it's and it is very rare for some think might be my favorite phrase. It's a real thing at the stink. Oh, it's real. Anyway, I hope people out there engage. I hope you guys engage, too. And remember, like it's so much deeper than Clinton and Bush. These these fields are way deeper. This is the deepest field on both sides that I've seen in a long time, actually. And so remember Howard Dean? Oh, I'm going to forget. I do remember how you remember. Oh, my God. Well, if you guys are",
            "start": 5024.28
        },
        {
            "text": "is the deepest field on both sides that I've seen in a long time, actually. And so remember Howard Dean? Oh, I'm going to forget. I do remember how you remember. Oh, my God. Well, if you guys are too young to remember, go watch Howard. That was not long ago. It was 2004. Go watch Howard Dean's concession speech when he lost the New Hampshire primary, which was one of the great political meltdowns on national TV you would ever see in your life. You saw a man who was maybe going to win the nomination just crumble and become a joke in two minutes. It is one of the greatest political meltdown videos you could possibly watch for the modern era. You guys had to go look at Michael Dukakis in a tank. My turn for topics. Mine comes from Patreon. This one comes back for once again. Sure. Daddy had a lot of coffee. OK. Or you can say it's topic. I know I can't because you can't. All right. My topic. We're back from next break. This one comes from Patreon dot com slash Kinda Funny.",
            "start": 5058.28
        },
        {
            "text": "We're back from next break. This one comes from Patreon dot com slash kinda funny. You can go there, you can sponsor us there, you get your topic read just like Omar did. Omar's topic is what thing I'm sorry, what thing that sucked would you go back and fix? Specifically, what movie slash TV show slash game that was flawed would you go back and make right in this situation? The thing that sucked would have never existed, your product would be the fixed version but the original it was. I want to be that you're remastering it, you're erasing the knowledge of the original and you have this now. I mean, sorry. Star Wars. All right, easy answer. Let's not say that. That's how you sound right now. Yeah, that's how I meant. I mean, Star Wars. Star Wars came to mind for me. Superman. It's a little trite. Yeah. Yeah. I would have gone with one of the Superman. I don't know why I",
            "start": 5101.28
        },
        {
            "text": "Sound right now. Yeah, that's how I meant. I mean, Star Wars. Star Wars came to mind for me. Superman. It's a little trite. Yeah. Yeah. I would have gone with one of the Superman movies. I don't know why I would have taken the Man of Steel and built a universe around him. They're committed. They think it's good. Superman Returns. I would have come back and shown it to Bryan Singer. I've been saying, they cut out your first part and replace it with text. That's a terrible way to open a movie. Secondly, this is your only shot at it. Don't make a fucking boring ass movie. Have him punch something. Don't do the kid thing. Suck it up. The kid thing. Have James Marsden be Metallo and then we can all go from there. Yeah. That was one of those weird movies where you're like, he has an illegitimate child. Yeah. They wrote that into a Superman movie. Right. Then he left. Superman left for five years. He didn't know. Doesn't care about his son.",
            "start": 5144.28
        },
        {
            "text": "Superman left for five years. Is a deadbeat dad. No, that's a plot hole. You're jumping. Gone for five years. He didn't know. Doesn't care about his son. He didn't know. You're not allowed to say he doesn't care. How does Lois have the kid without it punching through her uterus? Now you're just taking them all rat logic. But there is logic to be sad there. I mean, it's one of those things where like it depends on what iteration of the thing we're going with and stuff. I know. Now we were in the Donner universe where as soon as he was on earth, he had powers. So yes. Great point. Would the would the sunlight that she had ingested the vitamin D then have gotten to his cells as well in a residual form? You'd think so. Because when he was a kid, he lifted the tractor so that Pa Kent wasn't killed by the tractor. Right. Or something like that. I might be remembering that incorrectly from Superman. Yeah. You're jumping. So the corn thing.",
            "start": 5180.28
        },
        {
            "text": "kid, he lifted the tractor so that Pa Kent wasn't killed by the tractor. Right. Or something like that. I might be remembering that incorrectly from Superman. Yeah. You're jumping. So the corn thing. There was the Pa Kent story was he was changing the tire right after they picked him up. Oh, right. And then it got off the jack and he just like he showed his dick. It is. Right. Kevin, you didn't say anything about his people. Kevin is moving this thing around. But I'll go back because Bryan Singer is a talented director. He's good. He does awesome. I like that. And I think he he thought he had more rope than he had with Superman Returns. I it would be fascinating. Again, you don't really know how things go off the rails. Right. There's so many people involved with the approval processes for films that you don't you can't blame Bryan Singer for. No, not at all. The guy knows how to make a good film. Days of Future Past. I liked a lot. It's a good movie. Usual Suspects was awesome. X2 was",
            "start": 5218.28
        },
        {
            "text": "films that you don't you can't blame Bryan Singer for. No, not at all. The guy knows how to make a good film. Days of Future Past. I liked a lot. It's a good movie. Usual Suspects was awesome. X2 was awesome. Jackman's. It was good enough. He had unfortunately the problem with X2 that he had to follow up X1, which was like they kind of set up all the characters in a weird, wonky way. But it was good. It was it was cool film and it was action was great. I liked how they treated Wolverine. What was your name? Lady Deathstrike. Yeah. She's a little weird. But Hugh Jackman. Yeah. I'm talking about what's up. A mistake. She had that she's like bottoms up and like she puts the shot in the guy's butt or the part where she like slides. She's like, oh, that's cool. Nightcrawler in general. He's a good storyteller. He's a great director. But it's one of those things where you're like, you don't know how he wound up with that script. I don't know if he was like, look, we shouldn't do this. And people",
            "start": 5260.28
        },
        {
            "text": "He's a great director. But it's one of those things where you're like, you don't know how he wound up with that script. I don't know if he was like, look, we shouldn't do this. And people are like, no, no, no, this is going to play. The way I understand it is that he I mean, from the involvement in watching it and how the comic book he tied into and everything is, it was just going to be even longer like he had he had filmed all the stuff where Superman went out to Krypton in the spaceship. And I think from what I understand, maybe I'm just maybe I've heard rumors. I can't verify this isn't from first hand is the studio watched this like three hour Superman movie was like, get him to fucking earth. Nobody wants to see him flying around. And that's why it opens up and it's like Superman has been gone for five years. Krypton was they thought destroyed, but it's back. No, it's not. All right. Superman's been gone. That's what it says. Yeah, it's just terrible. That's that's crazy to me",
            "start": 5306.28
        },
        {
            "text": "been gone for five years. Krypton was they thought destroyed, but it's back. No, it's not. All right. Superman's been gone. That's what it says. Yeah, it's just terrible. That's that's crazy to me because that's way more like that story element would have been way more fascinating to watch because we've never seen that on film. Like actually him trying to go and find Krypton and potentially finding what he finds it all split up. And he says in the movie, all he found was a graveyard that that would have been cool to start there or see that in opening credits, something like that. And then see him coming back. I mean, a good example of everything that it cut to is like Cal from Harold and Kumar. Right. Yeah. He says nothing. No, he has no one line in the comic books. You read talking left and right about all this stuff. And there's this backstory about a help Luther in in in the prison and all this other stuff. And it's just like, well, now we need to shave time off this",
            "start": 5337.28
        },
        {
            "text": "talking left and right about all this stuff. And there's this backstory about a help Luther in in in the prison and all this other stuff. And it's just like, well, now we need to shave time off this movie. So all of Lex's companions are silent idiots. Yeah, they were all silent. And it's simply got to have the wicked tattoo on the back of his head. That was kind of weird. It was like a tattoo of a demon. That's one of those that I that would have been cool to go back and and sort of remake if you could go back to that. Just tell her. Just tell him this is what's up. You got to correct your course. I mean, it's it's so again, it's I always kind of hesitate to criticize, especially a film that's that important, because at the time that was a very, very big film. Yeah. Like you think of it now. You're like, oh, we got Man of Steel. We got every single comic book movie. Sure. At the time that Superman Returns comes, you saw that trailer and you were like, oh my",
            "start": 5373.28
        },
        {
            "text": "now. You're like, oh, we got Manistee. We got every single comic book, frickin' movie. Sure. Sure. Sure. Sure. At the time that Superman Returns comes, you saw that trailer and you were like, oh, my God, this is going to be amazing. This has to be amazing. There's there's no it can't be not good. It was just like Star Wars. We were like, this is going to be the greatest film ever made. And so, of course, you're going to there's going to be some letdown to some degree, like spoilers. Every film that we see from now on is not going to be as good as Avengers. It's not going to be as good as Dark Knight Rises or excuse me, Returns not Rises, because you just because it's so hard to live up to that. Right. But back when Superman Returns came out, you were like, wow, we haven't seen a Superman film since the Donner film or since Superman: The Quest for Peace. Right. Yeah. Which was Superman. So, yeah, but I mean, again, when you're making something, when you're in the thrust of it and when",
            "start": 5414.28
        },
        {
            "text": "Superman the Quest for Peace. Right. Yeah. Which was Superman. So, yeah, but I mean, again, when you're making something, when you're in the thrust of it and when you're in the in the middle of making something, you don't have that perspective like you do. So, you know, 10 years later, sitting in a podcast room with your three friends going like, oh, you should have done this. No, I get that. But that's what that's what we can bring to him. So, yeah, if you're time traveling, you can tell him like that the movie does not pan out. Well, you need to adjust course. Going back, I would have said, look, here's what you need to do. Same with what I would tell, you know, anyone who's writing that film is you've got to find a way to have a really convincing villain, like someone who is really ominous and really, really imposing. And someone that has dimensions that's not just a high. I'm going to make another continent. It's like, what? What? Like, no.",
            "start": 5447.28
        },
        {
            "text": "villain, like someone who is really ominous and really, really imposing. And someone that has dimensions that's not just a high. I'm going to make another continent. It's like, what? What? Like, no. Remember the one the one storyline I've had since the original Superman movie? I'm doing it again. That's so like, like based in one dimensional, right? Like, yeah, it doesn't make any sense. And you start to think about the iconic villains, like every great hero story has to have a great villain or else. What is the point? What is he fighting against? What is he striving toward? You start to look at like like Darth Vader, for instance, where on a very ancillary level. Yeah, sure. He's one dimensional. He's a bad guy, but he's not because eventually he starts taking on a whole new dimension in The Jedi. We're like, he's actually torn now. He's trying to save his son. And the only way he can save his son is by inducting him into the dark side is bringing him over because that's the only way he",
            "start": 5482.28
        },
        {
            "text": "Jedi. We're like, he's actually torn now. He's trying to save his son. And the only way he can save his son is by inducting him into the dark side is bringing him over because that's the only way he can think to save him. He doesn't see another option because he's so closed off. He's lived this life for so long. And now that his son chooses death over coming to him, finally he sees. There is a third option. There's another way I can sacrifice myself to save my son. Boom. Empire Strikes Back - Emperor Palpatine up on the thing. Why did all he could do was choke him. There's a man who could like lift a fucking star destroyer with his brain. What's going on? I just always be on me. I mean, like you're reading a little bit into the performance and stuff, but I like it. I like that you are because I always think back to just how emotive he was in that scene of The Empire Strikes Back. For those of you listening at home, Greg has pulled his shirt over his face. It was worth it, God damn it. Physical comedy is never easy. By the",
            "start": 5526.28
        },
        {
            "text": "back to just how emotive he was in that scene of. For those of you listening at home, Greg has pulled his shirt over his face. It was worth it, God damn it. Physical comedy is never easy. By the way, I wanted to show me real quick. I was laughing earlier when you said it's hard to say how something would go off the rails. And I was like, have you listened to this show? Oh, no. But like, let's make no moat about it. This show is probably just a giant shit show for the outside viewer. So I would I would say that most people like watching this show because of because it goes off the rails so often. I mean, can we just appreciate for a second that we for 50 minutes talked about soda and then for an additional, I don't know, 40 minutes talked about hardcore politics. And now we're just talking about Superman. Yeah. And it all felt the same. That's crazy. These kinds of podcasts are a dime a dozen though. Right, Nick? That's a call back into earlier in the episode when Colin",
            "start": 5571.28
        },
        {
            "text": "about Superman. Yeah. And it all felt the same. That's crazy. These kinds of podcasts are a dime a dozen though. Right, Greg? That's a call back into earlier in the episode when Kevin and Colin have a rivalry now. My answer is definitely Transformers. Yeah. Yeah. I got it on eBay. Here's the problem with that, though. You go back and you go back and tell the producers. I forget who produces Transformers. Michael Bay? No, he's the director, but it's like, it's Don. Is it Brooke or is it De Laurentiis? I can't remember. I don't know. You keep talking, but it doesn't matter. You go back and tell them, hey, you got to change this movie or else it's going to be really bad, but it's still going to make a billion dollars or a billion dollars. They're going to like this. We don't give a shit. Yeah, but they don't care about the script. But they don't know. I know exactly. But that doesn't matter. That's not what this question is. Right. Question is, what would we change and fix? What I",
            "start": 5615.28
        },
        {
            "text": "Yeah, but they don't care about the script. But they don't know. I know exactly. But that doesn't matter. That's not what this question is. Right. Question is, what would we change and fix? What I would do is just make sure that they don't it all comes down to the character designs. If the character designs weren't so convoluted and just garbage messes of just like so much going on and I don't even hate on the designs. Like, I don't think they're that bad, but I just wish they weren't they weren't as complicated because if they were simpler, then they wouldn't cost as much money to animate all the CG, like all the fight scenes and stuff, which would have meant that the movie could have been about the Transformers instead of Shia LaBeouf and his girlfriend. Right. A bunch of stupid human subplots, like all of those movies. Biggest problem is the fact that it's not about the Transformers. It's very true. And so the reason they did that, though, is because it was so expensive to",
            "start": 5666.28
        },
        {
            "text": "human subplots, like all of those movies. Biggest problem is the fact that it's not about the Transformers. It's very true. And so the reason they did that, though, is because it was so expensive to animate the Transformers, which makes sense. But it's like if they were easier to animate and they like they weren't as complex and like every freaking shot with Optimus Prime turning like this involved 10 million moving parts because it's freaking neck out of freaking all this shit. If it was just more boxy and stuff, which I understand isn't like the aesthetic they were going for. But there is a nice middle ground they could have went with. The problem and the thing that you're talking about right now is that like is that by making them so complex, they don't have it's very, very hard for the audience to relate to them from a human's perspective. And you have to be able to do that with your characters. One of the reasons why a lot of people are really, really worried that they're going",
            "start": 5705.28
        },
        {
            "text": "Audience to relate to them from a human perspective. And you have to be able to do that with your characters. One of the reasons why a lot of people are really, really worried that they're going to make a Halo movie one day and have Master Chief because the same thing you're talking about with Vader. It's like, Steve, what's the Master Chief? He doesn't even have a face. It's just a glaring reflection. Right. And so it's hard for you to empathize with someone like that, especially when they're your main character. With the Transformers, part of... His name is Master Chief, which is like the worst name ever. That's very true as well. With the Transformers especially, they don't have eyes, looks at that and goes, this is a foreign object that's not a human. It has no soul. It's just something that's up there that I think I'm going to try to look at for until my eyes break. That's my problem with Transformers, though, with the movies is that I feel like that only really",
            "start": 5741.28
        },
        {
            "text": "It's just something that's up there that I think I'm going to try to look at for until my eyes break. That's my problem with Transformers, though, with the movies is that I feel like that only really happened because they were next to the humans and stuff. Like when all the best Transformers stories are usually told and humans aren't even involved and you just kind of forget about it. It doesn't matter. And my favorite thing about Transformers is that the best Transformers stories and the most cool things that happen don't involve them transforming or turning into anything. It's just them and they're just characters and they happen to be things that can transform, but they don't. They act as humans would act. So it's like, they could have done that if the writing was better and all that stuff. That's the other thing too. They were weird foreign aliens. They didn't feel like real things. They didn't have seemingly real emotions. They were just kind of there to protect the planet. And",
            "start": 5782.28
        },
        {
            "text": "Stuff. That's the other thing too. They were weird foreign aliens. They didn't feel like real things. They didn't have seemingly real emotions. They were just kind of there to protect the planet. And you were like, why can't you have a real... And then they had that weird goofy scene where it's like, oh, my bad. Yeah, there's so much force humor and all that stuff. But I even like that's what I would do, though, is change the character designs, which would then allow the Transformers to be the main character. That'd be great. If I couldn't do that, I think there was another option, which would just be build off of what they did with Transformers 1. I think they could have fixed things with Transformers 2 if they just kind of... That's not how sequels work. I know, but just built off of the framework that one was. One wasn't that bad. I liked one. At least set a world up so that two could have came in and built upon that and then been like, all right, cool. Now it is about the",
            "start": 5815.28
        },
        {
            "text": "of the framework that one was. One wasn't that bad. I liked one. At least set a world up so that two could have came in and built upon that and then been like, all right, cool. Now it is about the Transformers. Now we already have these convoluted designs made for seven, eight characters. We'll add three more. We already have them made. They built upon it when they put Robot Heaven in it. The big problem is this. The big problem is this. The big problem is this. In order for those big movies to make their money back, they have to sell in the foreign markets. The number one thing that doesn't sell well in foreign markets are really intricately told stories in English. That's why a lot of indie films just don't make money. The humor of a Zach Braff indie film doesn't really translate well into Chinese. China is the biggest market for consumers on the planet right now for anything, especially film. You want your film to sell and be really, really, really good for the Chinese people",
            "start": 5859.28
        },
        {
            "text": "into Chinese. China is the biggest market for consumers on the planet right now for anything, especially film. You want your film to sell and be really, really, really good for the Chinese people because they're the ones that are going to actually probably... That's where you're going to make your money back. The way that starts to work is that they start to go, well, we don't really give a shit too much about the story about this. What we need are eye-popping visuals, half of which need to take place in China because they're actually funding this film. That becomes a huge problem in that when you have a sequel, they're like, well, we need this done. We need to make in this quarter whatever, we need to make this certain amount of money so you have six months to get this done. What's the first thing that goes is the script, is the story. You can't spend three months crafting a nice story when they're like this. Famously that happened in Iron Man 2 where they were still shooting while",
            "start": 5900.28
        },
        {
            "text": "first thing that goes is the script, is the story. You can't spend three months crafting a nice story when they're like this. Famously that happened in Iron Man 2 where they were still shooting while they were writing the script. It was like, this is going to be chaos. There's no third act in that film. You go back and watch Iron Man 2 and you're like, oh, it's done. They just beat Whiplash. Cool. I'm Whiplash. I'm dead. And I say the same thing with Iron Man 1 as well. So that's the big problem with that. I think in order to fix that, there's a third option for you. Just redo the movie with all the original cartoon sound effects. Yes. And that would be amazing. As the movies go on, they kind of do... Not all of them, but they do add a lot more of that in the movies just to keep the people being like, oh my god, they used that sound. It is Transformers. Yeah, exactly. I got it on eBay. That's the only thing I remember from the original Transformers. I saw it in the theater with Mark",
            "start": 5947.28
        },
        {
            "text": "being like, oh my god, they used that sound. It is Transformers. Yeah, exactly. I got it on eBay. That's the only thing I remember from the original Transformers. I saw it in the theater with Mark Ryan. And that's the only thing I remember about it. Well, two things. One, the fight scenes are fucking garbage. They are muddled messes. I remember watching it and I'm like, I don't even know what the hell is going on. All these moving parts. I'm like, alright, you spent how much money making that? I have no idea what the fuck you're supposed to even be showing. And then I remember the whole eBay tie-in. That's all I remember. See, that is the one good thing about 2 is that it did have... It had one fight scene in a forest that they went to the forest for the specific reason of, you can see what's happening. We're going to have the camera zoom out. There's not fucking buildings and explosions everywhere. It's people fucking fighting. And you can actually see what they're doing, kind of.",
            "start": 5982.28
        },
        {
            "text": "what's happening. We're going to have the camera zoom out. There's not fucking buildings and explosions everywhere. It's people fucking fighting. And you can actually see what they're doing, kind of. Because they're still convoluted messes. But at least it was somewhere. There's these leaked screenplays that I highly recommend people reading if they're interested in Transformers at all. And they're not leaked screenplays. It's essentially fanfic, but it's just like proposed screenplays of what Transformers 2 and 3 could have been. My god. The coolest things I've ever read. And it fixed it. They took the story from one and kept going. And two, it was awesome. And Starscream took over Las Vegas. And that's how they got the humans involved. He created this world where all these people were just under his rule. And then it created the subsections of the Decepticons being split and Autobots having to fight and stuff. And it was actually interesting and cool. And it didn't involve that many",
            "start": 6019.28
        },
        {
            "text": "under his rule. And then it created the subsections of the Decepticons being split and Autobots having to fight and stuff. And it was actually interesting and cool. And it didn't involve that many Transformers, but they were there. Humans, side characters. Then the third movie, even more fucking cool, it involved time travel. Who gives a shit? Is that complicated? Yeah. But was it awesome? Yes. Because they went back to the 80s and they, plot point whatever, their looks looked more boxy and shitty because it was a different time. Like fuck yeah. That's what I want from a goddamn third movie in a thing where it's already being written down. I'd watch that one. What was the one with Mark Wahlberg? That was the last one. I'm a huge Transformers fan. One of the biggest Transformers fans. Even the movies. I love them. Just because they are Transformers. One, I was like okay. Two, I was like, has fight scenes and I'll still stand for it. Three, I was like, fuck. That's the one with Rosie",
            "start": 6058.28
        },
        {
            "text": "the movies. I love them. Just because they are Transformers. One, I was like okay. Two, I was like, has fight scenes and I'll still stand for it. Three, I was like, fuck. That's the one with Shia LaBeouf, what makes him not that funny, right? But I was like, it still has some moments that I really enjoy. And then four, I was like. They lost you. Hate you. You know what sucks though? Is that I started watching that film and I was like, I like Mark Wahlberg in this. It's just the right amount of corny, right? He's got the hot daughter. They've got the dynamic with the boyfriend I thought was cool. I'm like, oh we're starting to tell a little cool story here. Then right when the feds show up. Well first of all he gets Optimus Prime and the time between him finding Optimus Prime and like figuring out what it is, is like, nothing. Everything felt like, they were like, this is a story element, cut it out. Oh this story element, cut it out. We need to get to the action fast. Even the action felt",
            "start": 6099.28
        },
        {
            "text": "Out what it is, is like, nothing. Everything felt like, they were like, this is a story element, cut it out. Oh, this story element, cut it out. We need to get to the action fast. Even the action felt like they cut out parts of the action so that we could get to more action faster. That's why I was all muddled up in bull. No but like, have you seen the fourth one? There are moments in the fourth one where it doesn't make any sense. Like the editing is so chaotic that you're like, Mark Wahlberg just for no reason goes from driving a car to like, he's out of the car shooting at someone and then we don't see him for like 20 more minutes. The fourth is, it has so many issues. There's a couple real nice nods to old things that happen in Transformers. Ratchet has this really good scene in the beginning, when he dies, spoilers, the nod gets the fuck about. But there's like, nothing good about that movie besides that because all the character development of the last three movies, which was",
            "start": 6137.28
        },
        {
            "text": "beginning, when he dies, spoilers, The Nod gets the fuck about. But there's like, nothing good about that movie besides that because all the character development of the last three movies, which was the one thing I was holding on to, all of a sudden they decide that Optimus Prime is just a motherfucking asshole that doesn't care and will kill humans and stuff. No, I don't give a shit what people do. Optimus Prime will not kill a motherfucking human. He's shooting at them! The fuck? Sam changed him. Like even in the second motherfucking Transformers movie starts off with a scene where Optimus Prime holds a gun to a Decepticon's head, fucking shoots him point blank. Welcome to the realities of war. That is not Optimus Prime. That is not Optimus Prime. Sorry you wanted the same boring ass nonsensical story you got. On a different note, the other one I would change would probably be, The only thing that comes to mind is Prometheus. I wanted to see that so bad and people were like, I think",
            "start": 6173.28
        },
        {
            "text": "Story you got. On a different note, the other one I would change would probably be Prometheus. I wanted to see that so bad and people were like, I think my brother was like, why no no. Here's the deal with that. It had the best intentions. It was trying to be super ambitious. And it just got somewhere along the lines, I think Damon Lindelof was saying, look dude, I was like a 13th writer on this thing and I was just trying to salvage it. It just became too much. And that was what I feel like they, what the misstep was, where I would go back and be like, hey, I know you really love this series. You can tell it all came from a place of love where it's like, I can't screw this up. This is Aliens. I would be like, the heart of Aliens was that it was so simple. It is just like man versus monster. That is all it is. It's all it ever really needs to be. And when you're going back and trying to tell an origin story where somehow that was the creation of",
            "start": 6231.28
        },
        {
            "text": "It is just like man versus monster. That is all it is. It's all it ever really needs to be. And when you're going back and trying to tell an origin story where somehow that was the creation of the human species, like, guys, it's too much. Just give me that alien story. It's a cool idea. It was a dope idea, but it was the best intentions. It makes aliens circular, which is cool. The story they were trying to tell was awesome. I can tell when we sat down and was like, this is the story I want to tell. You're like, on a page of a synopsis, a one pager treatment item, please make this. Please immediately make this. A group of scientists discover that there's a planet out there that has an alien presence. Yeah, let's go look into that. But please, when you're bringing people, don't bring dipshits with you. Don't bring people that are geographers. Not geographers. What is the word I'm looking for? Geologists. Geologists. Excuse me. Not geographers. Geologists. Don't bring people that",
            "start": 6281.28
        },
        {
            "text": "Don't bring people that are geologists. Not geographers. What is the word I'm looking for? Geologists. Geologists. Excuse me. Not geographers. Geologists. Don't bring people that specialize in reading maps and topography. Just let them come to you, Kev. Go get your body. And have them get lost in the map they made of the structure they're finding. Don't bring people that are biologists and have them not be a little bit, have a little trepidation when this fucking giant snake comes out of oil and looks at them and goes like this. And it's like, oh, it's so cute. It's so cute. Because they're all like foreign. They're all like a time. Ah, this guy looks so cute. They touch him. They touch him. He literally reaches out. I was like, this thing that I mean, it looks like a giant succubus. And he's like, oh, he's a little guy. He's scared of us right now. He wasn't here five minutes ago. But because this black ooze went all over the place, this ominous black ooze, and",
            "start": 6321.28
        },
        {
            "text": "a giant succubus. And he's like, oh, he's a little guy. He's scared of us right now. He wasn't here five minutes ago. But because this black ooze went all over the place, this ominous black ooze, and these little tiny freaking snakes became these giant things. I'm going to pet him. You know what we should do? Run? No. Let's pet him. Let's make him our pet. We'll call him Charlie. Put him on a little lead. Oh, shit, he's inside my fucking skin right now. That's how that went for him. Fucking Charlie. Didn't see this movie. Charlie went in there and just, and he like melted the guy's face off. It was terrifying. Colin, what would you change? Two things come to mind for me. The first one is Indiana Jones 4. Oh my god. You just make that not happen. Yeah, and that's basically what I was going to say was, is that I'd go and I'd be like, listen guys, remember what you guys did to Star Wars? You're about to do this again. You're about to do this to Indy. Now, Indiana Jones' last movie in",
            "start": 6366.28
        },
        {
            "text": "to say was, is that I'd go and I'd be like, listen guys, remember what you guys did to Star Wars? You're about to do this again. You're about to do this to Indy. Now, Indiana Jones' last movie in 1989 was called The Last Crusade, so it's over now. Yeah. The three Indiana Jones movies are perfect, and you don't need to touch them. Leave them the fuck alone. They're perfect. Yeah, like, don't, you ruined everything with the fourth Indiana Jones movie. It was fucking nonsense. You bring in all these fucking characters. And if you want to see it, you can. You start to see it a little bit in that image where you're like, why does he look like he just got out of a Hollywood brunch? You know, where he's like, really? He's really pretty. He's got that, like, what's funny is I went back and looked at that image. It is his jacket, but it's like a leather version of that old jacket. It's got the thing with the pen thing on it with the little collar. But I'm like, I can't believe it. I can't",
            "start": 6405.28
        },
        {
            "text": "at that image. It is his jacket, but it's like a leather version of that old jacket. It's got the thing with the pen thing on it with the little collar. But I'm like, I can't believe it. I can't believe it. I never go to the movies, guys. But we laughed during the movie multiple times. And it wasn't because it was funny. You know what I mean? When they slowly backed out of the movie. Peace. I'm going now. Going back to the Future. Erase this fucking movie. Also, here's $100 invested in Apple for me. Fine. That's what I would do. Actually, that was not long ago. I was going to say. Oh, no. I mean, the Indiana Jones",
            "start": 6434.28
        },
        {
            "text": "to the future. Erase this fucking movie. Also, here's $100 invested in Apple for me. Fine. That's what I would do. Actually, that was not long ago. I was going to say. Oh, no. I mean, the Indiana Jones film was probably being written in 2003, 2004. That was before they really, really, really, really blew up. The second thing I would change is the Seinfeld finale. Now, the now. Larry David has been beaten up a lot about this. And I think my stance on this is this. The idea is brilliant. Because the idea of getting everyone back together, and I mean everyone, is a really funny idea. Because everyone has their favorite character. Oh, you remember the guy that opened the Pakistani restaurant? You remember the Soup Nazi? The woman with the fucking marble rye, these things. And he was like, yes, yes. This is what everyone says. So I'm going to get them all back. And they're all going to be character witnesses for these four fucking idiots. And we're finally going to get to the bottom of",
            "start": 6505.7
        },
        {
            "text": "yes. This is what everyone says. So I'm going to get them all back. And they're all going to be character witnesses for these four fucking idiots. And we're finally going to get to the bottom of the fact that they all are bad people. And I liked that idea. It was a nice idea, but it didn't work. The problem with that is the whole point of Seinfeld was that they were fucking assholes that had no consequences to being assholes. They were always doing stupid shit, and they got away with it, right? Like, sure, something bad would happen, but there was never real consequences. Now, it was sort of just a play on life. Like, you know, I guess there are consequences to life. But you know what I mean. It was a show about nothing. When they would do anything, it just wouldn't matter. Nothing was supposed to matter. And at the end of that season finale, it finally mattered. And you're like, oh, I don't like this. Because this is not what I'm used to. I feel like what's unfortunately probably",
            "start": 6544.68
        },
        {
            "text": "supposed to matter. And at the end of that season finale, it finally mattered. And you're like, oh, I don't like this. Because this is not what I'm used to. I feel like what's unfortunately probably happened, I feel this way, they've not talked about it, and I don't think they will, because I think he stands by that show or that episode. But the idea on paper is, I think, really good. And if I was to say, oh, a show that was about nothing and about no consequences and about really bad people, but we love them, is suddenly about really how bad they are and how they watch this guy get robbed, did nothing about it, which is what the last episode's about, and then they go to jail. And the entire trial, they're represented by Jackie Chiles, which is fucking awesome, and they just bring character witness after character witness and they just destroy them based on all the fucked up things they did that they thought they got away with. And if I saw that on paper, I was like, if someone told",
            "start": 6586.36
        },
        {
            "text": "witness after character witness and they just destroy them based on all the fucked up things they did that they thought they got away with. And if I saw that on paper, I was like, if someone told me that before I watched, I was in eighth grade, I remember, I was obsessed with Seinfeld back then, I was like, that sounds awesome. That sounds awesome. Yeah, man, it's fine if they just gotten away with it. They should have gotten away with it at the end. But yeah, the scene ends with them in a jail cell. And I'm like, this isn't, I don't know what I wanted you to do, but this wasn't it. And that's the hard thing with the Seinfeld thing, is I always ask people, I'm like, all right, so we all kind of unanimously agree the finale didn't work. What would you have done? How do you end it? And that's the thing, is I have no fucking idea how you end that show. That show has no continuity in it, except for little characters like Cosmo Kramer, or something like that, or like George's jobs or relationships.",
            "start": 6626.18
        },
        {
            "text": "the thing is I have no fucking idea how you end that show That show has no continuity in it except for little characters like Ben or something like that or like Georges jobs or relationships But other than that theres no real continuity You can jump in and watch any episode So how do you really how do you end it Its not like Cheers right Where Cheers was this amazing cast this ensemble cast and it had very heartfelt moments And it was like it really relied on the relationships of Sam and Diane and then later Sam and oh shit Chris and the other characters And I remember I dont remember a lot of Cheers and I have since stopped watching on Netflix because Im like wow this show is actually kind of formulaic But the end of Cheers I do remember which is it was Sam looking at the bar one more time and someone comes in for a drink right Yeah they come in the door Hey you guys everybodys like no were closed sorry And the guys like okay",
            "start": 6661.64
        },
        {
            "text": "was Sam looking at the bar one more time, and someone comes in for a drink, right? Yeah, they come in the door. Hey, you guys, everybody's like, no, we're closed, sorry. And the guy's like, oh, okay. Another time, it goes away, and Sam just looks and turns the light off and leaves. And that was awesome. Yeah, and that's one of the, That's exactly how I would have wanted that show to end. And that's one of the most well-remembered and most highly rated, in terms of viewers, finales ever. I think Seinfeld was the one that beat it, actually. Probably. And, yeah, I think Seinfeld would have been better, and I don't know how you ended, I might have ended it with just a normal episode. I mean, I think that might have been the boldest thing. That's the best thing to do. The camera just walks, like leaves the door, and it just leaves them where you found them. You've walked in one day in 1990, and you walk out in 1998, and they're just still going. And that's the one reason, like, I really, and",
            "start": 6704.18
        },
        {
            "text": "leaves the door, and it just leaves them where you found them. You've walked in one day in 1990, and you walk out in 1998, and they're just still going. And that's the one reason, like, I really, and I've said it before, I really do believe that show's gonna come back. Like, I just, with all of this, like, They don't have it anymore. Yeah, they do. Julia Louis-Dreyfus still has it. She is amazing. I started watching Veep, by the way. What do you think? It's very funny. It's very funny. It gets to a place with you, where you're like, the first three episodes you watch are like, this is silly. Then it gets to a place where you're like, sorry, this just broke through to the genius category. Fucking genius. Like, the way they treat each other, and the back and forth of that show, is like, it's like none other. But, yeah, I would have done that. I would have ended it just like a normal episode. It reminds me, you're gonna get pissed about me on this one. Because you love this season",
            "start": 6733.46
        },
        {
            "text": "It's like none other. But, yeah, I would have done that. I would have ended it just like a normal episode. It reminds me, you're gonna get pissed about me on this one. Because you love this season finale. I did not like it. I would have gone back and changed the season finale for The Sopranos. Oh, The Sopranos, I do love it. I did not like that. And I'm seeing, it was, it was, it was like ambiguous for no reason. Like, nothing else in that show was ambiguous. Why are we ending in ambiguous? I think it was fake ambiguous. That's what I always tell people. I don't want to spoil it, because people got mad on Colin and Greg when I spoiled an English show that ended 10 years ago. But nonetheless, I understand. I don't want to spoil things unnecessarily. People have sold them watch The Sopranos, it's worth watching. I think it was fake ambiguous. I think it's obvious what happened. But like, I think that they, but I think that that's, David Chase's whole thing, and Matthew Weiner, who",
            "start": 6770.12
        },
        {
            "text": "it's worth watching. I think it was fake ambiguous. I think it's obvious what happened. But like, I think that they, but I think that that's, David Chase's whole thing, and Matthew Weiner, who, surprise, is writing Mad Men in the same way right now. You know what I mean? If you guys are watching the last, I think the last few episodes of The Sopranos, the last season is full of symbolism, and so is the last season of Mad Men. Yeah, but Mad Men's like, Mad Men's, well, that should be a topic for another day. I love the way Mad Men is ending. Me too. I love it. And Cheryl is like, Cheryl is like, disagrees, and I'm like, no, there is symbolism in the books he's reading, there's symbolism in like where he is, and who he's talking to, and the stories that are unraveling, and the characters they're bringing back. Yeah, he's got this one episode where he's reading The Godfather, and you're like, oh, a story about a guy who wanted to take over the world and ended up destroying his life. Yeah",
            "start": 6805.66
        },
        {
            "text": "bringing back. Yeah, he's got this one episode where he's reading The Godfather, and you're like, oh, a story about a guy who wanted to take over the world and ended up destroying his life. Yeah, and I think I didn't see. He had to kill his entire family because of his power loss. I didn't see it, I didn't see it, but in one of the episodes, and this isn't really a spoiler, because it's really just like on a desk or somewhere, like Dante's Inferno is there, and I'm like, yes, yes. Like there was a piece about it, and I didn't see it in the episode, I don't know what episode it is, but I'm like, yes, you know, like he is in limbo. Like that is what the whole show is fucking about. You know what I mean? And so there's like little things like that where I'm like, yes, yes, it's brilliant. So I know some people really hate that ending of The Sopranos, especially because it looked like the TV went out, which I think is one of the coolest things. It looks like your TV died. It wasn't that, it",
            "start": 6846.62
        },
        {
            "text": "I know some people really hate that ending of The Sopranos, especially because it looked like the TV went out, which I think is one of the coolest things. It looks like your TV died. It wasn't that, it was just that I found it. I liked how that scene started. And I thought, I was like, this is perfect. This is a great, it's hard to talk about this without spoiling it, but I'm like, this is actually a great way to end this. Just like, it's just gonna be like any other day. Like it's just, life's just gonna keep going on. And that's what this is all about. And that's really what Tony's struggle was, where he was trying for like what, seven or eight seasons, or maybe five or six, I can't remember. He was trying to keep control over his life. This position he had sort of been thrust into. And he was battling between wanting to be the sort of, the boss of bosses, and being just sort of like almost a real good, decent human being. And then finally at the end of the show, we",
            "start": 6880.52
        },
        {
            "text": "was battling between wanting to be the sort of boss of bosses, the cop of cops, and being just sort of like almost a real good, decent human being. And then finally at the end of the show, we sort of see him kind of sit down with his family, which has been all the thing that roots him to like reality. And then we get sort of ambiguity after that. And I'm like, it would have been just so beautiful to have him just sit down and we just sort of dolly out and that's it. And like, it's like, guess what? No, it's not a happy ending, cause he was a miserable human being. Like he was fucking really depressed and sad. Like seeing the therapist for Christ's sake in the very first episode and like that. And that's the whole, not the first episode, first season. So like, I didn't need to know that maybe he potentially, you know, something might befall him that's bad, right? I don't need that. Cause that's the whole show was about that. Yeah, that can happen at any point. Like he was",
            "start": 6919.22
        },
        {
            "text": "that maybe he potentially, you know, something might befall him that's bad, right? I don't need that. Cause that's the whole show was about that. Yeah, that can happen at any point. Like he was the boss of bosses for Christ's sake. Like someone's going to try to take him out at any point. So why don't we just be reminded of that? I'd love to talk to you about this more. Cause I feel, yeah, I don't want to spoil it either. All I know is I see incredible Soprano shades in the end of Mad Men. Well, I'm seeing that, but I think they learned from, he learned from what happened with The Sopranos where he's like, I'm going to end this in a way that is befitting of every one of these characters. And I find it fascinating. Like I would, it's not really a spoiler how they're ending it. If you're watching it right now, it's not like there's anything big happening. It's just not like all of these characters who have wanted these things for so long, finally got them and it's not necessarily what it's",
            "start": 6956.34
        },
        {
            "text": "it right now, it's not like there's anything big happening. It's just not like all of these characters who have wanted these things for so long, finally got them and it's not necessarily what it's supposed to be. And that is just fucking life. And that's the thing, like that is just life. We don't know cause we're filming this now, the last episode of Mad Men has aired. Has not, we don't know the last episode. So it might be a dream. There's no break in the window and spoils for us. So the brilliance. Future people. The brilliance I think of it, and I think why some people are disappointed so far is that nothing seems to be happening. And I'm like, no, this is so much happening. There is a lot happening. Like if you really look at it. So yeah, anyway, The Sopranos, yeah, I respect that. A lot of people do, people hated that from the second that happened. I'll never forget that cause I watch it with other people. And I was like, that's all I was like, what a tremendously pretentious way to",
            "start": 6993.16
        },
        {
            "text": "of people do, people hated that from the second that happened. I'll never forget that cause I watched it with other people. And I was like, that's all I was like, what a tremendously pretentious way to end a really good show. Like actually I take it back. What a tremendously pretentious way to end a show that was fantastic for the first couple seasons and then kind of really went weird in the middle. Cause the last season became sort of almost a soap opera caricature of what it had been. Where they were like, all of a sudden sort of like hyper Italian all of a sudden. And there was hyper crazy. You know what I mean? Like there was no subtlety left. I feel like they had to end it. I feel like they were over it. Like they were just like, we have to end this. So we can cram everything David Chase wanted in the beginning into this final episode. The funnier thing with that is that he said, it was like a year ago, he basically talked about what happened after like",
            "start": 7028.7
        },
        {
            "text": "crunch everything David Chase wanted in this to begin with. The funnier thing with that is that he said, it was like a year ago, he basically talked about what happened. Like what happened after like during that scene and after that scene. And then claimed, I think that he was misquoted or something like that. And I'm like, I don't, I give him the benefit of the doubt, but I'm like, I don't think so. I think you just told everyone what happened and you didn't want to tell everyone what happened because you wanted to go to your grave. Like with everyone asking questions and you basically just answered the question. And then, but then it was like, I didn't say that. People have to look it up. I don't remember what he said. He was something like, I didn't say that. Or like I wasn't, I was misquoted or it was out of context or whatever. But I was like, I don't know what you did motherfucker. I mean, overall, yeah, it's a phenomenal series. I give a lot of shit, but I'm Italian and I feel",
            "start": 7063.06
        },
        {
            "text": "or it was out of context or whatever. But I was like, I don't know what you did motherfucker. I mean, overall, yeah, it's a phenomenal series. I give a lot of shit, but I'm Italian and I feel like it's racist, but I'm just joking. I might be alone in this, but like you were saying that like you wish you just ended on just them sitting at the table. And it's just like, to me, there's been a bunch of different things where I see things as like, it ends. And then we get a little bit more that we didn't necessarily need. But I always look at that kind of as just like an alternate ending almost where it's like, I know that it is the canon ending or whatever, but it's just like to you, the ending could just be the table, right? Well, that's the thing. That's what it was. Do you remember the ending? Well, yeah, I know, but like, The implication was that there was maybe potentially something that happens afterward where I was like, I don't understand why they felt the need to do that because",
            "start": 7095.9
        },
        {
            "text": "Well, yeah, I know, but like, The implication was that there was maybe potentially something that happens afterward where I was like, I don't understand why they felt the need to do that because this character is in his own hell. So the threat of violence is not really that big of a deal for me as a viewer because I've watched this guy go through, have to do terrible things to stay in power, have to kill his best friends because if he doesn't do that, he'll be viewed as weak and someone will come kill him. Like, remember Steve Buscemi, he had to hire Steve Buscemi and Steve Buscemi just cleaned house and it was awesome. Cause you're like, wow, he's really terrifying when he's like sitting at your door with a double-barre shotgun. There was all that stuff. Like he did horrible things and you're like, this guy's like, he just is who he is. He's a complex human being and he has to live with himself and that's how that should have ended. It's probably his proudest of his stuff. Have you not seen it?",
            "start": 7131.64
        },
        {
            "text": "you're like, this guy's like, he just is who he is. He's a complex human being and he has to live with himself and that's how that should have ended. It's probably his proudest of stuff. Have you not seen it? You still haven't watched it Greg? I've watched bits and pieces. I've seen the ending, I've dropped it. What a show, man. What a show. Cause for me, there are two things specifically, Death Note, I always talk about it. That show has a very definitive end and then it goes on for another 15 episodes and it didn't need to. But the way I see it is it's just like, do I wish those 15 episodes didn't happen? No, I'm happy I got them. It gave me something different, but that series could have ended and it was a great end. And another example is Metal Gear Solid 4, where it's like, that thing ends and then it keeps going and things get fucking weird. But it's like, do I wish that didn't happen? No, I fucking love that it happened. Yeah, but with Metal Gear, that's the style. Like I've played, granted",
            "start": 7174.8
        },
        {
            "text": "it keeps going and things get fucking weird. But it's like, do I wish that didn't happen? No, I fucking love that it happened. Yeah, but with Metal Gear, that's the style. Like I've played, granted, you played two seconds of Metal Gear. Two hours of Ground Zeroes. You think you fucking know everything? But the first hour of it. You're gonna come here and tell me something about Metal Gear? The first hour of it, they introduce like 15 characters, none of whom, like three of whom have an insane backstory where I was like, I'm trying to read through, I don't know if you guys probably didn't do it, but I'm like, oh, I don't know who any of these characters are, so I'm gonna read about Chico and Paz. And they have like a whole backstory thing and I started reading and then I kept reading and then I kept reading and then about an hour and a half into it, my wife's like, are you playing a game? Or are you just reading a fucking book? Like, I'm like, I haven't even started playing the game yet.",
            "start": 7211.82
        },
        {
            "text": "I kept reading and then about an hour and a half into it, my wife's like, are you playing a game? Or are you just reading a fucking book? Like, I'm like, I haven't even started playing the game yet. To be fair, Ned, this is coming from a huge Metal Gear fan. I don't know any of those characters either because they were only in the PSP games. Weird, right? And then we get Skull Face and I'm like, that guy's dope, don't see him again. I'm sure we'll see him in Phantom Pain. But that's Metal Gear, like that is that style. That is a very Japanese style of telling the story. The end of the war is something different. Yeah, but you were talking about Death Note, but that's Death Note. Like we subscribe so wholeheartedly to the sort of what they call classic Coke way of storytelling, right? Three act structure, character, it's always the hero's journey, always, right? Whereas when you start watching anime, it's part of the reason why it's hard to get into is when you watch certain anime",
            "start": 7249.42
        },
        {
            "text": "act structure, character, it's always the hero's journey, always, right? Whereas when you start watching anime, it's part of the reason why it's hard to get into is when you watch certain anime, you're like, this is not what I'm used to, man. Like all of a sudden, they'll just go off on a tangent and start telling a story about something else. And all the symbolism will come into play. And what we're used to is we need that set up in the first act or else we don't feel validated in the third act when that comes to fruition. Whereas in like Metal Gear, it's totally okay for Hideo Kojima to be like, you know what? I want to write a character into this right now that you've never seen before and you might never see again, but he plays a very pivotal role in the story. Drebin. That's okay. Oh my God, Drebin. Decoy Octopus. But that's not to talk about, can you imagine a movie, if you were watching a movie like that and all of a sudden just in the random third act, some huge guy came in",
            "start": 7284.62
        },
        {
            "text": "Oh my God, L. Death Note. But that's not to talk about, can you imagine a movie, if you were watching a movie like that and all of a sudden just in the random third act, some huge guy came in and was like, I'm more powerful than anyone. And you're like, no, you're fucking not. Who the fuck are you? Who the fuck are you guy? I haven't seen you for two hours. Like as an American, I'd be like, this is unconstitutional. Just as an American, you'd have a problem. No, but that's what I'm saying in Japan. They don't care. They're like, oh, that's cool that they've introduced this. Like I don't, it's okay to throw me a wild card. Sure. But I'll agree with you on Death Note. I was wondering, should we hit just end it now? I'm desperately trying to, yeah. No, I'm not saying the topic, I mean the show. We should end the show now. Oh, and we're breaking that. The one that we said we were breaking it to. We'll figure it out. Because the Coke topic became a topic about grandma's basement.",
            "start": 7318.06
        },
        {
            "text": "the show. We should end the show now. Oh, and we're breaking that. The one that we said we were breaking it to. We'll figure it out. Because the Coke topic became a topic about grandma's basement. That's true. But then we talked about it though. We didn't break whatever. Spoilers, future people. Yeah, what's the big deal? We broke it up. You had to break it up in a more eloquent way. I don't think it's a big deal. Because this is still, I think, an unusually. It's a long episode. It's really long, yeah. Which is great. Yeah, no, this is a great episode. This is a lot of fun. I had a lot of fun with you guys. I like you guys a lot. It's good to be back. Where were we? I don't know. I feel like we haven't seen each other in six months. Yeah, I know. It really, no lie. I think since, so you went to LA on Sunday night. Oh wait, yeah, you weren't even in LA that long. When was the last time I saw you guys? It has been a while. You didn't come over on Friday. Yeah, I wasn't here on",
            "start": 7349.38
        },
        {
            "text": "to LA on. LA, LA. Sunday night. Oh wait, yeah, you weren't even in LA that long. When was the last time I saw you guys? It has been a while. You didn't come over on Friday. Yeah, I wasn't here on Friday. So Thursday night, Friday night, Saturday, Sunday, Monday. It's now Tuesday today? Today's Wednesday. Today's Wednesday. Since Thursday, I have not slept before 4 a.m. Jesus. Every night. And I just realized how long it's been. You look really good. You look really good. You don't have bags under your eyes and stuff. Yeah, I don't know. You look great. Well, it's the youth. I wouldn't ever have to get here. Oh, actually no, I haven't. I've been getting up at like 11 maybe. Oh, okay. And then working from then until four. Sure. This live show is gonna be the fucking, I said this on Twitter, it's gonna be my Mona Lisa. Wow. Yeah. You gotta keep working afterwards though. Can't retire. Oh yeah. Da Vinci did. I'll keep doing stuff. Did DaVinci retire after the Mona Lisa? No, he became a",
            "start": 7385.34
        },
        {
            "text": "it's gonna be my Mona Lisa. Wow. Yeah. You gotta keep working afterwards though. Can't retire. Oh yeah. Da Vinci did. I'll keep doing stuff. Did DaVinci retire after the Mona Lisa? No, he became a Ninja Turtle. Yep. Ladies and gentlemen, that's the Game Over Greggy Show each and every week. Four, sometimes five, best friends bring a random topic to you. I got you. I got you good. I was trying to deviate. You really got me. You really did, I was like, is he dying? You both are ready. I thought you broke. This table. No, I missed it. This is the first time I missed it. Well, it's cause I deviated to throw you off for your Mona Lisa. That's foreboding now. That's my Mona Lisa. That was really bad idea. Why are you trying to change shit? Why does it matter? Why do we, where's the Star Transformers 4? It's Transformers. You get the show on patreon.com early slash Kinda Funny. Go to youtube.com slash Kinda Funny day by day, topic by topic. You know all this, you've made it through this",
            "start": 7424.44
        },
        {
            "text": "4? It's Transformers. You get the show on Patreon.com early slash Kinda Funny. Go to youtube.com slash Kinda Funny day by day, topic by topic. You know all this, you've made it through this rigmarole. Thank you for watching. We're excited to see you at Kinda Funny live, unless it's already happened. Then we were excited when we saw you there. We hope cool videos have posted. If the door is like locked and everybody burned inside, it was probably Kevin's fault. We're sorry about that. Until next time. It's been our pleasure to serve you. I need to cut and make sure everything's coming. The camera's coming on a little too hot. Okay. Too hot. So the sound board is working excellent. I'm gonna tweak the level of the camera. Sure. I'm gonna cut this part out. You did the right thing. You did the right thing, Kevin. Excellent. Ladies and gentlemen, we'll be right back with better sound maybe, or maybe it's been great the whole time. I'm gonna cut it when. I'm talking to nobody. That's",
            "start": 7459.54
        },
        {
            "text": "did the right thing, Kevin. Excellent. Ladies and gentlemen, we'll be right back with better sound maybe, or maybe it's been great the whole time. I'm gonna cut it when. I'm talking to nobody. That's right. Well, maybe you should put this in after the credits. They know I was talking to them. Okay. Time capsule. Hopefully this audio will be the audio. You'll sync it with the clap and that'll be crystal clear anyway. Syncing with the clap. Great, great, perfect. Why are you syncing it with an STD? Yeah, that's weird. What do you want us to do here? And that's why you don't get touched. You can't get an STD if no one touches you. You are like a little pie that's been baked to perfection. You can't get an STD if no one touches you. I'm doing that shit.\n\n(Note: No changes were made as the text appears to be a conversation between the hosts and does not contain any obvious phonetic or spelling errors.)",
            "start": 7504.94
        }
    ]
}