{
    "id": 843,
    "video_id": "VZsWpjfAyUg",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Let's Play LA Cops - Kinda Funny Plays",
    "description": "Greg and Colin play the super neat LA Cops on PS4.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1431543600,
    "duration": 983,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another let's play here on youtube.com/ kindafunnygames I'm Greg that's Greg that's Colin and Colin you're going to show me this LA Cops what's it all about LA Cops is a game by a studio called Modern Dream and it's it's how do you like that name it's good I like Modern Dreams is a good name for Studio congratulations an interesting game I've only messed with it a little bit okay um I saw a video of it when it was on Xbox One some time ago and it it made me reminded me a little bit of of actually Hotline Miami so I wanted so I wanted to jump in and see if it was indeed like Hotline Miami and it is and it isn't it's not quite there but you'll see some inspiration when we play the game okay because I like the aesthetic of this but I really like the gameplay of H Miami yeah I don't I wouldn't say it's as good or as tight as how but it's different so we start the game out by picking two cops get Murphy you want Murphy yep and who else you want me to pick",
            "start": 0.12
        },
        {
            "text": "of LA Cops yeah I don't I wouldn't say it's as good or as tight as Hotline Miami but it's different so we start the game out by picking two cops, Greg Murphy, you want Murphy? Yep, and who else you want me to pick? Give me Green. Look at this piece of crap, Nick Scarpino in four years. So Murphy and Green are our cops, uh, you know, our partners here, and we're going to go into the first mission with them. Is there any... this oh here we go actually destroy right here I'm sorry my apologies oh no somebody left him I don't know I don't know what I don't know what I think that's pretty clear oh yeah that's pretty clear everybody oh oh now he's crying you didn't tell me this was going to have a story that would tug at my heartstrings from what I played that is basically it that's it all right good to know so here we have we're at the 7-11 store which is of course we're at and it says thieves are holding up Denny's Donuts they're holding Chef Danno hostage those punks need to know you don't Rob our store nice get",
            "start": 36.04
        },
        {
            "text": "we have we're at the duty store which is of course we're at and it says thieves are holding up Dodo Donuts they're holding Chef Danos hostage those punks need to know you don't Rob our store nice get in there take a out rescue Danos you can play on normal hardcore nightmare we'll play on normal um so the idea here Greg is this I'm moving right now I'm I'm moving the female cop I press triangle I can move the oh it's two it's two player hotline miy so you I'm going to move in here you can use L and R L1 and R1 to kind of rotate if you're playing on PS4 I tell you and you can use the d-pad to kind of go in and out question immediately can I play this on vita no it's not on VA this game is on PC Xbox One and PS4 only okay so I'm going to put him there and I'm going to and I'm going to station the other person here you can press this you can press this the square button to kind of aim and you can see I can aim I'm aiming at him already so if I bust the door for inance I'll be shooting him",
            "start": 80.76
        },
        {
            "text": "the other person here you can press this you can press this the square button to kind of aim and you can see I can aim I'm aiming at him already so if I bust the door for instance I'll be shooting him now here's the problem and it's just cuz I'm not very good at the game sure I don't really need both of the cops to get through these missions but it's because it's score based and if you want to get a good score you're going to need to use both of the cops okay so I'm just going to kind of bust her here oh my God cop oh they don't turn around and meet like Hollywood Miami no no no okay I thought they were going to be they knew who you were you know how you got coming hot Miami they know who you are they start shooting you in the face nice job Col job so that guy's down work the scene brother watch out Colin that's a guy and that guy's down oh Colin get back and that guy's down God thank God so I'm going to just to keep him kind of involved I'm going to bring our guy here with Jack Scaro got",
            "start": 117.64
        },
        {
            "text": "Out Colin, that's a guy, and that guy's down. Oh, Colin, get back, and that guy's down. God, thank God. So I'm going to just keep him kind of involved. I'm going to bring our guy here with Ack Scaro got it, Nick Scarfo making the move. Um, and so you can see in front of him like this is kind of his field of vision. So okay, and you can call him to you too by pressing X. So like I can just call him towards my position, okay? Or drop him, and you can see I set a little waypoint for him. That's the complexity of the game that I think is actually quite unnecessary, and it feels like that was something that might have been shoehorned in. Not that I want to say that wasn't a mechanic that they wanted to do originally, but it seems like it's something that tries to differentiate from this kind of game, like maybe Hotline Miami, that might not be needed. But also the partner nature of cops might make this kind of necessary. Now here's the question though: Do you think that these things that",
            "start": 150.44
        },
        {
            "text": "of games like maybe Hotline Miami that might not be needed but also the partner nature of cops might make this kind of necessary now here's the question though is do you think that these things that don't make sense right now are seem a little you know no sense for him do you think it's possible because oh nice job thank you oh we got one with one bullet that's you're saving the city money do you think it's just because we're in the early stages of the game right now you think like later on when it's super complex there's a million different things going on the cone will matter where you have some it's it's entirely possible if not likely okay but I still I still feel like it's a little bit forced got that gold trophy got my gold trophy there got my no death trophy earning some trophies pops the plat right now that's over that was it so I got my score my score of B and three experience points Chief Mahoney he's thrilled I love the aesthetic of the character yeah I know it's",
            "start": 183.28
        },
        {
            "text": "\"Pops the plat right now, that's over. That was it. So I got my score, my score of B and three experience points. Chief Mahoney, Mahoney, he's thrilled. I love the aesthetic of the character. Yeah, I know it's really fun looking. So let's do another mission. To all right, yeah. So we're going to continue on. So here's the question, I guess outside of what you've tasted here on this donut shop, do you think you'll come back to this game? Yes. Okay, there's something about it that's interesting. Yeah, that I definitely enjoy. Is it this guy's story about getting left by his wife leaving him? It could be. He's got the doughnuts he's got the Cub he doesn't care anymore. That's true. He's clearly just letting it all go, letting it hang out like for it's funny like it's cool. Like the game's got a low budget feel to it that works. Yeah, you know. Yeah, no lips moving the animation's very crude. So here we are, wealthy business magnet Max Thorne is being held hostage in his ball house apartment. Unfortunately, his\"",
            "start": 216.64
        },
        {
            "text": "It that works, yeah, you know, yeah. No lips moving; the animation's very clear. So here we are, a wealthy business magnate being held hostage in his ball house apartment. Unfortunately, his hostage takers don't know he's broke and can't pay the ransom. Goddamn, rescue him before they find out. So again, I'm going to kind of just play it the way I play it - kind of bust in here, just kind of shoot that guy out, space this guy still has no idea what's going on. Not he a gunshot so he has no idea what's going on. So I'm going to I'm going to switch over to my friend over here and kind of just put him here, just in case, and we'll station him there. So now what would H? I guess I'm assuming these guys don't... Oh, Colin! Oh no, Colin! Oh Colin! Okay, I'm just cleaning this joint up, Greg. That's all I'm doing. Don't worry about what I'm doing; worry about what you're doing. Okay, I was just... Oh no, I've lost someone. He's going to pay for that. And you can't revive her; I don't think where is",
            "start": 257.68
        },
        {
            "text": "I'm doing don't worry about what I'm doing, worry about what you're doing okay, I was just oh no, I've lost, I've lost someone, he's going to pay for that and you can't revive her, I don't think where is she, she's so one of the bodies there, one of the no one's getting revived here Greg okay okay it strikes me as like it's it's like you have an extra life in LA Cops you know what I mean it doesn't seem like they matter too much, that person stays alive not to mention these guys just take out the bad guys in this game very slow to shoot you yeah they don't know what they're not they're not they don't want to shoot you this is just a hostage Mission they don't want attempted murderer tagged onto their crime damn that oh man look at this idiot sitting around his car, baby Bell cheese wheel there what are you doing so I'm moving through I can go now as far as I remember so this area is clear but this mission's two parts sure so we're going to go to the next part we haven't quite rescued the",
            "start": 300.24
        },
        {
            "text": "what are you doing so I'm moving through I can go now as far as I remember so this area is clear but this mission's two parts sure so we're going to go to the next part we haven't quite rescued the bankrupt magnet yet oh she's alive again so she's back good I like that uhoh uhoh uhoh oh my God that was close wasn't it great yeah it was really close it's one of those can she can the player you're not in control of get killed while you're not in control presumably I think also like I can station him in such a way that he'll shoot automatically at enemies but then also draw attention to himself this guy here he comes here he comes looks like oh he took me out looks like Fat Oliver from The Brady Bunch, cop killer cop killer",
            "start": 351.12
        },
        {
            "text": "It was he was wearing some dumb hat but up stand yeah he got fat and he started taking hostages and killing cops put it on his Wikipedia everybody Fat Oliver from Brady Bunch cop killer cop killer oh **** Colin that was a bold move let's see if it pays off oh that was close should we do it again yeah you got to do this you got to do this you got to put this one away what I've realized is that the square button is essential in terms of it aims but you can just keep hitting it as enemies run in and and mash R2 and just kind of lay him out all right so let's see if we can draw F Fat Oliver back out again oh God hey Bobby that Fat Oliver talking to Bobby damn knocked him out with the door and then shot him let's see if we can do the same thing with this guy yeah yeah now hold on set the perfect trap now hit him with the door there you go Fat Oliver Fat Oliver coming through Fat Oliver got one in the dome there Mara Maria Marshia I don't think he was the one that popularized that",
            "start": 394.64
        },
        {
            "text": "\"Trap now hits him with the door, there you go. Fat Oliver, fat Oliver coming through. Fat Oliver got one in the dome. There's a Mara, Maria, Marshia... I don't think he was the one that popularized that particular quote. Feel like that might have been Jan, Uncle Jerry. There's a giraffe in my bed. Oliver, so let's see if we... I don't remember many Oliver episodes; they were very late. Yeah, they weren't that many - just like four or five seasons with Oliver. No, there wasn't. There was one. There was five seasons of the bunch last. He was the last one. Yeah, all right. Just like when uh, they added Ashley Johnson to Growing Pains and ruined that show. Oh, that's not nice. Should we do one more mission, Greg? Yeah, let's do it. I'm enjoying this game, the commentating of it. Chief Mahone's not pleased with the level of damage that I've done. Are you ready for a new police academy? Yes, we go see that in theaters. Oh yeah, I love Police Academy - it's great. You got to love Police Academy. Chims is pissed off at... Wait, is this not\"",
            "start": 451.76
        },
        {
            "text": "that I've done are you ready for a new police academy yes we go see that in theater oh yeah I love Police Academy is great you got to love Police Academy it's great this woman has no face where is This Woman's face I don't sir this station's budget a lot especially when you have to buy two of them oh do you think that that's his ex-wife maybe that that's troublesome you're on the force together and then now you're do you think he did something to her face that's probably why she broke up with him you stole my mouth and nose in the middle of the night con Oliver the giraffe's back all right so here we are the Mansion we've got word of a drug Den based in a burned out mansion that needs clearing out be careful they're armed be careful col you knew that you know I'm not going to be careful think about the kids in your 401k you're only one day away from retirement your pension is that the story is that our sub story like our meta story",
            "start": 510.24
        },
        {
            "text": "you know I'm not going to be careful in thinking about the kids in your 401k you're only one day away from retirement your pension is that the story is that our sub-story like our meta-story for the game yeah this is like one last everyone's one day away from retirement no matter how many days this goes and they're on the hunt for Oliver who stole everyone's mouth and nose oh no that was close I guess Bob V is going to have some work to do on This Old House blow doors up hey you got you got the drugs already can I I can't grab it how do I grab it shoot it there's Oliver again how did Oliver come back these Olivers you know I've always said that I don't think I'll ever become a a real criminal but if I was to become a criminal I'd want to have some flair to it and I got to say it be it would be pretty awesome if you were the Brady Bunch gang and you went out you did jobs dressed as Brady Bunch characters that's if any criminals are watching you're welcome to take that",
            "start": 567.24
        },
        {
            "text": "Say it, be it would be pretty awesome if you were the Brady Bunch gang and you went out, you did jobs dressed as Brady Bunch characters. That's if any criminals are watching, you're welcome to take that idea. Yeah, that's all CU, that's the one thing when you watch the movies and you know you read comic books and stuff, it's just like criminals in the real world. Oh man, he got messed up, that's weird 'cause he didn't do a goddamn thing. I set him up right at that angle to shoot someone. Criminals in the real world they got no flair and no imagination if you were the Brady Bunch Bandits we would all be like oh man sucks that they're killing people but this is not entertaining, but it's kind of awesome. Oh no, oh run, oh no, oh dear, oh dear. I'm trying alright let's try one more time alright this is it your final shot last dance Last Dance you're yeah you're peppering the walls though you got to be careful. Oh you picked up somewhere I'm good okay I'm fine it's fine Peter your thighs oh uh-oh.",
            "start": 617.56
        },
        {
            "text": "this is it your final shot Last Dance you're yeah you're peppering the walls though you got to be careful oh you picked up somehow I'm good okay I'm fine it's fine Greg your thighs oh uhoh uhoh uhoh had enough of these **** criminals Bray bun gang it's me the police we're going to shoot up all your drugs and let your guns on the ground or get off the back so what was their dog's name they what was it Chance something Tiger Tiger you **** only buy a dog that would be the problem is you'd start giving yourself away where's the breedy bunch getting hiring though while they keep ordering these costumes and this one type of dog I guess you could breed the dog too but it was just that takes a long time I'm I got to shoot the drug tables yeah obviously oh well that's just a wall is it I'm just letting you know all right how you feeling you confident what is with the floating Baby Belt cheese wheels I think that they're donuts and I think that they're Health nice I mean I I'll",
            "start": 661.56
        },
        {
            "text": "it I'm just letting you know all right how you feeling you confident what is with the floating Baby Belt cheese wheels I think that they're donuts and I think that they're healthy nice I mean I I'll tell you what I I could we need to eat more Donuts what are you doing lady stop looking in the corner here it's like Blair Witch she's ready for something horrible to happen to you all of a sudden the whole screen is going to go sideways and it'll end and everybody will be really mad damn someone got clowned out wasn't me clown down I want to go in here and look at the controls is there a way for me to switch weapons nope don't see it okay all right would like to have the shotgun maybe down in the d-pad down in the d-pad yeah that's going to just zoom in okay I apologize I'm not familiar with that man look at these McElderry staircases I'm like neither of my guys have ammo right now if somebody comes in and builds your house Colin and that's what your rail looks like going up",
            "start": 722.48
        },
        {
            "text": "that man look at these mecer staircases I'm like neither of my guys have ammo right now if somebody comes in and builds your house Colin and that's what your rail looks like going up you fire that person yeah what kind of drugs are you doing so I got to destroy the drug tables oh you didn't want janky going up sideways in crooked times no we didn't want that we didn't rob all these people and murder them as the BR Bunch gang have shitty stairs ammo uh oh now it's now it's now it's and only have two bullets left in this out and she's out too all right okay now now over here over here over here over here that's a good yeah off camera he said isn't there a pickup button there was a pickup button was there was okay there we go there we go good job Kev thank you Kevin good job Kev thank you Kevin you can tell he knows about pick understand he understands a thing or two about it that's an interesting point he helped us and we still turned it around on him is",
            "start": 778.64
        },
        {
            "text": "Kevin good job Kev thank you Kevin, you can tell he knows about pick understand he understands a thing or two about it that's an interesting point he helped us and we still turned it around on him is friend good night 100 kills damn you're ranking him in I'm going to destroy that drug t that's objective complete bro now put the gun in your mouth area clear there's one more area Greg, we're going, we're going, we're doing something, we're keep we're going to keep on keeping it on here with just murdering all of these people warrantless there's no there's no Rhyme or Reason to anything we're doing here right now as Oliver's about to find out bye bow here comes another Oliver bow oh **** it's getting real what if this is one of those movies where it turns out the game we've been playing is actually happening in real life and we're controlling two cops they're just walking through the streets of San Francisco just blowing people away right now and they all keep saying pretty much got",
            "start": 820.92
        },
        {
            "text": "Is actually happening in real life and we're controlling two cops they're just walking through the streets of San Francisco just blowing people away right now and they all keep saying pretty much got all every like so I mean what's your honest take on the game it's fun I like how we're narrating it and having fun I had a stroke mid word there sorry uh I don't know if I'd play it it looks it looks fun I'm not putting it down it's just I got Hotline Miami you know what I mean and you can see the kind of clear Hotline Miami you know oh totally this looks slower paced than Hotline Miami maybe not as challenging in terms of the way the enemies react I'm playing on normal it seems like there are two more difficulty levels that might up the ante a little bit I like the aesthetic of it a lot of personality oh you missed one of the things drugs my drug table your drug table another drug table now this let's just for a second take in how terrible this bathroom is yeah we put the stuff against the",
            "start": 868.32
        },
        {
            "text": "oh you missed one of the things drugs my drug table your drug table another drug table now this let's just for a second take in how terrible this bathroom is yeah we put the **** against the wall and uh no bathtub shower faucet sink we're out of here God damn it I knew from downstairs the railings were bad I didn't expect the bathroom to be a complete **** show too yeah everything's all yeah we made you a bathroom no sink just a bath just a toilet can you all right well I understand that can you hold can you just make it I could fit a whole bedroom in there no no this is what it is man all it is so mission complete Greg now let's see what Mahoney gives us he's Proby to give us yeah he G us a see son of a **** that piece of garbage he's just jealous well that's La Cops, Greg, PS4, Xbox One, PC available to download right now if You' like ladies and gentlemen what do you think La Cops let us know in the comments below then make sure you keep coming back here to youtube.com/ kinda funny games",
            "start": 914.92
        },
        {
            "text": "One PC available to download right now if You like ladies and gentlemen what do you think LA Cops? Let us know in the comments below. Then make sure you keep coming back here to youtube.com/kindafunnygames each and every day for a brand new let's play, podcasts, and reacts videos, and jokes at Greggy's expense.",
            "start": 964.08
        }
    ]
}