{
    "id": 851,
    "video_id": "XvQmCkE6D74",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Will Kojima Make An Indie Metal Gear? - Kinda Funny Gamescast Ep. 19 (Pt. 4)",
    "description": "With Mighty Number 9 and a Castlevania clone on the horizon, will Kojima do the same with Metal Gear?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1431608401,
    "duration": 875,
    "transcript_chunks": [
        {
            "text": "All right guys, final topic for the day as always comes from the users. If you have a topic, tweet me at Tim Gettys, like Ghost 6 did with Inafune's Mighty Number Nine and Igarashi's Castlevania successor. Do you guys see Kojima making an indie Metal Gear follow-up? Yeah, I can see that. Lord, I would love it. I can see going either way - where he does that or he just does something completely with robots. Yeah, you know what I mean, like... and either way, I mean, I'm in. But the idea of a fresh start on the ideas of Metal Gear and what made Metal Gear good right? But in 2015 or 2016, 2018, whatever the heck... holy heck that sounds so good to yeah, wipe away all the story that keeps so many people away from it you know what I mean. And bring it in like, all right we're starting fresh, you're this guy, you're a super soldier, let's have some stuff gameplay but like there's there's still like not the codec but something like the codec and there's not the you know like the Metal Gears but there's something.",
            "start": 0.31
        },
        {
            "text": "a super soldier let's have some stuff gameplay but like there's there's still like not the Codec but something like the Codec and there's not the you know like the Metal Gears but there something like the Metal Gears I would love that yeah yeah I think that Inafune, Inafune and Igarashi are different than Kojima because they made they've all started all of them started making games around the same time in the mid 80s but they and they're all basically peers but Inafune and Igarashi had to go in a different route because their stuff became more Niche and like their their what they were doing became more suspect in terms of a money-making proposition which is why they had to go to Kickstarter um or presumably I me that's the rumor about Aashi who the **** knows what he's going to do but Inafune went to Kickstarter with a lot of success Kojima is gonna go to a triple-A publisher like I I I I feel it you know like I know it in my balls I feel it in my balls like good good",
            "start": 51.88
        },
        {
            "text": "going to do but in Hideo Kojima went to Kickstarter with a lot of success Coimbra is gonna go to a triple-A publisher like I I I I feel it you know like I know it in my balls I feel it in my balls like good good Coimbra I've said it before I said it on my video I've said it on other things like Kojima can do whatever he wants it's different you know like Coimbra is a name and I'm not I love Inafune more than I love Kojima by far but Inafune isn't a household name with Gamers Coimbra is as someone wrote I don't remember who saying like he's like the only guy that still puts his name on his games like Coimbra presents you know Inafune doesn't do that you know and uh he's going to have such great opportunities that Inafune and um Igarashi weren't provided especially because he already has deep connections to the Western publishing world that you know Coimbra is gonna land at EA or Activision or something like that I'm gonna be really I'm going to be really shocked if he doesn't land on one of these big Publishers",
            "start": 93.4
        },
        {
            "text": "Western publishing world, that you know Kojima is gonna land at EA or Activision or something like that. I'm gonna be really shocked if he doesn't land on one of these big publishers. But say he does, that does he make a Metal Gear clone? Maybe I hope not. I think that I don't know that he wants to do that and people forget that he made other games so it's not like that's all he can make. I mean he made Zone of the Enders and stuff too so it's you know he has other ideas he wants to do other things. He's always talked about an eagerness, don't make Metal Gear, and you often have to wonder if he really even wants to make these **** games you know or if it's just like he has contracts and he has bills to pay and they're paying him lots of money at some point if you're Kojima and they're paying you $2 million a year whatever the **** he makes I'm sure he makes, I'm sure he makes a lot of money that which is probably part of the reason Konami needs to get rid of",
            "start": 138.44
        },
        {
            "text": "coima and they're paying you $2 million a year whatever the **** he makes I'm sure he makes I'm sure he makes a lot of money that which is probably part of the reason Konami needs to get rid of him um eventually you're be like fine like fine you know I can make $500,000 a year making what I want or I can make 2 and a half million dollars a year and I'm just throwing these numbers out but $2 million a year just making another Metal Gear Game and makes my life easier in the long run I'm sure he's pent up with **** ideas and I'm sure the conversation is already happening like that's that's the crazy thing and like you wish you knew like who was talking to him and the people that is you know you can imagine a company like Activision sending a whole group of people out to Tokyo to talk to him you can imagine EA courting him eagerly saying like I we'll give you a **** Studio make a studio do you think there's any chance of an announcement at E3 no I think that this game has to come out",
            "start": 171.32
        },
        {
            "text": "you can imagine EA courting him eagerly saying like \"I'll give you a studio, make a studio\" - do you think there's any chance of an announcement at E3? No, I think that this game has to come out first, exactly that's for sure. The contract he has is that it comes out and then they finish even if it'll come out and then it'll still be like three months four months like with DLC and what's happening on Metal Gear Online - like there's definitely a gag order in terms of like what they're paying him through something for sure. Yeah, all right. Do the new consoles have a killer app yet? Is the killer app still relevant? No, I don't think so. None of them have killer apps and no killer apps are not necessary anymore - the evidence is in the numbers, I mean it's that easy you know like the evidence is in the numbers. Yeah, what do you tell your friend to buy on PlayStation 4 right like we can name a laundry list of games and I know Resogun's at the top for",
            "start": 204.56
        },
        {
            "text": "that easy you know like the evidence is in the numbers yeah what do you tell your friend to buy on PlayStation 4 right like we can name a laundry list of games and I know Resogun's at the top for Colin but it's not necessarily like you have to buy the PS4 to play Super Mario 64 right Mario World yeah you know all that Sonic yeah Toejam & Earl I mean imagine I mean think about this like GameCube and Xbox the original Xbox both had killer apps immediately and you know like Halo was out smash so so you know and I think GameCube actually Xbox I don't intimately know as well I had an Xbox later um 2003 I got my Xbox but I had my GameCube at launch and what I always marveled at with the GameCube and why I loved it so much was that it got better and better and better by 2005 a GameCube was **** extraordinary it didn't matter mhm because no one bought it anyway they were dropping the price like extraordinarily GameCube really struggled as we all know and remember and Xbox had its",
            "start": 251.16
        },
        {
            "text": "With Mighty Number 9 and a Castlevania clone on the horizon, will Kojima do the same with Metal Gear?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus\n\nwas extremely extraordinary it didn't matter mhm because no one bought it anyway they were dropping the price like extraordinarily GameCube really struggled as we all know and remember and Xbox had its similar struggles and ultimately GameCube settled around 22 million and Xbox settled around 24 million well in 16 months PlayStation 4 has already outsold the GameCube lifetime which is extremely insane and it has no Super Smash Bros. and it has no Super Mario Sunshine and it has no Beautiful Joe and no Resident Evil 4 and none of these games at all not even anything close and that's like and that's like the CRA that's the craziest thing is that it's well on its way in a month or two it's going to out sell Xbox and then it's going to go like keep going and it's like why and so we don't know the answer to that all we know is we can infer from that that the killer app doesn't matter because Killzone: Shadow Fall and Resogun and Second Son and all these games, Bloodborne they're not",
            "start": 297.28
        },
        {
            "text": "to that all we know is we can infer from that that the killer app doesn't matter because Killzone: Shadow Fall and Resogun and Second Son and all these games, The Order and Bloodborne - they're not the killer app. They might be good games, but they're not the Killer App. Is this just another example of us experiencing so many generations of consoles and seeing that the killer app hasn't been around for a while? Like you bought your PlayStation 2 because of DVDs and it made sense that you had a PS2 when Grand Theft Auto III came out and Metal Gear Solid 2 came out - those were your games. Like I think those were the killer apps, though. But I mean, that was a year later, Tim. That's what I'm saying is like... but I mean, I don't think the killer app needs to be a launch thing, though. Like it happened to have been that way for a lot of consoles, but I do think that Metal Gear Solid 2 and specifically Grand Theft Auto III were killer apps for PS2. Sure you know, and then like it's funny you",
            "start": 333.88
        },
        {
            "text": "to have been that way for a lot of the consoles but I do think that Metal Gear Solid 2 and specifically Grand Theft Auto III were killer apps for PS2 sure you know and then like it's funny you say Smash Bros because I I didn't even really think of that as a killer app people **** love that I know that but like um Halo definitely was like that thing but I think that it was last generation that didn't really have that game and I don't think it ever got that game right yeah I mean you could like it's funny because killer app is an old term killer app is an old Computing term from before we were even born about the things that you needed um applications it wasn't even games killer app doesn't even mean game it's killer application the thing that the thing that you could like spreadsheets and **** like that or like IBM PC's killer app in like 1982 you know that's why people sold like bought them it's all I can do like math and like compute and do like real Computing on this kind of",
            "start": 369.04
        },
        {
            "text": "and apps like that or like IBM's PC killer app in 1982, you know, that's why people bought them. It's all about math and computing on this kind of thing today. There's such a spectrum of things we can do with these consoles, and a spectrum of games available on these consoles. If you ever go to the PlayStation blog or Major Nelson and look at the games coming out every week, it's like the killer app mentality has been replaced by the volume mentality. And there's a volume of great games on the PS4 - Resogun is a fantastic game, but it might not have The Last of Us in terms of its masterpiece. It's on PS4, but it's not a native game to PS4, and that doesn't necessarily mean anything because PS4 already has a ton of good games. I think people are excited about that, and I think people are understanding more and more that the indie culture",
            "start": 410.92
        },
        {
            "text": "doesn't mean need that because PS4 already has a **** ton of good games and I think that that people are excited about that I think people are understanding more and more that the indie culture, the $10 to $20 game culture is what's going to drive these consoles and the things like Bloodborne that come out when Uncharted 4 comes out or whatever these are like the supplemental like tent poles that are really important but clearly the consoles are not selling because of them it's something that people have to wrap their heads around because it doesn't make any sense you know like and Titanfall is a good example with Xbox One like when Titanfall came out that month PS4 still outsold Xbox One didn't make any sense and then you could read into and be like well maybe people bought Xbox one earlier because they were anticipating TI maybe that's possible maybe that's the truth but you would expect I I I suspect we'll see something similar when Uncharted 4 comes",
            "start": 447.48
        },
        {
            "text": "people bought Xbox One earlier because they were anticipating it, maybe that's possible, maybe that's the truth. But you would expect I I I suspect we'll see something similar when Uncharted 4 comes out, where Uncharted 4 comes out whenever the **** it comes out in 2016, and people were like, \"Oh well, there wasn't a huge spike in PS4s.\" It's like because people are just buying them anyway; so many people already have this information. I think people just want them. This whole console cycle - the end of the Xbox 360 and PS3 cycle, and then the Wii U kind of bombing, and then PS4 and Xbox One coming out swinging and doing really well - all of it's unintuitive. None of it makes any sense. Like that through the conventional way we look at it, Wii U should have been a huge success based on Wii, but no one cared. Right? Like 360 and PS3 just fell off a cliff. People forget that the console sales looked so impressive on PS4, and Xbox One came out by percentage because PS3 and Xbox 360 sales were so soft",
            "start": 484.44
        },
        {
            "text": "right, like PS3 and Xbox 360 just fell off a cliff; people forget that console sales looked so impressive on PS4 and Xbox One came out by percentage because PS3 and Xbox 360 sales were so soft, you know. So that was like a comparison, and we didn't expect that because a lot of good games were coming out at the end of the console cycle. Now we have really no AAA exclusives that really matter, you know. I don't mean that in a disparaging way; it's just that there's nothing there like on PS4. I don't know if Xbox One feels differently, but I'm not looking at Bloodborne and being like, \"I don't think Bloodborne's a great game.\" Bloodborne's not a game that bro guy walks into a store, he doesn't really know much about games; where he sees Bloodborne, I give a **** he didn't see a cool ad on TV and then go buy it. So, like, it's just... it's so that's why the industry is so fascinating right now because none of it makes any sense; it's so weird, you know what's",
            "start": 518.28
        },
        {
            "text": "see a cool ad on TV and then go buy it so like it's just it's it's so that's why the industry is so fascinating right now is because none of it makes any sense it's so it's so weird you know what's going on that's why the last question was so interesting that you asked her a couple questions ago about like what the console space looks like or what games look like who the **** even knows at this point it's all unpredictable not even guys that are really well respected like Hideo Kojima or any of these guys can possibly tell you what's going to happen like it's it's a wild space out there man that's what makes it so unpredictable and that's what makes it so fun you know more Saiyan wants to know how come no one's talking about Armored Core because no one likes Armored Core Armored Core isn't as popular as you think it is as somebody had to review those games no I feel like that's one of those weird games what are your thoughts on Armored Core it's not for me I mean Armored Core is this thing that",
            "start": 554.4
        },
        {
            "text": "Armed Core is this thing that existed over there, yeah but it's weird though it's like it's such a weird thing but like the people that like it really love it and I keep getting tweets almost every time I'm like hey what do you guys want us to talk about is it just more of the same old stuff no no no there's a bunch I've made notes there's multiple people in might be him with a bunch of different accounts but it's just like it's crazy that there's definitely some Armored Core fans that are like wondering why it's not being talked about and like that's an interesting thing to me that like you know as game sites like IGN, Gamespot, and whatever just try to stay relevant more and more just talking about mainstream games and not so much focusing on the Armored Cores and stuff it's like I don't know who is going",
            "start": 589.0
        },
        {
            "text": "like IGN and Gamespot, and whatever, just try to stay relevant more and more, just talking about mainstream games, and not so much focusing on the Armored Cores and stuff. It's like, I don't know who is going to talk about Armored Core exactly. Yeah, there's fan sites and there's message boards and there are the communities you go to and the podcasts you go to that are all about Armored Core, and like, that's a great example of how you have to try to make it work right. Like, if the people putting out Armored Core set their expectations right, they can be an Atelier, they can be a company who's like, \"We don't have to sell this many copies of this niche RPG or whatever JRPG.\" But if they're trying to go out there and be in the middle tier, like THQ space, they're in trouble. You have to set your expectations; fans are there for it, sure. But like, yeah, that's a great example I hadn't thought of Armored Core in **** years until you just said that one. You know what I mean? Yeah.",
            "start": 629.52
        },
        {
            "text": "you have to set your expectations fans are there for it sure but like yeah that's a great I had not thought of Armored Core in years until you just said that one you know what I mean yeah I mean are they still making them of course they are sure is there three coming out this year probably that's just how those things work all right last question for today it goes back to the future topic Jack Daniels 524 says Nope Daniel Salyers says with smartphones around will handheld consoles die out we didn't really touch on handhelds too much will there be handheld consoles in 10 to 15 years no yeah that's it's one of those loaded questions I wouldn't be surprised if there was a middling one that doesn't do anything well but I I mean theoretically no there shouldn't be yeah I don't see and I guess it depends on what what this NX is if it's like what we're talking about if that counts as a handheld or how it goes but yeah you figure I still think and I know K always says",
            "start": 666.68
        },
        {
            "text": "I don't see and I guess it depends on what this NX is if it's like what we're talking about if that counts as a handheld or how it goes but yeah you figure I still think and I know K always says PlayStation's crazy enough to do it I got to imagine the V is over I got to imagine they vacate the handheld space here you know what I mean just with their current commitment level to it and how it's all been going and how even off PSP the tales the seven-year tale spin but like yeah Nintendo and the DS even like they've now got this other partnership right they are getting their games on mobile devices like and again I still see them leaving Hardware as well so then are we counting like the Nvidia Shield there's always I feel like there's always going to be a to be someone doing stuff but like it's not going to be a thing in the industry that people are talking about you know like I guess when I think about it is IGN going to have a tab for that channel you know what I mean",
            "start": 711.92
        },
        {
            "text": "like it's not going to be a thing in the industry that people are talking about, you know, like I guess when I think about it, it's like is IGN going to have a tab for that channel, you know what I mean, like is it going to when you go to the front page are you going to see the whatever the hell it is, sure, sure, sure, you know, and I don't think so, I think it's just going to be phones, yeah, I don't think you know, I was saying before phones and tablets, you know, people are talking a lot and prognosticating a lot about you know how they would affect console gaming or just gaming generally it didn't right like the the effect wasn't there, the effect was there in a more microscopic way on handhelds clearly and demonstrably so like the DS was 150 million plus sold, right, 3DS nowhere near that, PSP 80 million sold, VA not even close, you know, like it's it's just clear as day, like it's it's it's obvious and the games are better and the consoles and the handhelds are better and it's more enticing",
            "start": 749.84
        },
        {
            "text": "80 million sold Vita not even close, you know, like it's it's just clear as day, like it's it's it's obvious, and the games are better, and the consoles and the handhelds are better, and it's more enticing, you can do more with them but people don't care, and I think that is because of the phone, and I don't necessarily think it's even because of games or people playing games on the phone, I think it's just like people, I'm entertained now Twitter and I'm just going to I'm so I'm not entirely convinced that like there's a one-to-one thing where it's like I don't own Vita, I don't own 3DS, I play games on my phone, I think it's more I don't own 3DS, I don't own Vita, I have a phone and I **** around with it, yeah, I look at my mail, I look at my Twitter, I look at my Instagram, like I don't need this other thing MH you know, um, so I think that while console gaming is stronger than people expected it to be arguably you might even say stronger than ever in terms of the early sales of PlayStation 4 and Xbox",
            "start": 792.4
        },
        {
            "text": "MH, you know um so I think that while console gaming is stronger than people expected it to be arguably you might even say stronger than ever in terms of the early sales of PlayStation 4 and Xbox One who knows how it Tails out at that point we don't know um the handheld space is dying um it's obvious and I think I think Sony's yeah I've said Sony's crazy enough to do another Vita I think they still might be crazy enough to do it I think they probably mocked one up and have R&D going on it or maybe they just pulled the plug on it I don't think it ever sees the light of day I think Nintendo's the only one left that can really do it and the NX will be probably that but it'll be something unusual you know I am very excited for that ladies and gentlemen that is the first ever episode 19 of the Kinda Funny Gamescast tweet me at Tim Gettys your topics that you want us to discuss in the show next week and until then I love you",
            "start": 824.76
        }
    ]
}