{
    "id": 858,
    "video_id": "xXiHvGO6-2g",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Best Soda Debate Continues! - The GameOverGreggy Show Ep. 76 (Pt. 2)",
    "description": "Tim Gettys' love affair with Coca Cola continues.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1432018800,
    "duration": 1260,
    "transcript_chunks": [
        {
            "text": "That was really when it was when it was big and and Pepsi had what I thought was one of the most innovative things ever to hit the soda market, which was Crystal Pepsi. Do you remember this? Yeah, yeah, it was Pepsi, but it didn't have the brown heft; it wasn't that perhaps. No, you're right. Yeah, but I often wonder why do they feel the need to put these artificial because that's the other of the problem too is like these dyes aren't great for you either. It's like Diet Pepsi says one calorie on it in Ray Charles' days. So I want to give a shout-out speaking commercial; we talked about Coke a lot, but you know back in my day 7 Up was my jam. **Up** now yeah they **up**ped it all natural when I was in like seventh grade they made it all natural was **up** like they I think they did it because they were realizing that Sprite was the preferable lemon-lime soda kind of thing and then obviously Sierra Mist was like really coming up in the world. You start what about Squirt, where does it",
            "start": 13.85
        },
        {
            "text": "they were realizing that Sprite was the preferable lemon-lime soda kind of thing and then obviously Sierra Mist was like really coming up in the world, you start what about Squirt, where does it fit, forgotten relic, yes, Squirt is also Squirt reminds me a lot of I feel like first of all, Squirt is probably geographically isolated in certain places, why just California, well no we have it out here but I don't feel like it's everywhere, the one thing I was surprised when I was in Iceland was that they had I was making my people I was with laugh because they had just Coke, Coke is huge in Iceland, I don't know a while it's huge and they had like a huge Coke thing and then I'll humor penny thing at the supermarket and then they had RC Cola like just like RC Cola son, I'm sorry, I'm sorry, I don't know how they're holding on, they're holding on because your aunt goes to get pizza yeah and she comes over with the RC and you stoked about the goddamn pizza and then she comes in without our Chicago",
            "start": 82.04
        },
        {
            "text": "know how they're holding on they're holding on because your aunt goes to get pizza yeah and she comes over with RC Cola and you're stoked about the goddamn pizza and then she comes in without our Chicago there's a pizza we got pizza from each and every week and they gave you a two liter of RC Cola with every pizza just keep it like over the counter just give I got two pizzas can you give me at least a 20 ounce Coca-Cola so so I love 7up a lot and I think one of the big reasons was Cool Spot yeah dad that's the coolest little dude it was so good when I was a little kid I was like Cool Salute everyone what did you exactly mean I mean he was pretty I know who he is Chester Cheeto yeah the Cheetah sure we've covered this before what he's a cat character of some kind of cheetah we had this argument this argument even know what the hell we're talking about this on the show where it was you know I've been watching a lot of Planet Earth oh I did not know this yeah I'm big into documentaries and in",
            "start": 119.55
        },
        {
            "text": "this argument even know what the hell we're talking about this on the show where it was you know I've been watching a lot of Planet Earth oh I did not know this yeah I'm big into documentaries and in Planet Earth they always they're like this the most illustrious and elusive of all characters the Snow Leopard and it looks like a damn Cheetah it looks they all look exactly like Leopards have spots when they're in this it's all the same **** it's a cat yep it's a big cat **** how scared I was you as supper you are dinner this cat okay and if you're left alone with them in a room and one of these a little drunk oh man you're getting taken advantage of getting some cat puppies yeah it's a crazy thing so the reason I brought up this topic is because I've been drinking a lot of soda recently yeah stay away breaking my drink on me to stay awake it like the caffeine I do so much **** that just the caffeine doesn't affect me like actually but it's just more just like it's like have something to",
            "start": 178.75
        },
        {
            "text": "away breaking my drink on me to stay awake it's like the caffeine I do so much **** that just the caffeine doesn't affect me like actually but it's just more just like it's like have something to like do but I realized that like soda is such a big part of my life that like when I go to restaurants and stuff like one of the biggest factors of the experience to me is how quick the refills are and uh is there free refills because if there's not **** yeah that's if I'm like if I go to a restaurant and I go man Chinese restaurants it's just like we came the day that I go to a Chinese restaurant and they don't have cans I'm done I will never leave that place that will be my new home it will just be the best because you always be the kid I'm just like gee and Coke like dinner one can of Coke and a plate of Chinese food is just just not enough for me no but it's like I don't always need two cans though and that's my problem it's just like I feel like a little bit more would have been enough",
            "start": 232.24
        },
        {
            "text": "a plate of Chinese food is just not enough for me no but it's like I don't always need two cans though and that's my problem it's just like I feel like a little bit more would have been enough for me so these all these issues are see what I live with you know I love fountain beverages right yeah they're good like if I could if I had the disposable income in a house I would put a fountain in my house like I would even have all the flavors even though I don't drink any of them except for Diet Coke would you get that crazy Coke machine that's digital no I hate that some things are perfect okay complicated that sound perfect yeah this there's no I love this in my experience the mix has been better than a normal one almost always I don't know in there they're like sometimes well hey it works for the weak the weak stop in Daly City has that thing it's a cumbersome piece of is what it is because at the end of the day like Nick said all I want is Coke why do I",
            "start": 281.29
        },
        {
            "text": "well hey it works for the weak the weak stop in Daly City has that thing it's a cumbersome piece of **** is what it is because at the end of the day like Nick said all I want is Coke why do I have to press all these buttons and then wait and then sometimes it's out of it or you get a little bit of flavor of like the Cherry Coke that was in there and I don't want they don't need that spit that **** so sometimes you don't **** with good things and that's what I'm sure and that brings you back to my original point everyone in the world should be importing our fine corn by-product known as high fructose corn syrup they should be putting it into their Coca-Cola products and their Pepsi brought their PepsiCo Brown Bear and we all can all have a fine tasting drink well I mean everyone's like well this I don't anyway this Coke tastes this I like the way that you know to Coke a sneer Bora well newsflash that **** wasn't meant for the United States and the way it tastes here is the way",
            "start": 330.7
        },
        {
            "text": "well this I don't anyway this Coca Cola tastes this I like the way that you know to Coca Cola a sneer Bora well newsflash that **** wasn't meant for the United States and the way it tastes here is the way it's supposed to taste except that's not true because it used to be made with sugar but yeah actually cocaine yeah well yes very long time so I don't know III agree few Cokes important like we're doing our sauce thing with our one of our viewers tonight we're at Sauce and Kevin you look relaxed write it out fill it um fill it out and I feel like it because it reminds me like Sunday dinners remind me of going to my grandma's house you know football games around whatever my grandma's laying on the couch everyone's hanging out and in the sausage right no my grandpa my gran okay I promise and and you know everyone's hanging out maybe in the backyard maybe the living room whatever and things are going on but there's when everyone sits down the sauce is there that means there and then the pork",
            "start": 364.99
        },
        {
            "text": "you know everyone's hanging out maybe in the backyard maybe the living room whatever and things are going on but there's when everyone sits down the sauce is there that means there and then the pork chops all these you know the chicken cutlets all these kinds of things and then there's the 2 liter of Coke because that had to be there that was part of the experience so like whenever I had pastas Greg will tell you like I have to have Coke because never you have any meal you really like yeah wings aren't right pizzas not right Coke just goes with everything like in truth man what I want everyone out you that I have this whole thing I'm like I get the obsession linking the foods to the Coke it's just the fact that we will crack it you'll have to a glass glass and a half out of it and then just leave it out and you're just done with it it's dead to you don't leave in that one time again I am so obsessive about that did I get it I totally understand it's like every single Coke experience how",
            "start": 406.93
        },
        {
            "text": "leave it out and you're just done with it it's dead to you don't leave in that one time again I am so obsessive about that did I get it I totally understand it's like every single Coke experience how it's packaged makes it taste slightly different share I go one liter tastes different than a 20 ounce like even plastic bottles like there is a difference like I prefer one liters one liter Coke my damn favorite but and this is like a just a random thing I won't say it's my favorite just because of you by the way huh very European of you the one liter is a huge in Europe 33.3 yeah not the two liters is a very American thing yeah they're smaller fridges in most places yeah I don't know it they don't have the same taste to me but there is absolutely nothing more perfect than it being a hot day and you drink in a perfectly cold can of Coke okay you talking again hot day I gotta go to that gas station get that fountain beverage I gotta have the straw fountain giant I wanna be able to put on",
            "start": 440.59
        },
        {
            "text": "and you drink in a perfectly cold can of Coke okay you're talking again hot day I gotta go to that gas station get that fountain beverage I gotta have the straw fountain giant I wanna be able to put on my face to cool down the left side of my face the entire part of it here's what I'll toss that here's what I'll toss that's parties I'm not a big soda fan I wasn't in my younger days there's certain things I think when I think is Sir Nick's pizza with it you get the huge slices of pizza back in the Chicagoland area you'll be paired with a Dr. Pepper and an ECW that's what we do every Friday one came back home it's not a wrestling meeting my friends you see we did get laid much now rocking moving on from there this wasn't a Blue Moon Robin who I I want a can a class of Coke off with this bottle Colin's got a wherever I'll be I feel in the mood for it you know what I mean but the one Coke I can never turn down is the best Coke of all time that I did not run into until three four years ago",
            "start": 481.06
        },
        {
            "text": "\"Bottle Colin's got a wherever I'll be, I feel in the mood for it, you know what I mean. But the one Coke I can never turn down is the best Coke of all time. That I did not run into until three or four years ago, maybe less than that, at an E3 judges week thing where you went in and they gave you the tiny aluminum bottle. Oh yeah, this stuff is like the Private Reserve. And I don't know what Mr. Coke is just like off his own spigot and then tossing them out of you because they are amazing. It's the right blend, where it's not too acidic, yeah, it's just sweet and it's like syrupy, it's serious. He's in the Coca-Cola Creek house, yeah, just fine in the finest barrels of Coke. I was no, you were gonna go even a little bit further which was then you go to the fancy hotels or places they really nice to get the little glass bottle, and just pop it, you've done in like three seconds, you're like what's next? Oh, it makes you feel very premium, like very... this is what Lady Gaga would love.\"",
            "start": 525.55
        },
        {
            "text": "The Best Soda Debate Continues! - The GameOverGreggy Show Ep. 76 (Pt. 2)\n\nthe little glass way to just pop it you've done in like three seconds you're like what end oh it's just very uh it makes you feel very premium like very you know this is what Lady Gaga I love that I love when you walk in and that's what happens to every game event that we still go through they still do this where it's it's catered you look over and it's like a little bit of you know something whatever something to eat and then there's just a look at that spread of the bucket ice the glasses and then the little box yes you like little and I'll mess around with the Sprite a little bit I'll do this any other thing I just to Greg's point to close things out of my own opinions of this the reason nothing bothers you more than having it the true leader must be direct little by the time the two leaders cracked you have about an hour to 90 minutes because otherwise it's all messed up I don't understand how people don't understand that like I understated like Cheryl will milk a glass of our",
            "start": 564.14
        },
        {
            "text": "leaders cracked you have about an hour to 90 minutes because otherwise it's all messed up I don't understand how people don't understand that like I understated like Tim will milk a glass of our bottle of Coke for days sometimes like it I'll just leave it in the fridge then I shall drink it and you buy that what time you're pouring it and there's nothing there's no suds there's no I'm like that's gross that's disgusting you can't drink that you say I'm drinking it and I'm I'll go get another two-liter or don't want to watch you drink it yeah yeah that's just your God really great in Mike's core my soul is offends me you know I mean you know what make your jokes about 9/11 all you want you know I mean make your jokes about all these kinds of things you say but no not you not you not you I'm saying people out there make your 9/11 jokes make fun you know do all the things that would make me you think I'd be really sensitive about those things don't bother me you drink a half",
            "start": 607.79
        },
        {
            "text": "I'm saying people out there make your 9/11 jokes, make fun – you know, do all the things that would make me think I'd be really sensitive about those things. Don't bother me. You drink a half-full bottle; it's a two-liter of Coke in front of me, that is rich for three days. Oh, oh yes, and Nick, don't make 9/11 jokes. I'm not making like – occasionally, and I've caught my wife saying \"July you will\" doesn't burn beans the other day. I had a can of Diet Root Beer that I had opened up, and I drink so many of these like I'm still to this day all drink; I'll get like three at the supermarket like I'm gonna want another one, and I'll drink two and a half, but I'm like, I just can't drink a third diet soda in one sitting. That's just kind of leave it out, and the other day I found it – you went from being out to being in the fridge to being gone, and I'm like, \"Did you drink that flat can of like Diet Root Beer?\" My life's like, \"Yeah, it was good.\" I'm like so, like the can was open. Oh, that's terrible.",
            "start": 652.07
        },
        {
            "text": "being out to being in the fridge to being gone and I'm like did you drink that flat can of like Diet Rite beer my life's like yeah it was good I'm like so like the can was open oh that's terrible it's like everything in the fridge now well it's it's that but it's awesome it's just syrup at that point it's just water and sugar because there's no carbonation left and she was like it was only a little bit laughs about port of rice but it reminded me of my says the man who pours Coors Light over I saw everything all right I love lies but when you're talking about when you're talking about dinner at Grandma's house I used to do that it was the exact same experience except my grandmother God God love her would just hoard stuff like there was a zombie apocalypse going but she would never check the like the best by dates like born on dates and so you'd go back there you'd have to route through to find stuff that was actually edible because she'd have all these candy bars that like you've got to",
            "start": 701.41
        },
        {
            "text": "like the best by dates like born on dates and so you'd go back there you'd have to route through to find stuff that was actually edible because she'd have all these candy bars that like you've got to break it off and he just would crumble in your hands cuz it was three years ago she was very against putting soda in the refrigerator because this is back in the day like you're talking depression-era like woman where she's like we have one fridge space and there's limited I'm not getting another fridge it's gonna suck all this power so all the sodas store in the pantry you want a cold soda you got a poured over ice so it was like every time I have a can of Coke that's warm and then I pour over ice and I drink it it immediately makes me think of my grandma skirt it's so funny you said about the pantry because like my grandma's you know Mike my grandfather died my the Moriarty side grandparents died my grandma died when my dad was 19 and then his father died when I was very young so I",
            "start": 741.64
        },
        {
            "text": "the pantry because like my grandma's you know Mike Moriarty's grandparents died my grandma died when my dad was 19 and then his father died when I was very young so I grew up with our G Rose might be Italian I would you know which is why I'm so tired and my grandfather died of colon cancer when he was what it was like 1996 but my grandma was alive until 2004 2005 and she had Alzheimer's and some with that so when when she passed away we went into her house so I cleaned out we sold it unfortunate I was very sad but I remember going into the basement into the pantry and there were things that were in there still I think at this point I was oh god how old I was like 21 20 years old there were things in there that were there when I was like 6 or 7 yeah straight up because I used to go down and play and like walk around I'm like I remember this can of tomato juice being here forever and I remember like trying to like be like you know can we keep some",
            "start": 780.67
        },
        {
            "text": "up because I used to go down and play and like walk around I'm like I remember this can of tomato juice being here forever and I remember like trying to like be like you know can we keep some of this stuff was like I kept through one of the things I did keep was a she had a bottle Molson Canadian beer that was down there that was literally from the 60s like and I kept like I kept that like all this stuff in my mom's like you can't keep all because I was like try to keep like all these yeah yes like it's just a point like that's an Italian grandmother oh my god my grandma's thing was was gum she used to go to this but my grandfather was in the military he was he worked at March Air Force Base he was actually in the Air Force and so my grandmother you know when you were married or someone in the Air Force or and one of the Armed Services you get to go on the base and get stuff for tax-free and all the stuff she'd do like oliver shopping there but she was old so she would shop",
            "start": 818.59
        },
        {
            "text": "or someone in the Air Force or one of the Armed Services you get to go on base and get stuff tax-free, and all the stuff she does ol' fashioned shopping there. But she was old, so she'd shop like once every six months, and she would buy cans of regular soda with labels on them that I'm like, \"That's from 1963! Why are they still selling that label? It's beyond me.\" Hershey bars - loves Hershey bars, the ones that are just bricks, no nuts in them. And Juicy Fruit gum, and it would get to the point where you'd pick up a piece of gum like \"BAE's gonna unwrap it,\" and you could snap it with your feet. Yeah, that's how stale this gum goes. And if you put it in your mouth, you'd instantly feel awful. My brother and I used to love eating; we still do. And we'd go there first thing to do is head for that pantry and just rummage through and see what was new. But we'd always keep the old stuff, and God forbid the little kid actually helped grandma.",
            "start": 857.23
        },
        {
            "text": "Go this first thing to do is head for that pantry and just like route through and see what was new but we'd always keep the old stuff and there God forbid the little **** actually helped grandma out and throw the food out that we would let grandma eat it maybe choke on before we switch off. I want to give a special shout-out to cans of Coke on an airplane, Coke tastes so much better on an airplane, you know something about the pressurization. To me, and that airplane is the one place I don't like Coke, you know what that's not even fair to say it's nothing I don't like Coke, it's just that the airplane is for the ginger ale, mm-hmm, the can of ginger ale over ice my god oh yeah my god that's good. I discovered something even more bougie than that the other day I was down in LA going to lie for that gig I did and nobody was getting gigs in Italy next band I was with my buddy Colin Moriarty not this calm another friend Colin and heat we were on Southwest there can only be one he knew he's flown Southwest so",
            "start": 901.9
        },
        {
            "text": "I did and nobody was getting gigs in Italy next band I was with my buddy Colin Moriarty, not this calm another friend Nick Scarpino and I were on Southwest there can only be one he knew he's flown Southwest so much that he knows kind of the thing oh they're gonna be annoying his **** I think some make a bunch of dumb jokes just get us there without crashing this is straightforward this one was like we were there where we were out but he goes I'll take a water but I want the whole can and I'm like what they have cans of water on Southwest blue they bring you the whole can and I'm like this got to be carbonate or something I open it up and I pour it into the glass it's just water and I'm like this is the biggest waste of resources I've ever seen in my entire life because it's water it's a can so you drink you're done in like five six you like smell that was water but isn't it the obviously because then they can crush it down and like they it's less waste on the plane I mean I guess but I mean",
            "start": 948.97
        },
        {
            "text": "drink you're done in like five six you like smell that was water but isn't it the obviously because then they can crush it down and like they it's less waste on the plane I mean I guess but I mean my assumption is one that usually they have water the big jugs so it's just I don't know I'm not I'm not a scientist I don't know what's better for the environment you know what a Southwest website come from somewhere because you don't have a spigot some incredibly annoying person probably pushing 55 and a pair of khakis is gonna be giving this water out more more appealing than our **** seating system um we're gonna be my than mine asteroids in 30 years so Deja Blue could put **** water in there metal **** pants the one thing I the one thing I want to say about airplane drinks is that I use I typically go in different directions because I took looking at apple juice and the reason I do that because I never buy apple juice so I'm just I have enough **** apple juice here's the thing when",
            "start": 991.39
        },
        {
            "text": "typically go in different directions because I took looking at Apple Juice and the reason I do that because I never buy Apple Juice so I'm just I have enough **** Apple Juice here's the thing when you order are in juice or apple juice on a plane with it and there and they you I I just do it out of fear now because there's just some **** random ass **** going on on airplanes where I'm like I want the Apple Juice no ice please who puts Apple Juice over ice and who puts orange juice over ice when they give you orange juice and it's an ice ax like what do you do it's like morbidly offense I'm like I'm like like they had like putting the ice in are you like seemed like no no no ice it's orange juice pour it in the glass they're sleepwalking through their day oh absolutely I was walking **** have to deal with farts and babies vomited on them all day long my mom was a flight attendant for a very long time before she you know when she was broker when she worked at Delta what she like",
            "start": 1038.19
        },
        {
            "text": "have to deal with farts and babies vomiting on them all day long my mom was a flight attendant for a very long time before she you know when she was broke, when she worked at Delta what she liked became a manager and putting other people's stuff all the time and then she became like head of a bunch of white things but but she yeah I mean she she was that's a very hard job oh yeah I have a oh you had a respect for God yeah my defenders because they don't also don't get paid a lot of money at all well I also know that how difficult I am to deal with and I'm in my cranky mood you know how sometimes I get no I know that mean well it's Kevin knows it really well okay I take it on Kevin see because crushing his soul so badly it's a hard job I will say this not for this is the final topic, the final part of the Saudi embassy, the final part now we've gotten it we have to have everything over ice everything in America has to be on ice you don't realize that until you go to Europe and",
            "start": 1074.37
        },
        {
            "text": "of the Saudi embassy the final part of the Final Fantasy Versus XIII now we've gotten it we have to have everything over ice everything in America has to be on ice you don't realize that into you go to Europe and they're not they're not ice crazy like we are everything has to be like cold so like that's probably what they respond to it is not the natural inclination is everyone's gonna want on ice I'm point everything over ice they try to pour like I'll take tomato juice on ice but you're right it's already cold its juice yeah it's just it should already cold that's the thing well that's the thing that bothers me I love fountain Coke too but well you know with the ice and then the I'm like it's already cold you know like it's like nothing's coming out of a fountain warm or a lukewarm or even room temperature it's cold already I just don't feel like you there's there's an issue of displacement and then there's an issue of watering down the Coke and I don't I won't have it I won't allow it and it's not",
            "start": 1119.13
        },
        {
            "text": "it's cold already I just don't feel like you there's there's an issue of displacement and then there's an issue of watering down the Coke and I don't I won't have it I won't allow it and it's not it's my Diet Coke on ice but I have to have that if I'm on a plane oh my guys also I'll back you up on the juice thing no cuz I oh every time I get on the plane I just feel depleted I'm like I need something I need something yeah there's some sugar or something cuz this that the half an hour I had to wait in the airport and then the line I had to wait into gas and you're staring at the **** digital map your plane's not moving is this **** plane even going in I'm just flying it you know forty thousand feet you're looking down looks like you're not moving it on I'm like losing my god mind look because we flew back from Boston when we came back from Iceland to San Francisco it's almost a seven-hour flight this time of year and going you know obviously east to west is worse because of the jet",
            "start": 1157.26
        },
        {
            "text": "we flew back from Boston when we came back from Iceland to San Francisco it's almost a seven-hour flight this time of year and going you know obviously east to west is worse because of the jet stream or river so I was like losing my mind they just kept writing you know like just I need more apple juice give me some apple juice that all right time to pay a bill tell you what our sponsor is Corn Refiners Association remember high fructose corn syrup it ain't that bad Tim wants to break this topic into well I'm saying that just because this I just got the official runtime from Kevin and it's about 52 minutes that we've been talking about having a good old time I'm just saying all right you want to make that one topic yeah okay cool it's the pointiest well because they'll be Coca-Cola for 52 minutes",
            "start": 1196.87
        }
    ]
}