{
    "id": 826,
    "video_id": "YEcYrTh_Wvo",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What is Going On With Konami? - Kinda Funny Gamescast Ep. 18 (Pt. 2)",
    "description": "Konami is having a crazy time.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1430830800,
    "duration": 1138,
    "transcript_chunks": [
        {
            "text": "so second topic of the day is Konami and all its Ridiculousness taking down PT, all this stuff. I just snagged it, did you get a look at that? Look at 2015 everybody. So how does that work? You just add it to your download queue. It's downloading on my home right now, but okay, you have to redeem it as well. That's all yeah, but if so, I added it to my queue like yesterday, but I haven't been able to use my PS4. Okay, am I screwed? I think my PS4 is off, so it's not doing the auto download stuff. I don't think you have to download... Check out, you know, ripping it from the entire thing. There's taking it off the store in terms of being able to purchase it still. If you own it, it should still be there in the background, correct? Well yeah, if it's downloaded on your system, it's there, but you can never download it again. So they just whitewashing it from the store so you're... Yeah okay, when's it done? When's it off? It's supposed to be off today, today, just... But you have to understand that I",
            "start": 0.31
        },
        {
            "text": "never download it again so they just whitewashing it from the store so you're **** yeah okay when's it done when's it off it's supposed to be off today today just but you have to understand that I don't even think Sony understands how PSN works so like whether or not they're going to be able to go in there and actually remove that game remains to be seen it's I'm sure it's something Konami wants to do mhm and they probably have a legal right in their contracts to do it and games have been removed from PSN completely before as we' talked about they've scrubbed completely like D I was trying to buy Mortal Kombat last week and the the only version that was on the store for at least two hours was the like special edition $90 version kept refreshing and then eventually like oh there it is yeah I can get it now yeah PSN's a jumbled mess of whatever John Drake's over there staring at he's like don't even know all right before we get into all of that our second sponsorship for the day is",
            "start": 47.52
        },
        {
            "text": "yeah I can get it now yeah PSN's a jumbled mess of whatever John Drake's over there staring at he's like don't even know all right before we get into all of that our second sponsorship for the day is Warby Parker oh they're A New Concept in eyewear contemporary eyeglasses that are extremely affordable and fashion forward have you guys heard of them used them are those are those them right now that you oh okay I was we were all touching our glasses do you wear glasses at all contacts I use contacts as well yeah but I also need to wear glasses like at home and **** no I was used to wear glasses but then I became the face of GameSpot and we needed a different shade away from God your face looks just like that guy's face if you just got some more gray hair we might be okay yeah no I have here's the deal with this is that as part either of this deal or whatever through our MCN they reached out to us and have Colin and I doing it so I've gone through and picked my five frames they haven't been",
            "start": 79.64
        },
        {
            "text": "Deal with this is that as part either of this deal or whatever through our MCN they reached out to us and have Colin and I doing it so I've gone through and picked my five frames. They haven't been shipped to me yet because Colin's dragging his feet, Sor well no, I I I went to do it last night actually and I was like I need to find my prescription because I'm not entirely sure what my prescription is for my lenses. One of the guys in GameSpot uses this service actually; I've seen it in in the office; he was picking through them. Yeah, their whole deal is that they're like cheap glasses that are like with fashion in mind and like make it look nice, and it's for prescription glasses and all that stuff, and it's trying to keep those down because glasses are expensive frames when you go to like the mall places and you're looking at all them; it's like hundreds of dollars. It's just like why, and it's just there's this whole system they got in place and all that stuff, System is the insurance.",
            "start": 120.84
        },
        {
            "text": "the mall places and you're looking at all of them it's like hundreds of dollars it's just like why and it's just there's this whole system they got in place and all that stuff system it's the insurance thing cuz I think these were like 300 bucks but then like your insurance covers 150 so then you just have to cover 150 like 150 isn't that bad but it's all designed that way yeah I know I know system that's a problem the system is designed to screw you and keep you sick let me tell you about the government oh my God but I got a lot of friends that use this stuff a lot of our friends over at Rooster Teeth have it like Alanah Pearce she uses it all the time and Burnie Burns and Maggie and stuff they use them and like they use them not even just from the uh because of Roost they use it just for their own personal stuff buy them and they're awesome like they look good they're good-looking glasses if you want to look good on Instagram you got to you got to get them you take all the Selfies and stuff you get all the",
            "start": 155.48
        },
        {
            "text": "What is Going On With Konami? - Kinda Funny Gamescast Ep. 18 (Pt. 2)\n\nstuff buy them and they're awesome like they look good they're good-looking glasses if you want to look good on Instagram you got to get them you take all the selfies and stuff you get all the likes it'll be great for your career I'm telling you so okay Warby Parker is the new way to shop for eyewear they got the coolest selection of vintage, vintage-inspired glasses and they're all available to you online so you just got to go online and you can choose the ones you want and you can choose five of them they'll send the frames to you so you can try them on do they have those ones they don't have we can email them and ask them to work on that though so they start at $95 their titanium collection starts at $145 if your titanium collection starts at $45 for glasses that's pretty good, one thing about it are they so are the titanium collections so light that you barely know they're there yeah but they're so sharp you can shank someone if they try and steal your glasses I can't confirm either",
            "start": 191.32
        },
        {
            "text": "about it are they so are the Titanium collections so light that you barely know they're there yeah but they're so sharp you can shank someone if they try and steal your glasses I can't confirm either of those who was it if it wasn't real she sings every song \"Titanium\" I am titani I don't know why I look we're going to get we're going to get a copyright strike yeah I don't know who that was I don't remember but it too accurate it was not Rihanna so yeah you can order five pairs to try them on there's no obligation to buy it so if you don't like any of them you can just return it and if you want to support the show right now you can go to Warby Parker.com KFAM that's KF G-M-S and you can receive Kentucky Fried Games it's something like that yeah it's either that or Kinda Funny I'm pretty sure it's Kentucky FR though um you'll receive a free expedited 3-day air shipping so that's awesome you order five get them in three days try them on take a bunch of Instagram pictures see which ones",
            "start": 229.96
        },
        {
            "text": "it's Kentucky FR though um you'll receive a free expediated 3-day air shipping so that's awesome you order five get them in three days try them on take a bunch of Instagram pictures see which ones you like try all of them on at the same time yeah you could I don't know nothing stopping you is a free country that's why I moved here now how do you spell the full URL the full URL is oh yeah cuz War Park I mean you'll see it here Kevin's going to put it because he's a good dude it is w-a-r-p-y-k-r.com slkf game games or parker.com kfam very cool very cool and as glasses where I appreciate the kind of fluidity of the of the whole thing about the choice and and and all that because glasses are expensive people always comment about how they like the these frames and the other frames that I wear and the fact is it's true like these frames are like 400 something dollars you know and they're nice they're beautiful glasses but like and my other ones were expensive too but it's it's Greg's",
            "start": 270.84
        },
        {
            "text": "wear and the fact is it's true like these frames are like 400 something dollars you know and they're nice they're beautiful glasses but like and my other ones were expensive too but it's it's GameOverGreggy's point it's like because insurance covers so much of them you don't quite realize how expensive some of these things are and lenses and all that kind of stuff and that whole thing and so I think if especially if you don't have Insurance like that this seems like a pretty affordable option I also really hate uh trying on glasses in the Optometrist's place I just don't like it yeah there's like it's a real kind of sales heavy situation yeah they're over they're walking around they're watching you yeah oh you like those yeah and they got those little stupid ass mirrors that are like all crooked barely fit your head in it so like being able to do it in the comfort of your own home just put the glasses on with your clothes and stuff and see without your clothes that is true but with different clothes and stuff like I",
            "start": 311.72
        },
        {
            "text": "so like being able to do it in your own home just put the game on with your clothes and stuff and see without your clothes that is true but with different clothes and stuff like I care about these things like to me glasses it's an accessory I like watches I like my shoes I like all this stuff and I want to know what it looks like with the outfits that I wear every day so I like this I'm all for being able to see yourself in game without clothes yeah well you need to know cuz you need to be able to see when you're playing that's why I hate going to the optometrist cuz I go naked and they get upset about it like I need to know what I look like this and every time okay guys Warpark.com KF games definitely check it out let us know what you think about it but now back to it Konami thank you oh Konami what's up Shia Labeouf that's the female vocalist in Titanium, the song's by Calvin Harris yeah I guess according to what I was able to dig up on Wikipedia and I doubt that's wrong don't",
            "start": 346.72
        },
        {
            "text": "What's Shia LaBeouf, a female vocalist in \"Titanium\" by David Guetta. According to Wikipedia, and I doubt that's wrong, don't you? Don't search it, you don't have time to search; not Konami, we're talking about Konami here. So Colin, I know you have a lot of thoughts about this specifically. The whole \"PT\" talk out of the way: should they take it off or should they just leave it? Yeah, it's a demo for a game, so I mean the whole thing was to find that is the whole idea of PT was to find that if you could beat it properly; that's a demo for a real game. So it makes sense for them to take it down since the game's canned, just patch it like the patch in Devil May Cry. Instead of it being like, \"Yeah, we're going to make another one,\" it just goes, \"Nope, this is probably the last one of these we're going to get to make.\" Norman is just like, \"Thanks but not thanks for playing.\" Yeah, I mean I understand why they're doing it.",
            "start": 381.72
        },
        {
            "text": "Another one, it just goes nope. This is probably the last one of these we're going to get to make Norman is just like thanks but not thanks for playing. Yeah, I mean I understand why they're doing it. Um, it's sad, it's it's too bad you know because eventually PT, PT is one of those examples of if you like we were talking about with I think we were just talking about it with uh digital games versus retail games last week or physical games about how well emulation and all these kinds of things let these games live in perpetuity. But will PT just kind of disappear in 100 years for ever, like is it something that is it going to be a lost game like these Mainframe games you were talking about on Colin and Greg Live yesterday? Um, I don't know but I understand why they're doing it. Yeah, I mean that's the least that's the least of everyone's but that's the thing right now what a I mean they've it's been so much turmoil behind this whole Kojima Konami thing what's really happening what's not happening.",
            "start": 422.24
        },
        {
            "text": "least that's the least of everyone's problems, but that's the thing right now, what a mess I mean they've had it's been so much turmoil behind this whole Konami thing, what's really happening, what's not happening, people talking, they're scrubbing his name from the the ill will they were already engendering now like and also we're taking on that game you all love and like we're so we're breaking your hearts and telling you it's canceled, all this other stuff, it's like man Konami is in a world of trouble right now, now you know what I mean, sucks for them, it does man, I I feel really bad about it too cuz I love Metal Gear and I like I was very interested in Silent Hills and it's just like man this is just they got nothing anymore so how much is it though you feel bad and you you're interested in Metal Gear in Silent Hills how much of it is though you're interested in what Konami does and you'll just follow him rather than Konami, I mean that's 100% it yeah right I didn't care about Silent Hills but it is sad",
            "start": 456.52
        },
        {
            "text": "in Silent Hills how much of it is though you're interesting what Hideo Kojima does and you'll just follow him rather than Konami I mean that's 100% it yeah right I didn't care about Silent Hill but it is sad to see like this company who's been around making games since whatever like early '70s when they they started making like arcade machines and then eventually sort of accidentally went into the software world like they've been around forever so it's it's kind of disappointing to see like in the space of a month like when when Peter broke the story about uh Kojima on Gamespot last month uh like since then it's just been a like number of these things the the other and they're like game stuff like uh I think it retracted by uh 5% in third quarter of last year whereas they're like arcade stuff the Pachinko business is getting bigger like this isn't like a normal game developer here in the west like these a lot of like the Japanese companies have got like way more diverse Portfolios and they",
            "start": 492.8
        },
        {
            "text": "Pinko business is getting bigger like this isn't like a normal game developer here in the west like these a lot of like the Japanese companies have got like way more diverse port portfolios and they have their their weird business in like health spas and they have their their gambling stuff and the pinko and whatnot like it just kind of looks really disappointing as if they're like slowly just stepping away and there that's the interesting thing for a consumer right now especially on the eve for the launch of Metal Gear Solid is like what is what is the average gamer taking away from this right now they're delisting themselves on the stock exchange and stuff and this is like the **** that the last time you heard about this kind of was THQ going bankrupt stuff so like that's the vein you start to think in it but is it just yeah they're realigning their themselves corporately they're getting out of software they're gonna say goodbye to PES and let FIFA rule the day and yes do in a way",
            "start": 534.24
        },
        {
            "text": "What is going on with Konami? - Kinda Funny Gamescast Ep. 18 (Pt. 2)\nstart to think in it but is it just yeah they're realigning their themselves corporately they're getting out of software they're gonna say goodbye to PES and let FIFA rule the day and yes do in a way it's like it's not a bad time for them to do it because the Metal Gear like Metal Gear fans this is hopefully going to close the loop on that whole narrative so it's yeah it's kind of done and like fans of Kojima I like I love those games but I want him to make something else like he said he was quitting Metal Gear games before Metal Gear Solid I was every Metal Gear game right so like sounds like he's finally getting pushed out of the way like PT was really interesting I would have liked to see a new Silent Hill but I can live with another PES if he gets to do something else and Pro Evolution Soccer is a cool game like I I buy FIFA games every year but you know PC was just so different you know what I mean not being a huge survival horror fan never really getting into",
            "start": 570.88
        },
        {
            "text": "and Pro Evolution Soccer is a cool game, like I buy FIFA games every year but you know PES was just so different, you know what I mean. Not being a huge survival horror fan, never really getting into the Silent Hill series before, or Silent Hill games before, like playing this one in first person, like I was never like trying to be in combat with anything right? You're just like and I know there's a scare on the corner but trying to piece it all together, I'm playing in a dark room and I'm getting it was like that's so cool. And then you know apparently Hideo Kojima is just the kiss of death for any video game or any company that's publishing his video game, you know what I mean? Still doing okay but that's about it. Probably it's just crazy to see a company that once had press conferences at E3 every year now be here, you know what I mean? Like Konami is like I always remember growing up and it being like one of the big five, you know, or whatever, like and it was definitely a huge thing and",
            "start": 609.96
        },
        {
            "text": "What is going on with Konami? - Kinda Funny Gamescast Ep. 18 (Pt. 2)\n\nyear now be here you know what I mean like Konami is like I always remember growing up and it being like one of the big five, you know, or whatever, like and it was definitely a huge thing and now to see them essentially just backing out completely and it's it's really crazy but the other thing is is the only reason that we're noticing all this because there was that one news story so then all the other things are latching on they're looking for all this and so it just kind of like avalanches from there and it just seems like a bigger deal yeah like if they pulled out of the stock exchange would anyone care also what does that mean like we're none of us are economists like it seems like most of their I think like something like I did some reading on it during the week I think something like less than 1% of their equity is in North America anyway it's all in Japan so it just they were saying like it's not really feasible that much to for us to be open like it's still",
            "start": 648.72
        },
        {
            "text": "Konami is having a crazy time. something like less than 1% of their like equity is in North America anyway it's all in Japan so it just they were saying like it's not really feasible that much to for us to be open like it's still you can still run it it's just not on the open exchange uh so yeah like maybe you're right maybe there is a bit of like confirmation bias happening in some of this but just with the Konami stuff that that looks pretty damning to see like him getting kicked out all that stuff getting rebranded like even the one down in LA all the Konami production stuff has changed um like I think the one part of this that people care about is what's happening to Metal Gear and once that game comes out what will Konami do next anything or nothing cuz they've not nothing else really to show for you know Pez makes them more money than MGS does MHM it's crazy yeah it does yeah Pez sells very well uh yeah I read I read into it the same thing with the New York Stock Exchange thing they're still on the stock",
            "start": 684.44
        },
        {
            "text": "them more money than Metal Gear Solid does. It's crazy, yeah it does. Yeah Pez sells very well, uh yeah I read, I read into it. The same thing with the New York Stock Exchange thing they're still on the stock exchange in London and Tokyo obviously would be their most important place and they're still vibrant there. I mean you're right in the sense when you go to Japan we've been to Japan and you see Konami signs everywhere and what you realize is that it has nothing to do with games, it's like their spas and their gyms and all these kinds of things and they have gambling and all these kinds of things. Like a lot of people not a lot of people but some people you know saying something interesting about this recently which is maybe Konami is being really smart like they're not they have these they have like real estate business and stuff like they have like all this random stuff and and maybe the the number crunchers there the bean counters and like all of the the executives are like we don't",
            "start": 723.12
        },
        {
            "text": "like real estate business and stuff like they have like all this random stuff like and and maybe the number crunchers there the bean counters and like all of the executives are like we don't really make any money here like why are we even doing this like we have all these other things where we make money as you were saying you know there's a more profitable way to run our business and we have stockholders and we want to make money so like are we going to make money making traditional software or are we going to make money making pachinko machines and and you know all this kind of stuff and they're probably saying like maybe we need to scale back the reason that we should be scared as Gamers about this is because it they're locking up a lot of IP presumably and Metal Gear is important but the one I care about the most is Castlevania and um you know watching MercurySteam with that 3DS game and Lords of Shadow 2 just take a **** down Castlevania's throat was a really",
            "start": 754.32
        },
        {
            "text": "but the one I care about the most is Castlevania and um you know watching Mercury Steam with that 3DS game and Lords of Shadow 2 just take a **** **** down Castlevania's throat was a really sad way to see was really a sad way to see that series maybe end you know what I mean and and what is it Simon Belmont you see getting no I see Mercury Steam is like a big machine a robot that's **** down uh sh **** down a a uh an open case, like it's an amalgam of cartridges and discs and construction manuals splattering all over yeah and so that was really sad to see but the writing's been on the wall with Konami for a long time and like anyone who's played games for a long time knows that this company has been on a steep decline um and the coima things Salient and important because Coima is Konami and without Coima they have nothing you know they don't have Contra anymore they do not have Metal Gear now so the two people that were in charge of their two biggest franchises are gone so why",
            "start": 790.52
        },
        {
            "text": "and without Konami they have nothing you know they don't have Hideo Kojima anymore they do not have Konami now so the two people that were in charge of their two biggest franchises are gone so why should you have any faith yeah that like we already saw what happened to Castlevania when when when no one's minding it you know it turns into **** and then you we we are going to see probably in five years what happened to Metal Gear when Konami is not involved in it and I'm not saying Metal Gear is like my favorite franchise anymore because it's not but like there's there's reason for them to be nervous the fact that they got rid of Kojima and let him walk away says it all because Kojima as I've said several times now can kick Bobby Kotick's **** door down be like hey dude my name is Hideo Kojima I want $25 million 100 people an office building in four years and it'll be like sure sure and then guys from EA are going to bust through the wall like the Kool-Aid man be like oh",
            "start": 840.4
        },
        {
            "text": "name is too Hideo Kojima I want $25 million 100 people an office building in four years and it'll be like sure sure and then guys from EA are going to bust through the wall like the Kool-Aid man be like oh dude we'll give you $35 million in 150 guys in five years and then Sony and Microsoft like he doesn't give a flying **** probably you know he'll be totally fine all I want from this all that I want is to hear Hideo Kojima say hey dude that's it yeah yeah he probably says it in Japanese um but you understand what I'm saying like Kojima is a big deal Kojima will work for another it's again Greg and I talked about it reminds me it's it's maybe a lesser of a deal but when Amy Henning left Naughty Dog I can't imagine how many people are **** tripping over themselves to hire her yeah like she can go where she wants and she walked into Visceral and his and his uh writing writing a Star Wars game you know what I mean like so an in Star Wars game by the way which is like unbelievable so",
            "start": 879.36
        },
        {
            "text": "She can go where she wants, and she walked into Visceral and his and his uh writing writing a Star Wars game, you know what I mean, like so an in Star Wars game by the way which is like unbelievable. So he can he can do whatever he wants. The fact that Konami maybe Konami but again there's another side to the story that I don't think we're getting where it's like Konami's probably looking at him be like Kojima cost a **** ton of money. He probably has an entourage of I I I you know presumably a couple dozen people that probably have worked with him forever, that like are just and I'm not saying they're not doing any work but they're just there like they come with him you know. And there's probably a lot of politics and internal things that we don't understand and don't know about that the Japanese media probably knows and understands a lot better than we do. Um so there's always another side of the story, but I understand why people are upset about this. It's just that we have to look at it.",
            "start": 918.68
        },
        {
            "text": "What is going on with Konami? - Kinda Funny Gamescast Ep. 18 (Pt. 2) \nmedia probably knows and understands a lot better than we do um so there's always another side of the story but I understand why people are upset about this it's just that we have to look at it from different through different lenses that Konami is a company that needs to survive they're not here to make they're not you know they're not here to make games and be you know a charitable organization if Metal Gear Solid is not going to make them a lot of money then why the hell do they want to do it you know and um it's the same thing with with uh you know just getting out of games completely maybe and getting out of software completely it's sad to see but the middle ground continues to shrink and Konami is in the Middle Ground just like Capcom does you think there's a chance that they will back out of gaming and kind of give their not give sell their yes I think there's I think there's a substantial chance that they'll do you think they'll sell their properties though cuz that's like how does",
            "start": 955.88
        },
        {
            "text": "of game and kind of give their not give sell their yes I think there's I think there's a substantial chance that that Konami do you think they'll sell their properties though cuz that's like a how does that even work I don't know just why would you like if if this is something that in the future you can if this is an area that you can re-expand into if the time comes why would you like get get rid of those problems who would buy them oh my God Contra how much money do you need like they have three or four properties that people would scoop up in two seconds right like Metal Gear and Castlevania there would be a huge bidding war over both of those I think and you also have to understand they own Contra which is interesting they own Dance Dance Revolution they own like Suikoden and all these like random things so it's like they have games and they have back catalogs like to own the Castlevania back catalog would be an extraordinary thing like even if a company was like we're not making",
            "start": 987.88
        },
        {
            "text": "Random things, so it's like there they have games and they have back catalogs. Like to own the Castlevania back catalog would be an extraordinary thing. Even if a company was like, \"We're not making any new Castlevania games,\" we just want all of the ones you already have. Like that would be money for years; they just re-publish them and put them in collections and do all these things. I would do that if I had the money and capital. But um... And I think there's money to be made there, obviously. But I think there's a reasonable path for them to exit the industry because they're letting their biggest guy go. So it's not like you don't make small games to make little bits of money; you make big games to make big amounts of money. If they don't want to make big games with big guys like Hideo Kojima anymore, then clearly they don't think they can make money anymore in games. So I think that's a harbinger – right? Like it would make sense if they were like, \"Well, when Igarashi left, it was like...\"",
            "start": 1022.04
        },
        {
            "text": "anymore then clearly they don't think they can make money anymore in games so I think that that's a harbinger right like it would make sense if they were like well when Hideo Kojima left it was like it wasn't it was sad but it wasn't like a big deal because well Castlevania lives on with MercurySteam and you're not coima you know like you made the MetroidVania Castlevania what it is but we can do that without you and stuff like that I don't think Metal Gear can live without Kojima um and I don't think that you cut off the you know cut off your nose to spite your face kind of thing either like I just don't think it makes any sense I want to believe and I do believe Konami is smarter than they seem right now you know that there there's a plan and that we just don't understand it because we're not I don't want to put it at such a base level but we're not the Japanese consumer that consumes the other things they do so this looks really bad but I think there's more to within that",
            "start": 1056.44
        },
        {
            "text": "not I don't want to put it at such a base level but we're not the Japanese consumer that consumes the other things they do so this looks really bad but I think there's more to within that cool there you go Colin I like I love when Colin does that when he  makes a point and then just this guy  like makes thing and backs up well let someone else your mic drop I talk a lot start it though you see you you always end it cuz you do the thing where you lie and wait you're Batman about it you let us go we talk talk for a while and I see you over there biting your time and then the the show swings to you you go you deliver your thing and you're done that's great I'm so happy to be here because like I love all you guys he's one of the smartest  in video games oh oh thank you that's very he's also one of the coolest dudes in videos",
            "start": 1091.76
        }
    ]
}