{
    "id": 2067,
    "video_id": "BmwqKN0LGHE",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Let’s Play Watch Dogs 2 – Kinda Funny Plays",
    "description": "This video was brought to you by Amazon and Ubisoft.  Preorder Watch Dogs 2 to get the Zodiac Killer Bonus Mission and get 20% off if you are an Amazon Prime member: https://www.amazon.com/Watch-Dogs-2-PlayStation-4/dp/B01GKF7T9S/ref=sr_1_1?s=videogames&ie=UTF8&qid=1474585747&sr=1-1&keywords=watch%2Bdogs%2B2&th=1\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1474648881,
    "duration": 2227,
    "transcript_chunks": [
        {
            "text": "This video is brought to you by Amazon and Ubisoft. What's up everybody, welcome to another let's play here on YouTube.com Kinda Funny Games. I'm one of your hosts, Greg Miller, alongside the Pure One Tim Gettys. Let Tim H looks like you've already ruined this 2 let's play of course as you can see why are we playing it because we're from San Francisco and when I say we I mean Tim I've been here a decade so I know the topography pretty well as well you're just driving around right now we're going the sunset that's where that's where I live that's where that's where you live the original Kinda Funny studio, the original Kinda Funny Studios out in the Sunset yes uh how much of Watch Dogs 2 have you played to? I've played about 30 minutes I'd say at this point okay okay good what are you thinking so far? I'm liking it a lot. Have you done any story stuff? Uh not really, I played around a little bit there's a lot of things to hack there's this little Robo remote control thing you got the Drone yeah",
            "start": 0.16
        },
        {
            "text": "Far, I'm liking it a lot. Have you done any story stuff? Uh, not really. I played around a little bit. There's a lot of things to hack. There's this little Robo remote control thing. You got the Drone, yeah. But what's the most fun for me is going around here looking and seeing in San Francisco. No, that's exactly what I did. We were at an event here at Ubisoft, uh, of course, this is brought to you by Ubisoft. Uh, we said that in the beginning in the ad or whatever, so if you want to take our opinions with a grain of salt as we go, but you know, if you're watching this, we're totally cool people who give you your opinion, no matter what we're allowed to say if we hate it. But I don't hate it so far, no. So this right here, this is the Great Highway, yeah, exactly. No, that's the thing - I did exactly what you did. We got a little tutorial and then I just drove around, and I drove out to my house where you're... you're out here in the sun. What's cool is so over there, those two towers we see, that's",
            "start": 35.16
        },
        {
            "text": "what you did we got a little tutorial and then I just drove around and I drove out to my house where you're you're out here in the sun what's cool is so over there those two the towers we see that's really close to your house that's a school isn't it uh well it's new school it's a church thing but it's connected to a school right there's that playground in the back I see a lot of kids playing there you correct why am I watching those playgrounds don't worry you're pretty littlee about it don't worry you're pretty littlee about it all right so yeah here this is the Sun District you might might be familiar I am no one else is probably not you can see that that's the equivalent of what like the the end would be yes you've heard Colin making a lot of complaints about over the years go up here oh my God Tim do you know how to drive not not well okay well now that doesn't matter I'm a big fan of the motorcycles I want you to go right the these look like Sunset houses oh yeah totally go",
            "start": 66.64
        },
        {
            "text": "Here oh my God Tim do you know how to drive not not well okay well now that doesn't matter I'm a big fan of the motorcycles I want you to go right these look like Sunset houses oh yeah totally go right let's see if this cuz this should back right go right go right what do you mean are we trying to get to your house no we were trying to go to see if Andronicos is over there oh Andronicos I already know my house is here doesn't matter this is the their Golden Gate Park much different than the real Golden Gate Park but still where it should it has all the I go right again if there's a super cuz like the thing is like no let look look right here no okay it's just this cool yeah cuz here give me the thing give me the damn thing give me let me do the damn thing but look this is like N Irving sure like it yeah there's all the food and stuff a video game no but no no no you're you're thinking I'm taking it in a bad Direction I'm not I'm going to show you actually first off yes this is all",
            "start": 99.48
        },
        {
            "text": "Sure, like it, yeah, there's all the food and stuff. A video game, no, but no, no, no, you're thinking I'm taking it in a bad direction. I'm not; I'm going to show you actually first off, yes, this is all very Sunset. This would be Lincoln Boulevard right, and what I really love is something fast. I'm too fast, too. There's a windmill, yeah, that's real; that's really in Golden Gate Park. Uh, but what's more interesting I feel in terms of like, oh my God, they nailed it is the fact that when you come out of Ocean Beach, when you come off of a great highway here with your back to Ocean Beach, there is this gas station. There's a gas station just like that; there you know what I mean. They've done a good job. There are some things that I'm like, I'm very surprised that are there, like let me show you. Sure, there's a place I want to take you, Greg. Take me to a place, show me where your first kiss was. To well, so it's not so much first actually; I can um. The Taco Bell won't be there, but sure, so this is Golden Gate Park.",
            "start": 136.52
        },
        {
            "text": "a place I want to take you Greg take me to a place show me where your first kiss was to well so it's not so much first actually I can um the Taco Bell won't be there but sure so this is Golden Gate Park many episodes of 11 sex stuff was shot here um is that the lake um looks like a lake there's the lake this is the lake so as you can see um if there's a bench around here somewhere there's not but it would have been like right here that's where we did the how to bring up butt stuff there's your there's benches oh there we go that was the bench there it was from how to bring up butt stuff one first commemorate that one of the first love and sex stuff episodes we ever did um that's really the guy was taking a selfie you just ruined damn you see those sweet tricks though yeah you all right so I'm trying to take you to ILm which is where Kevin's girlfriend Paula works are we going to see Paula um she she is in the game oh my god um they did not pay for her likeness just random white girl",
            "start": 171.12
        },
        {
            "text": "I'm trying to take you to ILM, which is where Kevin's girlfriend Paula works. Are we going to see Paula? Um, she... she is in the game. Oh my god. Um, they did not pay for her likeness; just a random white girl working at ILM in a dead-end relationship with a goddamn potato. All right, all right. Hold on. I think it's around here. You're definitely yeah, you're getting up in the Presidio area. Yeah, this is this is very true to the City. All the Army Barracks here that you'd expect. There's the Golden Gate Bridge. There is the Golden Gate Bridge. I bought my bike over here, right down there. I bought my bike down... oh yeah, yeah. And then I rode it out of there. And let me tell you, if you want to see somebody who hasn't ridden a bike in 20 years ride it up the hills of the Presidio, it's not pretty. H all right. Well, what did you do? You could find Island... oh God, that's a rock. Why did you... you drove right into it like that was the destination. My world... ah Jesus. Tim. All right. Going there's a jump there. You just miss.",
            "start": 214.4
        },
        {
            "text": "what did you do you could find Island oh God that's a rock why did you you drove right into it like that was the destination my world ah Jesus Tim all right going there's a jump there you just miss a sweet jump sweet jumps sweet jumps now you're now you're heading out to the marina isk yeah you're gon to go to the marina you're gonna see the Tipsy McScarpino's house you're gonna see Aaron's house here we go here we go so this right here Arts Kevin and Paula are thinking about getting married in there so it's too expensive isn't it too expensive it's not the restrictions kind of the restrictions suck you think I can go in the water the other side I don't know how deep it is no you can't but you can park your bike there Tim push your bike I I I can Vault over it though yeah that's cuz of the park oh no that that bike's not coming back that it's done man I lost my bike well it's okay so again yeah more love and sex stuff episodes Sure Shot in this very Dome and one day maybe just maybe",
            "start": 257.8
        },
        {
            "text": "park oh no that that bike's not coming back that it's done man I lost my bike well it's okay so again yeah more love and sex stuff episodes Sure Shot in this very Dome and one day maybe just maybe Kevin and Paula could get married if the restrictions aren't so bad everybody send fan mail to the Palace of Fine Arts to tell them to lessen the restrictions we can pretend we want the traditional provian wedding so we need the goats s we need the goats in there do you have to end at seven if we do it there no can you booze there you can but like can you get drunk at seven no break this guy's guitar hack that guitar hold L1 oh I don't know what I just did you Just Dropped a Bomb of some kind I'm just throwing things left and right I don't agree with how you're doing oh no Tim oh no right down the street I know I'm trying to get there well now you're going to jail I know I'm trying to I'm trying to knock jail get they are calling I need my motorcycle how am I going to do this you do any",
            "start": 298.48
        },
        {
            "text": "the street i know i'm trying to get there well now you're going to jail i know i'm trying to i'm trying to knock jail get they are calling i need my motorcycle how am i going to do this you do any there's a motorcycle don't worry about the motorcycle mean i need to starting to rain true to form for San Francisco there's another I got it oh Vault I don't think the cops are after you no they're after me we got yeah we got the exclamation there whenever and let me tell you in this game they don't mess around no they come hard I come hard all the time good screaming too there is thanks there we go all right so here we are this ISM in this game that's called Hook movie productions or something oh for hook so right here like straight ahead that thing I'm so there was an 11 sex stuff episode shot right here uh that was our one night stands okay okay i i appreciate i believe only Tim Gettys could take a sponsored let's play and turn it into one big ad for kinda funny videos that's the only",
            "start": 349.84
        },
        {
            "text": "right here uh that was our one night stands okay okay I I appreciate I believe only Tim Gettys could take a sponsored let's play and turn it into one big ad for Kinda Funny Videos that's the only show that we get out of our studio get out go they're right there they see right this is a Starbucks in real life great no car Nick go there all the time oh my God all the time D I've gone there your body is still in the air son give drive wreck you got wrecked all right so I'm taking the control cuz you and I did the exact same thing there's the little thing first off do you think they have the Yoda statue cuz the Yoda statue is pretty cool we went we went over there Yoda statues should be over there yeah there is a statuesque thing but it's not Yoda clearly it's not going to be Yoda I'm just saying like do you think they went that far as to put some other Statue there I think you're going the wrong way really yeah I don't think I'm going the wrong this it should be right there in the",
            "start": 393.84
        },
        {
            "text": "saying like do you think they went that far as to put some other statue there I think you're going the wrong way really yeah I don't think I'm going the wrong this it should be right there in the entrance to the thing going right looks right to me I maybe they've just done some oh here you go no okay this is it this is where we'd come in that would be Yoda but it's not nobody that ain't no Yoda that's a Nota all right uh no but what I did with uh mine is running around and just driving motorcycle I don't want a motorcyc it's our signature is it what what who decided it was our signature me I don't like that at all so hold on look at it and it's blue okay so apparently I'm not allowed to draw open maps so sorry for the abrupt cut there it's an early version of the so what we're doing is now we're going to drive over to oh s and see the Ubisoft building did you go to the Ubisoft building I have not yet I was more exploring our NEC of you wanted to go see what our crazy person there",
            "start": 436.12
        },
        {
            "text": "Now we're going to drive over to the Ubisoft building. Did you go to the Ubisoft building? I have not yet. I was more exploring our neighborhood, you wanted to go see what our crazy person there's so many motorcycles. You're not aren't that can be your signature. I don't know if you noticed but the only reason I got this jacket is because his his jacket Marcus's jacket looks so cool. Marcus CP Stephie gamer uh I put a picture out on the internet some of the twitters and some kid was like hey there's a jacket just like that you can buy so I got this on Amazon. I freaking love it. You might have seen it in many shows, like every Monday 9 a.m. God Tim most games nobody cares the games cast is you know doesn't need any more promotion apparently oh my God ooh look you so here we are Union Square to your left yeah you know what that means big old Burger Bar right up there Burger Bar yeah burger talking about that that sweet nasty um Cheesecake Factory where you can get your patented Buffalo",
            "start": 470.56
        },
        {
            "text": "To your left, yeah, you know what that means? Big old Burger Bar right up there. Burger Bar, yeah, burger talking about that sweet nasty um Cheesecake Factory where you can get your patented Buffalo blast. We do love buffalo blast. Cheesecake Factory if you're listening. Burger Bar is up there and then that means that over here would be Morton's. Yeah, I know, I know. Union Square based on it eateries over here is a hotel up stadium before there's also a Victoria's Secret. There don't ask, I know that you don't want to know. It's true. That means we're on Powell Street. It means there be GameStop right down here too. Power of the players but it's all it's all shoved up. Oo, it's all back you know shoved up a little bit into one thing. It's a smaller San Francisco crazy how accurate it is like oh there you go City Hall yeah City Hall you know it well gay pride flag out there nice and then this is where I've gotten drunk many a time in this in this part oh I wonder if the Red Box is there cuz the billboards",
            "start": 511.2
        },
        {
            "text": "City Hall, you know it well, gay pride flag out there, nice. And then this is where I've gotten drunk many a time in this part of the city. Oh, I wonder if the Reylotts are there because the Bill Graham's there, where we did a Kinda Funny live too. I graduated in that building. Now how do you feel the fact that this is so much cleaner than San Francisco? It's not... it's not. Oh, it's Chinatown, there. It's not nearly enough poop. Yeah, Chinatown's out here. Okay, cool, Chinatown's that way. Do you want me to go? I I want to take I want to take it to Ubisoft. I feel like because that was our big thing is like when they when they said it was going to be in San Francisco, I was like I can't wait to see what Ubisoft does for itself and then if it will do something for IGN, which is one block away from you in real life. Oh, here we go. This is where IGN would be. No, not yet. We're coming Second Street. Did it say second? No, but it is. You can just look at it. I but I know we're coming in. I think they",
            "start": 548.8
        },
        {
            "text": "in real life oh here we go this is where IGN would be no not yet we're com we're coming Second Street did it say second no but it is you can just look at it I but I know we're coming in I think they this is the second yet cu no yeah this is yeah that was second third would have I mean we're going to Ubisoft so I'll show you that it where we are you know what I mean like I went there in my game I went to see where I was this tunnel don't exist this is a made-up tunnel there ain't no tunnels downtown get that bike no don't don't don't don't there's cops they don't care there we go Pac Park so there you go or AT&T Park there's Ubisoft I've been in SF a long time now Ubisoft honestly not that it looks a lot like this in real life yeah they did a really good job of that's pretty cool is IGN there no cuz it's again shrunken right this kind of looks like this kind of looks like the grilled cheese factory this is the grilled cheese factory right right but again that shouldn't be here on this",
            "start": 587.12
        },
        {
            "text": "no cuz it's again shrunken right this kind of looks like this kind of looks like the Grilled Cheese Factory this is the Grilled Cheese Factory right right but again that shouldn't be here on this block there South Park South Park there's amazing burritos over there now when Tim says that there's amazing burritos right here is what he means there's burritos there no no are theying their fajita burrito is amazing I've never had a better fajita burrito all right well hold on let's see if they put Hard in then cuz HR this would still be in the this we wouldn't pop out yet I'm assuming it's cuz this is that little what is this what is that uh that place where people used to get Salsa all the time at I it's right there something with a p I forget clearly I didn't go there that often then Hard would technically be here yeah but it ain't and the Garage oh Garage there's some really good food which I'm assuming is just taken up by an actual Garage here right right right all right so anyways so",
            "start": 631.28
        },
        {
            "text": "technically be here yeah but it ain't and the garage oh garage there's some really good food which I'm assuming is just taken up by an actual garage here right right right all right so anyways so that again this is third then in their world right because that's where Ubisoft is so the second would be the next one that'd be like little Skillet on there but uh no they don't have anything even so like this would be it then right oh sorry so there's Ubisoft so the next block then would be IGN down we go here we go IGN would be there in everything is a messed up but this does look a lot like the public storage on the corner it does it do I appreciate that wow they really did a good job with this no it feels it looks a lot like San Francisco this that was my first takeaway uh when we when I got lcan in the city right is like I this is a world I want to run out and explore and screw around in right like I I enjoy what we're doing we're are you doing it what am I doing getting Mr scooty oh no",
            "start": 669.04
        },
        {
            "text": "Let's Play Watch Dogs 2 – Kinda Funny Plays\nI can run in the city right, this is a world I want to run out and explore and screw around in right. Like I, I enjoy what we're doing, we're are you doing it? What am I doing getting Mr Scooter? Oh no, no, you're Joy get your hot dog out of here! Damn cop saw me too. This guy saw you too. Anybody be who's going to be a hero? You going to be a hero? Damn things escalated real fast. You be hero. Holy crap! Now if you excuse me I got back in your Jeep, got motor dead sick. I already have a flat tire or something. There's the Bernal Park there's so many motorcycles as well. Hunter Pence he's there doing his home runs and stuff. Yeah yeah, that's what he does. Hunter Pence does the Home Run. Good job! Uh we just pass Pete's Tavern we got uh acne or whatever it is they CH oh they had the statue for Willie Mays of course they do. I mean it's not Willie Mays of course who is it? Is it? I mean it's San Francisco, bruh up yeah but I mean let's see what it says. I mean Ocean Beach was Ocean Beach yeah but Willie Mays is a person that",
            "start": 710.64
        },
        {
            "text": "Do I mean it's not Willie Mays, of course, who is it? Is it I mean it's San Francisco, Bernal Heights, yeah, but I mean let's see what it says. I mean Ocean Beach was Ocean Beach, yeah, but Willie Mays is a person that looks like him. Oh, it looks like a generic all right, you know what? Go over here, I hosted a wing-eating competition back over here this weekend. Um, what game was it? I'm about out, I'm a little out of control. It's weird that there's a drone in this game. There was one time, one of the first times when I worked back at IGN doing uh PR thing with Ubisoft people, we had me and Ryan McFarland go out and right around here, right yeah, right across this bridge, we flew drones, see like didn't work too well over the weekend. I when I hosted that wing competition it was right over here not on not on these railroad tracks but what part of the city this area, yeah, they've taken some liberties so it's obv this would be Lombard but it is still an up-and-coming area there'll be a lot they're putting a lot of condos and",
            "start": 764.8
        },
        {
            "text": "tracks but what part of the city this area yeah they've taken some liberties so it's obvious this would be L but it is still an up-and-coming area there'll be a lot they're putting a lot of condos and stuff here oh man we're in the backwoods of SF right now we're going back towards Damon Hall hopefully um okay let's head back to the city uh we're going to the mountains we're going to lose these cops the only way I know how guess what cops we call them pigs where I'm from God Pigs Can't Fly you know what I'm saying saying so there's a there's a wheel you can come up with I forgot how to do it maybe it's the down on the which tell me what you I can do you do emotions and stuff oh yeah you can also give them the whatever early when I was doing the demo this cop was walking by and I accidentally did it it's just like I was like oh God the cop is all that he got really mad and started shooting at me which I thought was a little hostile but I I'm sure I deserve it this I told you Pigs Can't",
            "start": 806.2
        },
        {
            "text": "Did it, it's just like I was like, oh God, the cop is all that he got really mad and started shooting at me, which I thought was a little hostile but I I'm sure I deserve it. This I told you Pigs Can't Fly we're Ser oh my God that guy what was that guy? That guy was just chilling up there. I appreciate that he was up there; he hiked up there and now he's just up there doing like man, what's my financier? You think yeah totally Sean Finigan; he's up here taking photos of somebody probably against their will. God, what the hell? All right, we're getting out of the car; we're moving on. You're crazy; you're crazy, Craig. Why start get another car? Sure, but let's stun this guy first; stun him. Oh, he got him in his hand; he didn't even see it coming. Sorry, sir. I hope the hike was worth it. All right, he's done; we don't have to worry about him being a problem anymore. Would you like to see me do some sweet motorcycle riding? Yes, thank you. Like to see take it off the jump there we go; we got the Trans Am before you do the",
            "start": 852.6
        },
        {
            "text": "to worry about him being a problem anymore would you like to see me do some sweet motorcycle riding yes thank you like to see take it off the Jump there we go we got the Trans Am before you do the jump let's look at everything we got the Golden Gate Bridge over there we got the Transamerica Pyramid Golden Gate Bridge we got a bunch of other things that are made up and not really an Bay Bridge right there Bay Bridge we got the that means I used to live right over there it was great it was awesome I miss it every day whenever I wake up and see  Colin in his underwear I'm like God damn it why can't I live in the old place yeah cool all right the new Kinda Funny Studios area is not here nor the building that I grew up in in my home not there maybe the DLC so so we're on Twin Peaks now where do where do you want me to go where do you want me what do you want to do talking about making out with girls great Twin Peaks great place for that how about we just rip this out cuz that's",
            "start": 894.8
        },
        {
            "text": "where do where do you want me to go where do you want me what do you want to do talking about making out with girls great Twin Peaks great place for that how about we just rip this out cuz that's oh that doesn't solve the problem does mine solve the problem none of mine solve the problem we're in a living nightmare he what's going on there we go you know what still rolling us Happ Kevin technical diffic difficult Kevin what happening TCH support there's a lot of noise in our headphones I'm just going to take it out we don't it we just don't need well you know what Kev we want to have a good time and see stuff do the eyeballs yeah everybody knows that just like smell uh 90% of seeing things is hearing things are they making out anything they're definitely making out I've never been in Twin Peaks and not made out with someone really fact I've never been in Twin Peaks which is why I've never made out with somebody you're doing it wrong you should take Jen there be like what's up she be",
            "start": 937.16
        },
        {
            "text": "Peaks and not made out with someone really fact I've never been a Twin Peaks which is why I've never made out with somebody you're doing it wrong you should take Jen there be like what's up she be making out with you before you even know it who he talking to you think he's talking to his watch talk to people talking to people trees Parks now it's all apart full of te he's making good points no he's not yeah he is we are those people yeah I know but we're ugly it's true everything he's saying is true you can't even afford to live here Tim you're right but you can afford to die here thank you thank you I thought you were betraying everything I stood for shot all right who you going to call Ghostbusters he ain't calling nobody damn shot shot live it away just like oh my there's one more she ain't ready she definitely ain't ready damn what a place to die there you go get back on that motorcycle die all right where we going come up I don't know where don't go that way go back to the city",
            "start": 982.84
        },
        {
            "text": "Ain't ready, she definitely ain't ready. Damn, what a place to die. There you go, get back on that motorcycle. Die all right. Where we going? Come up, I don't know. Don't go that way. Go back to the city. Um, this is the city. Going yeah, I'm going try to get some R. Go straight, Greg. Just go straight. Doesn't matter what happens. We're going for it. Said to go this hold now. I'm a little lost. No okay, so this is definitely Twin Peaks. Cuz you're going down that that place where all right. Hold on guys, I took a bump too hard. Yeah had a problem but I'm okay. Okay what is this? What is this some guy's seeing robot they're looking at you. You know what they're about to see their lives go up in flames. We're going to hack some guys. You hack them. Great that is a robot for sure that is not a human being. Oh oh my God, oh my God that's a human being that's like Commando man or some **** I don't know dude just get him get on the motorcycle nope he's got armor Everybody Run put your gun away run oh no Marcus Greg",
            "start": 1039.8
        },
        {
            "text": "oh my God that's a human being that's like Commando man or some **** I don't know dude just get him get on the motorcycle nope he's got armor Everybody Run put your gun away run oh no Marcus Greg PSP get your game Greg all right Greg we back in here W um now the big question is yeah where's your motorcycle uh maybe when we die we lose all motorcycles in possession that's really sad it's like real life you can't take it with you as I believe Jesus Christ said in the musical \"You Can't Take It With You\" it's true I remember that bright as day I was in I was in the play \"You Can't Take It With You\" you know I didn't know that yes I was no I'm thinking of the right one I played the father who's in an N but I might be thinking of the wrong play you were actually referring to WWE and you were talking about Paul Bearer Greg no no no no no no there you go oh here's a car drive that truck drive this boat we're following this we're going to the Painted Ladies oh you got",
            "start": 1102.2
        },
        {
            "text": "talking about Paul Bearer Greg no no no no no no there you go oh here's a car drive that truck drive this boulevard tributary going to we're following this we're going to the Painted Ladies oh you got an antique do you know what the Painted ladies are I know what the Painted ladies are you watching this at home know painted ladies are they're they are very yeah oh I saw it you bite it and you hit you hit the bike and then you bit it there goes your bike scrolling scrolling on out why is it rolling away from me uh you hit it with a truck uh no The Painted Ladies are from you know them from the Full House opening they're very famous for that now they're not the houses this is always the big confusing factor is that the owners didn't live in the Painted Ladies they just open the shop in the park anyways they live actually around the corner around the corner that you broke down as a Full House house do you remember when I mean you were a kid but do you remember when San Francisco was",
            "start": 1151.92
        },
        {
            "text": "Park anyways they live actually around the corner, around the corner that you broke down. Ass Full House house do you remember when I mean you were a kid but do you remember when San Francisco was affordable? No God no yeah I don't think it ever was yeah yeah cuz of the Gold Rush yeah we were big on the gold rush. You okay now be careful, be careful, be careful what are you doing careful careful be careful oh Lord Corner better that's you know what I'm trying to like give the real Kevin Cole experience okay yeah he well he's got no we all know I don't drive in San Francisco I have Kevin Drive and I want this to be as accurate as possible. You could have done they have a I forget when you show the phone they got an Uber app yeah yeah yeah um how do I use copyright so oh you can't open oh you can open your phone while driving so this is true to the San Francisco experience I think we've all we've been around long enough where we can all text and drive if if I'm right not true I I if I'm",
            "start": 1194.12
        },
        {
            "text": "can open your phone while driving so this is true to the San Francisco experience I think we've all we've been around long enough where we can all text and drive if if I'm right not true I I if I'm right I believe Congress has passed a bill saying that's totally fine especially on a motorcycle nope you're in all they always say there's no better control than one a on the motorcycle that what you call thing handlebars there we go look look look look yeah they are the pain now go to the park and see if they have on the asphalt the little X's you know how they do that you go up the stairs sure yeah you can go up the stairs is that you trying to do the the know disturb cuz that's when that's when it's about to pop off if you sing that that means everyone on screen is about to die about to die so food trucks yeah that's very very San Francisco what what do you want me to look at oh wait no these are the pain ladies I wanted you to go over the pained ladies and see if they have",
            "start": 1244.68
        },
        {
            "text": "to die so food trucks yeah that's very very San Francisco what what do you want me to look at oh wait no these are the pain ladies I wanted you to go over the pained ladies and see if they have the x's on the sidewalk cuz that's you know how like they have it where they're over there like if you want the Full House photo you take it right here over no oh I get what you're saying doesn't look like do somewhere over here yeah somewhere over here so it's like right there right something like that yeah it's like bam so you take the picture boom then you're in Full House can we use pictures she's taking a selfie in front did we can we use the phone yeah we're okay to use the phone every second all right cool what is this oh picking that up yeah I look like a turd but whatever so I'm going to do this right I'm going to do this watch don't show that oh my life's so hard I had to cut out a free let's play I going to get diabetes no leave this in there while I yell at you anyways everywh",
            "start": 1290.32
        },
        {
            "text": "do this right I'm going to do this watch don't show that oh my life's so hard I had to cut out a free let's play I'm going to get diabetes no leave this in there while I yell at you anyways everywh why oh the selfie is fantastic see look he looks like me I got my Cool J you should go take this and then put it up in this let look he even has the same pose I well I did the gesture I like it oh can you do the flirt gesture I think this is the Vernon Shaw gesture this is the Vernon Shaw damn it's kind of weird just pointing guys shut up Kevin oh rock on there you go go back you die okay only that we switch what else should we go let's go back to the marina yeah we find Nick's house yeah sure going to Nicko's house now so far one of my big complaints is I've only seen like golden retrievers and rotweilers in this game where are the wiener dogs well I was in Golden Gate Park looking for a wiener dog and I couldn't find one so Portillo is lost out there so again okay I think we've already made it",
            "start": 1327.88
        },
        {
            "text": "in this game where are the Watch Dogs well I was in Golden Gate Park looking for a Wiener Dog and I couldn't find one so Portillo is lost out there so again okay I think we've already made it to Marina this is the park that's Golden Gate Park that's the edge Golden Gate Park I don't know what the hell that is that that kind of looks like uh where we did kind of it really does I'm going to pretend that is the Regency Botom there it is that's the Rey Botom Kinda Funny too is happening when is the Kinda Funny Live 2 video going up don't worry about who the hell knows maybe never January 5th to the latest all right oh who Damn I liked his little pose though shut up Kevin Kevin now hold on what's this this woman got out of her car is she gonna help you out or is she gonna she she's clearly dazed by the accident oh oh the warning shot nice there's the real one there now you're just shooting stun things into the floor get stunned now can you hijack the trolley I wonder here we go oh it's an",
            "start": 1385.92
        },
        {
            "text": "by the accident oh oh the warning shot nice there's the real one there now you're just shooting stun things into the floor get stunned now can you hijack the trolley I wonder here we go oh it's an it's it ice cream sandwich oh it's it's around here it' be cool if it's said like what what or something what what okay so's the arts go that so Nick's house is going to be over here oh no oh no okay we out here all right so there's Lombard Street yes this is oh really yeah see the Crooked Street up there no turn around I'm looking at your map sorry oh so now if you right there see oh there we go let's go check it out all right now you remember oh my God everyone remembers Lombard these guys can't drive just like real San Francisco uh you remember Lombard Street Ladies and Gentlemen from The Real World San Francisco they lived on Larch Street not on the Crooked part I don't believe but they lived oh oh my god oh I thought you're going to race through the here we go look at how crooked this street",
            "start": 1434.64
        },
        {
            "text": "San Francisco they lived on Larmer Street not on the Crooked part I don't believe but they lived oh oh my god oh I thought you're going to race through the here we go look at how crooked this street is it's the crookedest street you might know it from Tony Hawk Pro Skater okay you you did that nicely I've mastered that that whole maneuver you did so nice would be would it be South of Market oh Curran's grandma oh my God you saw Curran's Grandma Curran's Grandma's house is this blue one right here yeah right there how many girls he kissed there none how many Grandmas is he kissed there couple **** oh my God all right he doesn't know me it doesn't matter all right here you go sweet jump that was just I did it slowed me down yeah I guess we should have knocked on the barricades and then done the sweet jump yeah well now that the barricades are done Alfredo lives around here or lived Alfredo's Grandma I'm a big grandma fan time more Grandma I'm kissed oh this is going Ramy speed yeah jumps s oh my God oh",
            "start": 1494.04
        },
        {
            "text": "yeah well now that the barricades are done Alfredo lives around here or lived Alfredo's Grandma I'm a big grandma fan time more Grandma I'm kissed oh this is go Ramy speed yeah jumps s oh my God oh my God oh my God oh my God oh my God get out of there that thing's on fire that guy's hurt that was like the uh the final scene in in the classic movie The Fast and the Furious number one where they had to race the train yeah D but I didn't make it happens the best of us all right all right where we going look they have an LED while like ours at the studio I heard him screaming but they said he died on impact and screaming was me okay so we're back we're back fous look what a little Ys oh is that your car Prius no I have a Prius se but this is this is close enough I mean come on it's a video game it's not the right blue it's not blue period I know well you just said it's not the right color don't hit her I wasn't going scare sure you that truck man truck is out for you all right boom Oh my",
            "start": 1541.4
        },
        {
            "text": "it's not the right blue it's not blue period I know well you just said it's not the right color don't hit her I wasn't going scare sure you that truck man truck is out for you all right boom Oh my God he exploded all right this gives me like the feeling oh get that cable car get boom I'm going to say pretty saying stop no c car look there's another dog yeah you think it's a Portillo no it's clearly not get out and tase him get out and tase the dog Tim oh oh that's not a taser Tim that's a gun I don't want to shoot the doggy but I will bump him here we go for bump right in this dogle first off this dog should be on a leash miss you understand I can Tri have you SE oh you know what I did so I did a whole bunch of things while like killing people right and the cops came after me and I went to get back in my car after I K people and they let loose the canine unit and this German shepherd ran out got me on the neck and me down this dog's so confused get out and Chas his ass I ask so little",
            "start": 1604.28
        },
        {
            "text": "get back in my car after I kill people and they let loose the canine unit and this German shepherd ran out, got me on the neck, and I'm down. This dog's so confused. Get out and chase his ass. I ask so little of you. There you go, taser up, very top of the wheel. There you go, perfect. I walk over there and be like, what's up? You're pulling it out real early. I want him to know that I'm coming; this is going to end. Are you giving him a warning shot? Isn't it? There we go. Oh no, B. Look at this guy. He's like, what happened? He's not taking it. Where are you going, buddy? Activate, activate Order 66. Damn, through the glass tape. Oh yeah, they're searching the area for you. We're going to go deliver mail. This of course I'm the mailman now. This truck looks a lot like Stiles' Teen Wolf van from Teen Wolf. Okay, I don't like the truck. Weird. I'm glad you parked it right in front of the cops. The truck; it's garbage to it. It's a green truck doesn't mean it's a garbage truck or a UPS truck. You see him? Yeah, you got cops got the",
            "start": 1671.64
        },
        {
            "text": "the truck weird I'm glad you parked it right in front of the cops the truck it's garbage to it's a green truck doesn't mean it's a garbage truck or a UPS truck you see him yeah you got cops got the 5 the fuzz yep all right all right all right okay well damn he got out of that thing with style I'm sorry I see the anti shoe boys are searching the area you got the antio bo oh no I'm oh here we go yeah grab the Mad perfect oh man I thought it was a motorcycle the perfect getaway for the criminal who respects the environment I don't know how the cops haven't found it they look hard enough true dead SEC for life all right I'm just going fast I was going for this no breaks ever never break never break the movie Speed or Premium Rush or speed or Premium Rush or speed yes the boat I forget who's the guy in speed to no that's Keanu Reeves that sounds right all right whatever happened to him no I don't think he's dead I just think he oh my God what are you doing where are we well that's",
            "start": 1732.84
        },
        {
            "text": "the guy in speed to no thats Jason Patrick thats right all right whatever happened to him no i dont think hes dead i just think he oh my god what are you doing where are we well thats a that was a i went really fast into that but where is this youre if youre right back where youre um turn around we were looking over here at something cuz i remember this thing from where it shouldnt be here but its here its like the Great Wall of San Francisco i dont even know what youre talking about all right dont worry about it all right wheres oh we havent gone down like fairy building area fisherman warf yeah okay nop were okay shut up lets see you know what youre also trying we got the Castro over here yeah oh and yeah theres a lot the gas stations are accurate i like that yeah the the most important thing is the gas stations theres the commercials theres a bunch of crappy apps nobody careful this is the part of Market Street that has all the really shady stores that you yeah the",
            "start": 1802.84
        },
        {
            "text": "the most important thing is the gas stations there's the commercials there's a bunch of crappy apps nobody cares this is the part of San Francisco that has all the really shady stores that you yeah the knockoff weird ones on Market where it's like a Starbucks every other block and then it's all these things for like the electronics not the Nike store it's like the Niketown store I trust that so there we go the Fairmont building down there this very famous that bank looks would have been a Chase so that's why I thought it was Second Street earlier sure interesting just remember it's not photo 100% photo this is where right over here there would have been a uh Noah's Bagel mhm I've been there many times you might know this area from Tony Hawk's Pro Skater 4 sure this is the Fairmont building there Farmers Market permanent I like that I like the permanent Farmers Market there's all the hearts around here somewhere right yeah the heart the Heart Arrow sculpture there you go that's kind of a mouse but yeah",
            "start": 1852.08
        },
        {
            "text": "permanent I like that I like the permanent Farmers Market there's all the hearts around here somewhere right yeah the heart the Heart Arrow sculpture there you go that's kind of a mouse but yeah okay then uh then yeah yeah so MOA yeah Firefox would be around here yeah this whole thing here they got that Palomino restaurant in there eating a fried potato or twice they got those weird trains that aren't like the F trains yeah the street cars here they're like from all over the world whatever oh God I want I still want to go up to like Fisherman's Wharf they do they have the Bushman I know he is Tim's aware of that here entirely you want to go to I did say that I did say that what yeah fairy building Fisherman's War are different I know but like I thought when you were driving straight towards the Ferry Building you understand take a left see Hard Water and then go on up there Hard Water's okay is what you just said I don't think you've ever eaten there yes no exactly you haven't eaten there",
            "start": 1903.36
        },
        {
            "text": "ferry building you understand take a left see hard water and then go on up there hard water's okay is what you just said I don't think you've ever eaten there yes no exactly you haven't eaten there so I don't want have you bad mouth hard Waterfront that looks like that little uh it is the Waterfront look it even says Waterfront the long way though I get so excited when like things are accurate so we're cruising through the street this is how Nick used to get home from IGN yeah through were driving these these very streets not on a motorcycle he did right not my J he's driven a motorcycle we would have passed hard water by night though yeah heads up oh here we go so this is uh Pier 39 yeah there those dumb Flags where P 39 yep yep yep go there give me take me to Bubble Gum shrimp bubble gums is way over there no it's right oh bubble gum sorry Joe's Crab Shack is way over there sometimes I doubt you're actually from San Francisco you don't know where Bubba",
            "start": 1956.92
        },
        {
            "text": "to Bubba Gump's bubble gum is way over there, no it's right, oh bubble gum, sorry Joe's Crab Shack is way over there. Sometimes I doubt you're actually from San Francisco, you don't know where Bubba Gump's is. Go to the guy doing the shitty magic tricks in here and the guy with the parrot, all that is the parrot guy in here. He used to be in SFGamers, my PA of guys in here, I don't know again what are you doing? I'm going to Bubba Gump's, you did it, guys, he's feeling it. You said go to Bubba Gump's, you went to Bubba Gump's, you can't. Oh, there's Z to your right, can you swim down? I don't know, but so there's bubble gum string. I'm looking at these requirements, see if they say if we can swim around. There's bubble gum stuff and oh look, look, look, look it's your magic show. They have the magic show, there is the crappy arcade, growing up this was an arcade yeah this place Ben & Jerry's it's where I used to play DDR and press all the ladies okay um it was really cool how much making out did I do? I did a fair amount of making out at",
            "start": 2009.56
        },
        {
            "text": "crab growing up this was an arcade yeah this place benzo it's where I used to play DDR and press all the ladies okay um it was really cool how much making out I did I did a fair amount of making out at Pier 39 they say don't go outside San Francisco is try sis yes all right that's how we end you can get a boat down here tomorrow you're going on a little fancy date I am with Jen you're taking her to Forbes Island yes the underwater restaurant it's right there but it's so like it's not here so secretive well it's cuz nobody knows about it yeah see if this was accurate there'd be a bunch of those dumbass sea lions they'd be like I've seen him for that think I get in a boat I do think you get in a boat cuz you hack it jump on there okay well first steps of doozy watch out there you go there you go there you go now take this to Alcatraz upset everyone oh dear oh dear well and I'm I am landlocked all right you worked your you've worked",
            "start": 2059.16
        },
        {
            "text": "steps of doozy watch out there you go there you go there you go now take this **** to Alcatraz upset everyone oh dear oh dear well and I'm I am landlocked all right you worked your you've worked some of the Kinks on how to take a boat maybe take that boat that's already pointed the way NOP don't okay well okay shoot that guy too yeah no Witnesses now hop out of this mother and get on that boat over there jump R2 there you go there we go we're going so R2 God Jesus I'm holding R2 yeah but I don't know if that's what maybe that's not how you're supposed to do it okay okay do you want me to do Titanic it's Titanic I just say we in here we jump off **** that we're going have look at him look at him look at it that foot that's a good pose I like this a lot here we go there we go we got Co Tower I'm gonna find Jack he's out there more let's plays here every day not every day but like a lot of days youtube.com/ of funny games so that is Watch Dogs 2 everybody we played a",
            "start": 2109.04
        },
        {
            "text": "got Co Tower I'm gonna find Jack he's out there more let's plays here every day not every day but like a lot of days youtube.com/ of funny games so that is Watch Dogs 2 everybody we played a whole bunch of it I'm having fun me too maybe one day we'll do story missions and see what that's all about but until then we're just going to screw around crashing motorcycles having a good time remember we put up let's plays all the time youtube.com/ of funny games remember we have a million shows and stuff so go watch those subscribe to the channels if you ever see Kevin in the street whip a cupcake at him and also for more over on Amazon we're going to on the Amazon page for Watch Dogs we're going to do another bonus let's play where we're going to go try to get to the Golden Gate Bridge this video was brought to you by Amazon and Ubisoft pre-order Watch Dogs 2 to get the Zodiac Killer bonus mission and get 20% off if you're an Amazon Prime member",
            "start": 2171.76
        }
    ]
}