{
    "id": 494,
    "video_id": "3Zzm_eXMXuE",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Let's Play Mario Kart 8 - Multiplayer Mondays",
    "description": "We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to play games.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1420488012,
    "duration": 1030,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to a Kinda Funny Games let's play featuring Portillo the weener dog in Mario Kart 8 I'm one of your hosts Greg Miller alongside Colin Moriarty it's good to be here with you Greg over there, the producer, Nick Scarpino. I like that we kept a bridge for Portillo to come on. He's the real game, it's the meta game on who wins. That's the real winner over here, the pure one Tim Gettys what are we doing? We are playing Mario Kart 8. We're going to play the DLC content. Yes, okay. So here we're choosing our characters. I'm going with my boy Luigi. I'm going to be myself, y'all should have brought your Mii for not doing that Nintendo just makes it so easy to transfer your Mii between systems. You put them on your amiibo or something right? You put them on your Wii U you bring your wiiu to your friend's house. That was the coolest thing about the original Wii, remember that? You put him on the Wii remote. You could go to your friend's house, you could bring him",
            "start": 0.44
        },
        {
            "text": "your wrote you bring your Wii to your friends house that was the coolest thing of the original Wii remember that you put him on the Wii remote you could go to your friends house you could bring him over that way beam him to their system yeah good here we got I'm Luigi to I I want to go back I want to I don't want to be baby all that time well I was I was yeah I'm sorry you're being idiot I'm going to be Mario wow all right but now we have the SL he's the most average of all the Italians in this game so I'm into it all right so all right so who's everyone I'm Greg oh you're Greg okay that makes sense being on the karts Tim you're you're shy guy I'm checking out the the opponent cycle here are using this is one okay so this is one of the DLCs things yeah have you used it I have not have you played any of the DLC I played the DLC okay yeah actually yeah yeah yeah yeah yeah yeah yeah yeah I don't like motorcycles I'm a little worried about this but it'll be fine hey it's not",
            "start": 36.28
        },
        {
            "text": "Have you played any of the DLC? I played the DLC, okay. Yeah, actually, yeah, yeah, yeah, yeah, yeah, yeah, yeah. I don't like motorcycles. I'm a little worried about this, but it'll be fine. Well, hey, it's not like everyone's watching; it's not like at least a dozen thousand people are watching this - 12,000 people, yeah, that's what I'm saying, that's my prediction. All right, I'll take it; it's good enough. There you go, Nick. Cool. We're going to the egg cup starting off with that good old Yoshi circuit, that Yoshi circuit, that magical Yoshi - the Yoshi, the Yoshi, you predicted it. I predicted it; it's happening in the debut episode of Kinda Funny Gamescast. You say it's the year of the Yoshi. All right, all right, CU of Yoshi's Woolly World. Yep, I'm very excited. Yoshi's Woolly World - nailed it. Yep. Oh, I remember this one from the GameCube. Mhm, mhm. So you guys are giving me grief about using the uh game pad? Yeah, that's cuz you're a stupid Nintendo fanboy. Oh wait, what I brought is...",
            "start": 83.0
        },
        {
            "text": "It yep, Oh I remember this one from the GameCube. Mhm mhm, so you guys are giving me grief about using the uh game pad yeah that's cuz you're a stupid Nintendo fanboy. Oh wait, what I brought, I bought this Pro Controller after an appearance on NVC when they said that it was going to work on Mario Kart. I was like well I know what I got to get. I was just giving you guys grief for giving me grief but they do split screen on the game. Who's hit me already? Damn it, yeah that's why you gotta look. This is dumb, why isn't it just one giant screen then because it should be one giant screen and yeah that's cuz the GameCube is or the game pad is horribly implemented and used in just about every Nintendo game. Hey guys, is 12th place good? No okay that's fantastic, that's close to last except it is last, it's also last and it's close to last as long as God damn it I'm so rusty, shaking off the rust. God damn it how do I use my item here we go this is another part of the game's cast coming true now.",
            "start": 126.84
        },
        {
            "text": "It's also last, and it's close to last as long as God damn it, I'm so rusty, shaking off the rust. God damn it, how do I use my item here? We go, this is another part of the game's cast coming true now I'm in fifth place, and I'm just getting **** left and right. Oh, cuz you're rubber banding. Put on Mod Nation RAC - that's the worst thing ever. Mod did you guys like that Racers? I didn't; he did low time sucked, but the game was great. Damn, I'm just terrible right now. It had a community; it had customizable carts. Best cart racer of all time, Crash Team Racing, no ****. But you're a Crash fanboy - how can I believe that because it's so good? That's why I'm a Crash fanboy because of the cart racing. Yeah, man, Crash Team RAC is so good. Who's putting all these damn banana peels all over the track? Really, I'm in the living nightmare, sixth place. Oh, I'm first - are you really this bad? No, I'm second; I'm like playing terrible. This Aon cycle is like... God. We had one practice round before this, and I was good. You did; I did.",
            "start": 173.32
        },
        {
            "text": "sixth place oh I'm first are you really this bad no I'm second I'm like playing terrible this track cycle is like God we had one practice round before this and I was good you did I did I have crap oh man cuz y'all want to run around and do different things oh god oh Lord I remember never being really good at Mario Kart but I don't remember being this bad I don't think being good at Mario Kart exists I used to be aiming that's what I'm talking about is like when I I this is one of the things that turned me off to this Mario Kart is that I've always felt like I'm good at car racers but here you just get screwed at times and there's just nothing you can do about it and you just get pinned down and you have to take it you sit there and you cry I cry every day because of this I get it and that's why I'm I was surprised that you know he gets a game of the year and what we're playing and what we loved and Mario Kart is not on my list like I bought it played it for that weekend I was like",
            "start": 223.44
        },
        {
            "text": "why I'm I was surprised that you know he gets a Game of the Year and what we're playing and what we loved and Mario Kart is not on my list like I bought it played it for that weekend I was like all right now I don't need this anymore I'm so bad me Smash I I want to play all the time oh man I'm so terrible you know you know you're in really bad shape and you keep getting Stars oh man I'm in last place you know what I mean it's just like it takes the game takes pity on you good job you you were sandbagging before when we were practicing yeah I know there you go I wanted to throw you off course works well I mean not that really I know I just got me I got screwed over every I mean you know things happen things change lock two he's the homie back Mario rough pill that's a lot of **** I'm so bad where am I I'm almost there I think oh wow where am I it's tripping me out cuz I should be in Colin's spot so I keep looking over Col noticed the technique you just used where you had three",
            "start": 269.04
        },
        {
            "text": "so bad where am I I'm almost there I think oh wow where am I it's tripping me out cuz I should be in Colin's spot so I keep looking over col noticed the technique you just used where you had three mushrooms and you didn't use them yeah I know I'm trying to just stay on track and figure out the course I Haven been this course on TG I haven't been on this course since 2003 so also trying to figure out the button so uh right Trigger or right shoulder button is is item or drift drift and it's the trigger yeah and then left trigger is is item so here we got the Excite Bike Arena I think I jump in this it's one of the new ones right yeah these are all new well no we just played a GameCube one so that's not new it's new in Mario Kart 8 does it still have the power up when you on off the start yeah yeah it's hit now like right when the two drops just let the two drop oh **** 4 40's cheering me on oh I why am I on this screen this is a this is a really cool course I asked you guys earlier",
            "start": 312.48
        },
        {
            "text": "yeah yeah it's hit now like right when the two drops just let the two drop oh **** 4 40's cheering me on oh I why am I on this screen this is a this is a really cool course I asked you guys earlier where you guys want to be I remember and no one gave me a **** well it doesn't make any sense I had damn it I went through the mud pile standard for my life I feel like I have standard for my life a metaphor for Nick's life the mud puddle going through the damn mud puddle give me something good yeah buddy coming up on Tim six oh you're using terminology like that too that's getting hot oh man mud puddles I just producer SL Seducer you're seducing me right now oh T damn man Colin get off me bro you just hit me with three straight red shots these bikes are so hard to control do you prefer the karts bikes great CS all the way what is the uh I'm using you know the little wiggler ATV here cuz he's that's the man that's that's the part you want I just got the what uh what do the coins do ex",
            "start": 365.24
        },
        {
            "text": "cards bikes great CS all the way what is the uh I'm using you know the little wiggler ATV here cuz he's that's the man that's that's the part you want I just got the what uh what do the coins do ex they give you little speed bursts little tiny speed boost and if you get 10 of them your top speed is higher shoot oh right with the blue shell too of course I'm going to call it right now if we went back to Mario 64 I would kill all of you Mario Kart 64 yeah no if we went to Mario 64 Mario 64 you know Nick we can do that at some point I'm going to I'm challenging and you're not going to win I will kill you in that game that's probably the one I would i' play though the most really for me it was GameCube College all we did once we got it baby Park man oh baby Park was the gam and it gets so much crap now I Loved Baby Park yeah exactly can you what's the uh what's the deal with the like we flying in this uh you Glide yeah you fly only when the chorus calls for it okay so I can't do that",
            "start": 417.32
        },
        {
            "text": "much crap now I Loved Baby Park yeah exactly can you what's the uh what's the deal with the like we flying in this uh you Glide yeah you fly only when the chorus calls for it okay so I can't do that right now no you can't just deploy it oh God damn it how did they get all the way back in seventh that was **** I'm I'm in E I'm in 11 I'm doing really bad woo shoot his back everybody damn is that do that mean Greg one yeah Greg one is that what you what you do when you win well when I have a six Place finish talking all this trash on the the Kinda Funny Games cast about how I'm actually good at kart Racers I debut myself on our inaugural our inaugural let's play and finish sixth in the first race somehow Tim beats me no embarrassing I think I'm an 11th that's not far hey I'm shy there a guy guy see what I did there you're beating me I'm coming up we go coming up come on Pell be good Lu sorry we're getting Kevin's Jesus Christ in over there we're getting too loud G him the jezy crazies",
            "start": 474.52
        },
        {
            "text": "Guy, see what I did there? You're beating me. I'm coming up; we go, coming up. Come on, Pell, be good. Lu, sorry. We're getting Kevin's Jesus Christ in over there. We're getting too loud. Get him, the Jeezy crazies. The Jeezy crazies. You ever heard that? No, but I like that. I like that a lot. No, you're welcome. You're welcome to use it now. You too. You were at home, so this is the dragon drift straight new level. It's not based on any other game. Oh, really? Yeah, it looks like it's based on Chinese New Year. Damn. You think they'll come out with those drums? I've never... I don't know. Is that what... oh, Kevin's doing drums too. You guys share one brain, so you both got the same reference. Whatever the hell that meant. You guys AR. You think they're going to come out with the drums? What the hell are you talking about? Oh man, come on. Shy Guy, you piece of **** get in an overdrive shy guy. I've got to start pumping the brakes a little bit here. No, you never break in Mario Kart; break Mario it's rule number one. Unfortunately, I also",
            "start": 524.48
        },
        {
            "text": "on Shy Guy you piece of **** get in an overdrive shy guy I got to start pumping the brakes a little bit here no you never brake in Mario Kart break Mario it's rule number one unfortunately I also tried that rule in Gran Turismo Kev it's going to peek there's nothing we can do man Let It Go Kev guys this isn't going too well for me I remember when the only Kevin I knew was Kevin Arnold and I liked it that way Kevin our Kevin was named after Kevin Arnold true true story that's embarrassing but awesome why is that embarrassing I think it's embarrassing parents liked it that much parents dude uh Wonder is one of the great shows I agree but it's just weird no it's embarrassing you said it already it's embarrassing you it is embarrassing it's contemporary to I mean it's not even like a classic show at the time mind you you know what I mean at the time it was like proba season 2 and they're like man we love **** to this The Wonder Years we better **** name our kid after it and Dad's like why",
            "start": 576.04
        },
        {
            "text": "at the time, mind you, you know what I mean at the time it was like probably Season 2 and they're like \"man we love The Wonder Years\" we better name our kid after it and Dad's like \"why do you curse too much Mom?\" you love \"The Wonder Years\", you are a true fan of the University of Missouri, every God damn it, they're all singing Out Of Tune and what are you doing Shy Guy? No, I've fallen off this course four times, Kevin, I'm going to scream, it's Kevin, it's Mario Kart, it's going to be even worse, okay, five times, thanks, you distracted me with your good looks, God damn it. The others were trying to make those stupid noises, I was in second for one second, oh my, this is embarrassing, God damn it, everything was going so good now it's messed up what do I do? What do I do? Oh god, oh man, yeah, I do not like the motorcycles, a no thought you were cool Huna, what is it hit it hit the th oh I fell off the course get out of here Sam one of you Goddamn Bowser kids God damn it oh",
            "start": 624.96
        },
        {
            "text": "Man, man, yeah, I do not like the motorcycles. Aonuma thought you were cool, Hana. What is it? Hit it, hit the ****, th oh, I fell off the course. Get out of here, same one of you goddamn Bowser kids. God damn it, oh ****, oh come on. Thank you, me third. Oh, I'm pissed off now. Oh, you're mad now. See a Col rage. I was in fourth or fifth the entire time and I finish eighth all remember, ladies and gentlemen, this prod of funny games we just started this new channel. We all quit our jobs. This is what we do now. Please support us on patreon.com. This is what we do. We get 11th in Mario Kart if you don't like this just don't tell your friends about it, don't tell anybody. God damn it, totally **** by Luigi and Daisy. Luigi he always screws up man. Why are there so many Bowser kids in this? Why are you saying this like it's a bad thing? It is a bad thing. You're hating on Wario no dry bones but we have all these damn Koopa Kids. Dry Bones is cool, Dry Bones is dry bones is awesome he's the best really cool. Is this next stage we're",
            "start": 687.4
        },
        {
            "text": "Bad thing, it is bad, you're hating on Wendy. No dry bones, but we have all these damn Koopa Troopas. Dry Bones is cool. Dry Bones is awesome; he's the best. Really cool. Is this next stage we're playing on? Mute City. This is like the closest thing we ever get to a F-Zero game on the Wii U. Why isn't Wario in this game driving a car? He doesn't have any arms, he just crushes the kart and sits there. Last place every time. I want Xevious really bad; that would be good. Holy breath! I want a Captain Falcon third-person action game; that would be the best. And Toad... oh man, what is this plant on my head? Mixscar... oh ****, I'm the stage. Put me down, like, thank you. The stage is like a bad acid trip. I hate it when they know they're about to get hit with the blue shell and just go into a little crook where it's like there's no way to get around it. There's apparently a proximity alarm that lets you know when something's coming. That's like playing this game for the first time. I played this game, Colin, get off me.",
            "start": 746.48
        },
        {
            "text": "It's like there's no way to get around it, there's apparently a proximity alarm that lets you know when something's like a robot playing this game for the first time. I played this game, Col Gettys got off me, bro - that was really good banana placement. I'm way too far behind now; the stage is hurting me right now. Colin usually has good banana placement; I'm well known for my banana placement - no one puts a banana down like No Other that's the right way to use it. Oh, I'm just going hard for it! What the hell was that? Damn dude, I suck at this stage. These turning on the freaking motorcycles is so crazy. Yeah, it's sensitive; that's why I like the Wiggler card - it's stiff; it knows what it's doing not too far behind me. I'm in last place, so don't you understand why this is why I play games alone to hide your shame? Oh, what...this is why I always talk about not having enough testosterone for multiplayer that's why I only play like the baby games like this.",
            "start": 824.76
        },
        {
            "text": "why this is why I play games alone to hide your shame oh what this why I always talk about not having enough testosterone for multiplayer that's why I only play like the the baby games like this where it's like oh okay well why is someone using me I'm in last place don't you **** get it damn it Lwig no hurry hurry hurry hurry hurry all right and then it was it was it was Daisy Lewig me wow mathematically I might be okay are you serious who the **** just bullet build me me I hate you so much call **** Mor that too the pride of Long Island damn wow this is just embarrassing woo it's okay guys I won end I know it it's a scary first race but I came back everybody don't worry is 13 points good it's like golf is that good we're playing by golf wait you guys have to tell me we haven't played by golf rules that was a poor showing oh that felt good po good Fortilla good job the most upsetting thing about Mario Kart 8 is there's not the little Victory screens at the end yeah there's no",
            "start": 889.92
        },
        {
            "text": "by golf rules that was a poor showing oh that felt good po good Portillo good job the most upsetting thing about Mario Kart 8 is there's not the little Victory screens at the end yeah there's no like parade and the trophy and everything yeah we just get this Mario Kart TV stuff which is cool I guess now you get to see my highlights oh man that's Colin actually so going off the stage the highlights of Gregs match where Colin going off the stage look at Nick's little mustache though Mario fist pumping a little bit the mustache looks like a guido they're on point like a juiced up Guido look at him there you go there I am winner winner chicken dinner like I said it was it was rough going there ladies and gentlemen in the beginning but we came through why you brighten that seat so hard bro no one said you can't enjoy your work Jesus ladies and gentlemen that of course is a Kinda Funny Games Let's Play we do them each and every day on youtube.com/ kind of funny games you can come over there check them",
            "start": 956.76
        },
        {
            "text": "enjoy your work Jesus ladies and gentlemen that of course is a Kinda Funny Games let's play we do them each and every day on youtube.com/KindaFunnyGames you can come over there check them out enjoy things like this see us get more CoD for customizations and whatnot uh make sure you subscribe to us on YouTube follow us over on Patreon and get everything about KindaFunny at KindaFunny.com until next time it's been our pleasure to serve you",
            "start": 1003.24
        }
    ]
}