{
    "id": 568,
    "video_id": "c2rr8WgVZKE",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Are Our Gaming Backlogs? - Kinda Funny Gamescast Ep. 04 (Pt. 4)",
    "description": "We all talk about our gaming backlogs that we will hopefully get to one day.\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1422540000,
    "duration": 1109,
    "transcript_chunks": [
        {
            "text": "\"All right guys, rounding out this episode of the Kinda Funny Gamescast. Our gaming backlogs, yeah, where are we at right now? There's a lot of games coming out; we're in the beginning of the year, which means we've got a lot to look forward to in 2015. Sure, earlier we were talking about Game of Thrones episode two - I'm excited for that in the coming weeks, yeah. But obviously as people who have full-time jobs, even though we didn't expect things to be so full-time, yeah, we haven't had that much time to play video games besides the streaming and the Let's Plays and all that. But we haven't had time to sit and just play through games and experience them the way we want to. Right? And a lot of times, there's a big difference between playing a game and experiencing it - a lot of people like you're so bad at Smash Bros, it's like, 'Hey, first off, I'm not claiming to be good at Smash Bros,' but second off, put that on it's harder to play.\"",
            "start": 0.31
        },
        {
            "text": "A game and playing a game, a lot of people like. You're so bad at Smash Bros., it's like, \"Hey, first off, I'm not claiming to be good at Smash Bros.\" But second off, put that on its harder to play games while talking to a camera, while talking to people, and like trying to create something that's entertaining. Creating entertainment and playing a game are two different things, sure. And uh, there is you know some common denominators between them. But besides that, it's like, it's sometimes I just want to play a game specifically single-player games. I just want to sit there and I just want to play it. I want to make my mistakes and I don't want couple people judging me in the comments or telling me what to do and all that stuff and half of them are wrong and all this **** but sometimes I do want that and so I I go for that. So I haven't had the time to sit and play a bunch of games yeah that I wanted to play. What what are you guys, I mean trying to make time for the best part about launching this",
            "start": 46.2
        },
        {
            "text": "and so I go for that, so I haven't had the time to sit and play a bunch of games, yeah, that I wanted to play. What are you guys trying to make time for? The best part about launching this business when we did January 5th is that we did it when there was honestly a quiet breath in gaming right where it was like all right, we can do this right now and it's not going to completely...it's not like we're doing it during review season, we're doing it during the runup to Black Friday where we're going to miss a million things and not have time for it. I would hope we were on better track so that we're going to be ready for I mean H1Z1, I still want to play and I know it's a complete pile of garbage but I want to be a part of that right and it sucks that I haven't been able to be so there's that then it's I mean I'm looking forward I'm not even getting to your question oh I guess H1Z1 in my pile but like we're still to the point of like the next things to worry about are like for me Dying Light.",
            "start": 83.72
        },
        {
            "text": "then it's I mean I'm looking forward I'm not even getting to your question oh I guess H1Z1 in my pile but like we're still to the point of like the next things to worry about are like for me Dying Light Game of Thrones uh order like you know what I mean like we're starting to hit into these games that got pushed bloodborne isn't too far off either then when you look at that way but this January time frame has been quiet enough to where it's like I'm not missing out I don't feel like I'm screwing myself over and so when I look back at my backlog my backlog is still it's still in a place of just like little things I don't there's not that much that I feel like I need to catch up on like I need I still like I keep talking about this right that I played so much Transistor at preview events that when I finally got it it wasn't striking the right cord so I got three hours in or something and stopped and now I can't I got to restart that game and go and I keep talking about doing that right",
            "start": 122.84
        },
        {
            "text": "when I finally got it it wasn't striking the right cord so I got three hours in or something and stopped and now I can't I got to restart that game and go and I keep talking about doing that right but like Dragon Age isn't a game that speaks to me and I I played an hour of it maybe even less and I was just like totally get what's up watch Christine play a lot totally respect what they're doing not my game I don't want to go back to it Far Cry played a ton of it leading in you know we did so many Let's Plays that I in with it that by the time I got home and I started going into it I was just like it's Far Cry 3 which was amazing and has I know all the new stuff it has which is amazing but I don't want to go I don't want to go play that you know what I mean I still need to beat Costume Quest so so far it's Transistor and Costume Quest Costume Quest I you know I played on a stream in December because that was when I could finally get to it and I still have a lot left in that c that little",
            "start": 160.76
        },
        {
            "text": "So far it's Transistor and Costume Quest, Costume Quest. I you know I played on a stream in December because that was when I could finally get to it and I still have a lot left in that c that little campaign too but that's another game that doesn't stream well it's a game that is I want to sit there and laugh at the jokes and the no dialogue and enjoy myself but it's not my backlog doesn't feel as crazy as I think it sometimes gets it starts getting crazy when I look up there and I'm like right I want to do for a throwback Thursday Death Stranding and Return of Superman, I do want to play Ghostbusters on NES you know I see all these cartridges that are games I played and beat when I was a kid but I mean are up there that I want to do for our content and like balancing that with The Walking Dead stream with our daily Let's Plays with the order with Bloodborne with Uncharted like all the games are actually going to come out the Batman DLC that I still want to do",
            "start": 194.36
        },
        {
            "text": "The Walking Dead stream with our daily Let's Plays with the order with Bloodborne with Uncharted like all the games are actually going to come out the Batman DLC that I still want to do the Mr. Freeze stuff you know what I mean like there's all these little things out there that are like not even backlog is just many annoyances that I want to try to get quelled before we get to the heart of the season and the season being this year yes uh I mean I don't even know where to begin I mean that's that's the pro the problem has gotten bad it's gotten really bad because even before we left IGN there just was no time there's no time to play anything I think Transistor is a good example I never played Alien: Isolation I never played Shadow of Mordor I never played Dragon Age um you know I never got to screw on with costume quests I never got to you know even Citizens of Earth was a game that I really you know is a game I really want to sit down with and play now Iron Class Tactics is",
            "start": 229.04
        },
        {
            "text": "never got to play with costume quests i never got to you know even citizens of Earth was a game that i really you know is a game i really want to sit down with and play now iron class tactics is out now i want to beat Resident Evil again like it eventually you just have to choose like 10% of this stuff and just be like like especially with Shadow of Mordor and Dragon Age i actually really wanted to play i like Western RPGs and i really wanted to play those games but it's just not going to happen you know plus there's all this **** on V that comes out like every **** week that like i really want to play you know like i just download them and just never play them ever s in i was so where Star Wars: The Old Republic in 2 where Star Wars: The Old Republic in 2 i got Star Wars: The Old Republic in 2 i played 45 minutes of it and then something happened and i totally never got back to it and now i'm to the point of do i restart that game like what is even happening i know i'm cleaning tar off the ground why what's happening see that's that's the worry",
            "start": 269.48
        },
        {
            "text": "I totally never got back to it and now I'm to the point of do I restart that game like what is even happening I know I'm cleaning tar off the ground why what's happening see that's that's the worry I have about uh Majora's Mask coming up Y where it's like I know I'm going to want to play it I'm super excited for it but like I'm worried that I'm just not going to and then if I do I'm going to play it for a little bit and then just be lost and not know where I am and that's my thing with The Legend of Zelda: Majora's Mask coming out is like I never played The Legend of Zelda: Breath of the Wild and I know how special a game it is and what how important it is to adventure games and so like yeah I'm going to start it and play it and like I remember when I didn't like adventure games because they were cumbersome and weird and how does this water bottle how does this water bottle interact with that light to you know turn on this to make them and I was like oh and like that's that's what's going to happen is I'm going to sit down with",
            "start": 309.36
        },
        {
            "text": "water bottle how does this water bottle interact with that light to you know turn on this to make them and I was like oh and like that's that's what's going to happen is I'm going to sit down with Greg and play 15 20 minutes of it and get to that puzzle and be like all right I got to stream something else I'll do you know you know never get back to it Destiny I want to be level 30 in Destiny which is not hard and and I'm like level 25 because I get to do an hour of it and then I'm totally pulled away from it forever yeah I mean it's it's just it's a huge problem especially as we get older and and and I can't even I can't even **** fathom how people with real responsibilities and it's not with a child having a kid to take care of and play games like I'm not saying we don't have responsibilities because we do we we have a business and it's busy working it's it's responsibility obviously uh but it's just it's insane like it sucks because I really feel a little bit emptiness the last",
            "start": 343.04
        },
        {
            "text": "because we do we we have a business and it's busy working it's its responsibility obviously uh but it's just it's insane like it sucks because I really feel a little bit emptiness the last year or so in my own life because I don't have time to sit and play and it's really you have to pick and choose man but like the more the more you put off the games the further detached you become from the games and what they mean at the time which is why I really have been saying for a long time I need to make time I need to make time there's just like it's got to come at the sake of something of relationships or or just free time or reading or whatever like it's got to come because um like you like you were saying like playing on a stream like I was playing Resident Evil you know just we were just screwing around having a good time and not really even caring about how we were doing that's not how I really want to play Resident Evil I want to turn the lights off and really get into it that game",
            "start": 379.4
        },
        {
            "text": "around having a good time and not really even caring about how we were doing, that's not how I really want to play Resident Evil. I want to turn the lights off and really get into it - that game's scary and um atmospheric, and so I want to play in that respect. It's just funny when I look at my trophies; people say like what could our trophies be if you don't care about them? At the very least, it chronicles what you've done, which is pretty cool. And when I look at my trophies going all the way back to when they launched in 2008, man I played a ton of games until this past year just I played like everything and it wasn't just like dabbling it was like I was beating the out of these games mhm um but that was during the time when like Cheryl was away right yeah that's a big part of it right like that's what and this isn't us lamenting having loved ones or but it's you know like we work all day doing this right and now like when I like we're going to leave and I",
            "start": 420.32
        },
        {
            "text": "We all talk about our gaming backlogs that we will hopefully get to one day. We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1 This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com Each and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\n\nFollow us on Twitter! Tim - http://www.twitter.com/TimGettys Greg - http://www.twitter.com/GameOverGreggy Colin - http://www.twitter.com/NoTaxation Music by Rakohus!: http://www.youtube.com/user/rakohus\n\npart of it right like that's that's what and this isn't us lamenting having loved ones or but it's you know like we work all day doing this right and now like when I like we're going to leave and I immediately have to edit this to get this up for patreon and then I immediately have to work on oration and then in there I have to cook dinner for Christine and then I want to hang out with Christine and then it's just like so what point am I legitimately going to stream H1Z1 tonight I'm not I'm not unless I want to stay up till 2: in the morning and then be **** tomorrow for all the streams and crap we have to do you know what I mean so like that's like the the sucky part of being an adult and doing all these things and not even owning this business cuz when we had jobs before it was the same exact thing it's just like trying to get in a rhythm and I really feel like we're maybe next week going to hit our Rhythm we're close yeah no it's not bad it's just these stupid trips that I",
            "start": 452.04
        },
        {
            "text": "the same exact thing it's just like trying to get in a rhythm and I really feel like we're maybe next week going to hit our Rhythm we're close yeah no it's not bad it's just these stupid trips that I keep taking and doing things with things are happening that's part of the Rhythm so for me you know I'm looking forward to not there's not too many games coming out soon that I'm like I need to play this Game of Thrones I'm going to play and this or in the Blind Forest which we you should check out youtube.com/ kindafunnygames there's a reacts piece we did on that got to play a little bit of it and I was super into it and I'm excited for that and I'm going to make time to play that for sure now looking back at my backlog it Sunset Overdrive that is a big thing that is a big missing part of my my backlog sorry that a game that I I haven't even turned on that's a game that I know very little about but just watching it like this looks fun this looks like something I would enjoy a lot",
            "start": 484.88
        },
        {
            "text": "of my my backlog sorry that a game that I I haven't even turned on that's a game that I know very little about but just watching it like this looks fun this looks like something I would enjoy a lot again I don't have a well I do have an Xbox one but I it's in a box I'm trying like it's a long story I didn't mean to buy it I did buy it I have it I'm trying to sell it it's a whole deal but I think at this point I might just open and just keep it cuz I'm like I want to play these games and I don't have to borrow yours to play or or play it here it's roll God forbid you **** make some content here it's I know it's hard but so that's the thing though is I have this problem where I'm addicted to old games I've told you guys before I essentially skipped out on the whole PS3 Xbox 360 generation like I I played a handful of games I would probably say I beat a good 15 games solid straight through and all that and that means missed out on a lot and again I feel like I've played more games than",
            "start": 520.84
        },
        {
            "text": "like I played a handful of games, I would probably say I beat a good 15 games solid straight through, and all that, and that means missed out on a lot. And again, I feel like I've played more games than just the normal person; I've played a percentage of the games that you guys have played as professionals, the coolest dudes in video games right, but I missed out on so much stuff specifically the Batman games, so we've talked about this, I need to play the Arkham games and actually like sit through because Nightwing looks great and I want to be a part of that conversation when we get there. Um, the Bioshock games, I need to play. Oh wow, really? Yeah, that's one that I'm like, \"Wow.\" But I have this problem where I love old games so much that I've just constantly wanted to go back and just play them because I love those experiences. And like, I'm like all right, I'm gonna play Bioshock, I I own all those games I just named, I own all of them, and I've started them, and I'm like Bioshock then I start him",
            "start": 558.32
        },
        {
            "text": "I love those experiences and like, I'm like all right, I'm gonna play Bioshock. I own all those games I just named; I own all of them and I've started them, and I'm like, Bioshock then I start him again, I'm like, but then I look over and I'm like, oh this Tony Hawk Pro Skater. I wonder if it's still as good as I remember, and I play it and I get stuck playing that; I'm like, I'll just play through these a couple levels or whatever, and then I just, I'm like all right, cool now it's dinner time you know, and that keeps happening to me, especially now that we're doing these Throwback Thursdays and stuff. I'm going to get addicted guys; this is going to be bad, and now that there's HD remixes and all this stuff, I'm like well **** now I I have to play these K now I have to they're old and new, and a big example of that is Kingdom Hearts where it's like last time I played like I love Kingdom Hearts; last time I played it for Kingdom Hearts 2 was 2005 2006 when it first came out you know and now that",
            "start": 604.64
        },
        {
            "text": "Example of that is Kingdom Hearts, where it's like last time I played, I love Kingdom Hearts. Last time I played it was for Kingdom Hearts II, which came out in 2005 or 2006, you know, and now that there are the HD collections, I'm like, well, I want to replay these, but that's an investment, and that's a problem with RPGs, Japanese or Western. It's like, how are we supposed to play all of them when they're all 100 hours? You know, that's 100% true, and it's like especially when I want to play these old games. I want to play Kingdom Hearts, I want to play Kingdom Hearts II backlog games - the games I never played. Kingdom Hearts Birth by Sleep came out on PSP; I was so excited for it, but it came out so late in the console's run that I was like moving on to the next thing and doing other stuff, and I never played it. Now it's on PS3, so I get to do that, but I'm like, well, if I do that, I want to play one and two first, I want to you know, build that back up, and I'm like, oh, I also want to play...",
            "start": 640.44
        },
        {
            "text": "I never played it now it's on PS3 so I get to do that but I'm like well if I do that I want to play one and two first I want to you know like build that back up and I'm like oh I also want to play Final Fantasy X and X-2 'cause they came out and I'm just like it gets so daunting that I'm like I'm just not going to do it I'm just going to play Tiny Tina's Assault on Dragon's Keep right but yeah when the email was specific a lot got out of control for Kinda Funny yeah it would be like there's too many emails to answer I'm just going to read a book or I'm going to read a comic or I'm going to check Twitter you know what I mean like it's just like I gotta you got to try to find a way you can't yeah I think I mean out of the games you mentioned um I mean I still I don't like BioShock Infinite I think it's vastly overrated I never beat it I was not into it I thought it was like it was strange it was very un Bioshock to me I don't know a lot",
            "start": 679.04
        },
        {
            "text": "I still don't like Bioshock Infinite, I think it's vastly overrated. I never beat it, I was not into it, I thought it was like it was strange, it was very un-Bioshock to me. I don't know a lot of people agree with that some people don't agree with it but it felt like a shooter and Bioshock is not a shooter, uh first and foremost in my opinion um it's first person and you shoot things but it's not like uh yeah it wasn't like Call of Duty which is what I felt like parts of Infinite Warfare um but that the original Bioshock, oh my God, that that that's the game that stuck with me. Like you have to play that game, that game's extremely extraordinary, you know that game is extraordinary, very very very important game so you should definitely play that, definitely make time to play that game, so so so good. I played the first hour of that game, I swear probably five or six times and like I'm into it, I'm so into it, it's just like then I move on to the next thing and again then it gets hard because",
            "start": 712.12
        },
        {
            "text": "so good I played the first hour of that game I swear probably five or six times and like I'm into it I'm so into it it's just like then I move on to the next thing and again then it gets hard because not only do I also want to play all these other games and they're huge Investments and it's just like ah then we have to make the content and do the entertainment thing and I love that and I I almost I actually it's a fact I love that more than I love actually playing the games and I love playing games but something about like making content from games that is so much more exciting to me so that's why I know these old games so well so I stop and think about like what's the best content I can make for these games that I know that I love instead of playing something new that I'm like oh I need to experience this and then kind of think about it that way and it's just that's been really interesting working with you guys cuz I see you guys kind of as the opposite specifically you Greg",
            "start": 752.6
        },
        {
            "text": "I need to experience this and then kind of think about it that way, and it's just that's been really interesting working with you guys cuz I see you guys kind of as the opposite, specifically you Greg, Colin, you know, you have a little bit more of the old school in you. But see, you're more of a historian when it comes to this stuff. Greg, you're more of like, \"I'm playing whatever's out; I'm current; I'm up to date on this stuff,\" and I do a little bit of everything really well. Yeah, I'm way more just like I like to make content, and I like to think about this, and I like old things, so my backlog is never ever going to catch up, but that's okay, I'm okay; it's not a terrible problem to have; it's just a problem of acceptance. MH, I had that that time that thing with when Assassin's Creed IV: Black Flag came out, and I I I don't even I don't even like Assassin's Creed even at all, but I get like I gave you know Assassin's Creed II a you know I gave Assassin's Creed II a chance a little bit. People yelled me not enough chance, and then I",
            "start": 790.72
        },
        {
            "text": "I don't even like Assassin's Creed even at all but I get like I gave you know Assassin's Creed 2 a you know I gave Assassin's Creed II a chance a little bit people yelled me not enough chance and then I platinumed it to prove that I played the game all the way through and I was like I still hate this game call um I still hate it but there's my platinum trophy and then I played Assassin's Creed III because I was like oh this is **** awesome look at the setting and the setting was they nailed everything the the the the Travis of Assassin's Creed of course is they nail everything but the gameplay uh and then uh when Black Flag came out I was like I'm G to give it another chance people really seem to like it it seems like maybe they fix some things I'm not really sure that's really true um and uh that was the first time I was like I can't play this game I don't have time and that was when I was like I I just I wrote it off completely like I'm never playing Assassin's Creed ever again that",
            "start": 834.96
        },
        {
            "text": "uh, that was the first time i was like, i can't play this game, i don't have time, and that was when i was like, i, i just, i wrote it off completely, like, i'm never playing Assassin's Creed ever again. that was like one thing i just checked all my boxes, like, so when the new one came out this year, Unity or whatever, i like, i don't give a **** you know, i'm like, i'm not like, that's not even on my radar anymore, i don't care. yeah, that was the thing too, like, yeah, i, i was so satisfied with Black Flag that when Unity popped up and then Rogue and they were like, well, un is this and then but you know, i me, they go back and forth and everything, i was just like, i, they're not even on my list of things to do, you know what i mean, like, i, i've seen you play it, i understand that it's this, i understand it's that, i watched their video reviews, i read on it to make sure i was up to date on them but then i was just like, yeah, that's not even something on my list, i don't feel like i need to play that anymore",
            "start": 863.68
        },
        {
            "text": "I watched their video reviews, I read on it to make sure I was up to date on them, but then I was just like yeah that's not even something on my list, I don't feel like I need to play that anymore to experience what it is so Assassin's Creed perfectly encapsulates every single thing that I just said about my problem with backlogs when that game when one came out and like people were kind of whatever about it then two came out and everyone's like this is amazing this is so good and everything about Assassin's Creed seems cool to me the story and all that but I Prince of Persia the trilogy on PS2, ja oh yeah oh man that is like one of my favorite games, time is awesome ever I think all three are awesome Sans of time is the best and it's you know it made it but like in you know was a little a little on the angsty side but still great game the time travel was was fun and then uh two Thrones twin Thrones whatever I don't remember what it was, I loved that and it was like super good and",
            "start": 897.44
        },
        {
            "text": "A little on the angsty side, but still a great game. The time travel was fun, and then uh Two Thrones, Twin Thrones, whatever I don't remember what it was. I loved that, and it was like super good and brought it back more to the first one. That franchise was so special to me, that the idea of playing Assassin's Creed 2, I was like, \"I just want to replay Prince of Persia\" because I loved that. Yeah, and I was like, all right, you know what, I'm just not gonna do it. And then they released the HD collection of Prince of Persia, so I did that instead. Yeah, and then I just never got to Assassin's Creed 2. I've replayed... I've played the first hour of Assassin's Creed 2 multiple times, but that's enough. Yeah, you've seen enough. That's one of those games where I know people get mad at me; it is what it is. It's you know we all have our own opinions, but I played that game as thoroughly as it could be played, the platinum trophy proves it, and I... I finished that game, and I'm like, \"What is\"",
            "start": 934.4
        },
        {
            "text": "We all have our own opinions, but I played that game as thoroughly as it could be played; the platinum trophy proves it. And I finished that game, and I'm like, \"What is everyone talking about?\" You know? Like, I had a great time with it, but I mean, I understand it's like taste every time you talk about the gameplay or whatever, I get like, \"Oh my God.\" Which is why I mean, I don't think you'd like Middle-earth: Shadow of Mordor. We'll see. I mean, I like The Lord of the Rings, so I just want to see... I'm a little tired of The Lord of the Rings now; it's like it's too cool for school with every yeah. But Colin, Assassin's Creed 3 – I don't think there's anything you like more than I thought I thought for sure I was going to... I mean, I was enamored with that game before it came out. I was like, \"This is cool; this is cool.\" I get down with this, and I wish the gameplay was as",
            "start": 972.92
        },
        {
            "text": "going to I mean I was I was enamored with that game before it came out I was like this is you know yeah this is cool this is cool I get down with this and I wish that I wish that the gameplay was as good as the setting I couldn't I I never fin I can't play this game anymore like halfway through I can't do it I can't play it it's just too why am I wasting my time I can't I can't do it so but that was just an example of the with Black Flag, where I was like I got to accept that I have to immediately write it off without playing it like I I can be excited about it and maybe I have to be that way about a game like Alien: Isolation or something it's just like Devil Within is another great example like I was really authentically excited about that game Makai, you know throwback Res Evil real survival horror like we got out of Dead Space which was I think still the last great survival horror game um and then I don't know and it came out and I'm like I don't know what",
            "start": 1008.44
        },
        {
            "text": "We all talk about our gaming backlogs that we will hopefully get to one day. We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1 This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com Each and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\n\nFollow us on Twitter! Tim - http://www.twitter.com/TimGettys Greg - http://www.twitter.com/GameOverGreggy Colin - http://www.twitter.com/NoTaxation Music by Rakohus!: http://www.youtube.com/user/rakohus\n\nres evil real survival horror like we got out of Dead Space which was I think still the last great survival horror game um and then I don't know and it came out and I'm like I don't know time you know like it sucks I wish I wish I could just for a month not do anything but to catch up on these games and I'd be fine but then I probably would't have a job or money and a relationship and life life and no sausages no sausages prob make time for that well guys what are your gaming backlogs let us know in the comments or on Twitter or wherever you you're watching this video iTunes review I was going to say you're on a bu listening to it like tell the person next to you they'll definitely enjoy it and make time for their games too this has been episode four of the kind of funny games cast let us know what your topics are for uh following episodes hit us up on Twitter kind of funny vids Tim Gettys atot Taxation and gameover gregy on the twitters thank you yes and until next week I love you",
            "start": 1042.68
        },
        {
            "text": "We all talk about our gaming backlogs that we will hopefully get to one day. We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1 This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com Each and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\n\nFollow us on Twitter! Tim - http://www.twitter.com/TimGettys Greg - http://www.twitter.com/GameOverGreggy Colin - http://www.twitter.com/NoTaxation Music by Rakohus!: http://www.youtube.com/user/rakohus\n\nus know what your topics are for uh following episodes hit us up on Twitter kind of funny vids Tim Gettys @TimGettys and GameOverGreggy on the twitters thank you yes and until next week I love you bye",
            "start": 1087.24
        }
    ]
}