{
    "id": 491,
    "video_id": "GHCz_8E5X4Y",
    "show_name": "Follow the Liter",
    "hosts": [
        "Nick Scarpino",
        "Erick Castro"
    ],
    "title": "What Drink to Order on a Vacation - Follow the Liter",
    "description": "Welcome to our newest show Follow the Liter, where we teach you how to make fancy drinks that will impress your friends. This week, the Rum Runner!\n\nGet a cocktail named after you here! http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter!\nNick - http://www.twitter.com/Nick_Scarpino\nErick - http://twitter.com/castrodisiac\n\nMusic by Tonedeff: https://twitter.com/tonedeff",
    "published_at": 1420131610,
    "duration": 192,
    "transcript_chunks": [
        {
            "text": "Welcome to another episode of Follow the Liter, I'm Nick Scarpino and this is Master Bartender Mr. Erick Castro. Erick, how you doing? Feeling good, fantastic. Erick, every once in a while, you know, I got this thing called a wife, maybe call it's every 6 months my wife wants to go on this thing called a vacation but every time I go I'm kind of bored, I'm sitting by the pool when I'm by the pool what's a good cocktail to order. I recommend a Rum Runner, man, a Rum Runner - rum runner is a nice mixture of some citrus rum, pineapple, can't go wrong, man. Right, let's get into it then. So, to start out with a Rum Runner, do two dashes of Pernod's bitters all right. Next we're going to do 3/4 oz fresh squeezed lime juice - except no substitutes an ounce of pineapple juice, mhm. If you can please go with fresh squeezed and 3/4 oz simple syrup just a mixture of one part sugar to one part water. Right here we have a pretty tasty mixture okay doesn't look alcoholic though which will only be improved with the addition of 1",
            "start": 0.25
        },
        {
            "text": "3/4 oz simple syrup, just a mixture of one part sugar to one part water, right here we have a pretty tasty mixture. Okay, doesn't look alcoholic though, which will only be improved with the addition of 1 oz white rum, okay and a 1 oz aged rum going to shake this up all right leave you feeling tropical my friend I can feel the tan already smell that cocoa butter give it to me there it is. Shake It Up smells so delicious look at that wonderful no do to strain it just go ahead and dump it ice and everything ice and all goes right in there look at that that's the perfect pour oh beautiful at that CP straws garnish with the lime wheel mhm you're in business here we are here you go folks The Rum Runner. All right Nick give it a try let me know what you think all right here we go, The Rum Runner by Erick Castro, oh that is good wow that finishes nicely you get that light that that finish of pineapple afterward makes I'm going to run right into the arms of my wife mhm which is not something I normally",
            "start": 56.28
        },
        {
            "text": "Caster, oh, that is good! Wow, that finishes nicely. You get that light finish of pineapple afterward. I'm going to run right into the arms of my wife, mhm. Which is not something I normally want to do. Eric, thank you so much for joining us. If you guys like custom cocktails, you can find some of Eric's custom cocktails at either Póte Provisions in San Diego or at The Boiler Maker in New York City. Eric, you got a special thing to tell our audience right now? Right? If you'd like me to come up with a specialty cocktail custom made just for you, go to patreon.com/kindafunny. Thanks again for watching everyone! If you like this video, make sure to subscribe to youtube.com/kindafunny and uh, you know while you're watching, why don't you go ahead and leave a comment? That's fantastic! Eric, thank you again. Let's go swim in a pool! Let's do it! Cheers and happy mixing!",
            "start": 138.4
        }
    ]
}