{
    "id": 1874,
    "video_id": "p1OT1yronVw",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Let's Play H1Z1: King of the Kill - Kinda Funny Plays",
    "description": "Tweet @H1Z1KotK with #H1Z1Funny to play on our team at RTX! Find out more here: http://roosterteeth.com/post/51269374 \nClick here for more info about the game: H1Z1.com/KotK \nThanks to Daybreak for sponsoring this video.\n\nTim and  Greg play H1Z: King of the Kill\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1466807610,
    "duration": 2572,
    "transcript_chunks": [
        {
            "text": "What's up, guys? I'm Tim Gettys. This is Greg Miller. We are playing H1Z1 King of the Kill Battle Royale mode. Now, you may say, Greg, why would you play a PC game? And there's two answers. Number one, we're playing this. I'm playing this at RTX 2016. We're going to give you all the information. Well, it's at RTX, isn't it? But it's called the RTX. Just back off. Just back off. It's at RTX. Anything, Greg. Number one, I'm playing it at RTX, so come play with me. Number two, uh, Daybreak sponsored us or whatever. This is a sponsored let's play. So, we played this yesterday for the first time, right? I like it a lot. You start off, you parachute in. All the different players parachuting in. It's session based. It's we're, you know, it's battle royale. It's a, you know, all of us are in there. It's like Hunger Games. We're all in there for each other. Like there it's huge. Look. Oh, there. I didn't see I'm better. I'm much better today. Today. I see people. Now, granted, I made it to the",
            "start": 0.08
        },
        {
            "text": "It's like Hunger Games. We're all in there for each other. Like there it's huge. Look. Oh, there. I didn't see I'm better. I'm much better today. Today. I see people. Now, granted, I made it to the top 17 before. Are we We didn't see anyone. We hit I'm going to come right for this guy. How's he getting in there? I don't think this is going to end well for you. I like the strategy of running away better. I think he knows where the guns are. Well, I know where the guns are, too. Do you all right here? For some reason, I don't think you're right, Greg. Anyway, yes, the idea is there's 148 remaining. You can see they're getting taken down one by one. It's the last man standing. Yeah, he is the king of the kill. Yeah. Now, now who's smart? You're smart, Greg. You're smart. Thank you. I'm really, really proud. Now, I'm just going to stand here and wait for Chief Whack-a-ole to come in the house. Chief Whack-a-ole, be careful of the windows. Come on, you son of a [ __ ] I know you're out",
            "start": 36.88
        },
        {
            "text": "really proud. Now, I'm just going to stand here and wait for Chief Whack-a-ole to come in the house. Chief Whack-a-ole, be careful of the windows. Come on, you son of a [ __ ] I know you're out there. God, it's so sensitive still. I toned it back. Mr. Camping. That's true. You pitch your tents. Oh, here's even a better idea. Come on, you son of a [ __ ] Man, people have been just dropping like flies. You remember how this goes? I didn't get to, you know, top 17 yesterday by [ __ ] going out there and being balls of the wall. No, you just ran around the mountain. He's coming. Shut. Shut up. Shut up. I'm not kidding. He's really coming. Oh my god. Should I not Should I not be down iron sights? Feel like it's too sensitive. This is bad. I regret my plan. I regret my plan. Do you think we'll even come in here? Oh god, what do we do? I bit off I bit off my Pikachu. I mean, I'm standing on top of a bathtub, so I don't know. That's why it's important to crouch. Okay, I'm crouching. Oh god.",
            "start": 80.24
        },
        {
            "text": "even come in here? Oh god, what do we do? I bit off I bit off my Pikachu. I mean, I'm standing on top of a bathtub, so I don't know. That's why it's important to crouch. Okay, I'm crouching. Oh god. Oh, he's not dead. You didn't kill him. I know. Too low. You shouldn't have crouched. Why'd you crouch, Kevin? That was horrible advice. [Laughter] You think you spooked him? I did spook him for sure. But does he know how to make like pipe bombs and stuff? You think? I think. Oh god. And I'm using the keyboard. Oh god. Damn. People are just dropping. Maybe he's spooked away. Hold on. Can I close the door? At least we know when they're coming now. Yeah. Oh god. Ladies and gentlemen, this is brought to you by the RTX Showdown. So, here's the deal. At RTX, my palms are so sweaty. Knees weak. My spaghetti. Um, all right. So, at the RTX Showdown, all the different Let's Play teams. So, you got screw attack, you got fun house, you got achievement hunter, obviously kind of funny. Uh, creatures,",
            "start": 131.28
        },
        {
            "text": "spaghetti. Um, all right. So, at the RTX Showdown, all the different Let's Play teams. So, you got screw attack, you got fun house, you got achievement hunter, obviously kind of funny. Uh, creatures, they're all going to be there playing H1Z1 Battle Royale right there on the center stage. Oh, no. Oh, man. He came back for you. Yeah, he went and got a real gun. He came back. Oh, good lord. Oh, man. It's okay. Look how Man, we spackled the wall, man. That was intense. And that scared me. Well, that's, you know, is it different? Well, yesterday, yeah, I I hung out. I at camp like I will do at RTX with my team, of course, so they support me cuz it'll be everybody surrounding me. Captain, let's get into another game. Okay. Oh, jeez. All right. So, yeah. So, pretty much each of us have a different team. Team captain. Greg is our team captain. I'm feeling really good about that, but we're going to need your help. So, here's the thing. If you tweet at H1Z1 KOTK using the hashtag H1Z1 funny,",
            "start": 190.32
        },
        {
            "text": "team. Team captain. Greg is our team captain. I'm feeling really good about that, but we're going to need your help. So, here's the thing. If you tweet at H1Z1 KOTK using the hashtag H1Z1 funny, you can get chosen to play online with us. 10 of you will be chosen to protect Greg Miller. And I'm gonna need it in this battle royale. Yes. Here's what I want to do. Now that I'm back in here, I want to dial my Hold on. I want to dial the this mouse stuff. I just don't I can't do it. And this I'm going to I want to bring zero. Maybe it's your aiming sensitivity you need to change. Oh, is there a different one there? I didn't see it. Well, this still I want to be This is more reasonable. Okay. Okay. If you're RTX I'm just a simple console player. You can go to the H1Z1 booth to win a chance to be the final person on the team because it's teams of 12, Greg. Five teams of 12. Yeah, I'm pretty excited. I'm feeling better now. I'm feeling better. I'm feeling good. You're definitely going to beat",
            "start": 233.04
        },
        {
            "text": "the final person on the team because it's teams of 12, Greg. Five teams of 12. Yeah, I'm pretty excited. I'm feeling better now. I'm feeling better. I'm feeling good. You're definitely going to beat that Adam Kovic son of a [ __ ] Adam Kovac won't even show up cuz he's such a coward. He'll be working out like all the other fun house boy toys. All these fun house boy toys except Lawrence. He's cool. Lawrence is pretty cool. Everybody else sucks. 30 seconds. So now, do we do we want to try to win? Should I go and hide? Cuz I had fun. That was fun. It was like frantic fun, but I died right away. But like I had fun with it. You know what I mean? Like I didn't mind dying. It was better, I think, than the 30 minutes yesterday of running around and hiding in trees by trees, having no weapons until the very end. Yeah. Oh, he's got attack on Titan pants. They're just pants. They're attacking Titan pants. Let's see what happens. Okay. If you get thrown into a group of [ __ ] let's follow them.",
            "start": 279.28
        },
        {
            "text": "the very end. Yeah. Oh, he's got attack on Titan pants. They're just pants. They're attacking Titan pants. Let's see what happens. Okay. If you get thrown into a group of [ __ ] let's follow them. Maybe. Okay, we follow them. That's dangerous. You know, follow them. From this time, at least we scoped out like where to land. Any building, it seems like it's going to have a gun in it, which is helpful. I like that line. Cuz you found one yesterday at another building. Fort Truffle Butter or whatever. You made that name up. That wasn't I want to go there. That music. See, we're not seeing anyone in the air. Yeah, I saw them over there. They're all over there. This is awesome. Yeah. No, this actually is cool. I can't wait for this to come to PlayStation 4 so I can play with the controller like a normal human being. What do you think, Kev? There's so many people. Try to land on the air strip. I was going to say this is going to make for great let's plays. It will on PlayStation one right",
            "start": 324.16
        },
        {
            "text": "a normal human being. What do you think, Kev? There's so many people. Try to land on the air strip. I was going to say this is going to make for great let's plays. It will on PlayStation one right now. Oh, okay. I'm coming up way short. I haven't figured out exact. Oh, okay. It's all in the look. Oh, you have to pull it. It's all in the look. Stupid. Oh god. Oh no. No. That's probably the worst place to land. slowly treasure through the water. Now, theoretically, right, I could just go prone. Just wait. I could just go hide into the bridge like like the troll I am. I'm going to the bridge then I'm going to that log cabin. Log cabin. I don't see cabin right to the right. You want to let things die down a bit? Yeah. Let everybody get out here. Yeah. I got nothing to prove. I'm trending gamer. You are I'm South by Southwest gamer. I don't need I don't need to come over here and act like I got something to prove. Oh god. Do you think they're shooting at me? Now, people would say this",
            "start": 362.88
        },
        {
            "text": "gamer. You are I'm South by Southwest gamer. I don't need I don't need to come over here and act like I got something to prove. Oh god. Do you think they're shooting at me? Now, people would say this cowardly, but I say it's smart. Everybody out here wants to get kills and stuff. I like how many players are involved. Oh, yeah. Like it really I it ups the the ante a lot when everyone just drops in the first place. People are shooting like right on top. 60 seconds. But they're not shooting you. They're not trying to scare you. No, I know. They don't know where I am here. They don't even know. They're having like their whole thing up there. I'm haha killing 200 Mataya. Oh, they're driving away. There's Somebody's driving across. They're taking off in the van that was up there. I go. You think I should go now? Yeah, go. Yeah, you're safe. I do not think I'm safe, but okay. Everything feels safe. You think that truck works? Yeah. Was that someone's bag? You stupid ass [ __ ] PC gaming. Oh",
            "start": 417.04
        },
        {
            "text": "I should go now? Yeah, go. Yeah, you're safe. I do not think I'm safe, but okay. Everything feels safe. You think that truck works? Yeah. Was that someone's bag? You stupid ass [ __ ] PC gaming. Oh [ __ ] Oh god. I saw him. I was like, \"Oh [ __ ] look at that head jitter. I'm going to need a lot of protection at RTX at the RPX showdown.\" Sorry. RTX showdown. Tweet H1Z1 KOK for King of the Kill using the hashtag H1Z1 funny. We're kind of funny. That's us. We're kind of funny. You'll need to protect me. I kind of want to play. Let me play. No, you don't. No. No. Yeah. You don't know how. You don't know how. I don't know how. No. Did you not remember me at Let's Play Live Straight Murdering Fools at Murder. Yeah, but I mean that's different. That's like a game of like, you know, chess. This is a game of speed. I was the murderer. When you think speed, you think great. Let me have one more. Then you can have one to end it. How about that? All right. Thank you. Cuz I need to practice. You",
            "start": 454.24
        },
        {
            "text": "is a game of speed. I was the murderer. When you think speed, you think great. Let me have one more. Then you can have one to end it. How about that? All right. Thank you. Cuz I need to practice. You don't need to practice. You practicing doesn't help you at the RTX showdown. Me practicing help. What if I tweeted out H1Z1 KOTK and used #H1Z1 funny? I'm pretty sure that that's just, you know, No, I don't think I think you'd be disqualified. They want to pick you know, they know there's no fine print. This is Twitter. Don't do that, Greg. Sorry. I got my field badges. Got my brown jeans. Got this. I got a blue and orange shirt. I got a vet tickets and crate tickets. Now she's punching me. I had that comer. I had that comment. I'm not You did. You did. How do you take your clothes off? Cuz yesterday we saw people running around in the little skinnies. I'm going to open some crates and get some stuff. I want you in a cowboy hat. I'm I'm getting stuff. We're getting stuff right now. That's",
            "start": 511.92
        },
        {
            "text": "we saw people running around in the little skinnies. I'm going to open some crates and get some stuff. I want you in a cowboy hat. I'm I'm getting stuff. We're getting stuff right now. That's it. Yes. Okay. Halfway there. Some would say fully there. I'm burning my keys here. Some would say fully. It is the cowboy hat you wanted, right? It's the Outback hat. It's even better. You guys love Outback. I We love Outback. Okay. I think you need to unlock nudity. No, I just I'm not going to do that cuz I I want to be I want to blend in with my surroundings. That guy got the drop on me cuz he had the cool helmet on. Did he? Yeah. Yeah. He popped up. I mean, I am using I'm using a pistol and both the guys who have killed me have had like rifles, you know what I mean? Like multi-shot rifles. I wish you had committed that first guy. you would run out and kept shooting. But it's PC. It's a PC game. Like I can't move and shoot. That's not a That's not a real thing. I know. Wazda is dumzda. That's",
            "start": 557.68
        },
        {
            "text": "you had committed that first guy. you would run out and kept shooting. But it's PC. It's a PC game. Like I can't move and shoot. That's not a That's not a real thing. I know. Wazda is dumzda. That's the real thing we're all saying. Am I right? I feel like you're just incompetent. I agree that I'm incompetent. I agree with everything you're saying. I have no idea how I was. Gamer award winner. If we're being honest, I think it's cuz you all guys wanted to go home. I'm the only one staying on Sunday. You don't even care. That's not true at all. We're all staying. No, you're all monsters. We're all staying. Now, where am I? He's a thief. He's a scoundrel. So far so good. Oh, I got a Daybreak shirt. Nice. Put the hat on, Greg. Thank you. And nothing else. There's the hat. It's on. No. Yes. What's going on? Yes. Put that What the hell? There we go. Maybe it works. Maybe. It's time to go. We got no time to worry about that one. Parachute all over the map. Guide your parachute towards loot.",
            "start": 612.64
        },
        {
            "text": "going on? Yes. Put that What the hell? There we go. Maybe it works. Maybe. It's time to go. We got no time to worry about that one. Parachute all over the map. Guide your parachute towards loot. I think what I'm going to do, that's the key thing that we didn't get to see yet cuz you keep sucking. Yeah. If you stay long enough, I'm saying let's camp again. Let's camp again. All right. Let's Let's try the camp. We're going to We're going to We're going to ride this one out. Whoa. Don't need to see that. So, there are all the people things in my life. Furious 7 Power Rangers movie opening. Man, there I don't remember this many parachutes last time we did this. The first time we did this, I should say. I'm just going to stay in the air as long as I can. I don't like this. Oh my god, that guy came right for me. Like a buzzard. Mm- This is good. You're in the You're going to be in the trees. Just before you have sure you know who's around you. Oh Jesus. I'm I'm landing on that guy's face",
            "start": 654.72
        },
        {
            "text": "came right for me. Like a buzzard. Mm- This is good. You're in the You're going to be in the trees. Just before you have sure you know who's around you. Oh Jesus. I'm I'm landing on that guy's face apparently. Oh, you're dead. 30 seconds max. [Music] This music is It It helps for sure. Yeah, for sure. It's my laundry. Thank you. They're dropping. Greg, what's your character name? Dave Fenoy 69. No, I'm Lee Ever 69. Lee Ever. Yeah. Walking down there. Good call. Good call. Yeah. And 69 obviously because you're a big fan of the the lunar landing. Exactly. In 1969. Not 1968, but a year later, whenever they landed. I don't know even know. I didn't think that'd be information you could just pull out of your butt. It is because of the Even Stevens episode where it was a musical and they sang a whole song about it and that's when they said it's not 1968 but a year later. That's the only reason I remember that. Gotcha. [ __ ] Thank you, Shilof. Shilabuff, you're teaching me [ __ ] He always",
            "start": 698.56
        },
        {
            "text": "whole song about it and that's when they said it's not 1968 but a year later. That's the only reason I remember that. Gotcha. [ __ ] Thank you, Shilof. Shilabuff, you're teaching me [ __ ] He always finds a way. All right, you're about to be in the top 100. I know. Oh [ __ ] How about that, Kevin? Yesterday you got down to what? 17. 17. I was number 17. Granted, it was cowardly in hiding and the first guy who saw me killed me, but try to beat that. I mean, I if this is Hunger Games, I am totally that like four-year-old that you just put out there. You're not giving yourself credit. It was the second guy that saw you. I still think it was the first. He don't. It was another guy that came around. That guy went around that way and this guy came this way. See, I don't think anybody in this game runs like that. I think people are they're hardened killers already. I'm still soft and spongy. I don't know. I don't have the killer instinct. Yeah, but like soft and spongy wins the race",
            "start": 767.2
        },
        {
            "text": "this game runs like that. I think people are they're hardened killers already. I'm still soft and spongy. I don't know. I don't have the killer instinct. Yeah, but like soft and spongy wins the race apparently. I think that's what we're going to do at RTX. Optic Nate shot. You think that's our optic nate shot? No. Hi, Nate shot. If it is, I know you 94. I'm liking your odds. Was that toxic gas? Not yet. It's way too early for toxic gas. Hey, go find a gun. No. Okay, Kevin, remember when we said the plan was to camp, not to go find a gun. I found a gun the first the last two games and they were my worst games yet. The game where I hid I You should find a gun. But remember, there's a gun in camp. I know. We are on what? We are at F7. We are at F7. So that means it's right here. That's a good spot to be. Now, I can go I can go to the cranberry over here if you want at H7 all the way to the east, but that's going to be people. I try to go to this camp here. Nah, you don't want to let me",
            "start": 811.44
        },
        {
            "text": "spot to be. Now, I can go I can go to the cranberry over here if you want at H7 all the way to the east, but that's going to be people. I try to go to this camp here. Nah, you don't want to let me go to the wilderness camp. There might be stuff. Do that. Do that. Do that. That's G8. G8. So, you got to go southeast. 87 people left. Your boy Greg Mill one of them. Yeah. Chip 865. Oh sh What the [ __ ] Oh, okay. Oh dear. What? Remnants of the people who came before. Oh no. What if I can pick up the parachute and just fly away? Dear God, please make me a bird so I can fly far far away from here. Poor Gum C. No, I know. I know Jenny reference. I don't know why I sound like a Morgan Freeman. That's how she talks in the movie. That's a great Jenny impression. Dear Lord, please make me a god. Now, now I am starting to become Morgan Freeman. You're in my head. [Music] I just do too many good impressions. It's true. Where are we going? I forgot. Uh D something. G G8. G south east. I need to",
            "start": 862.0
        },
        {
            "text": "Now, now I am starting to become Morgan Freeman. You're in my head. [Music] I just do too many good impressions. It's true. Where are we going? I forgot. Uh D something. G G8. G south east. I need to start heading south. I'm already cuz I'm already at the seven marker here. I'm getting Oh, no. No. It was a shadow. It was a shadow. Shadow. No. 72. The toxic gas will be released in five minutes. God damn it. Seems like it happened a lot faster yesterday. I think I think I think it's based on people dying. Maybe to start bringing the herd together, you know, cuz I'm and I'm definitely on the outskirts here. We're definitely going to have to get 70 remaining. You're about to do it. Great. It's a big ass G square. Only the G spot was this big. You know what I'm saying? I know. Oh, I'm in G7. Holy [ __ ] I'm You're going to be [ __ ] Yeah. We're turning right around. We're going head. We're heading do north. We're going north. North. Miss Tessocker. I do like what this map this game is",
            "start": 932.24
        },
        {
            "text": "Holy [ __ ] I'm You're going to be [ __ ] Yeah. We're turning right around. We're going head. We're heading do north. We're going north. North. Miss Tessocker. I do like what this map this game is doing with your map skills. Feel like you're both learning a lot. We are learning how to use map. 69 remaining. [Music] What? It's Luna landing. Yeah. I love that we have a [ __ ] studio at all times. So, we need to get to at least G5. No, we love you, Kevin. You're doing great. Can people hear you on our mics a little bit? The laugh. Good. The laugh. Yeah. Every like two seconds they hear. [Laughter] He does cackle. That's fun. It's part It's part of It's part of the charm of kind of funny. It definitely is. This these are not This is not sarcasm, Kevin. I'm actually complimenting how much I like your laugh and how much I like that movement you're doing, though. It does kind of look like you're having a little seizure over there. I'm pretending it's a wheelchair. Like Professor X. No, I got",
            "start": 1001.12
        },
        {
            "text": "your laugh and how much I like that movement you're doing, though. It does kind of look like you're having a little seizure over there. I'm pretending it's a wheelchair. Like Professor X. No, I got it. Like Professor X. Why not Tim? Okay. Why is the music? No, that's the planes coming in. Remember, you're right. They're getting ready to drop that gas. It's like a little rumbling. Yeah. Sounds like an orchestra crescendo. It does. It does actually sound like an orchestra warming up. Sounds like But it does sound like an orchestra warm up. Crescendo is like the moment where everything is playing, Tim. Yeah. Sounds like it's filled into that. Building into the crescendo. Okay, that's very different than it crescendoing. Not what he said. It's not what he said originally. G6, which is almost safe. Now, of course, the real concern is that people are going to be here soon. Not soon, actually. It took a long time for people to get here before. I think veteran players don't worry as much",
            "start": 1054.24
        },
        {
            "text": "safe. Now, of course, the real concern is that people are going to be here soon. Not soon, actually. It took a long time for people to get here before. I think veteran players don't worry as much about the gas as I do, but they're not out there like the snake in the weeds. I am just trying to lay low. Mr. Snake in the weeds would be easier if you had a car. Yeah, maybe cuz then I could just Yeah. be safe in my car, too. But like it's okay. The gun, we've already shown the gun does not make you safer. If anything, it makes me more afraid. Right now, I'd rather them just be shooting at me and me zigging and zagging than have a gun. So, do you think Delila is real? Hey there, Delila. What's it? I don't know. Who's Delila? We talking about Firewatch. Oh, I see what you're doing. That was a really good reference and I dropped the ball. I'm sorry. I'm a thousand miles away, girl. 52. You about to be top the new 52. All right, hold on. Uhoh. Uhoh. So, we're coming up on civilization. Look at",
            "start": 1104.72
        },
        {
            "text": "good reference and I dropped the ball. I'm sorry. I'm a thousand miles away, girl. 52. You about to be top the new 52. All right, hold on. Uhoh. Uhoh. So, we're coming up on civilization. Look at the map. See where you at? I'm right here. No, I guess I'm No, there's water. Well, I'm I was G. I'm sorry. I'm right there. Yeah. Yeah. I still got to cross five. That's G6. G5. I'm trying to get to G5. Okay. scared, guys. Me, too. You know what they say about scared? It's just the first step towards love. Uhoh. Quietly. You're swimming so loud, Greg. Also, it's not what they say about love. [Music] 60 seconds till toxic gas. Ding, ding, ding, ding. You hear that? Ding, ding, ding, ding. Yeah, it's the plan again. There it is. Ding, ding, ding, ding. Eyes on the bird. I don't like how open you are. I don't like how fast you're moving. So, hold on. I'm sorry. Right now, I'm wearing You're F6. F6. Still. F6. Mother effort. I got across the water for sure. Already crossed it. No, that was a",
            "start": 1150.0
        },
        {
            "text": "are. I don't like how fast you're moving. So, hold on. I'm sorry. Right now, I'm wearing You're F6. F6. Still. F6. Mother effort. I got across the water for sure. Already crossed it. No, that was a little That was a little tribute. A little spring. No, I don't think so. Well, I'm not I'm Keep going north. If you see more water, you've crossed the water. Oh, hold on. Maybe you're right. I Yeah, you're right. I'm heading this way, I think. What? No. Yeah, that makes sense. You're heading north. You're heading this way, guys. All right. 48 remaining. Do north. All right, Kev. I'm just trying to explain where I crossed water that isn't on the map. You You already crossed that water. All right, Kev, shut up. Okay. Right. Just power lines. Might be a power station. What the [ __ ] There's a predator crate. You received it. You What does that mean? You just walked over it. You did you use all your keys? No. Good. Open it then. I I don't know. How do you open a Predator crate? I don't know",
            "start": 1237.36
        },
        {
            "text": "crate. You received it. You What does that mean? You just walked over it. You did you use all your keys? No. Good. Open it then. I I don't know. How do you open a Predator crate? I don't know what's up. Inventory. Predator crate. Open the crate. Unlock now. Oh, you can get a cool ass mask. Please give me a weapon. I don't want a mask. There's no weapon there. Okay, you can all burn in hell. Dope ass gloves. Greg, you got them dope ass gloves. Where the You just stand. I don't see. You all wanted me to open the damn crate and we did. Now we got gloves. Good. That would be great [ __ ] on my funeral. I'll be buried them in my casket. Bang you. Bang you. Bang you banga. Build corn hub. Can you beat 17? I don't like how much stress this is giving me. As Colin would say, it's giving us the aida. Aja. Ouiji again. Remember, if you want to play with us and protect us, protect our bodies. We definitely need it. I'm going to hide here. So, tweet at H1Z1. I'm F5. Kotk using the hashtag H1Z1",
            "start": 1304.48
        },
        {
            "text": "aida. Aja. Ouiji again. Remember, if you want to play with us and protect us, protect our bodies. We definitely need it. I'm going to hide here. So, tweet at H1Z1. I'm F5. Kotk using the hashtag H1Z1 Bunny. So, I might be safe. You can also say something mean. Yeah, I'm safe here. About stuttering Craig. He sucks. Or Adam Kobic or anyone else. Gavin free. does anything mean sucks. It's like I feel something that's like you know I think what I mean we need to get a weapon. We're past that. We're past that. You died. So there's one more left at this point. Yeah. You just got to you just got to get to the center of this thing. No, we're going to get to number two. We're going to be very [ __ ] proud of it. Yeah. So head to Dragon Lake. If you come across a weapon, you come across a weapon. Let's not get crazy. Okay. You find a bridge, you get under it. Mhm. All right. So, we're going to G four is where we'd like to be. 36. You want to head northwest, right? East. Yeah. Okay. Backwards",
            "start": 1367.96
        },
        {
            "text": "Let's not get crazy. Okay. You find a bridge, you get under it. Mhm. All right. So, we're going to G four is where we'd like to be. 36. You want to head northwest, right? East. Yeah. Okay. Backwards from here. I hear you, bro. How's it feel to know there's 35 other [ __ ] out there ready to I think I'm going to I'm going to bargain with one of them. Oh, wait. There's a campsite. Yes. Oh. Oh. Oh, hold on. Uh, god. Wazda. Why Why can't you just be a controller? All right, we got Oh god, I [ __ ] hate you so much. Punch the bullets. Okay, cool. You got a blue backpack. Where's the shotgun? I can throw the shells at people. It's okay. I hear that's half as effective. 33. Greg, you're on your way. You can beat your 17 record. I just want to make sure here. It just hits the ground. I love it. Hold up. It's gross. So, at RTX, the showdown is going to consist of two rounds of stat standard battle royale. These are weapons. At the end of the two rounds, whichever team's captain plays best on",
            "start": 1420.72
        },
        {
            "text": "Hold up. It's gross. So, at RTX, the showdown is going to consist of two rounds of stat standard battle royale. These are weapons. At the end of the two rounds, whichever team's captain plays best on average will be declared the winner. So, that'll be Greg Miller. I don't need a goddamn shirt. I need a [ __ ] weapon. So they're putting a twist like they're kind of making their own game type here because usually obviously it's just last man standing but this is because it's captain you're making your own teams and [ __ ] within the game type. There's no weapons. Get out of there. I might I got a backpack. Does the backpack not have a weapon? No. It lets you carry more things. I want a weapon. Can I craft a weapon here? Hold on. You can't craft a weapon. Don't be dumb. I need a wood plank. Oh Jesus. Okay, so hold on. We are at F5. Oh god, it's getting there. F5. And I want we were saying I want to get over what's down to G. No. What? H H3. Something in the threes. H4. All right. The",
            "start": 1507.28
        },
        {
            "text": "Oh Jesus. Okay, so hold on. We are at F5. Oh god, it's getting there. F5. And I want we were saying I want to get over what's down to G. No. What? H H3. Something in the threes. H4. All right. The journey begins a new. You're heading east. I don't like how open that area is. Nope. There it is. There we go. I'm okay with how open this area is. Nope. Not okay with this at all. There's definitely a weapon around here. Is it? Do you think I punch the tree? I can make wood planks. No. No. Can't even punch the tree. I'm a pacifist. Damn it. He loves them trees. Coward. Lola, careful. There's all these wires. Oh my god. Get out of here. No. Did I die? Come on. Just close the door. So hot. [Music] Uhoh. Uhoh. Oh. Prone. Prone. Prone. No. Prone. I double tap prone too much. Uh. What? That didn't sound like me. That didn't sound like you at all. Was it you? Were you grunting for how prone you got? The first time I must have grunted ever in this game. 27. Christ. 10 away. Greg, I want to",
            "start": 1545.28
        },
        {
            "text": "sound like me. That didn't sound like you at all. Was it you? Were you grunting for how prone you got? The first time I must have grunted ever in this game. 27. Christ. 10 away. Greg, I want to congratulate you on how well you handled that. If I see if I would have had a gun, I would have been shooting like an idiot. He would have just run me over. You wouldn't have shot the car. That would have been my warning shot cuz they don't know that I don't know what I'm doing. They might think that I know what I'm doing. You know what I mean? That's a good call. We're so close to that 17. I know. All you got to do is not be seen by anybody. Or heard. Here you are walking around with your tree trunk legs. You know what? Don't knock Lee ever at 69. These tree shrunk legs have got us this far. 24. So we're up at G4 now. We in there. We should still keep moving because we want to be over here northeast. Find the river and then follow G3. H3. Find the river and then follow the river. Follow. Wise",
            "start": 1632.52
        },
        {
            "text": "we're up at G4 now. We in there. We should still keep moving because we want to be over here northeast. Find the river and then follow G3. H3. Find the river and then follow the river. Follow. Wise words. Toxic gas 30 seconds. We're still in the safe zone right now for toxic gas. 22 left. You're so close to yesterday's record. To yesterday's record. Make that clear. Hey, you know what? Greatness comes from all beginnings, Kev. True. We We learn how to survive, then we learn how to kill, and then we win the game. Yes. Cuz if we can get it to where we're in the top five and then I learn how to use a game and shoot how to shoot, you know, in a PC game, we'll be sitting pretty. There it is. You can see it. No. Oh, is that that's the gas, I think, or supply crate. Oh, I don't know. I mean, it makes sense, I guess, that that'd be the gas. I mean, maybe if it's a supply crate, stay away from it. I'm not going to it. We have a mission here. Uhoh. What? You're just out in the open. What do you",
            "start": 1701.92
        },
        {
            "text": "sense, I guess, that that'd be the gas. I mean, maybe if it's a supply crate, stay away from it. I'm not going to it. We have a mission here. Uhoh. What? You're just out in the open. What do you Yeah, it's going to happen. It's a big open. It is a big open. 21. Lordy lord. Oh no. Oh no. We're still playing. Don't worry. Oh my god. No. No. God. Jesus. PC gaming. It's so easy. Why wouldn't everybody play PC gaming? Oh, them sticky keys. Isn't there like a hold run button? Yeah, that's what the sticky key mean there for a second. Oh, I see what you're saying. You're talking about this guy. Yeah, there you go. But my problem is turning it off. I don't I don't I'm not I'm not comfortable doing that at this stage in the game, Kevin. I apologize. Make a sticky key go again. I'm not even doing it right now, Kev. And that's the first time it's ever done it, so I don't think you have to worry about it. Sticky keys are now they know to be off now. Toxic gas in 3 minutes. 21 players remaining.",
            "start": 1759.44
        },
        {
            "text": "it right now, Kev. And that's the first time it's ever done it, so I don't think you have to worry about it. Sticky keys are now they know to be off now. Toxic gas in 3 minutes. 21 players remaining. Why are you talking like Alen Rickman? There's no other way. Mr. Potter, so we're in G4. We wanted to be here. Is that right? No. No one wants to be in G4. How many people are left? 21. G4. No one. Got to let that I see the reference you're making. 20 people are left, guys. that airplane. It's just starting. There's the lake. There's the lake. Yeah, we're here. We're here for sure. Follow the lake. Oh, okay. Good. Or just stay in the bush. The far I thought we had a plan to find a bridge. 19 remaining. See? Hey, we got to adjust cuz we got to get now to G3. G3. So, north. Two north. Is that where I am? Uh. Oh, yeah. Right. G4. Yeah. I'm in G4 still. Uh, and we're the lake is in front of us. So, you got I got to hustle across the lake. Yeah. Good. You'll be fine. We're so close. So many",
            "start": 1815.52
        },
        {
            "text": "where I am? Uh. Oh, yeah. Right. G4. Yeah. I'm in G4 still. Uh, and we're the lake is in front of us. So, you got I got to hustle across the lake. Yeah. Good. You'll be fine. We're so close. So many berries. Two away. Man, you are running. North. North. East. 18. 18. Greg. No one will look for me in the lake. Who believes? Who believes? I believe. I believe. I'm not worried about the gas. What are all those rods for? Those are reads. They support the uh wetlands, the ecosystem here. There we go. I'm tied my record. We did it. How high can I go? Can this eagle soar? Uh-oh. Stop. Oh dear. They're shooting at each other. They don't know about me. Are you sure? No. No. They know about me. They know about me. Zigg, you got a zigzag. Don't make this. Oh my god. Get out of the water. I'm in the middle of the water. Can you prone? Can you just prone? No, I can't prone on your right. Oh, you got to zig. Just get to that. You got to zag. No, he's fine. I got it, guys. Now, my concern is is he",
            "start": 1875.12
        },
        {
            "text": "middle of the water. Can you prone? Can you just prone? No, I can't prone on your right. Oh, you got to zig. Just get to that. You got to zag. No, he's fine. I got it, guys. Now, my concern is is he running up behind me, you think? Well, we'll be able to turn around once he hit the wall the land. There's 13 remaining. Can we make top 10? I don't think so, man. Uh, you should also very quickly look at the map. I should also uh bandage myself. There's a lot of things happening right now. I don't have time for the map. You can bandage yourself? Yeah, I'm bleeding to death right now. This game is so deep. Okay, cool. Find a bush. I mean, he grunted again. It was the bandage. Okay, good, good, good, good, good, good, good. Look at my map. See if you're going to die. 12 players left. Where am I? You are G3. We good. I'm safe in G3. We are good. I say hit north still. I say we chill for a second. We should chill for a second. This is very tense. Just a second. The zigzag plan worked. As I",
            "start": 1942.88
        },
        {
            "text": "I? You are G3. We good. I'm safe in G3. We are good. I say hit north still. I say we chill for a second. We should chill for a second. This is very tense. Just a second. The zigzag plan worked. As I said, not having a gun is working to my benefit cuz I would have tried to shoot him before and nothing good would have come from it. Oh man, you got to zig and you got to zag. What time is it? It is 10:34. Okay, great. Great. Everything's perfect. I said we saved my playthrough for another time. Yeah, I agree. I agree. We should we should get all the guys together. Yeah. Oh, yeah. We should Can you imagine Nick out in the wild? So, I'm going to I'm going to want to head north from here is what we decided when I do get out. Yep. Okay. Okay. Uh-huh. 11 left. There's 11. I'm going to look at my inventory cuz I have other stuff. Do I have anything? I got shirts. Oh, y'all got jokes to journal st. All right. You're funny. We just want to make top 10 now. That's it. That is all we need now.",
            "start": 1999.6
        },
        {
            "text": "my inventory cuz I have other stuff. Do I have anything? I got shirts. Oh, y'all got jokes to journal st. All right. You're funny. We just want to make top 10 now. That's it. That is all we need now. [ __ ] I'm still bleeding. [ __ ] What? Oh [ __ ] Bandages can be used to regain a small amount of health and stop bleeding. Multiple JS can be a lot at the same time to increase the amount of health. Put them all on. Just put them all on. I agree. I'm right there with you, buddy. Yeah, it's working. We're going. I'm scared we're not going to have enough time for you guys to run to the safe zone once it shrinks down again. We're so close to it, though. I mean, are we? Those squares take a long time to run through. You want me to get going? Yeah, I think it's time. All right. We haven't seen our our buddy who was shooting at you. He How about I just crawl there? JK. JK. Okay. I say you stick to the trees. 10. We did it. Top 10. We're breaking records, Greg. We are trying to do your",
            "start": 2053.92
        },
        {
            "text": "seen our our buddy who was shooting at you. He How about I just crawl there? JK. JK. Okay. I say you stick to the trees. 10. We did it. Top 10. We're breaking records, Greg. We are trying to do your records, but you see somebody No, it was just popping. It was just Okay, Kevin's scaring me when he starts pointing the screen like a crazy. Well, I thought I saw something. I understand. I I respect that and like that. To be fair, he did see a rock. Not that we have a gun that we can shoot anyone with. Even when I had the gun, we couldn't shoot anybody with it. So, I don't think we have to worry too much about that. You shot that guy in the gut pretty good. He probably bled out and died. At least got a wicked infection. True. He No, he definitely used his field bandages. I got that for me. Now I have all these shotgun shells to throw at people. Toxic gas. 60 seconds. Three. We're at H3. Uhoh. Uhoh. Never. Uh, cross. Cross the lake. You got to go west. Yeah. Go west, young man. Go west.",
            "start": 2107.44
        },
        {
            "text": "Now I have all these shotgun shells to throw at people. Toxic gas. 60 seconds. Three. We're at H3. Uhoh. Uhoh. Never. Uh, cross. Cross the lake. You got to go west. Yeah. Go west, young man. Go west. The lake. As long as you're on the opposite side of it now, you should be fine. I don't need to fall at your feet because you cut me to the moon. Wait, hide in those bushes. Look at that map one more time. Sure. You read my mind. Hiding in bush is the Greg Miller way. All right. So, we're in G3. H3. So, we should be right there. Oh, we're in H3. No, we're in G3. We're in G3. Okay. So, we're right here. We're right here. Oh god, they're here. Who? [Music] [Music] Shh. I for sure heard footsteps. Then they stopped. So they either ran away from us or they're right there staring at my feet, deciding if I'm joking or if I'm really a defenseless human who has no business playing this game or still being alive. 10 people in. I say you get up and run to the other side of that river. Well, you",
            "start": 2173.6
        },
        {
            "text": "if I'm joking or if I'm really a defenseless human who has no business playing this game or still being alive. 10 people in. I say you get up and run to the other side of that river. Well, you just cross the river. Yeah, I know. But cross the other river. You want to cross? That sounds dangerous. No, but we're in G5, four, five, three. So, we're we've already I think we've I think we crossed this river. I think we were on the shore in H and then we crossed over here. If anything, I'm going to have to worry. I'm just going to chill. I'm just going to chill for a sec. Oh god, that was you. I was like, what the [ __ ] happening? Oh god. I've heard a lot of good stories about people playing this together where they make like a pseudo like fake team and they just squat it out. Oh good lord. So now we got to get up. Follow that river. Follow the river. So we're going north everybody. Everyone's going to be following the river. I know. It's like Pocahontas. I'm going to stay off of the",
            "start": 2249.76
        },
        {
            "text": "So now we got to get up. Follow that river. Follow the river. So we're going north everybody. Everyone's going to be following the river. I know. It's like Pocahontas. I'm going to stay off of the river, but follow the river. You know what I'm saying? I can still see the river. I know where it is. Just head north at that point. Why? Why is there just dongs? I think that was more the dropping of the next thing of gas. I don't want you to die from the gas. I want to blow your brains. No, I want I want somebody to be a man. I wanted to come down to one and two. We just go in there and swing throw nucks. Wait, what's that? Oh, but it's burned out, I think. Isn't it? Get a car. They do. You look burned out. No. Get Oh [ __ ] Oh [ __ ] They're gone. We're good. I like how we freeze. Let me do I don't think any of those cars are working. The van's definitely the car. You think the van's working? That van does not look like it's working. When I die, this isn't your fault. This is your fault.",
            "start": 2299.36
        },
        {
            "text": "don't think any of those cars are working. The van's definitely the car. You think the van's working? That van does not look like it's working. When I die, this isn't your fault. This is your fault. I'm dead. Wait, you're going to die regardless. True. At least this way you die in style. Oh my god. Run, Greg. Clear. Not working. I hate you. I hate you so much, Kevin. Oh god. Zig and zag, guys. Zigzag time, guys. There's a bridge. Okay. Yeah, there's somewhere there. Where? No. Do you hear the music? Oh, I heard No, I heard the gun. No, that's the plane. But I heard the gun. Okay. There's a car down there. I saw I saw it. I saw it, guys. We can't telegraph that we're running to the car. Well, we we're going to run to the car. Yeah, but he the the killer doesn't need to know that. I wonder if he's just watching you. The best is going to be when I Oh god, there was a person in that car. Can I get help? Sir. Sir, I need your help. Officer, please. Look to your right, Greg. Oh my god. Oh",
            "start": 2352.56
        },
        {
            "text": "if he's just watching you. The best is going to be when I Oh god, there was a person in that car. Can I get help? Sir. Sir, I need your help. Officer, please. Look to your right, Greg. Oh my god. Oh my god. Shh. He doesn't see us yet. He doesn't see me. And I think I saw the person over there, too. All right. I want to look at my map, but I don't want to stop. Stay in the bush. Just hide in this [ __ ] bush. But remember, I had a guy trying to kill me. I'm going to try to get I'm going to try to get this house. I'm trying to get to this house. Oh my god. You're crazy. Oh my god. This is surprising. We haven't seen gas anywhere. I saw it over there. Oh, okay. More is coming in 30 seconds. Are we [ __ ] Uh-oh. Stop moving. Oh my god. Oh my god. Pro G. Oh Jesus, he sees you. It's time to make a move, guys. I'm sorry. If I can get to the house, you're going to get hit by a car. If I can get to the house, he can hit me with a car. Get in the car. These aren't real cars. Oh my god. He's",
            "start": 2398.24
        },
        {
            "text": "make a move, guys. I'm sorry. If I can get to the house, you're going to get hit by a car. If I can get to the house, he can hit me with a car. Get in the car. These aren't real cars. Oh my god. He's coming. He's coming. The door, dude. I saw him running at you. Oh, it's a molotov. Grab it. Just chuck it. You got to get outside and chuck it. I'm aware. I'm not trying to chuck it. Where is he? Oh god. He decided the strategy was too much and ran away. Smart man. You can hear him though. Oh [ __ ] There he is. Oh my god. He's out the cop door. He doesn't know that I have the molotov. He's going to shoot you. Dance. He died like I threw it though. I might have gotten like a man. You did throw it. You mean tonight? You got him. You got him. Yes. Good job, Greg. Left health left. Wait, how do you know that I got him? Oh, did it pop up saying I got him? Oh, you're saying, well, but you're number nine. Killed zero. Okay, you didn't get him. Okay, but maybe it was a post humorous award.",
            "start": 2455.84
        },
        {
            "text": "do you know that I got him? Oh, did it pop up saying I got him? Oh, you're saying, well, but you're number nine. Killed zero. Okay, you didn't get him. Okay, but maybe it was a post humorous award. Maybe. I doubt it. God, H1Z1, I ladies and gentlemen, that was intense. I like that a lot. You mean dying. I'm pretty proud of you. We're going to need you at the RTX Showdown. Make sure you have until June 27th to tweet H1Z1 KOTK using the hashtag H1Z1 funny to be one of the 10 people to play online with us at RTX. When? Sunday, July 3rd at 3 p.m. Central time. And if you're at RTX, go to the H1Z1 booth, talk to them, talk to them about us, mention Greg Miller. Hi, it's me, Greg. Say that you want to help him. He needed it. I mean, well, yeah, but I did pretty well. You did pretty well. You did pretty well. Until next time, I love you.",
            "start": 2518.16
        }
    ]
}