{
    "id": 1486,
    "video_id": "TMQpSCIgqk0",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Kevin Coello"
    ],
    "title": "Ghostbusters LEGO Dimensions Level Pack - Kinda Funny Plays",
    "description": "LEGO Dimensions has a brand new Ghostbusters Level Pack! Let's watch Greg and Kevin play it along with Wave 3's Doc Brown minifigure and Wave 4's Superman minifig!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation",
    "published_at": 1453179600,
    "duration": 5474,
    "transcript_chunks": [
        {
            "text": "What's up everybody? I'm Greg Miller and this is my partner in paranormal investigations and eliminations, Kevin Coelho. Kevin! Hey, what's up? How you doing? Pretty good, pretty good. Nothing. Hey, how are you? Yeah, pretty good. I'm having quite the day because we're about to play with the Ghostbusters Lego Dimensions level pack. I've been waiting quite some time for this, Kevin. I don't know if you know this, I'm a Ghostbuster fan. I have heard that, yeah. Big Ghostbuster fan. Yeah. You're wearing my spare suit right now. Yeah. This is the one you have for when you have people over and they need to wear a suit. Clearly I'm not going to go around making my own for people. I'm not going to have a Coelho. You have to earn that. Did you make that yourself? I bought the jumpsuit, then ordered the patches from a Hollywood patch company. This is back in the day. This is like 2002 I did this. And then mom sewed them on. Nice. You know what I mean? Just like she did when I was a little baby",
            "start": 0.0
        },
        {
            "text": "the patches from a Hollywood patch company. This is back in the day. This is like 2002 I did this. And then mom sewed them on. Nice. You know what I mean? Just like she did when I was a little baby and then I never grew up. And here I am now playing with Ghostbusters toys as a 32 year old man about to play Lego Dimensions. Who has the platinum in Lego Dimensions. This is an exciting Let's Play. Because we finally get to play Ghostbusters. I haven't played the Ghostbusters level pack. I liked what was in Lego Dimensions for the Ghostbusters level. Because I'm not sure if you're familiar with this. It's Lego Dimensions. All the universes are mashed up. Yeah, I think you told me about it. So I played through a mashed up Ghostbusters level. A lot of Ghostbusters stuff. It's there, but you couldn't play as the Ghostbusters. And now we have a brand new level pack. Usually level packs go in between 30 and 45 minutes. We'll see what happens today. However, this is from Wave 3. Ghostbusters is",
            "start": 33.28
        },
        {
            "text": "play as the Ghostbusters. And now we have a brand new level pack. Usually level packs go in between 30 and 45 minutes. We'll see what happens today. However, this is from Wave 3. Ghostbusters is part of Wave 3. It's the level pack for Wave 3. However, we have the rest of Wave 3. So bring up the other boxes here and show what we got. So we also got this guy. This is from Ninjago. Sensei Wu and his flying white dragon. We also have one of my favorites. Doc Brown. His traveling time train, of course. Run on steam. His traveling time train, of course. Run on steam. Him and the kids. The one kid points at his wiener. Go look at it. Over here. Doctor Who. Cyberman in a Dalek. What? Dalek? Dalek. Yeah. Dalek. Exterminate. Exterminate. You're nailing it too. I know what the character does because of Lego Dimensions. I had never watched a Doctor Who episode. But I played through Lego Dimensions. You've seen one since then. I played through Lego Dimensions. Saw the Doctor Who mashup. I was",
            "start": 64.92
        },
        {
            "text": "of Lego Dimensions. I had never watched a Doctor Who episode. But I played through Lego Dimensions. You've seen one since then. I played through Lego Dimensions. Saw the Doctor Who mashup. I was like, this guy's interesting. Watched an episode. Bought the level pack. And now I've got my own Dalek. Is that right? Yeah. Is that all right? Ah! A team pack! Harley and Joker. Not too shabby. That's exciting. Harley and her hammer. Of course. It's huge. What's not to like? This is all Wave 3. If you're not familiar with Lego Dimensions, they put out Lego Dimensions. Then there was Wave 2 in November. And that was the Doctor Who stuff and a couple other things. Now it's Wave 3. Wave 4 is coming. And it's very important because it'll have Superman. And I have, when I won my game award for Trending Gamer of the Year, a friend of mine from TT Games, John, came over and handed me the first ever, I think in the wild, Superman. So we'll use him today. So you're getting a Ghostbuster Let's Play. So",
            "start": 105.56
        },
        {
            "text": "Gamer of the Year, a friend of mine from TT Games, John, came over and handed me the first ever, I think in the wild, Superman. So we'll use him today. So you're getting a Ghostbuster Let's Play. So you see that whole level pack. And a little playthrough of Superman. Are we allowed to do that? Yeah. John said we could. I don't think PR knows. I don't have to worry too much. So we'll put Superman right on there. You see there. Boom. I went with the red eyes. You can play with him if you want. I haven't built his hover pod yet because I don't have that. But you can just say, okay. And you can just go, duh duh duh duh duh. That's the spoilers. I think I could hit back to him. Well, no, I know. Now, I've never done one of these. I've seen you play with them. You've never done a Let's Play either. Oh, that's true. It's my first Let's Play. What a good one to jump into. In costumes, no less. Do they come with instructions? No. Oh, so it's just on-screen instructions. I believe... Maybe I'm",
            "start": 146.84
        },
        {
            "text": "Oh, that's true. It's my first Let's Play. What a good one to jump into. In costumes, no less. Do they come with instructions? No. Oh, so it's just on-screen instructions. I believe... Maybe I'm wrong. I don't think they have instructions in there. Does it? Hold on. I think it has Venkman in the front. Oh, wait. Yeah, it does. Okay, don't look at them. That's cheating. That's not how we're going to play this game. Oh, wait. See, it is just Venkman. There's no Ecto-1 instructions. So if you didn't know, you buy Lego Dimensions. And what's most exciting about Lego Dimensions is that you get Lego pieces. And for the first time in forever, you get to build Lego characters. Now, you threw it on the floor. Which I respect. I might need... Because I think it's going to show me how to build the Proton Pack. It does. Proton Pack. Kevin, go to the GoPro. See, I'm dumping all this stuff over there. I'm not cutting to the GoPro. It's just going to be there. Cut to the GoPro, Kevin. You're going",
            "start": 191.48
        },
        {
            "text": "Proton Pack. It does. Proton Pack. Kevin, go to the GoPro. See, I'm dumping all this stuff over there. I'm not cutting to the GoPro. It's just going to be there. Cut to the GoPro, Kevin. You're going to want to blow up some of the GoPro stuff, aren't you? Yeah, probably not. I will, then. I'll edit this one. I'll do it, because I want to show some of the cool stuff you've got in here. Of course, my dream is coming true with my Ghostbuster stuff over here. Oh, my God. It's so meaty. There's so much to do. Just point it all out. Now, that's what you've got to do. I like the base. Show me the car box. There it is. No, no, no. I'm looking at what I'm doing on your camera. I'm using your screen to see that I'm showing the base here to this cam. Got it. Oh, my phone. You've got Pete's body here. I like that. Look at that. On the back it says Peter, but that'll be covered by a Proton Pack. There you go. So, obviously the basics of building a guy are pretty simple. So, there you go. I've got",
            "start": 232.76
        },
        {
            "text": "I like that. Look at that. On the back it says Peter, but that'll be covered by a Proton Pack. There you go. So, obviously the basics of building a guy are pretty simple. So, there you go. I've got a body. Hooray. Give me the head. You get two versions of the head every time, right? So, you've got that Venkman. You've got a side of the Venkman. Venkman's usually a pretty cool customer, so I'm not going to do too much there. Do that. Throw on that Bill Murray hairdo. We've got that going. Hooray for Pete Venkman. I'm going to put him on his thing. I'm jumping ahead. I shouldn't do that yet until I get his Proton Pack on. But you'll forgive me, ladies and gentlemen. I've been waiting for this my entire life. So, Pete Venkman's assembled. I'm going to put him on my Proton Pack. You give me instructions if I start getting out of whack there, Kev. Alright? Alright, thank you. I'm going to push all this stuff around here. I'm looking for these little guys with the things. So, Kevin, do you",
            "start": 277.4
        },
        {
            "text": "if I start getting out of whack there, Kev. Alright? Alright, thank you. I'm going to push all this stuff around here. I'm looking for these little guys with the things. So, Kevin, do you still play with Legos? Just as they are. When I get something that I can build, yeah. I build it and I look at it and I have the tumbler. You do have the tumbler. A gift from us. Yeah. And I sit there and I look at how beautiful it is and sometimes I roll it. Yeah, back and forth. And that's it. Well, that's all you need to do. Nick knocked it down once at my house. Was he doing it on purpose? No, it was one of those things where he was just like, Oh, I'm going to touch everything for no reason. And then he knocked it down. That sounds like something Nick would do on it. Oh, see, what we didn't think is this, you're going out of the frame. Spoiler alert, everybody. We're full-sized people. And even when I do this, I'm still here. Also, we don't have a full-size green screen. No, we work out of a",
            "start": 318.68
        },
        {
            "text": "is this, you're going out of the frame. Spoiler alert, everybody. We're full-sized people. And even when I do this, I'm still here. Also, we don't have a full-size green screen. No, we work out of a spare bedroom. Support us on Patreon.com slash Kinda Funny Games. We're trying to get Kevin a mic. Then maybe the next thing will be a giant green screen. But right now, we're building a proton pack. Alright? Good enough, Kevin? Sure. They'll accept it. They'll allow it. So this is the one part, I'll tell you what, that I find to be the most charming thing about Lego Dimensions. Because I didn't expect it, Kev. When I first started hearing about the game, I wasn't expecting how much fun it would be to build stuff. Because for a long time, Kevin, I buy Legos. I got the Lego Octo 1. I got the Lego Octo 1 right up there. Yeah, you don't build them. I got no room in the house. I live in San Francisco. There's nowhere for anything to go. I keep offering to build them for you. But that's not the",
            "start": 361.32
        },
        {
            "text": "Octo 1 right up there. Yeah, you don't build them. I got no room in the house. I live in San Francisco. There's nowhere for anything to go. I keep offering to build them for you. But that's not the thing. I want to build it. It's just where am I going to store it, Kev? You understand what I'm saying? Where am I going to store it? It doesn't matter anywhere. You figure that out after it's built. I guess that's one way to look at it. I've been looking for this little guy too long. Got him though, Kev. Don't worry about it. So at IGN, we did a couple Lego unboxings. You guys needed someone to build them for you. Yeah, you went home and did them. No, I stayed in the office and did them. I thought you went home and saw your family and stuff. You just sat there and built stuff. Same schedule I have here. Here's what we'll do. Because you're talking about how I'm cutting out a frame, right? Well, no, you commit to it now. Well, no, now we'll put the finished products over there. And then you",
            "start": 402.6
        },
        {
            "text": "here. Here's what we'll do. Because you're talking about how I'm cutting out a frame, right? Well, no, you commit to it now. Well, no, now we'll put the finished products over there. And then you and I can work over here. You know what I mean? Then you can be part of the action too. You don't have to sit there and be sad. I'm not sad. I was telling you anecdotal stories. You're killing it for your first Let's Play. So we have this part, Kev. I built that already. Done. Now we're on to part three here. For part three, we need this guy. Look at this one. Now how much do you love Ghostbusters? I like them all. I didn't say it was Prime Time Ready. Yeah, yeah. Nowhere near as much as you like them. But I don't think anyone likes them. Thank you. That means a lot to me. I'm a big Ghostbusters fan. I've been on the internet for a long time. It means a lot to me. So when I was working at IGN, I used to build the Legos. Fran would come by and he'd be like, why don't you separate the pieces",
            "start": 441.24
        },
        {
            "text": "fan. I've been on the internet for a long time. It means a lot to me. So when I was working at IGN, I used to build the Legos. Fran would come by and he'd be like, why don't you separate the pieces first? And I'd be like, no, Fran. You don't tell me how to have fun with my Legos. I was like, you're working. You have to be efficient. And you're like, don't worry, I don't have to be efficient. I'll do whatever the hell I want. I used to time myself. We only did three of them? Yeah, I guess. I don't know. Forty minutes was the longest. I count this one. And then he goes here. And then you take this one and he goes here. Then you take it and you put it over here. So when you were watching the trailer for these, you weren't one over, right? As the trailer was going, you were like, if they have Ghostbusters. The announcement trailer was very odd, I remember. It didn't explain what the gameplay was going to be. People were immediately like, are you going to get it, Greg? And I'm like, maybe.",
            "start": 485.88
        },
        {
            "text": "Ghostbusters. The announcement trailer was very odd, I remember. It didn't explain what the gameplay was going to be. People were immediately like, are you going to get it, Greg? And I'm like, maybe. I'm like, no, I don't know. I'm not a Toys to Life kind of guy. What they need to do to sell me is put Ghostbusters and Superman in it. And then everybody in the chat on Twitch said they teased that at the end of the thing. At the end of the trailer. I forget what happened. I forget if we were talking about it or if we cut it off too early on Call of the Greg Live. It's not the most professional production, as you know. You might have caught up on that. It's gotten a lot better since then, though. Since you took over, it's been really well, probably. Bring it over here. We've got a little Proton Pack forming for Pete. It's going to be dope when it's done. Yeah, it's gotten better in recent weeks over on Twitch.tv slash Kind of Funny Games. Because of you. That's true. That is a fact. Then",
            "start": 539.16
        },
        {
            "text": "Pack forming for Pete. It's going to be dope when it's done. Yeah, it's gotten better in recent weeks over on Twitch.tv slash Kind of Funny Games. Because of you. That's true. That is a fact. Then rotate it over. See, I like how they do that. They show little emotions. It's what you've got to do. They know what they're doing here with LEGO. You know what I mean? Yeah, absolutely. Well, like I was saying, this gave me an excuse to start building LEGOs again and have a place for them, right? Bring up the tool kit. This is very impressive. When I saw you... I'm not a fan of LEGO Dimensions toys. Just so you don't think this is some kind of act or that I'm not really a fake LEGO Dimensions player. No, son. I'm all in on LEGO Dimensions. You don't even know. Now, what are you going to do when you have seven more? Buy another one. Just buy another toolbox like that and it just keeps going. That's a good solution. It's funny because I went to my father's house. Now, my father, a real man.",
            "start": 574.44
        },
        {
            "text": "you have seven more? Buy another one. Just buy another toolbox like that and it just keeps going. That's a good solution. It's funny because I went to my father's house. Now, my father, a real man. You know what I mean? Heavy equipment operator. He's seen some stuff in his years. And I went to his house back in Chicago. Stacked one on top of each other with tools in them. Screws and stuff. And I laughed and I took a photo and he said, why are you taking a photo of that? And I'm like, well, it's just funny, Dad, because it shows the kind of person you are versus the kind of person I am. And he kind of stared at me. Had a deep sigh and left. I've never seen him again! Now I need a red one. Now, do I need a red one? Now, you tell me. That's a dark red one. Let's skip ahead and see if we can see him. We're almost done already. Oh, also, the box. We can look at the box. Solid color. Nice. Good call, Kev. I'm glad you're here for this Let's Play. Anytime. That's the worst. When you're an",
            "start": 613.08
        },
        {
            "text": "see him. We're almost done already. Oh, also, the box. We can look at the box. Solid color. Nice. Good call, Kev. I'm glad you're here for this Let's Play. Anytime. That's the worst. When you're an hour in and you realize, oh, I used the wrong color brick for that one part. Yeah, I hear that. I do hear that. I do a clean break. This didn't come with the tool? No, but see, here's the thing about not having the tool. The Lego Dimensions kit comes with the tool, the separator. And it's trapped behind this green thing. So I hope we don't need it because that would be troublesome for us. It's fine. I've got to get my nails in there. No, that'll hurt your nails. It's fine. It's worth it. Show me the box. Right now, I don't like how... That proton, his Neutrona wand is way too high. But see, he's holding it. Oh, it's backwards. It goes on him this way, right? Because this is his headrest. Don't worry about it. Let's figure this out first. I mean... No. Okay. Ahh. Bum bum bum bum bum bum bum.",
            "start": 655.72
        },
        {
            "text": "holding it. Oh, it's backwards. It goes on him this way, right? Because this is his headrest. Don't worry about it. Let's figure this out first. I mean... No. Okay. Ahh. Bum bum bum bum bum bum bum. It's like that. Now we're cooking with gas. Yep. Never cook with gas. What if you have a gas stove? Oh, I meant gasoline. You can cook with gas. That's fine. Just learning. Just learning. Again, I'm new to the Lego games. What are you missing? I just didn't understand how this was going to secure his back. It goes into his neck. Because I do feel like this was left off. This little shelf unit left off. But it's no big deal. The problem is, if you look at the first page... Ahh, I didn't look at the first page when I built them. User Air. Not on me. I'm sorry. Not on you, Lego company or TT Games. On fat Greg Miller. Alright, so there you go. Popped him on. We got a Pete Venkman. Ready to rock and roll. Look at him. Look at his little elbow patches. He's like me. He's got elbow pads. I like",
            "start": 705.0
        },
        {
            "text": "On fat Greg Miller. Alright, so there you go. Popped him on. We got a Pete Venkman. Ready to rock and roll. Look at him. Look at his little elbow patches. He's like me. He's got elbow pads. I like what I'm seeing. He's all built. Do that. Here comes Pete Venkman. There he is. Now, of course, Kev, you might not know this. Got it. Do we want to travel to it? Now, we want to play the Ghostbusters level. The way the Ghostbusters level works is that it's not like Back to the Future where they had Michael J. Fox and Christopher Lloyd come in and record new lines. It's pulling lines from the movie. So here we go. The Ghostbusters level for the first time. When we get there, you hit X. You'll pop in as Superman. Don't hit anything. I don't want to skip these cut scenes. I've waited a long time for these cut scenes. Since they announced this game, then I had to play through a whole bunch of stuff. Do you smell something? See, this all happened in the movie. So what do we do? Okay, I have a",
            "start": 764.28
        },
        {
            "text": "for these cut scenes. Since they announced this game, then I had to play through a whole bunch of stuff. Do you smell something? See, this all happened in the movie. So what do we do? Okay, I have a plan. I know exactly what to do. Get her! He's kidding me with the cuteness of this. Did you see it? We'll get back to you. See, they're lego-izing it, Kevin. Use your hand to be real. I'm playing as Vancouver. Of course. Thank you. I'm going to play as Superman. If you want, you can open up the toolkit. You can build other characters. Chances are we're going to need some other characters. Wait, do you have Doc Brown? You haven't opened him yet. Look at him! But there's going to be things we'll need other people for. Okay. Don't worry about it. Now, I really like this design. We were talking about it earlier with the split screen. Oh, right. They revolutionized it. You figure for the longest time with the old Star Wars games, they didn't happen. You run into stuff and you run into each",
            "start": 821.56
        },
        {
            "text": "about it earlier with the split screen. Oh, right. They revolutionized it. You figure for the longest time with the old Star Wars games, they didn't happen. You run into stuff and you run into each other. You're like, this isn't fun. But then they're like, you know what? TT Games are going to fix it. They were Traveler's Tales back then. I fly. That makes so much sense. I also like that my proton pack is Makeman. It operates like Superman's heat vision. Do you hear that? Do you hear the music when I fly? Go! This is amazing. You're missing a hell of a game with Lego Dimensions if you aren't already playing it. Look at him! Break out the Wonder Woman. She has the Wonder Woman theme song too. I didn't watch that. I'm not Nick. How long did it show? Everyone saw the Linda Carter ad. Yes, you did. Don't do this to me, Kevin. Oh, I love this. Oh, this is amazing. Just do it. If you hold down Square, you have heat vision. You can just blast everything you want. Oh. I played very few. I did",
            "start": 918.92
        },
        {
            "text": "did. Don't do this to me, Kevin. Oh, I love this. Oh, this is amazing. Just do it. If you hold down Square, you have heat vision. You can just blast everything you want. Oh. I played very few. I did that. I blasted the guys. Shouldn't have done that to them. Oh, there you go. There's your back. His head's still there. What I enjoy about the Lego games, and what I enjoy about Lego Dimensions in particular, is the HUDs. The HUDs don't look too crazy here, but you see Venkman over there in his little circle, as if a line should come through and cross him out. Superman in the comic-y font thing. But if you were to build Doc Brown and put him in there, he'd have a little Back to the Future thing around him. All of our hearts all look different. Mine are slime, like Ghostbusters 2. They care. They care too damn much. While you're up there, melt that with your heat vision. Thank you. Is it gold? Can you hit a circle on that? Good job. Oh, you can jump over there. Just jump to it. You could",
            "start": 966.92
        },
        {
            "text": "They care too damn much. While you're up there, melt that with your heat vision. Thank you. Is it gold? Can you hit a circle on that? Good job. Oh, you can jump over there. Just jump to it. You could just fly, but I think this might be one of those things that they want us to jump to. Yo, bro, jump to it. Oh, man. The slow crawl down. When he lands? Yeah. He's awesome. I'm showing the Ghostbusters level pack. You're showing Wave 4 Superman, which no one has seen because I haven't done a lot to play with it since the VGs. So calm down. This doesn't feel like I'm allowed to do this. You're allowed to, again. Thank you, Superman. If you want to talk about Greg Miller's dream, the Ghostbusters playing with Superman. Come up here and get the blue for me. You and I can come out of this with three trophies today. So that's what you got. Good job. Now I see what we're doing. We're building it for all of Egon and Ray here to jump in. Get there, Superthumb. Get out of my way. No suit for",
            "start": 1018.92
        },
        {
            "text": "three trophies today. So that's what you got. Good job. Now I see what we're doing. We're building it for all of Egon and Ray here to jump in. Get there, Superthumb. Get out of my way. No suit for Kal-El. For Kal-El? He'll get his one. Don't worry about that. He doesn't need no suit. Travis Willingham, friend of the show, doing the voice thing, by the way, of Superman. I like him a lot. So when do you do Superboy for... That's a great question, TT Games. When do you put Superboy in this game and let me, Greg Miller, do it? Of course, I'm Aldrich Killian in Lego Marvel Avengers. That's almost as good. No, I'm saying that. And then I'm Superboy in DC Universe Online. So yeah, next time there's a Superboy character, fire Scott Porter. Nobody's ever heard of him. So Kevin, I don't know how yet. We've got to break this box. There you go. Figure it out. Walk over there and hold circle on all that and build a circle. There you go. Oh, there you go. There you go. Break this box. There we go.",
            "start": 1074.92
        },
        {
            "text": "We've got to break this box. There you go. Figure it out. Walk over there and hold circle on all that and build a circle. There you go. Oh, there you go. There you go. Break this box. There we go. We're going to have to build the extra one in a second, aren't we? There it is. Now, do we have to build it in real life as well? Well, you don't have to, but we're going to. If you guys wanted a Let's Play where we didn't build the toys... Hit X and let me know if you can control. Perfect. We have all this stuff here. We're going to build it. You can keep going and I'll go. Don't move on. I will. Are you having fun so far? Do you understand why I'm obsessed with this game? Yeah, I know. This was fun. When he started flying. I'm not saying the kind of funny guys made fun of me. A lot of questionable stares when I was so obsessed with Lego Dimensions. No, I mean everyone will always make fun of you. Sure, well I'm Greg Miller. I can take it. I can take it. My toy box. But I guarantee you, the",
            "start": 1130.92
        },
        {
            "text": "stares when I was so obsessed with Lego Dimensions. No, I mean everyone will always make fun of you. Sure, well I'm Greg Miller. I can take it. I can take it. My toy box. But I guarantee you, the right toy comes out and Nick plays it. He's going to be lost in it. He's a coward. You know that about him? Yeah. Cowardly lie in that one. So here, I do this. Give me the next one. If you're at home, this is what I've done. I've gone like that. You didn't really do anything. I'm aware, Kev. Thank you for pointing that out for everybody at home. Just remember who's got the real Ghostbuster suit. I've got your back up. You do. Scott Lowe wore that once. You know what he does now? Works for Activision. So you can get a better job any day now that you've got that. Somebody with your skills. Nothing would be better than this place. Food services guy. Did you say someone with my skills could easily get food services? I was tweeting Ghostbusters. The housekeeping. I've quit better jobs than this.",
            "start": 1185.92
        },
        {
            "text": "would be better than this place. Food services guy. Did you say someone with my skills could easily get food services? I was tweeting Ghostbusters. The housekeeping. I've quit better jobs than this. Ghostbusters, what do you want? I didn't say go. I'm keeping you on your toes. Oh my god, now it's a speed test? I don't want to screw it up. Is it facing the right way? It's coming together. I can see it. You see what's happening, ladies and gentlemen. I'll tell you what, man. Don't get me wrong. I liked Legos as a kid. Tim and I talk about this and you get involved a lot. And the fact that in your generation, Lego really stepped it up. And they added in a whole bunch of awesome stuff. Because in my day, it was, I had to go buy my Ghostbusters toys. Real Ghostbusters toys. And then you could make believe that they were in the Lego world. But they weren't and they didn't look the same. If I was able to make Ecto-1s, like I came up there, the new firehouse is out. And they're so good. It's",
            "start": 1230.92
        },
        {
            "text": "make believe that they were in the Lego world. But they weren't and they didn't look the same. If I was able to make Ecto-1s, like I came up there, the new firehouse is out. And they're so good. It's out already? Yeah, you can buy it now. And Lego hasn't sent it to us? I talked myself out of buying it. I'm weak and I could go back and forth on it, but I talked myself out of buying it. You should buy it. We're not going to live in a shoebox in San Francisco and I'll assemble it then. I have a giant mansion in...Chicago? I really don't want to go to Chicago. Oh, okay. Well, you've said that. No, I haven't. Columbia. Oh, Columbia. That's right. What's wrong with Chicago? It's cold as hell, man. Fair enough. You got me there. You got me there. We wouldn't be able to go there. Yeah, you never visit. I mean, that's my goal. Paul wants me to go to L.A. So I've got to deal with that someday. So that's going to be fun. Now, I'm not seeing any studs that are just basic gray. So I'm assuming",
            "start": 1276.92
        },
        {
            "text": "visit. I mean, that's my goal. Paul wants me to go to L.A. So I've got to deal with that someday. So that's going to be fun. Now, I'm not seeing any studs that are just basic gray. So I'm assuming these shiny grays are the ones. Yeah, there's definitely something going on, I think, with it. Also, let me see the box. You're smart that you keep thinking of the box. Shiny. You're meant to have kids one day because you'll build their toys. I'm your kid today. All right, next one. Oh, yeah. Do they come with the graphics already on them? Yeah, of course. Remember how much my parents hated that? I'd freak out that they didn't do the Ghostbuster symbol ride or Superman's ass. Mom would just fucking scream at me. No, she was actually really good. She put up all my shit. That was one of my favorite things. Getting it perfectly centered and being like, yeah. But then the chance when you screwed it up and then you tried to pull it off and redo it. You don't fully commit. You go in at an angle",
            "start": 1326.92
        },
        {
            "text": "things. Getting it perfectly centered and being like, yeah. But then the chance when you screwed it up and then you tried to pull it off and redo it. You don't fully commit. You go in at an angle and just start laying it down. And then you're like, wait, that's not it. Redo it. But you can only get three or four redos. You gotta start committing. The glue starts going. You gotta pull out that crazy glue. I'm ready. Oh my goodness. This is good looking. The horn. I don't know what else to call the little gray guy in there. It kinda looks like a horn. It's gonna be the backlight. You're smart, Kevin. You can do so much better than Kinda Funny. Never. Show them what I'm doing. They can still see there. Yeah, but I mean it's not. I got these big ol' meat hooks they call them. That's what the kids call them. That's what they call them, alright. Kids, when you're at home today, call them meat hooks. You done? No. I'll tell you when I'm done. What else you got? I had to do that. I had to put",
            "start": 1372.92
        },
        {
            "text": "call them. That's what they call them, alright. Kids, when you're at home today, call them meat hooks. You done? No. I'll tell you when I'm done. What else you got? I had to do that. I had to put that piece on there. Now I think I was supposed to put it on the car, but you flipped too soon. I'm not sure what I have to do with it. Did I flip? You did flip it on me. Oh, it's the other side. I was like, this looks the same. What the hell? The horn of the world that will never end. We'll look for the horn again. I know it's not the horn. Just saying. You know what I'm saying? Turn it like this, Greg. Make it look like this. No. I screwed that up. No. Yeah, that's wrong. Yeah. Look at number one. You're right, you're right. I'm wrong. I'm sorry. It's okay. I'm not mad. You're being helpful. Dump the gun there. I should have inspected it. I tell you what, Colin Moriarty wouldn't be sitting here in a spare Ghostbuster suit playing Lego with me. You're earning yourself points so that when I",
            "start": 1434.92
        },
        {
            "text": "the gun there. I should have inspected it. I tell you what, Colin Moriarty wouldn't be sitting here in a spare Ghostbuster suit playing Lego with me. You're earning yourself points so that when I quit this dump, I'll take you with me. Two months. That's all I have to wait, right? Ha ha. Alright. Oh. Okay. Alright. You like that help? Yeah. Perfect. You're doing it. Okay. Classic soundtrack for Ghostbusters 2. Something it doesn't get enough credit for. You know what I mean? Uh huh. This music is as good as it's ever been. Alright. Oh, we're getting there, Kev. Yep. We're getting there, Kev. Beauty's starting to take shape. What's wrong? No, I just enjoy watching the build come together. There it is. Okay. That's a solid. That's a gray. Where does the rail go? Is that in front? Oh, it goes in front. Ah, ah. Yep, yep. There it is. Wait, no. That's a white. On top? That's what I asked you. Oh, I'm sorry. Then we both got caught up in the rail. So I'm with you. It's okay. Oh no. Yup.",
            "start": 1484.92
        },
        {
            "text": "goes in front. Ah, ah. Yep, yep. There it is. Wait, no. That's a white. On top? That's what I asked you. Oh, I'm sorry. Then we both got caught up in the rail. So I'm with you. It's okay. Oh no. Yup. Except for the rail. Oh, I'm sorry. Oh, I'm sorry. That's okay. Oh no. Yep. The separator's buried back there too. Yep. It's gone. No? Let me use my nails. Don't hurt yourself. That's why I have to bleed for the Ecto-1. No, we're doing this. We're doing this. I keep looking at the other screen to see the camera, but it's actually on my phone. Good use of the GoPro. It was very smart. Thank you. Yeah. I figured we spent money on it. Might as well use it. Yeah? Pipe something. We're paying for this stuff. Well, it's there. It's done. It's done everybody. Alright, excellent. We saved it. Good catch Kev. That would have been painful to get there and be like, oh no. No. This guy. Yeah, one with the little rail. There you go. Okay. Excellent. Next. Flip him over. Hmm. Only two wheels on this",
            "start": 1559.92
        },
        {
            "text": "catch Kev. That would have been painful to get there and be like, oh no. No. This guy. Yeah, one with the little rail. There you go. Okay. Excellent. Next. Flip him over. Hmm. Only two wheels on this bitch, huh? I'll do the other one. That's all I needed. Back in its day. It's all the Ecto-1 needed. I'm not a fan of these wheels. Why not? I don't know. I'm sliding them in. They're simple. That's not working for me. I'm already on. Yeah, you do it. I can't do it. Find that other thing I need. Boom. Right there. Got it? I think so. That's a weird thing. Why is he there? Why is who there? Why is that there? It's for it to slide. Oh. Can you see that? No. Really? No, I mean, yeah. Look. Oh, that was perfect. Yeah. I guess that's what the thing on the bottom does. It automatically makes it turn. Yeah, that's... It's drifting. It's drifting. It's drifting. It's drifting. It's drifting. It's drifting. It's drifting like Fast and Furious. Those people. I wonder who builds... What do you mean",
            "start": 1616.92
        },
        {
            "text": "Yeah, that's... It's drifting. It's drifting. It's drifting. It's drifting. It's drifting. It's drifting. It's drifting like Fast and Furious. Those people. I wonder who builds... What do you mean those people? Who builds these? I was going to say the people at Lego really know what's going on. I believe it's Stephen Sharples. He's the only one at TT Games. He just builds them all. I don't think he does anything like this. Really? No. He has a real job. He makes the levels and stuff. But he's very happy that he just got called in. Because he's only known really his name, Sharples. Because at New York Comic Con one year, I said... Here's the thing for you. Is that if you ever host a panel, something's going to go wrong. You know what I mean? And I feel like as a moderator, you first off know that. Embrace it. You'll be fine. As we embrace everything that goes wrong with us every day here. So I told people at the beginning of the panel that stuff's going to go wrong in this panel. And",
            "start": 1686.92
        },
        {
            "text": "that. Embrace it. You'll be fine. As we embrace everything that goes wrong with us every day here. So I told people at the beginning of the panel that stuff's going to go wrong in this panel. And anything that goes wrong is that it's Sharples' fault. And when it happens, we often say, gosh darn it, Sharples. Because I can't say damn it. It might have been God. Dang it, Sharples. No, I think I kept God out of it because I knew people would have a problem with that. And so then everybody did that at New York Comic Con. And then people still do it to him on Twitter. So there you go. You're just a monster everywhere, aren't you? Yeah, oh yeah. But people, I'm a lovable monster. Yeah, no, it's real funny. There you go. Switch it on. That means like, give me the next one. Oh, I'm sorry. Yeah. Oh, doctor, we're getting cool stuff now. Oh, oh, oh. God dang it, Sharples. Gosh dang it, Sharples. How do you know this one goes to... Because these are rewritable. So it doesn't matter. Those are",
            "start": 1722.92
        },
        {
            "text": "Oh, doctor, we're getting cool stuff now. Oh, oh, oh. God dang it, Sharples. Gosh dang it, Sharples. How do you know this one goes to... Because these are rewritable. So it doesn't matter. Those are all the same. You can take any of them out there and rebuild them on anything you want. Yes. Yes. The magic of RFID chips. Yep, yeah. You think you're impressed if you know big words like that, chief? RFID? I don't think it's a word. It's an acronym. Oh. I see how you want to play it. All right, I got that done. You got that done. I said I got that done. You keep building, boy. I got that done. Now, you see, hold on a second. Look, you missed the step. I screwed it up, I screwed it up, I screwed it up. Right there. I screwed it up. Damn, chief. Cheating. I can't do it. Just funny you made a big deal about getting it done. I know, and you're right. I didn't get it done. I got it wrong. Apparently did. Go next one. And then you jumped the steps. I did jump it. Well, you didn't click over.",
            "start": 1761.92
        },
        {
            "text": "big deal about getting it done. I know, and you're right. I didn't get it done. I got it wrong. Apparently did. Go next one. And then you jumped the steps. I did jump it. Well, you didn't click over. Why are you busting my balls, man? Some balls are for busting. What's your favorite thing? When they make a leg of that, I'm going to bust your balls. Will you play with it? Black piece there? Is that not right? No, it is. It looks like it. I can't tell. I know. That's why. Right there looks gray. It could be transparent. Yeah. That's beautiful. Oh, okay. There you go. And there you go. There you go. The whole thing falls apart. Nice and tight on everything. This is what I'm saying. You can make different versions of the Ecto-1. We're going to hold it up like this for so long, so you see it. Different versions of the Ecto-1? Why would I want to do that? I want it to look just like the Ecto-1. I like it so much that I might buy Ghostbuster symbols and stuff like that. That's great. Oh,",
            "start": 1806.92
        },
        {
            "text": "Different versions of the Ecto-1? Why would I want to do that? I want it to look just like the Ecto-1. I like it so much that I might buy Ghostbuster symbols and stuff like that. That's great. Oh, that's nice. I know. Yeah. I know. I know. I know. I know. I know. I'm going to buy Ghostbuster symbols this big and put them on the doors here. Because I don't care. I'm never going to rebuild this thing. You know what I mean? Yeah. All right. So say yes. Yes. Okay. There you go. Oh, I jumped again. I'm just a pro at LEGO Dimensions, so I know what it's going to have me do. I know what the next step is. And then you save all these parts for the rebuilds. Because when you flip them around, every toy in LEGO Dimensions, every vehicle or explosionary device has three different modes. Now, do you build the different modes? You could if you want to. Okay. I don't personally. It depends. Like when I had the time machine over there, the DeLorean, right? And when it was like, all right, do you want",
            "start": 1845.92
        },
        {
            "text": "the different modes? You could if you want to. Okay. I don't personally. It depends. Like when I had the time machine over there, the DeLorean, right? And when it was like, all right, do you want to put it in hover mode? I was like, hell yes, I want to put it in hover mode. It's the only mode to keep it. Yeah, exactly. And that was that thing. So then every so often, that one I switch back and forth when I'm playing. Because, you know, I'm like, yeah. Make it hover mode, don't make it hover mode. I don't care. X-Belt Blaster. Oh, and we're going to have to build the Ghost Trap too. I forgot about that. Yeah. So that's what these pieces are for. Yep. Yep. I'm playing now. You want to jump on the X-Belt Blaster? Let me pick up the studs over here before you go. I got to pick it up, pick it up, pick it up. All right. I get to go. I get to go. So then drive onto the pad there. You hit it, you go. But drive on the pad there. Yeah. And just gun it. You're doing it. This is hard. I know.",
            "start": 1888.92
        },
        {
            "text": "it up, pick it up. All right. I get to go. I get to go. So then drive onto the pad there. You hit it, you go. But drive on the pad there. Yeah. And just gun it. You're doing it. This is hard. I know. It's pushing everything. Here we go. Oh, look at these, it's a cute little one. What's happening? Oh. Because they can't all fit in the X-Belt Blaster. See, it's cute. Oh, that's... Oh, I was about to tweet that. I was about to tweet that. I can't tweet that. I'm glad you didn't. Well, I should have saved the screenshot altogether. I still screwed up. I hope we can take care of this quietly. That's wild. Yes, sir. Don't worry. We handle this kind of thing all the time. They're such... They wreck this dining room. Was it a dining room? It was a hotel. They were having a thing. If you're wondering, Slimer's Wave 5, May 10th. That's just a hint to me. We really haven't had a completely successful test of this equipment. See, they're mixing it all up here. Yeah. Oh, dear. Yeah, we've got a",
            "start": 1924.92
        },
        {
            "text": "Slimer's Wave 5, May 10th. That's just a hint to me. We really haven't had a completely successful test of this equipment. See, they're mixing it all up here. Yeah. Oh, dear. Yeah, we've got a lot of ghosts to get to here. Bum-bum, ba-ba-dum-ba-dum-ba-dum. Bum-bum, ba-ba-dum-ba-dum-ba-dum. Bum-bum, ba-ba-dum-ba-dum-ba-dum. Bum-bum, ba-ba-dum-ba-dum-ba-dum. Bum-bum, ba-ba-dum-ba-dum-ba-dum. Bum-bum. Oh, here. Wait, what, we switched? Yeah, we switched that. I don't like that one bit. How do we do this? Look how dopey I'm standing. Wait, Superman? No. Venkman? Venkman, yeah. That is a Bill Murray kind of dope to it, though. You can try it. You can beat him for one. No, no, no, you can beat him. All right, fine. I think what you have to do, you'd either have to drop out, but it'd just be easier to bring up another character. So pick somebody else you want out of the box. Oh, okay. Oh. Or if you want to build, will you build them? No, no, no, hold on a second. It's not going to take that",
            "start": 1980.92
        },
        {
            "text": "to bring up another character. So pick somebody else you want out of the box. Oh, okay. Oh. Or if you want to build, will you build them? No, no, no, hold on a second. It's not going to take that long. No, it's fine. It takes two seconds. There's plenty of people. Get Doc Brown. Show Doc Brown. It's wave three. We're doing a Let's Play. Show, we don't need the old guys. We're here to show wave three people. And Superman, who's wave four. Because you see, Doc Brown, the people are always the simplest of the builds. We just want to even open, if we can, we just want to open his time train. Because he's going to say, do you want to build the time train? We can just say, no, not right now. Or we could lie and just put the toy tag down and act like that. No, that's not how you play this game. I know, I'm just saying, I mean, if you want to build the time train while we're at it, I don't care. We can do it all at once. Why is this, look at this. It just doesn't want to tear. There it goes.",
            "start": 2026.92
        },
        {
            "text": "I know, I'm just saying, I mean, if you want to build the time train while we're at it, I don't care. We can do it all at once. Why is this, look at this. It just doesn't want to tear. There it goes. There it goes. Price is averted. Good job. Oh, look how cool that is. Let's see, hold on, let me remember. Look at it. It's got a little radiation suit. I forgot, I can't. No, it's too much glare. There you go. You got it. Nailed it. You got it, you got it. All right, so you're going to have to break open both things. Yeah. You're going to have to keep the Doc Brown, the time pieces over here. Do you want to build it? A little hole. You want me to build them both? If you want to. Do you want to? I need you to make the choices. Why? We're having fun playing Lego Dimensions. It's all about. Let's build them. You're going to build the time train too. Yeah, let's do it. Jam pack, let's play. You're getting a lot of bonus material here. You are getting a lot of bonus material here. They",
            "start": 2062.92
        },
        {
            "text": "Let's build them. You're going to build the time train too. Yeah, let's do it. Jam pack, let's play. You're getting a lot of bonus material here. You are getting a lot of bonus material here. They thought they were just coming for ghost presses. No, they're getting all up in Doc Brown's business. Biznass. I love seeing little details with this walkie talkie that he has. Yeah. His hair. Man. You give me Doc Brown, so I can get him. You already got him off the way. Which face do you want? You got something just happened crazy, or you got smiling Doc Brown? Let me get the crazy. You want crazy? Crazy, yeah. This is his face like, this is a great face for Doc Brown when the rags caught on fire in the original Back to the Future. Remember that? Yeah. That's actually probably what it's pulled from. I'm nailing it, I think. Probably the Back to the Future expert. That's all he was, right? He does that face a lot, though. This probably shows you how to build his little thing, too. Oh, yeah.",
            "start": 2105.92
        },
        {
            "text": "from. I'm nailing it, I think. Probably the Back to the Future expert. That's all he was, right? He does that face a lot, though. This probably shows you how to build his little thing, too. Oh, yeah. So you can jump to step there, sir. No, I can just do it without it. God, I love his base. Is Doc Brown in the Back to the Future lettering? Yeah. The radioactive sign is what gets me. Radioactive, radioactive. Thank you. There you go. Pretty basic. Oh, it's a remote control for the time machine. Remember how he drove the time machine? It is. That's what we got there. We got a remote control for the time machine, everybody. All right, so Doc Brown's going in. Stop. Where am I? You hit triangle. No, now you're Doc Brown. And then you can build the time train. Sure. I'll flip pieces for you to get you ready. You want to hit X? Sure. Sorry, my bad. You want to hit it again right now? Huh, tough guy? Yeah, I got it. No, you don't. Go for it. Go for it. This isn't a race, Kevin. You went too",
            "start": 2156.92
        },
        {
            "text": "get you ready. You want to hit X? Sure. Sorry, my bad. You want to hit it again right now? Huh, tough guy? Yeah, I got it. No, you don't. Go for it. Go for it. This isn't a race, Kevin. You went too fast. Go back. I'm kidding. No, it was a joke. I know, but I'm playing along with the joke. I already got the next one. Now I have to look. There's that. Thank you. No problem. Mm-hmm. Mm-hmm. Great. Thanks, man. No problem. You're putting the wheel wells on the wheel wells. Where are they? Sneaky little guys. I know, right? A lot of black pieces. I know. That's the problem here. There you go. Flip them over. You got one of them here? Yep. One of them there. This is fun. Yeah, this is great. Kind of funny. Okay, now you need the big one. There you got them. Good, good, good. All right, it's an eight piece? Yeah, it is. Okay, I'm going to get the eight piece. Yeah, it is. Where's the hangover? Ah, there you go. There it is. Okay. Whoa. Ooh, is that fire? Fire, hell yeah. That's something",
            "start": 2203.92
        },
        {
            "text": "an eight piece? Yeah, it is. Okay, I'm going to get the eight piece. Yeah, it is. Where's the hangover? Ah, there you go. There it is. Okay. Whoa. Ooh, is that fire? Fire, hell yeah. That's something special. I'm going to check in with the audience here. Hold on. I'm going to hit X, you get the next pieces. Okay. What have we got so far? Mm-hmm, mm-hmm, mm-hmm. Whoa, I didn't do it. What happened? No, I hit it. Oh, okay. Okay, so you're going to hit it. I'm going to hit it. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Oh, I didn't do it. No, I hit it. No, I didn't. No, I hit it. Oh, okay. I was like, I didn't screw it up, Kevin. I didn't mean to screw it up. No, I was jumping ahead because I figured it out. You're so good, you're so good. You're the best. All right. Nothing ever going to bring you down. I love Legos. Me too. Yeah. That tumbler, that was maybe like eight hours to go. Jesus Christ. Yeah, it was a lot of fun. Them red ones, yeah, that was those ones. You double",
            "start": 2253.92
        },
        {
            "text": "going to bring you down. I love Legos. Me too. Yeah. That tumbler, that was maybe like eight hours to go. Jesus Christ. Yeah, it was a lot of fun. Them red ones, yeah, that was those ones. You double check my work? Uh, not in a bad way. No, no, I'm saying you should. Yeah, I'm looking over. It looks like it was looking good so far. Big ass round piece. Oh, I was like, I didn't see that thing. Check in with the audience. This was not as easy to see the train. Oh, so far? I mean, I can kind of see where it's coming. But the end when we get there. Yeah, yeah, yeah. I'm sure by the end. You'll be like, this is a train that can travel through time. I got it, got it. Has anyone ever interviewed that little kid? Who pointed his craft? No. We should do that. He's a dumb kid. I know, but I want to see him. Hey, I ruined cinema. You didn't ruin it. I ruined cinema. I guarantee you, you had no idea until you saw it in that video. And now it's ruined. Back to the Future 3 is ruined for me. I",
            "start": 2299.92
        },
        {
            "text": "to see him. Hey, I ruined cinema. You didn't ruin it. I ruined cinema. I guarantee you, you had no idea until you saw it in that video. And now it's ruined. Back to the Future 3 is ruined for me. I flipped, is that okay? No, that's fine. I got it right between. Where is that? Oh, there it comes. I need two of them. I'm looking for the other one. Oh, yeah, I'm trying. You already put the one piece on there? This guy? No. No, not that guy. He goes on top of that guy, right? Wait, I put the wrong piece there. Did you? Yeah. Oh, okay. Oh. That's the one I have to get. Yeah, that's the one you need. Don't throw that one away. No. Legos. Dun dun, tika tika tika tika tika tika dun dun, tika tika tika tika tika dun dun. Mm-hmm, mm-hmm, mm-hmm. You got the gold, you got your black. I'll build the other one. So, as a kid, you said you didn't play with Legos? I played with them enough, but they weren't this cool. Legos weren't as cool as they are now. Because I need the license stuff. I was the",
            "start": 2352.16
        },
        {
            "text": "other one. So, as a kid, you said you didn't play with Legos? I played with them enough, but they weren't this cool. Legos weren't as cool as they are now. Because I need the license stuff. I was the guy, you know, who would cry and stuff when like, Superman's symbol washed away, and when Wonder Woman lost her golden lasso. And even though you could put a new, my mom drew a symbol on, like painted one. Man, the patience your parents had. Yeah, well they had a temperamental little only child. It's not a surprise they only had one kid. Yeah. They're like, we're not doing that again. But you know what I mean, I was always, everything had to be authentic. And so when I was in, when you're using your pretend, you're playing Legos and pretending, it wasn't the same. Yeah. Even when, in like junior high, high school, I'm playing with my action figures, and they wouldn't make a Wonder Woman figure, so I bought a Xena Warrior Princess figure, and custom made her into Wonder Woman, it was cool,",
            "start": 2409.64
        },
        {
            "text": "high, high school, I'm playing with my action figures, and they wouldn't make a Wonder Woman figure, so I bought a Xena Warrior Princess figure, and custom made her into Wonder Woman, it was cool, but it wasn't enough. No, sure, it wasn't the same. No. Did you put the gold thing on there? Yeah, you're all set. Because that was the thing, it's like I know you don't really belong. Yeah. Because you don't understand when I'm sitting there, and I'm playing with these toys again in junior high, in high school, my action figures. Yeah. I had to come up with storylines, and I'm using access from the comic books on why Superman's dealing with, you know, Black Cat right now, and why there's this crossover between these universes. Four. Four of those. Yeah. Yeah, I always, growing up, my mom really liked garage sales. Yeah. So I always had like a bunch of toys where it's like, I have no idea what this is from. Sure. This doesn't seem like a real thing. We'll just make the story for them. Yeah.",
            "start": 2445.68
        },
        {
            "text": "liked garage sales. Yeah. So I always had like a bunch of toys where it's like, I have no idea what this is from. Sure. This doesn't seem like a real thing. We'll just make the story for them. Yeah. I hear you, I hear you. Thundercats, you know? Yeah, Thundercats go. Alright, so there's this guy. I need two of those guys. There's this guy. There's this horn that I always talk about, and there's this dot again. It's binoculars, but okay. It could be a horn, and the Ecto-1 was a horn, pretty clearly. It's not binoculars on the train. Sure, sure. Exhaust pipe on this one. Sure. Does that look right? Yeah, that looks right. You nailed it. Okay, yeah. Yeah, it's checking the audience. Look at the time train coming together, huh? Now it looks like a train. It certainly does. We'll need a little more help in the front, though. We're here. That's what we're gonna do right now. So this guy there, and that guy there. One of these roundies. Bring me the pieces. You want this flat roundie.",
            "start": 2488.68
        },
        {
            "text": "little more help in the front, though. We're here. That's what we're gonna do right now. So this guy there, and that guy there. One of these roundies. Bring me the pieces. You want this flat roundie. There's your triangle. Yeah, everything had to be authentic. Legos were cool, but they eventually get to that point where you have to start really using your imagination. It's like, I'd rather have a Superman toy than pretend this little Lego guy is Superman. Am I checking your work? Am I checking your work? Oh, wait, no, I'm sorry. Next. Checks out, checks out. Oh, you look at that. Oh, you look at that. You got all your wheels to put on. Looks like hubcap out. Yeah, you got it. You got it. You don't care too. Hubcap out. Laces out, Dan. Ace Ventura reference. Excellent movie. I like the sequel more than the first one. That's the most preposterous thing I've ever heard in my life. You can't be serious. No, I am. Jesus. I haven't seen either of them in forever. Neither have I. Okay. So I",
            "start": 2536.76
        },
        {
            "text": "more than the first one. That's the most preposterous thing I've ever heard in my life. You can't be serious. No, I am. Jesus. I haven't seen either of them in forever. Neither have I. Okay. So I believe the last one I've seen is... No, you just put them off. Oh, yeah. I think I've seen the first one maybe twice. Yeah? It looks good. So I saw the first one twice and I saw it after seeing the second one. Yeah. And I remember being really young when I saw the first one and it freaked me out. It was weird. Why'd it freak you out? I don't know. The dolphin? No, I think there's that scene where he goes to the insane asylum. Mm-mm. Okay. And he's acting really crazy and I was like, I don't know what's happening. Sure. My mom always hated Jim Carrey, so I kind of... So you just hated Jim Carrey? Yeah. Have you apologized to Jim Carrey yet? No. You should do that. You can do it right here. He won't take it. Do it right now. No. Jim Carrey's not like that. Well, that's not an apology. I don't",
            "start": 2597.84
        },
        {
            "text": "Yeah. Have you apologized to Jim Carrey yet? No. You should do that. You can do it right here. He won't take it. Do it right now. No. Jim Carrey's not like that. Well, that's not an apology. I don't know what... Oh, you're saying no, you won't apologize is not like that. That's an interesting tactic, but okay. What is this business? Oh, it's telling me how to get the ghost number. Sorry, I just can't get it. I'm just running around. You know, like, Sandy was looking at your HUD though, what I'm talking about with your HUD. Oh, yeah. See what I mean? Oh, look at that. How cute that is? The arrow. Yeah, so anyways, I'm collecting studs right now, so I'm still focused on getting us the trophy for getting us all the things we need. Where's this guy run to? Which one? Which guy? What's happening? We're up here trying to get secret stuff. Okay, I was like, why can't I see myself? Yeah, see, I knew there'd be a big old stud up there. All right, so now what you're going to have to do here if",
            "start": 2648.88
        },
        {
            "text": "We're up here trying to get secret stuff. Okay, I was like, why can't I see myself? Yeah, see, I knew there'd be a big old stud up there. All right, so now what you're going to have to do here if you want to work on this, you got it, right? Put the colors in, then you go. I'm going to come over here and beam some ghosts. Oh, man, did I mess this up? Mess it up? I think so. Well, I didn't realize that we were that close together. Oh, yes! Oh, got the proton pack. Oh, ghost trap. That's the one. I'm not going to make you take off the suit. Okay. I'm not going to do it. Don't think that way, Greg. People can make mistakes. Feels like you lost control. Ghostbusters. Another movie that kind of scared me as a kid. Really? I watched it the first time, yeah. See, my parents, I don't know what it was. I don't know what I did or expressed. I must have expressed interest in ghosts in some kind of way. One of the reasons I love Ghostbusters so much is that, you know, Ghostbusters came out in 84.",
            "start": 2687.92
        },
        {
            "text": "was. I don't know what I did or expressed. I must have expressed interest in ghosts in some kind of way. One of the reasons I love Ghostbusters so much is that, you know, Ghostbusters came out in 84. I'm born in 83. About the time, I'm of age, I guess, when it comes to HBO. And I remember my parents keeping me awake to watch it on HBO. They're like, you're going to like this. And they're like, it's going to be scary. It's going to seem scary, but it's not scary. You know what I mean? Like, that's how they set it up. And that's not one of those stories that ends with you crying mad at them? No! Crazy, right? That's so interesting. Because I am such a crybaby kid where, yeah, I freak out at stupid books and stuff and cry. No, yeah. Well, maybe because they were beating up the ghosts. Well, not beating them, catching them. I need to, you know, what time is it? 8.40. Mom's probably still awake. What's the time difference? Two hours. 10.40, huh? I'll text her, are you awake? Does that make",
            "start": 2744.0
        },
        {
            "text": "beating them, catching them. I need to, you know, what time is it? 8.40. Mom's probably still awake. What's the time difference? Two hours. 10.40, huh? I'll text her, are you awake? Does that make you happier? Yeah, that's better. I don't want you waking them up. Well, now she's going to think something horrible has happened. Well, why don't you text a little bit more? Instead of just... Everyone alive. Are you awake? Everyone alive. All right, got that done. Short time to go. Uh-huh. Lots happening in this stage. Not that bad. Dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun dun See the dang sign sneaking up from behind. I fucked this up. How'd you... Dammit! Wait, what'd you do? Because look at it, like, I should, this little black knob should be there. It's not a hard one to fix, but it's just me screwing it up. It's not bad. It's over, man. Cancelled the last place. We already did that kind of. We're doing less of them. Oh, right. We should do",
            "start": 2789.08
        },
        {
            "text": "It's not a hard one to fix, but it's just me screwing it up. It's not bad. It's over, man. Cancelled the last place. We already did that kind of. We're doing less of them. Oh, right. We should do less plays for games we really care about now. It's working out so far. Except when you forget to edit the less plays. I didn't forget to edit it. I still remembered I needed to edit it. I just didn't do it. No, I forgot my power cord here. You know that. I know, but it's fun to give you a hard time. Uh-huh, uh-huh. When all of TT Games is watching this. All of the internet. Dan Aykroyd himself is still watching this. There's no way. He might have turned it on. Ghostbusters, huh? And he's like, oh. A 50 minute, 55, an hour and a half long video? Playing this game that I've never heard of. There you go. Speaking of which, do you need to go home? No. You didn't see your girlfriend? Nobody loves me there. Okay. Dan, you know what I forgot to do? Tell her that you're going to stay here and do",
            "start": 2853.12
        },
        {
            "text": "you go. Speaking of which, do you need to go home? No. You didn't see your girlfriend? Nobody loves me there. Okay. Dan, you know what I forgot to do? Tell her that you're going to stay here and do this? No, it's start and upload. Oh, go do it. No, I'm wired in. It's going through my pants. There's no getting out of the situation. Take off your shoes. I mean, you could easily get out. You seem to take these less plays too serious. You're right, you're right. I didn't think about that. What the hell? What's happening? Nothing, don't worry, go away. Oh, I got to stop doing let's plays and building Legos. Put this guy on wrong too. I fixed it. It was very simple. This guy, this guy was in the wrong spot. He's facing the wrong way. Everybody chillax. I always like these ones too. They look like little billy clubs. If you're in Great Britain right now, do cops still use billy clubs? Do cops still use billy clubs? TT Games, you're there. I know nothing of your culture other than you build",
            "start": 2896.2
        },
        {
            "text": "little billy clubs. If you're in Great Britain right now, do cops still use billy clubs? Do cops still use billy clubs? TT Games, you're there. I know nothing of your culture other than you build kick ass Lego games. Let me know. Thank you. In the comments below or tweet at me. Don't tweet Kevin though. Don't do it. Oh man, look at the detail on that. Camera off. Kevin, the camera stopped. Oh no, maybe not. Maybe. The GoPro on your phone said camera off, but it looks like it's got a bad connection. It's still counting. Yeah, no, it randomly disconnects. Look at it. Ah, ah. I was trying to show you now since you're here too. Look at the detail on that. Oh yeah. That's a ghost trap right there. Can I see? No, they can't see. No, I'm trying to see how many minutes it's saying. 37? Yeah. Alright, that's good. What's wrong? Oh right, that says a different time. Yeah, 37 is perfect. Okay, I'm gonna go pee real quick. You do whatever you need to, big guy. I got this from here. You want a",
            "start": 2945.2
        },
        {
            "text": "that's good. What's wrong? Oh right, that says a different time. Yeah, 37 is perfect. Okay, I'm gonna go pee real quick. You do whatever you need to, big guy. I got this from here. You want a Coke or something? I got water going. I was gonna say, do we have Coke here? I'm gonna have a beer. You want a beer? No, I'm good with the water right now, thank you. We're best friends. I don't know if you guys know this. I love that guy quite a bit. He's a good dude. What the hell? The trap? This just, this just mingles around? We'll believe him for a second. Put this together here. Push that in like that. Do business to it. Do business. The business is done. Business is done. I don't know what I'm looking at though. Next. I'm gonna go pee real quick. I'm gonna go pee real quick. I'm gonna go pee real quick. I'm gonna go pee real quick. Next. Oh, you beautiful bastards. Had me going, had me going, thinking, is this the first piece of Lego Ghostbuster stuff that isn't awesome? And then nope,",
            "start": 3013.28
        },
        {
            "text": "real quick. I'm gonna go pee real quick. Next. Oh, you beautiful bastards. Had me going, had me going, thinking, is this the first piece of Lego Ghostbuster stuff that isn't awesome? And then nope, nope, don't worry about that. It's still gonna be awesome. Slides you over there so you can see what's happening. One clear, one gray. Silver I guess. Do do do do do do. Ooh. Uh huh. So do you play with Legos at home? Person? And I don't mean Lego dimensions. Clearly here, if you watch this far in, you're a cat who likes Lego dimensions, I can respect that. What are you getting all excited about? I, I, it said do this and then put it down. I was like, that doesn't look like a ghost trap. And then there was more after putting it on the base. They're onto something. Ooh hoo. See that ace ass? Sneaking up from behind. Oh. See it's much, it's very complicated. It's making the giant swirl thing. Inside it. Yeah. Oh. Push it in a little deeper. No, not. I'm gonna need it in two seconds though. I",
            "start": 3068.28
        },
        {
            "text": "up from behind. Oh. See it's much, it's very complicated. It's making the giant swirl thing. Inside it. Yeah. Oh. Push it in a little deeper. No, not. I'm gonna need it in two seconds though. I know, but like now it's in frame. Look how pretty that looks. Well yeah. Thank you. I'm glad you finally showed up. That's what I do. That wasn't really a problem. I'm gonna take it though. Alright. I respect it. Oh, it's a little. Feel it. Handle. Huh. What's the big line? It's saying put it on there. It's just like that though. Do this. Go like. Oh. Very clever Lego people. What, I'm putting it on the containment, in the containment unit. So I have the trap. Yeah. And then I have the containment unit. Light is green, trap is clean. You know, and then the thing that you do this thing. Yeah, yeah. You beautiful bastards of the Legos. The TT games I guess, I don't know. When's the last time you watched the Ghostbuster movies? I mean I, it happens a lot. Okay. So. So it's been years? No, no, no,",
            "start": 3136.36
        },
        {
            "text": "You beautiful bastards of the Legos. The TT games I guess, I don't know. When's the last time you watched the Ghostbuster movies? I mean I, it happens a lot. Okay. So. So it's been years? No, no, no, no, no, no. It actually does happen a lot. Oh yeah, yeah, yeah, that's not a joke. Oh, okay. Yeah, yeah, yeah. I would say within the last nine months. Well I wouldn't call that a lot. I mean, I'm sorry it's not weekly. Yeah. I gotta make all this content with you. Monthly, bi-monthly maybe. I think most human beings aren't watching it every, I'm saying I've watched it in the last month, or nine months. I'm not saying nine, you know, okay. There you go. Mm. Containment unit. Can you give me the tank, the train? The tank? I'd love to give you some tank. The train. Tank's good. Tank is good. Ghost trap. Mm-hmm. And containment unit done. So now, Pete Venkman. Put these ghosts away. There he goes. Do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do,",
            "start": 3210.44
        },
        {
            "text": "trap. Mm-hmm. And containment unit done. So now, Pete Venkman. Put these ghosts away. There he goes. Do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do, do. Ooh, ooh, yeah. Give me those. There's no way to turn the camera, huh? Oh. No, no, no. Can't do that. You know what I can do, I can do it. But even if you weren't here, you wouldn't be able to do that. You know what I mean? Yeah, yeah, yeah, yeah. No, I just. Oh. Sorry. It's okay. No! Oh, dear. We gotta save him. Nah, just let him fall. No, that's not the Ghostbusters one! All right, so how do you switch people? Try. Try. Try. Right. You just tap it and it'll go to whoever's available. But you could do that. You hold it and you do it. Yeah. Easy. All right, so now I need you. Can I just jump up there and save him? No. Superman. No. That's how they keep you from breaking the game. We need a master builder. What does that mean? I think it's telling me that we need, what's her face? Oh, I",
            "start": 3260.52
        },
        {
            "text": "up there and save him? No. Superman. No. That's how they keep you from breaking the game. We need a master builder. What does that mean? I think it's telling me that we need, what's her face? Oh, I see. Elizabeth Banks. Wild style. But it could be another master builder. But yeah, get in there and get me wild style. Mm-hmm. Mm-hmm. Mm-hmm. Thank you. So they're not all master builders. Well, no, but she and Emmett are. Like people share abilities, so I don't know exactly what they want her to do. Not Emmett Brown. No, Emmett Brown's a scientist. He's doing stuff he can do. But now I'm gonna come over here as her, let's see what it says here. It's gonna say, oh, she's a relic detector. So no, totally different. My apologies. Okay, I'm gonna do this. I'm gonna do this. Nothing, I don't know yet. We don't have anything. It's freaking me out. Now we need Doc Brown. It's on fire. Now you get to be Doc Brown. It's on fire. You're Superman, you're gonna be fine. Now become Doc Brown, come to",
            "start": 3309.72
        },
        {
            "text": "yet. We don't have anything. It's freaking me out. Now we need Doc Brown. It's on fire. Now you get to be Doc Brown. It's on fire. You're Superman, you're gonna be fine. Now become Doc Brown, come to wild style over here, and do whatever the hell it wants you to do here. Oh, you need, hold on, hold on. It's circle, see what happens. Okay, you can't do it. Hold circle. Oh, look, he's a little one. Oh, cute. He's doing it. Can you drive in that hole or are you too close? I'm too close to myself. Okay. Hold on. There you go. There you go. Oh, what happened? There it is. There you go. No, I gotta keep holding it. You keep holding it until you feel it all the way. I was holding it a lot earlier. No, it's fine. This is your first time playing Leave It A Mention. It's fine. Uh-huh, uh-huh, uh-huh. Just go up. Collecting coins or? Now, do I want all the coins? Ah, I see. Yeah, we want all the coins. What does this do? Can you, I don't know. We've never used Doc Brown's abilities before. So",
            "start": 3360.88
        },
        {
            "text": "Just go up. Collecting coins or? Now, do I want all the coins? Ah, I see. Yeah, we want all the coins. What does this do? Can you, I don't know. We've never used Doc Brown's abilities before. So can you leave it there? Hit it, hit it, hit it, and see if you abate. No, because you couldn't have threw it a bit. Oh, I see. Oh, I see. What do I do? I want to be Superman. I want to better look at this puzzle. This is a new kind of puzzle. I don't know this puzzle. Oh, look. There's one up there. Yeah. But see, you, so you hit that one. So you hit that one. Yeah. Go up. Oh, something when you're holding. Okay. This one's still locked up. So you have to be holding it down here. Oh, I see. I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. Oh, I see. I'm going to be holding it down here. Huh. Huh. Huh. What is this doing? It made electricity. I don't know. Oh, oh, I broke it. Oh, is there another one? Well, you have unlimited",
            "start": 3398.0
        },
        {
            "text": "I see. Oh, I see. I'm going to be holding it down here. Huh. Huh. Huh. What is this doing? It made electricity. I don't know. Oh, oh, I broke it. Oh, is there another one? Well, you have unlimited of them. No, I know. But I think when you leave one, try leaving it, yeah. But I think when you. No, that's what I just did. Yeah, yeah, yeah. Press that button. Maybe, do you think we're supposed to do the other puzzle first? No, because this is like, well, maybe. Yeah, okay, let's try that. Let's try doing the other puzzle. Oh, did you see that? No, what happened? You got all shocked. Or one of the Ghostbusters. No, that's me and my Ghostbusters. Well, why did you walk up to an electric car? I was getting my light computer. What are you doing? I'm doing part of the puzzle here. Oh, that was that part. Don't do that part. No, go back. Oh, well. Oh, oh. We screwed that up. Did we? My apologies. We've advanced the level. Oh, no. Now we'll never get the platinum. Well, we already have the",
            "start": 3438.0
        },
        {
            "text": "that part. Don't do that part. No, go back. Oh, well. Oh, oh. We screwed that up. Did we? My apologies. We've advanced the level. Oh, no. Now we'll never get the platinum. Well, we already have the platinum. Don't worry about that. We'll get the trophies. We'll get, don't worry. We need one mini kit and we need true hero. Now, we got the two-time multiplayer on, so there shouldn't be any reason not to get true hero in this. Or not what they call it. We can call it true hero in this game. It's called something else. Rule breaker. Should I put the container unit down? Yeah, you are a military. There you go. That's what I'm selling down. Should I not go for these things right now? No, go ahead. I don't want to. Oh, I got to pick them up. Oh. A Vigo? Where? Oh, yeah, yeah. It might be Vigo up there. No, it was. Oh, it's a safe spot. Same thing. You're canceled. Same thing. Whatever you want. Whatever you want. Awesome. We'll blow a fuse or something. I don't want to play all of it. Oh,",
            "start": 3505.0
        },
        {
            "text": "up there. No, it was. Oh, it's a safe spot. Same thing. You're canceled. Same thing. Whatever you want. Whatever you want. Awesome. We'll blow a fuse or something. I don't want to play all of it. Oh, no, I got slimed. We're all slimed. So, Kevin, are you having fun? Yeah, I'm having a great time. You understand my obsession with Lego. Yeah, this is fun. All right. What are you doing? Blasting. Oh, he's going quick. Covered in slime. It's done, but every single time the music starts playing, it's very excited. It's awesome. They do that in the Lego DC games too. Oh, shit. All right. Bust me. We got to bust five paintings. Got it. There's the second one over there. Shoot. What are the other ones? Oh, you see the one in the distance there? Yeah. Theoretically, we should be pushing forward. Yeah. Once we beat these ghosties. Why can't I break this table? I feel like I wasn't paying attention. Oh, no. No, I'm in the slime. Yeah, all the Ghostbusters working on this thing. When I wasn't",
            "start": 3550.0
        },
        {
            "text": "Yeah. Once we beat these ghosties. Why can't I break this table? I feel like I wasn't paying attention. Oh, no. No, I'm in the slime. Yeah, all the Ghostbusters working on this thing. When I wasn't paying attention, we somehow beat the... Cleared the chandelier over there. What did we do? Oh, that one's got glass? This is gold. We can melt this one. Oh. So in these games, gold things are meltable things. Right. Shiny silver, you can blow up. Gold, you can melt. Yeah, it's true in real life too. It's true. Is this supposed to be something? What? It's like broken thing right next to Superman. Uh, possibly. Usually if something doesn't break down, it looks like it could be built with something. Yeah. I don't know if that is actually. You have to get more of the puzzle pieces done or whatever and then they all break in. I love it. Are we trying to shoot slime? Yeah. There's my problem. There we go. We're trying to shoot slime. Yeah, I got it. This is one that only me and the other",
            "start": 3622.0
        },
        {
            "text": "and then they all break in. I love it. Are we trying to shoot slime? Yeah. There's my problem. There we go. We're trying to shoot slime. Yeah, I got it. This is one that only me and the other ghostbusters can do. Sure, it's cool. You can help me melt this thing. There it is. You did that. You did that. You and I did that. Ah. Where you going? Damn it, you got there first. I'll tell you where I'm going, Michael. One boy. What's all this half talking? The mumbling. It's ghosts. You know what I mean? You know what I mean? You know what I mean? You know what I mean? You know what I mean? Oh, there's more ghosts. Oh. Oh no. They were nice ghosts until they became evil looking ghosts. Yeah. Is that how they talk? Or did the audio go again? No, that's how they talk. Okay. That's not the mumbling. Why did I switch? Hold that. Oh no. I knew. You cleared ghostbusters. I'm holding it and I'm trying to move it. Oh, do you need a trap? There we go. No, no. Can you come over here? Because what's",
            "start": 3678.0
        },
        {
            "text": "Why did I switch? Hold that. Oh no. I knew. You cleared ghostbusters. I'm holding it and I'm trying to move it. Oh, do you need a trap? There we go. No, no. Can you come over here? Because what's happening is the... Oh, perfect. Good idea, Superman. I was going to have... Superman, you're so smart. Put it down, ghost. Put it down. There he goes. There he goes. Oh, oh, oh. We got him. Got him. This is awesome. They should be... Making it look easy. Where is the Lego Ghostbusters game, TT Games? It's in Lego dimensions. Okay, that's fine and all. You know? But I want more. If I had just a whole game of walking around busting ghosts like that, don't act like that isn't going to be awesome. Tell them, Kevin. Yeah, it's going to be awesome. Figure it out. Figure it out, guys. Oh, no. I made you into a brick of ice. You killed him. You're a monster, Superman. Are you ready to move on? Because once I smash through this thing, we smash through it. Going the wrong way, though. I was making",
            "start": 3738.0
        },
        {
            "text": "you into a brick of ice. You killed him. You're a monster, Superman. Are you ready to move on? Because once I smash through this thing, we smash through it. Going the wrong way, though. I was making sure I couldn't smash that table. Is that your girlfriend? Yep. She's like, you better not be dressed like a ghostbuster right now, playing video games. The house is on fire. We need a magic guy for that. A magic guy? Yeah. You gamed off for Grey, maybe? Mm-hmm. I always thought it was weird that Superman can't fight off magic. He needs to have some weaknesses, right? Magic, though? Well, I mean, magic makes no sense. If you're an alien who's super powerful, I guess that's a good enough reason. You know what I'm saying? Yep. Guys got to have some weaknesses. I'm collecting more stuff. Sorry. I need all these points, you know? This isn't a Let's Play where I show you the game. It's a Let's Play where I get back to having 100% of all the way down. It's just true. Because it's annoying when I",
            "start": 3788.0
        },
        {
            "text": "need all these points, you know? This isn't a Let's Play where I show you the game. It's a Let's Play where I get back to having 100% of all the way down. It's just true. Because it's annoying when I don't have to. They have that DLC. I enjoy getting it again, though. You know what I'm saying? Yeah. It's going to be a tough one to keep 100%. No, it isn't. Really? No. You can come build this thing. I'm trying to burn this. Can I not burn this one? Okay. What do we got? What do we got? We can't move off of it. Slimer can eat that cake. Slimer loves cake. Little known fact about Slimer. There you go. Look at him go. Shoot him. Throw him. There you go. I like your heat version. Good job, Super. Oh, dear. Oh, which one's he in? Oh, shit. I think he's in... The left one? Far left? Yeah, far left. Yeah, me too. Okay. But now the question is if we melt the other ones, do we get studs? You know what I mean? Yeah. Where does the game end? I'm going to go to a trap. Keep it close. Okay. I like",
            "start": 3845.0
        },
        {
            "text": "Yeah, me too. Okay. But now the question is if we melt the other ones, do we get studs? You know what I mean? Yeah. Where does the game end? I'm going to go to a trap. Keep it close. Okay. I like that everyone left you and they're with me now. I jumped on the other side. All bad. He needs the trap. Wait. Guys, he needs the trap. Wait. Guys, he needs the trap. Is green good? What do you mean? There's a green light. That means it's empty, right? Oh, yeah, yeah. Okay. Light is green. The trap is clean. Yeah. Oh, yeah. We're the best Ghostbusters ever. I know. Superman and Pete Vankman are the best Ghostbusters ever. Dun dun. Dun dun. Oh, this is weird. Why isn't it breaking? Probably going to come out of any use. Get it needed or something. I'm going to... I'm going to care for him. I'm going to... I'm going to... I'm going to... I'm going to... I'm going to... I'm going to... Carefully... Oh, oh. Chair started attacking me. You got to do suit man. He had to die. It was self defense. I",
            "start": 3897.0
        },
        {
            "text": "to... I'm going to... I'm going to... I'm going to... I'm going to... I'm going to... Carefully... Oh, oh. Chair started attacking me. You got to do suit man. He had to die. It was self defense. I guess even Superman has his limits. That's when we need the magic guy. Oh. Oh, and we need a magic guy to get it back on the wall so we can blow it up. Got it. So you want to big out Gandalf for me? Yeah. Is that the only magic one you have? No. Oh, Doctor Who. Get Doctor Who. Kids love Doctor Who. Sean Pitts is at home going, oh, Doctor Who. I really love Doctor Who. Started watching it because my brother would not stop talking about it. I was like, I'm going to watch it so I can tell him why I think it's dumb. Why it's stupid and everything you like is stupid. And then one season in I was like, this is not bad. This is good. I got rid of my favorite Doctor Who though. It's the first one. What do you even like? I didn't like him? Yeah, I thought you said that somewhere. Who? No? I don't",
            "start": 3944.0
        },
        {
            "text": "this is not bad. This is good. I got rid of my favorite Doctor Who though. It's the first one. What do you even like? I didn't like him? Yeah, I thought you said that somewhere. Who? No? I don't feel like I have an opinion. The 13th Doctor. Is that the guy from Jessica Jones? No, the first one. I like the guy from Jessica Jones. Yeah, that one was pretty good. I want to be the Doctor. Now you can hold triangle if you want and jump right to that person. Am I wrong? Is he not magic? I don't know much about Doctor Who. No, this is science. I thought he had the magic tool. No. Magic tool. God dammit. The old magic tool on. Oh, wait, did you see that? Yeah. Why did that come out? I don't know what you did. Alright, fine then. I'm sorry. You need to get Ganon down. Who the who? Somebody else's magic. Yeah, they should have other ones. Oh, his hat fell off. That's a big hat. Who else is magic? We had too many people on there. You want to send some people back? Yeah, we need Wildstyle still.",
            "start": 3986.0
        },
        {
            "text": "magic. Yeah, they should have other ones. Oh, his hat fell off. That's a big hat. Who else is magic? We had too many people on there. You want to send some people back? Yeah, we need Wildstyle still. Okay. I'll get rid of Superman or do you want him? No, I want Superman. I'm going to get rid of Doc Brown, I guess? Yeah, and then Doctor Who. Doctor Who and two Docs. Perfect. No room for doctors. You put a crooked ass hat on, Gandalf. No respect. No, he's already dropped in the game now. No, that's not what it is. Doctor Who and Doc Brown. Oh, no, I like the man. I screwed that up bad. There you go. I'm going to get a circle and I'll blast it off the wall. Now we just need one more, Kev. Is that this giant one? I doubt it because they were all Vigo looking before. You're right. Usually they all match. Uh-oh, what's the screen glow above? We can't move over there yet. Oh, I see. It's like it's holding us back. Got it, got it. I think we missed it over here. It's possible. Doing recon.",
            "start": 4041.0
        },
        {
            "text": "all match. Uh-oh, what's the screen glow above? We can't move over there yet. Oh, I see. It's like it's holding us back. Got it, got it. I think we missed it over here. It's possible. Doing recon. Doing recon. Doesn't look like it. No? He's blasting random walls, huh? I'm trying to get on one of those studs. I'm here for the studs. Sure. I mean, yeah, I can't. You know what might happen? I like that it goes faster. Yeah, you know what might happen, actually? We might, when we beat the ghosts here, or Slime or Fly into that and that'll become Vigo. You see this right here? Yeah. Oh, I got to move you. There it is. Found it. Oh, no. Oh, no. Oh, no. Oh, no. Oh, no. Oh, no. There it is. Found it. Woo, wow, it's down. Get ready for a trophy. There it is. Now we just need to beat the level. Yeah. We need to get the... All the coins. Yeah. Yeah. So now we think he's in this one. Do you want me to blast it or should I blast the other ones and see what we get? No, blast the other ones. Okay.",
            "start": 4103.0
        },
        {
            "text": "We need to get the... All the coins. Yeah. Yeah. So now we think he's in this one. Do you want me to blast it or should I blast the other ones and see what we get? No, blast the other ones. Okay. See what happens. Nope. All right, good call. Good call. Good call. Studs, we're fine. Whatever. I'm just letting you know. No, that sounds like actual terminology. I don't want my people, my people from brick and quire. Oh, he wasn't listening. You're wrong. I don't want them over here making fun of you because you don't know the difference between points. I'm trying to look out for you. You win that thing yet? No. I think this week we find out if I win. I mean, here's the thing. The award I'm up for, best brand ambassador for their game of choice on Lego Dimensions. Brandon Jones, Skylanders, Brian Altano, Amiibos, somebody else something. I can't remember. I'm sorry, I did that first. I don't know that person. Are any of them playing their games in the costumes of the game? No. Should",
            "start": 4157.0
        },
        {
            "text": "Brian Altano, Amiibos, somebody else something. I can't remember. I'm sorry, I did that first. I don't know that person. Are any of them playing their games in the costumes of the game? No. Should they? Probably not. This Let's Plays in an hour and 18 minutes so far. You want to go home, see your girlfriend? No, not at all. I'm happy. No, I do want to see her. That's not what I was saying. Sure, I know what you mean, but you're not like upset. I like how Slimer does his little spin like he does in the movies. You know what I mean? It's cute, very cute. Everything in this game is very cute. Who gets to build? Who gets to build? What are my questions with these, with the level packs always? How long is it going to get? Am I getting the entire ghost poster movie here? You know what I mean? Yeah, yeah, yeah. Because if so, pack a lunch, we got more to play. Because like Doctor Who was long, but it wasn't like long. You know what I mean? It wasn't like it went on and on and on. So if you",
            "start": 4202.0
        },
        {
            "text": "Yeah, yeah, yeah. Because if so, pack a lunch, we got more to play. Because like Doctor Who was long, but it wasn't like long. You know what I mean? It wasn't like it went on and on and on. So if you do need to leave at some point, or you think maybe this Let's Plays shouldn't be three hours, you let me know. No, just keep it going. Okay. And if you're watching this and you're like, now I don't need to buy it, you haven't had any of the fun you have. You going to get the trap ready for me? Yeah. I like how we work together. What are you doing? What is this? Oh, that's the trap. Nope, put it down the wrong place. Pick it up. Oh, dear. I keep accidentally blowing up. It's okay, it's okay. Don't worry, Superman. We believe in you. You've saved the city so many times. Oh, get Slimer Bean off the painting. Oh, there it is. There it is. Oh! See, the most coins we're getting is all these blue guys here when we catch the ghost. Uh-huh. We're doing pretty well. Am I supposed to be doing this?",
            "start": 4254.0
        },
        {
            "text": "the painting. Oh, there it is. There it is. Oh! See, the most coins we're getting is all these blue guys here when we catch the ghost. Uh-huh. We're doing pretty well. Am I supposed to be doing this? Yeah, now you just trace it around. Trace it around. Oh, I see. There you go. If you think we can look around the camera. You chill out, dude. Superman's going to burn the Ghostbusters alive. So, I played a little bit of the Lego Star Wars game on the Wii U. That was a lot of fun. On Wii U? On Wii. I don't remember the original. I know everything. Yeah, for some reason we had to blow up a thing there, so I was like, I don't know, dude. Should I not put it down yet? Uh, this seems like it's story based, so I don't think it's the original. You can just chill out, Bryce. No, Superman! We need him! It's all right. I'm opening that trap now. Don't look directly into the trap. Oh, you got it. It's the trap, Ray. That wasn't such a chore now, was it? We got it! What is it? Will there be any more",
            "start": 4302.0
        },
        {
            "text": "It's all right. I'm opening that trap now. Don't look directly into the trap. Oh, you got it. It's the trap, Ray. That wasn't such a chore now, was it? We got it! What is it? Will there be any more of them? Sir, what you had there was what we referred to as a focused, non-terminal repeating phantasm, or a Class 5 full roaming vapor. Real nasty one, too. Thanks so much. Here we go. Coming through! One Class 5, three roaming vapor! Oh, look, he's moving around on his own! No, you're making fun. No, that's not what I'm talking about. Slimer. In the, yeah, see? In the trap? Oh, nice, okay. We can't do what we got. We're becoming a liaison. I don't think I'll ever get old. I really hope they do something Man of Steel. You know what I mean? Yeah, no, I hope so. That'd be awesome. So is that why you're saying hearts are just a little gray? Yeah, yours are steel, like you can't get hurt. Whereas mine are like the slime hearts or whatever, because I could get hurt and then theoretically I'd",
            "start": 4362.0
        },
        {
            "text": "you're saying hearts are just a little gray? Yeah, yours are steel, like you can't get hurt. Whereas mine are like the slime hearts or whatever, because I could get hurt and then theoretically I'd have to find a heart or whatever. Or just die in this one. So it's just Superman's character can get hurt, huh? Right. Because that's not really what these games are about. They used to, I remember a long time ago, make it like, oh, they're actually getting punished and dying and nobody had any fun so they stopped doing that. I do like that Superman can just run into things. Other characters can't. So you run into things and they explode or whatever. Him flying fast, look at that, look how fast he's going. He's moving. Oh yeah. Oh, oh. Can I break this? No. Here, I'll solve your little problem. Pete Fink, that's a guy. Pete Fink, that's a guy, okay. What? So the blue studs are more valuable. Right. How much more valuable? You know, there's no sense. No, they have monetary value, or values to",
            "start": 4425.0
        },
        {
            "text": "Fink, that's a guy. Pete Fink, that's a guy, okay. What? So the blue studs are more valuable. Right. How much more valuable? You know, there's no sense. No, they have monetary value, or values to them. I forget what they are. And in the game, can you do anything with the studs? Yeah, you can buy and unlock stuff. Forget the next story part, sorry. No, it's fine with me. Sleeping on the job. Typical New Yorker, just like that Calamari art, a piece of garbage. No, you do that, you can, yeah, you buy stuff, you unlock stuff. They introduce a thing called, in the main game, I don't think it's in there, I don't think it's here, unless we run into it maybe, a thing called hire a hero mode, where you can platinum Lego dimensions with the base set. Now the base set is the base, and then three characters, wild style, Batman, and Gandalf, right? Sure. But you'll run into things where it'll be like, oh, well, you know, you really need Aquaman for this, or whatever, you need Doctor Who. My heart",
            "start": 4478.0
        },
        {
            "text": "wild style, Batman, and Gandalf, right? Sure. But you'll run into things where it'll be like, oh, well, you know, you really need Aquaman for this, or whatever, you need Doctor Who. My heart broke. Oh, well, there's certain things that'll get you, you'll be right back with me. Oh, so, and it used to be, when the game first came out, that like, alright, well, you're screwed then, you know what I mean, like, if you don't have that character, that thing, whatever. And then, fans were like, that's kind of dumb, you know what I mean, because I'd like to 100% it, even though I don't need to play platinum, so I don't know why you do it. They introduce hire a hero mode, where you can take your coins and spend them, and get whatever hero you need for a certain amount of time, so long enough to do the channel. That's really cool. See, this tar is killing me. Oh, if you stand on it. Is that where you lost your heart? Maybe, I wasn't paying attention to the place, I just noticed it. All of a",
            "start": 4529.0
        },
        {
            "text": "do the channel. That's really cool. See, this tar is killing me. Oh, if you stand on it. Is that where you lost your heart? Maybe, I wasn't paying attention to the place, I just noticed it. All of a sudden, it's magic tar. No, I never have to touch it. See that? Yeah. I'm gonna use poop here to fix it. Oh. Because Ghostbusters used poop. Is that an actual, oh no, you died. No, no, it's not a real thing. Oh no, Pete Venkman. What do you need on the other side? Oh, should I wake him up? We need to keep moving, yeah. Or I got it. Oh, there it is. You notice who he's dressed as. Who's dressed as the Kamel-Fettison dude who will come and shut down the thing eventually, the containment unit. Be like, this doesn't look like anything he's in. I don't want your opinion. Oh yeah, it lets him all out. Yeah. Oh shit. Come on, Pete. Pete, grab the damn bar. He's dead. He's dead. Leave him behind. Grab his proton pack out of the tar that's everywhere. Do you want me to grab that? No, it doesn't",
            "start": 4570.0
        },
        {
            "text": "out. Yeah. Oh shit. Come on, Pete. Pete, grab the damn bar. He's dead. He's dead. Leave him behind. Grab his proton pack out of the tar that's everywhere. Do you want me to grab that? No, it doesn't matter. I don't think I want to pull anything down. I can't actually grab it. No, you don't need, no, no, that's stuff you don't need to worry about. Yeah, I can't fly while I'm holding. Yeah. I don't know why he can't, I'm not. What's happening? I'm just trying to jump and grab the damn bar. There he goes. I was double jumping, that's funny. Just do this. Just fly, oh, why didn't I think of that? I don't know, man. You're funny. You're a funny kid, Kevin. You're a real funny guy. Don't let all these, yeah, see, what? Don't you want these trophies with me? Yeah, no, I definitely want the trophies with you. See, like, your Lego Dimension trophy console looks terrible. Oh, yeah, my trophies are atrocious. This kid, especially Lego Dimension, this kid only got the Ghostbuster trophy? How do",
            "start": 4619.0
        },
        {
            "text": "with you. See, like, your Lego Dimension trophy console looks terrible. Oh, yeah, my trophies are atrocious. This kid, especially Lego Dimension, this kid only got the Ghostbuster trophy? How do you even do that? I mean, don't doubt him, guys, he does. Got it, got it. I don't want to stray too much and just realize I might trigger the next story part on accident. I mean, they're usually pretty big. Like, I think that pad over there is going to be involved. We obviously have to have one on it. Right now, we don't have to screw up anymore. Look how close the meter is, we're almost there. Are those all the coins for this area? No, that's just the set number of, like... Oh, for the trophy. You nailed it, yeah. But you see, we have a two-time multiplier on, too. I bought that red brick back in the day. Now, regular Lego games, like Lego Marvel Avengers is coming out, you can buy, like, crazy amounts of multipliers and have it be, like, 2,000 or whatever. So literally, you walk into a level",
            "start": 4667.0
        },
        {
            "text": "the day. Now, regular Lego games, like Lego Marvel Avengers is coming out, you can buy, like, crazy amounts of multipliers and have it be, like, 2,000 or whatever. So literally, you walk into a level and, I mean, you get it. And that's my favorite. But that's not as fun. It makes you feel really powerful. In this instance, yeah, it's fine. They did it smart, because it is. If I just walked into every DLC level, I'd be like, all right, this is fun. Thanks. Love the D, huh? Yeah, got quite a bit. I'm still interested to see where this goes. What are we gonna do? We gonna fight in the shape of that plane here? Little blue one. Yep. Got it. See, yeah, we're gonna bring it back, though, once we're here and smash through all this stuff. Oh, the ambulance I can't break. Oh, I'm gonna get the gun. I'm gonna get the gun. I'm gonna get the gun. I'm gonna get the gun. The ambulance I can't break. But I'm Superman. What is this? Gargoyle. Oh, yeah. Oh, oh, okay. What? I broke the gargoyle thing,",
            "start": 4715.0
        },
        {
            "text": "I'm gonna get the gun. I'm gonna get the gun. I'm gonna get the gun. The ambulance I can't break. But I'm Superman. What is this? Gargoyle. Oh, yeah. Oh, oh, okay. What? I broke the gargoyle thing, and then a cop got out of it. It's kind of like the terror dogs at the end, and then it goes bust through. All right. Well, I don't feel like we should go back and get there for now. All right. Thanks. Thanks, dude. Look at him go. God damn. I'm gonna drive it back. Should I hit that other? Hit them all. Hit all the pads. Because the pads, I think, are playing into what we need to do. No. Sorry. No, you're fine. Yeah, you can do it. You can do that in Flex Superman. I like teaching you, you know? Yeah, no. I like learning. It just sucks because I have to hit triangle, but if I hit it a little too early, well, it kicks me out of my suit. So drive back there and hit those pads that we hit. Yeah. It's just the one, right? Yeah, I think that's the only one. Also, do you think it's weird that",
            "start": 4764.0
        },
        {
            "text": "too early, well, it kicks me out of my suit. So drive back there and hit those pads that we hit. Yeah. It's just the one, right? Yeah, I think that's the only one. Also, do you think it's weird that there's this one kid? We'll get that stuff. All right. Oh, he's dead now. Well, do you think it's weird that there's this one kid? Superman ran him over in the echo on. This kid's up to something. Bam. The icular manslaughter. Flaps on his Krypton. God damn it. You can teleport back. You're right. You're right. There. Okay. Wait for it. There it is. Now, do I have to hit it directly? No, it's pretty generous. Oh. Oh, interesting. I was trying to break that earlier. Yeah, see, some of the things that are so big, you're not going to be able to. Oh, so I guess I'm going to blow the ambulance up. Right. Staring. It's a Lego. It needs a little help. Aim real close. That didn't hit anything. Yeah, it should have been. Oh, you know what? There were a bunch of bikes there. Oh, that we already",
            "start": 4815.0
        },
        {
            "text": "up. Right. Staring. It's a Lego. It needs a little help. Aim real close. That didn't hit anything. Yeah, it should have been. Oh, you know what? There were a bunch of bikes there. Oh, that we already smashed. Yeah. Smashy smash. Can I break this? No, you can't break that. That's real. That's that real. Can't break that either. What about this? Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh, yeah. Oh. Can I try this one more time? Yeah, sure. Oh. Is there another one? Yeah, there is one over here. Okay. Make sure there's only one of us on this. Oh, damn it. Nope. Whatever I was supposed to hit, I already destroyed. We've been doing pretty well here at cleaning up the town, as they say. See what it is? Hold on, hold on. I was like, why can't I hit it with the other? Oh, damn it. Superman, not the best driver. I feel like my... Get out of the way,",
            "start": 4875.0
        },
        {
            "text": "cleaning up the town, as they say. See what it is? Hold on, hold on. I was like, why can't I hit it with the other? Oh, damn it. Superman, not the best driver. I feel like my... Get out of the way, Gandalf. How do I honk? Why did that speed me up? Want to take the car? Sure. You ghost rode the whip there. That's exactly what I appreciate. That didn't happen? Didn't do anything? What? Don't do that? Yeah, it did. It gave me something. It gave me something. You want to talk to these people? You just going to handle the car? Just going to handle the car. We've got a build over here. I got it. I got it. I'm Superman. Pop, pop, pop, pop, pop. Circle. Yeah. Circle. Right now? No, no. You're being very helpful. Thank you. I can't break these people. No, you can't break people. Really? Yeah, you know you can break circles, but those ones are clearly up to something. Not like that kid you murdered. I understand. What was that? Superman, the bus is not... I want to see if I can blow it up.",
            "start": 4942.0
        },
        {
            "text": "you know you can break circles, but those ones are clearly up to something. Not like that kid you murdered. I understand. What was that? Superman, the bus is not... I want to see if I can blow it up. Whoa. You broke the after one. Yeah, they did. I am a little bit. One thing I'm missing. I wish I could... There's no way for me to turn on the siren, is there? Of course there is. TT games, everybody. Nailing it. There's L1 if you're wondering at home. It just pushes you. It's the same as triangle. For me. L1. When you're not in the car. No, triangle gets you out of the car. What does L1... You know what I'm saying? Yeah, yeah. You following me, dog? Where? Oh, we're so close. I'm a true hero. Status. It's so good. Oh, we're going to pop it in two seconds. Who's the fastest character that you have? It's probably Superman when he does that fly thing, right? There is no Flash character yet, sadly. Hopefully they will. Give me time. I mean, my hope... I love... TT games. I love LEGO games.",
            "start": 5025.0
        },
        {
            "text": "have? It's probably Superman when he does that fly thing, right? There is no Flash character yet, sadly. Hopefully they will. Give me time. I mean, my hope... I love... TT games. I love LEGO games. I'm not saying the individual standalone LEGO games need to die or anything, but it would be cool if they were like, all right, in our LEGO Dimensions next time is going to have the CW universe and it's flashing... A rule breaker. Not sure here. You get it too, Kev. Congratulations. Yay! You're welcome. My first trophy. You lied. I saw what level you were. I'm like level two. Four. Again, I really saw it and it matters. So now screw all the break... I mean, we could keep breaking stuff. Okay, we're done with it. Got it. Now we got what we wanted. I don't need to buy anything, you know? Oh, back to the... Oh, that's cute. I mean, where are we going? Not... Tasty kissy. It's traps, you see? Lots and lots of them. Not that I'm mad. Well, why did they change that? Did you say they used movies?",
            "start": 5106.0
        },
        {
            "text": "to the... Oh, that's cute. I mean, where are we going? Not... Tasty kissy. It's traps, you see? Lots and lots of them. Not that I'm mad. Well, why did they change that? Did you say they used movies? Yeah. Audio. But I mean, like that was Dana Barrett in the Ghostbusters. I don't know, maybe... I don't know. Let's not pretend to know how licensing works. I don't know. Sure. Oh. Cute. Yeah. That's strange. Homer Simpson's donut. I know. Because he's in this game too, you know? Yeah. Uh, Eddway and an egg. Very cute. Cute too. Yeah, see this scene in the movie, I was like, what is happening? I don't believe this. Will you please leave? Okay. I gotta get some sleep. I'm dying. I'm just gonna get in there. I like that. He's covered in slime. Yeah. Damn. Why does it always do this? We're in the Ghostbusters. Firehouse? I don't know. I can't always see him at all times. What's cracked mean? I only use my powers for good. It means we need a character to rage out and smash that wall. So what I",
            "start": 5155.0
        },
        {
            "text": "Ghostbusters. Firehouse? I don't know. I can't always see him at all times. What's cracked mean? I only use my powers for good. It means we need a character to rage out and smash that wall. So what I need you to do- Superman can't rage out? No. Because they need to have something for some people, you know what I mean? Can you please- That's enough of that. Thank you, I'm sorry, I apologize. Oh, it's fine. See, Homer Simpson gets real big and smashes it. Yeah. I thought that- He does the Hulk-Homer thing? Yeah, yeah. Which I didn't know was a thing really. Oh. 13th season. Oh, Jesus God. What? No wonder I didn't know about it. I only even required nine years of watching Simpsons. Oh, we don't need to break everything anymore. No. No, we need to- No, it's just fun. You know, I've gotten used to it. I- You're funny. No, no, no, I was looking at him. Why is he- I guess someone else is supposed to do this one? Oh, what's he doing? Is he shrugging? Yeah. Who's he putting out anyway? No one.",
            "start": 5263.0
        },
        {
            "text": "to it. I- You're funny. No, no, no, I was looking at him. Why is he- I guess someone else is supposed to do this one? Oh, what's he doing? Is he shrugging? Yeah. Who's he putting out anyway? No one. Probably goes for him. For like, no exaggeration, 15 years. I never missed a Sunday Simpson. Oh, wow, really? Yeah. I liked it for a long time too. I just thought it was funny. Huh. Usually they say above it who they mean. Yeah. Why can't we jump into him? I think it might be- this might actually be a doctor. I'm gonna put on a doctor. Nobody's using Wild Style? You're using Wild Style. Oh, well get off. I don't care. All right, go. Hurry up. Call me if you need me. Doctor will see you now. What's this supposed to do? Uh, it's a puzzle for sure. Yeah, it certainly is. So I don't know you. I'm gonna have to take this call. You wanna just stop? We've been playing for a long time. An hour and a half. It's probably best if we stop and tell you we've really enjoyed ourselves. You wanna take a",
            "start": 5316.0
        },
        {
            "text": "gonna have to take this call. You wanna just stop? We've been playing for a long time. An hour and a half. It's probably best if we stop and tell you we've really enjoyed ourselves. You wanna take a call and say, can I call you back in one second, babe? I'll call her back. Ladies and gentlemen, we are- I've enjoyed myself quite a bit. Have you had fun? Yeah, I do. Be a micro-Ghostbuster for the day? Kinda sad that we're not gonna finish this. We're gonna finish it. Maybe you can take the call. We don't need to do it. We don't need to stream the entire game. You know what I mean? We've enjoyed it and if you enjoy it, you should probably, as I always say, go buy the game. Show your love for developers, support their things, don't just watch everything on YouTube. But this has been great. I'm, as usual, totally in love. As a Ghostbuster fan, I'm totally juiced, as Greg Geddes would say, with what they've done. There's so much love and tender care in it. There's the containment unit and",
            "start": 5375.0
        },
        {
            "text": "as usual, totally in love. As a Ghostbuster fan, I'm totally juiced, as Greg Geddes would say, with what they've done. There's so much love and tender care in it. There's the containment unit and the trap and just, I'm having a ball and I can't wait to play more. So, if you're watching TT Games, and I'm sure you are, make more Ghostbusters levels. Who do you want to see in Lego Dimensions going forward? I mean, they got Superman. Sure. They have the Simpsons. Sure. Is this- Futurama? Futurama would be good. I'd love to see it in Teenage Mutant Ninja Turtles. South Park? I got involved on a Twitter exchange the other day. Uh-huh. Neil Druckmann from Naughty Dog was playing with his child and said, what do I have to do to get Uncharted in this? Uncharted in this game would be pretty awesome. If you need me to connect you two, just let me know I can do that. Until next time, ladies and gentlemen, I'm Greg, that's Kevin. This is YouTube.com slash Kinda Funny Games and we'll be back soon.",
            "start": 5410.0
        },
        {
            "text": "If you need me to connect you two, just let me know I can do that. Until next time, ladies and gentlemen, I'm Greg, that's Kevin. This is YouTube.com slash Kinda Funny Games and we'll be back soon. It's been our pleasure to serve you. Crash Bandicoot? They're never- no. I got a lot to tell you about why that'll never happen.",
            "start": 5448.0
        }
    ]
}