{
    "id": 1408,
    "video_id": "iQs4I95Jvtw",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Broken Games and Reviewing Games - Kinda Funny Gamescast Ep. 48",
    "description": "Our impressions of Rise of the Tomb Raider on the Xbox One, why is it becoming the norm for games to be incomplete when they release, Colin and Greg explain the process of professionally reviewing video games, and there are so many way to play FF7, but which is the best? (Released on Patreon on 12.04.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1449853660,
    "duration": 5972,
    "transcript_chunks": [
        {
            "text": "What's up guys, welcome to the first ever episode 48 of the Kind of Funny Games cast. As always, I'm Tim Geddes, joined by the coolest dudes in video games, Colin Molliardi and Greg Miller. Hello Tim. It's good to be with you. I like that, you kept that for a while. That's what I do Tim. That face. I commit. That's a good face. I committed to Converse, committed to being fat, committed to glasses, DC Comics, PlayStation. Kevin? Yup? Not committed to Kevin. Do you want to get rid of Kevin at any second? At any moment? Yeah, he's having one of those days. That's what it says. Yeah, right before we went live you said you're having one of those days, you need to shut the fuck up. I mean, it's just, I'm allowed to say that out of love, but Kevin, it's like, it's not so much that he talks too much, it's that he's not quiet enough. That is a problem. It's a huge problem with Kevin. Yeah. Yeah. But I love him. That's not nice. Don't give me a finger, Kevin. I love him. You want to get paid?",
            "start": 0.0
        },
        {
            "text": "much, it's that he's not quiet enough. That is a problem. It's a huge problem with Kevin. Yeah. Yeah. But I love him. That's not nice. Don't give me a finger, Kevin. I love him. You want to get paid? Kevin, don't flip people off. Kevin, you're better than that. I don't know that you were. So this is a show about video games where every week we talk about why we love video games and all the cool things about them. You can get it early over at patreon.com slash kind of funny games. Throw some money that way. You'll get audio and video early. It's a great time. If you don't want to do that, you can wait. Youtube.com slash kind of funny games topic by topic day by day. Trying to steal Greg's words. I love it. No, you're doing a very slow laid back. We're just here on it. Today's been a crazy day. Talking about NPR. It's fun, man. I got my McDonald's coffee. This is a new, have you tried it yet? Yes, I just had my first sip. I enjoyed it. Okay. It's no Dunkin. It's no DDs. Oh, I know for a",
            "start": 43.06
        },
        {
            "text": "Talking about NPR. It's fun, man. I got my McDonald's coffee. This is a new, have you tried it yet? Yes, I just had my first sip. I enjoyed it. Okay. It's no Dunkin. It's no DDs. Oh, I know for a long time I had to have mom shit me DDs, but then they started finally selling it on Amazon. Of course, Amazon said they deliver it yesterday. Haven't seen hide nor hair of that. I'm telling you man, Amazon, I love them to death. They're one of my favorite things in the world, but they're slipping on them. They're slipping. I feel like they're Amazon now and all they're like, we're doing shit where it's like, we're giving you it before you even order it. Like that stuff is kind of fucking up the two days shit. Cause I've never had the mess up. And now in the past six months I feel like they've messed up maybe four times for me. I'm like, I'm still okay with that. That's not that bad of a mess up, right? Sure. A lot worse than none. It's true. So that's an issue. But yeah, I'm excited about",
            "start": 84.12
        },
        {
            "text": "messed up maybe four times for me. I'm like, I'm still okay with that. That's not that bad of a mess up, right? Sure. A lot worse than none. It's true. So that's an issue. But yeah, I'm excited about this coffee. It does smell like McDonald's coffee. Da da da da da da. For sure. Was there more rigmarole to go through? Nah. There's T-shirts and stuff. Those are cool. There's mugs and other things. If you're listening to this Friday night as a patron, come see us at PSX. Oh yeah. It's Saturday. If it's Monday, you missed it, but hopefully it's up. Hopefully we'll have recaps. We will have recaps. I'm sure. Are we going to post the, are we recording the panel? That would be the plan. Okay. Cool. It's one of those like that's theoretically going to happen. I haven't in all my conversations with PlayStation about our PSI love UXOXO being the only podcast there. I haven't talked to them about, is the soundboard in the back? Is that going to be easy to get off of? So we'll see. If you remind",
            "start": 121.32
        },
        {
            "text": "PlayStation about our PSI love UXOXO being the only podcast there. I haven't talked to them about, is the soundboard in the back? Is that going to be easy to get off of? So we'll see. If you remind me after this, I'll hit up my contacts. We should look into that because I would like to have that for our records. I've been saying we're going to have it to everybody. I've been lying to everyone's face as if this is all set. But then today I looked at Kevin and I said, and Kevin will go from there because we're hoping to do some interviews, go from there and record the panel. And Kevin looked back at me and when I saw his eye, I realized this is tougher than just saying that's going to happen. Basically as professionals has been coming together so far with them wanting our assets and I'm not going to be running anything. I'll just call things out and it'll happen. Maybe they're taping them for us and just give us stuff on the thumb. That'd be super good. I would like that because then I",
            "start": 167.64
        },
        {
            "text": "going to be running anything. I'll just call things out and it'll happen. Maybe they're taping them for us and just give us stuff on the thumb. That'd be super good. I would like that because then I need to do less work and I'm a big fan of what you're going to do there. I'm the one who edit that show and put it up. Kevin will be the one filming it. Well, you're over there. Not shows. I have a feeling I'm going to be shooting it. What's Kevin gonna be doing? I don't know. Yeah. Slow jerk. That wasn't a slow jerk at all. That was a normal jerk. Zero fucks given jerk. Okay, so do it one more time for me. See, I'll give you it's not slow, but it's definitely a lackadaisical jerk. What I like about it is there's a twist at the top. Like a fucking twist off. Oh my God. Yeah. What have you guys been playing lately? I've been bouncing around a lot. This is our first game cast since Thanksgiving, correct? Yeah. Okay, good. So I was playing Thanksgiving and right before I left for",
            "start": 207.04
        },
        {
            "text": "you guys been playing lately? I've been bouncing around a lot. This is our first game cast since Thanksgiving, correct? Yeah. Okay, good. So I was playing Thanksgiving and right before I left for Thanksgiving, I finished a game and I've already forgot. Oh, fallout. There's something else in there I thought. Whatever. I didn't want to jump right into what was it? What was the gun? Battlefront. Right. I was playing battlefront. Right. I was no fuck. It's today's topic actually. That published today. You put in the storm fucking game. So I was playing that as a holdover because I didn't want to get into anything. And I also, then we did a let's plays that were about our backlog and I played Assassin's Creed Syndicate and I was like, fuck, I want to play this all the way through. I like Assassin's Creed every now and again from what I played a syndicate. I was like, yeah, I'm in. Okay. But on the docket had been syndicate Tomb Raider waiting for just cause right Tomb Raider and syndicate",
            "start": 249.36
        },
        {
            "text": "Creed every now and again from what I played a syndicate. I was like, yeah, I'm in. Okay. But on the docket had been syndicate Tomb Raider waiting for just cause right Tomb Raider and syndicate we had, but I didn't want to dive into and get started and then just go away again. So went away, played a whole bunch of stuff on Vida on the flight. Shocking. I know played through the flower. You ever heard of this flower game flowers on? You ever heard of flower? You played it on Vida? Yes. Yes. On Vida. Is it motion or is it just it's motion? Yeah, there's an you can. It's yes, you can turn remember it's motion, but there's a secondary system, but it's not intuitive. It's not normal. It's still weird. Still weird experiment like the touch pad or something. I can't remember. It was up and down touch or if it was front and back touch or if it was just sticks, but I was pitching and yawn, but it wasn't. I was like, oh good. I have to use the motion and because I want to be this guy in the",
            "start": 289.64
        },
        {
            "text": "touch or if it was front and back touch or if it was just sticks, but I was pitching and yawn, but it wasn't. I was like, oh good. I have to use the motion and because I want to be this guy in the plane seat. Yeah, that's weird. And then it was still like, oh, motions the way to go. Also played. What do you think of flower? I played far before. Oh, this is like my first time in a long time sitting down and like playing. I'm gonna go through every one of the flowers or whatever. It was fun. It's still the same thing of just like, I wish it was a little bit more precise. You know, I know it's supposed to be relaxing. You know what I mean? I was working when flower came out. Obviously I covered flower from the Genesis, from the seed. And I understand that's the whole shtick or whatever of it. It's just like free flowing. But for me it was kind of annoying, especially later when you're like bashing buildings and stuff and it's like, well God, go back and bank out and come back and try",
            "start": 329.64
        },
        {
            "text": "it. It's just like free flowing. But for me it was kind of annoying, especially later when you're like bashing buildings and stuff and it's like, well God, go back and bank out and come back and try again. But it's fun. It was fun. It's good. I love flowers. But it was one of those things where I was like looking at the trophies and I was like, I don't know how to do this one. And I want to, I got to look it up because I played a game that I hadn't even, I didn't even know was out on a slip, slip under my radar in terms of it now. And so now we got to, what have you been playing column where I look this up? Nothing. Okay. Damn. I thought that was good. More time. Very un-callin but also very call in Thanksgiving break. Yeah. I just didn't, I haven't felt compelled to play anything. So I haven't, I haven't played a game in like two weeks. I think I messed around with Fallout a little bit at some point and again, and then I booted up Just Cause 3 yesterday to start playing it. But then",
            "start": 361.76
        },
        {
            "text": "I haven't played a game in like two weeks. I think I messed around with Fallout a little bit at some point and again, and then I booted up Just Cause 3 yesterday to start playing it. But then I got distracted with other stuff. Then I started playing it and realized I didn't really like the control scheme. So I kind of have to get over that. And I don't know, I'm assuming one of those positions I think all gamers find themselves in every once in a while, which is I just don't, there's just nothing out there that I really like that's really, really driving me to play. So I've just been like watching TV and reading books and trying to socialize with friends or doing whatever, you know, other things that are, that are out there. But I'll get back into it. I'm sad in hindsight that I didn't play anything cause I feel like I wasted quite a bit of free time. You get wasted though if you enjoyed it. Yeah. When you try to, I've done it, you've done it, we've done it. When you try to force",
            "start": 401.34
        },
        {
            "text": "play anything cause I feel like I wasted quite a bit of free time. You get wasted though if you enjoyed it. Yeah. When you try to, I've done it, you've done it, we've done it. When you try to force yourself to game, oh I have to play this for review or to be able to talk about it or whatever. It's not the same. It's not the way to go. Yeah. The game I was trying to say is I played actual sunlight. Have you heard of actual sunlight? No. It's one of those, I like to jump into the Vita store every so often, dig around, try to find something when I'm going on a trip. Find actual sunlight, hadn't heard of it and it's a game all about killing yourself. It's a super depressing look at being depressed and what this is and it's, it kind of is, it's like, you know, from a very honest place of the creator. It's one of the indie games obviously of the creator who makes it. He does a couple of things where he even breaks the fourth wall. Like you come out of your apartment one day all depressed",
            "start": 437.06
        },
        {
            "text": "creator. It's one of the indie games obviously of the creator who makes it. He does a couple of things where he even breaks the fourth wall. Like you come out of your apartment one day all depressed and it's like little eight bit sprites or whatever moving around, maybe 16 bit. It's little guys, you know what I mean? Like they look, remind me if you remember of course the big headed Ghostbusters game on a game boy. That's what we're dealing with. But you come out and there's two like you're, you walk around, you interact with things, but like, you know, even if you say hi to the person at the coffee shop, you click on it, then you get like, you know, what's happening in his head and stuff and how depressed he is and how fucked up his life is. And this is the, and so there's this one, it's like young couple and you walk up to them and it's, it's like a paragraph of text from the author being like, Hey, if you're depressed teen depressed, young 20 something, this isn't you. This isn't",
            "start": 472.96
        },
        {
            "text": "like young couple and you walk up to them and it's, it's like a paragraph of text from the author being like, Hey, if you're depressed teen depressed, young 20 something, this isn't you. This isn't your life. This is this guy in his late thirties who's depressed. It's all these really heavy, heavy, heavy themes in this interesting thing you're going through and having, I guess it's weird cause you're moving around and interacting with objects and stuff, but it's really all told through text. You just get there and it's like, it's all this text and it's not just like a conversation every time. You're reading a story about how depressed this person was super interesting, different. You know what I mean? I didn't know what I was getting into other than like it was supposed to be depressing about suicide and that's exactly what it was. And so it was interesting. I don't, it sounds weird. It was interesting because this is like something real people struggle with this depression on this",
            "start": 507.0
        },
        {
            "text": "about suicide and that's exactly what it was. And so it was interesting. I don't, it sounds weird. It was interesting because this is like something real people struggle with this depression on this level and they actually go and take the side out. So it's interesting to play through it and feel those emotions as a character. We're not obviously on the same level, you know what I mean? But it was a fun character experience of going through and playing and feel like, you know, when you meet people who are depressed or people who are a bit more inward and stuff to have a look at what that's like, you know what I mean? Cause we've all been depressed. I've never been depressed on that level, of course. But it was interesting. It was a good case study. Interesting about an hour and a half on Vita. And I'm sure it's, you know, probably PlayStation four as well. But of course if it is an on Vita, I don't play it. You know what I mean? That makes sense. Then I got to Chicago and still was",
            "start": 550.68
        },
        {
            "text": "Vita. And I'm sure it's, you know, probably PlayStation four as well. But of course if it is an on Vita, I don't play it. You know what I mean? That makes sense. Then I got to Chicago and still was like, I want something to get lost in. Like, you know what I mean? This is where I keep talking about, like, uh, I'd love a Western RPG. I just came off fallout, right? But I would love just a Western RPG on Vita where I'm just going around taking quests and doing this. And so I was toying around and finally I looked, I was, you know, I did the Google of like, best RPGs on Vita. Like tell me what RPGs are on Vita that I haven't reviewed or aren't from my time period or whatever kind of thing. You know what I mean? There's obviously, everybody's persona. I'm like, wait, I've been saying persona for a long time too. But then eventually when I was going through Chrono Trigger popped up and I was like, oh right. I saw you tweet about this. And I was like, okay, cool. And I was like, okay, cool.",
            "start": 586.36
        },
        {
            "text": "a long time too. But then eventually when I was going through Chrono Trigger popped up and I was like, oh right. I saw you tweet about this. And I was like, okay, cool. And I was like, okay, cool. So I got that jumped in, not at all deep into it. Maybe an hour, hour and a half. You know, I got the frog, we're going through a door. I just opened up off the organ. Pretty stoked about it. What's on the other side, but I'm enjoying it. You know what I mean? And that was the thing of like, I think I might be just in that mindset where that's going to scratch the itch the way it's supposed to. Because if you remember in the lead up to grandia two, not grandia two, I apologize. We get into right coming out on vdpe. Jared Petty was hyping me up for it. Everything said something so great. And then I got it, played it and just it's like, oh, okay, cool. And put it down and never got back to it. You know what I mean? And so now I feel like I'm in that thing because there's still a couple more",
            "start": 621.24
        },
        {
            "text": "I got it, played it and just it's like, oh, okay, cool. And put it down and never got back to it. You know what I mean? And so now I feel like I'm in that thing because there's still a couple more travel situations coming up or I'll be on planes going around and seeing Christine's folks and stuff where sitting there with this game on mute and making my choices, new in battle sounds like it'll be perfect. So I'm looking forward to that as my game on the go. That's exciting. I'm excited to hear what you have to say about it. The end. Good game. Don't spoil it for me. I won't. I'm going to get into time travel again. I'm not, I can't, I can't be trapped this far in the past. I'm gonna get out of it. I'm gonna get out for sure. You know what I'm saying? Yeah, I've been playing a lot of battlefront just like here and there. Pick up. Yeah. I just think it's fun. Like it's totally not that much content, whatever. I'm loving it. And like, uh, my roommate loves it too. And like, he would just",
            "start": 660.56
        },
        {
            "text": "just like here and there. Pick up. Yeah. I just think it's fun. Like it's totally not that much content, whatever. I'm loving it. And like, uh, my roommate loves it too. And like, he would just keep trading off like matches just playing and like, oh, you're not doing like split screen together. No, we tried. And I mean, it's cool, but it's, you know, with the game like this where it is so much about the graphics and the like the look and the feel and stuff like having it one screen really. It's nice. Gotcha. So we're just trading off on that. Um, the, the biggest thing though is I tried playing the walking dead telltale games for the first time. So recently I got really into to walking dead all because of Greg after years, but also my girlfriend who randomly started watching the show, which makes no sense, but she got really into it. She loves good TV. So I read, I read all the comics. I'm caught up on that. I'm like, I should play these games like at this point, like I should go back",
            "start": 693.08
        },
        {
            "text": "makes no sense, but she got really into it. She loves good TV. So I read, I read all the comics. I'm caught up on that. I'm like, I should play these games like at this point, like I should go back and do it. I played the game of throne game on a for telltale, but I did walking dead. So I tried playing with her, but I wanted to have it that she plays. So I didn't want to touch the controller at all. Just have her do it. Um, cause she'd never plays games. I've never played a game ever. And except for like mobile ship and oh my God, that experience, she loves it. Like we only played one and a half episodes. That took like four hours though. It took so long to the point that it was like, oh my God, it's frustrating. But like even now she's like, I can't wait to come back and play. That's awesome. Like she's really sure I'm thinking about it. What happens to Clem? I want to know what happens to Clem. Like this is great. Um, but it's just funny cause like seeing a gamer or seeing someone",
            "start": 731.82
        },
        {
            "text": "Like she's really sure I'm thinking about it. What happens to Clem? I want to know what happens to Clem. Like this is great. Um, but it's just funny cause like seeing a gamer or seeing someone that doesn't play games play games is like, there's certain things like, how do you not get this? How does this not make sense? But you're like, oh well it just doesn't make sense cause they don't know what the fuck they're doing. But it's like she'll get the movement down. But then the camera it's like for those doing audio listens, he's joking around. It's it's really, it's slow and jerky and it's like every single. Chance that a zombie attacks her to that could kill her. Yeah, it's over multiple times. And it's like, it's funny watching it like, oh man, she gets super into it and like super like every single choice. She's just like the things that means the world. Does she pause it or does she like actually make the choice before it expires? Oh, you can pause it. Yeah. You could hit like",
            "start": 774.68
        },
        {
            "text": "every single choice. She's just like the things that means the world. Does she pause it or does she like actually make the choice before it expires? Oh, you can pause it. Yeah. You could hit like PlayStation button or hit start I think even to pause it and then be like, oh man, what are we going to do? Oh yeah, no, no, no. I mean that would explain that to her. Probably break her brain. Well no, it's, it's, it's like part of the fun, right? Is the meter counting down? I hate this guy, but what do I do? What do I say? Yeah, it's, it's cool though, but I've been really enjoying that. Um, and then I dabbled in the rise of the Tomb Raider. Ah, this topic is about, oh, well I'm not done. Yeah. I came back from Chicago in my V to escapades, played rise of the Tomb Raider, beat rise of the Tomb Raider last night. Then I jumped into just cause three, oh, play some of that. And then, or actually reverse those in this order. Not that it all matters to you. Uh, we jumped in and did more of the",
            "start": 812.32
        },
        {
            "text": "Raider last night. Then I jumped into just cause three, oh, play some of that. And then, or actually reverse those in this order. Not that it all matters to you. Uh, we jumped in and did more of the Arkham night DLC. There you go. Sorry. You had a real busy fucking time. I did. Well, I came home and then it was like, I got to play rise of the Tomb Raider and I was also ready just to chill out and be left alone. Not that I didn't enjoy home, but you know, you got to talk to people. But it's like Saturday and Sunday pretty much played rise Tomb Raider as much as I wanted to beat it last night. And then I was like, cool, now I can get just cause three in so I can have some talk about today. You just cause three did that normal bullshit where you put it in. It's like, I'm loading it up. You're like, oh great, it's loaded up. You go and it's like, oh no, I got installed. I'm like, I just want to play something. So I popped out and did the Catwoman Robin mission in Arkham night and then",
            "start": 849.72
        },
        {
            "text": "like, oh great, it's loaded up. You go and it's like, oh no, I got installed. I'm like, I just want to play something. So I popped out and did the Catwoman Robin mission in Arkham night and then went in and started chipping away at like the car challenges that have been DLC added in the combat rooms that have been added. No, I want those trophies. I don't like, I hate calling a family on this one. High five preemptively. I hate when you have the platinum trophy, but then they add the DLC and it drops like now you have 76 percent, but you have the platinum that can't stand. Yeah. No. Yeah. Damn, that's some shady shit. That's a good move to get me to go back. Except for DC universe online where I have like the platinum in 15 percent of the trophies because I've added so many goddamn trophies. Um, all right, so the topic for today is rise of the Tomb Raider. I want you to give your, your thoughts and impressions on it. Now people keep getting super upset about the way these videos are",
            "start": 883.88
        },
        {
            "text": "Um, all right, so the topic for today is rise of the Tomb Raider. I want you to give your, your thoughts and impressions on it. Now people keep getting super upset about the way these videos are headlined where they're like the, the, I saw today. Don't be click baby. And we keep getting that back. It's uh, why you need to play blank game. Right? I saw the backlash. I heard, I hear you. I totally get it. So I changed it to why you should play instead of need to cause need I get a little aggressive and like people if they're going to be upset about it, really all it means is it's us discussing you may want to play why you may or may not enjoy rise of the Tomb Raider. That's the thing is like people just getting super upset and it's like, you know what? Trigger warning. We're going to give you an opinion on this game. Right? So I'm trying to adapt and trying to find something that like works. So from now on, for now I'm going to try doing, should I play Tomb Raider? Okay. Won't they,",
            "start": 920.16
        },
        {
            "text": "you an opinion on this game. Right? So I'm trying to adapt and trying to find something that like works. So from now on, for now I'm going to try doing, should I play Tomb Raider? Okay. Won't they, will that be accused of being click baby as well? I don't care. I mean, that's what I'm saying. Well, no, I think it's just part of like when at what point do we just bite down and say, we're kind of funny. All right, let's let's here we go. Collins off leash. Let's talk about all these in the cat house and the cat house. The battlefront, I was really confused. I went back and I just yesterday I looked at the battlefront YouTube video that we did or whatever for, you know, for this show and you know, like a three to one like to dislike ratio, which is pretty low high. I think it's the worst that we've ever. Yeah. And I was like, okay, people are basing this there. You can't ignore a lot of this Tim, because it's a lot of bullshit in the sense that like anyone who actually listened to the",
            "start": 961.8
        },
        {
            "text": "we've ever. Yeah. And I was like, okay, people are basing this there. You can't ignore a lot of this Tim, because it's a lot of bullshit in the sense that like anyone who actually listened to the video knew that like I was not impressed at all with what I've seen in the game and that I think it's a waste and all this kind of stuff. So people that were, when you read a lot of the comments, you can just really tell who actually watched the headline, clicked on it. I totally get that. You know, like I'm not, I'm not them change. I'm not basing that just off the Star Wars thing. I'm basing it also off all of the, this has been an ongoing process. Yeah, it is. But, but you have to understand this is, you know, it's a small group of people complaining about things and you know, I'm just saying you got to kind of title this one rise of the tomb Raider game of the year. Nip slip free iPhone. Ooh, I like that. I like that a lot. Yeah, I don't know. I'm just saying I'm letting you guys pay",
            "start": 1004.88
        },
        {
            "text": "you got to kind of title this one rise of the tomb Raider game of the year. Nip slip free iPhone. Ooh, I like that. I like that a lot. Yeah, I don't know. I'm just saying I'm letting you guys pay attention to this stuff and like I get it. Um, but yeah, it's one of those things of just like it's again, when I title it, why you should play this. Yeah, you were talking down about it. We were also talking about what we did like about it. I'm not saying it's a perfect game and that's why we're not saying review because we're not like, it's just saying, here's the things we like about these games. But well, I think what I'm saying is that it's, there is a balanced discussion about it. The comments I think we're like completely out of control on that video and we're quite indicative of a group of people that didn't watch the video and I'm sure the analytics will play that out too. So, um, so I'm just throwing that out there cause I was quite disappointed actually with the response on that",
            "start": 1037.04
        },
        {
            "text": "of people that didn't watch the video and I'm sure the analytics will play that out too. So, um, so I'm just throwing that out there cause I was quite disappointed actually with the response on that video just in the sense of like, what's wrong with everybody? Like why can't, first of all, why can't you embrace it? Why can't you like, why does it, why does it have to be so cool to, to hate a certain game? I think Battlefront is super underwhelming from a, you know, that's why I've not messed around with it in the sense that it's, I want to play a campaign. I want to do all these things, but I don't care if people enjoy it. It's the same thing. I'll shit on clash of clans all day. But if you enjoy the game even more, you know, whatever you want to do is fine with me. I just don't understand why people get, get off on, well, someone likes this game, therefore thumbs down, therefore angry comment and therefore paid off. Yeah. Yay. Yay totally paid us for that Battlefront, that",
            "start": 1080.68
        },
        {
            "text": "understand why people get, get off on, well, someone likes this game, therefore thumbs down, therefore angry comment and therefore paid off. Yeah. Yay. Yay totally paid us for that Battlefront, that Battlefront video in which I told, I said it was a half baked casual game that is missing all these things that I want. Yeah. They were, they really got some bang for their buck on that video. We'll see the real trick is they paid us all to argue about if dead space one or two is better. They drum it back up so that people buy dead space three, get it through that 6 million mark, make a dead space four. Oh my God. So lots of layers to this, but Tomb Raider, I played and beat rise of the tomb Raider. Really enjoyed it here at the end of it. Now, now that credits have rolled and everything else, I feel like it is very much the same deal with the original tomb Raider game. You know, reboot, you know what I'm saying here? The PS four. Yeah. X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X,",
            "start": 1109.12
        },
        {
            "text": "I feel like it is very much the same deal with the original tomb Raider game. You know, reboot, you know what I'm saying here? The PS four. Yeah. X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, X, PS3, Xbox 360, and then PS4 and Xbox One. I'm assuming, okay, sure, whatever. He's from the last game, you know what I mean? I played and loved the last game and don't remember this dude. And I have a feeling, like, right now, if you're asking me, how does, what happens in the first Tomb Raider, right? They get stranded, the island's all fucked up, and there's like a ghost at the end that does something. I don't recall",
            "start": 1147.6
        },
        {
            "text": "if you're asking me, how does, what happens in the first Tomb Raider, right? They get stranded, the island's all fucked up, and there's like a ghost at the end that does something. I don't recall what her deal was, but there's a ghost that does something. Am I wrong? You know it? You get to the end and there's a ghost or whatever, and you put her back in her trap and everybody's happy. I don't, okay, whatever. And I have a feeling if you ask me a year from now what this Tomb Raider is, I'll be able to give you more of like, well, it was this guy that and it was this. I can give you all of that, but they're doing this whole thing where they're like, there's this overarching group of bad guys, organization that's clearly gonna be the next game, and it's like, I just like exploring shit. You know what I mean? The best parts of, and that all sounded a little bit negative, I know. The best parts of Rise of the Tomb Raider are just exploring and hunting and upgrading and going. Combat is in",
            "start": 1202.08
        },
        {
            "text": "know what I mean? The best parts of, and that all sounded a little bit negative, I know. The best parts of Rise of the Tomb Raider are just exploring and hunting and upgrading and going. Combat is in its strong suit, I don't feel like, and they don't shove it down your throat until the end. At the end, they do the traditional video game bullshit of like, all right, you just gotta get up, there's one last peak, so you're gonna go down this linear hallway and there'll be three waves of increasingly harder enemies, then you'll get here, there'll be a boss fight where a harder enemy is just like, all right, guys, this is not why I like this game. You know what I mean? Everything up until here has been fantastic. The biggest disappointment for me, and this is one of those things of, this is a meta-disappointment, right? Is the fact that it's not on PS4, because this is a game I would have platinumed. I don't care, I don't know what my achievement score is, that doesn't do anything for me,",
            "start": 1242.24
        },
        {
            "text": "meta-disappointment, right? Is the fact that it's not on PS4, because this is a game I would have platinumed. I don't care, I don't know what my achievement score is, that doesn't do anything for me, right? So I'm not gonna 1,000% this. If this was a PS4 game, now that I've beaten it and rolled credits, I would totally go back, find the other tombs, upgrade all my weapons, da da da da da, get more out of that game. And that's just a Greg. That's a brutal thing, but. That's a Greg Miller block, not a knock against the game block, you know what I mean? So if you're into that, that's great. But the way it ends then, it does end for me with that bad taste in my mouth. Like, ah, that helicopter fight, that was kind of frustrating. Why was it like that, and why did this happen? But that aside, that tiny little bit at the end, everything else is so much fun to go do. You know what I mean? It's exactly what I loved about Tomb Raider Expanded. In the, all right, cool, I've killed this thing,",
            "start": 1285.4
        },
        {
            "text": "that tiny little bit at the end, everything else is so much fun to go do. You know what I mean? It's exactly what I loved about Tomb Raider Expanded. In the, all right, cool, I've killed this thing, I've got this pelt, so now I'm gonna do this, and then, ooh, I'm so much closer to getting more arrows. I just have to go out and find this exotic beast and do this, that, and the other. It's fun, it's great, you know what I mean? Yeah, I mean, my favorite thing about it is that it's more Uncharted-style gameplay, and I don't think enough games do that, and it's especially not well. You know, we got third-person action games and shooter games, but that's kind of its own mini-genre, where it's like this linear-ish, story-based thing where every single moment, the character looks like it's about to die. Like, it's never just things are slightly bad. That pulp adventure, as they say. Yeah, exactly. They jump across the cliff, and the mountain behind them explodes. Of course they're gonna fall",
            "start": 1323.38
        },
        {
            "text": "to die. Like, it's never just things are slightly bad. That pulp adventure, as they say. Yeah, exactly. They jump across the cliff, and the mountain behind them explodes. Of course they're gonna fall and slide down. And it's that moment-to-moment, pulse-pounding, there is no sense of pacing. It is just go, go, go, go, go, go, go. And I love that, and I like that it is more, and I feel like you can't take those comparisons too far, though, because they are different games. It's not like, you can, because I've seen a lot of people saying, oh, this is better Uncharted. It's way different than Uncharted, you know what I mean? And that's the thing of, like I'm saying, my favorite parts are when you get to a new base camp and you're going through and unlocking these areas, and then, it was like an RPG where there's the side quests around you, right? Like, here's my main objective, but this guy's giving me something, so I'm gonna do that, and now this has opened up these new points of",
            "start": 1363.42
        },
        {
            "text": "like an RPG where there's the side quests around you, right? Like, here's my main objective, but this guy's giving me something, so I'm gonna do that, and now this has opened up these new points of interest, so I'm gonna go do, and they did this thing where it was like, I was 100%ing each, the first three or four areas before I was like, okay, I'm on a roll now of this story, where I'm just like, nope, I'm here, great. Let's get everything here, and that's not Uncharted. You know, Uncharted is point A to B, C to D. Yeah, I mean, I personally enjoy that type of gameplay a bit more. It's more my pacing and style. Sure, but you can ignore that here. Oh yeah, no, for sure, and that's the cool thing. I remember in Uncharted 2, there's the moment when you get to the village. I thought I was gonna start doing that. I thought we were gonna get things, and I'm happy it didn't. Excuse me, sir, can you find more of my chickens? Like, nah, I gotta get out of here. But the game's beautiful. Like,",
            "start": 1404.22
        },
        {
            "text": "start doing that. I thought we were gonna get things, and I'm happy it didn't. Excuse me, sir, can you find more of my chickens? Like, nah, I gotta get out of here. But the game's beautiful. Like, that's something that I'm just like, it's like, holy shit, they are pushing things with this, and it very much excites me. But what's weird for me, and Colin pointed out too, so I'm not crazy, is the fact that the game is beautiful, and it's moment to moment gameplay's stunning. The cut scenes don't run well. The cut scenes pop up, and they're like, framey, and they're not done in engine, which is weird. You know what I mean? And like, if you watch The Last of Us or something, like, you see just the same models moving in and out, so it's fine, whereas here, they try to do more in the cut scenes, which make it look worse overall, which is a really weird thing. That's interesting. I didn't really notice that, but I mean, thinking about it, that does make sense. Like, next time you're in a cut",
            "start": 1440.62
        },
        {
            "text": "which make it look worse overall, which is a really weird thing. That's interesting. I didn't really notice that, but I mean, thinking about it, that does make sense. Like, next time you're in a cut scene, just watch the way they move and animate. Unless it's my Xbox dying, it's framey. I mean, no, it's one of those things that didn't stand out to me, but when you say that, I'm like, that's right. Yeah, yeah, yeah, yeah. The one thing that I really, really dug, and I imagine this is a design choice that they were behind and understood at Crystal Dynamics, is that in Tomb Raider, you start this thing, Lara wasn't meant for this life, this wasn't what she was out to set to do, and kill people, right? So she is scared, cowering, a little bit shaken, all this different stuff. That is non-existent in this game. Like, she is for, oh yeah, right. I survived the island with the fucking weird ghost. I'm out to fucking murder people if I have to, you know what I mean? And that's where I liked",
            "start": 1477.7
        },
        {
            "text": "in this game. Like, she is for, oh yeah, right. I survived the island with the fucking weird ghost. I'm out to fucking murder people if I have to, you know what I mean? And that's where I liked the combat more in this one, because I felt like, up until the end, there was a lot less Uncharted gameplay of slammed up against a rock shooting people. It was like, I move into an area, and if I want, I can go in guns blazing, or I can really be stealthy. And I was stealthy every time, and I'd go through and choke people out, and kill them, and poison arrow people, and all this different stuff. And it was like, I felt powerful. I felt like I was, they were in my world now. And even later on in the story, you overhear a conversation, it's not part of the story, if you listen to guards and let them talk, you overhear a conversation of, there's this one guard, and they're like, is this your first time working on one of these operations? And he's like, no, I was actually on this island a while",
            "start": 1515.3
        },
        {
            "text": "talk, you overhear a conversation of, there's this one guard, and they're like, is this your first time working on one of these operations? And he's like, no, I was actually on this island a while back where the Croft woman was, and I don't know how she got out of that alive. And it's like, yeah, right, fuck, I have history. You know what I mean? And people should be scared of me. Well, what's cool about that is, and I got this feeling, but you talking about the secret organization, or whatever, really drives it home, where the franchise now kind of reminds me of James Bond, where it's the Daniel Craig James Bond movies, where it's like, you're not really expected to know what happened in the previous one. They'll tell you what you need to know. And there is, oh, there's this bigger thing out there. But it's more just, have fun. Just go, it's about the character. And it's also similar that Daniel Craig in Casino Royale was becoming James Bond in the same way that Laura is becoming",
            "start": 1554.82
        },
        {
            "text": "out there. But it's more just, have fun. Just go, it's about the character. And it's also similar that Daniel Craig in Casino Royale was becoming James Bond in the same way that Laura is becoming Laura Croft. And now this is kind of the more, I wouldn't say Quantum of Solace, but I would say more like the Skyfall of it. That's cool. Yeah, and that's the one, it's weird for me that it's like the inverse of what I normally think of when I think of a game and character progression, where the game would tell me through the cut scenes and the story that she's getting stronger and da da da da da, and this is what's happening. Whereas now the story is there, but even your motivations are a bit shaky, I think, where you get to the end, and no spoilers, there's no choice to be made, but like Laura has a choice in her cut scene, you know what I mean, for her to make. And she makes the one choice, and it's like, okay, does that affect me more, should it affect me less, I don't know. You know",
            "start": 1587.1
        },
        {
            "text": "has a choice in her cut scene, you know what I mean, for her to make. And she makes the one choice, and it's like, okay, does that affect me more, should it affect me less, I don't know. You know what I mean? Like I don't really, whatever, cool, you did what you had to do kind of thing. Whereas like, I feel like from playing, playing as her in the game and seeing the way people are afraid of her and how I took her in, and she never ever was like, oh my god, what am I gonna do? You know what I mean? There's so many bad guys, which is like, all right, cool. And just fucking choking people, yeah, stabbing people. So the tombs were kind of one of the big selling points of this game going into it, like do you think that they lived up to the hype and were they fun? They were fun, yes. I guess what's the hype? When people were saying there was gonna be tombs in this game, and again, this is the luxury we have, right, where I was radio silent on this, I didn't wanna know about it. I'm like,",
            "start": 1628.84
        },
        {
            "text": "what's the hype? When people were saying there was gonna be tombs in this game, and again, this is the luxury we have, right, where I was radio silent on this, I didn't wanna know about it. I'm like, oh, more Tomb Raider or totally in? We went and did two Let's Plays with them, right? I wasn't on one of them, and the one we went to, we showed up late, we played a little bit to get the controls, and then we did that one area. And I was like, oh, this is a really cool hub world. Jumping into the tombs, I was expecting them to, I feel like when I'm thinking of tombs, like the way I was thinking we were getting into, I was thinking like Assassin's Creed II-ish, where you'd find the secret areas to go in to get better armor or whatever, and it kinda went on a little bit too long. I always felt like they were fun and it was cool, and I would do that, again, clear the map before I went on the mission. I was expecting these to be too long. These are, I thought, really tidbits. They're smaller",
            "start": 1662.44
        },
        {
            "text": "like they were fun and it was cool, and I would do that, again, clear the map before I went on the mission. I was expecting these to be too long. These are, I thought, really tidbits. They're smaller than I thought they'd be, you know what I mean? I thought these tombs would be something that I'd jump into and be there for 45 minutes trying to be off on my side. It's not that at all, it's like 20. And you get in there and it's logical where you should go and what you should do. I think back to original Tomb Raider, and I'm talking about now fucking really pointy Lara Croft, and I remember playing that game and getting to puzzles and being like, what the fuck do they want me to do? That never happened here, you know what I mean? Which I like, I like the fact that this kind of action game. They remind me of the Prince of Persia games two gens ago. My God, I can't believe they're not lasting. Sands of Time? Yeah, that trilogy where it's like you enter the room, the camera kind of swoops",
            "start": 1696.84
        },
        {
            "text": "They remind me of the Prince of Persia games two gens ago. My God, I can't believe they're not lasting. Sands of Time? Yeah, that trilogy where it's like you enter the room, the camera kind of swoops around and shows you where you're supposed to go. So it's less of a puzzle and more of like, here's what you're doing, figure it out. And I enjoy that more. One of my biggest critiques of Uncharted is I don't like the puzzles. I think they're a little too, just like they're unnecessarily complicated and way too simple at the same time. Whereas these, I'm like, I like this. This is just, it's fun to do. Exactly, I'll agree with that. Back to your point, I don't hate Uncharted puzzles, but I do understand what you're talking about where you're like this, you're barreling down a hill and then there's this hard stop of like, what the fuck do I do here? Move these things around, twist that, and this is not that. This is you walk in, it's like, all right, platform over there, do this thing,",
            "start": 1733.84
        },
        {
            "text": "there's this hard stop of like, what the fuck do I do here? Move these things around, twist that, and this is not that. This is you walk in, it's like, all right, platform over there, do this thing, slam that into the ice block, then try to, how do I balance the weight here? Oh, okay, da da da da. There's action to the puzzles, if that makes sense. But they were fun, no. But for me, it was like, it totally nails, I always talked about it with the original Tomb Raider, the fact that it nails being a video game. It's unabashedly a video game. You kill something and you get the nuts and bolts and you're like, okay, whatever, I got resources and I get to build something better. Same thing here, except now I feel like it's even more of a video game where you hit the pause button, it's like, here's all the shit you have to collect, here's how much of it you've collected, here's where it is, if you get that. So I was walking in and everywhere I'd go, every corner I'd turn, I'd be like, boom,",
            "start": 1770.68
        },
        {
            "text": "all the shit you have to collect, here's how much of it you've collected, here's where it is, if you get that. So I was walking in and everywhere I'd go, every corner I'd turn, I'd be like, boom, Survivor Sense. And see what glows yellow and then try to go get it and investigate and then come back to base camp, like what did I need to build something? Oh, right, there it is. Did you like the Survivor Sense thing? I did, yeah. I thought, I think it's, you know, I remember when it first got put in the last Tomb Raider and it was one of those things where people were like, what is that, blah, blah, blah, and it was like, oh, cool. And here it's the same way and I feel like there's more to collect, there's more to do it felt like, there was more to build out and stuff. My one knock, I guess, is that when I was getting the skill points, which at the end just come like fucking water, I'd get to a thing and I had a five ready to put in. When you were doing it, tier one and two skill points,",
            "start": 1807.12
        },
        {
            "text": "is that when I was getting the skill points, which at the end just come like fucking water, I'd get to a thing and I had a five ready to put in. When you were doing it, tier one and two skill points, I feel like after I put in the first five, I was kind of like, yeah, the rest of these suck. You know what I mean? I didn't really pay attention to the fact that putting more in than would unlock the third one. I was like, oh, whatever, these all suck. I wasn't going down to see what three was, where three is where it's like, oh, that's really cool. So for anybody at home getting ready to play this, make sure you go and investigate tier three and then just dump the skill points into whatever you need to get to three on whatever one you want to go to. Because once you did that, I was like, oh, awesome. Now I'm even more badass where I don't even have to aim my arrows, I just pull them up and zoom in and it automatically locks the heads and shit. I was like, oh great, okay, cool. Any",
            "start": 1841.2
        },
        {
            "text": "oh, awesome. Now I'm even more badass where I don't even have to aim my arrows, I just pull them up and zoom in and it automatically locks the heads and shit. I was like, oh great, okay, cool. Any closing thoughts on it? A lot of fun, you know what I mean? I, Colin came out early and was watching me play it and stuff, he's like, well, how is it? I'm like, it's climbing my list of games. I would say it's in my top 10 for the year, for sure. I think it's, some people were talking to me online about it after I was like, I beat it in a game of the year, for sure, and I was like, an argument could be made. I don't think it's mine. I think it's definitely in the running for like my favorite games of the year. Tons of fun with it. Like I said, I think the points I need to give it are the fact that I would have easily sat there and platinumed it, you know what I mean? Like I would have sat there like I did with Fallout or like I tried with Metal Gear, where I would have come back and done",
            "start": 1876.76
        },
        {
            "text": "that I would have easily sat there and platinumed it, you know what I mean? Like I would have sat there like I did with Fallout or like I tried with Metal Gear, where I would have come back and done more and more with it. Like there is more game there than I played and I enjoyed what I played. Cool. Second topic of the day, why are games so broken? Colin, I'm gonna let you kind of like lay out the land for this one. Yeah, I think that we've hit somewhat of a critical mass with the nature of the way games are being launched and the acceptance in gaming society is aware that this is kind of the new status quo. And this is disturbing to me and it's different than the way games used to be released. Now, games used to be released in a vacuum. If a game was broken in any way, then a game was broken forever. And there are examples of games even back on, back a long ways that were fundamentally broken or ways that you could break them fundamentally. And there were clever workarounds to make",
            "start": 1913.96
        },
        {
            "text": "forever. And there are examples of games even back on, back a long ways that were fundamentally broken or ways that you could break them fundamentally. And there were clever workarounds to make sure that you were never stuck in a game or anything like that. Mega Man 1 always comes to mind and Wile's Castle, there's a place where you could conceivably get stuck unless you realize you could go back down a ladder and get more energy that you can then use to try again or whatever. So there's like these little workarounds that make a lot of sense, but now we have games that are just busted in fundamental ways when they're launched and it's just becoming concerning to me, especially in conjunction with increasingly unreasonable season passes that are launched in conjunction with games, as well as the fact that I keep arguing that games are cheaper than ever and they are, even at $60, they're way cheaper than they used to be in real money, but are games also not more ambitious yet launched",
            "start": 1961.8
        },
        {
            "text": "as the fact that I keep arguing that games are cheaper than ever and they are, even at $60, they're way cheaper than they used to be in real money, but are games also not more ambitious yet launched in a more unsavory state almost over and over again? And what reminded me of this was just reading about Just Cause 3 before I even put it in my own machine to play it, about how fucked up it was for a lot of people. And I'm like- Give me a recap. I've seen a lot of tweets about it, people complaining. For me, it was the initial load was really long. Yeah, the load times are absurd. People were just having a lot of technical, I don't know if it was Digital Foundry or something, just having like significant dips in frame rate, like really bad consistent frame rate, memory leaking, and like a lot of different kinds of things that I'm like, what, how can you possibly launch games in this state? It reminds me of Arkham Knight with on PC. I'm like, how can you possibly release this and expect",
            "start": 2004.96
        },
        {
            "text": "of different kinds of things that I'm like, what, how can you possibly launch games in this state? It reminds me of Arkham Knight with on PC. I'm like, how can you possibly release this and expect anyone to believe that there was no inclination anywhere in your QA team or at your studio that the game was fucking broken? And I think that, I don't know if it's the developer's fault as much as it's the publisher's, it's unclear because we're not there, but I just, for every game that's launched and it works fine and there are no patches or no necessarily patches, I think of even a game like Until Dawn works, right? But for every game like that, there's a Just Cause or there's an Arkham Knight or there's a, and I'm like, maybe we're becoming a little too lax as a community with accepting day one patches and accepting games going gold when they're not ready and publishers being really beholden and their developers being really beholden to these release dates and launching games that are",
            "start": 2048.04
        },
        {
            "text": "one patches and accepting games going gold when they're not ready and publishers being really beholden and their developers being really beholden to these release dates and launching games that are just not in a good state. And it's disturbing to me and it turns me off a little bit now when combined with, again, the very greedy nature of season passes and the very kind of suspect nature of why games aren't delayed more and why there's so much shame in taking a little bit more time or why a company has to crunch to go gold and then crunch again to get a patch ready for day one. Why is that acceptable to us? Look at, Tony Hawk's a great example of this. The rumor was that they were gonna lose their license and they had to get the game out, but people paid for that. And they just launched a seven gigabyte or something patch for it. I mean, there was the day one seven gig patch and now there's another seven gig patch that has a bunch of updates and shit. But that's like, at this point,",
            "start": 2093.04
        },
        {
            "text": "a seven gigabyte or something patch for it. I mean, there was the day one seven gig patch and now there's another seven gig patch that has a bunch of updates and shit. But that's like, at this point, they're just like, what can we give you? So now you can be Ninja Turtles, which is cool. So to me, it's a bit of a rambling kind of complaint, but I know a lot of people out there probably feel what I'm saying. It's- I think everybody does. Yeah. We should expect more and I don't think we're getting quality products anymore on a technical level without bogging down our hard drives with 20 gigabytes worth of updates for games. And it's just insane to me. And it goes, it's not like, it's becoming a bigger phenomenon but it's not necessarily a recent phenomenon. I used to kid around about how you couldn't even fit Killzone on Vita with like an eight gigabyte memory card or something like that. Like there was so many patch, the patch I think was bigger than the game. That's true. And I'm",
            "start": 2142.56
        },
        {
            "text": "you couldn't even fit Killzone on Vita with like an eight gigabyte memory card or something like that. Like there was so many patch, the patch I think was bigger than the game. That's true. And I'm like, what's going on? Why are we, this wasn't possible back in the day, so it didn't happen. Now it's possible and it happens all the time. And I would rather it be the exception to the rule than the rule. And that's what's happening is that, I go through my games sometimes and I just click the options button and I look at the details. And I was going through my cross media bar or whatever on PS4. And I was like, the only game on here that doesn't have a patch is Mega Man Legacy Collection. A series of games released in the 80s and 90s that there's no reason to patch, because they work fine with the exception of some slowdown and stuff. So, but then you go through like Witcher and you're like, Jesus Christ, how many updates are gonna be on this game or Arkham Knight or anything like that.",
            "start": 2185.08
        },
        {
            "text": "the exception of some slowdown and stuff. So, but then you go through like Witcher and you're like, Jesus Christ, how many updates are gonna be on this game or Arkham Knight or anything like that. And I'm like, yeah, it's just, it's disappointing to me. I think those are different things though. You know, like updates to games aren't bad. It's the required updates and the- To make it work. Yeah, exactly. Cause Witcher stuff was, and I'm sure I'm wrong. I'm sure there's been- Witcher stuff since has been the add things, they've tweaked comments, but the early patches were not for that. And the early patches for any game are not for that. The early patches for the game are to be like, fuck, everything's fucked up. How big were the Witcher patches? I mean like Batman of course was like for sure, obviously. But size isn't really relevant either. It's the nature, like, why can't we expect that, why can't we expect that a game is going to work when it launches? Unless it's a Nintendo game.",
            "start": 2225.62
        },
        {
            "text": "obviously. But size isn't really relevant either. It's the nature, like, why can't we expect that, why can't we expect that a game is going to work when it launches? Unless it's a Nintendo game. There's always a problem. Yeah, Nintendo is the one, you know, we brought up other M before, which was the only game that really bit him in the ass during the patchless period, but they can patch their games now. And there just seems to be not a problem a lot of attention paid to, I don't wanna say quality, because I don't know if that's necessarily, these games are fun. It's just that there's not a lot of attention paid to like finishing the game. You know, like it's like, what state can the game get in? Let's get it on a disc. And then you put it on your machine and then PSN or Xbox Live will send essential updates to your machine that should have just been on the disc to begin with. And I used to kind of fight against this. I really come around on a lot of this stuff at watching the nature",
            "start": 2264.14
        },
        {
            "text": "essential updates to your machine that should have just been on the disc to begin with. And I used to kind of fight against this. I really come around on a lot of this stuff at watching the nature of the evolution of the industry back in the day, I'm like day one DLCs, I still don't have a problem with DLC per se, but day one DLC, not a big deal. Season passes, don't buy them if you don't like them and stuff, but now you see things like with Arkham Knight's season pass, which I know Greg likes, but is completely ridiculous to me. And like the passes that are worth more than the game and like a game like Battlefront, getting all of this content, like that you have to pay extra for when the disc is kind of barren. And I'm like, you know, I understand why people are upset and it's starting to upset me and I don't even fucking play half these games. So I just wanted to bring that up. I mean, so what are the big perpetrators of this? Obviously we have Assassin's Creed, what was it called?",
            "start": 2309.86
        },
        {
            "text": "upset me and I don't even fucking play half these games. So I just wanted to bring that up. I mean, so what are the big perpetrators of this? Obviously we have Assassin's Creed, what was it called? Syndicate? Oh no, Unity. Unity, yeah. There was Unity, there was Master Chief collection. So you're talking about what are broken games? Yeah, like what are the big ones? Cause like we got Tony Hawk, we got PC Batman, and then now we're hearing about Just Cause, but is the Just Cause in the same realm as all those other ones? Cause those sounded bad. This just sounds like there's technical problems here and there. Yeah, I don't know. I mean, I heard that the game was in pretty bad shape on consoles. It was fine on PC, but I heard the game was in pretty bad shape on consoles. I think that, well, you're naming the perpetrators and their big perpetrator, Drive Club, was fucking busted. You know what I mean? Busted. Just totally busted. Master Chief collection busted, did not work. And then",
            "start": 2345.34
        },
        {
            "text": "you're naming the perpetrators and their big perpetrator, Drive Club, was fucking busted. You know what I mean? Busted. Just totally busted. Master Chief collection busted, did not work. And then people run to the stores and buy 343's next game, or are gonna buy Evolution's next game and not remember that Evolution got another year to work on Drive Club. It was supposed to be a PS4 launch game, they released it a year later, and the game was fucking broken. And everyone's like, well, video games. And I'm like, no, no, no, no. Like we should expect way more, because when Naughty Dog releases Uncharted 4, I bet you it's gonna work. I mean, that's one of the studios that I think is gonna like release a game, or Gears 4, I have confidence that maybe this game is gonna be fine on its own. But for every one of these games, I understand the fatigue out there about this issue, because I think that it's a little bit distressing. We grew up, we're not young, and we grew up in an era where games",
            "start": 2385.92
        },
        {
            "text": "every one of these games, I understand the fatigue out there about this issue, because I think that it's a little bit distressing. We grew up, we're not young, and we grew up in an era where games had to work, and they might not have been as ambitious. Some of them were. Like Grand Theft Auto 3 is an ambitious game on PS2. We came out in 2001 and it fucking worked. Yeah. I mean, that's the interesting thing, is it's like you're bringing up the ambition. A game like Just Cause 3, I'm willing to, to an extent, like be like, all right, there's gonna be some technical problems and stuff, because it's fucking crazy. It's like you can do whatever the fuck you want and attach this to this and tether things and blow shit up or whatever. It's like, all right, as long as it works, and like, well, I'm into it. But it's like, that only goes so far. You know, and for these games where it just straight up doesn't work, that's not good. No, I do think that we're just starting to find that, we're",
            "start": 2431.56
        },
        {
            "text": "I'm into it. But it's like, that only goes so far. You know, and for these games where it just straight up doesn't work, that's not good. No, I do think that we're just starting to find that, we're starting to find ourselves in between a rock and a hard place, I think, with publishers, where the expectation is that we're just gonna deal with it. Mm-hmm. Real quick now, to your point, where you're talking about people rushing to buy 343's games, da da da, we did see Assassin's Creed Syndicate dip this year on day one, and people did attribute that to the fact that Unity was so fucked up that people wanted to see what happened. We did, and Halo's numbers dipped too. The, you know, to the point where GameStop in their financials said how like Halo 5 sales and Battlefront sales, I think, were unimpressive, or like didn't reach expectations. So people are starting to learn, but it doesn't, these are little like dents in the armor, right? Sure. They're not, 343's game was profitable, and I",
            "start": 2471.02
        },
        {
            "text": "unimpressive, or like didn't reach expectations. So people are starting to learn, but it doesn't, these are little like dents in the armor, right? Sure. They're not, 343's game was profitable, and I don't wish anything against 343. It was just an example of, or Assassin's Creed, where it's just an example of like, are we rushing games? Are we expecting too many games too soon? Are we, it's not the gamer's fault. That's the only thing that I know for sure, is it's not the gamer's fault, because they've been trained to expect an Assassin's Creed every year. They've been trained to expect that they're gonna get a Halo game that really works. They've been trained to expect, well, DICE really botched their last game, but they, this is a great example, like, but Battlefront, or Battlefield, the last Battlefield was fucking broken too. And for some people, it was broken like in perpetuity. I remember people talking about that, like that it's not fixed for some people at the time, that I was",
            "start": 2508.44
        },
        {
            "text": "last Battlefield was fucking broken too. And for some people, it was broken like in perpetuity. I remember people talking about that, like that it's not fixed for some people at the time, that I was still bitching about it, which was a while ago. But there's a short memory in the industry that I think we have to buck, and I think that the gamer has to understand that they deserve and are worth more than continuing to give $60 to publishers that release these games in half-assed states, and then just patch and patch and patch and patch until the game works, and I start to understand the kind of the mentality on NeoGap, and in some places where it's like, I'll just wait till the game's 20 or $30, like fuck this shit, you know? And that's a mentality with a lot of people where they're like, they don't buy anything. Yeah, wait for the game of the year. Yeah, they literally don't buy shit when it comes out. And I'm like, man, how can you resist playing blah, blah, blah, but then you",
            "start": 2549.0
        },
        {
            "text": "like, they don't buy anything. Yeah, wait for the game of the year. Yeah, they literally don't buy shit when it comes out. And I'm like, man, how can you resist playing blah, blah, blah, but then you understand, well, when you play a game like Fallout 4, which you should expect is gonna have a lot of problems, because that's kind of Bethesda's MO, and their game is huge, and there's a lot of different ways it can break, and all of that kind of stuff, and I don't really hold that against them, because I do think their games are quite ambitious. I think that they're kind of the exception to the rule. You can't really blame a person for saying like, well, everyone that bought Fallout 4, the 5 million people that bought it day one or whatever, you are all the QA testers, I'm gonna sit back and wait three months, I'll buy the game for half the price you paid for it, it's gonna work a lot better than when you played it. And it's like, yeah, that makes a lot of sense. So Just Cause was one",
            "start": 2583.92
        },
        {
            "text": "wait three months, I'll buy the game for half the price you paid for it, it's gonna work a lot better than when you played it. And it's like, yeah, that makes a lot of sense. So Just Cause was one of those games that just brought that up in me, where I was like, you know, just reading about it, I haven't played the game nearly enough to have experienced anything myself, but when people are complaining, like when there's explosions, and a lot of shit going on on screen, which is what Just Cause is all about, and then the game just halts, you know? I'm like, well, that's a fucking problem, isn't it? Yeah? I just wanted to bring that up. It was something I approached you about, because I know a lot of our viewers out there are really quite passionate about this as well, and I think that it's like putting weight, it's like encumbering someone over and over again with a lot of bullshit. Well, yeah, the season pass kind of sucks, but you'll buy it, and like, yeah, the game doesn't really",
            "start": 2610.48
        },
        {
            "text": "like putting weight, it's like encumbering someone over and over again with a lot of bullshit. Well, yeah, the season pass kind of sucks, but you'll buy it, and like, yeah, the game doesn't really work very well, but give us like a couple months, and we'll fix it for you maybe, and oh, this game ate your save? Well, sorry about that, and oh, this game runs at 15 frames a second sometimes? Well, my apologies for that, and oh, the servers are down for a month on this game? Well, you know, we tried our best. We did our two-week-before-launch beta to try things out, and it's just like, after a while, I look around, I'm like, you know what, fuck this. You know, like I'm becoming one of those guys where I'm like, you know, almost like very Jim Sterling, like I have a lot of respect for the game, because you've been saying this shit for a long time. Do you think that online has made things worse rather than better? Because what you're talking about with like saves getting eaten stuff, like",
            "start": 2646.76
        },
        {
            "text": "because you've been saying this shit for a long time. Do you think that online has made things worse rather than better? Because what you're talking about with like saves getting eaten stuff, like that's not new. I remember when Killzone 2 would fucking reset for no reason, and I was almost general whatever the fuck. It's a pleasure warrior within. Right, it's unique. No, there were problems with the first Metal Gear, if I remember correctly too. Like there are games that you could fundamentally break back in the day, absolutely, and the internet allows those things to be patched and fixed to have a Metal Gear 5, Metal Gear Solid 5, where there were ways to break the game, and they had it really patchy, and we were talking about Other M, where like you had to send your memory card for your Wii U into Nintendo, like that, or for your Wii in Nintendo, so they could fix it. I'm like, well, that's not the ideal solution either. Has it made it worse? No, because the internet is a great",
            "start": 2690.66
        },
        {
            "text": "your Wii U into Nintendo, like that, or for your Wii in Nintendo, so they could fix it. I'm like, well, that's not the ideal solution either. Has it made it worse? No, because the internet is a great thing. It's a great disseminator of information. It's a great fixer of problems. The question becomes like, when is a game really done? Is a game always released now in beta? Is a game always now just launched and we have expectations that it will be broken? Why can't we put a game in that's supposed to run at 60 frames a second and it just runs at 60 frames a second and the online just works? I refuse to believe that these problems are as complicated as they seem. Like, we don't develop games and we have a lot of game developers that are out there, and I've talked to people about like, well, let me talk to you about why we patch and blah, blah, blah, and I'm like, I fucking know why you patch. The question is, why is the first patch you release not a massive update to the game, but a",
            "start": 2725.58
        },
        {
            "text": "let me talk to you about why we patch and blah, blah, blah, and I'm like, I fucking know why you patch. The question is, why is the first patch you release not a massive update to the game, but a patch that makes the game work? No. Do you think, I mean, from an outsider's perspective, right, it's gotta be from publishers. You have to assume so. There are millions of dollars invested in this PR and this date and now you gotta hit it. That's why you can't delay it, right? It was easier back in the day. Yeah, I feel bad for them. I feel bad for devs. We know a lot of them and they crunch and they work really hard and they don't see their fucking families. We know people that have gotten divorced because of fucking their jobs. We know people that have had family problems because of their jobs and all sorts of things. They put it all on the line. It's not their fault. I do think it is the publisher's fault, but there has to be an expectation that, literally the only thing that these",
            "start": 2761.5
        },
        {
            "text": "jobs and all sorts of things. They put it all on the line. It's not their fault. I do think it is the publisher's fault, but there has to be an expectation that, literally the only thing that these companies care about is money, that's it. I'm sorry, and that's fine, and that's capitalism and that's the way the market works. No one's making a game for altruistic reasons. They don't care about hurt feelings if you're going to buy the next game. You know what I mean? And I think that this is what I said about Mass Effect 3 and why Andromeda's gonna be this big hit because everyone's gonna forget. Everyone that was on their high horse about Mass Effect 3 and how bad it was will buy that next fucking Mass Effect game as sure as shit. It's because we don't have the fortitude. I don't have it. You don't have it, you don't have it. A lot of people out there don't have it. It's a company that really fucks you and they release a bad product and you see the name, like with Arkham Knight, you",
            "start": 2794.94
        },
        {
            "text": "You don't have it, you don't have it. A lot of people out there don't have it. It's a company that really fucks you and they release a bad product and you see the name, like with Arkham Knight, you bought Arkham Knight on PC, WB, and then a few months later, Mad Max comes out, which is a great game, and a game that actually works pretty well, in my opinion, and you see WB on it again, and you're like, well, I'll buy it. You know, it's just as an example. So I think that we just have to look at, we have to find a new way to look at the industry and look at the way the games are being released and demand more because it's becoming a bit of a joke in my mind. The exception of the rule is now when a game works. And that's a bad place to be. That is the straw that broke the camel's back for me. When I look around and I'm like, okay, all these big releases launched and maybe half of them don't work right, and that's not good. That's just not good for the industry. That's not good for",
            "start": 2833.36
        },
        {
            "text": "for me. When I look around and I'm like, okay, all these big releases launched and maybe half of them don't work right, and that's not good. That's just not good for the industry. That's not good for gamers. That's not good for the platform holders. It's not good for the publishers. It's not good for the developers, but if the status quo has remained and the money keeps flowing in, then you just get the same shit over and over again. And maybe Syndicate selling poorly, or not poorly, but selling worse than Unity will send a message like, maybe we don't need an Assassin's Creed game next year. No, that won't happen. Why don't you relax? It's the same thing with Watch Dogs. Watch Dogs was in bad shape. Watch Dogs launched and it was underwhelming to a lot of people. I played it for a few hours and I'm like, oh, I'm done. And maybe that was definitely something where I was like, let's go dark again. I'm sure that they wanted Watch Dogs 2 out way quicker. So there are signals in the",
            "start": 2873.26
        },
        {
            "text": "hours and I'm like, oh, I'm done. And maybe that was definitely something where I was like, let's go dark again. I'm sure that they wanted Watch Dogs 2 out way quicker. So there are signals in the ether, as it were, but I still think that we need to demand more. And this is where I think the indie games and the salvation that a lot of these games kind of give gamers that really like playing games, because a lot of these games do work. Yeah, but that's like the opposite side of the spectrum, right? Where how many indie games do we know that have been talked about for years and just don't come out? Because now they don't have anybody on their back to make another day. And I'm not saying that's better or worse, whatever. I'm just saying they have the opposite problem, right? Where Jonathan Blow and the Witness are like, it'll be done when it's done. And it just keeps going. Yeah, I mean- Where the fuck is Bastion Vita? God damn it. Yeah, I mean, there's a point to be made there and I",
            "start": 2912.3
        },
        {
            "text": "Blow and the Witness are like, it'll be done when it's done. And it just keeps going. Yeah, I mean- Where the fuck is Bastion Vita? God damn it. Yeah, I mean, there's a point to be made there and I think you have a good point. But I also think that I don't have a concern that when Bastion comes to Vita, that it's not gonna work. Sure, no, I'm with you. When Axiom Verge comes to Vita or Volume comes to Vita, that these games aren't gonna work. And I think that we just, and there are developers that launch games from big publishers, like Housemarque's games work. I'm not saying that these are as ambitious as a Naughty Dog game or a 343 game or an Eidos game. Be fair and set the record straight. Dead Nation did not work either time when it came out. With for us. That's true. That's a great point. There was a game breaking bug in both of those games if you had a maxed out friends list. Much like Tetris Ultimate at the moment. Which should be fundamental in the QA packages to these",
            "start": 2954.84
        },
        {
            "text": "great point. There was a game breaking bug in both of those games if you had a maxed out friends list. Much like Tetris Ultimate at the moment. Which should be fundamental in the QA packages to these companies. I don't know why they don't test these things. Like just have a module on PS3 debug or test units that just occupies your friends list. Nonetheless, yeah, it's just a little bit of a rant. I wanted to have a little bit of a rant. I like it. You're allowed to do that. Big fan of that. Because I just, I feel a fatigue amongst our people that's growing and growing and growing. And it's hitting critical mass, I think with a lot of people. And I certainly have observed it. I'm certainly feeling it myself as someone who just, it's like I feel like we talk about the Second Amendment sometimes, right? And they're like, why are you so passionate about the Second Amendment? And I'm like, I don't know. I don't even own a gun. I just feel like I can look at this from an outside perspective",
            "start": 2991.28
        },
        {
            "text": "right? And they're like, why are you so passionate about the Second Amendment? And I'm like, I don't know. I don't even own a gun. I just feel like I can look at this from an outside perspective and give you some insight onto it. And it's the same thing with this. It's like, well, why do you care about Arkham Knight? Why do you care about the Arkham Knight season pass? You played the fucking game and you're gonna play it again. I'm like, because I feel for you. And so it's a similar thing where I'm just observing a lot of this stuff from the outside. And I'm like, well, this doesn't seem right to me. It doesn't seem like people are being taken care of anymore the way they used to be. And you can understand why a lot of people are just upset at publishers all the time. And why I kind of respect when a game like Deus Ex or Mirrors Edge, or I think it was Mirrors Edge, where these games are delayed. Sometimes indefinitely, but Deus Ex getting a six month delay means that that game",
            "start": 3037.64
        },
        {
            "text": "of respect when a game like Deus Ex or Mirrors Edge, or I think it was Mirrors Edge, where these games are delayed. Sometimes indefinitely, but Deus Ex getting a six month delay means that that game might've been, there might've been something wrong with it. And they know that and they can identify that a patch is not gonna fix it. And I wish that if we came to Uncharted is gonna come out apparently in March, I don't believe it. If they get to like mid February and they're like, listen, we really can't hit the date. They can get away with it, I'm sure. But everyone needs to have the courage to say like, the financial courage and the fortitude to say, it's not ready to go. And so I just wanted to talk about that real quick, but I don't know if it makes sense to anyone out there. No, it does. It makes a lot of sense. I feel for you guys, because I'm feeling it too. My only concern sometimes is that you amplify it. You know what I mean? You talk about people not having the fortitude to",
            "start": 3071.34
        },
        {
            "text": "It makes a lot of sense. I feel for you guys, because I'm feeling it too. My only concern sometimes is that you amplify it. You know what I mean? You talk about people not having the fortitude to boycott Andromica. Andromica, how you doing? Let's go to Andronicos. I think it could also sway the other way, that it's just like the outrage over three is really just internet hyperbole. You know what I mean? That's true. You talk about nobody having the fortitude, right? I didn't buy a Dreamcast. I was like, I'm finally done after the Saturn, right? Like those situations do happen. And granted, that was a different time, but there is so much. Well, that was me with Wii U. Yeah, there is so much hyperbole on the internet. Sure. I sometimes worry that when you're like, I feel you, I hear you, it is just the people who are sitting there, like, I'm not gonna be able to do that. It is just the people who are saying it to say it. Cause either everything is the best thing ever, it's the worst",
            "start": 3112.78
        },
        {
            "text": "it is just the people who are sitting there, like, I'm not gonna be able to do that. It is just the people who are saying it to say it. Cause either everything is the best thing ever, it's the worst thing ever, cause that's the internet. Yeah, there's a little gray area, but that's a little different. That example, and I think you're right. That example, it's the same thing I did with Nintendo. You did with Dreamcast. I did buy a Dreamcast 9999, but I don't regret a minute of it, but I didn't have the Saturn, which was abysmal. So yeah, you're right in that sense, but I admit fully that I don't have the fortitude either. So it's a problem that is endemic to all of us, I think, as consumers of video games, as, video games isn't a passive thing. It's something that someone does with money. You buy, buy, buy, and you play, and you play, play, play, and you buy, buy, buy again. And that's the way it goes. That's the cycle of any market like this, any entertainment market. And so when I",
            "start": 3151.94
        },
        {
            "text": "You buy, buy, buy, and you play, and you play, play, play, and you buy, buy, buy again. And that's the way it goes. That's the cycle of any market like this, any entertainment market. And so when I was really mad at Capcom for canceling Legends 3, or really more Mega Man universe than other of these games, well, I bought Mega Man Legacy Collection. I was all over that fucking game. I was excited about it. So I get it. So I totally get it. Yeah, but does that show then what your anger or outrage was? There's checks and balances. I think of the scales. And so yeah, you're mad at Capcom. How do you express that? You know what I mean? Is it a letter to them? Is it a boycott in the game? And then it really comes down to how angry you are. It reminds me of what's necessary for big political lifts. You need to hold hands at some point and sacrifice something you love or something that you care about in order to affect change. And it's hard to do that. It's really hard to do that. I'm not",
            "start": 3198.44
        },
        {
            "text": "lifts. You need to hold hands at some point and sacrifice something you love or something that you care about in order to affect change. And it's hard to do that. It's really hard to do that. I'm not saying what I'm talking about is a heavy political lift. We don't see many of those anymore because we don't have politicians with any balls. But what I am saying is that for us to make change, we have to look into ourselves and be like, well, maybe we are the part of the problem too. And that to affect change requires broad consensus about how to move forward in terms of dealing with games that are broken and dealing with publishers that you can't trust or dealing with developers that just don't release good games. But we are inherently selfish with our own desires to play. And so it conflicts with the political will, as it were, to make those changes. And I'm as guilty as anyone. You know, but I'm making an observation that I think is quite prescient about where we are right now. And I",
            "start": 3239.78
        },
        {
            "text": "with the political will, as it were, to make those changes. And I'm as guilty as anyone. You know, but I'm making an observation that I think is quite prescient about where we are right now. And I hope people out there, like it resonates with some people out there. Because I agree with you, like, yeah, the Mass Effect example might be a small minority, but it's not a small minority of people that are gonna put just cause in according to whatever videos I saw and whatever chatter's going on and are not gonna have problems. But will they remember that? Yeah, that's the question. Ladies and gentlemen, that topic, brought to you by Tipsy Elves. Kevin, I need some props. Can you get me the props? Kevin was super prepared for this. So Tipsy Elves is- What, I'm not allowed to insult you? Get out of here, you sticky bandit. I asked him about it. Yeah, and he said, yes, I do. No, he didn't. I did. He said, I don't fucking, I have no clue. No, I said, I need them to show not to wear. Anyways,",
            "start": 3291.88
        },
        {
            "text": "of here, you sticky bandit. I asked him about it. Yeah, and he said, yes, I do. No, he didn't. I did. He said, I don't fucking, I have no clue. No, I said, I need them to show not to wear. Anyways, so this right here, Christmas holiday sweaters. They're awesome. This one, Greg Miller's. That's mine. Yes, we got the Baller Santa slash, what is it? What's going on down there, Greg? Centaur. We got mine. The beautiful deers making that sweet, sweet sex. Making that sweet, sweet sex. We got Colin Moriarty's gingerbread man, Ninja Turtles. Big fan, big fan. And of course we got my personal favorite, Nick Scarpino's Feliz Navi dog. It's a dog. Now, Colin, can you tell me what this is? Shark Tank. And who is on Shark Tank? The people that made these sweaters? Yeah, I couldn't believe it. I was back in Chicago watching Shark Tank and Tipsy Elves came out. I was like, what the hell? That's what's really cool. So they were on Shark Tank and it was successful and all that. So here they are now",
            "start": 3336.04
        },
        {
            "text": "back in Chicago watching Shark Tank and Tipsy Elves came out. I was like, what the hell? That's what's really cool. So they were on Shark Tank and it was successful and all that. So here they are now sending us sweaters and stuff. If you guys are looking for Christmas and holiday sweaters, not even Christmas, holiday sweaters, they also have like college apparel and all that stuff. And they have a, just like, they have a bunch of official merchandise from the new movie with Seth Rogen that's coming out from the night before. Yeah, night before, I think. Yeah, pretty funny. Funny sweaters and all that stuff. You should definitely check it out. Go to tipsyelves.com and enter code KindaFunnyGames to get 20% off site-wide. Pretty cool. They also have college things. Yeah, college. A lot of kids have been sending me Mizzou. They have a Mizzou sweater. I was like, damn. Yeah, they have a bunch of weird stuff. What are you gonna say? Tim just said that. But he didn't say the Mizzou",
            "start": 3400.74
        },
        {
            "text": "lot of kids have been sending me Mizzou. They have a Mizzou sweater. I was like, damn. Yeah, they have a bunch of weird stuff. What are you gonna say? Tim just said that. But he didn't say the Mizzou sweatshirt. That's what I wanna point out. They do have Mizzou sweatshirts. They also have onesies. They have really cool onesies. Are you gonna get a onesies? I was talking to them about onesies. So you said holiday. Do they have anything for my Jewish friends out there? They do. They actually, I mean, those are nights before. I would love like a Star David or a Menorah sweater. They had those on Shark Tank. Yeah? Yeah. I would love to get a- It's like, it's a bad-ass, it's a big-ass star on it. I like to rep Israel. Yeah. Cool. Again, guys, tipsyelves.com. Tipsyelves.com and use the code KINDOFUNNYGAMES to get 20% off site-wide. All right, third topic of the day. We get a lot of questions about this. And I actually personally wanna know your guys' thoughts on this. How to professionally",
            "start": 3439.38
        },
        {
            "text": "to get 20% off site-wide. All right, third topic of the day. We get a lot of questions about this. And I actually personally wanna know your guys' thoughts on this. How to professionally review games. Because a lot of people out there, you know, they have their thoughts on how games are reviewed and this or that. And everyone has their own, there's not a right or wrong answer to any of this. It is all just, it's opinion. That's what the point of this is. But you guys professionally reviewed games. Right. How did you go about it? What's the difference between how you feel about it versus somewhere like an IGN? How has that changed over the years? How do you review games that are, you know, consistently like online worlds and all that stuff? How has that changed? It's constantly changing. And that's the problem. Not the problem, but for this question and why people get so offended about it. I feel like to go back to it for me, there was a moment in time at IGN where we had been on the",
            "start": 3478.54
        },
        {
            "text": "And that's the problem. Not the problem, but for this question and why people get so offended about it. I feel like to go back to it for me, there was a moment in time at IGN where we had been on the 100 point scale, which meant, you know, you're 7.1, you're 7.2, you're 7. We moved to the 20 point scale, which meant 7.0, 7.5, eight, so on. And then we decided to, and I say we, IGN decided to move back to the 100 point scale. And I fought valiantly in my own mind to not have that happen. And my problem was, and this is where I think we get down to the problem with video game reviews, is the fact that the 100 point scale to me meant that this was scientific. That this was, there was a rubric that we all did and you'd sit down and you'd put in these numbers here, there, and you'd come to this score. You know what I mean? Whereas I always thought the 20 point scale, now known as the Oriaration Scale, was better because it would be like, this game's a 7.0, this game's a 7.5, and you can",
            "start": 3524.6
        },
        {
            "text": "score. You know what I mean? Whereas I always thought the 20 point scale, now known as the Oriaration Scale, was better because it would be like, this game's a 7.0, this game's a 7.5, and you can then put those into buckets and then argue about why this 7.5's better than this 7.5, or da da da, if that's what you want to do, which is fucking weird, but that's what the internet wants to do, right? But for me, when I first started at IGN, and it was 100 point scale, right, I, there's a distinct, I hope I don't fuck this up, I don't think I will, there's a distinct sect where, okay yeah, I reviewed Uncharted, Drake's Fortune, gave it a nine. I reviewed Infamous and gave it a 9.1, and then I reviewed Arkham Asylum, and I think gave it a 9.2 or a 9.3, but I think for sake of argument, 9.2, right? And the way I came to those scores was, I thought these games were amazing, and I think Infamous was a little bit better than Uncharted 1, and Batman was better than both, like that was how I did",
            "start": 3567.78
        },
        {
            "text": "And the way I came to those scores was, I thought these games were amazing, and I think Infamous was a little bit better than Uncharted 1, and Batman was better than both, like that was how I did it. Now that didn't cross over to Eric Rudvig when he was reviewing, he wasn't paying any attention to what I did as far as the points, whatever. Damon Hatfield's on the record as only ever giving point zeros or point fives, you know what I mean? Like that was like this thing that you went through and did, and it was just how you came down to it, because it, I mean like, of course you talk about, like night and day differences where IGN is now, or at least when we left IGN, God only knows what they're doing now, versus where it was when I started, because I always tell the story of when I first started, wrote my first review, finished it, walked over to Roper and I was like, hey Roper, my review's done, he goes, all right, publish it. And I was like, do you want to read it? Is there a proof,",
            "start": 3614.54
        },
        {
            "text": "wrote my first review, finished it, walked over to Roper and I was like, hey Roper, my review's done, he goes, all right, publish it. And I was like, do you want to read it? Is there a proof, is there a copy editor? And he's like, no, I just put it up, I'm sure you read it, and I was like, oh fucking Jesus, coming out of a newspaper where everything was like, it was like four gatekeepers before anything even got remotely to the front page, it was like crazy. And IGN, not that way anymore, right? Dan Stapleton now in charge of reviews, at least when we left, he still is, but when we left, it went to him, this one happened. So that's the thing is like, we were at IGN long enough to see it change, change, and change, and then by the time Colin and I were getting ready to leave, right, I feel like we were so done with scores, because like for me, the way I scored games was, I'd finish a game and in the beginning, I would take notes here and there or whatever, blah, blah, and then I found",
            "start": 3652.0
        },
        {
            "text": "like we were so done with scores, because like for me, the way I scored games was, I'd finish a game and in the beginning, I would take notes here and there or whatever, blah, blah, and then I found myself never referencing the notes. And so I stopped doing that. And so I would review games and sit down and what, I would sit there and go, all right, what was the best moment, what was the most important thing, what's my takeaway, and then start the review there and go down. You know what I mean? What's the big thing, what's my big idea about this review and go from there and tell you that thing. And so, you know, as we, that evolved and everything else, and I feel like it was more embraced at the company to talk about what your opinion is, you know what I mean, this, that, and the other. You started getting it where I wasn't telling you how many multiplayer maps were in it or how many characters were supported or da, da, da, da, da. And there'd be comments asking for that. And it was",
            "start": 3692.02
        },
        {
            "text": "You started getting it where I wasn't telling you how many multiplayer maps were in it or how many characters were supported or da, da, da, da, da. And there'd be comments asking for that. And it was always like, I get that, but there's 12 other reviews out there right now at Embargo that are telling you that, you know what I mean? Like, I'm going to go in this direction and do that. And sometimes it was well-received and sometimes it was Dead Space 2, and that's how it was, you know what I mean? And it's this interesting point of, I guess, convergence right now, I feel like, where as we were breaking away and then broke away, right, like, I think everyone was starting to wrap their head around what a personality was and how this works and what is a critic and how this, you know, da, da, da. And so now people watch our reviews, right, and like, well, when we put something up, like my Metal Gear review, it was just me ranting at the camera for 30 minutes, no score or anything. And",
            "start": 3734.96
        },
        {
            "text": "da, da. And so now people watch our reviews, right, and like, well, when we put something up, like my Metal Gear review, it was just me ranting at the camera for 30 minutes, no score or anything. And they're okay with that because they finally understand that they can go elsewhere and do it. And for me, it's just, again, the industry and us as fans aging, right, and the fact that now when I got to IGN, right, my examples for reviews were EGM and there are multiple opinions, IGN, GameSpot, GamePro, and Fun Factor, and like, you know what I mean? It was numbers, whereas now so much of it's video that it is opinions. So I think we're in a better spot. It's evolved to that point, and I think people get it in a way that like, cool, Greg and Collin won't agree about every game, but I know that I'm more in Collin's camp because he likes games X, Y, and Z, but I know I agreed with Greg about action adventure games, so you know what I mean? You can take that kind of information away from it,",
            "start": 3772.32
        },
        {
            "text": "I'm more in Collin's camp because he likes games X, Y, and Z, but I know I agreed with Greg about action adventure games, so you know what I mean? You can take that kind of information away from it, if that makes sense. Yeah. Okay, that was ranting, sorry. That was great. Collin. I think one of the things that Greg didn't touch on, because I think we have a lot of the same opinions on this, I mean, first of all, review scores are fucking stupid. I just want to reiterate that. Numbering reviews is fucking stupid, and I don't understand why anyone does it, and I don't understand why anyone would like it or why they would want it. The problem with it is that reviews need to be read through the lens of subjectivity, and when there's no cross-referencing of scales between outlets, the numbers become meaningless, the meta critic becomes meaningless. When Giant Bomb gives something three stars, that isn't a six, you know what I mean? And that's not a six on IGN, and so when you fuse all",
            "start": 3812.44
        },
        {
            "text": "become meaningless, the meta critic becomes meaningless. When Giant Bomb gives something three stars, that isn't a six, you know what I mean? And that's not a six on IGN, and so when you fuse all these numbers again, you're like, well, blah, blah, blah, gave this game a seven, and blah, blah, blah, gave this game an eight, and I'm like, they might actually feel, the guy that gave the game an eight might even fucking like the game less than the guy that gave it a seven. You know, a Eurogamer, for instance, is notorious for really low scores, but their scoring rubric seems to be way more reasonable. When they give a game a six, it doesn't mean they hate it. You know what I mean? So I- That's something we always worried about at IGN, right, or people would be, that we weren't exploring the scale. You know what I mean? That everything was a seven, five, or above, and yeah, that eventually eights or whatever, and I remember when Dan came in, he was like, I want nines to be harder to",
            "start": 3856.04
        },
        {
            "text": "the scale. You know what I mean? That everything was a seven, five, or above, and yeah, that eventually eights or whatever, and I remember when Dan came in, he was like, I want nines to be harder to obtain. Let's talk about what that means, and stuff like that. But yeah, if you gave IGN a game a five, that didn't mean it's average, it's run of the mill. Like, the word was meh. And like, for me, that was always the thing. I didn't like the scores, so I would sit there and go, what did I think of this game? I did, I think it was outstanding, amazing, good, you know, what I meant, all these different things. But like, yeah, saying a game's men, it's a five, means, oh my god, it's so close to being bad. You know what I mean? It's like, well, it's also close to being good. Like, you're now, we're boiling it down to where it's like, that's too easy. That scale's too small. Yeah, I think that it's just, the only thing you can take away from reviews is what's said in the review itself. Like,",
            "start": 3890.34
        },
        {
            "text": "boiling it down to where it's like, that's too easy. That scale's too small. Yeah, I think that it's just, the only thing you can take away from reviews is what's said in the review itself. Like, the wording is so important, and the way people, there's no objective way to review a game because I always say, gameplay is king, and I mean it. I fucking mean it. You know what I mean? Unless there's something radically different about a specific game, like Journey, or something like that, the way the game feels to play, that's why we play games. And that's always most important to me. Greg might not agree. In fact, Greg might look at The Last of Us, which I gave a 10 to because of how it played and its narrative, and Greg might give it a 10 because of his narrative and then its gameplay. And those are two different reviews, even though they came to the same arbitrary number. So what I'm saying is that I think that some of the impetus has to be put on the outlets, but some of the impetus",
            "start": 3928.48
        },
        {
            "text": "those are two different reviews, even though they came to the same arbitrary number. So what I'm saying is that I think that some of the impetus has to be put on the outlets, but some of the impetus also has to be put on the desires of the consumer and the reader, and what they want. And we assume that they want scores, but I don't believe that if we trained their minds to think differently in a less reductive way that they wouldn't want to just sit there and have something a little more thoughtful put into these reviews, because ultimately it does not matter what you say as long as the numbers on the bottom, you can see those metrics pretty easily. But that's because that's just what we do. There is no other way to do it. You know what I mean? Well, I think this is people, I don't agree that if we changed it that it would change. Like I think that what we do is changing that and people are coming to us. But take it out of just video games. People like rating anything one to 10 or one",
            "start": 3970.02
        },
        {
            "text": "if we changed it that it would change. Like I think that what we do is changing that and people are coming to us. But take it out of just video games. People like rating anything one to 10 or one to five or one to 100, whatever it is, like grades even, you know, like you need that. Like that's the same shit with school. It's like our school's just not gonna grade you. Like that's- Well, no, I mean, because I think that there's, that's different in the sense that it doesn't matter what the other school's doing. You know what I mean? Like if you get an A 90 and an A minus at your school, then that matters in your district. And then maybe when you go to college, it might be a little different. But when you're saying like, okay, what's the Metacritic score of a game and the different weights of outlets or whatever. And then you realize like, you know, when one up used to give scores and they would give letter scores, whatever, then they had to be translated into numbers, but they were not",
            "start": 4006.62
        },
        {
            "text": "outlets or whatever. And then you realize like, you know, when one up used to give scores and they would give letter scores, whatever, then they had to be translated into numbers, but they were not equivalent or symmetrical with the intent behind the number or behind the letter all the time. There's just a major problem I think with scoring. Like the proof should be in the pudding. So read the fucking review. You know what I mean? That's like what I always say is like, you can't possibly know how a person feels just by boiling it down to a number. And I fought for a long time to get rid of scores when we were at IGN. It was a fight that I fought by myself, but it was something that I was like, you know, why don't we buck the trend and try something a little different here where we can focus on the content of the review just like we would focus on the content of the game. And you'll find much more enlightening things about a game when you just read what a person thinks about it. And",
            "start": 4046.48
        },
        {
            "text": "on the content of the review just like we would focus on the content of the game. And you'll find much more enlightening things about a game when you just read what a person thinks about it. And there's no score at the end. I would have loved to have been able to review The Last of Us and not put a score on it at all. Yeah. 10 made the most sense to me for the score, but I would have loved to just wrote 1500 words about why this game is so fucking fantastic and maybe some of its little problems and then let people make their own decisions because they might see, well, Colin really likes the narrative and that's what I'm really playing for. So I'm gonna play The Last of Us. And some people might be like, well, the multiplayer is really surprising and I didn't realize that and how is that reflected in the score? I have no fucking idea, but I don't even care about the content of the campaign. I wanna play the multiplayer. It sounds really good. I just think that a lot of nuance has been",
            "start": 4083.38
        },
        {
            "text": "in the score? I have no fucking idea, but I don't even care about the content of the campaign. I wanna play the multiplayer. It sounds really good. I just think that a lot of nuance has been lost. So I think that reviews are in a better place than they've been just in the sense that it's like an upside down pyramid. Reviews used to be like in gaming press in the 80s, very marketing heavy. Nintendo Power is a great example of that. None of us even knew for years. I mean, it was common knowledge, but as kids we didn't know Nintendo owned Nintendo Power. I mean, it's like- We didn't see the problems with it. Right, we didn't see the problems with it. And frankly, I'm not so sure that there were major problems with it. I remember them shitting on games all the time. It wasn't like they... But there was definitely a conflict of interest, but we didn't know. And then it kind of like got out, out and out. And then you got like the unofficial magazines. So you got like, well, you had an EGM",
            "start": 4118.6
        },
        {
            "text": "there was definitely a conflict of interest, but we didn't know. And then it kind of like got out, out and out. And then you got like the unofficial magazines. So you got like, well, you had an EGM and Game Pro and stuff, but PSN was really the first example of a magazine that I was really into, which came out in 97. When I was like, it was, I think September or August, 1997, their first issue around when Final Fantasy VII was coming out. And I remember being like, this is an unofficial, totally unabashed- They can say whatever they want. Yeah, and that's where we got. And then you've got the internet age and all that kind of stuff kind of concurrent to that. And then we've gotten to a place where like there are shitty fucking reviews out there for like every game, just like awful reviews. But there are really great reviews too. I think Jim Sterling's a great reviewer. I think that there are good reviewers at the big outlets. I think to the point of having a fair, reasonable scoring",
            "start": 4157.58
        },
        {
            "text": "But there are really great reviews too. I think Jim Sterling's a great reviewer. I think that there are good reviewers at the big outlets. I think to the point of having a fair, reasonable scoring rubric, I think GameSpot is one of the great outlets that does that. When a game gets a nine everywhere else, they give it a seven, but it's not really reflected. It just as an example, they don't always do that, but it's not really reflected in the score. That means something to them to give a game a nine. Maybe that's thrown around a little bit more somewhere else. But this is the problem with reviews and why like the words matter, not the numbers, because the words mean something. The words have fucking definitions. If a game is, runs at 30 frames a second and has a story that lasts 15 hours, well, that's a fact. If a game gets a nine, well, that doesn't mean anything to me. So that's kind of where I stand on reviewing. But I do think that it's both sides that there are problems with both",
            "start": 4192.68
        },
        {
            "text": "well, that's a fact. If a game gets a nine, well, that doesn't mean anything to me. So that's kind of where I stand on reviewing. But I do think that it's both sides that there are problems with both sides. There's a problem on the, because I agree with you in a sense that people like to score things and stuff, but I don't agree that if people had a different solution, which they don't, that they wouldn't like it better. You just have to give it to them. And it's not really been tried. Yeah, I mean, I just think it's one of those things where it's like, not to say that something else isn't better, because I mean, I agree with you. Like the written, that's why we do things the way we do. It's like, I like, I believe in talking and hearing things. I believe in writing and reading things. You know what I mean? What? I just love that quote. I believe in talking and hearing things. No, but that makes sense. I know it makes sense, but out of context, it's brilliant. Yeah, okay, well, in",
            "start": 4225.88
        },
        {
            "text": "You know what I mean? What? I just love that quote. I believe in talking and hearing things. No, but that makes sense. I know it makes sense, but out of context, it's brilliant. Yeah, okay, well, in context, it makes sense. I'm not that stupid. It's not that you wouldn't know. But the number scale, I think that it's not so much better than, it's just that people like that. And it makes sense, like across the board, even if you're totally right, nines are not equal. But to everybody, one to 10 means something. So my question going off that to you guys is, did you, when you were reviewing games, how would you let other, like all of this, all the shit that we just talked about affect your score? Like, would you think about what GameSpot's giving you? Oh no, you can't do that. Would you think about what anyone else at IGN would do? And that was the whole thing, is like, there's a Facebook group for, at least in our day, I think it's still going. Don't it still exist? Yeah, I'm sure. It's",
            "start": 4265.72
        },
        {
            "text": "about what anyone else at IGN would do? And that was the whole thing, is like, there's a Facebook group for, at least in our day, I think it's still going. Don't it still exist? Yeah, I'm sure. It's top secret. Yeah, where you can, like all these reviewers are together, right? And usually it's used for, hey, I'm stuck here. I don't want to be an idiot. And somebody's like, oh, I did this. Or hey, can we get a multiplayer match? Da da da. But like, if I was reviewing a game, I would avoid that like the plague. I didn't want to know what anybody else thought. I always loved the idea of coming out and seeing what everybody thought at once. To be clear, that group only really exists for that. Yeah. But I mean, I don't even want somebody to say, mission three is frustrating me right now. I don't want to know that. You know what I mean? If that makes sense. I'm not saying it's collusion in there, where they're like, I want to go with a nine. What are you guys doing? No, no, no, that doesn't",
            "start": 4307.52
        },
        {
            "text": "want to know that. You know what I mean? If that makes sense. I'm not saying it's collusion in there, where they're like, I want to go with a nine. What are you guys doing? No, no, no, that doesn't happen in there. But I've found that group very useful in the past for a couple of reasons that have helped people more often than not actually in there as well with like, I think the last game I even helped anyone in was like Metrico. So that was a while ago. But yeah, it was useful. It's like a way for reviewers to talk to each other without, you know, so they can, there's no walkthroughs, no one knows what the fuck's going on. So yeah, so I would approach a review, you know, you have to be thorough. You have to be fair. I was always so shocked about the propensity of some people to not finish a game or not, not necessarily finish a game, because I've reviewed games that I didn't finish if I played for like 40 hours or something like that. I'm like, all right, I'm good. But like where",
            "start": 4344.04
        },
        {
            "text": "a game or not, not necessarily finish a game, because I've reviewed games that I didn't finish if I played for like 40 hours or something like that. I'm like, all right, I'm good. But like where people just barely touch a game and then their trophies or their achievements are like, you know, people have gotten called out for that in the past. And that always shocked me that like, you have to give a game due diligence. It'd be very fair to be very thorough. You also have to be very fair to yourself though. Amy is a good example. Amy is the lowest score I ever gave a game. I gave it a two. And it's one of the worst games, if not the worst game I've ever played in my life. And my review is about how like I refuse to play anymore. But like the review is like, I'm done. Like I'm not playing this game anymore. It's fucking awful. Like I played it for however many hours. I can't get past this one part because it's not fair. Game fucking, the game's fucking trash. And I said that by the way,",
            "start": 4381.2
        },
        {
            "text": "game anymore. It's fucking awful. Like I played it for however many hours. I can't get past this one part because it's not fair. Game fucking, the game's fucking trash. And I said that by the way, in a very honest and forthright way to educate the consumer. And I had an opportunity set up already to interview the developers about the game and they canceled on me because the review was so fucking harsh. And I did that even though I knew that I was probably gonna piss people off but I didn't care because my loyalty and my job is to inform the reader. I don't really care how the publisher, the developer feels about anything I say to be perfectly honest with you. I still don't, if you haven't noticed. So I always approach the review in a way that's like, how can you boil this down into its essence to inform people about the things that are most important about it in the most honest way possible through your lens. That was always what was important to me too. Everyone's like, there's no",
            "start": 4412.0
        },
        {
            "text": "essence to inform people about the things that are most important about it in the most honest way possible through your lens. That was always what was important to me too. Everyone's like, there's no objectivity in anything. Someone can legitimately look at the last one and be like, I don't think this is a good looking game. And I think they would be crazy but it doesn't mean that what they have to say is invalid. So you have to embrace the subjectivity of a review and go all the way in on that. I think, I think, I think, I think, I think, I think. And that's why it was so frustrating when they didn't want us to speak in first person anymore at one point at IGN. Different editors, different review people come in and they change everything around. And that was hard for me. Cause then it started to be, for me when we talk about right now and where we're at right now and the fact that you know how Colin feels about this and Greg and this or Jim Sterling, you know to go read the reviews",
            "start": 4449.76
        },
        {
            "text": "to be, for me when we talk about right now and where we're at right now and the fact that you know how Colin feels about this and Greg and this or Jim Sterling, you know to go read the reviews and listen to that. I think back to when I used to read IGN reviews before I worked at IGN. And it was IGN gave this game whatever it was. And I think that is what it, to this day, that's what it is to majority of people out there. And that's so terrifying. You know what I mean? Cause how many times do we fight when we were at IGN? How many times do we fight now about what we think of a game? You know what I mean? I can't believe you think that. And I read Mitch's tweets about games and I'm like are you kidding me? That game is not nearly, you know what I mean? But for somebody to think like that's Bible truth. That's when I love the fact of infusing who you are, what it is, how it goes. You know what I mean? My example of that always is Naughty Bear, right? Where my opening paragraph's like",
            "start": 4487.24
        },
        {
            "text": "Bible truth. That's when I love the fact of infusing who you are, what it is, how it goes. You know what I mean? My example of that always is Naughty Bear, right? Where my opening paragraph's like I've only played this game for four hours but I don't need to play anymore to tell you it's awful. You know what I mean? Like I'm falling through the world, this happens, da da da. But again, it's to the point of that was my thesis for that review, right? Everything you're writing is a persuasive essay and I'm telling you my opinion. And sure, you can probably go to this other site and I'm sure somebody's platenated, gone through, get done all this stuff. That's not me. I'm telling you what happened with me and why I stopped playing. Naughty. No, naughty. And then those bad ass motherfuckers earned all my respect when they put out a game of the year edition for one of the worst games of the year. What a great idea for a game. Fuck yeah, go get them. That was one of my greatest, I actually",
            "start": 4519.8
        },
        {
            "text": "all my respect when they put out a game of the year edition for one of the worst games of the year. What a great idea for a game. Fuck yeah, go get them. That was one of my greatest, I actually really liked that game with all the shortcomings but my favorite thing was busting Greg's balls about it for years that I really loved it. It became a running joke. Yeah, so I just think that we have to figure out a way to review things better and we have to continue to evolve. Not we necessarily at this company but just everyone in generally. And then I think also the consumer has to accept that they might have to look at reviews a different way too. Because if we can just be a little more open minded about what a review is capable of and take them a little more seriously then lo and behold, you're gonna get way more out of them. The more reductive you wanna look at a review, the more reductive what you're gonna get out of the review is going to be. That's just math. I mean, you know what I",
            "start": 4555.6
        },
        {
            "text": "gonna get way more out of them. The more reductive you wanna look at a review, the more reductive what you're gonna get out of the review is going to be. That's just math. I mean, you know what I mean? If you take the time to read 2000 words about a game you really care about, you are going to get way more out of that review than if you just look at the score and you're not even really sure what the score means. But what if I look at the score and it's starkly different than somebody else's score so then I just go and attack that person? Yeah, I mean- That sounds great, right? That's the other thing and I always feel bad about that is we've all been the outlier, like all of us in the past. I think one of the games that I was the biggest outlier on was that Castlevania 3DS game which was fucking trash. And some people gave it like an eight and a nine and I gave it like a four. This game's awful. This game's like a wannabe Symphony of the Night with no soul, no interesting graphics, no",
            "start": 4589.76
        },
        {
            "text": "trash. And some people gave it like an eight and a nine and I gave it like a four. This game's awful. This game's like a wannabe Symphony of the Night with no soul, no interesting graphics, no interesting characters, nonsense. It got fucking destroyed for that review by Nintendo fans. But I still buy it, I still stand by it. Mine, I had to look up mine, the one that I think of all the time, right, is I Am Alive. Because I Am Alive, I played in- Where you could just, the guy will never attack you if you have the gun out. Wasn't that the weird- It was the post-apocalyptic black and white one. I know, didn't we do a video where it was like, you could pull the gun out, the guy will run at you and then you pull the gun out and you're miles away? You're getting to this AI cycle, it was really funny. And I remember being like, this game is bad. It was GDC, I think, right? It was definitely, I was going to a show or something and I was on the Muni and I was on there and I saw it go live on my",
            "start": 4619.86
        },
        {
            "text": "And I remember being like, this game is bad. It was GDC, I think, right? It was definitely, I was going to a show or something and I was on the Muni and I was on there and I saw it go live on my phone. I think I gave it a four or five if I just looked right on the Metacritic page there, pops up on Google. Yeah, four or five out of 10. Went into the tunnel, no service or whatever, came out, went right to work at GDC and hours later, checked my Twitter and it's just like, are you fucking crazy? And I'm like, what is going on? No one's even played this game. And then I looked around like GameSpot gave it an eight and all this stuff and I was like, oh. And then it's just one of those things of like, how awesome is it that people can take the same thing and have such different reactions and be so different to it? But of course, nobody wants it at the time. This is a game we've been excited for and this is it and I want to be justified in loving this game. So even though I don't know",
            "start": 4657.84
        },
        {
            "text": "and be so different to it? But of course, nobody wants it at the time. This is a game we've been excited for and this is it and I want to be justified in loving this game. So even though I don't know anything about it, fuck you. Dan Hsu gave Luigi's Mansion a four. I think it was a four and it broke my heart. Because the other two reviews were higher and I was like, you're wrong. I hadn't played it yet but I was like, you can't be right about this. You want me to text him right now, tell him? You should be like, dude, why'd you do that to Dan? I'd be like, who the fuck's Dan? It could have been the year of Luigi then. I like this topic a lot. I think there's more ways we can look at it, like comparing the different scales and the pros and cons of each one, if we were to go with numbers. Let us know in the comments what you'd want to hear from a part two of this or an addendum at some point in the future and we can review that. And this topic, brought to you by DraftKings. Football",
            "start": 4694.38
        },
        {
            "text": "Let us know in the comments what you'd want to hear from a part two of this or an addendum at some point in the future and we can review that. And this topic, brought to you by DraftKings. Football season marches on and while your season long fantasy team might be going nowhere fast, every week is a new shot for glory at DraftKings.com. DraftKings is the destination for one week fantasy football where you can relive the fantasy draft and play for huge prizes each and every week. Challenge your friends in a custom league or join an existing one to play for your share of the billion dollars in prizes up for grabs this year. Just pick your contest, draft your players and collect your winnings, that's it. Renew old rivalries or create new ones by going head to head with friends, colleagues and fantasy players from all around the country. DraftKings is crowning a new millionaire every week this season, you can be next, but only if you play. This isn't fantasy as usual, this is DraftKings.",
            "start": 4732.18
        },
        {
            "text": "fantasy players from all around the country. DraftKings is crowning a new millionaire every week this season, you can be next, but only if you play. This isn't fantasy as usual, this is DraftKings. Welcome to the big time, that is my favorite line. In this whole thing, every single time. Welcome to DraftKings.com, now use promo code KINDAFUNNY to play for free with your first deposit in Sunday's million dollar fantasy football contest. First place takes home 100 grand and a lifetime of bragging rights. Enter bang for free entry now, only at DraftKings.com. Bang, he's taken it to the house. Mike Kelly shout out. Final topic, as always, brought to you by the KINDAFUNNY forums. You can go to KINDAFUNNY.com slash gamescasttopic to submit your beautiful, beautiful topics for this beautiful, beautiful show. Your big, beautiful kids. Oh, your big, beautiful kids. So, I was going back and forth on which one we were gonna lead off with, but I kinda like this one based on the timing of this.",
            "start": 4772.72
        },
        {
            "text": "beautiful show. Your big, beautiful kids. Oh, your big, beautiful kids. So, I was going back and forth on which one we were gonna lead off with, but I kinda like this one based on the timing of this. This is from warsmachine. What's up dudes? Been a gamer for a long time, but one iconic game I've never played is Final Fantasy VII. Would this be best played on Vita? I currently have a PS4 slash PS3 slash Vita. Will playing Final Fantasy VII be enjoyable considering how gaming mechanics are today? So, pretty much, what's the best way to play Final Fantasy VII? I don't know, I mean, the PS4 one is imminent, so I don't know that I can write that one off. My prediction will know by the time anyone hears this, I think it'll be launched during PSX. Yeah, available now. But the trophies are live, so it's imminent. So, with that said, I think the PS1 classic is probably the best way to go, and you can play it probably on Vita. I think that that might be the best way to play it, but I don't",
            "start": 4815.68
        },
        {
            "text": "so it's imminent. So, with that said, I think the PS1 classic is probably the best way to go, and you can play it probably on Vita. I think that that might be the best way to play it, but I don't know if you wanna jump the gun on that until you wait and see what the PS4 one's all about. It'll be an identical kind of port, but you can play it on PC, you can play it on PS1 if you want to. There's like a bunch of different ways to play it, but I don't think you can really go wrong with the PS1 classic if you don't care about trophies. I don't think that there's a bad version of the game out there. I mean, even the PC one, it had its issues back in the day, but they kinda fixed that with stuff. So, personally, my favorite was playing on PSP back in the day with the PS1 classic, but it's the same thing as Vita. Yeah, absolutely. But yeah, you're right. I would wait until the PS4 one comes out and kinda see how that one shakes out, but I'm a little shocked that it's not coming to Vita as",
            "start": 4860.68
        },
        {
            "text": "same thing as Vita. Yeah, absolutely. But yeah, you're right. I would wait until the PS4 one comes out and kinda see how that one shakes out, but I'm a little shocked that it's not coming to Vita as well like with the trophies and all that stuff. Yeah, I'm not. I don't know what Square Enix is like. The funeral pyre of the Vita is going out to sea. It's about to launch in the flaming area. I don't know. I mean, it's disappointing, but that's more QA and more annoyances that they have to go through, like certification stuff. So, I think that they're trying to get this thing out. Well, they've been doing something for a year. They have, and there's a lot of rumors of what they've been doing. I mean, I was reading things that people feel like they translated it again. People think that there's more to this than possible, that it's not the straight PC port because some of the trophies are different. I don't know. I don't know the answers to any of these questions. I haven't seen any of",
            "start": 4897.16
        },
        {
            "text": "more to this than possible, that it's not the straight PC port because some of the trophies are different. I don't know. I don't know the answers to any of these questions. I haven't seen any of this. I didn't talk about the cross-dressing scene specifically. Yeah, well, that's gonna be in there because there is a cross-dressing trophy. Okay, cool. But there's some conjecture that this isn't all it seems. There's more than meets the eye here. That this might not be the PC port that, there's some word that with the PS2 emulation getting trophies like the Star Wars games basically being straight PS2 emulators that are running trophies, in the back end that maybe this is the PS1 classic getting trophies, stuff like that. But I don't know. I mean, it's just all conjecture. I don't know. It could just be a download. That's gonna be huge. I will say to his point about the game, the game holds up mechanically, I think just fine. I don't think the game graphically holds up at all. I wouldn't",
            "start": 4935.04
        },
        {
            "text": "just be a download. That's gonna be huge. I will say to his point about the game, the game holds up mechanically, I think just fine. I don't think the game graphically holds up at all. I wouldn't say that. I think that it's the character models. Yeah, the hand-drawn backgrounds. The backgrounds I think are beautiful to this day. We'll see. The resolution's gonna be low. We'll see how- Well, that's the thing. I'm talking about like playing it on the Vita. I think in that sense, it might be the best way to go. Yeah, we'll make it smaller. And then maybe it'd be too small then. I don't know. Yeah, it does run in 4.3. So I don't know. We're gonna find out what's going on with this. I'm excited. I'm interested to see like why this took so long. There was a reason why this took so long. So- I haven't even thought about that. That's really interesting. I hope it goes well. But I will say that regardless, you should play one of these before the remake. Don't wait for the remake. I think",
            "start": 4975.08
        },
        {
            "text": "I haven't even thought about that. That's really interesting. I hope it goes well. But I will say that regardless, you should play one of these before the remake. Don't wait for the remake. I think they're gonna be very different games. And yeah. You got all the time in the world. But I think that it's worth playing this version for sure. Yeah, and I think Seven's active time battle, it stands up. The Materia system I think is really clever. I think that the weapon accessory armor system is a little reductive, but the Materia system is a really nice system. It's almost as good, I think, as like the Esper system. So certainly better than some of the other things that have come after it. So I think Seven's a must play for RPG fans. I think that it's certainly not the best Final Fantasy game, but it's a classic. And it's a game that I've really come around on. Yeah. And I think it's a must play even for not RPG fans, maybe not to finish, but to at least try out and see. Because I do",
            "start": 5013.36
        },
        {
            "text": "game, but it's a classic. And it's a game that I've really come around on. Yeah. And I think it's a must play even for not RPG fans, maybe not to finish, but to at least try out and see. Because I do think that it's a good entry, I think more so than Final Fantasy VI. Yeah, VI is way more hardcore. If you're not an RPG person. VI is way more hardcore. It's also a seminal game, which I think is really important. It's a game that's, there's really only a few third party games that were as important as Final Fantasy VII was to the success of a piece of hardware. And that was the first big PlayStation game. Big, beautiful kids. Hun Sixpack says, hey guys, how long do you think the PSN will work on PS3? I have so many games still to play on that system. And I'm afraid that I'm going to lose my PSN games, downloaded games and my trophy support. Keep up the good work. A long time. Yeah, I don't think you have to worry about that. It still works on PSP, I think. That's not something you",
            "start": 5049.38
        },
        {
            "text": "my PSN games, downloaded games and my trophy support. Keep up the good work. A long time. Yeah, I don't think you have to worry about that. It still works on PSP, I think. That's not something you should worry about. And if that happens, they'll give you a huge heads up and I bet you there's a workaround for it. Yeah, like the multiplayer games, one by one are gonna go away. But like, your games and the PSN support and trophies and shit, I think you're fine. You'll be good. There's too many of them out there. Too much money to be made. And your trophies will never go away. I mean, those exist on a different server. Metro Shade says, hey guys, when you play shooters or any other games, do you invert the Y axis? I made my friend play Fallout 4 and she's not a gamer at all, but I noticed every time she tried to look up or down, she'd look the opposite way. So I inverted it for her. She's smart. And I asked her why she picked it that way. And she said she wasn't sure and she was just",
            "start": 5094.08
        },
        {
            "text": "every time she tried to look up or down, she'd look the opposite way. So I inverted it for her. She's smart. And I asked her why she picked it that way. And she said she wasn't sure and she was just doing it instinctively. This is weird to me since I've never played with inverted. So I'm just curious if you guys do or do not on how you got started playing on inverted. And if you ever changed. Thanks guys. P.S. I recently found out all of Tim's old videos he did for IGN, including the Avengers boy band. Wow, you've all come such a long way. I'm not sure about that. It's a lot like being left handed. Some people are just born wrong. And when that happens, he's got to put up with them. So I mean, you play inverted. I do play inverted. And I feel like nowadays you're definitely like a dying breed when it comes to that. You've never changed. Nope. Right? I am a- Wasn't there like one week or something where it suddenly, you kind of made sense the other way? No, it didn't make sense either",
            "start": 5129.68
        },
        {
            "text": "when it comes to that. You've never changed. Nope. Right? I am a- Wasn't there like one week or something where it suddenly, you kind of made sense the other way? No, it didn't make sense either way. I had like, I had this month, it was when destiny came out and I'm like, nothing feels right. So it was really weird. I had, I was having a mental breakdown and then I really wasn't like, holy shit. Like I don't know how to play anymore. And then suddenly I could just snap back in. I was like, I'm fine. All right. False alarm everybody. It was weird. It was weird. I remember tweeting about it and talking about it. I was like, what the fuck? It was like really, I was actually like authentically scared. I'm like, holy shit. I don't know how to play anymore. Like something in my brain just doesn't work anymore. Like, I don't know. I would invert then uninvert then invert. And I'm like, holy shit, nothing feels right. So it's weird you say that because I had that experience too. And I still",
            "start": 5166.54
        },
        {
            "text": "work anymore. Like, I don't know. I would invert then uninvert then invert. And I'm like, holy shit, nothing feels right. So it's weird you say that because I had that experience too. And I still do every once in a while where back in the day. So I grew up with golden eye and that was like, that's what it was to me. That's how you moved. And that's how things happened. So when I made the switch over to, and I played the shit out of Star Fox. So inverted just made sense then. And also the way you move, the way you would move. And that it just, that's how I liked it. Then time splitters came out and one of the default control options played more similar to that, where you would move forward and backward with the left stick and you would aim left and right with the left stick. And then you would wait, no, that's not right. You would strafe with the left stick. So it controlled much more like Star Fox where you're like, you're going left and right or forward or whatever, and you aim and",
            "start": 5198.84
        },
        {
            "text": "would wait, no, that's not right. You would strafe with the left stick. So it controlled much more like Star Fox where you're like, you're going left and right or forward or whatever, and you aim and whatever with the right stick. And I was just like, this is just how things play. So in Halo, I would always have to like use this. I used, I think it was inverted legacy south paw, was the name of it. And I'm like, what the fuck is that shit? But I had to, and it definitely put me at a disadvantage when I played against anybody. And then one day all of a sudden just clicked and I'm like, this doesn't make sense anymore. And the default just made sense. And now I can't do inverted anymore. So now when I play Star Fox, I'm all like fucking confused and shit. But it's weird that it just happened. It's not like I trained myself or anything. It just totally snapped. But now when I play third person action games like Ratchet and Clank, the camera, moving the camera, like the left and right, it",
            "start": 5240.02
        },
        {
            "text": "It's not like I trained myself or anything. It just totally snapped. But now when I play third person action games like Ratchet and Clank, the camera, moving the camera, like the left and right, it never feels quite how I want it to. Like, I feel like my brain every other time switches it of if I hit left, if I want the camera to go this way or this way. I don't know, man. Yeah, the only, so this is my argument. First of all, flight games like Star Fox or flight simulators, they don't make any sense at all playing it unless you're playing an inverted. That doesn't make any fucking sense. Like, I'm just gonna throw that rig right out there. There's no justification for not playing an inverted. That's how you fly a fucking airplane. Exactly, that's always the argument I've had with people where when they're campaigning for inverted, I'm like, when I used to play flight sims on my PC and I had a stick, right? Yes, it made sense that I was pulling and doing this in the cockpit, you know",
            "start": 5283.74
        },
        {
            "text": "where when they're campaigning for inverted, I'm like, when I used to play flight sims on my PC and I had a stick, right? Yes, it made sense that I was pulling and doing this in the cockpit, you know what I mean? I'm moving this thing. But for me, playing a game, running around and shooting, it makes sense that I just know to look up means up. But like, you're about to go into your thing and I want you to do it. But then I think I have an answer finally for why it makes sense the other way. Well, I'm gonna segment it into two different things, third person and first person now, right? Third person, Greg, take this and pretend it's a camera and hold it. Okay, now look up. Okay, there you go, look down. Yeah, I mean, that's, so like, you're like for third person, the camera is behind you and for the camera to pitch up, it must be dragged down. Like that makes perfect sense to me. And that's the, it's the first person argument that gets a little more muddled for everyone, I think. And",
            "start": 5323.16
        },
        {
            "text": "and for the camera to pitch up, it must be dragged down. Like that makes perfect sense to me. And that's the, it's the first person argument that gets a little more muddled for everyone, I think. And that's based on how you view the character you're playing. Even if I'm playing in first person, I do not view the character as me. I view it as a camera. So the, so that's where my mentality comes from now. I don't have a heritage in flight simulating or anything like that. Like, I don't know why or how I always play like this, but I do. Well, I think what you just said makes sense. For me, the way I think the easiest way for me to explain it, right? Because what you're talking about is up and down or whatever. The stick in the back of the head down to look up. And I think that's just the dumbest thing because no one's ever had a stick in their back of the head. But that's the nature of the way you would play the game. Sure, but what I'm saying is the reason it doesn't work for me and the",
            "start": 5362.88
        },
        {
            "text": "thing because no one's ever had a stick in their back of the head. But that's the nature of the way you would play the game. Sure, but what I'm saying is the reason it doesn't work for me and the reason non-inverted makes so much more sense is that I'm not thinking about like tilting up or down like I'm broken. I'm thinking about the cursor on the screen. And if I want the cursor to go up, and even if there is no cursor, imagine it that way, right? I'm not even thinking of how I would move my own head or the camera or whatever. I'm thinking about a gun in the hand. I want the gun up and I want the gun down. So it's like a mouse. I mean, that's the thing is like when, and even with flight simulators like Starbucks and stuff, if you start thinking of it just a dual stick shooter or not dual stick shooter, like a... The flight sim? The geometry wars or whatever, like dual stick, just like... Oh, like a twin stick shooter. Yeah, twin stick shooter. Yeah, like then all of a sudden it's",
            "start": 5397.64
        },
        {
            "text": "stick shooter, like a... The flight sim? The geometry wars or whatever, like dual stick, just like... Oh, like a twin stick shooter. Yeah, twin stick shooter. Yeah, like then all of a sudden it's like, it doesn't matter if it's a spaceship or a person or whatever, it's just, there's a thing and there's shit that shoots. So you move it and you shoot stuff. And it's just like, when you start thinking of it that way, then it should just be default because it is just moving things. Right. Because there was no pulling sticks or whatever. Want a flat, you know, geometry wars or even Resogun, which is in 3D space, but it is on a flat surface. So that makes sense. Up, up, down, down, left, left, right, right. I mean, that makes perfect sense. But when you get... I understand that I'm in the minority on this. I mean, there are not many inverted players. I mean, it's like one in 10, maybe. You would guess. And, but it just makes perfect sense to me. And I don't know why or where it happened,",
            "start": 5430.46
        },
        {
            "text": "on this. I mean, there are not many inverted players. I mean, it's like one in 10, maybe. You would guess. And, but it just makes perfect sense to me. And I don't know why or where it happened, but I can't play the other way. Like Until Dawn is a good example because Until Dawn did not have inverted controls. They patched it in later and I didn't play the game. So like during the shooting segments or like when you had to aim, I was like, fuck, like I couldn't, I like really struggled, you know? It would have been so easy if I could have just, you know, it was like up in the right. So I would just jack down on the left stick and go that way or whatever. And then I'm like, in the other side of the screen, I'm like, fuck man. Like, I don't know. My brain doesn't work like this. I don't know. It would be awesome. What a waste of fucking academic resources, but it would be an awesome study to figure out what is... There's gotta be a common bond between everyone that plays inverted. There",
            "start": 5463.7
        },
        {
            "text": "It would be awesome. What a waste of fucking academic resources, but it would be an awesome study to figure out what is... There's gotta be a common bond between everyone that plays inverted. There has to be. It is not a coincidence because I don't think it's something you necessarily learn. Like I think it's the way you look at the world. I really do. Like I really do. The only other thing with that though, the closest parallel to it in my life has been skateboarding where there's people that... Have you skateboarded? So you're talking about goofy footed or? Yeah, whether you're goofy or regular or Mongo. Yeah, which is fucking weird. And I do that. Like it does. Oh, that's so weird. And it sucks. It sucks so bad. And I look like a fucking idiot. What's Mongo? I don't know. Mongo is when you push with your front foot instead of your back foot. Which is so bizarre. Oh, okay. Because the problem is... How do you balance? You just do it I guess. Yeah, no, I mean, it just makes sense.",
            "start": 5500.62
        },
        {
            "text": "you push with your front foot instead of your back foot. Which is so bizarre. Oh, okay. Because the problem is... How do you balance? You just do it I guess. Yeah, no, I mean, it just makes sense. The balancing is fine, but the problem then is... You must lean back. The reason that I have problems with it is that I wanna push down with my left foot like when I'm to jump and shit. So it's like, I don't know, man. Well, the people that push and then swing around. Right? Well, that's what I do. Yeah, so that... It's swinging forward instead of that. And I've tried, but the problem is I can't push down with my right foot. I feel like when I'm trying to write with my left hand. Anyways, things are fucking weird. There's definitely... Mongo! There's definitely... I've known, I skated with a kid that skated like that. I think that... Did you call him Mongo? No, I called him Mike. It's close to Mongo. His name was Kevin, it was weird. I haven't skated since college though, but I used to skate",
            "start": 5537.96
        },
        {
            "text": "that skated like that. I think that... Did you call him Mongo? No, I called him Mike. It's close to Mongo. His name was Kevin, it was weird. I haven't skated since college though, but I used to skate all the time. That brings back memories. I don't have it in me anymore. Mongo! I had a beautiful girl deck. That was my last deck. It was awesome. Just a sky blue deck, all fucked up from whatever I did to it. Had a UV spray painted on top of it for Uncle Vito, which was my friend's wannabe skateboard company, which I thought was so funny, which was named after my cousin, Uncle Vito. My cousin, Uncle Vito. Okay. Yeah, we called him Uncle Vito, but he was really my cousin. You talk about my documentary, man. All right, final two questions. I gotta buy that deck. Rated Any 1998 says, greeting and salutations from Algeria. My question is, what do you think of the share button on the PlayStation 4? At first I thought it was a gimmick, but after taking over a thousand photos, I understand why",
            "start": 5581.7
        },
        {
            "text": "salutations from Algeria. My question is, what do you think of the share button on the PlayStation 4? At first I thought it was a gimmick, but after taking over a thousand photos, I understand why Sony put this feature. I love it. I use it all the time. For me, the big game changer was finally having video for Twitter. As somebody who doesn't Facebook, you know what I mean? What I was always doing is getting screenshots. And you look at, I'm gonna toss a Vito game in here too, but same idea. But you look at Metal Gear, when I was playing under embargo, and Persona dancing all night when I was playing under Vito, I took so many screenshots. And then when it was finally up, I could just post them whenever I wanted to, or do whatever I wanted to. And now the fact that I can jump in and show something cool, or something broken or whatever, with the video in nine seconds. I do it all the time. Just did it last night with something. For me, it's always an accident. I always hit that button.",
            "start": 5635.1
        },
        {
            "text": "cool, or something broken or whatever, with the video in nine seconds. I do it all the time. Just did it last night with something. For me, it's always an accident. I always hit that button. I'm like, oh, fuck it, what's happening? I didn't mean to do that. But every time I do that, whatever happens to be, I'm like, oh, that is cool. I wish this is cool that I can do this. Yeah, it's one of those weird things of like I didn't think I'd use it. I thought I'd be using it for twitching, right? And then we got into all this stuff, and there's more, we have more professional ways to do Twitch than that. I do it that way, use all this stuff. And then the rise of photo modes in games. Every time I've ever heard of photo modes, I'm like, whatever, big deal. But when they added it to Arkham Knight, and I went in with the first, the 89 Batman DLC and stuff, and went in and started screwing it up, I was like, man, it's actually fun. You know what I mean? It's moving the camera around, getting,",
            "start": 5670.6
        },
        {
            "text": "and I went in with the first, the 89 Batman DLC and stuff, and went in and started screwing it up, I was like, man, it's actually fun. You know what I mean? It's moving the camera around, getting, yeah, exactly. Final question. Oh, dude, what do you do? You don't give a fuck. You don't give a button. Yeah, it's weird that it's a button. Yeah, I look at the PS4 controller, I study it sometimes, I just stare at it. Sure you do. And I'm like, there's just such a waste of space. Like the touchpad, this is so unnecessary. It would've been cool to have a few buttons there. Like one would've been share, but I feel like we're missing a select button and a menu button or something, I don't know. I just, I hit it sometimes too, and I'm mistaken, it annoys the shit out of me. Sure, oh yeah. Final question, Jason versus 22 says, hey guys, my question is, with Battlefront out, I was wondering what you guys think Visceral Star Wars game is, and when do you think it will come out? Oh man, it's an",
            "start": 5705.84
        },
        {
            "text": "question, Jason versus 22 says, hey guys, my question is, with Battlefront out, I was wondering what you guys think Visceral Star Wars game is, and when do you think it will come out? Oh man, it's an Amy game. So it's a narrative game. I imagine it's heavily story-based, right? It's story-driven, that's what we're doing, running through, playing as one person. Probably a Jedi. Maybe somebody who doesn't know they're a Jedi, but they'll become a Jedi. I bet there is a Sith Lord involved. I bet there's a bunch of dumb fucking aliens that don't make any sense. No wado. No wado, I bet too. And when will it come out? Maybe the season pass, don't get too crazy. Next fall? I think it's fall 2016. That might be a little soon, E3. Or is Disney Celebration or whatever the fuck they call it? That's after E3, isn't it? What is it? D23. Yeah, what is that? Oh, it's after. After, okay, so no, it wouldn't be then. They need to give it some space. I think that would be something you'd see at EA's",
            "start": 5744.26
        },
        {
            "text": "after E3, isn't it? What is it? D23. Yeah, what is that? Oh, it's after. After, okay, so no, it wouldn't be then. They need to give it some space. I think that would be something you'd see at EA's conference. And you think it'll come out in the fall? Yeah. Although. Maybe spring. Although. Here we go. It doesn't make any sense. With Mass Effect coming out at the same time from the same publisher. That's weird. I don't know. Maybe spring 2017. They gotta get off the pot with that game though because the fucking zeitgeist is moving. Star Wars? Yeah, it's moving. It's in motion. And no longer there. Here's the thing, isn't there a Star Wars movie every fall now? No, there is. Well, there's more than that. So next year, this year we get episode seven. Next fall we get Rogue One. Next, the May after that is episode eight. Oh shit, okay. Well, okay, interesting. But I figure, see this is interesting with the Mass Effect wrinkle. Yeah, it doesn't make any sense. What do they do with, have",
            "start": 5789.6
        },
        {
            "text": "after that is episode eight. Oh shit, okay. Well, okay, interesting. But I figure, see this is interesting with the Mass Effect wrinkle. Yeah, it doesn't make any sense. What do they do with, have they been saying, have they been stressing Mass Effect 2016? Or is that something worse? No, they said that in E3, but I don't know. One of those games has to, well, not one of those games, we don't know when the fuck the Star Wars game's coming up. But Andromeda is supposed to be 2016. See, I think it makes sense if you're, Rogue One's next fall. Same thing? Yeah, see, wouldn't you want to stay on the same time schedule? Have a battle, where Battlefront was, insert the Star Wars game, move Mass Effect to the spring? But to Tim's point, if episode eight comes out in spring 2018, no 2017, then they can fit it in that march or so in between the movies. In between Rogue One and episode eight. I do think that they cannot release those games at the same time, I think that's a bad idea. They're",
            "start": 5828.48
        },
        {
            "text": "they can fit it in that march or so in between the movies. In between Rogue One and episode eight. I do think that they cannot release those games at the same time, I think that's a bad idea. They're gonna cannibalize the Shadow of Mass Effect if they do that. Space, there's not enough space for both of them. And they, but they do need the shit to get off the pod because Visceral needs to probably make another one quickly, you know? So 2017 is episode eight? Yeah. Yes. Okay. Yes, yes, yes. Ladies and gentlemen, that topic brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture nerd? I would. Good. Then this is the subscription box for you, Greg. For less than $20 a month, you get six to eight items of gamer and pop culture licensed geek gear, well, they left out geek, so it threw me off, gear, apparel, and collectibles, unique one of a kind items and more. Make sure to head to lootcrate.com slash KF Games and enter code KF Games to save $3 on any new",
            "start": 5861.68
        },
        {
            "text": "out geek, so it threw me off, gear, apparel, and collectibles, unique one of a kind items and more. Make sure to head to lootcrate.com slash KF Games and enter code KF Games to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away. Loot Crate blasted off into a voyage across the galaxy. Searching the far reaches of space to find universally awesome gear. Using December's Star Wars The Force Awakens loot as the launch pad, we, I love this, I love whoever wrote this, this is so good, landed on some equally cosmic items from Halo 5 and more. With an exclusive Funko Pop and an exclusive shirt in this month's crate, this is the loot that you're looking for. Basically, Loot Crate's like a friend named Jack who knows what you love and surprises you with an awesome present every month. You have until the 19th at 9 p.m. Pacific to subscribe and receive that month's crate. When the cutoff happens, that's it, it's over, Jack. So go to lootcrate.com",
            "start": 5902.76
        },
        {
            "text": "with an awesome present every month. You have until the 19th at 9 p.m. Pacific to subscribe and receive that month's crate. When the cutoff happens, that's it, it's over, Jack. So go to lootcrate.com slash KF Games, enter code KF Games to save $3 on your new subscription today. Build it, Jack. Beautiful. Thank you guys for joining me on this beautiful journey. For the big beautiful kids. For the big beautiful kids. I'll see you guys next time.",
            "start": 5941.12
        }
    ]
}