{
    "id": 2698,
    "video_id": "K9mhL9F2Ovo",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Let's Move Across the Country - The GameOverGreggy Show Ep. 183 (Pt. 4)",
    "description": "Andy just drove from Austin to San Francisco and wants to talk about what that's like. Luckily, Greg almost killed himself doing a similar trip.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1496905201,
    "duration": 2135,
    "transcript_chunks": [
        {
            "text": "You know what Kevin loves eating, you know what Kevin's doing getting married. I'm not saying the two are connected but maybe if you use our sponsor Blue Apron to eat, someone will love you. Blue Apron, I wrote this ad again. Blue Apron makes cooking simple and delicious each week; they send you pre-ingredients, you follow the step-by-step instructions, blammo, you've got a dish to be proud of. No more eating out of the trash. YouTube user Matt Bell said they got warmed smoked trout and asparagus salad with fingerling potatoes and garlic croutons this month. Man, stop being out of the trash. Check out this week's menu and get your first three meals free with free shipping by going to blueapron.com. Greggy, you will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait; that's blueapron.com. Greggy. Blue Apron - a better way to cook, and stop eating out of the trash. YouTube user Matt Bell said Andy, what's your topic? Um, should we talk about bubble gum?",
            "start": 0.04
        },
        {
            "text": "that's BlueApron.com Greggy Blue Apron a better way to cook and stop eating out of the trash YouTube user Matt Bell Andy what's your topic um should we should we talk about bubble gum you can do whatever you want I thought we had a different one but I'm down for whatever you want don't **** call an audible that's not how to show it playing everything to the teeth you're right you're right we'll do bubble gum Chann we'll do bubble gum this going to be every time you're on the show you're going to you're you're to you're going to fake you're going to fake the fact well we'll do bubble gum another time okay um is this yours yeah thank you yeah I just stepped on um so my topic is gon to be dog **** traveling to another to a new city moving or traveling moving okay moving your whole life much like I did much like all of us did R run me through it you're the most recent how's it going uh it's going well so far yeah uh I think it's I've become you say just well just wellfor Nick",
            "start": 43.76
        },
        {
            "text": "life much like I did much like all of us did run me through it you're the most recent how's it going uh it's going well so far yeah uh I think it's I've become you say just well just well for Nick there's a weird part of your hair in the back Greg can you see it okay yeah there you go thanks there you go appreciate that I didn't get it shot off on camera so I wasn't going to let it show these cameras ni you looking at my hair that what's that that sufficient detail just to check my hair no it's you got you got that carefree rocker hair though trying to copy your head I love it you got the hair where you walk in and you're wearing tight pants and like your your boot has a little bit of a heel and maybe you got like a six string guitar just oh is it just is it people ready for this I do actually have should I bring it you just go like this and it comes out from behind you like a samurai sword and you're going to bring guitars so you move to this new city",
            "start": 101.28
        },
        {
            "text": "for this I do actually have should I bring it you just go like this and it comes out from behind you like a samurai sword and you're going to bring guitars so you move to this new city it's going pretty well why do you hate fun GRE sometimes you know just why you hate fun are you still mad about Batman v Superman it's not a bad I'm not mad at all the trust me the internet's with me on this one want scratches who wants scratches Batman is going to be movie every looks back in five years like man we were too hard on that one no we not that was a good one that was a fun one that was a comic book come to life with the exception you want to know my biggest problem with Batman v Superman Andy there's the my biggest problem with Batman v Superman when he shoots them around when he drags Superman in and then slowly spins him around and knocks him into pillars that's I'm like objectively that's the only problem with the movie do you think so everything else was perfect that I caught that",
            "start": 148.24
        },
        {
            "text": "in and then slowly spins him around and knocks him into pillars that's I'm like objectively that's the only problem with the movie do you think so everything else was perfect that I caught that scene anyways moving they just speed that up a little bit you got  be there it's similar to Wonder Woman when she gets the sword it's like why do we need this yeah that's a good point so I drove across three four different states what's what's between Texas and California New Mexico deserts yeah Nevada I don't know which route you took I don't know if I don't think I drove through Nevada you probably just drove through Arizona right you seen you just seen a casino I like yeah you're right no I just saw a bunch of deserts saw a bunch of beautiful landscapes uh but the process of moving and putting everything into my car sure and driving for two night three nights four days something like that um have you all done anything similar to that I know I you know you were from Chicago whatever did",
            "start": 187.12
        },
        {
            "text": "everything into my car sure and driving for two nights, three nights, four days, something like that. Um, have you all done anything similar to that? I know I... you know, you were from Chicago, whatever did you just fly over here? What sort of are you not familiar with the story huh Greg? I died, I think yeah that's the story yeah yeah I'm not familiar with that story so I went from Chicago to Missouri and I mean for school right and that was going my parents drove me down dropped me off went back and then for like uh Thanksgiving all freshmen already have a car and then I got a car I I would drive back and forth everything else um that I mean going there that first time going to college at 18 I was so ready to be out on my own and be not an adult but what you think is going to be an adult you know what I mean I was telling Nick the other day you masturbate anywhere out I mean I had a roommate but yeah you could legally is it no no it's America man I thought about it's so weird to masturbate with a",
            "start": 228.44
        },
        {
            "text": "I mean, I was telling Nick the other day you can masturbate anywhere out I mean I had a roommate but yeah you could legally is it no no it's America man I thought about it's so weird to masturbate with a roommate anyways uh it was so exciting to go there and with one yeah glad you whatever Kevin check your phone um no like moving there was awesome cuz it was a liberation of like I'm going to go do this it's going to be brand new it's the first time on my own I I I'm an independent person on that level right where I actually want to go out and do that and live those experiences and then I got comfortable yeah there for you know a while I did the four years of school then the year and a half of the paper and then Igan hired me and so when Igan hires me they're like well how fast can you be out here and I'm like well you know I started going through the fact oh I have a house and I have least through this I was like two weeks **** it I I'll blow up everything I'll be there in two weeks",
            "start": 272.8
        },
        {
            "text": "Here and I'm like, well you know, I started going through the facts. Oh, I have a house and I've at least thought this through. I was like, two weeks... it. I'll blow up everything; I'll be there in two weeks. And they're like, \"Oh, all right, great.\" So what I did is I rented a U-Haul to bring because I was going to keep it with my ex. I was going to keep the house we had - we were on the lease with her and our other roommate - and leave all the stuff, furniture with her. Then I was going to take the uh mattress that I... our spare one, and take all the stuff out there right. And I was going to bring out the car I had, which was a Mustang. And uh, hell yeah, I woke up that morning, went got picked up the U-Haul brought it back; they gave me the thing. I went out there to hook the car up to it and I read the pamphlet totally haphazardly. I was just like, well, I've got time to kill. I think I think it was my ex-wife was like going to shower whatever and then say goodbye and we're going to go. And I already loaded",
            "start": 315.24
        },
        {
            "text": "\"Totally haphazardly, I was just like, 'Well, I've got time to kill.' I think it was my ex-wife who said, 'I'm going to shower, whatever,' and then say goodbye. And we're going to go, and I already loaded the car, and I read a pamphlet that said, 'If your car is a front-wheel drive vehicle, this will destroy it.' And I was like, 'Huh, I think it's called my mom; she's like, \"Yeah, you can't do that.\" I was like, \"So,\" I drove way out of the way for 30 minutes the wrong way. I was going to drive from Missouri to San Francisco, and I drove the wrong way to pick up this other sled for the car. Came back, put the car on it, then I started so I started late but I was going, and I was excited. And so I went from Missouri, and it was either that I could go north with a threat of snow or go south with a thread of tornadoes because they're like having horrible rain or Pi tornadoes in this area. I have a I mean growing up in the Midwest, I have a fear of\"",
            "start": 351.76
        },
        {
            "text": "go north with a threat of snow or go south with a thread of tornadoes because they're like having horrible rain or Tornadoes on this I have a I mean growing up in the Midwest I have a fear of tornadoes have you seen Twister **** that I've seen tornadoes in real life or funnel clouds starting this isn't real things I understand but anyways I was like **** that I can deal with snow I'm from Chicago go up drive into Nebraska check in at a hotel great go to bed wake up the next morning at something ridiculous like 4:00 and I'm going to hit the road to do this I'm I wanted to get the Rockies that day was my thing and came downstairs and looked at the TVs and all the TVs were The Weather Channel and it was like there's a blizzard coming in to you know the northern United States and I'm looking at it and I I have to look at a map I think it's I-80 that cuts there's a there's a highway that cuts straight through Nebraska and I looked at it and the blizzard was mainly North with literally",
            "start": 390.2
        },
        {
            "text": "at it and I I have to look at a map I think it's I-80 that cuts there's a there's a highway that cuts straight through Nebraska, I looked at it and the blizzard was mainly north with literally a triangle going across the highway and in my head I'm like I just punched through that yeah I'm fine you go fast you know what I mean yeah how many miles can that be wide I can get through that no problem this is I-80 mil an hour **** I pour the coffee go out there get the U-Haul and by the way uh when I told my father this plan like I'm going to tow the U-Haul and drive across country he was like you've never done that before and I was like you never do it till you do it and now and then you like I same words he told the first person he had sex the sub the subtext to that story of course is my father saying you can't do this you're not man you're not man enough you don't know what you're getting into I'm like I'll be fine and not in like a shitty way my dad trying to you know yeah",
            "start": 433.4
        },
        {
            "text": "is my father saying you can't do this, you're not man enough, you don't know what you're getting into. I'm like, \"I'll be fine,\" and not in a shitty way. My dad was trying to say, \"Yeah, please don't kill yourself.\" I go, and it's still dark out; it's starting to snow. It's snowing, I'm driving this thing, and the roads are rocky. I'm going, going, going, going, going, and I'm driving. What I did was use my PSP as a media player, and what I had done is downloaded every OneUp Show, every Game Scoop, and at the time IGN's AFK podcast. That's all I was listening to on my way out there. Just like I'm going to get to know these people; I'm going to know the industry better than anybody when I get there. And so I'm just driving, driving, and slowly it dawns on me that I'm the only car on the road. Like, there's no one. It's getting snowier; it's dark still, and that's weird. So there's a Dairy Queen, and I pulled off the ramp and pulled in to this Dairy Queen. It's all big rig trucks inside.",
            "start": 476.76
        },
        {
            "text": "car on the road like there's no one it's getting snowier it's dark still and that's weird so there's a Dairy Queen and I pulled off the ramp and pulled in this Dairy Queen it's all big rig trucks in this Dairy Queen and people inside I walked in I'm like hey what's going on they're like get off the road, there is a blizzard coming, you idiot, we're in the middle of a blizzard I'm like what, what do I do, I've got a U-Haul ton of Mustangs they're like you should have gone 15 minutes ago, you passed a hotel, drive back to that like all right cool and he is a so-called expert exactly I wish that's what I like about Texas, that's their advertising yeah I didn't know they were only in Texas go on I drive out of the Dairy Queen and it was it was super it was a super simple highway overpass Dairy Queen drive out of the Dairy Queen the way I you know the opposite way I came come over the overpass to come down and go you know hang a left and go back and it's like come down the slope of the overpass, black ice and I",
            "start": 511.28
        },
        {
            "text": "Dairy Queen the way I, you know, the opposite way I came. Come over the overpass to come down and go, you know, hang a left and go back and it's like come down the slope of the overpass, black ice, and I just slide, slide, and it's like one of those things where I'm just like going past, I'm supposed to exit, I'm like, \"Huh, what the **** do I do?\" You know what I mean? And in front of me is you can't see very far; it's snowing that hard now. But it's just, you know, I don't know, you call it a two-lane road or there's the one there's you know me and oncoming, and I'm like, \"Well ****, I can't reverse.\" There's no traction, it's black ice, and I'm I'm dragging this **** Mustang of course. So I'm like, what I'll do is go further into it. I go further down this random ass road, and in my head, I'm thinking, I know Columbia, I know Missouri at some point; I'm going to pass a church that is a parking lot. I'll be able to pull in and swing around it. Can't take that long, and you can pray. Exactly, I drive, drive, drive down.",
            "start": 557.84
        },
        {
            "text": "I know Missouri at some point I'm going to pass a church that is a parking lot, I'll be able to pull in and swing around it. Can't take that long, and you can pray. Exactly. I drive, drive, drive down this road, and I pass like you know one house, 10 minutes later, like it's it's barren as Nebraska. It's in the middle of a snowstorm; I'm going super slow, but I just keep going, like I got why what else can I do? I can't there's no way for me to three-point turn this because it's now elevated too where there's ditches on each side, like I can't do anything. And we're going, going, going, and finally the real blizzard hits, and The Wind starts rocking me back and forth, like this is going to tip over with me in it. And I'm like, I'm 23, and I'm like, I don't know exactly, I'm freaking my pants, I'm like. And finally, I'm driving, driving, drive, and I finally see on my right this little trailer, and I'm like okay. And I look into the yard, and you can faintly see the outline of a circular driveway of like",
            "start": 595.16
        },
        {
            "text": "and finally I'm driving, driving, drive and I finally see on my right this little trailer and I'm like okay and I look into the yard and you can faintly see the outline of a circular driveway of like you come in circle back out and come back up and I'm like this is my only shot I got to take this shot I got to see what happens hopefully it's asphalt, hopefully it's gravel. Down it's mud I get three-fourths of the way in and just start spinning my tires and uh or maybe one-fourth I should say and I'm like **** and so I look at this little trailer that's there no you know there's like a truck but it's not like connected it's just a mobile home in the middle of nowhere get out of the tractor or the uh U-Haul walk up to the door and knock on the door and this old elderly man named Earl opens the door and I'm like Hey sir sorry I did this I'm stuck can you can I use your phone he's like he looks at me he's like I got a tractor I can pull you out and I'm like really, it's really heavy.",
            "start": 634.88
        },
        {
            "text": "like Hey sir sorry I did this I'm stuck can you can I use your phone he's like he looks at he's like I got a tractor I can pull you out and I'm like really like it's really it's a heavy load got a lot of stuff in this thing and he's like no no I got you no big deal I'm like oh thanks so he takes like 10 minutes he puts on his snowsuit comes outside goes into this little tiny shed opens it up and brings out a John Deere tractor half the size of this it's like a riding lawn mower brings it out like this with a chain and I'm like Earl I don't know if this is going to he's like no no it'll work it'll work and he goes over there hooks the thing to the U-Haul and goes and he just starts spinning tires too cuz he it's still snowing like crazy this that and the other he's like here's what you do go over to the you know cuz it's one of those trailers where you walk up the stairs and there's a platform he's like leaning up against the platform is a piece of plywood don't mind the cats bring it",
            "start": 676.8
        },
        {
            "text": "go over to the you know cuz it's one of those trailers where you walk up the stairs and there's a platform he's like leaning up against the platform is a piece of plywood don't mind the cats bring it over here and I was like don't mind the cats he's like yeah a bunch of a bunch of feral cats live under there don't worry about it I'm like okay so I grab this thing and rip it away it's just immediately punched in the face with all this cat urine smell like these cats have just been living like whatever got to do it so I go over there and I shove it under the tires of the car and it's like particle board it's exploding in my hands as I try to get in I'm doing the tires and it's just like not happening and he was like all right you can use my phone I'm like all right great get in the car update my parents and ex-wife hang up the phone and then just scream and pound on the steering wheel you know what I mean get out walk in use Earl's thing and I for I think Earl is in Butler, uh, Nebraska",
            "start": 716.96
        },
        {
            "text": "my parents and ex-wife hang up the phone and then just scream and pound on the steering wheel, you know what I mean? get out, walk in, use Earl's truck and I for I think Earl's in Butler, uh, Nebraska. and then this is going to be rough now but something like 30 miles away not far is Kearney that's the next big town and uh I pick up the phone go through the phone book find you know hey we **** pull big rigs out of things and we're I'm like great call them like hey I this You Haul Mustang stuck and like yeah we can come get I'm like great how long do you think it's going to be and they're like well they shut down the highway cuz the blizzard I'm like **** that would have been helpful now **** that would have been good enough and they're like yeah shut down the highway because of the blizzard so it'll probably be 6 to n hours and I was like all right thank you and I hung up the phone and did that thing where he just took that deep breath, I'm like so Earl is going to be hanging out with me",
            "start": 750.08
        },
        {
            "text": "so it'll probably be 6 to n hours and I was like all right thank you and I hung up the phone and did that thing where he just took that deep breath I'm like so Earl going to be hanging out with you for a while if that's okay and explain to me he's like oh no big deal man blah blah blah come come over here I'm going to show you my collection of heads and that's the thing is is like I put up a blog post when I first got to IGN not I was in this entire story and then also detailing Earl's trailer cuz it wasn't like nice it was like Earl lives alone in the trailer and all this stuff you know what I mean and I think it was my aunt who hit me up and was like you weren't making fun of him but it kind of comes off at points where you and I and I was like yeah he saved my life you know what I mean like I could have blown over on the road I could have done this like he could have not asked the door he could told me to **** off you know what I mean he could have been Furious that I was stuck",
            "start": 787.48
        },
        {
            "text": "like I could have blown over on the road I could have done this like he could have not asked the door he could've told me to **** off you know what I mean he could have been furious that I was stuck in his yard he didn't do any of those things he sat me down and made me coffee and we hung out for 8 hours watching March Madness on a snowy TV and then finally they came they pulled me out and I drove back to the hotel that was 15 miles away or whatever and sat there and called everybody and updated them oh actually I pulled in and I had like I'm exhausted I'm emotional I pull in and there's a sign that's like trucks this way and cars that way and I had this like mental breakdown where do I go which one of those is me exactly ShowOver where the trucks were immediately got stuck in two like uh ruts where I couldn't move the tires got out of the car in tears and flagged down a trucker and I was like oh he's like all I got it yeah don't worry and he got in the car drove it out for",
            "start": 828.92
        },
        {
            "text": "like uh rivets where I couldn't move the tires got out of the car in tears and flagged down a trucker and I was like oh he's like all I got it yeah don't worry and he got in the car drove it out for me parked over and like where there wasn't anything and then the next morning I woke up to my Mom calling me at uh 4 in the morning no no my mom called me at 6:00 in the morning and was like she's in tears and she's like I'm looking it's only getting worse don't drive come back to Missouri I'll pay for your flight we'll figure all this out and I'm like all right fine and then I called Jeremy Dunham and woke him up and I go he's like hello and I go wakey wakey it's Greg Miller and he goes it's 4 in the morning and I'm like sorry almost died on the way out here going to do this he's like all right whatever so that I flew to California he's like it's like you know what time it is on the Pacific coast what you know what I mean it's be go loops around I'm going to make an awkward thing",
            "start": 863.48
        },
        {
            "text": "right whatever so that I flew to California he's like it's like you know what time it is on the Pacific coast what you know what I mean it's be go loops around I'm going to make an awkward thing your brain is like one of those Swizzle straws that like just goes all that's very true that's true so you almost died and then you arrive in California you know however many days later a week later whatever um how long did do you feel like it took you to get acclimated to the city like I I assume did you have any friends out here or no no I came out here s scene I I got I got hired at a different IGN you know we talking about now where they're like flew people and they got a SWAT team and it was like s hours of interviews I got contacted interviewed and hired within 24 hours never made it never came out here for an interview never met Dunham or rer in person didn't do stuff so lucky so I came here seen you on MySpace page we like it we think exactly they read my blog it was very interesting",
            "start": 897.32
        },
        {
            "text": "came out here for an interview never met Dunham or Ryan Reynolds in person didn't do stuff so lucky so I came here seen you on MySpace page we like it we think exactly they read my blog it was very interesting uh but got out here yeah and like to feel acclimated feel like it was normal it took forever I mean I don't think it I don't think it's one of those things like you know I just moved again and so like now the house the apartment is starting to feel like home but it's all it's just cuz it's normal I've been doing it now in a a routine sure whereas like I think there was a different routine back then cuz it was I'll never forget coming out of the airport getting into the car saying take me to IGN 800 Marina Boulevard and I didn't say IGN and then I had to show him on a I loaded my computer and put it in sleep mode because I knew he wouldn't know where Marina Boulevard was and I showed him whatever but then there's that big you know South San Francisco Mountain which isn't a mountain",
            "start": 939.44
        },
        {
            "text": "put it in sleep mode because I knew he wouldn't know where Marina Boulevard was and I showed him whatever but then there's that big you know South San Francisco Mountain which isn't a mountain but it's a giant Hill that we don't have in the Midwest and I remember looking at like what the **** **** and like getting there and like the first thing I did in that parking lot while I was waiting for Chris Roberts to come down I took really shitty Nokia cell phone photos of the palm trees in the parking lot cuz that was so what a weird **** thing for this guy from the Midwest like text your family back home like there's palm trees in the parking lot they on the water tricks exactly exact wait is it weird for you to be sitting in an office where if you look out the window you can see the ocean yeah absolutely like standing on the roof when we're on the roof and I'm looking out there yeah that's definitely really really odd because 10 years of living in Austin right **** 20 years",
            "start": 975.88
        },
        {
            "text": "ocean yeah absolutely like standing on the roof when we're on the roof and I'm looking out there yeah that's definitely really really odd because 10 years of living in Austin right **back** 20 years of living back home it's flat and uh like just driving down the streets being able to see crazy **big** Hills and like looking up and like man we are elevated right now you know like it's really really bizarre now as far as the culture goes the culture is super similar to Austin the vibe is different I think i' like it more here because it's so much prettier to look at **here** sure like the the vistas are a lot nicer compared to Austin and just anywhere in **the** Bay Area is really have you been up to Marin yet to see like the the Redwoods and things like that no no nothing like that it's indoor basically that's where they shot it so it's crazy yeah so I'm still getting used to it but luckily I have not only you guys but you know when I moved out here if I didn't know any of you all and if I had no",
            "start": 1010.8
        },
        {
            "text": "that's where they shot it so it's crazy yeah so I'm still getting used to it but luckily I have not only you guys but you know when I moved out here if I didn't know any of you all and if I had no friends here I'd probably be way lonelier but I moved out here and I have not only have you guys but I have you know Sean and Barrett and best made through the community yeah absolutely yeah people who are like when I when I got here Sean would be like hey let's go out to eat or Barrett would be like hey come over and watch this TV show with us you know and and you know it's it's been a lot smoother transition than I could have ever expected that's great that's good to know it's awesome yeah that I mean that was always the uh strength and weakness to an extent thank you so much uh if you're watching at home I'm doing this uh Community Town Hall thing tonight and we're running late so I'm getting really close to it so I got to start setting it up um and I was going to keep",
            "start": 1055.6
        },
        {
            "text": "watching at home I'm doing this uh Community Town Hall thing tonight and we're running late so I'm getting really close to it so I got to start setting it up um and I was Journey I want this top to keep going I think it's great um that was always the strength and weakness to some extent is that you worked with your friends and I remember how weird that was when I talked to co-workers former co-workers and then family members too of like oh that's great that works so great what do you do on the weekends what do you do at night I'm like well all of us from the office go to the movies or the bar or come back to the office to play games and they thought that was so strange but it was that we all were the same age bracket we all had the same interests it was so easy to fall into like of course this is what we're going to do we're all friends it was a real it was a really weird time too when Greg and I started I cuz we started what like six months away from each other something like that months where",
            "start": 1097.6
        },
        {
            "text": "we're going to do we're all friends it was a real it was a really weird time too when Greg and I started I cuz we started what like six months away from each other something like that months where we were all like the entire editorial Department with the exception of um a couple of the guys were pretty much around the same age and or maturity level um there was Doug Perry who was always a little bit older than everyone but same maturity level I always come in like you know it was that thing where we came in right as the old guard burned out yeah right as the founders who as Tal Blevins and right as Dunham was having kids and Roerig was getting married and it was like they were all aging up right as we all got there and it like you don't get wrong I I I was the new class to this class but like Charles and Brock and Clayman and Greg and like the entire video team and on like it was that thing of like cool we all are from somewhere else and we just want to party and do",
            "start": 1130.52
        },
        {
            "text": "and Brick and Clayman and you and like the entire video team and on like it was that thing of like cool we all are don't we're all ex-pats from somewhere else and we just want to party and do whatever yeah that was actually one of the cool things too cuz when I came here I knew no one I didn't have a single person that I knew up north I took the job it was my my experience was completely opposite of Greg's I interviewed for the job with Fran uh because my buddy actually like physically put my uh resume on his desk and was like you should look at this guy he's a great guy he's a good friend of mine you don't know me that well but whatever so Fran called me just kind of on a recommendation we had a great interview and I didn't hear back from him for like three months cuz I think they had they had another candidate that they wanted that I think was from I want to say was from Canada and they just couldn't get him they couldn't figure out the the the like getting him into the country",
            "start": 1169.08
        },
        {
            "text": "they had another candidate that they wanted that i think was from i want to say was from Canada and they just couldn't get him they couldn't figure out the the the like getting him into the country and all the Visa stuff so they went with their second choice which was me so Frank gives me a call and I he's like hey how's it going really liked you look we need someone up here we need someone up here basically the next week can you do it and I was like yes yes i can and then I'm I'm like it was it was the first time my life when I had committed something and then had to figure out how to do it and that was like I'm like **** this is like this is crazy and I moved up north I packed all my stuff my brother and one of my brothers good friends and uh another friend all got in a car we had a party out of it we drove up drove me up and I had found a guy on Craigslist and I called him I was like yeah i'd love i'd love to rent your room if its still available because it was in Brisbane which",
            "start": 1205.28
        },
        {
            "text": "out of it we drove up, drove me up, and I had found a guy on Craigslist and I called him, I was like \"yeah, I'd love to rent your room if it's still available\" because it was in Brisbane which is right up the road, right down the road from us. Um, and I was in Brisbane, I had no idea that Brisbane was a tiny little town that everything closed at 4:00, and like I didn't know anything any better. Show up at the guy's door and he's like \"oh yeah, like I didn't know if you were serious, I'm not sure if I really want you to be here\" and I'm like \"well why don't we have an interview right now and if you like me I'll stay and if not I'm totally outta here so like we should figure that out right now\". I was like \"look I don't need to commit to anything, like whatever, I'm like just give me a month if you don't like me I'll find another place it's not a big deal\". So the guy was like \"yeah totally cool\", other than this cat and then I ended up leaving quickly afterward anyway but yeah we",
            "start": 1241.84
        },
        {
            "text": "you don't like me I'll find another place it's not a big deal so the guy was like yeah totally cool H other the world's Weird this cat and then I ended up leaving quickly afterward anyway but yeah we all got together and it was me and it was my buddy Brennan and it was Fran and it was Eric and all of us were from different parts like Eric was from Florida Fran's from Chicago Brennan's from Louisiana his friend Craig was from Louisiana and we all were of the same age and all found each other and just instantly clicked and I was like thank God and I remember knowing that Brennan was going to be my best like one of my best friends forever because like the very like one of the first nights I was there he was like Hey man uh bunch of us are going to go get some Taco Bell and go back to my house and watch uh movies and play some games you down I'm like yeah I can get behind that I definitely can get behind that by the way I was on a low carb diet back then and there's nothing worse than",
            "start": 1281.64
        },
        {
            "text": "and watch uh movies and play some games you down I'm like yeah I can get behind that I definitely can get behind that by the way I was on a low carb diet back then and there's nothing worse than trying to explain to the person behind back then back then well specifically for this story because every time he has Brennan lived in Foster City with uh with my buddy Craig and they lived in one bedroom up apartment and Brennan slept on the couch and Craig slept in the room I to this day I have no idea why because it was Brennan's apartment but um we used to go to Taco Bell a block and a half away and I would order a bowl of meat every time I'd be like can you just put three sides of meat in the bowl with some hot sauce and some sour cream and every time without fail they had to go get the manager and be like is this something we could do is this like something people I saw like having to ask the computer to figure out how to get that to print in the back eventually they just",
            "start": 1315.12
        },
        {
            "text": "and be like is this something we could do is this like is this something people I saw like having to C++ the **** computer to figure out how to get that to print in the back eventually they just figured it out um but yeah it took me a while to adjust in fact I don't think I ever fully adjusted I love San Francisco I love Northern California but I always feel a little displaced sometimes too when I go back to so I'm like I don't really belong there either and up here I'm like I guess this is my life and it's beautiful and there are worst places to live but in the back of my brain I never actually thought I'm I I still to say I don't think I'm going to spend the rest of my life in Northern California at some point I'm like I'm going to go back down to to LA or SoCal and just and be down there for the rest of my life it's very strange feeling interesting yeah so I was going to say when I um when I finished University um uni as y all call it we call it uni indeed yeah I like I feel",
            "start": 1354.12
        },
        {
            "text": "there for the rest of my life it's very strange feeling interesting yeah so I was going to say when I um when I finished University um uni as y all call it we call it uni indeed yeah I like I feel so home I know a lot about the UK can you for a while I have to go to the L and get some biscuits some biscuit and take the don't eat the biscuits out of the bathroom and by the way when you walk between that floor and that floor you have to mine the Gap that's what you have to do shout out l so much on your trip to London I do I **** love London by the way I'm giving you guys **** but my wife Lo lived in London for a while and uh she it was just the best experience ever had a great meets up in South Ken it was fun that was great okay so while you were at Uni so I was say so I'm I was at Uni and I uh applied for jobs in London this was I'm this going to show my age here the Doom bubble would just burst the finance industry where I was looking to apply for jobs so no one was recruiting so",
            "start": 1388.96
        },
        {
            "text": "and I uh applied for jobs in London this was going to show my age here the Doom bubble would just burst the finance industry where I was looking to apply for jobs so no one was recruiting so I took a year out and basically dossed around for a year um I went to like can you explain what that word means Dost sorry apologies um disc operating I'm not sure what I'm sure the translation people can extrapolate yeah just messing around yeah exactly freaking off pissed off for a while yeah so basically like Thailand barley Australia New Zealand um across the states great fun uh came back uh to my to my home um found my parents had divorced which was a bit of a shock did they not tell you that they didn't get a letter I kind of had yeah I got a notice from the lawyers um I had a bit of an indication but I came back and they were like oh and we're selling your family home oh by the way yeah exactly uh so you're homeless so literally I literally came back was",
            "start": 1433.04
        },
        {
            "text": "I had a bit of an indication but I came back and they were like, \"Oh, and we're selling your family home. Oh, by the way, yeah exactly.\" Uh, so you're homeless. So literally, I literally came back was homeless. I um had I I went actually I came I went down to London to see friends had already moved there straight out of University so they moved out a year kind of before and they were like \"Sorry, Joy\" which is what they call me, Jo. They like \"Joyy,\" what, why have you brought all your um why have they brought all your stuff? Oh, that makes sense. And it's comp I mean people in the UK are very sophisticated; they're so creative, Jo. Why, why have you brought your um your entire rock act down? You staying for like a month? I was like, \"No, this is all my belongings in a bag.\" They sold everything else; I don't have anything else. I was like, \"So carrying it around.\" Me and my best friend from home, my oldest friend, uh, a guy called Rich, uh, came down to London like looked around a few places found a",
            "start": 1483.68
        },
        {
            "text": "I don't have anything else, I was like so carrying it around, um me and my best friend from home, my oldest friend, um a guy called Rich, um came down to London, like looked around a few places found a found a place we got we made an offer on it to stay there got rejected ended up staying with one of his friends he's a he's an actor who was going to drama school so we kind of moved down with a friend of his didn't know no job living in London which is you know apart from San Francisco about the most expensive place in the world you can live um with no money just been traveling for like a year um so I used all whatever I was going to say savings savings no savings just the money you had yeah exactly burnt had already burnt through the overdrafts I had moved down and it's amazing when you're motivated to find a job how effective you can be yeah um I think I it's really funny I look back now and think I had like six eight weeks yeah 6-8 weeks um where I could have just been enjoying myself",
            "start": 1525.88
        },
        {
            "text": "to find a job how effective you can be yeah um I think I it's really funny I look back now and think I had like six eight weeks yeah 6-8 weeks um where I could have just been enjoying myself in London no job Nothing But at the time I was frantically panicking I was to next uh next um rent bill found a job fortunately at a place called PricewaterhouseCoopers which is a large Professional Services firm joined there and it was great but it was like the panic and loneliness and um just kind of I don't know the um the the kind of uncomfortableness of being like it wasn't even the new city was one thing and that was pretty bad um but it's London so it's great not having a job that has its own kind of panics but then also this kind of idea that I didn't have anywhere to go back to it wasn't like I couldn't I'm sure I could have like gone and stayed with one of my parents somewhere but you're like that place that you called home that kind of that rock that Foundation that you have just kind of",
            "start": 1571.0
        },
        {
            "text": "couldn't I'm sure I could have like gone and stayed with one of my parents somewhere but you're like that place that you called home, that kind of rock that foundation that you have just kind of vanished and I suddenly felt anchorless and like drifting. I was in London, I was sleeping literally the first few nights, I was sleeping on the floor, then I eventually got like an inflatable mattress and I slept on that, and then eventually, when all my belongings kind of got released from whatever you know security they had on them, like you know after having the divorce, everything got put somewhere and I got that down to start feeling yeah exactly you know it's me and a foam mattress and my you know mask collection, you have a bad F mask, what right there? Are you wrapping up the show? This is a great topic, keep going. I just got to go do this thing. Did you get mad at me? You understand so for um every you know this is a question I'll put to you guys like do you",
            "start": 1625.76
        },
        {
            "text": "wrap the show up this is a great topic keep going I just got to go do this thing I did you're not mad right you understand so for um every you know this is a question I'll put to you guys like do you feel like this is some level of right of passage right do you feel like people need to do this in their life at some point no no you think you it's okay to grow up and live and die in the same town you grew up in yeah I mean so I mean I'm talking like cross country sort of sure adventures I I don't think that's a right of passage I don't think anybody needs to necessarily do that I think it's cool to see different parts of the world that you may not have necessarily seen if you stayed back home um but there is a nice comfort about home where your family there and your friends are there and that's where you grew up and everything's very familiar or whatever um I do think it's important to get out of your parents' place and maybe move a couple cities down just to be away a little bit",
            "start": 1669.12
        },
        {
            "text": "and that's where you grew up and everything's very familiar or whatever um I do think it's important to get out of your parents' place and maybe move a couple cities down just to be away a little bit but I don't think you have to move across the country no not at all yeah I mean I I kind of I I'm not just to disagree with Andy I hate to scream um uh I um I I had this interesting conversation with my girlfriend Dylan about going on holiday and I I'm I'm a little bit like that I like that familiarity of somewhere that you've been before but then I said actually there's you everywhere is a new place until you've been there so so if you I I I kind of like the idea of going somewhere new I like the idea of experiencing something new because until you have you you kind of fail to realize that there is a bigger world out there um but I do like I do like the familiarity of of places that you know whether it's home or whether it's sure yeah but I do think you need to kind of get out",
            "start": 1714.36
        },
        {
            "text": "that there is a bigger world out there, but I do like the familiarity of places that you know, whether it's home or whether it's sure. Yeah, but I do think you need to kind of get out of your initial radius to just kind of experience some of that and to know so you can compare and contrast. You don't know what you're going to like until you partly know what you're going to dislike. I was uh I was not a huge advocate of traveling until I met my wife, uh she travels for leisure and for pleasure, and I used to travel a lot for work, so I always think travel is synonymous with work where you'd go have to do a job, have to figure out how to do this complex job in a new setting where you don't have all your resources. It was very stressful, and to this day I think that really conditioned me to kind of be averse to traveling um the great thing though is and and I do really cite London for this what London was the first time I landed in a city and I was taken by it and I",
            "start": 1771.44
        },
        {
            "text": "Conditioned me to kind of be averse to traveling. Um, the great thing though is, and I do really cite London for this - what London was the first time I landed in a city, and I was taken by it, and I was like, \"I want to spend more time here.\" And I met all you guys out there, and I met... You know, we had the Tom put together that kind of last-minute meet-and-greet with ToTK - shout-out to Big Old Tizzel. Um, he put together like what could I call him? Call him the \"Titly Wings\" uh, he put together that incredibly, incredibly racially insensitive and culturally insensitive uh, you know, promotional image. And everyone came out; it was beautiful. Um, but honestly, I walked around, and part of the reason why I wanted to do that was because I was like, \"I am enjoying this city so much that like if I left without meeting all the best friends here or at least the people that I could gather in this like 5 hours of **** you know promotion or whatever... like I would be remiss if I didn't do that.\" And when",
            "start": 1808.92
        },
        {
            "text": "Meeting all the best friends here or at least the people that I could gather in this like 5 hours of promotion or whatever, like I'd be remiss if I didn't do that. And when everyone came out, which by the way, that bar was like a block away from where I was staying. Oh, was it? Yeah, we were staying in like a cool little nice part of the world. Well, we save up but we like to splurge when we go into these hotels and we had yeah, we went to Morocco, which was the other leg, so that was a lot cheaper than L...like with the exception of when we went glamping, which was a terrible experience. But I think you really do um, you start to appreciate a couple things uh, you start to appreciate your where you live when you travel yeah because I think uh it kind of gives you a good appreciation for like the comfort of home but I think you also and this is what I'm always mystified by, you always start to really realize that everyone deep down is the same when you travel and I think",
            "start": 1852.44
        },
        {
            "text": "for like the conference of home but I think you also and this is what I'm always mystified by you always you start to really realize that everyone deep down is the same when you travel and I think that's a very important thing like when you go to London I've been to Morocco I've been to all sorts of places now all over Europe um South America Central America rather um everyone is just there's just a lot of human beings down there doing their thing yeah and and you got a lot more in common with them than you do the opposite if you just if you just kind of you know take the time to actually talk to people um but yeah I've actually got the travel bug we're going back uh for our anniversary this year our five year anniversary we're going to Copenhagen I've never been to Denmark before oh cool so I think that'll be kind of fun not I don't think it's going to be London okay I think I think I'm gonna miss London but uh but yeah there is something about y'all City that uh is pretty pretty",
            "start": 1890.0
        },
        {
            "text": "so I think that'll be kinda funny not I don't think it's going to be London okay I think I think I'm gonna miss London but uh but yeah there is something about your city that uh is pretty pretty awesome oh you're always welcome back well I appreciate that I appreciate that I pick up uh last question for you though do you think that my parents did the same thing well not the same thing to me that that your parents did to you but at one point my my I remember justly getting a call from my my mom I think it was like 21 at the time and she's like hey all those bills I'm paying for right now and all the food that I'm buying you I'm not doing that anymore bye click you have like she was basically like you have one month to come up with an extra like 800 bucks and I was like damn I don't know how to do that and like of course you have to figure that out right you have to like you have and you're right you're never you never figure something out until you're forced to figure it",
            "start": 1925.56
        },
        {
            "text": "don't know how to do that and like of course you have to figure that out right you have to like you have and you're right you're never you never figure something out until you're forced to figure it out I think that's an important right of passage that's kind of what I was alluding to was like at some point you have to think to yourself I need to be my own person better for worse it's kind of amazing what you can do when you have that duress or that um necessity to do something and I think you can do you can do a lot more than you would expect to do when you are forced to do it and that's not to say I think that's a good situation to find yourself in but but sometimes it's quite life affirming to but I think yeah I think it's a growth experience I think it's a good opportunity for you to go I don't think I can do this and then when you do it you go **** I could that's cool that's really great what else can I do right and that was important for me like I would not have been able to",
            "start": 1960.84
        },
        {
            "text": "Go, I don't think I can do this. And then when you do it, you go... I could that's cool, that's really great. What else can I do right? And that was important for me like I would not have been able to pick up that phone and say yes to that offer from Fran to go to IGN without having been cut off from all my parents' support. Granted, I mean, I say cut off - my mom still made me food and brought it over all the time. It wasn't like if I was... I was in dire straits right? If I was like my God moving with you, she'd be like thank you Jesus. Like it would have been amazing and she would have... I probably still be living there today. Um, but yeah, anyway, guys this has been an awesome podcast. Yeah, Poly D thought when enjoyed it. Andy, C - I just want to call him Po. I, I like that. What what what call him Joyy? I don't know. He... what does D mean? I said cuz in my head, compc in my head, I was trying to make a joke earlier of you look from from the Jersey a little bit and then I thought your last name started with a D for",
            "start": 1998.72
        },
        {
            "text": "know he what does D I said cuz I in my head compc in my head I was trying to make a joke earlier of you look from from the Jersey a little bit and then I thought your last name started with a d for some reason and then you were like no my last name is Joy Jo is not that hard to work Works in a very weird way not as weird as **** swizzle stick over here ghost of Greg Mill thank you so much for joining us if you didn't know ladies and gentlemen you didn't know ladies G this game of Greg show we're four sometimes five best friends gather on this table and bring topics to the together week by week day by day whatever yada y y guys Everyone by St I thought you going for a bit of New Kids on the Block there well so oh so we which what was the big new kids in the block song it was step by step was it step by step step by step sing it oh I'm singing the the show he's singing the show it was a step step baby can you get to me girl what that that's not the big new noce oh sing the what's the",
            "start": 2037.92
        },
        {
            "text": "Was it step by step, step by step? Sing it! Oh, I'm singing the show. He's singing the show. It was a step-step baby. Can you get to me, girl? What that's not the big New Kids on the Block. Oh, sing the what's the most famous New Kids on the Block well no there was a different there had to be a different side of the world. What are you talking about? Are we not talking about 2001? We're all talking about Donnie Wahlberg's famous band right. Thanks for tuning in everybody. Everybody, I'll wrap it up. You sit there... New Kids on the Block everyone. Thanks for joining us. We will see you next time bye-bye good job Kevin thanks for watching subscribe here watch other videos down here clicking over here to go to the Patreon and go check out Kinda Funny Games right there you can click right here and you'll go back and see a very old video just say I'm making it up put something there... It doesn't matter. Old.",
            "start": 2078.32
        }
    ]
}