{
    "id": 2700,
    "video_id": "xffyXdZUKIE",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andrea Rene",
        "Danny O'Dwyer"
    ],
    "title": "E3 Predictions 2017 - Kinda Funny Gamescast Ep. 123",
    "description": "Andrea Rene and Danny O'Dwyer join us for our annual E3 predictions show! (Released first to Patreon Supporters on 06.02.17)\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497011401,
    "duration": 7190,
    "transcript_chunks": [
        {
            "text": "Oh what's up guys welcome to the first ever episode 123 of the Kinda Funny Gamescast I'm Tim Gettys joined by one of the coolest dudes in video games Greg Miller but dogs oh no no you're just one of the coolest shoes you're not the coolest dude anymore well kids originally we were is that too close to call it Greg and now Colin is closed due to historical yeah joining us together for the first time all of us Danny O'Dwyer and Andrea Rene oh you maintaining your number one most recurring guest role I don't let it go not really we try how many it's been it's been a while somebody gets close Gah Tonya Harding I'm back guys yeah is there a leaderboard got dead somewhere I mean there's a spreadsheet for sure am I the most European mom on Baska yeah probably um there was that Snake Pass guy oh right Tank on when he was off your work you got it yeah black going on here um Kinda Funny Gamescast each every week just together talk about video games all things you love around this",
            "start": 0.0
        },
        {
            "text": "guy oh right tank on when he was off your work you got it yeah black going on here um kinda putting gamescast each every week just together talk about video games all things you love around this is my favorite episode of the years oh the e3 predictions episode it's very exciting and it is brought to you by patreon producer Tom Balk the homey shouts Tom boss he did super cool it's I'm such a nice dude yeah he emails me he knows kinda funny laughs coming up he emails me is just like dude like I know you're going through how like you got this whatever my I appreciate and it's a little like positive reinforce to the show Tim you weren't here lie would we hear ya bro out feels like before even though you're here for that gamescast hour they all kind of work one games customers two dogs gotcha gotcha what we do editing videos for kinda funny and anything planned more and more so than that planning what planning the things that are coming out after kinda funny wise to the people",
            "start": 62.94
        },
        {
            "text": "gotcha what we do editing videos for Kinda Funny and anything planned more and more so than that planning what planning the things that are coming out after Kinda Funny wise to the people like Final Fantasy XV for instance before it happened we got it was got a predicted also thank you to the Patreon supporters here you can see your names thank you a lot of Patreon talk because we have the Patreon family hey what's up yeah I work on Patreon too on Patreon you work on Patreon major like the Giant League of Legends of Patreon like a big fan if you didn't know what's good games and NoClip on Patreon see things you can follow both of them I'm picking on Greg last what's good games add teacher my cup / Danny O'Dwyer okay I don't know yeah yeah you're proofing your future - Greg yeah just keeps the do to our brand going I might sell off NoClip you're someone who wants to have a video game documentary had a video game documentary sure every day for like 10 days hey what you love it so much yeah how you",
            "start": 109.38
        },
        {
            "text": "our brand going I might sell off No Clip you're someone who wants to have a video game documentary had a Video Game Documentary, sure every day for like 10 days hey what you love it so much yeah how you guys doing good I mean I think we're all like a little frazzled and pretty three obviously you guys have Kinda Funny life III also to worry about who picked that date yes him who picked that yeah it's a great date, I love it so I mean this is a fun time capsule because it's recording before Kinda Funny Live 3 posting the Friday before Kinda Funny live threesome on supporters and then you to regularly but the yeah it was last night Jen was like oh yeah I'm like did you guys pick June 3rd because the Kinda Funny Live 3 I'm like no we both would June 3rd because the weekend before when we wanted it was already booked all right yeah and I will just work it worked outside Ella because the thing is it's last year we have Memorial Day weekend which was awesome",
            "start": 152.12
        },
        {
            "text": "the weekend before when we wanted it was already booked all right yeah and I will just work it worked outside Ella because the thing is it's last year we have Memorial Day weekend which was awesome because it gave people a chance to be here for a longer but we found a lot of people couldn't make it cause I have a Keisha since Cheryl and your family so yeah a lot of family stuff so well you know what June 3rd works and like what we do like our E3 planning is like Greg has to do a lot of good say does the guy who doesn't have to do it yeah yeah but I mean like planning the live streams of thought planning the important **** for E3 is easy as hell alright we just show up and **** do stuff and you're doing all the reaction stuff here yeah that's what I'm talking about reimpose shows songs for every conference here - except Evie says Kinda Funny Games yep and then I'm going to stay in if it has a Patreon folks it as opposed to just don't freak out I mean you're like it was a big",
            "start": 193.31
        },
        {
            "text": "for every conference here - except E3 says Kinda Funny Games yep and then I'm going to stay in if it has a Patreon folks it as opposed to just don't freak out I mean you're like it was a big surprise then Wednesday we're doing the GameSpot live show in the afternoon and stuff level schedule I out I'm the GameSpot dragging their heels on it the chastity girl you know are from the GameOverGreggy show dragging her heels in Seville wonderful that Ryan she tried to hoodwink us I bet there's other contracts some contract loopholes you trying to get okay just to reiterate because this is the person I went on about our E3 plans proper yeah we will be streaming all of the conference's pre-show during the show and post-show not the PC one because PC games yeah so when I say all the conferences are maybe a but says the QB you be Microsoft Sony and Nintendo rotation um then we're going to go - XIII we're gonna be putting out a bunch of react videos much Kinda Funny Gamescast and all that",
            "start": 228.95
        },
        {
            "text": "are maybe a but says the QB you be Microsoft Sony and Nintendo rotation um then we're going to go - XIII we're gonna be putting out a bunch of react videos much Kinda Funny Gamescast and all that stuff and then you have the GameSpot show yeah on Wednesday the game's not a lot oh you know hard to hard don't you have the opposite problem man alright let's get right into it well before I lay out the rules for the E3 predictions okay because I don't want your **** yeah there's rules yeah Danny the rule real simple and you know to protect our integrity is the fact that somebody hit me up about this like hey wait how many predictions if you were to judge we can you know everything as always the rules are we only predict things we don't know if we know you don't mention it you're not going to lose as a prediction yeah obviously now more than Jeremy Dunham I think we're not sharing me Dunham's people have a warped perception of what judges week is",
            "start": 265.4
        },
        {
            "text": "you don't mention it you're not going to lose as a prediction yeah obviously now more than Jeremy Dunham I think we're not sharing me Dunham's people have a warped perception of what E3 is sure E3 is not you go there and they give you all the stuff of the time I press conferences it's the games that aren't necessarily going to be on the the show floor you know first party soft generally right right yeah this year I didn't I yeah there's no PlayStation no Microsoft no Nintendo I didn't see any of them you seeing other publishers other developers who are there who understand that their stuff probably will get overshadowed it wouldn't get as much limelight we had in previous E3 years passed like even if first party brings things it's not like top secret things that aren't shown you know it's stuff that's been announced it'd be like if Activision had Call of Duty hands on playable I E3 we all know Call of Duty's coming they've already announced it so it's not like",
            "start": 311.1
        },
        {
            "text": "you know it's stuff that's been announced it'd be like if Activision had Call of Duty hands on playable I judges week we all know Call of Duty's coming they've already announced it so it's not like shocking to anybody stuff like that just leaves more about playing games than announcements am i right yeah so if you're playing it it's far enough along that it's probably better now it's like a logistical thing we to like make sure people have time to I mean apart from the awards element of it but that sort of become a little bit confused now but it's a way that I jest it and make sure you have the content you can talk about ahead of time and so is embargoes right like a far cry 5 degrade example then when I'm far cry 5 down there weeks before it was announced then when it denounced we're all able to talk about it and be able to give it its moment in the spotlight before big old Jack Tatum returns yeah our predictions so we're going to do is we're going to go around the table yeah",
            "start": 348.48
        },
        {
            "text": "all able to talk about it and be able to give it its moment in the spotlight before big old Jack Tatum returns yeah our predictions so we're going to do is we're going to go around the table yeah we each have five predictions topic one is PlayStation topic Tuesday Nintendo topic three is Xbox and topic four is third party group stuff after the rest having press conferences and I so not Capcom in that but we're talking yourself it does Dutton yet to be clear as always I'm sure dog is out there ready to tabulate the votes here it is done down to the decimal there are hollow points and little points awarded so the more detailed your prediction the better chance you have at beginning a tenth of a point and I always have the Tim Gettys' moment brought to you by Gatorade oh that's just me but I could never ever been brought Gatorades never paid you for this oh no no one day they will **** keep saying it sheriff's housing is happening I don't know I don't think that's how that",
            "start": 383.58
        },
        {
            "text": "me but I could never ever be brought Gatorades never paid you for this oh no no one day they will **** keep saying it sheriff's housing is happening I don't know I don't think that's how that works DiGiorno manna what's not delivery Greg yeah fit us off with that PlayStation goodness prediction one now for the record better not pick I made not I made eight here that way I have I can feel it in my shorts exactly exactly I bet you don't from Microsoft yeah I got a couple good ones to them actually so what I'll begin with is this PlayStation VR libs the conference reveals no less than five PlayStation VR games no less five ok that's actually a really good one I believe new games yeah unannounced games yeah ok five no less than five PlayStation VR game you're crazy well I am counting he's not I am counting I think that's a good one that's a really good I have it here is my number five I'm using it here so stick with me I'm not going to use this anymore I'm going to use one of the",
            "start": 420.75
        },
        {
            "text": "He's not, I am counting. I think that's a good one, that's a really good one. I have it here, is my number five. I'm using it here so stick with me. I'm not going to use this anymore, I'm going to use one of the other two. You understand how this works for the other three? I am counting in this if Battlefield are Battlefront 2 is like and we have VR mode. Are you reading all 5 reproduction? Ok that's not the way bonus cool. I'm throwing out then I'm putting this no longer for prediction it's no star and this isn't even a prediction, this is an example that will no longer be used as a prediction. M doggin' it's an example do not count towards the prediction that something like such as Star Wars Battlefront 2 has VR mode counts as a VR announcement one of my 5 no get no fewer than five games that have come in on previous other viewer systems that they can't like it looks like an Oculus survive yeah I think that you count no you don't think so, you an original game what do you want it's your prediction it.",
            "start": 477.27
        },
        {
            "text": "on previous other viewer systems that they can't like it looks like an Oculus Rift yeah I think that you count no you don't think so you an original game what do you want it's your prediction it reveals no less than five PlayStation VR games I've that you can reveal if you're porting something over it's still as always yeah I've exactly the PC people over there they're beta testing it for us and then they bring it a console I wish you Danny I think it's a little sticky but hey I notice I like signing images just if history does anything you've been wrong about your PSP our prediction every single but history has taught us anything one day you'll be right yeah if you keep making the same prediction there is a patapata to show of actually yeah exactly catch manage yes no less than five PlayStation VR names announced the show tonight might be I count ports my thing with VRS I was thinking that Dreams would be the big VR push at all and I do think that in addition to Battlefront",
            "start": 520.98
        },
        {
            "text": "PlayStation VR names announced the show tonight might be I count ports my thing with VRS I was thinking that Dreams would be the big V on a push at all and I do think that in addition to Star Wars Battlefront there will be some type of like co-op Austria they showed the our command yeah call fancy and like all those things still be a big game like that like some something that's just like a big experience based on Triple A game whether you're crazy I like that stuff was - I don't know bolster the sort of like we've got the X amount of games for PlayStation of yours launch right but I also feel like like there doesn't seem to be much of a roadmap for the rest of year in terms of place yeah you're are sending no yeah I like this is what's going on except for that Paperboy game you see nothing no oh my god June 6 special delivery its first person Paperboy well I mean six you not playing that until excited I know throwing them I'm gonna dog that Final Fantasy XV VR thing do you guys know did that ever",
            "start": 567.14
        },
        {
            "text": "god June 6 special delivery its first person paper well I mean six you not playing that until excited I know throwing them I'm gonna dog that Final Fantasy XV VR thing do you guys know did that ever come out I don't think it I don't think it's very sure I think everyone was like this is hot garbage and Square Enix was like okay yeah there's a plan for that Jenny all right your first prediction hmm alright Horizon Zero Dawn DLC damn it that was my I know get in there I think about that they have been I don't know it's like I'm thinking to big picture with so I man yeah they I mean one of the comment February January yeah super surprising the immediately said we're going to make the DLC because it's all so well and yeah that's awesome and and they've been like entirely tight-lipped about it so yes like nothing's come out so that to me says they're waiting until yeah so I don't know all about how wait everybody think you know that game was so much fun I've gone back multiple times and done",
            "start": 609.02
        },
        {
            "text": "yes, like nothing's come out so that to me says they're waiting until yeah, so I don't know all about how wait everybody thinks you know that game was so much fun, I've gone back multiple times and done like side quests and stuff that I miss that I wish the new game was with but better fleshed out it's kind of like a Zelda but it's a bit like oh we just load your last save and do what you want and so I'm hoping that maybe you know more interesting backstory into a lion and stuff like that comes into it yeah, maybe I won't be there right like I think I think I feel like when they do it it'll be like we told her story so nowadays really we found a new encampment there's this new villain not Vanillaware lost oh yeah what's you have to how's he dealing how much it was rough taking care that baby more about that that would be a fun keep the DLC baby comes back be another that be another great VR concept of you put it on you are Rostov you have to like rocket it's nice to know no one",
            "start": 658.4
        },
        {
            "text": "Baby, more about that. That would be a fun DLC baby. A comes back, be another great VR concept. You put it on, you are Rostand, you have to like Rocket. It's nice to know no one will take care of a well here we are. One Two Switch wanted to once you switch went order, yeah they did, yeah. What I don't get is a lot of many things all right and at the end of oppression, they're pretty much I know. Here's all that. Here's what I love Andrea, yeah it's done it's over frame. You can capitalize on this because he left the door to wide open. Because I have this on my predictions as one of is number eight The Horizon Zero Dawn. You put a release date window on it, you put something on it, you say it stars a new character. You can even spice up the kid giving you tofu, I want you to make pad thai slices right no I appreciate that but I have another prediction I want to get out before somebody else takes good on them and that production is Bloodborne too now is on my list it might not",
            "start": 697.07
        },
        {
            "text": "pad thai slices right no I appreciate that but I have another prediction I want to get out before somebody else takes good on them and that production is Bloodborne too now is on my list it might not necessarily be number two but it will be a follow-up to Bloodborne okay well I have the name Bloodborne yes Bloodborne something okay yes because that was a very definitive exclusive and the brand new PS4 when it first came out like it was a fantastic exclusive for them to kind of lead their new generation with and obviously fans want more it was great so sure I mean it was way too hard for me to finish something but for people who love that kind of punishment in a game I think that this makes sense save that okay good there was that Reddit thread a while back of a game called A Phantom Pain or something which was the you know the team from Software doing a Bloodborne sequel but maybe not Bloodborne exactly but it's like you know more hand-to-hand combat I think it was like Chinese",
            "start": 739.43
        },
        {
            "text": "or something which was the you know the team from Software doing a Bloodborne sequel, but maybe not Bloodborne exactly, but it's like you know more hand-to-hand combat, I think it was like Chinese or something sort of Dynasty era thing again could be total nonsense yeah gosh would they deviate from Loveborn right away probably in our I don't think so on PlayStation if it's on a different system I think that they would or obviously me but yeah exclusive yes okay yeah okay go check okay strong first one we will get an update on Shenmue 3, it won't be much but stands with an announcement of Shenmue HD collection right fall 2017 disagree that's never happened I'm not so sure about it is that your Gatorade get hype yeah okay I've gotta start off with actually it's been way too long it's been too many trademark weeks of this HD collection I don't think Shenmue III has much to be said about it but I do think that it's worth talking about just to get to the collection no I think it's just",
            "start": 792.98
        },
        {
            "text": "many trademark weeks of this HD collection I don't think Shenmue III has much to be said about it but I do think that it's worth talking about just to get to the collection no I think it's just way too much work to read you those games for such a small audience that would buy them sure yeah like he's been doing it though I'm we recently got the Bayonetta and Vanquish PC ports like I I'm not thinking this Impala feels like that upscale is probably easier than I mean Shenmue like came out on like the architecture of the Dreamcast is so weird as well like there was no PC versions of Chamber right it was only a Dreamcast it again on Xbox oh is it really semi to was Xbox okay I don't know I I feel like we're going to be waiting forever this is already so like maybe they'll announce a new HD release but they're not releasing it for like three years that halfway through a moot redevelopment yeah I can buy I'm saying this year just is like because of all the trademark stuff that's been",
            "start": 846.66
        },
        {
            "text": "HD release, but they're not releasing it for like three years, that halfway through a moot redevelopment, yeah, I can buy, I'm saying this year just is like a because of all the trademark stuff that's been going on, because it's been this whole year since last three there's been a whole bunch of Shenmue news on the morning shows come up with these million times hmm so SHINee's new what are you show the big news alright alright you got it's one that again is one that gets predicted quite a bit here sucker-punches game is revealed, it's a new IP, there is no release date in the trailer, no gameplay or anything beyond the trailer, you just cover all your bases with that tactic obviously what happens when you go toe-to-toe with Colin Moriarty for a decade and if you learn it, you can always try to get it, he's always gonna never did but I always wanted that's what sucker-punch new IP, it's not Infamous I'm coffee right yeah yeah yeah it's time right yeah I feel like you the infamous the",
            "start": 890.31
        },
        {
            "text": "try to get it he's always gonna never did but I always wanted that's what Sucker Punch new IP it's not infamous I'm coffee right yeah yeah yeah it's time right yeah I feel like you the infamous The Peter Dabbat seconds like a second saw him but like you're right I think it's time for them to do something exact it was the fact that it was two E3s ago that we had Shuhei Yoshida on the E3 live show and he was holding over colonise head that he'd already played whatever Sucker Punch his next working prototype was like ah yeah the timing definitely feels right and going off of what Sony's done with the conference's the last two years where it is just games engaging game trailer trailer trailer trailer trailer they really have that road map and a lot of the games like this The Last of Us that are like obviously wave fallout but then there's like a whole bunch of games leading through the calendar years and I think that this is a good thing to kind of put out there",
            "start": 936.45
        },
        {
            "text": "is and Last of Us, that are like obviously Wave Fallout but then there's like a whole bunch of games leading through the calendar years. And I think that this is a good thing to kind of put out there because we already know from last year as things move up, we need to know more **** that's coming later. Mmm, that makes sense. I'm into it. Alright, goddammit. Now and now I want to try some of my more difficult ones. Okay, you have any softballs here? Okay, I get the softball. While you can, you got to go to the beat cuts later and okay we will have an extended gameplay presentation of The Last of Us Part 2. Oh really, it will be like five nope, I'm never going to happen one two five minutes No so here's the thing with that no day Tony has not done gameplay demos they don't get Jay's gone man last year they had like 20 minutes and I guess that that was a gameplay demo okay right you've got a script I'm sorry I'm not on stage like some dude standing on stage okay now I don't really yeah if you're just talking",
            "start": 973.89
        },
        {
            "text": "20 minutes and I guess that was a gameplay demo, okay? Right? You've got a script. I'm sorry, I'm not on stage like some dude standing on stage, okay? Now I don't really... yeah, if you're just talking about video of gameplay, yes, okay? I know, no, okay? Yeah, sure. There was no one on the node, you know. Giant Enemy Crab we're gonna have, yeah. They're just gonna play show gameplay, no way. Especially with Uncharted: The Lost Legacy, I don't think there and focus on that. It's not what is not enough that the bank is being very clear he said this is a long ways away like this is a missile, I think it's at best you'll get another trailer slash cutscene optimism though are we they wasn't maybe if I want is I'll will it and do exist mean you know put up the photo of a woman from Westworld in the ping-pong ball suit doing a thing over there so maybe they introduce that character in a vignette or something, maybe in a gameplay gameplay okay. There will be a Destiny to exclusive PlayStation Strike showcase its strong.",
            "start": 1031.37
        },
        {
            "text": "a thing over there so maybe they introduce that character in a vignette or something maybe in a gameplay gameplay okay there will be a Destiny 2 exclusive PlayStation showcase its strong obviously PlayStation has an ongoing relationship with Activision they have an exclusive content deal with Destiny specifically and with Destiny too so of course with Destiny 2 coming on September that's shows something on stage I think they're going to show some talk about the PlayStation exclusive Strike okay what did you think I'm talking about it since the event what did you think a Destiny 2 um I loved it because I love Destiny and I still play Destiny but it's Destiny 1.5 yeah you're really I mean we could get into that on like a whole another show okay I think it looks great I'm really excited to play it I'm super excited for Destiny 2 particularly for the stuff that they're doing with clans and with the guided games things like that but yeah it's it doesn't feel like a true",
            "start": 1081.23
        },
        {
            "text": "excited to play it I'm super excited for Destiny to, particularly for the stuff that they're doing with clans and with the guided games things like that but yeah it's it doesn't feel like a true sequel what comes next I want to play with you yes what yeah I don't wanna play but I have you I don't like you guys have a Kinda Funny clan don't you oh yeah like a million of them but it's just like I don't know we'll make it official it's so intimidating to jump in with our audiences like super into Destiny, McMahon and really nice well not that you want to be nice but you're all want to pull me through the raids I hate that I want to experience it I want no room for me so this one here we go we're getting in there get out there's layers to this game alright okay if you started with Shenmue account way too much fun with this game Milla Jovovich, Capcom Infinite trailer a whole bunch of character reveals like what a smart will expect that MCU like it there",
            "start": 1136.64
        },
        {
            "text": "account way too much fun with this **** Milla Jovovich risk Alcon Capcom infinite trailer a whole bunch of character reveals like what a smart will expect that **** ah yes all the MCU like it there have a movie there going to be in this moment like Kamala Khan Oh dot dot it um that sucks stopping erased feature some Capcom characters this is the segue into a Kaban show so here's the thing last year we got by some evil 7mm and I was like holy **** as a surprise Doublemint cry five core Oh Resident Evil 2 remake mmm one of the gym and the Marvel's Capcom trailer is going to be the segue into it now the get hype moment Dino Crisis I forget that you wanted a get hype moments are the ones you don't count right that yes you guys like I went around the writers though mic so my prediction really boiling it down and I have a moral force camp consonant trailer know that's I wanna I just like having Greg like that in the bonus points to get more points I just like out of the boat that's not on it",
            "start": 1175.67
        },
        {
            "text": "it down and I have a moral obligation, not a moral force camp, coming out of the console trailer. I know that's what I want. I just like having Greg in the bonus points to get more points. I just like getting out of the box, that's not on it. That I want the segue to go into the real prediction is either Double Fine or Resi Evil remake two will be yet something I like how you do this because if the things you were asking for are outlandish, what if they happen? There's like Hail Marys there doesn't a man it's one of those like yeah if it actually comes true yeah you're like holy **** Tim called #CameWithRightBubbleWah and if it doesn't happen nobody remembers. Where I'm speaking for the people is what the people want, is what people are predicting. If Sony was listening to me they would be like oh **** I should probably get on this and out of business. I don't know, I don't know for is illegal to play games, it's good and to tell a story major. I dream it yeah it's like that means I got rolling years ago and I I doubt it'll ever",
            "start": 1237.8
        },
        {
            "text": "on this and out of business I don't know I don't know for is illegal to play games is good and to tell a story major I dream it yeah it's like that means I got rolling years ago and I I doubt it'll ever come into existence but if it's good it's going to be at E3 today and Ants they were gonna day before yeah they don't stream into a long time like like post GameCube remake or post like oh yeah like Vicodin junkies ago four years ago all right they they announced that they were going to do it but I think Double Fine is the more likely thing because it makes sense with my prediction of Marvel vs Capcom infinite trailer featuring Dante I wait five wait there was five there was a fifth of my cry good game but it was called DMC it was right of course yeah okay all right all right my third one yeah play to win complain for as Gatorade fun moments over there I want that I want to continue you gotta have this box in the Switch or playing on or some version of the Nintendo shown",
            "start": 1277.1
        },
        {
            "text": "one yeah play to win complain for as Gatorade fun moments over there I want that I want to continue you gotta have this box it into the spectrum yeah running on or playing on or some version of shown on PS4 Pro is set or listed on this Green at least five times okay okay they're going that's a good lunch they go on a trailer to do this thing and this it pops up in little white text I'm almost job through yeah I almost feel like they'd want to avoid that what what Scorpios eat but that's my point is that I think they understand this XIII is going to be dominated by Scorpio so let's keep it in people's mind that we do have something we have a PlayStation 4 Pro there in it we have an answer to we have an analog to what you're about to hear I see them doubling down the other way and being like we got games yeah sure yeah now there's still show tonight yeah no but like not even worrying about it just more like why do they even make confidence oh so why do they even make it as people",
            "start": 1322.28
        },
        {
            "text": "we got games yeah sure yeah now there's still show tonight yeah no but like not even worrying about it just more like why do they even make confidence oh so why do they even make it as people that enjoy it Greg that's why I will tell you this about the PlayStation 4 Pro it runs PlayStation VR quite well I used one for the first real time of like getting into the guts of it when we were doing the Friday the 13th stream definitely downloaded faster but I was more impressed with how fast the menus navigated and this goes back to my point with the PlayStation 4 Pro of how badly they bumbled the messaging of this because clearly it's aimed at me PlayStation fanboy and it should have just been hey the downloads games faster hey can do 5G whatever Wi-Fi hey look at how fast the menus go and I'm done how fast is sync trophies really fast I'll **** all right I thought I was oh it does 4K whatever on a **** lot of Scorpio comes in that's what they say then it's like you know the menus are",
            "start": 1367.7
        },
        {
            "text": "done how fast is sync trophies really fast I'll **** all right I thought I was oh it does 4k whatever on a **** lot of Scorpio comes in that's what they say then it's like you know the menus are in is bollocks as they've been for the past for sure I'll be like when I never turn it on do you see how fast you can load Hulu on this thing daddy you're walking up **** it's so competitive this is more competitive than I was expecting yeah underprepared well this is I am woefully underprepared okay okay we will guess gameplay gameplay demo and a release days window not like a days but like a fall summer early 2018 a rather of everyone's favorite David Cage game how Detroit: Become Human they'll roll that out again okay give me give me those two clubs to go okay actually I gonna add one we're gonna have a day's window in the way a month maybe not a specific day but like q1 2018 a gameplay demo but you know not somebody playing on stage but just make China late last year I wasn't",
            "start": 1407.72
        },
        {
            "text": "one we're gonna have a gameplay demo in q1 2018, not a specific day but like q1 2018, a gameplay demo but you know not somebody playing on stage but just make China late last year i wasn't with the guy in the girl on the edge or was that gamescom they i don't remember got wasn't any reasons but i don't make a show trailer though now they played us i'm going to add something to us they're going to reveal too and this is a bit subjective famous quotes for the podcast lessons at actors meanwhile going to - oh yeah that's pretty good yes and they also have children let's speak with french accent no i'm the one of them i drop the mic yeah that's your gatorade money last year i'm pretty sure that they might have been like a gameplay quick game blur thing but then it ended with like a trailer of like it can go a bunch of different ways right yeah that's true yeah sure i remember that yeah okay okay all right all right i'll buy that cool i don't know about the two actors though",
            "start": 1461.15
        },
        {
            "text": "a trailer of like it can go a bunch of different ways right yeah that's true yeah sure I remember that yeah okay okay all right all right I'll buy that cool I don't know about the two actors though I was it with too much of a boring guess otherwise got it I promise about that I just don't I don't know what they've been so gun-shy about doing that or they really don't say especially bring this yeah what's special about entering exactly that's all thing with you know Spider-Man got or Detroit like one of those games coming we don't even really have hints right like it was John Garvin said something about Days Gone many like what it could Alton some wait what is it what is the way I think I think if Sony has learned anything from the last couple things is that they shouldn't put really stay until it's ready but like I also don't think that it really matters in the grand scheme of things people being upset about delays and stuff I don't think actually affects the bottom line at all sure so",
            "start": 1511.58
        },
        {
            "text": "It's ready, but like I also don't think that it really matters in the grand scheme of things people being upset about delays and stuff I don't think actually affects the bottom line at all. So I think you can also really easily go the other way with it to where it's like okay great another Detroit: Become Human demo - when is this game coming? I'm thinking I'm hearing about it, give me some information. Yeah, Andrew, I'm talking which one to go with next, but I think I'm going to go with gameplay. Mmm, release window. Spider-Man - oh, I don't think we'll get a hard date. Yeah, I think we'll get a window, but we'll definitely see extended gameplay. We saw like a tiny little snippet when they announced it. I think we'll get something that's more than five minutes in length. Whoa! Wow, I think I'm with you up until the five minutes thing. Greg Miller, let's put this in my mind that this game is so far out - yeah, like he's kind of convinced me of that, but over time, talk to that. I believe Spider-Man's going to be here by then.",
            "start": 1549.02
        },
        {
            "text": "Greg Miller let's put in my mind that this game is so far out, yeah, like he's kind of convinced me of that. But over time, talk to that, I believe Spider-Man's going to be here. I think five minutes is a bit long though, especially me looking at all the games that they have there, the conference. What if the big the only thing huge, I mean, like it's a gigantic license for them right? Spider-Man sells even when they are like the shitty games Activision's trying to sweep under the rug, they sell lots of copies. And every time I've ever done a Spider-Man video at any conference, whether it be Comic-Con or PAX, it's always my most viewed. When did we put gameplay on GameSpot of Spider-Man stuff? It was always just a clip, I'm sure. Like, yeah, I mean the road to E3 which is them talking about games in the Spider-Man video, I want to say with all close to a million already and it's just like immediately, no, every hype move, all games, yeah, soon right in the movie.",
            "start": 1601.04
        },
        {
            "text": "talking about games in the Spider-Man video, I want to say with all close to a million already and it's just like immediately no-arming does every hype move, all games yeah soon right in the movie, Ji7 yeah all right, oh my here is my ear, what I'll tell you because I'm not making any Spider-Man predictions, I don't know anything, I don't have no hard facts, I've heard enough scuttlebutt, Waveform will pick up the Wi-Fi's and the murmurs around the industry, and for that I'm not saying I'm not ready to back down on the fact that this isn't a point that I... this is not coming this year but I've heard enough cell about where I'm like alright well now we're gonna find out what I'm right or wrong on this one cuz yeah III what I you know it just seemed like cool you're not showing much because you don't have much, you have a **** title like clearly this is a this is awesome and this is coming and great but it seemed last year it seemed like that so I thought for sure but the scuttlebutt I've heard",
            "start": 1646.04
        },
        {
            "text": "have much you have a **\"title like clearly this is a this is awesome and this is coming and great but it seemed last year it seemed like that so I thought for sure but the scuttlebutt I've heard is people are actually like I don't know and like **** really like I can't in my wildest dreams believe it's this year I stay about effort addictions from more forever I agree with you I really don't think it's coming out this year but I think we'll see a lengthy edit this year I hope so now I desperately want I can I don't know anyone's prediction here but the Avengers game do you think that we see that at anything all even uh nobody have a prediction about this that we should all I don't have it I don't have a card about it either because I don't think we're going to see this yeah me neither i I'm interested if they mention it though they mentioned building the Marvel games universe I don't know where they do that though I've maybe I made this prediction before I'm just predicting\"",
            "start": 1686.57
        },
        {
            "text": "i I'm interested if they mention it though they mentioned building the Marvel Games universe I don't know where they do that though I've maybe I made this prediction before I'm just predicting I still think it could easily be Xbox I think that that is something we might see at D23 later this summer oh yeah I don't think that we're going to see it 13 because it's not ready yet D23 is back this year they've already come forward and so they're having a games specific presentation I definitely think if you're going to show you know a Marvel property anywhere that would be a fantastic way to show like all right I just feel like I feel with Spider-Man coming to PlayStation 4 exclusively or whatever I feel like you you sit there like well what could Xbox possibly do at this conference I think I'm coming out and being like hey we've had a great partnership with Crystal Dynamics in the past with The Tomb Raider games now we're excited to announce that The Avengers",
            "start": 1725.12
        },
        {
            "text": "coming out and being like hey we've had a great partnership with Crystal Dynamics in the past with the Tomb Raider games now we're excited to announce that the vegtable is and that would be the one where it's like oh yeah all right my next one just stranding we'll be there huh yet again oh it was forum celebrity actress Emma Stone officially you know well you know it got it got disproven did it the guy who made the art did come out any was like they'd all think about it where it's like that but I still don't even get the harlot there's been so many other things of just like random like her walking out of the studio that they're working on da because that I that was things because that was I thought my I can slam dunk I'm gonna look awesome on this app you guys did a slam dunk first I mean I did too many flat dunks this is gonna be the James 3 yeah it all this shit's gonna be great what you",
            "start": 1767.87
        },
        {
            "text": "dunk I'm gonna look awesome on this app you guys did a slam dunk first I mean I did too many flat dunks this is gonna be the **** here James 3 yeah **** it all this shit's gonna be great what you got great this is gonna be a cannot a complicated one but I'll give you I have a Gatorade good height movie or whatever Kelly alright Grand Turismo Sport gets a release date it's this fall Gatorade get hype they plug in that baby come on here it is we said summer forever ago it's actually fall they walk off and then two months later press release on the blogger oh yeah we need more time the bumpers don't shine enough okay yeah okay how long is the presentation going to be do we think like 90 minutes probably I mean they you know they show all the montages of all the stuff that they have like they love to showing montages of like this is what happened about intro montage all that stuff they won't show No Man's Sky once yeah I mean well good solid okay now it's also so long ago that I don't",
            "start": 1811.61
        },
        {
            "text": "they love to showing montages of like this is what happened about intro montage all that stuff they won't show No Man's Sky once yeah I mean well good solid okay now it's also so long ago that I don't think they always do the like they always show all the old games like the catalog of games like they always go boom here's like all these games you remember that about a commenter like like the montage of another beginning at the end they'll show all the stuff even next start one is always like hey you have it was last year they had the orchestra which was awesome on oh really the orchestra returns no no we got really upset against it but it was awesome and orchestras are cool when you're there I want to know why kidding me cool to ever I thought it was awesome to get hyped man orchestras yeah they're not gonna show okay mmm I like sorry no I think it's because Sony keeps going super bitter bad does in a way that is kind of messed up so that's why I think no not because no one's guy is",
            "start": 1863.51
        },
        {
            "text": "they're not gonna show okay mmm I like sorry no I think it's because Sony keeps going super bitter bad does in a way that is kind of messed up so that's why I think no not because no-one's guy is like terrible terrible game although we could talk about that for a while just like the whole like Shuhei Yoshida throwing Shawn Layden on to the button thing the whole thing that's kind of why I think means like like watching to clear up yeah yeah a new cinematic trailer gameplay release date god of war oh yeah what has specifically say like a date okay this is oh yeah must be a year all right cool okay this Cory Barlog come on stage no I don't I think they're going to do well I mean that was another production Mind's always mark usually Irish about will be like no I might change my mind about it well I'm going to be but um I I think I mean this is a flagship first party title for them so like in as of right now we don't really have like a solid date for something in the fall for PlayStation so I",
            "start": 1907.1
        },
        {
            "text": "I'm going to be but um I I think I mean this is a flagship first party title for them so like in as of right now we don't really have like a solid date for something in the fall for PlayStation so I think you know we'll see date we'll see gameplay and we'll get a new God of War game, we get hyped. Prediction what is the God of War release date month? So obviously I'm not going to try mean like her I I would love something in November that might be too soon so it could be like February I think February um so yeah I'm gonna I'm not going to pick the exact date yeah that's for the bonus points no. February 21st, male that's the problem I have is like trying to figure out which one of these Sony exclusives will be the first to come out of the gate right we're in Detroit is it God of War? Yeah yeah yeah yeah Quantic Dream ain't seven consoles sadly yeah I mean Heavy Rain I mean interesting yeah it's right now we're probably not going to get a big Sony exclusive in October/November just going off a",
            "start": 1961.46
        },
        {
            "text": "yeah Quantic Dream ain't seven consoles sadly yeah I mean Heavy Rain I mean interesting yeah it's right now we're probably not going to get a big Sony exclusive in October/November just going off a lock that I am in September game okay if anything right then if we did get Detroit this year which simultaneously feels super likely and super unlikely I threw the flock no yeah like that game could be honest and it'd be like okay or it could be next Tunic good no one would know the difference what's your last one you didn't go yet oh oh **** you're right all right here we go they had so much success last year with Crash Bandicoot there's been so much hype about all of this they're going to show Crashing some form because the game comes out two weeks three weeks after E3 yeah yeah my birthday they need to remind people that this is happening whatever but they've already shown so much I thought they were going to save Crash Bandicoot: Warped for E3 because I would have totally made sense but they",
            "start": 2011.68
        },
        {
            "text": "they need to remind people that this is happening, whatever, but they've already shown so much I thought they were going to save Crash Bandicoot for E3 because I would have totally made sense, but they didn't; they don't touch it last week, so I'm like there has to be something more here now I don't think that this is a safe prediction because they'd want to see how the game sells first in order to before like going forward with something crazy like this however maybe the pre-order numbers are just so astronomical that they're like \"the Bandicoot man, we need to do something about this\" so we get the Crash trailer tomorrow or whatever it'll be there soon and it ends with one of the following: an announcement of the Spyro trilogy remastered or a Crash Team Racing rebooted WA or and this is when I'm getting **** crazy here PlayStation All-Stars characters featuring Crash and Spyro, get height; there's an homage **** to get on PlayStation All-Stars Kart, fill out man Mario Kart we got **** dude",
            "start": 2064.63
        },
        {
            "text": "I'm getting really crazy here. PlayStation All-Stars Battle Royale featuring Crash and Spyro get height there's an homage to PlayStation All-Stars Racing. Fill out man, Mario Kart we got enough earpieces that we really did calmly cardio and that shot Mom Nation is pretty good, thank you. Good yeah yeah, there was no Crash Team Racing, I'll give you that okay just live it for your like pining for the bygone era. I'll never forget being so hyped about E3 not knowing all the inside our industry stuff. I just being like what do I want them to do right? That's how I like to think about these things we know all the state predictions, I like having fun when things went when when I get my way I'm stoked about it Pyro yeah and I'll be cool yeah man I'll bring him back. Little Dragon deserves a better life than what he's been given right now well Spyro doing right now looking like Skylanders oh god oh god you mean making hundreds of millions of dollars",
            "start": 2115.57
        },
        {
            "text": "him back little dragon deserves a better life than what he's been given right now well Spyro doing right now looking like Skylanders oh god oh god you mean making hundreds of millions of dollars being forgotten yeah when no one likes you like nobody that like he's the guy in the company like made the idea but then the company like monetized and no one remembers him yeah is that in Skylanders anymore yes he says is he really is here's a TV show Dragon Crashers talk it was a whole disaster go for it final prediction final I had Horizon DLC on here too I had one more tool in here as well I'm a deficit spring 2018 of Libra too by the way but I'm not using as my foundation donors don't worry anything instead I'm gonna say and yeah this is the one where it's hazy I look into the E3 future and I see it but it's still there's still so much fog in the way of it what day is gone I can't tell if it's another if it's a trailer followed by gameplay if it's a trailer featuring a lot of",
            "start": 2162.91
        },
        {
            "text": "future and I see it but it's still there's still so much fog in the way of it what day is gone I can't tell if it's another if it's a trailer followed by gameplay if it's a trailer featuring a lot of gameplay because I don't think they can give another big chunk of like yours like running through and doing the stuff but if the Days Gone in-depth something that's teaching us the mechanics to an extent of this game followed by the release date of September 2017 oh one yeah I say II I think it works on a few different levels Sony has even been working on this game forever Tony Ben get the **** out of the way of The Last of Us - okay I mean like let's get it out the door it's also time for Halloween it's gotten like that vibe to it I think that might be the way to play it my only problem is I just think it's a hard sell in terms of all mechanics of that game but then again I also think that Sony might be just looking to cut on it come on get get the runway clear I'd be surprised if it's that",
            "start": 2208.3
        },
        {
            "text": "think it's a hard sell in terms of all mechanics of that game but then again I also think that Sony might be just looking to cut on it come on get the runway clear I'd be surprised if it's that far along however I do think that that's a solid prediction because yeah if it gets in the next year then you have to compete with theoretically got a war and the others like that I'm not going on when you start balancing this exclusive catalog where's all this guy I don't think Detroit's ready I don't think God of War is ready I think that Tony Hawk has been quiet for ever you know the essence what uncharted Vida yeah so a long time and granted I think projects got scrapped and all these different things but I'd like to believe that's how they're going to play them and give him a chance to breathe him a chance to get that game I wonder if cuz I mmm it seems like it was like such a win for them last year that like part of me would think that oh the obviously they would do is show it on",
            "start": 2251.38
        },
        {
            "text": "him a chance to get that game, I wonder if cuz I mmm it seems like it was such a win for them last year, that like part of me would think that oh the obviously they would do is show off a big gameplay thing, but I think maybe they've also learned from what happened with No Man's Sky and stuff that they need to, I mean, if this game's coming out, they don't want to overhype it too much. Yeah, if it's another year before it comes out and you've done it again. My thing about it is, I just still think you could do it in this window and still get what you're going to get out of it. I think the takeaway from Four Days Gone was that it was widely panned after E3 last year - not that it didn't look good, not fit in look cool, but it was like a zombie game and they crawl on each other like World War Z article we kind of have that yeah I thought so yeah and that's exactly how I felt about it yeah I didn't think that they were doing anything original with that game yeah",
            "start": 2293.5
        },
        {
            "text": "other like World War Z article we kind of have that yeah I thought so yeah and that's exactly how I felt about it yeah I didn't think that they were doing anything original with that game yeah I got to see a behind-closed-doors extended demo where they did pique my interest a little bit yeah but I mean like the general public didn't get to see that demo you know and that was a whole thing of like yeah that's Romani like they showed like alright well your your motorcycle is breaking down and needs gas you need to go scavenge for that thing all right cool how do you show that how do you do it I think you hit the ground you give a date you get people excited with a high-pass trailer probably so no gameplay high-pass trailer what's the hype and then it's like alright cool now at E3 journalists come in see this extended demo they go out and talk about atmosphere and we do a press tour in a year or a year and a half and then we're pretty much there I think it's just let's get it",
            "start": 2331.48
        },
        {
            "text": "come in see this extended demo they go out and talk about atmosphere and we do a press tour in a year or a year and a month and a half and then we're pretty much there I think it's just let's get it going and hype it up them as much as you can because I don't think a alright let's do a preview to E3 and do this and be like another year of trying to hype that game gets it the way I used to be I think Detroit: Become Human or Days Gone we'll be in the air September in LA this year mmm all right last one God last one okay it's probably it's going to be mentioned at some stage they're going to show something Sony is the most likely spot for a trailer for Red Dead Redemption II don't think so I mean I I disagree I think like I think Rockstar made their announcement when they did to kind of be like hey we're not going to be at E3 yeah because Rockstar could like two bucks buddy but never like we don't need you III like we stand alone we're a giant like we don't need to show our game at a conference ever I",
            "start": 2368.11
        },
        {
            "text": "going to be at E3 yeah because Rockstar could like two bucks buddy but never like we don't need you XIII like we stand alone we're a giant like we don't need to show our game at a conference ever I know they did that with Grand Theft Auto V but I think also they had like such a communication thing with GTA V the thing with GTAV I don't know I feel like Grand Theft Auto is the game is going to sell them are what I feel like they have to like sell what that single player was because it was this complicated thing I I feel I know we're like the post E3 world when it comes to game enhancements but I feel like Red Dead Redemption 2 is something they're gonna have to sell a lot more times and the opportunity to do so there's not many more coming up if they're going to ship in early next year yeah mining is though I agree with you that Reddit is not granted ATO so it does need a little bit more push but I only eat threes to push I think that their push is key that it's I think even one that I think it's like commercial stirring right",
            "start": 2415.66
        },
        {
            "text": "Is not granted E3 so it does need a little bit more push, but I only eat threes to push. I think that their push is key; that it's even one that I think it's like commercializing right? You know, sports events and I think it's that as well. In the economy, and I think it's E3, and I think it's big. I don't know; I feel like they've put so little about it now. I love you know; I feel like rock stars, you know, with all the research, rock stars are amazing. I just feel like they they feel like they're bigger than all these events. I don't think E3 they are; I think they mean they do their own thing; they kind of are. Yeah, I need to show their game at any of these events. Yeah, I mean 80 million units; hmm, they've got they've got quite a wad of cash. The big three when they've all died, maybe it's a special case, but I also feel like they have been doing more outreach over the past year when it comes to like gaming communities and like Twitch.",
            "start": 2454.24
        },
        {
            "text": "may be the GT online stuff and that's it maybe it's a special case but I also feel like they have been doing more outreach over the past year when it comes to like gaming communities and like Twitch broadcasters and stuff like that in a way that I can't imagine like The Rockstar Games doing two years ago even though I don't know I'm hopeful I've also got a rant just it's not it's not really prediction very good high moment they won't mention the Vita once oh yeah oh you know I didn't last ready for either oh really all right then if it wasn't for Greg of course they won't even any PSX okay my final prediction mm-hmm various things PlayStation eSports so they've been getting really involved with the Capcom Pro Tour they've been involved with the Call of Duty World League eSports is the hot thing that everybody's getting involved with right now Xbox last year talked about eSports and tournaments on stage I think now's the time for PlayStation to come forward and say we're getting into the",
            "start": 2494.62
        },
        {
            "text": "that everybody's getting involved with right now Xbox last year talked about eSports and tournaments on stage I think now's the time for PlayStation to come forward and say we're getting into the eSports game what that looks like I don't know but clearly they are already have one foot in the door with the things that I've already mentioned so I think we're going to see more from PlayStation eSports at E3 this year with the launch of PlayStation All-Stars Battle Royale yeah that sounds more like a PSX thing to me last year they talked about something a bit similar and also the Call of Duty's what I see what you're saying but III at its core is for business and for sales and for money and for showboating how much money video games makes what better way to do that and what the thing that everyone's throwing money at right now through eSports but you're really only done a good job with your Dreams 1 & 2 where they didn't do that you know it was games games games",
            "start": 2539.24
        },
        {
            "text": "the thing that everyone's throwing money at right now through eSports but you're really only done a good job with your dreams 1 & 2 where they didn't do that you know it was games games games games right but that's why I'm saying is like now is the time because but in the past couple of years obviously eSports have been around for you know decades right but like it's been the last like two to three years or so it's really kind of come to a fever pitch where everyone is talking and entering console right because like on PC I mean League of Legends, Dota 2, all and that like I was always still there yeah but it does feel like it's having more of an effect in the consoles yeah absolutely I just like mean if we're talking about predictions I mean I have another couple of predictions that I feel like a little lame and so this one is feels like something that is unexpected and that people maybe didn't think about what the more you kind of line up the pieces like well if they were ever going to",
            "start": 2587.55
        },
        {
            "text": "lame and so this one is feels like something that is unexpected and that people maybe didn't think about what the more you kind of line up the pieces like well if they're if they were ever going to get into it next year it's too late right like they're behind if they get into it next year now is the time in XIII is the place because you want to show to all of your investors hey we're getting into the hot the hot thing that everyone else is getting into maybe they like announce Kingdom Hearts 3 trailer or Final Fantasy VII Remake trailer with a release date that they won't ever reveal because they're not gonna get closer to marketing it for three years",
            "start": 2630.06
        },
        {
            "text": "get Kingdom Hearts 3 trailer or Final Fantasy VII part 2 trailer with maybe release year some type of release date that they won't ever because they're not gonna get closer marketing said three years or so yep but I still think I can't believe they showed it at PSX I thought that was gonna be a one and done thing at E3 but then they did show two PSX so I feel like it's either this or that Kingdom Hearts 3 I think is a bit more likely but even that I don't know but I just think that they like showing these things like it's just like it's not that it's coming anytime soon but I think that they're going to show one or the other I don't think it'll be both on the get hyped moment this here we got the most Square Enix thing possible for E3 2017 you know for that if they were just like here's the truth at all so I think Stormblood is that like a week after E3 or something they're probably going to be like I don't think they care about that and you don't you think that making older",
            "start": 2674.19
        },
        {
            "text": "Here's the processed chunk:\n\nHere's the truth at all so I think Stormblood is that like a week after E3 or something they're probably going to be like \"I don't think they care about that\" and you don't, you think making older games no, your general talking about that, that's just stuff that happens there. They like putting out trailers like CG trailers for things that are coming for years again, renamed it ten years later. It's been a while since they've announced a new game that's 10 years out, so I might be time for us to get hype moment but the prediction is either Papa P7 work in the March 3 trailer at Sony's E3 presentation, I like it all of your pics are like five pics, like I don't like to do I really like but it didn't attach to any of my other pics and that was that. Only Andrew will be on stage, no one else okay okay there's any other dregs any other anything no I well I cleaned out everything then yeah cool all right you know that is Sony next topic Nintendo predictions for the Nintendo presentation taking place on",
            "start": 2723.72
        },
        {
            "text": "any other dregs any other anything no I well I cleaned out everything then yeah cool all right you know that is Sony next topic Nintendo predictions for the Nintendo presentation taking place on Tuesday of E3 with a five each for this five each for them to get really weird yes let's go let's go Drag Kick is off right uh mind you not weird but I mean this is like whatever because it hears I think either going to come out they're going to extend the free online trial period for your Nintendo Switch okay we're still gathering data we're excited about the launch of Arms we've seen so much with Mario Kart we've decided to extend this through the holiday season okay you can try this for online online for free because it still doesn't work don't have the app ready and then cut out the words exactly yeah no I buy that yeah especially I'll get back to and we some other predictions but I want to I want to talk about that online service but okay okay so good Gogi words speaking of Jeremy done",
            "start": 2768.48
        },
        {
            "text": "yeah no I buy that yeah especially I'll get back to and we some other predictions but I want to I want to talk about that online service but okay okay so good Gogi words speaking of Jeremy done Rocket League Switch yeah that's a really good one too good fit yeah oh no yeah super good fit makes a lot of sense i they like getting more online games on there and we talked about in the morning show the ability to play it local with switches right is what would change it for me because the problem I have with it now is the fact that I loved Rocket League playing it before when we played any offers and demos and stuff and then when it finally came out went away for the weekend came back and everyone's doing amazing tricks I'm I can't even **** I there was a game where I just got **** shut out and eventually the guy just drove or I mean it circles with the ball he felt sorry for any other guy yeah so every time you play seventh that makes sense - especially with Nintendo's kind of focus",
            "start": 2823.89
        },
        {
            "text": "and eventually the guy just drove or I mean it circles with the ball he felt sorry for any other guy yeah so every time you play seventh that makes sense - especially with Nintendo's kind of focus on indie games of that caliber yeah so and the multiplayer focus and all that that's printing money for them I'm like yeah it's going to be a platform that they're going to keep adding to for like an hour two years probably yeah so they need to establish a mountain area and from talking to them a whole bunch of times they're totally about getting loans oh yeah they want it everywhere possible Super Smash Bros. Switch Deluxe super smash bros deluxe force which is basically what they did with Mario Kart but for smash yep it's good job so that is one of my predictions that's the one that I wanted to bring this up I think that they're going to push the online to be free because I think smash will be the the more premium thing when they actually institute paid online the prediction error you so",
            "start": 2866.01
        },
        {
            "text": "to bring this up, I think that they're going to push the online to be free because I think Smash Bros. will be the more premium thing when they actually institute paid online. The prediction error you see is for now, Nintendo gets like talking but guys on that. I'm sorry, I do buy those are going to push the online and it's up to them later. Does that make sense? Because I think that Smash Bros. is going to come next year, early next year in February, even. Any thoughts about days? No, no thoughts about dates. Um, yeah, do you have any thoughts on what the Smash Bros. port would be? What do you mean new characters? Oh, you mean like what they would add to it to make it like deluxe? I mean, obviously a new character or two would make sense. I think, my gosh, I think if they announced it at the Direct, they announced a new character specifically for this version, the tune. I think Wii U, anything yeah, or like an Arms character or somebody, I don't know another character makes sense so the prediction",
            "start": 2906.75
        },
        {
            "text": "they announced a new character specifically for this version, the tune I think Wings anything yeah or like an Arms character or somebody I don't know another character makes sense so the prediction prediction I have down for for Smash was it's going to mix the 3DS and Wii U stuff so it'll be able to smash run stuff in the 3DS and all the stages there were three that's exclusive and all the Wii U exclusive stages put those all together, there was a leaked image that came out a couple days ago that the validity of it is up for debate um but that would make a lot of sense and then yeah I think Ice Climbers returned I think that they would announce that during this and then I the get hyped a moment would be Ribbon Girl or the Spring Game from Arms or the Inklings but I also can see them kind of holding off for when those games are released in the next month two months after because Nintendo is all about taking Smash and using it to hype up the other games with the directs and stuff",
            "start": 2950.71
        },
        {
            "text": "kind of holding off for when those games are released in the next month two months after because Nintendo is all about taking Smash Bros. and using it to hype up the other games with the directs and stuff so like there'll be a direct for Arms and it ends with an ARMS character right so I can right yeah yeah make it a lot of sense but I do I don't think we're gonna see it this year but I do think we're gonna get it you know I want those extra characters is those weird like normal looking humans from Mario they need to be in an Odyssey level like right a foot to fight because how's that like Wii U trainer yeah like we fit trainers I have like somewhere weird one out of there guys yeah okay I might thing with the smashes I I'm interested in it in how it differs from Mario Kart because adding characters in Smash Bros. there's a lot of work and design right and Sakurai has been like working on Smash Bros. for so long and he's been saying I'm done I'm done I'm done for so long and he just keeps going back and",
            "start": 2997.33
        },
        {
            "text": "in Smash there's a lot of work and design right and Sakurai has been like working on Smash for so long and he's been saying I'm done, I'm done, I'm done for so long and he just keeps going back and noting land so I'm interested to see what he's working on and what his next game is if it's going to be more Smash or not this doesn't necessarily need him to lead it but knowing him and I've called games I imagine he'd be involved with the port intimately and there's not too many characters that I think that they could add to get that time frame but I do think that it's a safe bet for fighters, climbers, and one or two others I don't think makes it back though oh no you know I think DLC yeah I think I don't think there would be I'm in DLC P yes they this is their little version what's the interesting my agenda right now is they're kind of in a freaking weird place where they're just porting all the the Wii U games which is awesome because it's getting the great game a lot of people on yeah but",
            "start": 3039.84
        },
        {
            "text": "my agenda right now is they're in a freaking weird place where they're just porting all the Wii U games which is awesome because it's getting great games a lot of people on yeah but it's going to create a problem in a couple years when what so when are we getting the new Mario Kart when we get a new Smash Bros no time soon that's future Nintendo's problem yeah but I mean that future is coming up be rapidly approached when they get all our games on the first year of ports hi first prediction speaking of ports Pokémon Stars now coming in October we all have that one coming in October okay and the thing that I think is that change here is on both 3DS and Switch oh yeah no I wanted to be Switch exclusive for sure but it's not going to be you can't have a Pokémon game and not have it on the 3DS yes but they've been so careful not to like kind of count out the 3DS ask to be like yo this is your new handheld platform the fact that Fire Emblem Warriors is",
            "start": 3082.89
        },
        {
            "text": "not have it on three yes but they've been so careful not to like kind of - it totally counts as the 3DS ask to be like yo this is your new handheld platform the fact that Fire Emblem Warriors is coming out on Switch and 3DR is the one thing that I'm like out there totally turning down QTS XL all this they are not giving up on this 3D S and they might as well sell millions of units of Pokémon Stars to an audience that wants it and already has the system so and I think that it is enough it doesn't need to be exclusive on the Switch it's that game is not going to push people to buy a Switch in the way that a new Pokémon game would right so you might as well have it on available on both and I think that it I would convince the people that already have a 3DS to upgrade because now it makes sense with Zelda Mario Kart come on all that mmm number two they don't say a **** word about the Virtual Console oh you think yeah yeah that's a good call I",
            "start": 3126.6
        },
        {
            "text": "**** all upgrades because now it makes sense with The Legend of Zelda, Mario Kart. Come on, all that mmm number two, they don't say a **** word about the Virtual Console. Oh, you think yeah, yeah, that's a good call. I already get all hyped up that is going to happen any kind of happening and I say god damn worried about this fine it would be smart if they did but Koei has not been making like the smartest publicity moves. I feel like it intended I'm trying to now that I care about Nintendo, I'm trying to remember old directs and how people got hyped about certain things but how directs flow usually and how it'll have Hey, Mario Odyssey is what we're pushing and we're excited about this future thing and yeah but we an announcement or two here but it's what it's going to be about important thing to note about Nintendo's presentations they've made it very very clear that this is focusing on 2017 games and there I could somehow the 3D essence which line up specifically Switch 2017 games so if they didn't make",
            "start": 3169.62
        },
        {
            "text": "presentations they've made it very, very clear that this is focusing on 2017 games and there I could somehow the 3D essence which lines up specifically with switch 2017 games so if they didn't make a single announcement about a 2018 game I don't think that that would be a shock because when it kind of says they're going to talk about something in the direct they talk about that thing in the direct yeah when they say hey it's Platoon and or it's Arms you're getting a Splatoon trailer that's all you get there's no surprises or any of that **** but **** it man like I believe that they need to have some fun some I don't agree with you about the Virtual Console yeah yeah look at all my detail I'm gonna I'm jumping ahead of you guys making my next prediction I don't know if that's about you guys are predictions about the Virtual Console yeah hey mine's a direct opposition okay yeah I predict that there will be Virtual Console Talk I agree with you they're probably not gonna but I predicted",
            "start": 3213.19
        },
        {
            "text": "predictions about the Virtual Console yeah hey mine's a direct opposition okay yeah I predict that there will be Virtual Console talk I agree with you they're probably not gonna but I predicted the Gunman okay GameCube title support uh-huh and they got Xenoblade Chronicles finally being localized yeah if they're really listening to message boards do it okay okay do you think Nintendo is ready for message boards I think missing out on genders there he knows you know if Mother 3 is not announced at E3 I don't think it's ever going to happen so I think that now with Nintendo right now with giving certain groups what they want and I think that they they know they are aware of this happening and I think that if Virtual Console we talked about that they're going to announce a few games and Mother interesting Danny Born-1 my Odyssey release thing which will be mid November mm-hmm nailed it November 11th I put November how that's going on all right my weapon",
            "start": 3253.99
        },
        {
            "text": "announce game few games and mother interesting Danny O'Dwyer born one my Odyssey release thing which will be mid November mm-hmm nailed it November 11th I put November how that's going on all right my weapon intense and hard already dang it which one am I going to go with they are going to make a splashy show of all of the fun colored joy cons that you can buy attendance which we knew really there will be new colors there will be combos of colors there will be all kinds of colors of joy cons that are overpriced yeah we're gonna be excited but yes so I as a switch owner wish that I could have waited to buy joy cons but if you want to play Mario Kart with poor people you had to buy joy cons now every store I've ever watched only had the Greyjoy cons so hopefully they'll manufacture more but I invited them I anticipate lots of colored joy cons that they will be showing in their direct alright on the video to what Dr. Blip and looking to do alright yeah um we're I'm in my second holiday yeah",
            "start": 3300.37
        },
        {
            "text": "them I anticipate lots of colored Joy Cons that they will be showing in their direct alright on the video to what Dr. Mario and looking to do alright yeah um we're I'm in my second holiday yeah yeah you did it I did my third one and this is definitely a get hype moment internet browsers come to Switch no is that a good hunt that's a guess in hotels a lot and can't connect their Switch to the Internet I'm pretty hyped about the ability to jump in and do and I think that's wise I think that the I would hope that now that there's practical use cases out there like oh hey this is a mistake at the airport people can't **** download my games that's it that's trouble that's not a need to be presentation thing for them no no you need something attacked on and like we're making change I think that's just a firmware update at some point if you know what it said about other names I just yeah I don't think I don't see them focusing on the well the words out of my presentation well your your",
            "start": 3361.46
        },
        {
            "text": "that's just a firmware update at some point if you know what it said about other names I just yeah I don't think I don't see them focusing on the well the words out of my presentation well your your prediction is trash that's why I'm usin **** on me you got you got you get really rough oh do I do I that's the thing is like it's also scraping the bottom of the barrel now what else is there a couple good lines okay I think there will be a kind of a no-brainer I have to put a number on this they will announce let's say it's Cobalt at 15 indie games that are coming to Switch this year they'll have a presentation that will be like because it's totally yeah an Indie Noon or is it old news already did I mean ports of other name Indies that haven't come over like totally new game not just what we saw GDC because we saw a lot of GDC so much of GDC that I think 15 new announcements might be a bit much oh and no hmm I can imagine 15 I can tell more detail on the other things like release",
            "start": 3407.28
        },
        {
            "text": "what we saw GDC because we saw a lot of GDC so much of GDC that I think 15 new announcements might be a bit much oh and no hmm I can imagine 15 I can tell more detail on the other things like release dates like Maikelele Rush that and things like that I'll say ten okay ten new one else yeah of indie games yes okay all right well you know you kind of put a thorn in some of mine by reminding us that this was their presentation is going to be about stuff in 2017 because I have a couple here that are clearly not 2017 for addictions but I do think that we are going to see something about Animal Crossing on Switch back yeah I was one of my - I said tease animal crossing T's respect yeah no I mean yeah it's coming Animal Crossing Switch what's interesting about Animal Crossing is we know that the mobile game is coming it got pushed they said that the Zelda ones coming first if I remember right right on that but I wouldn't be surprised if the Animal Crossing mobile game and Animal Crossing",
            "start": 3452.47
        },
        {
            "text": "the mobile game is coming it got pushed they said that the Zelda ones coming first if I remember right right on that but I wouldn't be surprised if the Animal Crossing mobile game and Animal Crossing Switch had some type of cross situation going on so I can see them teasing both if they do talk beyond 2017 which I don't think they're gonna but yeah **** **** yeah my next one I got a jump on this **** before someone else even **** mentions the word mmm word Metroid yeah there's a big question of will it even be mentioned at all I think that it will in fact I'm gonna predict some crazy **** here I think that both Metroid and Retro Studios' game will be announced now that's a weird statement what do you mean they're him I think that if Retro is working on Metroid that'll be it if Rachel's not working on that roid whoever is they'll be announced and we'll see retros being on it will be announced gotcha so if it's retro retro retro one game if it's retro not doing Metro -",
            "start": 3501.97
        },
        {
            "text": "be it if Rachel's not working on that game, whoever is they'll be announced and we'll see being on it will be announced gotcha so if it's Retro Studios one game if it's Retro not doing Metro - gasps gotcha Fianna interesting interesting that's a fascinating one what do you ask am I Metroid? I think this one of those like uh hopes and dreams yeah but it's one of those that you predict every time and it's got to happen of surely right I think I think that the Retro side of it is the more interesting part because they have to have something to announce at this point it's been Tropical Freeze with years i/o so I don't know but you think it'd be this year - nothing I don't know there's no chance in hell that the Metro gang comes out this year that's not like this is based on what Nintendo's saying these are not going to be predictions that happen but I don't want I almost prefer them to be on a new IP or something because then it's tentative actually had",
            "start": 3555.1
        },
        {
            "text": "Is based on what Nintendo's saying these are not going to be predictions that happen, but I don't want them to be on a new IP or something because then Nintendo actually had success with new IPs in the past couple of years and made sure one of those franchises sold way more in North America than it did in Japan, so that love doesn't seem to be there either. So I don't know, like Retro Studios, American, so right, like I don't know, this there's a lot going on with that, but the thing is, like, there's been rumors of a 2D Metroid game, there's Metroid Prime, this 2D Metroid, there's like what else could it be? Retro Studios working on Donkey Kong Country Returns again, like I don't know, but there you go. Some of mine haven't burned out yet, so now I'm going into the relief bag here on the fly. Nintendo is gonna doubt can a dumb partnership with some random business, it'll be like you can go to Bean Pole or Subway and use their Wi-Fi to try new games somewhere.",
            "start": 3604.34
        },
        {
            "text": "the relief bag here at E3 Nintendo is gonna announce a dumb partnership with some random business it'll be like you can go to Starbucks or Subway and use their Wi-Fi to try new games or somewhere that's like that some stupid-ass scholarship you get and you get a game good or whatever you can get a new avatar for your thing okay mmm I mean nobody's mentioned the \"Ravager\" right so oh oh yeah I feel like they release a lock because I know outside of that right because that's like that's a little bit too obvious Ubisoft I like the way they keep coming back like they just love supporting the Switch and oh god a thick and thin and I think they're going to announce I don't think any of the 2017 titles or stuff is going to come out and I can't see any Far Cry or new Assassin's Creed on screen that's not coming to switch but I do think that maybe there's an outside chance they might do some of because they've done a lot of re-releases so maybe the AC to re-release stuff ends up on",
            "start": 3641.72
        },
        {
            "text": "screen that's not coming to Switch but I do think that maybe there's an outside chance they might re-release some of their older titles, like Assassin's Creed, so you can add them to your collection. Yes, something in that sort of throwback style would be cool, rather than just releasing old stuff again. The Ezio Collection is probably a good example. I like your optimism, but I think those games are too big for Switch and it's too much work to port them over. More accurately, because God of War is already on the system, I'm kind of gonna tag-team you on this very soft Nintendo thing - in no way are we not seeing Just Dance on the Switch right now.",
            "start": 3691.64
        },
        {
            "text": "because in no way are we not seeing Just Dance on the Switch right so I didn't know if I wanted to save that for the third party pretty girl just answers lost oh well really no I can new the new Just Dance oh because Just Dance is going to have another iteration they're going to do a new one because it's Ubisoft, their bread and butter, makes lots of money there will be a new one probably announced on Monday you be so that's the thing is I think you know when Tuesday morning Nintendo will say this new Just Dance is coming to Switch you'd be wise but you asked fine yeah am I if they do that I don't think they want to say I think it'll be like in a montage or something because I do think that that's an announcement not only ya know and that's why I'm kind of confused about you know like where it would fit better I mean I have some other like pipe dream predictions like F-Zero on the Switch but that's never happening this year so many not this year the crazy thing about that Zero and this is me",
            "start": 3737.43
        },
        {
            "text": "fit better I mean I have some other like pipe dream predictions like F-Zero on the Switch, but that's never happening this year. So many not this year. The crazy thing about that Zero and this is me just being super hopeful is if the GameCube Virtual Console support comes, I do think that we'll see F-Zero GX which is the best friend of F-Zero game of all time. I think if the game keeps tough their lead with the like beautiful Joe what are they what was I call like the five the the was that set of games called a came out on GameCube was like the the five really good games in all they were all part of whatever and I was talking about maybe they won't because clearly no one remembers yes the virtual console thing is interesting because there's been rumors from Eurogamer from a long time ago of Melee, Luigi's Mansion and right Mario Sunshine coming more sunshine Emily P on because of Odyssey coming out but Smash Bros. Melee would be a bombshell announcement of that being",
            "start": 3780.27
        },
        {
            "text": "Time ago of Mario's Melee and right Luigi's Mansion, and then Mario Sunshine coming more sunshine. Emily P on because of Odyssey coming out, but Smash Bros. Melee would be a bombshell announcement of that being portable on the Switch, and if they did announce GameCube Virtual Console for this year with Smash Bros., it would make a bit more sense, I think. F-Zero is a good chat room that consoles made first. I've got to like Thumper, and what was the other one that came out? The Wipeout-like... oh yeah, June. Yeah, I think it works really well. I yeah, I think that's a good thing. All right, she's dead. Does it wasn't yours? No no no, she tag-team okay cool cool. My last one: FromSoftware's game first, which will be announced. We saw their logo on the... oh yeah, thing a long time ago. I think it's either going to be a new IP, but more likely it'll be Dark Souls 3 port. Whoa, I'm gonna call that's just... I do you think Dark Souls?",
            "start": 3823.26
        },
        {
            "text": "we saw their logo on the oh yeah thing a long time ago I think it's either going to be a new IP but more likely it'll be Dark Souls 3 port whoa I'm gonna call that's just I do you think dark sauce on a switch yeah feels like there's my cool casual fun thing and like no that's why I think that there's a chance it might be a new IP right instead could be working on two new IPs but that's the other thing I'm like I feel like it's more likely we get just at this three port I got some other **** and yeah well this is tying into my I'm gonna give you now a little bit of wind up painting your picture Reggie Fils-Aimé's up there is talking about this stuff right he's like what ways have you had it no Reggie uh well I mean it won't be up there at some stage I'm he's all gassed up got it yeah alright Reggie thing is Reggie kind of part of it yet ready hunter not a part of any of you spent wise time to ring them back alright i riding back with you we need to put up this hack bill now",
            "start": 3869.71
        },
        {
            "text": "Reggie Fils-Aimé is Reggie kind of part of it yet ready Hunter not a part of any of you spent wise time to ring them back alright I'm riding back with you we need to put up this hack bill now the good news is watch a random-ass dude and we're not now we're bringing it back and ready to update is giving us members of the Treehouse they're not random a stasis wall me but they're not like personalities that we know we're learning them now but they're not like the iconic it's not Bill and then five different yeah Reggie's out there he's talking about how well the Switch has been doing but can they do better that's why this year they're announcing a whole bunch of little little tweaks to make it better the internet browser I'm not coming in this firmware also included in a future firmware the ability to transfer your saves to the little memory stick because that's such a big deal you're saving all your **** locked in not no more we understand we screwed that up",
            "start": 3918.88
        },
        {
            "text": "future firmware the ability to transfer your saves to the little memory stick because that's such a big deal you're saving all your **** locked in not no more we understand we screwed that up we're fixing that for you I'm Reggie alright now let's talk about how you can go to dominos thank you Peter with it as well alright topic 3 Microsoft alright got a beautiful Android yeah I mean are you ready because I'm bringing the Thunder we need I got the one where I'm going to hear I'm going to turn heads and I'm going to be right on a lot of it okay I guess what's going to happen the developers from Supermassive Games will come out on stage and announce their next game and it will have a window of Xbox exclusivity these would be Until Dawn guys yeah is it a sequel in so long no new idea new game we're coming out we want one on Sony owns Until Dawn oh yeah let's all go to the PlayStation conference that's a **** game that I want to see share gone to Supermassive they said earlier that you know",
            "start": 3955.75
        },
        {
            "text": "coming out we want one on Sony owns Until Dawn oh yeah let's all go to the PlayStation conference that's a **** game that I want to see Share of Gone to Supermassive they said earlier that you know like a year ago they wanted they wanted to go multi-platform they wanted to reach more people I think this is their chance to do it I think Xbox has the money to throw behind it be like hey guys we're the ones who brought you Until Dawn or the horror game so many people like yeah we're this is our new thing or it's going to come here and it run fast on Scorpio yeah we're going to hear that along yeah okay should we get into the hardware already now I'm not I feel like I post too much that stuff ready see if these released like yeah that's not looking better don't say they have to get that game out yeah you what do you think it is going to be earlier like like it I could say August August or September I something it sounds good I did they just need to get that game out there like they need",
            "start": 4002.07
        },
        {
            "text": "Out, yeah, you what do you think it is going to be earlier like, like it. I could say August or September, I something it sounds good. I did they just need to get that game out there, like they need exclusive games, they need to pave the way for more exciting exclusive games. I think that's partly going to come up in the next little bit and that that's like part of the old thing that they just need to get it done. Yeah, um, well I'm not waiting to poach and poaching so I think they're going to obviously give a price point for Scorpio. I'd love it, I think the base model in $449 premium model up to $599. Mmm, I'll depend on a hard drive size, okay. Bigger the hard drive they get a price tag over sir. I think that $449 feels like a good price. They can't come in at $500 as their base models too high, 400 is too low for them to make money on this for $49 feels right. Yeah, but they will have a premium version for more splendid. That's interesting the idea of them how because the messaging on Scorpio",
            "start": 4037.83
        },
        {
            "text": "400 is too low for them to make money on this for 49 feels right, yeah, but they will have a premium version for more. That's interesting - the idea of them how because the messaging on Scorpio is already is a little bit tough for them because it's like an iteration, so having an iteration on an iteration...it's all fun for them to do, but that doesn't repair forms though. Dem tariffs no man, plus all that slop in the hot Howard super excited I see their slogan go to opposition yours oh no more details okay more hundo November it is called the Xbox One Elite. Oh okay what do you guys think? It's going to go...I think that's a nice guess, I think they are already using elite for their the controllers right, which is why I think it makes sense and especially the 360 elite it's legacy with it. Um I think you're wrong about that $400 price point because it makes it makes it like this...I mean I just think you're wrong but I think um yeah is we're going to get a name it's not going",
            "start": 4091.92
        },
        {
            "text": "with it um I think you're wrong about that $400 price point because it makes it makes it like this I mean I just think you're wrong but I think um yeah is we're going to get a name it's not going to be called Scorpio we're going to get an official alright yeah to be fair I think that you're 450 makes a lot more sense because I think 500 is just too high for what this is and for Xboxes placing the market space right now but I I wouldn't have thought a 450 and I didn't want to change mom so I'm sticking to what the prediction says I'm a fair player but I 450 it sounds like such a weird number to put out there but I think there are 49 yeah okay all right 9 area I do think that it's going to be like that my real safe prediction is that it's under 500 because or else I think they're shooting themselves in the foot in a way that they can't alright so are you copying my prediction no I'm staying to the $400 that was really comes your price right now like do I want to get in on this train or",
            "start": 4150.99
        },
        {
            "text": "themselves in the foot in a way that they can't alright so are you copying my prediction no I'm staying to the 404 that was really comes your price right now like do I want to get in on this train or do I want because I have a Scorpio prediction right in the sticks here I think a lot of them are really good I'm gonna skip it may be funny to come back to it let's go out early well you know whoever's up there until Spencer whoever that's like it with another exciting partnership to and ends lights go out screens black screen comes up it is the FromSoftware logo some **** nerdy ass on none of us recognize plays but back home more Sion bursts into tears because it's Armored Core and coming home we back next Armored Core is exclusive to Xbox he can't **** believe it none of us care a whole bunch of dorky Rizzuto and holy **** are you excited that's awesome that is like exactly that type of excuse if they don't need now get the hardcore gamers a little niche audience niche audiences",
            "start": 4202.38
        },
        {
            "text": "bunch of dorky Rocco Ritchie and holy **** are you excited that's awesome that is like exactly that type of excuse if they don't need now get the hardcore gamers a little niche audience niche audiences in there okay so Oculus is not going to be at the show right I don't know it's not going to be at least they're not going to be three by the really honor booth no okay you know that's good they should not write me to lay low for like well it's been a weird year for them yeah well Microsoft's VR stuff has been like hooked on to Oculus since you know how do we think PS bureau's done Chris Ani I mean it's better than what they thought incredibly well yeah so I can kind of swing both ways on this one I can kind of see them not mentioning Oculus at all which is dangerous because is their last time talk to their consumers BSX is obviously you know it's only two bytes is Jerry with this stuff but it's such a disaster sign of rockets I feel like Oculus would not want to talk about anything so what's",
            "start": 4254.73
        },
        {
            "text": "to their consumers bX is obviously you know it's only two bytes is Jerry with this stuff but it's such a disaster sign of rockets I feel like Oculus would not want to talk about anything so what's your prediction my prediction is that they will mention it in like passing like as part of the Scorpio reveal, Stella voice they will say yes they will make mention that VR savour is going to be prior I'm going to talk about in a future tango that there won't be like a montage of here's all the beautiful we are doing yeah they'll mention that like in the same way you were saying our PlayStation 4 Pro works really good for VR and whatnot that they'll allude to us but they'll be very light on the details with your I disagree my prediction is that Xbox VR will be announced at E3, what better way to debut Xbox VR than with Project Scorpio got this new fancy console that runs really well you got VR VR has done really well for PlayStation a lot of money is going into VR right now it's like the new",
            "start": 4311.13
        },
        {
            "text": "debut Xbox VR than with Project Scorpio got this new fancy console that runs really well you got VR, VR has done really well for PlayStation a lot of money is going into VR right now it's like the new hot thing in DC everyone's talking about VR and investing in VR much like eSports but Xbox is already in eSports so they need to get into VR and HoloLens is not it HoloLens is not going to be a gaming thing it's going to go to business, HoloLens is going to be strictly for the Microsoft side of things so Xbox needs its headset in a Ted set is Xbox VR I don't know if that's the name of it yeah but I really feel like now is one elite BR now is the time for them to get into VR because if they don't do it now then they're going to miss the boat and launching this brand-new powerful console it makes sense I mean ideally I would love this I mean that's a cool announcement I feel like it would just be muddy the water I think they want to focus so much on Scorpio that I'm launching another piece",
            "start": 4356.22
        },
        {
            "text": "Sense I mean ideally I would love this, I mean that's a cool announcement. I feel like it would just muddy the water. I think they want to focus so much on Scorpio that launching another piece of hardware and console would be tough. Okay, you don't have to agree with me; it's often a balance though. I was like, \"I forget what you said.\" Good if they don't even show it when do they do it? Yeah, so it's all like it's both the right time to do it and also the wrong time to do it as well. It's like I'm just not sold on the whole VR being a success thing. I feel like in terms of making money for Sony, like I'm sure that it did and it works for them, but like when you look at their lineup and we'll see what they announced at the conference, but like there's nothing coming right like you had it; it's like I just tell you about Special Delivery and okay next week because a little thing like that, but like there's not just like schedule of lineup of games coming out over this year even like",
            "start": 4406.56
        },
        {
            "text": "like I just tell you about special delivery and okay next week because a little things like that but like there's not just like schedule of lineup of games coming out over the this year even like that even though maybe they're gonna announce them all at e3 that's I'm saying but like I don't think there's a ton of so I don't know I think that the VR thing was more of a PlayStation Move style like it's going to be here for a second then it's gone obviously VR is here to stay in the grand scheme of things but I think in terms of dedicated video game supports and it being like another pillar to me the big guys I think that it's more on the like smaller niche gimmicky side than it is like full bore into it cerebral bore alright fine that's fine you talk big I'm gonna jump around here I have some good ones you know Cuphead okay damn it that was my next one cancelled tough head release date when little wrote in my notes shit-or-get-off-the-pot again I perform it available tonight",
            "start": 4445.8
        },
        {
            "text": "good ones you know **** it Cuphead okay damn it that was my next one cancelled tough head release date when Little did write in my notes shit-or-get-off-the-pot again I perform it available tonight hopefully I could totally see that and I'd that be ID I would feel good I would caution you to take the get hype tag off it just put that in your real prediction that's actually a really good one **** sure there you go again we talked about just cost us a point okay how they really did de-biasse that's really going where do I want to go next where I wanna go next for the one you say you know get them all don't want anybody have a lot of empty space on the page and then there's none it's jam-packed with information I didn't think it'd show the page crack down it's just a trailer it looks incredibly different in everyone panic I totally agree I think it's going to be very different than the last time we saw it and do you think there's any release window I think it would honestly be really mean",
            "start": 4492.15
        },
        {
            "text": "different in everyone panic I totally agree I think it's going to be very different than the last time we saw it and do you think there's any release window I think it would honestly be really mean because like I think it'd be a hat in hand moment for them of like hey glad you asked about Crackdown we're already excited to show it it's not it did we got off track and we had to restart it in the team back at Turn 10 has been working really hard and they're excited to show you what it is now I think it's gonna be a Scorpio launch title feel like it has to be it kinda has to be and I'll double down on that was it I'll just double down and I think that that also announced for tomorrow Sunset Overdrive as a launched is that your prediction yeah see you're saying Crackdown is your prediction is what I'm saying yes yeah yeah yeah so",
            "start": 4545.55
        },
        {
            "text": "you're saying Crackdown is your friction is to Scorpio launch that's right, it's fine am I taking two though I'm not asking you I know that's one prediction is what I'm saying yes yeah yeah yeah so your prediction is both of the games will be launched on the show you know they need like Scorpio if it's all about the graphics and running well like it's a no-brainer that the car game is the thing that they push it out there with um there's a long story history of Microsoft consoles getting shipped with sexy looking car games and they told you need that I'm here yeah it's it's a bit of a no-brainer turns an old trial - mm okay so this one that I have I don't think it's going to be exclusive but we will see maybe a teaser trailer for Shadow of the Tomb Raider a really good one yes so there was uh I use leak in air quotes because somebody had their PowerPoint principal yeah open on a train like an idiot somebody who snapped a shot over his shoulder he had",
            "start": 4589.56
        },
        {
            "text": "really good one yes so there was uh i use leak in air quotes because somebody had their powerpoint principal yeah open on a train like an **** somebody who snapped a shot over his shoulder he had a deck that said general the Tomb Raider obviously you know we know that something else is coming so I think now's a good time to maybe do it either I don't think we get that sounds about right because this last year the fall is when we got the definitive edition whatever ten years all right right into that amount a year before that so yeah man that makes us good that's good I like that I'm an exciting trying to figure out the order of these guys I'm just going to drop it here Borderlands 3 announced obviously not exclusive well it's already been announced but like more dug detail but maybe like a trailer or something like that okay okay okay interchange next on stage of Xbox so yeah that's I don't think you would be anywhere else I feel like when they announced it like hey we're casting",
            "start": 4643.68
        },
        {
            "text": "a trailer or something like that okay okay okay interchange next on stage of Xbox so yeah that's I don't think you would be anywhere else I feel like when they announced it like hey we're casting for Borderlands here whatever they said they were looking for teammate it seems so not not that long ago if that makes sense it seems like it was so recent that that said I would be to see how far along they are with that but they're ready to do that that's a good one I'm just thinking I feel like Xbox needs its exclusives and also a presence during the event well Halo has been quiet for a long time so I don't know if feels right to me let me tell you when that announcement was I'm looking because now I want to know sure yeah it feels like it was recent but it can't be that reason I don't know I have to find it now but I'm telling you and I know like I'm not saying Don's games are announced but though I'm not saying it names I'm just now I'm trying to think",
            "start": 4694.35
        },
        {
            "text": "\"Reason I don't know, I have to find it now, but I'm telling you, and I know, like I'm not saying that Dying Light games are announced, but though I'm not saying it's named, I'm just now trying to think about how far along the game would be in production where it would be. But I guess it's been so long since Dying Light 2 - yeah - as well, it's a national grade all right. This is it, stick with me because it's gonna obviously this is going to happen, but I mean like it's going to happen. State of Decay 2 is going to get a huge push, like suddenly this is a triple-A Halo push, like that. Like they say, okay, one beloved by fans like me, but super small team, Undead Labs, great folks up in Seattle, but I mean now they're going to come out and there it's going to be State of Decay 2 is happening, it's awesome. Here's this giant thing, like make a huge deal about this game with the show in a way that's indicating nobody ever did care about it. Got the cool zombie game, we got anyway, we'll talk about\"",
            "start": 4738.36
        },
        {
            "text": "here's this giant thing like make a huge **** deal about this game with the show in a way that's indicating nobody ever did came to roll I got the cool zombie game we got anyway we'll talk about a lone gears no because phil wore that t-shirt right now it's a big deal exactly well it's all they got they're reaching back in the quiver and they got like any arrows hmm okay I'll buy it it's a pretty big outside bass but I feel like if it's gonna if it was to pop up on any of the console manufacturers stages it might be too early to be doing this but I think I think we could see a trailer or at least some sort of information about PlayerUnknown's Battlegrounds going to console oh I think that's a good bet and they need that would be a nice gap for Microsoft because they need to build that community right yes and it's like you know they don't have that man a lot of their online games before the Gears of War for essence of having like latched on to people and I think that's a really good",
            "start": 4782.13
        },
        {
            "text": "Right, yes, and it's like you know they don't have that man a lot of their online games before the Gears of War for essence of having like latched on to people. And I think that's a really good like that's a really smart but it might be a bit too early. I heard and now it's definitely if I don't you really should talk about it, and like to kind of claim ownership over the brands that people think Xbox when they think about this game everybody's been excited about on PC and we're gonna happy to announce that we are working right now to bring it to it yeah okay I need to look better on Scorpios. Yeah how many we should think that's on how many times they're gonna mention that oh yeah come back Craven just make it a drinking game yeah Lord how many times did they say Scorpio, they don't because they announced the name of the new console which is awesome okay um I think we will hear about Minecraft this monster hey yeah yeah the game I get I get press releases from Minecraft like every other.",
            "start": 4831.21
        },
        {
            "text": "they announced the name of the new console which is awesome okay um i think we will hear about Minecraft this monster hey yeah yeah the game i get i get press releases from Minecraft like every other week thats a tldr at the top of them which i think is hysterical um but obviously this is a giant franchise for them they spent a lot of money it makes them a lot of money still clearly its going to be coming to Scorpio if its going to be a new iteration if theres going to be something different that theyre doing with it i think theyre going to announce something new for Minecraft on stage at e3 it kind of have to right like they spend all that money yeah like two billion dollars yeah its my house when we were preparing for this i was like oh switch i guess ill do Minecraft and its already commented even though we came out like Jimmy oh yeah but yeah thats a good check what do you think itll be like things with Minecraft 2 or you know isnt that realm I dont know",
            "start": 4868.8
        },
        {
            "text": "it's already commented even though we came out like Jimmy, oh yeah, but yeah that's a good check, what do you think it'll be like things with Minecraft 2 or you know isn't that Realm? I don't know Minecraft so I am not sure about this but I remember last year that I really went into it, yeah, so that was kind of like the the world that they were they added, I don't actively play Minecraft, I don't think that it's going to be Minecraft - I think that would be really cool but I think that goes against the entire community in the world that they've created, I don't think that they would want to ask because millions and millions of players around the world to like move to a new thing, I think that's a living breathing ecosystem and that they're just going to add to it, I don't think they're going to make a new Minecraft, it just still have like really your high concurrence on this like I have nobody, oh my god yeah yeah wow if you ever want to get off those two Minecraft emails what happened to",
            "start": 4931.32
        },
        {
            "text": "to make a new Minecraft it just still have like really your high concurrence on this like I have nobody oh my god yeah yeah wow if you ever want to get off those two Minecraft emails what happened to me is I got hit up like hey I'm a Minecraft dev first I was like awesome like hey could we do a desk side visit I'm like I'll be honest I only play on PlayStation Vita never one email again email about my hair this is our fourth correct yes yeah yeah okay see this is one that I I don't have too much faith in but I feel like it's time to be announced somewhere and I think that Microsoft would do very well off having this Rocksteady announces a new DC game Oh doctor get height moment being Batman Beyond Jesus Christ they said that they're done working on Batman I know Batman Beyond is different that's what I'm saying they're done with our arc oh you know yes there's that III think more likely would be a Justice League or something of that nature yes something DC and like that would really",
            "start": 4974.7
        },
        {
            "text": "that's what I'm saying they're done with our arc oh you know yes there's that III think more likely would be a Justice League or something of that nature yes something DC and like that would really I think myself having that sets up the Sony having Marvel yeah Microsoft's having T something which is why the Avengers thing you brought up was interesting earlier about it being at Microsoft's because that would be huge for them and based off the crystal stuff that makes a lot of sense but I can see them kind of trying to do what makes a lot of sense yeah see beers are so hot and that would be I mean a reason for I think a lot of gamers get excited about Xbox one flash Scorpion no no that's a good one too I like that Greg what do you think I might say my next one real hard so great question for you about to rock another dangerous roster day and after this game at E3 yeah do you think it'll be at Microsoft or where would that be a great question you know I mean like I do have a",
            "start": 5030.94
        },
        {
            "text": "question for you about to rock another dangerous roster day and after this game at E3, yeah do you think it'll be at Microsoft or where would that be a great question? You know I mean like I do have a relationship with Sony that I'm in the PlayStation VR deal, you know I mean that was Rocksteady proper, that wasn't the guys I was but all the normal duties and Sefton whatnot. Arkham Knight was that PlayStation correct, I want to say yes that sounds right, sounds right as well. But I mean I myself need Microsoft R I go really hard at it yet especially if you do have Spider-Man. Leo, my final prediction for Xbox is conference Phil Spencer shocks the world and stays in a one t-shirt under blazer the whole time just one not going to do this whole thing not going to give him the internet meme isn't gonna be changing it up alright just here's what I'm wearing and that's it that's kind of a lame prediction you know like Andrea Rene there are no lame predictions just lame listeners oh okay if",
            "start": 5073.88
        },
        {
            "text": "not gonna be changing it up alright just here's what I'm wearing and that's it that's kind of a lame prediction you know like Andrea Rene there are no lame predictions just lame listeners oh okay if you're not if you're listening at home I'm pointing at her I mean yeah he's calling me a lame listener I'm glad you went for a lame prediction because I'm in the world of lame predictions right now and okay so Microsoft's biggest problem is that last year is like all the exclusive games they're pushing for the past couple years either ended up being wet blankets or didn't come out you know between Sea of Thieves and ReCore or and like even even stuff like like you're already good at Rocket League and Quantum Break like I mean State of Decay 2 was a good game but it didn't light the world on fire Quantum Break was a good game but it was too attached to that TV game I just it was had suffer from save issues on the Xbox One X that did but it was made for a different machine and in a different era pulled in a different way so I",
            "start": 5112.79
        },
        {
            "text": "good game but it was too attached that TV game I just it was had suffer from save on the crack that did but it was made for a different machine and the a different era pulled in a different way so I think they are going to have to announce a bunch of new games I'm not sure if I'm not sure if like the IP back catalogue they have is good enough for like more sequels like I would I kind of worry about Gears of War trilogy like I do at the new Halo 2 the second halo trilogy where like I don't know if they have that really rich stuff so I think they're going to announce in some form three new IPs well okay and in some sort of they have a lot of studios they're working on stuff like new franchises or games within an existing franchise I don't want to rule out the idea that they might we imagine a franchise that came in 15 years ago some way but like I think how they will write I think they all but I think there will be you know non-sequel exclusive games and I'm still on Xbox one but like a lot of",
            "start": 5154.94
        },
        {
            "text": "that came in 15 years ago some way but like I think how they will write I think they all but I think there will be you know non-sequel exclusive games and I'm still xbox one but like a lot of them probably at least three at least yeah okay no interesting I was also going to say goes well I was a fan new triple-a IP is announced because I need one but instead so I'm toying with the idea I have two up to I like this so I'm just going to say that if I taking one of yours let me know okay it won't the first one is like a simple one that I think is like a no-brainer for them which is you can bring your custom controller to the Scorpio oh yeah they made a big push about making these customized controllers it would not make sense if you could not use it on Scorpio I think that'll be like an easy I think all of it yeah yeah any Xbox controller workaround for sure the real prediction is we get a teaser of the next Halo game because we have to see Master Chief or something from 343 its Xbox",
            "start": 5201.18
        },
        {
            "text": "I think all of it, yeah, yeah. Any Xbox controller workaround for sure. The real prediction is we get a teaser of the next Halo game because we have to see Master Chief or something from 343 Industries - it's Xbox; they're synonymous, they go hand-in-hand. I don't think it's going to be a big trailer; I don't think it's going to be gameplay similar to the one where Steve was in the desert and had the poncho on, right on spot. So Halo is an interesting thing - last week we had or two weeks ago we had Sean Finegan talking about Halo, and Annette and hey, oh yeah, here to talk about Halo, and we're talking about what we think is going to be shown there's been a lot going on with 343 Industries where they're talking about Hero 6 will not be at E3 right; they confirmed that they also confirmed they're not doing the Halo 3 ten-year anniversary which would go against what they've done with the 10 year anniversary of you and one, ten years of yeah but they have Master Chief collection so right like they don't necessarily need to do that cuz.",
            "start": 5255.06
        },
        {
            "text": "which would go against what they've done with the 10 year anniversary of Halo and one ten years of yeah but they have Master Chief Collection so right like they don't necessarily need to do that cuz that already kind of gave a lot of the upgrades that a new version would in or Surrey but all those hail it was but they said that they were are going to do something at E3 so my thing is do we believe them like I I'm kind of with you where it's like I can see them just announcing Halo set right like putting out some type of teaser they said is that they're not going to go people **** a lie all the time you have to because I but the guy you caught us see our to be there yeah there's give me some Halo in some form in it that could be some Hololens **** it could be if there is the are some VR experience or whatever Halo VR you guys so I mean it could be thing good it definitely could but I don't think we're going to see Halo 6 and I think that that's sad because they should but whatever",
            "start": 5304.23
        },
        {
            "text": "experience or whatever Halo VR you guys, so I mean it could be a good thing. It definitely could, but I don't think we're going to see Halo 6 and I think that's sad because they should, but whatever. My prediction is that Microsoft needs some big IPs and without Halo or Gears, they're lacking in that like exclusive huge shooter. I almost feel like Halo isn't what it used to be, but it still sells above the rest in terms of sales within the partnership. What's Call of Duty done to them? I think it really hurt them absolutely. And also PlayStation 4 is just had a meteoric rise over the Xbox one in terms of sales, so it's like that all other third parties and stuff makes sense. But with Scorpio, they need to have some huge exclusive deal. This is an exciting thing for gamers to buy an Xbox One, so I think that it is a Hail Mary because there's not much that they have - Perfect Dark carry the same I",
            "start": 5342.67
        },
        {
            "text": "of this is an exciting thing to get PlayStation for gamers to buy an Xbox One, so I think that it's a Hail Mary because there's not much that they have. Perfect Dark, yeah, Perfect Dark carry the same. I know that it could no, I think I think this new generation does not even know what Perfect Darkness is, but I think it's the perfect time to it's a cool ass um like franchise and I think they're like that while the last one was not good, I think that it's been long enough that they don't need to listen any pre-existing things and I think that they can Tomb Raider it in a lot of ways okay and bring it back and make a huge deal out of it and make people care and I think that it could set itself apart from a lot of the other shooters that we have going on. Timesplitters get to answer this, oh my what I would that would be crazy panic levels for me of just a new **** times what are you kidding me so I put a new show idea okay when with him in like one you know they have those shows real like you",
            "start": 5396.85
        },
        {
            "text": "I would love to see a new **** times, what are you kidding me? So I put a new show idea out with him in like one, you know they have those shows, real life like you live in the 70s again, yeah, 70. Just put him in a room and like, yeah, 1999, yeah, yeah, perfect. I'm totally into it. Want to show you that but I think that they need to come back with some stuff and like they just don't have too many like big surprise things that they can come back with because you have the new IPs we did, they definitely need new IPs, but I don't think that it's going to be a new IP that really converts a lot of people right to the Scorpio. So I think you think perfect dark is going to be my IP that converts people, I I think that it is way more when they don't have a Halo nothing like we don't even know what I think you're crazy, I think I think there's so many gamers who have no idea what that game is like Tomb Raider is different because Tomb Raider is",
            "start": 5442.46
        },
        {
            "text": "don't have a Halo, nothing like we don't even know what I think you're crazy, I think I think there's so many gamers who have no idea what that game is like Tomb Raider is different because Tomb Raider is a gigantic IP that everybody knows even if you don't play video games you know Tomb Raider yeah but Perfect Dark, even if you didn't play it growing up you've heard about it, you've heard like though I do agree that even if you don't know these to do and see how many we love heard a Perfect Dark argument is that there's so many people that even if they didn't hear about it the moment that they heard about and everyone else is making a big deal they're going to be like oh **** and they're gonna fake an act, I think we've been burned by that because it was the 360 Perfect Dark and then the other Perfect Dark, you love it, that was another like read R1 was awesome so it to me Perfect Dark was one of those games that like people who didn't own a Xbox thought was",
            "start": 5482.9
        },
        {
            "text": "dark and then the other perverts are you love it that was another like read r1 was awesome so it to me perfect are what was one of those games that like people who didn't own a ps2 she thought was good like here we go getting great that's like oh my god it was like all right dark the problem was it was just trying to NPC for perfect art we're just trying to chase what goal and I was right and by the time it got there my god he just wasn't as good at goldeneye he gamers dawn I think about going oh there was no i job you were so there was always an alien yeah I don't remember I remember odd sorry to break your heart but I mean you're crazy but I also think that like with the political climate where now joanna dark being a female protagonist games these days like that it's on trend i think this makes a lot of sense and i think that it could compete not with the Halos but it could be a more on the like horizon level of properties for xbox and i think that that is an exciting announcement",
            "start": 5519.5
        },
        {
            "text": "makes a lot of sense and i think that it could compete not with the Halos but it could be a more on the like horizon level of properties for Xbox and i think that that is an exciting announcement when they don't really have much you know I mean with this argument they should just bring wet they should buy wet wet it no no yeah wetter that's a better one I just yeah I feel like they don't know what to do they're all licenses like even Dead Rising like in a time where they didn't have that many exclusive like things to really cherish they kind of chop the 400 arriving like it's a fine game but they're beyond the point of having meetings yeah you can't have fine games down that's all it's coming up exactly alright now that we're done the prediction Glenn Xbox is there any last statements on Xbox yes I think we'll hear about more about the Xbox Game Pass oh yeah we've got to close yeah yeah yeah I didn't hear a lot about it actually I think they I think they'll spend as much time",
            "start": 5563.84
        },
        {
            "text": "on Xbox yes I think we'll hear about more about the Xbox Game Pass oh yeah we've got to close yeah yeah yeah I didn't hear a lot about it actually I think they I think they'll spend as much time talking about it as they did about backwards-compatibility a couple years ago and I think that they're gonna knock it out of the park they're going to bring some really big titles to Game Pass because as much as I think you know the games with gold and the PlayStation Plus free games every month are a fantastic added value to your subscription I think a lot of the games they bring to those programs are so old that it doesn't even matter that you get them for free because no one really wants to play them anyway I think they're going to bring some really good recent games their exclusives to Game Pass that are people that will incentivize people to buy I mean real big games like The Master Chief Collection with Scorpio support because that would kill it absolutely like their Halo game then",
            "start": 5603.97
        },
        {
            "text": "Are people that will incentivize people to buy, I mean, real big games like The Master Chief Collection with Scorpio support because that would kill ya, it absolutely like their Halo game. Then yeah, I mean, honestly you guys, that I could totally see that happen right? They're going to come out, they're going to talk hardware straight away; it's just going to be a 15 minutes of this is the score and I mean that's what they need to do. And then they'll talk about games like... if that's not the way this goes down, then they're in big trouble. This is kind of like a last swing for them for this generation, yeah, like they need to pull pull momentum in the opposite direction. The final topic: the third-party conferences - oh, this is very interesting. Specifically, we're talking about Bethesda, Ubisoft, and Electronic Arts (EA) on a Saturday... what's wrong with checking Sunday? We play as real gamers, not you ivory tower folks. Kick it off, Greg; I'm gonna get there before anybody else can.",
            "start": 5646.1
        },
        {
            "text": "Bethesda, Ubisoft, and Electronic Arts (EA) on a Saturday. What is wrong with checking Sunday? We play as real gamers, not you ivory tower folks. Knows kick it off, Greg. I'm gonna get there before anybody else can. The evil would be evil with you to announce at Bethesda Conference October dear one e17. That was my number one how many years later our list? Why not let's just get it out of the way then Wolfenstein new game yeah announced it's going to be called whatever did the Giants or whatever the cod loss the new Costas sure okay I got have ASCO got into that in their press conference last year when they did like booting up sequence so do we think those are the two though because the the press or the the invite went out yeah been leaked all over the place and it has but there's the land an American strip license under construction it looks like - yeah the construction Ares. Do we think that's it? Like, that's not make sense. Yeah definitely no I mean I think it makes sense I mean we could",
            "start": 5686.66
        },
        {
            "text": "American strip license under construction, it looks like - yeah, the construction Ares. Do we think that's it? Like, that doesn't make sense. Yeah, definitely not. I mean, I think it makes sense. I mean, we could potentially see a new IP from them, but they just released Prey this year, so that was a new IP for them. I don't know why they would necessarily want to be promoting another new IP in the same year, but you never know. I think most something will be like Fallout Shelter levels, but there was some cool, fun thing we didn't see coming. You does anyone else have any other Podesta predictions? Yes, okay. Cool, it's almost late. Okay, so my prediction - this is kind of like my pipe dream prediction - finally, after years of tormenting us, Beyond Good and Evil 2 will not be in production over time and time again that they're working on it, like this is another Cuphead moment except this is worse than a company because at least we've seen gameplay from Cuphead, but like they've been",
            "start": 5733.46
        },
        {
            "text": "over time and time again that they're working on it, like this is another Cuphead moment except worse than Cuphead because at least we've seen gameplay from Cuphead, but like they've been talking about it and talking and they've never once said it's canceled, they haven't said that's not being worked on, they've said it's still in development. Why don't I show you a goodbye or each other? I mean, I think it's a trailer, I mean if we're talking Patreon since we are, it would be like a gameplay trailer, okay something short but like a little one. If this were to happen, yes what consoles do you think it comes to all of them including the Switch, yes especially so not a Twitch exclusive though no that would be dumb, I don't believe. I think this which is doing great but if you don't bring your game especially to PS4 and to Xbox One like what why would you not we're talking about tens of millions of units of consoles and it went around the world so of course but I think this comes to",
            "start": 5789.32
        },
        {
            "text": "your game especially to PS4 and to Xbox One, like what, why would you not? We're talking about tens of millions of units of consoles and it went around the world, so of course. But I think this comes to PC as well. I think it's mixed - console, I think it's Switch. Yeah, I, I would love to see it and that would be hype as **** but I don't think with you know, I mean in my heart of hearts I don't believe though. I know I'm one of my predictions is Beyond Good & Evil 2. But I would like to see I would like to see it finally come on PS4. Be imagine I like that one second one and we'll skip me the next okay Mario + Rabbids Kingdom Battle, it's going to be focused on little show to be something and a Nintendo thing but my prediction is it's going to look way better than it has any right to okay then so much hate everyone's saying this looks like **** **** why would you do this? Why the hell are they combining the rabbits and Mario even I'm like what the **** that doesn't make",
            "start": 5835.52
        },
        {
            "text": "to okay then so much hate everyone's saying this looks like **** **** why would you do this why the hell are they combining the rabbits and Mario even I'm like what the **** that doesn't make sense I think the game is going to be good and I think that will be clear at E3 all right my number two Ubisoft reveals their next Ubi Art game from Ubisoft Montpellier the game is coming from Beyond Good & Evil 2 yeah oh my man Pillar yeah yeah Jen got real upset when I pronounced it I wish I double down and also I'm stupid the game is coming before the fall I think we're on the right track with this one right where it's like it got announced at E3 and I was out like a month and a half later remember it's Valiant Hearts too okay we're still in the war watching Save the Dog do Activision can do it yeah Larry can do it too am I up yes Assassin's Creed Origins coming in October duh okay now that's Assassin's Creed: Odyssey so sorry Empire he did Assassin's Creed: Origins screen Egypt coming out",
            "start": 5881.95
        },
        {
            "text": "Activision can do it, yeah Larry can do it too. Am I up? Yes Sessler screen origins coming in October, duh. Okay, now that's the Assassin's Creed: Origins so sorry, Empire he did say Empire, I softer screen Egypt coming out, isn't it actually Origins? I know, I know the name, I recently put our Origins out there and everyone thought it was Empire and then they're like \"financial\" I can't remember, but in my gray matter, it's up, Origins was the one that I resisted. This great answer or the official title from Ubisoft, okay, and that's out, yo Tutankhamen Nile Assassin's Creed, ha ha, that's gonna come in, so there you go... into it, I think it's a fun game, who's the protagonist? Tooten cap, I don't know anyone else smells like this. There's a lot of rumors that is a female protagonist, okay, I think that's true, no, no as much as I would like it to be true, I don't think it's true. Maybe you get to choose your own maybe it's a Far Cry in to ZM, know I don't know they've left big you not in to choose.",
            "start": 5927.34
        },
        {
            "text": "that's true no no as much as I would like it to be true I don't think it's true maybe you get to choose your own maybe it's a Far Cry: New Dawn, I know I don't know they've left big you can't choose your own with Far Cry 5 I haven't heard that thanks oh yeah hell yeah I think you can choose where are you you hear that and now what's a col yeah Far Cry 5 hi Mark our Montana no they haven't said that I'm pretty sure to set that way who said that hello and welcome to the podcast obviously I mean we're talking about the same thing pretty much three back didn't say that there my prediction okay yeah I'll try that one I wasn't yeah I mean they'll show it yeah I think it'll be fun 10 or Ubisoft will be the new Assassin's Creed whatever called yes I'm definitely it is cute whatever so what's your actual prediction of October is the prediction yeah pretty rumor looks like it is his origins ok these origins it is or a rumor that is the river lots of rumor it's a rumor",
            "start": 5986.23
        },
        {
            "text": "Whatever, so what's your actual prediction for October? Is it his origins okay these origins it is or a rumor that is the River Lots of rumors it's a rumor yeah they still have an outstanding anything anywhere happen I'm a fanatic mailed a lightning but had the Far Cry 5 logo and mountains created instead overtime title that's maybe it's recalled him from Sanskrit gonna reset it Oh like I would like Ray Morgan to do such a stupid ass name for it every Assassin's Creed game is not a stupid name but Origins at this point it's like that is being most overused subtitle for you guys ever Mmm probably what we're gonna call it next one Assassin's Creed Legacy come on guys oh yeah life that's why when you said Origins I actually did rethink that maybe it has already come back together up in so many Origins may screenshot winkles accompanied by news the game may be called Assassin's Creed Origin an earlier report pointed to an Egyptian setting and a title",
            "start": 6037.44
        },
        {
            "text": "already come back together up in so many Origins may screenshot Ubisoft accompanied by news the game may be called Assassin's Creed: Origin, an earlier report pointed to an Egyptian setting and a title Assassin's Creed: Empire that appears they've since changed. This is GameMarked okay you've heard of them yeah they're great now like a Far Cry 5 female here's my second prediction Firewatch Edmonton has been working on a new IP code named \"Dylan\" we will find out the true name of this IP and we will see a teaser trailer hmm goody-goody I like that yeah he's always interesting yes unpredictable the certain things that are fertile they are a mobile bulletin most of your boards and weird celebrity can be about soccer yeah for long I mean I've enjoyed their conference as well Star Wars but I think we'll get a teaser I don't think II will have anything from BioWare at it I think though that Dave this team has been working on this for a long time and it's time to maybe plant a seed",
            "start": 6082.71
        },
        {
            "text": "think we'll get a teaser, I don't think II, I play will have anything from BioWare at E3, I think though that Dave, this team has been working on this for a long time and it's time to maybe plant a seed about what it is okay before it leaks, yeah so stay in the Star Wars world, my prediction is we will see a trailer of one of the single-player Star Wars games coming out that's not Battlefront, so either an A for the response one, yeah it'd be I feel like a me Hannigan there's much more sense gamers long time way out there Kotaku what Kotaku sake otaku I cuz I calm Steven to TOA and is article about Far Cry 5 and then a is bolt point information and a change for the series you can choose to play as a man or a woman and pick your skin color, you're a junior deputy on Hope County, it's a secret so yeah I did totally I mean I got that from somebody else's article of like this is announcements even ask the question so I think it might have been afterwards in an",
            "start": 6134.34
        },
        {
            "text": "up and hope County is a secret, so yeah, I did totally get that from somebody else's article. This is an announcement even to ask the question, so I think it might have been afterwards in an interview he fired up with it because they didn't make a reference then why would you not put that in your presentation after how much flak Ubisoft has been getting about not having any female characters? Gamergate, hide it, no one will come for you. Let him come. I was joking, my third prediction this is a blankie one when I feel it, I feel it, imma ball of Tim. Huh huh, this is the year one of these companies announces The Rock is in their video game. What? Yes, The Rock is in the videogame. War old, it's happening. The Rock is voicing a character in some EA or Ubisoft games, not Vanessa, so he's not himself in a video. Not are you playing, he's gonna be either character he's playing somebody in this game. I just I got bombshell announced my thing is if it was anybody.",
            "start": 6189.72
        },
        {
            "text": "so he's not himself in a video game, nor are you playing as him; he's gonna be either character, he's playing somebody in this game. I just can't see it. I got bombshell announced my thing is if it was anybody, it'd be Call of Duty - you know what franchise would actually get the right guy? You just did Moana come on, Marvel IV how much money does Marvel have? Dwayne \"The Rock\" Johnson has a lot of money; yes, guys are gonna meet with him to see something he can do. Yeah I got a lot of money no let's watch a new franchise let's do something cool - in the rock will be the start of the game it's not that crazy it's I mean I can see him being down to him wanting to do it but it would have to be a Rockstar game or a Rockstar game, no Rockstars are unknown except for you asking me that I was really on the man dude he would speed back there I'm just letting you know don't you all be crying Oh Monday afternoon when all third parties are happening it turns out the rocks and all the geeks okay thank",
            "start": 6240.36
        },
        {
            "text": "the man dude he would speed back there I'm just letting you know don't you all be crying Oh Monday afternoon when all third parties are happening it turns out the rocks and all the geeks okay thank you Danny oh God um okay I've gone too obvious with some of these and so I better mix it up a little bit all right so we know there's no new Battlefield game coming out this year they haven't said anything about what they're doing next right they haven't said we did we don't know what's going on I know I'll feel one so either either they go down the route they go Battlefield 1 and then they do World War II the next time around but then that seems a little bit weird for them to do it right after Call of Duty goes back to the to the trenches so do I put my hat on both ah yeah I'm gonna say I'm gonna say they announced a new Battlefield and it's either gonna be World War 2 or 2142 got it 21 but will you really go they're gonna fight me on Battlefield when they have Star Wars Battlefront coming this",
            "start": 6284.16
        },
        {
            "text": "gonna say they announced a new Battlefield and it's either gonna be World War 2 or XIVII got it 21 but will you really go they're gonna fight me on Battlefield when they have Battlefront coming this year I feel like Battlefield not gonna come up with here yeah but I feel like it's more like an announce it next year for release yeah I'm with him here I don't think they would want to cross the streams as it were right I agree but I'm sticking with it all right I'm stuck back he said he's sticking with it rest of my list is too obvious yeah I'm running out of **** man I've got I've got an EA prediction that I hope no one says \"aha\" but once I say you're going to be like oh **** yeah since 4:00 on console oh forget it what The Sims 3 yeah only makes sense it has a great run on PC bring it to PS4 and Xbox One and to Switch Sims 4 that's a very safe bet so that was one of the ones that's been brought down to Redwood because Maxis is shut down so that's been over",
            "start": 6332.94
        },
        {
            "text": "PS4 and Xbox One, and to Switch Sims 4 - that's a very safe bet. So that was one of the ones that's been brought down to Redwood because Maxis is shut down, so that's been operated by EA they're there for whatever choice that'd be like I feel like I've seen a bunch of people who work on it leave over the past year. I'm not sure in my head that's what was happening when they go home at night we come back that'd be cool. Well, I mean that I'm not saying that they're bringing new lots of new content but I think it makes sense for them to port this title - it's a hugely popular franchise for EA like why would you not bring this to console? You think Switch yes I do no way I'm really holding to that. I mean I think they'd love to, I just don't know. You can run it, you know yeah just good people I know surprise but I remember playing The Sims every time I play the game on a computer at all the same running is good it should be about alone the Switch will see we shall see sterling I like that you'll",
            "start": 6381.22
        },
        {
            "text": "I know, surprise, but I remember playing The Sims every time I play the game on a console at all the same time. Running is good; it should be about alone on the Switch. We'll see; I like that you'll see Saturday. Oh, it's not this you today; I got that. Don't worry; we have to do a live event for two a lot of people know we didn't let it be um the last one. I got that. I've already been used: Ubisoft and they've released a lot of games. We know a lot of what they got coming, but they'd like to announce games at E3; like there's usually some surprise or some new announcement in it. I think it's time for Splinter Cell; oh my god, cuz I love it. The get ID thing for me is Prince of Persia, but that's not happening, especially with Assassin's Creed in yes, oh yeah, sure, yeah. But Splinter Cell, that's a really good one; I'm gonna let ourselves say it's good on our towns like Alonso. They do need some Tom Clancy coming; yeah, exactly. Like I feel like it's time for Splinter Cell to come back because we've",
            "start": 6429.13
        },
        {
            "text": "good I'm gonna let ourselves I said it's good on our towns like Assassin's Creed they do need some Tom Clancy coming yeah exactly like I feel like it's it's time for Splinter Cell to come back because we've seen so much of the other stuff over the last couple years and like when one's last splinter cell game was Blacklist, because there was a wild world on edge it was way too many of them released like everything every year they're coming out there wasn't one on Xbox 360 was Double Agent yeah there was Chaos Theory it was really good at that one Jonathan oh gosh yeah that's a really good chat actually no I don't think was that I don't think was that long ago really it must have been oh did they really say oh they released that one that didn't have the main guy Sam Fisher remember they released the the weird one that came out it was like barely Splinter Cell this loudmouth black leather is Blacklist yeah when was that because they changed what's the name of the Splinter Cell guy again 2020 official Sam Fisher walking down",
            "start": 6475.42
        },
        {
            "text": "out it was like barely Splinter Cell this loudmouth black leather is Blacklist yeah when was that because they changed what's the name is Sam Fisher again 2020 official Sam Fisher walking down furniture XIII hold on let me look I mean either way the flower they change the Garter yeah August 2013 yeah that's I think it's time and I went down it was like Mirror's Edge Catalyst it was like it was not the return than ever oh yeah yeah so yeah that's a really good show I like going yeah hmm there's a final one **** hope so Noah how are you more knowing **** I really hope we do have two more could we expand this outside of E3 and these three publishers yeah I know it's four oh so you mean outside if you mean getting outside of press conferences just at the show yeah huh sure it's a game-changer well I have one more Bethesda prediction go ahead Greg well no I like where you're going with this because my my my last I have one week prediction you'd make fun of me for and then one",
            "start": 6515.64
        },
        {
            "text": "game-changer well I have one more Bethesda prediction go ahead Greg well no I like where you're going with this because my my my last I have one week prediction you'd make fun of me for and then one prediction and I know won't happen but I wrote it down yeah okay I'm so shot it up I don't think this happened it's a dream oral thing all right EA opens with Star Wars Battlefront 2 and closes with the Visceral Games' Star Wars game but I don't think they'll double different Star Wars away I think they'll be like Battlefront Battlefront is what you want to talk about yes spit-roast yeah but that'd be cool fitted so that's predictions that's month no you okay it's like a prediction I don't want to happen but looking up at Bethesda's defense is in like a real weird spot because I feel like I feel like Doom 2 is a no brainer but they won't talk about it this year I bet that's like super early but I think that's a no-brainer for Todd Howard's team whatever they're working on",
            "start": 6562.2
        },
        {
            "text": "I feel like Doom 2 is a no-brainer, but they won't talk about it this year. I bet that's super early, but I think that's a no-brainer for them and Todd Howard's team, whatever they're working on - they like to do the whole \"it's coming out in three months\" thing, which I gotta fix or popularize again. I don't necessarily think that's going to happen; oh yeah, they just did that for Fallout 4. I mean when we originally announced The Elder Scrolls V, it was way out in advance - lord knows you want to so-so... so I don't think it's those, but what I so what they're going to end up leaning on a lot is like stuff we already know - there's one of those, Quake Champions, and I don't think that's been announced for console instead of PC only. I think after playing a bunch of the beta, they could get away with bringing it down to console; I think Jim Ryan was like \"no,\" I know he told me it's not coming to console unless there's some kind of crazy shift - like he was like this game cannot",
            "start": 6609.57
        },
        {
            "text": "Away with bringing down the console, I think Jim Ryan was like, \"No, I know he told me it's not coming to console unless there's some kind of crazy shift.\" Like he was saying this game cannot run on consoles, but maybe, maybe the shareholders are like, \"Well, Tim, you might think that, but it's gonna come out on console.\" In that barrel, trying buh-bye. My prediction for Bethesda is no Elder Scrolls 6; instead, we'll hear about ESO and Legends. There are a memo and their car gene. We're not here to talk about the next installment of the Elder Scrolls. There have been rumors of an anniversary edition of Morrowind. Well, I mean they released the Morrowind expansion for ESO, all right, that's out now. I'm pretty sure, pretty sure others do, yeah. Let me double-check those girls' lines or any ball for them. I feel like that's the same case. I feel it's it's weird this III to me feels like a holding pattern for loads of people, like Microsoft's gonna concentrate on the hardware stuff.",
            "start": 6653.28
        },
        {
            "text": "or any ball for them I feel like that's the same case I feel it's it's weird this XIII to me feels like a holding pattern for loads of people like Microsoft's gonna concentrate on the hardware stuff Sony's already had a really good year and they're gonna double down on their game stuffs which is building like a lot of the really exciting stuff June 6 ok it comes out I'm sorry we playing special delivery like there's so much more stuff that's going to come out from the third party section I feel the same way about like something like Cyberpunk where in the same way that like ESO is really big for them like this is the year for Gwent and it's also the 10 year anniversary of The Witcher this year so I feel like they're just going to sit on that and then next year we're going to get that big announcement I feel like that does isn't the same spot like that so that sounds again maybe Marlins wound so I'm all done with predictions for the the conferences oh my god but so for jumping into just",
            "start": 6713.82
        },
        {
            "text": "I feel like that doesn't sound the same as the spot, like that sounds again maybe Marlins wind. So I'm all done with predictions for the conferences, oh my god. But so for jumping into just third party in general, Konami, oh yeah, uh right down yeah Metal Gear Survive, yeah I mean we haven't seen it for so long, I think ever bet it'll be here did we, we just had a trailer or something, yeah I think it'll be there if it's not and yeah I don't know really that's it. The other crazy thing for the Konami could do would be Castlevania but I don't think that they would, the Netflix series out glad about that, yeah like people just don't like Nani, I don't know, I don't think they're not making their on the E3 exhibitor list so there have what else do they have a D3 and a sore Bantam me will they have Pez so yeah so I think we have to see something from from them you know from Metal Gear, yeah, Medgar spine them, I'm so interested in that game like I know like there's so much hate going on for it.",
            "start": 6749.64
        },
        {
            "text": "Metal Gear Solid 5 is so good and yeah imagining like playing more of that multiplayer like I think the game could be fun having said that **** the whole situation yeah I know I think you're right I think if they're ever going to talk about it game it's going to be that I don't think they're going to go down the route of like so much of that game when it's architecture in the engine and everything I mean they even use that engine in Pro Evolution as well and like a lot of that work has been done and it's a really strong foundation so like it's kind of easier for them to go down the path of do nuts been often others wouldn't attack alone might be like have something else yeah so I'm gonna piggyback off that yeah but I'll tell you my **** gifted",
            "start": 6805.23
        },
        {
            "text": "easier for them to go down the path of doing nuts been often others wouldn't attack alone might be like having something else yeah so I'm gonna piggyback off that yeah but I'll tell you my prediction one because I was just like on the press conferences I said he's gonna make a big deal about its new logo Oh God and all and I do believe they're gonna be up there they're gonna give you the whole press conference thing like what we're doing is it means that blah blah blah divert but here's my thing I think that yeah man I think Metal Gear Solid I thought it whatever Metal Gear stuff I just assumed it's going to be there i James' articles the same way of like we assume it's going to be there so whatever it's going to be there and I think it's going to actually be good I think people are going to come back I was actually fun **** what do we do because we hate Star Wars: The Force Awakens but Horizon Zero Dawn was good yeah oh yeah I think that game was getting railroaded a little bit harsh even based on what they showed people",
            "start": 6843.57
        },
        {
            "text": "Back, I was actually fun what do we do because we hate Obi-Wan Kenobi but Greg Miller was good, yeah. Oh, yeah. I think that game was getting railroaded a little bit harsh even based on what they showed people are just pissed and rightly said well you know people make in that game are the people who fired Hideo Kojima either so you know I think I think I can imagine being on that team and trying to make a really good there's like a job of that yeah if your back's up against the wall. You have any more predictions? Hell, yeah. I think we'll see Trey Parker and Matt Stone on stage at E3. What do you mean slip so many times no but they have always okay I know that they've had before they have this new release date is October 17th this fall. I think Ubisoft loves having celebrities on their E3 stage I think they've kind of realized that hey we shouldn't waste our money booking a big musical act for Just Dance because the audience at E3 could give two **** you think we realize oh no they do because I'm sure they",
            "start": 6881.61
        },
        {
            "text": "of realized that hey we shouldn't waste our money booking a big musical act for Just Dance because the audience at E3 could give to **** you think we realize oh no they do because I'm sure they didn't they had like the crazy clown colors drooled oh no he was the year before so last year the brilliant Ubisoft conference I was around hey here's some game plan sit down and talk to me about it all right here's some more what are you **** doing cures wontons of last year horrible sucked it was weird um I wouldn't say it's song long um it was too long and it was I mean there were I think that there was just too much awkwardness and now they're like double downing on the awkwardness is like something that they want in their conference and I think that that's the wrong move I think they need to get away from that and go back to cool making it cool I love having the musical guest there but I was always the only one like out of my seat in dancing he's like jaded journalists who are",
            "start": 6930.66
        },
        {
            "text": "to get away from that and go back to cool making it cool I love having the musical guest there but I was always the only one like out of my seat in dancing I'll he's like jaded journalists who are like and it's like the third conference give you a hip hop gamer Sony's is saying I think that you know they need to get their celebrity on stage in another way and obviously you know South Park is huge for them and the community loves South Park the first game did really well for them and we're going to see them on stage Angeles they're already there yeah that's a solid bet, Ice T is here do we know I was looking for no confirmation right yeah that's what I've been able to dig up even though oh really if I'm being honest **** **** article from IG in India about it the **** seven the seven embarrassing occurrences to expect at E3 2017 number one is Aisha Tyler, at least the first one they list look we love Aisha Tyler and Archer when she's being interviewed she comes",
            "start": 6973.26
        },
        {
            "text": "seven the seven embarrassing occurrences to expect at E3 2017 number one is Aisha Tyler at least the first one they list look we love Aisha Tyler and Archer when she's being interviewed she comes across as a goofy nerdy and pretty chill person on stage as a host at Ubisoft press conference she's arguably the worst thing imaginable how about you mr. caffeine yeah exactly I know there's a million worse presenters I can think of like I'll roll with the punches yeah actually knows what she's talking about I'm a friend of the show guess you like that I just don't want them to build in awkwardness like how she sat down with that Rain and like we don't we don't need any of that just like show us the game you have a really cool slate of games coming up that was a week last year hunt the games are good they were presented so good also great what was being said was great it just took so long to do it like when they did the Beyond: Two Souls thing and came back out yeah I can oh",
            "start": 7024.26
        },
        {
            "text": "\"Hunt the games are good, they were presented so well. Also great, what was being said was great. It just took so long to do it, like when they did the Beyond: Two Souls thing and came back out. Yeah, I can oh yeah, yeah, yeah. All right, okay. I've got... We're just talking about Ubisoft and do we think of all they are? They get dragged into the I've dragged into it. They put themselves into interesting forms of like debate around you know representation and culture in games, right? Do you think they come out and actually address any of the Far Cry 5 stuff directly in any sort of way? Maybe three interviews, sure. Yeah, maybe on like the IGN stage or the E3 Coliseum or like the Ubisoft stage or whatever, right? Like that might have that actual conversation about it. But there's no way that they're doing it at E3. They don't they don't have to. No, why would they? Yeah, all right. Any final statements: Kingdom Hearts 3 will not be shown. Dude, they'll be showing so much at E3 in a way that doesn't make sense like why why.\"",
            "start": 7069.98
        },
        {
            "text": "they don't have to know why would they yeah all right any final statements Kingdom Hearts 3 will not be shown dude they're showing so much at E3 in a way that doesn't make sense like why do they keep showing it don't make sense please thank you guys for joining us there's been a lot of fun let us know in the comments what you think is going to happen at E3 2017 you can watch our Twitter stream Twitch.tv slash KindaFunnyGames watch all the stuff VOD on YouTube it's going to be a fun time thank you guys you can find them again at What's Good Games and at NoClip which is Patreon.com slash Danny O'Dwyer nice work so next time what's up guys that was fun if you want more Kinda Funny Games click there to subscribe if you want other stuff you can click there to subscribe to YouTube.com slash KindaFunny you can support us on Patreon right there and over here if you click on this you'll have to find out what happens is a Kevin's little belly button it's not",
            "start": 7121.85
        },
        {
            "text": "To youtube.com slash kinda funny you can support us on Patreon right there and over here if you click on this you'll have to find out what happens is Kevin's Little Belly Button it's not out of a bottle",
            "start": 7176.83
        }
    ]
}