{
    "id": 2760,
    "video_id": "xSNg5PXv7jY",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "Is The Han Solo Movie Screwed? - Kinda Funny Morning Show 06.21.17",
    "description": "Click here to get 7 days free of the VRV Combo Pack: http://bit.ly/2se56Px\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1498073743,
    "duration": 3191,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to the Kinda Funny Morning Show for Wednesday June 21st on one of your hosts Greg Miller alongside the pure one Tim Gettys let's get rid of those off-camera the guy Kevin Coello hey and cool trick uh but let's get into it you know this show is the garbage truck on fire we goof around like you know it's there to do some of its enemies you know it's mostly it's **** around you are walking into one of my favorite conversations it ever happened it Kinda Funny ladies and gentlemen viewers and listeners Kevin walked over and said bought my tickets to Las Vegas and Honolulu is what you said right yes I because the bachelor parties in Vegas we're all we have to start doing that and then Tim said Honolulu no you mean Maui and then kept waiting for the moment like that's where the James is getting married at the Disney Aulani Resort in Hawaii Mountain the WWE extremely exactly then so then there was this moment of gridlock wait what in these chemicals well they're",
            "start": 1.57
        },
        {
            "text": "where the James is getting married at the Disney Aulani Resort in Kailua-Kona, Hawaii the WWE extremely exactly then so then there was this moment of gridlock wait what in these chemicals well they're all the same on a and we're like I don't know we don't know so we googled it they are not on the same island Kevin I went over and I think have an angry before but this is the most god damn any pounding on the death like **** screaming showing Kevin got here you wanna pull it up if you want to see the difference here on aluminum Ali uh and then Kevin like well are you sure you're right Tim like his there's this now which island are they supposed to be flying in on it the conversation the question mark here and so then a Kevin exclaim yes are you wrong so after further review I was wrong oh my god did you book the right bud I booked the right ticket okay so I bought a little bit but yeah the **** out of me which is way too lame I wanted to go to Maui goddammit all over the big island I in",
            "start": 54.33
        },
        {
            "text": "Did you book the right bud? I booked the right ticket, okay. So I bought a little bit, but yeah, the Han Solo movie screwed me which is way too lame. I wanted to go to Maui, goddammit! All over the Big Island. I in Christ no, no, the Big Island has another island, not Hawaii proper. There's another one, man. There are seven islands, I think. Wow, they have the Island of Hawaii their day. Ireland is there a city? I've ever heard him on Big Island, Hawaii. It has a name that's famous - Coca no, no, I think it's Oahu. A little also now that I pointed out, of course, that I got I didn't know where New Zealand works for a long time when I say long time you're like roughly 31 years of my life. That is true; I'm not mocking either of them. Not mocking them. Yo, this is one of those things where it's like we're going to an island we knew that like where they were. I just I thought Honolulu had a different name also it's not Maui, it definitely has like another name. Yeah, I don't know; it might be the Big Island. Hey guys, it's on.",
            "start": 108.96
        },
        {
            "text": "we knew that like where they were I just I thought Honolulu had a different name also it's not Maui it definitely has like another name yeah I don't know it might be the big island hey guys it's on actually on it Waikiki is an island that is true yeah or else a big Island says someone Kauai each record clean I've got some confession we really trust officer friend in the chat oh my god what a disaster was exciting and then I feel like we had no that we saw Parton or docked up we fell apart in the act well the problem was Kevin went through all the motions two minutes before the show started now we're like David you should have saved David how I would have been great by the way that's a great point actually like you're not Qi we come back you **** up when he said the wrong thing you should have a little interesting mmm and then waited because our lives are confi right we can't have it come right anymore that's not how this work you can't have him we just shouldn't it's funner to have",
            "start": 156.88
        },
        {
            "text": "have a little interesting mmm and then waited because our lives are confusing right we can't have it come right anymore that's not how this works you can't have him we just shouldn't it's funner to have them here when you can get tipped on it are you gonna come in the chat or gonna stream on Twitch that's what it's all about Oh what who is another I quit I think Honolulu is also called a llama I buy that I put money down on that one Monica Kuma Jack names his favorite Island I skip you excuses yeah yeah I think you know the big island many people like Skeeter Skeet on the big I didn't know each other this is the kind of bunny Mauricio each and every weekday on twitch.tv/kindafunnygames we run you through our favorite new news you need to know about always **** around with each other or whatever and you have a lot of fun and we have good energy we read the chat we read the subs we do all the different things it's great mm-hmm you like that come back each and every day click that",
            "start": 206.74
        },
        {
            "text": "or whatever and you have a lot of fun and we have good times, we read the chat, we read the subs, we do all the different things, it's great. mm-hmm, you like that? Come back each and every day. Click that file button, maybe subscribe to us with that Twitch Prime because if you have Amazon Prime, you have Twitch Prime. Support on Patreon, win one of the free games we give away every day. There's a million different things going on. First and foremost, Kevin's already got it pulled up this Friday - no, Friday June 23rd. We're finally doing Friday the 13th. This Friday, June 23rd is this Friday? Yep. Holy crap, this month it's bad. Got on totally gone. Wow, man. Oh yeah, I'm breaking off the Emily... what **** you Kyle? Yeah, I'm wearing my Emily is a way too sure but yes. Friday the 13th, the game finally playing with the Community this Friday, June 23rd, 1:00 p.m. to 5:00 p.m. Pacific. You sign up over at Kinda Funny calm / s13 for Friday 13 okay. Um, it was Wednesday... it is what we talked about when we redid the morning show cuz course",
            "start": 248.77
        },
        {
            "text": "June 23rd 1:00 p.m. to 5:00 p.m. Pacific you sign up over at KindaFunny.com / s13 for Friday XIII okay um it was Wednesday it is what we talked about when we re-did the Morning Show cuz course games have become Kinda Funny Games Daily it's after this injury her name in the other room she's also had to do getting all prepped yeah uh we want to have segments and stuff on this one we want to talk about comics on this yeah okay cool I had that later but well no no no stick with me yes I'm saying and we're still working in a lot doing everything with each other yeah we're figuring each other's bodies together I get it referring your bodies and minds to so I thought great last night it gave me a real comic focused show and then it's more true at last a yesterday afternoon everything went to hell with the news we had the Han Solo stuff with Watchmen stuff yeah you got some Jigsaw stuff in the oh yeah so let's get the housekeeping out of the way do some of the entertainment stuff I just",
            "start": 289.32
        },
        {
            "text": "\"Hello, let's get the housekeeping out of the way. We had the Han Solo stuff, Watchmen stuff, yeah, you got some Jigsaw stuff in there too. Oh, yeah, so let's get the entertainment stuff I just mentioned and then move on to comics after that. We're talking, so first of all, much did you have to pull up Kevin? What is this? So this is huge news - we're going to RTX in a couple weeks, 17 days, I guess. We have a policy on big news for the War for the Planet of the Apes before it's in theaters will be our EXO. You can watch that cool. The only reason I bring this up is because of keynote from Star Wars' Andy Serkis, and Miss Caro... you know, and every circuit is going to begin to the same building. You guys, they can't be in the same city - this is an issue. Why did they come them again? I forget - one occasion because he walks around like a gorilla great cool. Greg, can you go get then you go get Nick for us? Yeah, cuz we're going to have to figure out how we restrain him. What are we literally? This is a actual problem - this is a real issue with the\"",
            "start": 331.53
        },
        {
            "text": "a gorilla great cool Greg can you go get then you go get Nick for us yeah cuz we're have to figure out how we restrain him what are we literally this is a actual problem this is a real with the real life we've been going on for a long time is kind of funny Nick hates Andy Serkis I believe Andy Serkis has no idea who the **** Nick is here he comes you get you get over here get over here there cutie go wide cuff yay he doesn't get to be the motion capture guy and the star you don't get to be Gollum and in infinity war not until you are it's what my god was the second little big theaters he was Ben Kingsley he was Toad in a non original X-Men wooden age of Ultron you have Hugh Jackman in the original X-Men he was not no he wasn't there was someone else Aaron Moulton is absent he's too talented he's like Sigma but let me look at Syria what I don't think about he's like nipple voice actor now you could've been a Microsoft actor but you got pushed over for this role for any circuit so you beat me out",
            "start": 371.67
        },
        {
            "text": "Sigma but let me look at Syria what I don't think about he's like nipple voice actor now you could've been a Microsoft actor but you got pushed over for this role for any circuit so you beat me out for the role and when I understand in volume yeah **** kidding me now I could have done it because oh she came that dose now but funny all Danielle yeah I channeled that rule that's the whole reason you went to London right was to immerse yourself in culture learn there live a method actor yeah I went there I went to the loo I used the bathroom I took an elevator I did all of that stuff like the bangers and the mash oh wow okay no I watched Chewing Gum I didn't like it this gets grainy not my thing tool in cars Oh biscuits and gravy are a Southern thing oh no Nick Jesus oh no sorry what is this is the Kinda Funny Morning Show I just saved this yeah any circus things super hot **** you don't that is true Amy circus hands I've got to be taken down a peg can we see - good how did you walk like",
            "start": 418.11
        },
        {
            "text": "Kinda Funny Morning Show I just saved this yeah any Circus things super hot **** you don't that is true Amy Circus hands I've got to be taken down a peg can we see - good how did you walk like a monkey though kiss me kiss me Ellen it's like humans come over here come over here tell me my one not that hard saying Nick deliver your message to Amy surrogates and everybody clips this out and tweeted em and Circus you're too talented and you're going architects and so are we so whatever stop it we're out for you we're coming for you if be on camera and also do all the cool motion conscious stuff would be that guy you can't do it you're too talented a Kunal the walls for all of little people here who are talented and can't act for **** yeah okay and it was fine it was fine when you were doing this across the pond yeah but now that you're coming to Austin to deal with us at r-tx not a good moment ago to look you're all you're on also exactly exactly our soil yeah okay what happens",
            "start": 462.18
        },
        {
            "text": "doing this across the pond, yeah, but now that you're coming to Austin to deal with us at R-Texas, not a good moment ago, to look, you're all you're on also exactly, exactly our soil, yeah, okay, what happens is that passport gets lost, huh? Watch your back, no one Jack, no one knows I'm going to wind up in Plano, Texas. Nobody wants to go there at Hooters or where their equivalent was. What was that one we went to where they were 80 tonight? We went to this thing called Planet X; we go it was like they would like the Tilted Kilt but it wasn't like a local one; they were just literally lingerie, yeah, they were literally in our underwear serving. Doing lose internet America, that won't do it. We're glad to see you here, I mean now we're not. I love you know we're gonna hang out. Were you thinking about Frank's? You're too talented, way too talented. Thank you, Nick. I told you matters beef there is beef hot sorry yeah Nick does get hot well what are the chances you know this long-standing legacy the rifle fee of Nick",
            "start": 510.24
        },
        {
            "text": "Too talented, Way too talented. Thank You Nick, I told you matters beef there is beef hot sorry yeah Nick does get hot well what are the chances you know this long-standing legacy the rifle fee of Nick imagine circuit that only Nick knows about but I mean yeah right now they're going to be in the same room Wow imagine Chad Michael Murray was there to thigh reach is too much all right now all right mm-hmm we have another housekeeping note here I saw something earlier happen and I thought oh this must be like Instagram okay but it turns out it has not and so what I'm doing right now is I'm just putting this out there I love our friends at IGN.com of course you know that we know that a lot of them watch the show while they're there someone at IGN.com is hosting the Kinda Funny Morning Show on Twitch.tv slash IGN I'm sorry for sending slash IGN I don't think you meant to do that not that it's like there's no beep we love you you know that you love us but I'm thinking maybe somebody",
            "start": 544.1
        },
        {
            "text": "twitch.tv slash kindAthena I'm sorry for sending slash IGN I don't think you meant to do that not that it's like there's no beep we love you you know that you love us but I'm thinking maybe somebody was logged in and thought they were on their personal Channel and maybe turned out there on the IGN channel I gotta find one of our friends exactly one of our friends oh my god maybe they did that on purpose maybe you know we're gonna let Brad Mielke probably make showing us some love maybe it was a nice move from France either way we're thankful happy if it was a mistake no one asked no I'm doing real quick I'll keep my eye on the ideas page and let you know what happened oh my god again one 1000 people over here yeah one will be tiles keeping here so Lucy Camp she's an artist that we talked about a while back this is back in January I think our good friend Sean Finegan directed her new music video and if i'm not mistaken it's on tone deaf label and if i'm not wrong it's called \"i\"",
            "start": 603.23
        },
        {
            "text": "we talked about a while back this is back in January I think our good friend Sean Finegan directed her new music you know she is the latest signee to Tone Deaf Records and if i music lq and thought The Quintic is for the new Agent okay doesn't matter Lucy Campbell's where you can get the video for the new EP check out the song and all that stuff this is the video that Kevin read into The Glass Wall sure we got running through a shoot too early no no he wears a red right he threw his head right yeah cool Greg helps out on this Nick helps produce I'll produce and I edited it as well so yeah it's pretty cool you should check it out living Xiaomi but down here we've seen Capcom this Shark Sean finding Shark yeah please share it spread the love there was a lot of people are working so Rance Key worked on it he doesn't like working that's not a rant he hates working yeah can head on too tight almost died walks yeah case at all we can see that mirror actually break in this",
            "start": 649.58
        },
        {
            "text": "so Rance Howard worked on it he doesn't like working that's not a rant he hates working yeah can head on too tight almost died walks yeah case at all we can see that mirror actually break in this video so that's good we got about a fancy drone shot yeah this is a really well done thing I watched you guys are super talented it's fancy it's really good job Ron Howard he shot my wedding to have I paid trying to get ended for the wedding no no no no but definitely check it out on a source of love it is on Twitter let me find out what his name is oh I didn't see that shot Lucy Campbell said some sweet nasty love sweet man abundance to her she's fantastic she's going places gonna blow the **** up one day I love the lights on the bridge they're they're pretty they're pretty alright Sarah Joe that symbol of get into some of the nerdy news need to know Bob and give the love back to IGN.com who's hosting us a Twitch TV apparently not by mistake maybe over there at Ideacom hope Corrigan reports Han",
            "start": 698.32
        },
        {
            "text": "of getting into some of the nerdy news we need to know Bob, and give the love back to IGN.com who's hosting us on Twitch TV apparently not by mistake, maybe over at Ideacom. Hope Corrigan reports Han Solo why Lucasfilm dropped directors Lord and Miller after Phil Lord and Christopher Miller were dropped as directors for the new Han Solo movie; sources have confirmed that have come forward explaining the reasons behind Lucasfilm's decision. You gathered all these new stories so I'm reading fresh in, I'm stupid. The Hollywood Reporter states but sources say the pair were let go due to creative disagreements with screenwriter Lawrence Kasdan, which confirms claims of creative differences when news of their departure from the movie first broke. Kassan is a co-writer of The Empire Strikes Back, Return of the Jedi, and The Force Awakens; he reportedly prefers to remain strictly on script at all times this is claimed to have clashed with Lord Miller or said to favor a more improvisational approach",
            "start": 739.36
        },
        {
            "text": "Back Return of the Jedi and The Force Awakens reported prefer to remain strictly on script at all times. This is claimed to have clashed with Lord Miller or said to favor a more improvisational and humorous style. The creative differences are reported to continue, with contention around how to portray Han Solo in the film, with one source claiming \"people need to understand that Han Solo is not a comedic personality; he's sarcastic and selfish.\" Despite difficulties in the early stages of shooting, both directors believed these were differences that could work through. However, Lucasfilm had Kathleen Kennedy and producer Allison Shearmur appear to address it with Kasdan's approach. Wow, we don't have any clear answer, and who will be replacing Lord and Miller? There are several candidates being eyed for the role. What do you think? So we're seeing a sample man... I mean if I remember correctly something like this happened with Rogue One in The I think it as far as Rogue One had a",
            "start": 783.88
        },
        {
            "text": "candidates being eyed for the role what do you think so we're seeing a sample man I mean if I remember correctly something like this happened with Rogue One in the I think it as far as Rogue One had a lot of director's issues right where it's like oh this guy then it's not as this guy that's not so it's like this sucks because I love these guys and everything about this movie sounded perfect and they did besides The Lego Movie duh are these reducible in 21 Jump Street a long love but is that the case did they not do The Lego Movie they did yeah more than 21 Jump Street yeah I'm like oh yeah a second Lego Batman movie put me to sleep I don't think they do that on them cuz I'm gonna cry now alright didn't do that okay so The Lego Movie and this 21 Jump Street movies so awesome yeah they've just knocked out a part I love their style I loved the big direct comedy very very well and the guy did stories yeah so obviously when it comes to Han Solo movie with Donald Glover I'm not all himself",
            "start": 827.12
        },
        {
            "text": "out a part I love their style, I loved the big direct comedy very well and the guy did stories yeah so obviously when it comes to Han Solo movie with Donald Glover I'm not all himself about this, this is I'm so great this is really sad news, this reminds me of Edgar Wright ending Ant-Man where a goddammit that was too good to be true and I guess that it was yeah on there's so much issues when it comes to production and creative issues and egos and all that stuff and Caserta at the end of the day is Star Wars so it's hard to kind of fight track record right yeah he does where I feel like he knows the character a bit a bit so I don't know but I also kind of feel like this movie can be a little bit different than Bill sure like when I problem is that their canon needs to be so airtight yeah that I I was hoping that they were going to be a little bit more open with the spin-off movies especially this one having kind of a different vibe but what's your take on what we got with",
            "start": 871.73
        },
        {
            "text": "yeah, that I was hoping they'd be a little more open with the spin-off movies, especially this one having kind of a different vibe, but what's your take on what we got with Rogue One? Did it feel like oh, this is Star Wars as I'd expected or was it off the beaten path? Like perfectly, all the characters die, yeah, but I wasn't expecting anyone to die and no one's importance of a dying star, I mean, I think that was more of an action movie than I expected. So much more of an action movie, yeah. It had like that hi-tech stuff, like Steve, I'm mm-hmm, the Wookiee, Lorian's, and it really showed old Hopper like we saw start like the war in Star Wars that we've never seen before, I think. But still had the same tone overall, where was drama, I mean, it was you know, it was telling you know, I guess an episode one we saw a little bit of a space war, we did see the",
            "start": 921.27
        },
        {
            "text": "Sure, percent level, but it still had the same tone overall. Where was the drama? I mean, it was you know, it was telling... You know, I guess an episode one we saw a little bit of a space war. We did see the trade embargoes, of course. Yeah, don't forget about that. Yeah, I think it's been declared. It sounded like it had a distinct comedy flavor to it. Yeah, which is why me... Not something when you start talking when you start talking about exactly who these people are. I think that's the problem. Is I think you could have taken these two and this is you know from something you only... It was I, I always want to put it out there. I like Star Wars a lot, of course. Love Star Wars. I'm not crazy about it. I think this is the thing where I think Lord and Miller could have made a comedic Star Wars movie outside or with new characters or whatever. But Han Solo... We know Han Solo. And I think the ones they're talking about in the article right now, like he's not... He's sarcastic and selfish. She's not comedic. I think you see where they're going.",
            "start": 967.2
        },
        {
            "text": "or whatever but Han Solo we know Han Solo and I think the ones they're talking about in the article right off like he's not he's sarcastic and selfish she's not comedic I think you see where they're trying to go there is Ron Howard you the argument I would make is that it's a prequel when they're younger and I just feel like the characters could have been developed differently this is a young Han Solo it could have been more just like the college years you know but whatever I shall be sure that it's good in the end whoever they get I'm sure this movie's going to be great stories at this point are directed by Ron Howard so these directors leaving it's still going to be a solid movie even with Ant-Man we saw and they really had Phil Lord and Christopher Miller's fingerprints all over it, but now those have been thrown off the release date they've been very clear about the movies still on track for whenever when it comes out you know really good I'm looking I'm you know see if The Hollywood Reporter's heard the chatter let us know",
            "start": 1008.39
        },
        {
            "text": "they've been very clear about the movies still on track for whenever when suppose come on Kevin, you know really good I'm looking I'm you know see if Hollywood Reporter's hear the chatter let you know I know it's supposed to come out this got a date like kind of too close more important to me it's at the end of The Hollywood Reporter story Lord and Miller's next move is not immediately clear but already rumors are circulating that the pair could return to The Flash Warner Bros. movie about the DC Comics hero to which they have been attached to the helm several years ago and that one apparently needs them and we need more comedy in the DC Universe and I can I could live with that you know May 25th to chat saying the day before my birthday oh yeah very very interesting news man can catch up on all right your next story that you put in yes another one from IGN calm you tell them ahead of time and this is how we got home Daisy did you know I do okay you know cuz I'll tell you right now",
            "start": 1046.61
        },
        {
            "text": "on all right your next story that you put in yes another one from IGN calm you tell them ahead of time and this is how we got home Daisy did you know I do okay you know cuz I'll tell you right now I June if you want us to read our news you host this every day I'm  because what I did I went I went through actual sources I want to Ollie would a reporter and Variety there central way to uh I mean that's why your IGN's your game spots they all make sense do we go out and get it and they break out the most important thing and then the jockey lose that yeah like we were here is you take a third time because it's like think about this you see the mama bird eat the food regurgitate it into the baby birds mouth now imagine that baby bird poops it out another baby breath excuse it to a frolic bird that's kind of funny little circles like over on IGN calm Alex on board reports Damon Lindelof to an adept Watchmen for HBO lost and the Leftovers co-creator Damon Lindelof I'ma say my",
            "start": 1087.98
        },
        {
            "text": "bird that's kinda funny little circles like over on IGN calm Alex on board reports Damon Lindelof to an adept Watchmen for HBO lost and the leftovers co-creator Damon Lindelof i'ma say my st. Lendl with little off yeah little off is reportedly in talks to develop a TV series adaptation of Watchmen for HBO according variety Lindelof take for the DC Comics inspired series won't be tied to the watchman series HBO had looked into developing a few years ago but well instead serve the fresh start for the network a deal for the series was reportedly not in place yet IGN has reached out to HBO but the network declined to comment Watchmen centers around a group of the ikot we don't watchman is no offense yeah a film adaptation of Alan Moore and Dave Gibbons comic was released in 2009 for our in table 1 interesting what do you get it's the biggest shrug of all time it's like why we don't need this and I know the Washington movie is contentious among people we've been on record say many",
            "start": 1131.6
        },
        {
            "text": "in table 1 interesting what do you get it's the biggest shrug of all time it's like why we don't need this and I know the Han Solo movie is contentious among people we've been on record saying many times that I think as a unit we agreed that the Watchmen movie is awesome yep right yeah I wasn't sure if we were under their banner we did look good mom we did a guy song because I totally hear you kind of make all of us make sure agree on this and it's like you know I read the graphic novel after I watched the movie Kevin or the graphic novel before we watch the movie we both came to the same conclusion which is the end is better in the movie yeah I think we've done a really good job of adapting the property and yeah it misses a couple things because it's a movie it's the mediums are different yeah sure sure it's great agree we don't need the second chance if you don't agree down with HBO man their level of quality is so high when it comes to what this could be cool and people",
            "start": 1178.71
        },
        {
            "text": "yeah sure sure it's a great idea agree we don't need the second chat if you don't agree down second HBO man their level of quality is so high when it comes to what this could be cool and people love leftovers I haven't seen it but Eddie hmm he loves it and feels like I made a mixed thing and I know I don't know do you think it's just me the Han Solo movie again or it's gonna be like before Watchmen where we see you guys being the characters I mean like not benefit into the movie but it did not gonna tell the fake story the movie mmm I don't feel good before into the movie and then oh wow so like three seasons anchor one one season of it all I think yeah I was gonna say that you know they don't do this yeah now didn't put another rinky-dink in this wrinkle on this thing oh that thing and I began hosting us randomly we're on the front page of twitch as well what so today is our day let's not **** it up everybody Oh Greg I need you I need you centered and cord up here all right thank you",
            "start": 1218.01
        },
        {
            "text": "Hosting us randomly, we're on the front page of Twitch as well. What so today is our day, let's not **** it up, everybody. Oh, Greg I need you, I need you centered and cued up here. All right, thank you very much. Click the follow button if you're watching this for the first time. I love I love my brothers so much. I do too, for so many reasons. You know one of my favorite things to do is just look at him and when people talk to him and say something he gives me the look of like \"am I supposed to know what that means?\" Do I need to do anything? Sure, yeah, should I like even whatever that's a deer in headlight look like. Do I need to do something here? I feel like giving this guy a nod like \"know your daddy's okay.\" Final story also customize your so shenanigans going on here. I was this one I was just on our show we were only going to do those two and then I saw this someone go home, I saw a big tall guy. We got a title Jigsaw: Killer Origin out you know coming this year for Halloween.",
            "start": 1266.31
        },
        {
            "text": "Here I was, this one, I was just on our show and we were only going to do those two and then I saw this someone go home. I saw a big tall guy. We got a title Jigsaw: Legacy out you know coming this year Halloween 2017, the horror movie was previously referred to with Saw Legacy but is now named after the series main villain played by Tobin Bell, both before and after the character's death in single-fade movies thanks to many flashbacks. Ladies and gentlemen, Lionsgate's long-running horror franchise stars Lara Rothenberg from Smallville. Hell yeah! Raise your hands for zombie. Directed by Darren Lynn Bousman and the Spierig Brothers, who helm Daybreakers and Predestination. Don't know those sort of roles? Writers don't know that, but that's all cool. Great, I'm excited for this. Saul's been God for way too long in my life. I hope this one's okay. Yeah, you deserve it. I mean, dude, it's perfect. Well, you didn't meet it totally didn't... meet it was the best one was the last one again. No, no, Kevin, it well it didn't also like the final song. Yeah, no, yeah.",
            "start": 1306.12
        },
        {
            "text": "you deserve it i dude it's perfect well you didn't meet it totally didn't **meet** it was the best one was the last one again no no Kevin it well it didn't also like the final song yeah no yeah it was it was Saw 3D, the final chapter and yet here we are that's why Jinx on is now you're getting away from me you're totally you're free and clear yeah I mean I've said this before and I'll say it again I Tom saw one two and three one of my favorite trilogies of all time yeah there's a lot of gore you had some nasty **stuff** man what a damn ride that is I said four five and six oh man if you stuck with it there were moments there where I alright but they really they jumped the shark as the kids say the Saw shark the Saw shark anything I I mean like when they got to the third apprentice that I'm like wait a minute do you wait the lady seizing the transitory timer right anyway in this one what are you expecting from it I don't know I'm interested there's there's been a lot of rumors",
            "start": 1347.83
        },
        {
            "text": "that I'm like wait a minute do you wait the lady seizing the temporal timer right anyway in this one what are you expecting from it I don't know I'm interested there's there's been a lot of rumors of what it's going to be about but like the who the **** knows I get legacy it being called Legacy implies that maybe you got a kid mmm okay oh yeah before you die no I mean it is what it is really when but the thing that you know he's going to be in the movie I can't wait to see how they get involved has the kid from Rogue One in any of the other movies the kid from Rogue One now he stopped and because I'm done killing I got Genie mine I mean they did a great job of bringing back anybody that was relevant the problem was they took way too long to get the Doctor from the first one back on screen yes Princess Leia is very carry on Princess whatever to get her back because there was some fight between him and the director so there were like issues news I instructor series whatever those be",
            "start": 1396.49
        },
        {
            "text": "the yes Princess Leia is very hard to carry, use Princess whatever to get him back because he was there was some fight between him and the director so there was like issues news instructor series whatever those be he's like I can go off to be successful without it then event hominem and all my money on liar liar you realize you needed help and then he came back for the final chapter and it they just botched it so bad his coming back would have been the most epic thing ever in part five but the Fed they waited that long I was a son man you guys really dropped the ball and then they blew their load in the movie and they like gave Bing showed you that he was coming back before he came back I'd he just come out the end even though we all thought it was gonna happen to it didn't come it was he the bad guy pan but they it wasn't awesome exercise in my head it was awesome they could have been off yeah but they amble it away well I'll go see Jake so again tell ya all right cool it's finally",
            "start": 1444.93
        },
        {
            "text": "the bad guy pan but they it wasn't an awesome exercise in my head it was awesome they could have been off yeah but they ambled it away well I'll go see Jake so again tell ya all right cool it's finally time to talk comics okay and the morning show's first segment I've ever been a part of came all I know what then your pull list this week for this week I've been reading Spider-Man just called Spider-Man oh my no it's the Miles Morales one I've been reading Ultimate Marvel Comics forever I've read every single one in existence yeah and when the viewers went to **** and they just collapsed eight natives did this whole thing with the the the most recent Marvel event Cataclysm wasn't but whatever the **** it was called where they combined everything and awesome all together and they took a couple of the ultimate characters and threw them into Secret Wars six one six Marvel got ironed out Marvel Miles got stuck in the six one six New York right so with Peter Parker while Peter Parker went over",
            "start": 1487.95
        },
        {
            "text": "a couple of the ultimate characters and threw them into six one six Marvel got ironed out Marvel Miles Morales got stuck in the six one six New York right so with Peter Parker while Peter Parker went over to do Parker Industries you as an S.F. for a while General that star not a fan of The Amazing Spider-Man comics now where he's in these where he has all his tech and a young guy guy I'm running Parker industries and it's this whole thing when I'm a businessman not interesting to me I like Spider-Man being Spider-Man in New York here's the whole thing about the comic segment here of course is we're going to talk about comics and so not not spoilers for this week but in general I need spoilers for going on well you know that I am I want I wouldn't say a huge Marvel fan right like I love Spider-Man and a statement growing up you know I mean so I was big on that Clone Saga drove me away uh came back throughout college and read here and there but then when they did a new brand new day yeah",
            "start": 1532.47
        },
        {
            "text": "and a statement growing up you know I mean so I was big on that Clone Saga drove me away uh came back throughout college and read here and there but then when they did a new brand new day yeah which was what they call were they breaking them up their last day the last day or something whereas Mary Jane and Peter's like they knew was ending and it was one last day one last day they'd be a pretty rare day yeah that was for me I'm like nope don't want that I hate that I love oh I hate continuity you hear me talk about I love continuity in some respects where I love a universe where they're together and they have a kid and everything great so when they did Renew Your Vows yeah and they gave me the alternate universe with an M and a me or whatever like yes all in and I'm reading that but that one seems to not really play into the whole Spider-Verse and all other **** no it doesn't okay and I don't like that either I'm all I'm against that completely what not being happy I love my",
            "start": 1576.36
        },
        {
            "text": "one seems to not really play into the whole Spider-Verse and all other **** no it doesn't okay and I don't like that either I'm all I'm against that completely what not being happy I love what my favorite Spider-Man run ever is the Marvel Knights run that they did okay then it over Ultimate yeah overall to me the Marvel Knights I think is a little bit darker ya know what that was all Marvel Knights and I don't it's really really really good I mean the best Spider-man story of all time is the Ezekiel storyline Amazing and by the code of stuff from like way back in the day I issued 36 of volume 2 of Spider-Man of a new standard and it's **** good but then that more recently the Marvel Knights was a long time ago but I love that and that's one what led into the whole him doing the deal with the devil yeah or whatever that caused all this stuff of energy not being married um which I like actually I go that's a contentious thing this Russian was new and you need to know years",
            "start": 1612.3
        },
        {
            "text": "with the devil, yeah or whatever that caused all this stuff of energy not being married, um which I like actually, I go that's a contentious thing; this Russian was new and you need to know years and continuity and they weren't to spin their wheels, yeah and to go forward and there was the whole Spider-Island thing which was a disaster; I came back after Spider-Island and that's when there was like a weird low period before Superior Spider-Man, like the Doc Ock chatter saga, yeah and that's when I was I I'm gonna give this another chance and I started reading it was alright but then once the Peter Parker Industries thing started it was so good; there were thirty-two issues of that and then after that amazing spot and I kept going I'm like man they're doing a killer job, damn; slots off on top of it and then yeah then once the House of M event happened and they kind of changed things up in Peter's bit more adult, I'm exactly right, Peter Parker Industries, Miles is being the young",
            "start": 1664.65
        },
        {
            "text": "then yeah then once the Han Solo movie hold event happened and they kind of changed things up in Peter's bit more adult I'm exactly right Peter Parker is an adult doing it for Marvel Studios, Miles Morales is being the young Spider-Man we all know and exactly think of when exactly and I just as Peter has like a Spider-Car and a Spider-Jet and it's like not in the like hokey way it did like a real badass way he's like a brilliant mind like Tony Stark it's like yeah it's like a Batman-Tony Stark hybrid okay kind of like definitely won't blow them out this week is Peter Parker, The Spectacular Spider-Man I'm on Comixology reading this one and returns in the friendly neighborhood yeah the web-slinging wall-crawling Wonder returns New York City in an all-new Peter Parker, The Spectacular Spider-Man a companion series to the best-selling Amazing Spider-Man series Peter Parker is going back to basics for big heroic from the Big Apple featuring adversaries old and new be there as Spider-Man returns to his friendly neighborhood",
            "start": 1704.76
        },
        {
            "text": "To the best-selling Amazing Spider-Man series, Peter Parker is going back to basics for big heroic from the Big Apple featuring adversaries old and new. Be there as Spider-Man returns to his friendly neighborhood for his never-ending battle against crime and the dreaded Parker Luck. Why don't what it's too late? Spider-Man screaming \"There's always too many Spider-Man books, and they're never all great.\" Yeah, and this is trying to give people like me or a school kid something we understand that the real Spider-Man is not for you. So there's this... There's also the Spidey book going on. I like fighting there's a lot of them. I just try to keep up eventually cuz it's like it feels inconsequential. Not just because we thought on its yeah, and it's not just because it's not canon; it's just because they're not really doing the interesting stuff or sticking with it long enough for it to get interesting. So I that's why I really like Spider-Man properties, Miles Morales. While I'm sure which is a sequel to",
            "start": 1747.05
        },
        {
            "text": "they're not really doing the interesting or sticking with it long enough for it to get interesting so I that's why I really like Spider-Man property Miles Morales while I'm sure which is a sequel to the Ultimate Comics run they did such a good job of tying that in with Spider-Gwen yeah Spider going I have my issues with the typewriter Gwen still the character is awesome yeah the book is enormous I would say just miss they never hit I enjoy I was talking about this I think with you and I don't think we were on a show but I'm not even somebody else talking about it I think I finally put my finger on what was off-putting to me about Marvel but now I can embrace is the fact that DC always felt stick with me grounded to an extent that it was in the real world there were all these different things which is why I ignored the magic stuff and I just didn't think that fit Marvel trying to be jumping in wanting to be a Marvel fan and like you actually enjoy it I read all this Daredevil stuff",
            "start": 1784.55
        },
        {
            "text": "things which is why I ignored the magic stuff and I just didn't think that fit Marvel trying to be jumping in wanting to be a Marvel fan and like you actually enjoy it I read all this Daredevil stuff they're like old something that was so great that like we recognized by Gavin people jumping in though know like I loved when Spider-Verse first started into that and have been reading it I'm like great but then it was like the Spider-Verse crossover **** where they all understand there's multiple realities and they jump before it and they talked to Spider-Ham and everything vine it's like for me I think that's what was always a bit off-putting especially being a huge All-New Wolverine fan in reading Laura's book reading Laura's book I'm reading only you know in in vacuums right where I'm not I'm just grabbing what I know I like singing with it and so like I'm reading Laura's book and it's this great tale about her and the other clones and all stuff and then there's a Squirrel Girl issue",
            "start": 1826.7
        },
        {
            "text": "I'm just grabbing what I know, I like singing with it, and so like I'm reading Laura's book, and it's this great tale about her and the other clones, and all stuff. And then there's a Squirrel Girl issue. It's when I was talking to the squirrel, and I'm like, \"That is so weird and out there.\" But like now that I'm starting to grasp what I think Marvel is, and why I was off-put by it, I can embrace that a bit more. In fact, I'm reading Spider-Gwen right now, and they do the Spider-Verse thing, and Spider-Woman and Silk crossover. I was like, \"Okay, like I know of these characters.\" I knew of yeah, I read Spider-Woman; she's pregnant jumping in. They're like, \"Okay, cool.\" But then there's how knowledge to Longshot they're talking about different universes and jumping between each other. Like that would be operating me in terms of reality breaking. I gotta get louder, you know? I'll ignore it, and then it like comes into the house. Um, but then what I hated about it was it was just another event where it was like our you.",
            "start": 1865.31
        },
        {
            "text": "in terms of reality breaking I gotta get louder you know I'll ignore it and then it like comes into the house um but then what I hated about it was it was just another event where it was like our you know it ended in same thing with Spider-Man crossover where I was like whoa hey they're together it's like right nice to go read this and that in this to get back to here yeah and that is the biggest problem with comics in general but I love it because I'm invested in those universes and it's like once it gets out of it that's when I give up and that's why I gave up for a long time I'm as I fully gave up on Amazing Spider-Man because it started getting doing crossovers with comics that I'm like no I'm not giving that a shot sure so I like when it's six women's between two series I'm okay with it my spider-man spider-gwen I was fine with Spider-Verse is fantastic that whole run on many books it's between about four and it is a lot but they do a really good job of actually continuing the",
            "start": 1901.64
        },
        {
            "text": "it my Spider-Man, Spider-Gwen. I was fine with Spider-Verse; is fantastic that whole run on many books. It's between about four and it is a lot but they do a really good job of actually continuing the story and it's not like there's a couple filler issues and some of the ways but like I I do recommend it. I think it's going to give you a very good idea of who all the Spider characters are yeah and their reference nonchalantly all the time but did you read the Spider-Man Spider one thing where they're jumping around the different universes and they end up in the Metropolis no I'd it's that one yet dad cool ok cool because I was on a plane and Jeff had Spider one mmm because like I have all my Spider-Gwen that I was **** and I because my problem with Spider-Man Miles Morales is that from the jump I've liked him mmm-hmm I started buying his singles back in the day then I forget watch a lot never did and I hadn't read I've tried to read Ultimate Spider-Man so many times and it just it's so",
            "start": 1937.31
        },
        {
            "text": "Jump, I've liked him. Mmm-hmm, I started buying his singles back in the day, then I forgot to watch a lot of it, never did, and I hadn't read Ultimate Spider-Man so many times, and it just... it's so hard for me to get out of the first few volumes because it is they do twist, but it is tried and true, like it is Norman and this and going well. The biggest saw was that was Ultimate Spider-Man is that it hit a point where it wasn't I mean again it's just like we're talking about the continuity got so blown up and crazy yeah that you couldn't read Ultimate Spider-Man without reading Ultimate X-Men, Ultimate Fantastic Four, and The Ultimates, and an Ultimate... nothing. I was into that because I was like, \"Oh, I'm investing, and I'm gonna read every single one,\" and it was worth it overall. Right, a lot of duds, hundreds of duds yeah but it got somewhat good, we're good. But my thing was like I felt like I was doing a disservice did you have been just at Milestone and so then I've never I've",
            "start": 1980.65
        },
        {
            "text": "right a lot of duds hundreds of duds yeah but it got somewhat got some we're good but my thing was like I felt like I was doing a disservice did you have been just at Mile High and so then I've never I've never been able to pick it back up and I'm Marvel Unlimited you know I do the Marvel Unlimited thing yes I'm used to catch up on Miss Marvel yeah I used to go back and read this Daredevil stuff I go back and read certain Spider-Man things I need to sit down and just commit and catch all the way up on there you know honestly if you wouldn't start when Miles first appeared yeah and really did back the Ultimate Ultimate Spider-Man Ultimate Comics Spider-Man is what I think that was originally called and you just have to follow that there's a couple events they would throw you off yeah when some of the X-Men get involved and some other things where he's like you would need to know that the history of it so otherwise I think it's pretty straightforward and they did a good job moving",
            "start": 2020.88
        },
        {
            "text": "when some of the X-Men get involved and some other things where he's like you would need to know that the history of it so otherwise I think it's pretty straightforward and they did a good job moving him over to Spider-Man: Shattered Dimensions and it was a reset point like things happen where people die and then when it moves over they're not dead anymore so it is where he's at now is a great reset point that all you really need to know is Peter Parker's dead the Ultimate Peter Parker's day I'm not and what influences him yeah and that the oh the Gwen Stacy and Aunt May from those in the universe are now also here they are still alive I was still dealing with Peter's death oh very interesting is what that is the Uncle Ben's just two miles okay okay cool uh I think I never really got your Pulitzer what is your Spider-Man? LM say is I'm super-stoked through responding okay clear the Boswellia Serrata man this morning I got in jumped in pulled off all my stuff so I'm get I got Invincible 137 of course part 5",
            "start": 2061.8
        },
        {
            "text": "spider-man says \"I'm super-stoked\" through responding okay clear the boswellia serrata man this morning I got in jumped in pulled off all my stuff so I'm getting I got Invincible #137, of course, part 5 of the last issue. Oh **** there's another minute I love Invincible because I just forget about it sure I can't it's my it's the one that I check every week when I get the image oh what a thing as I forget about there's no consistency check what I'm psyched I went all down I'm just like \"fries\" yeah I read it this morning yeah it's required reading for me whenever it pops up I want to jump right into it I would spoil anything like this issue a lot I am I understand we're building to the final 12 you know I mean or whatever here that to end the series but I am to the point of like can we just get our **** together and that was a nice change of pace uh",
            "start": 2108.27
        },
        {
            "text": "That's getting old, yeah. Let's go, let's fight a little bit. You know, I mean this is a great issue though. Of hey everybody, we got to get our act together. And that was a nice change of pace. Uh, Trinity's on my list. That's the Superman/Batman/Wonder Woman book. Oh cool, he'll love it. Have you read it? No. My favorite thing about Trinity is the fact that it's so cohesive. It is its own thing. It's doing its own thing. It pulls in like what's happening without the universe throughout the universe and like little comments or whatever. But it's all done by this dude Francis Manapul, and I'm talking about he writes it, he draws it. Like it's his thing which I think speaks to why it's so good. And in fact that hey, I'm going to tell you this story about Superman/Batman/Wonder Woman. And that did I'm not going to get caught up or convoluted. Of course I picked up Superman #25, Super Sons number 5. I'm a big Super Sons fan. My heart grew three sizes yesterday when I saw the Jonathan and",
            "start": 2149.25
        },
        {
            "text": "I'm not going to get caught up in the convolutions, of course. I picked up Superman #25, Super Sons #5. I'm a big Super Sons fan; my heart grew three sizes yesterday when I saw the Jonathan and Krypto figure they announced or whatever. I'd missed this, and somebody tweeted at me, so I got on that. I keep downloading All-Star Batman, but I'm way behind on it. Injustice 2 is really good Batman right now, if you also like Batman. Feel like Chef John's doing it again, his own thing about that, and there are any Batman comics that follow up on the Batman run, I mean, keep the continuity going? Yeah, yeah, um, yeah. On the Snyder Batman, yeah, that's why I meant for Also. I think I said Jeff Johns; that's what I meant. This latest run is supposed to be really cool, yeah, yeah, yeah. Nighter areas, the yellow All-Star Batman yes is great but it's out of continuity right, that's the whole thing with it. It's just him doing All-Star Batman, worries you know the story and doesn't have to worry about.",
            "start": 2189.06
        },
        {
            "text": "final all-star Batman yes is great but it's out of continuity right that's the whole thing with it it's just him doing all-star Batman worries you know the story and doesn't have to worry about the other stuff it's what I understood from launch you can google at for me and check my check that sounds cool but yes there's almost in that continuity though yeah why don't we solve the thing like a couple last week - I've totally given up on DC in the last month driving because the only thing I really stayed up on was Batman and it once that ended yeah and they started a new one there was like these other two people involved here they're also in Batman outfits and what the **** yeah no they're following up on it spoilers nothing as we talked about on the show Catwoman or Batman proposed Catwoman which is it I thought was awesome he did on the rooftop because they're drawing for it went in the interview IGN had it I think it was Joshua the interview we had with the creator right was",
            "start": 2232.62
        },
        {
            "text": "Catwoman which is it I thought was awesome he did on the rooftop because they're drawing from it went in the interview IGN had it I think it was Josh (presumably Joshua Williamson) the interview we had with the creator right was pulling from the fact that you know how they're still dealing with the whole Rebirth like in like how that brought back Wally and they knew something's happened somebody stole it's **** with all the futures in past whatever and the button was embedded in the wall of the Batcave remember this no one of the Watchmen buttons was embedded though the community leaders Reavers oh **** okay so yeah no yeah I literally only read the 40 action is coming that **** to DC and it's going to **** some **** up basically okay the University lighting they did a run called the button there wasn't a run I should say it was a crossover between the Flash book in the back in Batman's book and that was my first time coming back into Batman for a while and it was really good in terms of Bruce and",
            "start": 2270.01
        },
        {
            "text": "a run I should say it was a crossover between The Flash book in the back in Batman's book and that was my first time coming back into Batman for a while and it was really good in terms of Bruce and Barry trying to figure out what's going on and then that took them back to Flashpoint which gave Batman a chance to talk to Thomas Wayne when he was that Batman from Flashpoint your if you remember and okay don't matter but I think they he Thomas has this as that existence like fades into nothingness tells him don't be Batman that's my gift I don't want you to have this like don't do this for me I mean like that was the Creator was talking about that in the book they're doing now about why Bruce would propose but I guess like from what they said now we're leading into I think it actually starts with issue 25 which is a long one yeah The War of Jokes and Riddles part one start I don't know The War of Jokes and Riddles sounds all right and that's the thing right don't miss this exercise",
            "start": 2306.76
        },
        {
            "text": "with issue 25, which is a long one, yeah, The War of Jokes and Riddles part one starts. I don't know, The War of Jokes and Riddles sounds all right, and that's the thing, right? Don't miss this exercise anniversary issue in his own words, Bruce Wayne there it's a harrowing never before told tale, The Dark Knight's greatest failure and the horizontal line and the spirit of Year One and along Halloween prepare to see a side of Batman you've never seen before get in on the ground floor check out this Bat-minute like the idea that it's like they did the cliffhanger of the proposal and now they're going into this War of Jokes and Riddles which yeah sounds great, I mean that's a great name, yeah, I know. I hope they wouldn't say that **** the you know take away from those things then you have much other DC superhero books and stuff and I'll run late but what I want to give a shout out to is something I started I bought on a whim then sought Cina Grace who's doing Ice Man the new Ice Man which is Ice Man",
            "start": 2346.54
        },
        {
            "text": "books and stuff and I'll run late but what I want to give a shout out to is something I started, I bought on a whim then sought Cina Grace who's doing Iceman the new Ice Man which is Ice Man - that is on my playlist as well ah he retweeted a list somebody put out of like I want they say it was something pretty effective like some of the best queer books you can get right now or never right because like I have you found the I trans stuff I can gain em oh yeah well I know that like they just gave him a solo book that I read that I fan-run was included in there so is that my lesbian experience alone loneliness a manga this girl's like autobiographical mug or whatever it said bought it on a whim or whatever and the opening page I started it like when after I read in that's what I wanted know if it's gonna be something good with the opening pages flash cliffhanger flash set up to it really yeah I want to know your whole story so I'm excited to get home and read more that has been",
            "start": 2382.62
        },
        {
            "text": "It's gonna be something good with the opening pages flash cliffhanger, set up for it really. Yeah, I want to know your whole story, so I'm excited to get home and read more. That Hazop that's I've been reading Sex Criminals, not the newest issue - all the newest issue is clear from last week. It's Omni; I've downloaded it, but I have that man - that is a series that is so much better. Benched, yeah, I know yet the most months. It's like there's so much going on when you talk about Invincible right? We're just... it's not, I didn't realize Sex Criminals took a huge break. Mmm-hmm, and so when they brought out with 2 issues ago, three issues ago, they're like, \"Hey, here's the entire recap.\" I was like, \"Alright,\" and then they said, \"Oh, and then we took like an eight-month breakup.\" No way - I haven't realized I was wondering why I couldn't piece it all together. But yeah, that saga even Invincible because I thought I used to read it; I loved the binge-read like that's why I've been with these characters.",
            "start": 2428.19
        },
        {
            "text": "I was wondering why I couldn't piece it all together, but yeah, that Saga even Invincible because I thought I used to read it. I loved the binge-read, like that's why I've been with these characters for years, but like I need to sit down again with that, yeah, just go from the start to hear Saga from start to finish. God's got it so I'm gonna add some Oh, some Wolves, but right now it is at the top of its game alright to wrap this up later gentlemen what we want to do of course is take suggestions from you for required reading that we all read together then talk about next week so you have a week to read a trade paperback a graphic novel. The first take are doing is Lock-and-Key Volume one, the reason we're doing Lock-and-Key Volume one is because I'm an Ice Cream Sandwich fan, J fit, J fit, so I can ever remember came by the studio during Kinda Funny Live, we couldn't let you up because you're... we can't let everybody up during Kinda Funny Live but I got that from him. I'm gonna get back in the day I'd also",
            "start": 2465.6
        },
        {
            "text": "came by the studio during Kinda Funny Live, we couldn't let you up because you're we can't let everybody up during Kinda Funny Live but I got that from him I'm gonna get back in the day I'd also gotten that book from Joshua Hale Choset at IGN Comics who think that I need to read that I need to read it so we're gonna read that talk about it next week Lock & Key Vol 1 you are encouraged to read it as well if you already have it so that when we come here next week we can oh I'll talk about it in a book like format hell yeah make sense you like that **** Kevin yeah what's wrong I want to read I want you guys to read Black Science there's always another window right now I know your **** problem I wanna **** never gonna like just rain on everyone's parade just you guys if you didn't know this is the Kinda Funny Morning Show it only **** did we go long today we need to work on that now we do you do you do ah each and every week to here on twitch.tv kinda funny games we come to you with",
            "start": 2507.97
        },
        {
            "text": "is the Kinda Funny Morning Show it only **** did we go long today we need to work on that now we do you do you do ah each and every week here on twitch.tv KindaFunnyGames we come to you with the nerdy news we want to talk about along with the things we want to talk about D when we hang out and do stuff hell yeah we do all that we have different segments we jump in a chat answer questions comments and concerns we read subs we read tips but in between those many segments I just dance we give away stuff hmm if we bacon an ad we give away two things we're going to wait two things today are we not le le alright great so I for some reason don't have it oh there's perfect there's got it got it good so today we're giving away two copies of Friday the 13th on PlayStation 4 so that maybe these people can come sub with us on Twitch play with us on Friday when I play Friday 13th with the community remember KindaFunny columns Flash 4x13 I was one for a second after that but you don't",
            "start": 2548.83
        },
        {
            "text": "people can come subscribe with us on Twitch play with us on Friday when I play Friday the 13th with the community remember Kinda Funny columns Flash 4x13 I was one for a second after that but you don't you know what I mean read your it I don't know read your admin to give way to complete always brought to you by Crunchyroll it's made by the team over at Crunchyroll if there's awesome video apps available on PlayStation 4 Xbox One desktop mobile pretty much anywhere that you're watching stuff you can watch all of your Crunchyroll videos all the Funimation videos Rooster Teeth Cartoon Hangover C so all this stuff Attack on Titan is going very very well I think the season just ended it actually people are liking it a lot Nick and I have watched the first three episodes you can watch along with us on our YouTube calm slash Kinda Funny channel and you can use your subscription right here VRV dot com slash Kinda Funny we'll get you a free 7-day trial of the Crunchyroll combo pack so you can watch along with us",
            "start": 2587.65
        },
        {
            "text": "calm slash Kinda Funny channel and you can use your subscription right here VRV dot com / KindaFunny We'll get you a free 7-day trial of the VRV Combo Pack so you can watch along with us. You can watch on Crunchyroll dubbed or on Funimation note site, Funimation dubbed, Crunchyroll sub-options a plenty. Greg gotcha whole bunch of things My Hero Academia everybody's talking about it, it's there too if you like podcasts obviously receives a great thing they got a whole bunch of that stuff in them early there definitely check it out. Let me know what you are watching on VRV get your home today what are you eating cool Grubhub and chips what 300 okay cool great evening burritos we are VRV / KindaFunny so we're giving away two copies of Friday the 13th on PlayStation 4 hopefully you can come play with us on Friday now you play go to Kinda Funny Games calm / F13 sign up there how do you win games when we give things away it's simple be in the chat like some of you are live right now",
            "start": 2629.74
        },
        {
            "text": "come play with us on Friday now you play go to kinda funny games calm / f13 sign up there how do you win games when we give things away it's simple be in the chat like some of you are live right now and twitch.tv/kindafunnygames or if you want to folks listening on youtube.com/kindaFunny or a podcast service later because new post them there we'd appreciate you to subscribe and rate them over there too there's three ways you can win either am provider chances or not to **** be here number one subscribe to us on Twitch this automatically enters you to win everything here plus you get the logo Dexter name the cool emotes private chat time with us you get to play multiplayer games with us and get the show ad for you looks we bacon like we just did love you I'll see if the Amazon Prime you have twitch prime use it to give us a free sub otherwise Amazon's just stealing your money and **** that yeah you can also go to patreon.com/kindafunny a tree on Comm slash kindaFunny",
            "start": 2684.64
        },
        {
            "text": "Prime you have Twitch Prime use it to give us a free sub otherwise Amazon's just stealing your money and **** that yeah you can also go to patreon.com/crashcourse a tree on Comm slash Kinda Funny Games two dollars there gets you entered for the raffle ticket you can win a game each and every time it's random number generator calls you up so the first code Tim who then it is going to Twitch chat member right now watching live Nini link NIM you link ba-ba-ba-ba Friday 13 and then the second one is going to Patreon.com slash Kinda Funny Games subscriber Michael cursor you are getting it there as well probably the Thursdays man you do the patent at 3 and 3 the old school three and three check it out because some questions queue up your questions comments and concerns in the chat and we will get to them on school up a bid to try to find some in a New York minute I really that common taco this one that was fun shot town champion says wasn't flaming hot cheetos I don't know jeah Bob",
            "start": 2720.4
        },
        {
            "text": "will get to them on school up a bid to try to find some in a New York minute I really that common taco this one that was fun shot town champion says wasn't flaming hot cheetos I don't know jeah Bob big-ass bag police flamin hot cheetos I've been staying away from him because I like crack you're trying to lose the land and she I wake up this morning there's a freaking bag of Hot Cheetos on my nightstand yeah I'm like what the **** oh the glide I had to get him away from me I'm like patrol Malloy can you don't put them on put them anywhere but next to me here yeah oh sure yeah this exact well you do that I'm gonna read a tip stop he says sup guys I was a guy in the front row wearing the producer slash Deducer shirt at the game spot booth it was a dream come true to finally meet you guys can't wait to can't watch live but hope y'all have a great day thank you for your support we hope you have a great day to King franchise 88 says Tim Dobbs on carnage being confirmed as the main villain",
            "start": 2770.17
        },
        {
            "text": "wait to can't watch live but hope y'all have a great day thank you for your support we hope you have a great day to King franchise 88 says Tim Gettys on Carnage being confirmed as the main villain in the Venom movie oh man we'll see this movie I wanna be awesome I've read through I'd like it to everything I figure out fits in the Marvel Universe or not but that they haven't got that right there's conflicting reports and I but it's Kevin saying that I neveri never oh you nailed it Kevin said that it's not but then he was in an interview with the Sony lady who said it is and she kinda has made eyes so who the knows I would go with Kevin on this one mystery man 300 yeah became and said guys don't go watch Transformers: The Last Knight it's 2 hours and 30 minutes long Michael Bay masturbating on screen Optimus has less screen time than Godzilla in the reboot and the movie makes an Anthony Hopkins annoying who would have predicted it oh wait everybody I can't believe that I",
            "start": 2816.94
        },
        {
            "text": "masturbating on screen Optimus has less screen time than Godzilla in the reboot and the movie makes an Anthony Hopkins annoying who would have predicted it oh wait everybody I actually still can't believe I name this movie theaters like that's crazy to me but they messed up that bad ah hate them Levin coma we have a tip it's just finished Emily is away - lets play oh my god what a ride this should go and the continent Hall of Fame before you ask Greg yes I did buy the game PS you Kyle of course remember to for our Emily is a way to let's play up on kind of funny games so go watch it we're drunk in it I didn't remember the chicken thing focused on quoting it the chicken thing yeah we're Jia brought us chick anywhere and somebody we said we're so drunk we can't taste this chicken this happened in the video apparently like you're getting tweets about what whatever any of that SNES Shomer 34 talking figuring off and chat I don't know",
            "start": 2857.38
        },
        {
            "text": "we're so drunk we can't taste this chicken this happened in the video apparently like you're getting tweets about what whatever any of that SNES Shomeru 34 talking figuring off and chat I don't know this is for all the Kinda Funny best friends who have helped me out with a project by filling out a survey love you all here's the link if anybody else wants to help it out I'm spamming the link in the chat for you who've been one says transformative I was still probably better than Sasuke alright chat get him Reince until he says party mode was insane very well done party mode our new show is now available for everyone for free on youtube.com slash Kinda Funny Games watch it it's freaking fantastic it's me I was really really good please go check it out we're please give us some support and some love Dandy UK canto gave a tip and said people forget that directors are employees and that they work for the producer it sucks but I'd rather they get someone who cooks with the producers then",
            "start": 2901.9
        },
        {
            "text": "some love Danny DeVito gave a tip and said people forget that directors are employees and that they work for the producer it sucks but I'd rather they get someone who cooks with the producers then makes a movie through controversy and anger and yes trust your visionaries Dorian 7-5 7-5 says that definitely didn't happen about that anything Rock I have no idea why multiple people keep sending at me rock them always wanted to make it a quote from the game maybe when Emily's drunk always wanted to make your own video game but weren't able to weren't sure where to start follow Rock song to get started screamin Monday through Thursday at 8 p.m. central it's lots of fun yellow yeah follow Rock some are Ock zom ok DJ can't just given to have a much bigger problem is that the director of episode 9 just put on a terrible film in the book of Henri it's sad to see Lord and Miller go but I'd rather they replace Colin Trevorrow out you want to kick us into the old subscribers only mother get",
            "start": 2947.29
        },
        {
            "text": "Greg Miller and Lord and Miller go, but I'd rather they replace Colin Trevorrow out. You want to kick us into the old subscribers only mode, get a couple out of that. Let's do that. Dancer Sarah gave a tip and said so tell them oh please. What is your thought about Transformers last night having an average three point three out of ten and a 16% on Rotten Tomatoes? Hopefully this will tell them no, that should mean something to me like I don't get it but like critics had to say about transformers yeah it's like because it's Leo I could critics mind you're made up about the franchise and there's no matter what they're not going to give it a fair shake. Having said that I've seen real fans give their opinions and it is even worse than what the critics are saying which to me that's I'm done so your oh you don't believe the fat cat elites, tailored GameSpot's Peter Brackey with his hate for Friday 13th which is justified but I don't agree with WSJ.",
            "start": 2995.08
        },
        {
            "text": "saying which to me that's I'm done so your oh you don't believe the fat cat elites tailored a GameSpot's Peter D. Brown gap with his hate for Friday the 13th, which is justified but I don't agree with. Greg says why didn't you ask Jason Solomon for X? Come on, the switch - I mean we already have Rabbids and Mario Kart so why would you need it? You don't need it. Here's Johnny 16 said shot at the MTV Spider-Man show Neil Patrick Harris was in. I'll give it a shout-out, is different in Electro looks stupid as hell but he was there alright. Final, you can't agree - I don't remember it that well. I mean I want to host out on a really Friday night follows in high school I was busy watching Extreme Ghostbusters all right. I think city yeah. Final tip comes from fell down a well. Greg and Tim are either of you reading Scott Snyder's latest All-Star Batman run? It is lit, and you can quote me on that. Like I said started it - I fallen out when him and Two-Face were going across the country. I need to get",
            "start": 3037.68
        },
        {
            "text": "of you reading Scott Snyder's latest All-Star Batman run, it is lit and you can quote me on that. Like I said, I started it, fell out when him and Two-Face were going across the country. I need to get back to it; it's on there for sure. Let's get one more... oh yeah, look, Dump. Oh yeah, he did. Look, I'm sorry. Robert F. Anderson says Jose Otero leaving IGN and I saw that Jose leaving IGN for Nintendo - Nintendo, Mr. Nintendo. Everyone who works at Nintendo is he will the Audrey Drake, Rich George, yeah, boom, yeah, three for three, yeah. Well, there was other people's where was other people; they all went to Apple, yeah, very true, that right. It all works for these people... um, a lot of sub trapped thing, yeah. They have to get out of it. Tinh are you reading Transformers Lost Light? Yes, the Transformers comments too freakin' awesome right now. I don't really like Prime that much, but Last Light is obviously so damn good. More Than Meets The Eye was fantastic in this continuation; one of my favorite comics I've",
            "start": 3084.86
        },
        {
            "text": "freakin' awesome right now I don't really like Prime that much but Laika's Light is obviously so damn good More Than Meets the Eye was fantastic in this continuation is one of my favorite comics I've ever read Ladies and gentlemen, this has been the Kinda Funny Morning Show here on twitch.tv/KindaFunnyGames. Remember if you're watching live we're going to roll on over into the Kinda Funny Games day like... I'll get it right one of these days. If you're not thank you for watching, thank you for loving us, thank you for subscribing thanks for rating us on iTunes if you're one of those folks we're here every day at 11 a.m. with all the nerdy news we want to talk about for now we're going to reset but remember Kim is going to go to my car and read all the subs while we reset the thing, get and Rene in here I like it's I feel like we're bringing our... like an iron lung Shh like the smoke poor that she walks in by we right back",
            "start": 3135.96
        }
    ]
}