{
    "id": 2536,
    "video_id": "BEkp96bcj0A",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Tim Gettys",
        "Kevin Coello",
        "Andy Cortez"
    ],
    "title": "Penis Gummies For All The Boyz - Kinda Funny Morning Show 04.07.17",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1491596218,
    "duration": 4879,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to the Kinda Funny Morning Show for April 7th 2017 I'm Tim Gettys joined For the First Time by Andy Cortez Cortez maximum Cortez himself his first morning show how many Morning Show have you watched I've been here since day one **** day one am I bringing it too hot right now am I com hot bring that's all we got here we got the hotness so hard right now yes dude you know what I'm really excited about it's just the boys today you know we got the adults are all in Vancouver when the cats away the the the all right let's go you're there you're there we're there we're partying all right so how stoked do you to to be at I'm here I'm excited I've been here since day one been watching since day one uh since y all left IGN man and and it's very surreal to be here on this show on and now this is just a thing like you're just probably going to do this not all the time but like you know enough of the time and I can hear you all from the next room yelling and I",
            "start": 1.47
        },
        {
            "text": "on this show on and now this is just a thing like you're just probably going to do this not all the time but like you know enough of the time and I can hear you all from the next room yelling and I just kind of put my volume up and like **let me concentrate please** no we're never going to let you do that we're never going to let so do you regret your your choice of leaving Rooster Teeth yet uh it it weighs on me every day um I think about it every night when I go to sleep um and then I think of Kevin's face and it I regret it even more yeah so speaking of Kevin that's I think the most important thing that we we got to jump off here how's your experience now that you've had to to actually deal with him on this side of things well you know he graciously let me sleep in his hotel room during PAX West which is very kind of him tell him what I did to you um don't tell him actually yeah I'm not going to tell anybody about that what stays in Seattle stays in Seattle um Kevin reminds me of",
            "start": 64.44
        },
        {
            "text": "Pax West, which is very kind of him. Tell him what I did to you; um, don't tell him actually. Yeah, I'm not going to tell anybody about that. What stays in Seattle stays in Seattle. Um, Kevin reminds me of any interaction I see Kevin having with any other human being really reminds me of a parent walking around with their toddler or their three- or four-year-old and just like, \"Dad, why is the sky blue?\" Like, \"I don't know, Dad.\" \"Where are we going?\" Uh, \"We're going to the store. Why are we going to the...where?\" It's just like you just got to kind of entertain them because you don't want to be a dick to them, you know what I mean? Yeah. So, we hold on. Which side is Kevin in that? What side am I on? That Kevin's a little baby boy who has so many questions always the questions it's always a question and a lot of answers or like...and there'll be like six seconds of science and then man, I can really...then like yeah, yeah true, yeah man, yeah. So yesterday I heard you guys just out of nowhere just start doing",
            "start": 105.96
        },
        {
            "text": "lot of answers or like and there'll be like six seconds of Science and then man I can really then like yeah yeah true yeah man yeah so yesterday I heard you guys just out of nowhere just start doing push-ups yeah yeah absolutely includes Kevin I want to do so we're going to start this regularly right we're I me as soon as this show ends I think we got to we have to right daily P we have to after anyone knows of some app that randomly like an alarm turns on yeah that tweet that at us man well I think we want to do a random alarm or just at any moment like just set an alarm cuz I think we're going to forget about it maybe set an alarm for like 2:30 we'll forget to do push-ups I don't think so well no no no no I mean you know Kevin wants to be surprised by this alarm so he's like can we just get a random buzzer that goes off I don't know if that exists Nick is not going to be okay with that um if a random buzzer just goes off I mean that's the thing it's not in that side of the office",
            "start": 154.52
        },
        {
            "text": "get a random buzzer that goes off, I don't know if that exists. Nick is not going to be okay with that. Um, if a random buzzer just goes off, I mean, that's the thing, it's not in that side of the office, man, you know what I mean? So I think we're just going to like... We're going to close the doors at 2:30 p.m., set a little thing off, and then you know during the day in two weeks we'll forget that hey, it's almost 2:30 p.m. so it'll be you know we'll just be sitting on our desk, goes off, you know, get your PC TOS going, get the blood flowing. Um, yeah, are you going to join us? I think I need to join you; I'm getting ****, I'm not getting fat, I'm fat, but Kev, I feel... Yeah, the same way. Instead of um can the alarm be this ****, I really hope so, and then we just do push-ups. This song has aged so well; everybody dance, it's a great song. There's just a lot of uh there's a a lot of this material moving. We got the Bomber Boys over here. I'll never forget in uh third grade, I think this was the first moment",
            "start": 198.56
        },
        {
            "text": "dance it's a great song there's just a lot of uh there's a a lot of this material moving we got the Bomber Boys over here I'll never forget in uh third grade I think this was the first moment that I realized that I wanted to grow up to be a professional douchebag um I was the the last kid to walk into to class one morning like I was late oh my God I was late by like I don't know 3 minutes or something and I walked into my third grade class and everyone was dead silent and just looking at me like everyone was looking at me and not saying anything and I was like oh this is hella weird and the teacher just goes kick it and then that song started playing and everyone just started dancing and I was just like what the **** and then I came in was like that'll teach you to be late I'm like no that doesn't teach me to be late I like a **** rockstar keep playing that **** let's go that's rad yeah so that was fun um other random stories your Game of Grady show is now live for Patreon users",
            "start": 259.24
        },
        {
            "text": "that doesn't teach me to be late I like a **** Rockstar keep playing that **** let's go that's rad yeah so that was fun um other random stories your Game of Thrones show is now live for Patreon users over.com ofun I thought we had a fun time it was a fun time I realized I messed up though what' you do one of our topics was best pranks we ever did or worst pranks I don't know pranks we've done sure just like ways to **** with people yeah and uh I did didn't tell one of my my best achievements which the beep be beep just reminded me of I'm going tell you guys right now let me let me let me bring you back everybody **** strap in strap on mhm right yeah right let me set the scene for you it's high school all right 2006 or five everybody's got their pop collar everyone's popping their goddamn col aomi and Fitch American Eagle then there's 's me and Alfredo right in high school together we're just hanging out have you met Alfredo I have yeah he's a good dude live yeah so me and Alfredo",
            "start": 301.24
        },
        {
            "text": "goddamn Colin Moriarty and Greg Fitchner then there's me and Alfredo right in high school together we're just hanging out have you met Alfredo I have yeah he's a good dude live yeah so me and Alfredo hanging out and we were in our biology class and we had our teacher Mr. Donahue now Mr. Donahue was an old ass dude all right okay and he loved biology he loved biology so much now like he was there from the start he was there yeah he he was like it was actually history that he was teaching with the biology so so he's there and he was teaching us all his **** **** and uh every day at 12:30 his he had one of those like '90s wrist watches the the digital one like a Casio and every day like at 12:30 it would just go beep but just like that really faint beep you know and uh and he knew that that's when he would have to let us go on break for he like oh you guys get your five minute break whatever the **** wait how long was this class you need a 5 minute break it was like three hours or oh",
            "start": 349.52
        },
        {
            "text": "when he would have to let us go on break for he like oh you guys get your five minute break whatever the **** wait how long was this class you need a 5 minute break it was like three hours or oh **** okay um my high school was really we um yeah so Alfredo thought it'd be funny to buy the same watch that he had and every day at a different time make the beep go off that's a great idea we started doing it just like at a different time then we started doing it like multiple times a day and it got to a point that we would just every time we'd start talking he would beep and Don he would just stop and try to find it but it's one of those beeps that you can't really tell coming from anywhere man I have never seen somebody get so upset that's such he's looking at his watch and he's like and everyone else in the room is like what the **** is going on cuz they didn't know we were doing it oh man that was it was it was gold oh my no Mr. Don no Mr. Don he did pass away about three three years",
            "start": 399.64
        },
        {
            "text": "else in the room is like what the **** is going on cuz they didn't know we were doing it oh man that was it was it was gold oh my no Mr. Don no Mr. Don he did pass away about three three years ago everyone was really sad about it but he has a twin brother though so they can totally pull one of those Beerfest moves and everything would be okay my twin brother called me by the same name I forgot when we were doing the prank things not that I always contribute on these things but like I forgot the thing that I did to you for like 3 years do you remember this I wouldn't call that a prank I just call it you being Kevin and me I guess I guess tell the people Kevin tell the people Kevin you're a prank every day yeah you are just a prank it's true I would make this noise and now the noise itself has been lost to history I can't remember what the noise was at a certain point it stopped being funny and he was just too scared of it that's all it was I don't think it was that that was all",
            "start": 445.68
        },
        {
            "text": "been lost to history I can't remember what the noise was at a certain point it stopped being funny and he was just too scared of it that's all it was I don't think it was that that was all that it was all right whatever and then I would jab at Tim Gettys he'd go no it was **** jab me it was like a noise anyways it was that I trust me Kevin Coello it was that you just go I'm already and like get me and it suck pretty much it just meant that when he did that he was going to hit me and so all you did was the pavlovian response or some **** like that that's exactly great you treated me like a monkey and you you taught me that if you hit me I'm not going to like it congratulations no it was the noise cuz then I would do the noise and you'd be like yeah because I didn't want you to hit me yeah it was great man that's **** walking up the stairs yesterday when you were poking the back where the back of my legs where my knee joints the opposite side of my knee yeah I I've that I was ready to cat I",
            "start": 489.2
        },
        {
            "text": "great man that's Greg walking up the stairs yesterday when you were poking the back where the back of my legs where my knee joints the opposite side of my knee yeah I I've that I was ready to cat I wanted to start World War I I was so annoyed by that I used to prank t-shirt no it's not that you were I I wasn't scared of falling it just I understand understand but I wanted you to fall here's another really dumb thing I did mhm back in the day uh this is a I guess this could be the GoG special features so um my buddies and I uh a friend of mine was driving in his vehicle his SUV which had a big Bullbar or what what what are they called the grill like the oh yeah okay like the thing in front of trucks yeah yeah yeah yeah um and we were driving on the highway bunch of orange ass cones everywhere right like the big sort of cylindrical ones not like the pyramid looking cylindrical cone oh okay like like The Wider ones you know big giant barrels yeah yeah and so um my buddy we were just",
            "start": 528.08
        },
        {
            "text": "right, like the big sort of cylindrical ones, not like the pyramid-looking cylindrical cone. Oh okay, like, The Wider ones you know, big giant barrels, yeah, yeah. And so, um, my buddy, we were just driving this car and he was just like, like... knocking them down, right? They're in Texas, man, and they seemed really shitty, so like we were just knocking them down or whatever, and it was like, oh, like, funny, like we're all like hopped up on caffeine, right? Sure. And then, and it was nighttime, and then we see one, and we're like going to hit the... out of it, and as we get closer, it's nighttime, and as we get closer, we see that there's concrete barricades behind it. Then, like, we're just going really fast, and like, and we had to like turn, and like, oh my God, like I could have died that day, yeah, like, yeah, dumb-ass kids doing dumb-ass things. Not that same guy got into a hit-and-run with; he was driving. We stayed up all night; we were like, \"Hey, um\"",
            "start": 577.96
        },
        {
            "text": "my God, like I could have died that day, yeah, like, yeah, dumb ass kids doing dumb ass things. I didn't think it was the same guy, but he got into an accident in a hidden run while he was driving. We stayed up all night; we were like, \"Hey, um, let's go to Hastings.\" Remember Hastings? No, Hastings is like a Sam Goody, okay, one of those places with music DVDs, games, what have you. So we're driving to this Hastings at 8:00 or 9 in the morning because we stayed up all night, and we're in the lane to go straight; we need to be in the lane to take a left off the LAN. So we're in this lane, he's like, \"I need to get into the next lane,\" and he just goes without looking, and we hit a car on the side of their vehicle right, just like a little good enough, good enough of a no, but a good enough one, right? Like, oh ****, and he's like, \"Oh my God.\" And he's 15 at the time; I don't have a **** license; I don't have my license. What do I do? He doesn't have a license, and yeah, dude, he would just drive his dad's vehicle. He's like, \"I don't have a\"",
            "start": 625.24
        },
        {
            "text": "he's 15 at the time I don't have a driver's license I don't have my license what do I do he doesn't have a license and yeah dude he would he would just drive his dad's vehicle he's like I don't have a driver's license what do I do and we're at the light and then uh so we hit the car the other car is chilling there and then the light turns red and he just goes and leaves the car at the red light I like what are you doing what are you doing he's like I can't do this man I can't stop I can't stop and so the whole way home I was like dude what are we doing what are we doing and we get like get to his house and the whole rest of the day is spent in his room like looking out the window whenever like we're like they followed us they they got our plate man it was just I like what are we doing man why got out yeah nothing happened oh my God meanwhile that car is just sitting back the K God I'd be so pissed if that happened to me anyway man that sucks that sucks",
            "start": 674.64
        },
        {
            "text": "what are we doing man why got out yeah nothing happened oh my God meanwhile that car is just sitting back the **** K God I'd be so pissed if that happened to me anyway man that sucks that sucks whiskey asks where is Andy from uh Texas right on the border like as far south as he can go before hitting Mexico as far south I'm talking like 10 miles above the Border really yeah it's far south everybody goes oh El Paso no that's **** way west west what direction am I in West is that way west was El huh where is Elsa gundo Elsa I have no idea the second yeah how often would you go to Mexico then just like every once in a while like I mean as a kid we went a lot more cuz they had like awesome ass **** food over there also I was one of the ones who never wanted to go all my friends would cross the border to like go drink illegally like you know legally over there illegally for us I was like d I'm not **** with that I was like I was the kid who never went to spring break at the beach",
            "start": 712.0
        },
        {
            "text": "the border to like go drink illegally like you know legally over there illegally for us I was like d I'm not down with that I was like I was the kid who never went to spring break at the beach cuz I was just scared and like I knew that love you so much I knew that like my dad like I knew if I was going my dad was going to be like I know what you're doing over there you think your dad's watching MTV Spring Break like that's it he knows that like my friends all smoked weed and stuff and and I was like the always the one that was like scared of like getting caught and I was in a band a few times I was in a few bands and every time I'd come home from practice he would like hug me and like I knew he was trying to smell if I had weed on me it's like Dad I don't smell I I love you so much like and the thing is all my friends knew that like man your dad thinks that you were like a total alcoholic and a and a weed addict but you're not and it was just like this funny joke anyway",
            "start": 768.52
        },
        {
            "text": "much like and the thing is all my friends knew that like man your dad thinks that you were like an alcoholic and a weed addict but you're not and it was just like this funny joke anyway what's up with the news so this is the Kinda Funny Morning Show each and every weekday we get together right here on twitch.tv/ kind of funny games to talk about the nerdy news you need to know about no that's a isn't that a fun little phrase Greg this table this table we're so good at these things I want to say good we're we're horrible don't remember anything GameOverGreggy is a machine with it though yeah it really it's really impressive I just don't understand it's funny when there's like a slight error in the machine though oh then then the machine just freaks all the amount of times I've seen GameOverGreggy do one of these the little like he's talking talking talking and all of a sudden what the why are you doing that dude that's that's not necessary anyway uh we we we do all the news and all",
            "start": 808.6
        },
        {
            "text": "do one of these little guys, like he's talking talking talking and all of a sudden what the **** why are you doing that dude, that's not necessary anyway, uh, we do all the news and all that stuff if you leave tips we read them, I don't know, I don't remember what the rest of R-Roll is, I'm just having fun with my new favorite boy over here, here we are boys, just a couple of cute boys, I don't think I've said \"boys\" as much as I have like saying you yeah it's just like you know you bring the fun, just a couple of cute boys just out in the town ready to ready to have some fun and get into some trouble right Kevin no trouble no trouble okay no trouble no trouble for Big Kev dog no we're going to change that let's read the first story you're like you don't get in trouble I don't at all no the first story, first story comes from I'm going to read it off of Neath it's originally from the uh international business times but as we all know they write",
            "start": 847.56
        },
        {
            "text": "Get in trouble, I don't at all. No, the first story comes from I'm going to read it off of Neather (corrected to Naughty) Dog director of communications, Arne Meyer (corrected to Arne Adolph \"Arne\" Meyer), dropped a small detail regarding the game's length, potentially revealing that Uncharted will be around 10 hours long. This came in response to a question about when Uncharted: The Lost Legacy was revealed and set to release this year, transitioning from being downloadable content to a larger scale standalone adventure. Years ago, when we were asked if we were doing a single-player expansion for Uncharted, we always said, \"Well, we don't have the self-discipline to do that.\" If we tried to do that, we'd create a full game. There's no way we could sort of constrict and restrain ourselves, and that's exactly what",
            "start": 889.96
        },
        {
            "text": "always said well we don't have the self-discipline to do that if we tried to do that we'd create a full game there's no way we could sort of constrict and restrain ourselves and that's exactly what was happening here when we were doing story pitches we were coming up with a game that would be over 10 hours long so we suddenly realized everything we said was true and we couldn't keep it short hell yeah that's exciting for us it's very exciting so that's where we're at here and this is one of those things take it with the biggest grain of salt of all time right thick ass grain of salt that thick thick grain of Salt like that thick ass Cheeto I say we need to watch that video in a second but but what's cool about this is it's like all right at least this means that we're going to get at least a four to five hour game sure ab and like **** yeah I want four to five hours more of Uncharted what do you think the price Point's going to be see me and Greg were talking about it I I think",
            "start": 939.4
        },
        {
            "text": "least a four to five hour game sure ab and like **** yeah I want four to five hours more of Uncharted what do you think the price Point's going to be see me and GameOverGreggy were talking about it I I think that they could potentially get get it up there like I I can see them dropping it at like the $20 level but I kind of hope that it it's at least a $30 game just because that means that they're going to I want that much more Uncharted you know sure yeah I I'm I'm expecting a $29.99 price point mostly because Uncharted 4 sold so well and they made a **** ton of money on that game I feel like this is kind of like a like they don't necessarily need to make a whole lot of money on this on this expansion I'm soaked for it though I'm so stoked more Uncharted is awesome more Chloe absolutely up and there's more Naughty Dog news the next story is from Twitter Shannon Woodward tweets out she's from Westworld did you watch Westworld I love Westworld I did not who was she in Westworld I don't know she",
            "start": 977.44
        },
        {
            "text": "more Naughty Dog news the next story is from Twitter Shannon Woodward tweets out she's from Westworld did you watch Westworld I love Westworld I did not who was she in Westworld I don't know she was like the lab assistant that gets well spoilers oh yeah okay okay very cool she she looks totally unrecognizable in this photo she's also from CSI: Las Vegas crime scene investigator Interstellar oh okay she tweets out I'm embarrassingly over excited here because I'm peeking Neil Druckmann is letting me act in The Last of Us Part II **** yes so that is exciting Kev how does that make you feel did you like her performance in Westworld I mean if I'm being 100% honest I've never been a huge fan of hers really yeah are you a fan of hers from like CSI no I mean like I feel like her character is similar in both shows where it's like like the little like I'm going to figure this out like all right dude just stop you're gonna get yourself oh oh spoilers I love Westworld I think I",
            "start": 1022.36
        },
        {
            "text": "Is similar in both shows where it's like, like the little like I'm going to figure this out. Like all right, dude, just stop, you're gonna get yourself oh oh spoilers. I love The Westworld. I think I thought she was pretty good in Westworld. I mean, I mean not very memorable though. I think if you're I just get excited when any sort of talent from TV or movies crosses over in Video Game World, I get really stoked about that. Exciting, man! Yeah, it's exciting. Kev, I'm going to add a story in between these two right now that is the most important thing that happened yesterday. It's in there, it's in there. Where is it? It's uh underneath The Westworld. Yes, can you queue it up? Not an actual story worth sharing. What are you talking about? So the context of this Nick Robinson if you don't know him he he works over at Polygon now. He does a lot of videos with uh Griffin McElroy and you could probably he's a sweet boy yeah he uh he has a video series called Car Boys uh with Griffin along with a",
            "start": 1072.36
        },
        {
            "text": "he he works over at Polygon now he does a lot of videos with uh Griffin McElroy and you could probably he's a sweet boy yeah he' uh he has a video series called Car Boys uh with Griffin along with a short-form podcast called Cool Games Inc with Griffin McElroy huge fan huge fan of these dudes I've loved them for a very long time and this is just something special so so he I've met him many times uh he's a very very cool dude uh but he put this video up yesterday on the the internet without context just no caption for the tweet just put it out let's watch the whole thing the whole **** thing it's honestly you seen it yeah I've seen it's fantastic pretty Buckle in okay no audio though big deal think again hold on hold on ignore this a Chapel Hill teen has won bragging rights in the snack world as the owner of what could be the largest Cheeto on Earth WBTV is Rick Swier sat down with the team to check out his eBay bargain yeah 15-year-old Nick Robinson is your average teenager he's into",
            "start": 1125.72
        },
        {
            "text": "as the owner of what could be the largest Cheeto on Earth, was Rick Schwartz sat down with the team to check out his eBay bargain yeah 15-year-old Nick Robinson is your average teenager he's into computers music video games and Cheetos big Cheetos not to eat but to collect all to eBay I saw it in a message board on the internet someone said look at this is the world's largest Cheeto and I checked it out and I expect you know like these strange items typically do to get it into like the hundreds of dollars and I just bid like as a joke for fun like three bucks on it and apparently this is an option that never took off nobody really noticed it so I accidentally won this auction if you don't think a big Cheeto is a big deal think again this is your average not too impressive once you put it next to Nick's big F forget everything you know about Cheetos eBay acquisition in fact the rising Northwood High School sophomore says he loves collecting video game promo pieces from the auction site",
            "start": 1173.52
        },
        {
            "text": "to Nick's big F forget everything you know about Cheetos eBay acquisition in fact the rising Northwood High School sophomore says he loves collecting video game promo pieces from the auction site Nick's father who's also Nick says the size is impressive the thing that impressed me first was the mass of it you know how much it weighs that is a big old heavy cheetah Nick says he only paid about six bucks for the Nugget including shipping he says he hasn't decided what to do with the orange mound of goodness yet but he says whatever he does it'll probably be cheesy Rick Seger w22 new 10 holy in **** like that's real that is a real thing that happened how old do you think that news clip is super old I mean he's probably around my age now so that looks like it was in maybe his last year middle school fat ass compact prario **** monitor yeah Cid Packer God think he still has it no God no no that the Cheeto I doubt it I doubt it but I just love that he just out of nowhere put it up and like",
            "start": 1220.92
        },
        {
            "text": "SCH fat ass compact prario monitor yeah Cid Packer God think he still has it no God no no that the Cheeto I doubt it I doubt it but I just love that he just out of nowhere put it up and like Cheeto says kind of his thing you know so the fact that he has this it's like this is just too perfect I'll tell you that news channel though I mean they're getting they're getting the dirt so that's like not local news but that was I mean he's he's from around here I think that's oh you're saying it's not local no I'm pretty sure that's where he was from back in the day which I think is around here well I mean I'm sure it's like Fresno or some **** something like that I don't know but man I could have sworn it was from North Carolina I think maybe maybe I'm wrong we got to get him on the Greg show get to the bottom of this I I need to know like what did he do with it was it cheesy some great investigative journalism guys holy **** incredible hey I couldn't believe it because that is it's",
            "start": 1273.72
        },
        {
            "text": "get to the bottom of this, I need to know, like what did he do with it, was it cheesy, some great investigative journalism guys, holy ****, incredible, hey I couldn't believe it because that is it's too too funny, that's such a great video though really damn, is all right getting back to the news, I guess the next story that was the most important news of the day though it definitely was everything else is just kind of a you can just what are your thought what are your thoughts on Cheetos Andy oh man give me a hot Cheeto uh **** give teach a man a hot Cheeto he'll to learn a to learn a snack you know what I'm saying so I love snacks way too much um it's my vice definitely the push are I remember hearing you say you don't really you're not really into snacking I'm not a snacker now god dude I envy you cuz I'm like I feel like my health would be so much better if I was not into snacking and I feel like I'd go to my friend's house back in the day back when I was a little boy yeah still",
            "start": 1316.24
        },
        {
            "text": "I envy you cuz I'm like I feel like my health would be so much better if I was not into snacking and I feel like I'd go to my friend's house back in the day back when I was a little boy yeah still a little boy and the pantry was full of Hot Cheetos right full of Hot Cheetos, Funyuns all sorts of all sorts of great snacks from Mr. Chester Cheetah and and I would just look at my friend and be like how have you not eaten all of this because I I'm I have no sense of moderation like it's just it's all or nothing for me and whenever my parents would buy any sort of bag of chips, barbecue Lays or anything like that it's like I'm going to eat that today mhm and I'm not going to let it go I'm not going to let it last until tomorrow and I love snacks dude Flamin' Hot Cheetos are my **** so you you're a fan of the hot you like that oh yeah 100% give me that spice little spicy boy how do you feel with the Double-Flaming Hot",
            "start": 1361.72
        },
        {
            "text": "Goldfish crackers Flamin' Hot Fries are my favorite, so you're a fan of the hot stuff, you like that? Oh yeah, 100% give me that spice, little spicy boy. How do you feel with the double Hot Flaming Hot Cheetos? You know what I've never had those, really, only because I feel like we can change this. I'm getting all, oh me too, dude, me too. Hot Cheetos man, there's hot Cheetos are great. So the reason why my teeth are probably really messed up and in really bad health is um, hot Cheetos pour some of that twang in there. I know the U lemon lime salt beer salt is this not a thing? That's not a thing here. Jesus Christ is that the stuff that you brought with you? No, that's a tahini or I forgot the other one, sure is um so twang is like what you buy like a Doritos and you put beer salt in it which is like lemon lime salt. This is not a thing. Oh my God okay well it's totally radical and so you get like hot Cheetos you get like hot Cheetos and you pour a bunch of this lemon lime salt into the hot Cheeto",
            "start": 1416.92
        },
        {
            "text": "lemon lime salt this is not a thing oh my God okay well it's **radical** and so you get like hot Cheetos you get like hot Cheetos and you pour a bunch of this lemon lime salt into the hot Cheeto bag and you just **eat that** Mountain Dew so acidic you're acidic not acidic two different things I you fit in with us so well this is like we're going to take over like Greg Miller and Nick Scarpino they don't know what the **** they're about to get into right now man they're just going to come here like one day on the morning show Andy and I have talked about this cuz she's a big a big hot Cheeto fan I don't know when we're going to do it we need to make sure it's the right time we just want to order an insane amount of Hot Cheetos and have them just show up during the morning show I'm oh my God I don't think that would be as funny as you think it is why I mean why is that funny I mean does it have to be funny it's just it's a gift for us celebrate your life Kev I just want",
            "start": 1465.12
        },
        {
            "text": "I'm oh my God, I don't think that would be as funny as you think it is. Why I mean why is that funny? I mean does it have to be funny? It's just it's a gift for us to celebrate your life, Kev. I just want this whole thing to be covered in Hot Cheetos so that maybe Chester himself will see it and be like we should sponsor the Kinda Funny Morning Show; he's got money to do it. Why don't you just hit up Chester and be like hey what's up? I don't have his number, man. That's he's on Snapchat though. I mean if you're verified, you can tweet at him and he'll see your verification. You're verified so he'll see it; he'll see the verification. I'm not verified on Snapchat. Wait does he does he have a Twitter? Does Mr. Chester Cheeto have a Twitter? No, Chester Bennington from Linkin Park is he still their spokesman? Cuz I remember they did a couple commercials. Don't ask stupid questions; he didn't sell the company off cuz of some like scandal. He's still...",
            "start": 1511.36
        },
        {
            "text": "from Lincoln Park is he still their spokesman cuz I remember they did a couple commercials don't ask stupid questions he didn't sell the company off cuz of some like **** Scandal he's still the owner he's still a face yeah Kev can you uh Google Chester Cheetah dangerously cheesy when I was little I used to love this dude like I the commercials I mean I still love him they just got me going what the **** what what is that what this what we're talking about it's an interesting pin tweet yeah let's look at the pin tweet real quick what's going on here I mean yeah I mean yeah oh oh oh you know what oh this has got to be an April Fool thing ited March 31st but it's March 31st though like I mean you got to lead into it it'ser the long that's pretty funny that's pretty funny that's so weird Chester's kind of creepy though **** yeah go down a bit Kev like really if I have a daughter I will not let her alone in the room with chester yeah look at him look at him there look at that one his",
            "start": 1550.16
        },
        {
            "text": "kind of creepy though **** yeah go down a bit Kev like really if I have a daughter I will not let her alone in the room with Chester Bennington yeah look at him look at him there look at that one his arms what's he doing there like poorly rendered and like like the hair doesn't look right it looks it seriously looks like they gave that job to the person who's like uh who just started at the company in the graphic design Department well it's funny cuz all of it except for the finger is an image yeah you're right is it a 3D model uh we need to get that 3D model and then the reflection on the table cuz like they thought I had they like for Kinda Funny Live three get that 3D model and do the Hologram like Tupac oh **** but Chester will be hanging out with us damn that's oh yeah they need to invest in a better something they're not they're trying to be Arby's they're not Arby's **** kills it man they're so damn good I'll never forget like seeing Arby's do a Ruben tweet yeah was so",
            "start": 1602.12
        },
        {
            "text": "to invest in a better something they're not they're trying to be Arby's they're not Arby's **** kills it man they're so damn good I'll never forget like seeing Arby's do a Rubik's tweet yeah was so **** cool and I don't even work on the show I just like worked in the same building as all the animators working on Rubik's that **** was so **** cool man **** Arby's man that's great what what is your favorite video game of all time like if they could um HD remaster any classic from the 16bit era what would it be Cool Spot, cool spot. So going off of that first off we need to do let's play a Cool Spot okay we me and Nick did one back in the day I'll do a speedrun but I feel like we really can you no we should do it try to do a Cool Spot speed go for the go for the world record um all right try to make this jump this has to be frame perfect uh got it claps in the AGDQ I love AGDQ serious time serious time um I wonder if there was a Chester Cheetah game back then because I I never played one",
            "start": 1648.92
        },
        {
            "text": "to make this jump this has to be frame perfect uh got it claps in the AGDQ I love AGDQ serious time serious time um I wonder if there was a Chester Cheetah game back then because I I never played one but I feel like that would have been a thing I always created Pokemon when I was a kid and I always created cheetah themed Pokemon really yeah that's just a little tidbit about me holy **** a game called Chester Cheetah Too Cool to Fool holy **** on can you Kev December 1992 were you born yet uh 1989 1989 that's right was my birthday I'm a year older than you that's right oh you're only one year older than me okay okay M MH I always forget so wait are you 30 yet no no oh **** when's your 30th birthday uh I turned 29 in February oh okay cool so we got some time we got some time we got to blow out your 30th birthday yeah we're going to go hard man blow jobs all around guys yeah blow jobs everyone look he's he's on his he on his way to hip City too cool to fool oh **** I want to see",
            "start": 1697.88
        },
        {
            "text": "blow out your 30th birthday, yeah, we're going to go hard man blow jobs all around guys, yeah, blow jobs everyone. Look, he's on his way to Hip City too cool to fool. Oh **** I want to see some gameplay Kev is he out of his way of Hip City? He's entering Hip City okay what's the lore on this like what's the background story? I don't know but we're going to need to investigate for Wild Wild Quest oh that's another game Jesus oh my God that's another game Chester Cheetah, he's out there, he's out there go on YouTube Kev. Oh yeah this is Chester Cheetah not Cheeto yeah you dumbass no it's just Test Drive Cheetah. Oh I thought it was Cheeto no oh **** all right well hell's Keno they probably haven't done much in since 1993 hell yeah dude Wild Quest First Impressions, I really I'm anxious to hear This Guy's first impressions of the game oh okay here we go he's on his way to Hip City oh we getting our lore fast forward to gameplay talk about yeah just speed up a little bit we'll see what happens.",
            "start": 1751.8
        },
        {
            "text": "This Guy's first impressions of the game, okay, here we go, he's on his way to hit City, oh, we're getting our lore fast forward to gameplay, talk about yeah just speed up a little bit, we'll see what happens, still going, oh look at that Overworld map, okay, hell yeah, that's a cool map, this is an interesting choice here, he goes down to Alaska, okay, well in the Chester Cheetah world it's different, Kevin, damn, he's got some major ups, dude, damn, look at them animations though, dude, he broke up into like Cheeto puffs, yeah, okay, so why the **** is Sonic a hedgehog fast but Chester Cheetah is not fast, he's super slow and kind of floaty, oh man this, but he's a **** cheetah, damn, look at his face though, dude, his head is massive, his face has some girth, head is he looks like he got stung by several bees in the mouth, his face is so bloated, oh man, you think it's full of Cheetos, you I wonder if there's like a power-up where you eat hot Cheetos and then spit fire, you gotta retroactively go back in time and",
            "start": 1808.52
        },
        {
            "text": "his face is so bloated oh man you think it's full of Cheetos you I wonder if there's like a power up where you eat hot Cheetos and then spit fire you got to retroactively go back in time and tell them about that yeah man we got some good ideas there's a lot he oh he's he's so fast what there's a lot going on in the HUD too God dang too much get that yeah hell yeah jump up there dude nice power up all right all right let's move on from this hold on a second I don't want to wall hang take it easy watch out Nathan drink he wall he wall hangs dude look at that wall hang so sick you know what I think we should invent a new type of internet video where we just commentate on Let's Play videos commentate over there commentating yeah okay that could be the new hotness that could be because we don't even need to play whoa this is the best part you just let's watch Let's Plays all right we're doing great job today Kevin great job great job this episode is brought to you by",
            "start": 1860.32
        },
        {
            "text": "Could be because we don't even need to play whoa this best part you just let's watch Let's Plays all right we're doing great job today Kevin, great job, great job. This episode is brought to you by The Black Tux. I don't know if you saw yesterday, Andy, I was looking good, you sure did. I had my little plaid suit on, it was like you sure did. If you're trying to look great for a wedding or special event, it's never been easier than with theblacktux.com, with high-quality rental suits and tuxedos delivered to your doorstep. The Black Tux is giving guys a new way to rent, and get this, The Black Tux offers free home try-on, so you can see the fit and feel the quality of your suit months before your events. The best part is it's completely done online, no trips to the tuxedo shop required. I hate going to the tuxedo shop, you know. If I had one thing that just irks me, it's going to the tuxedo shop. What about Home Depot? I hate Home Depot. So let me know when I can jump in and talk about why I'm excited.",
            "start": 1914.96
        },
        {
            "text": "Tux Shop, you know if I had one thing that just irks me it's going to the Tux Shop what about Home Depot? I hate, I hate Home Depot. So let me know when I can jump in and talk about why I'm excited about this right now because I didn't know that they existed, black Tux yeah until like you know I started watching the show or whatever well I didn't you know until you all started uh advertising for it I did not know that they existed. Mhm and I'm so excited about it and I know it's going to sound like I'm like trying to push their product I've never tried them before but I haven't been to a wedding since I was like since my brother's wedding which is like almost over 10 years ago probably I was like 17 or 18 and I am so excited that this exists cuz I hated that process of having to go to the tux place. I have four weddings to go to this year, four, I I haven't been to four in my life probably yeah and so I have four to go to this year because all my friends are my age and settling down.",
            "start": 1958.48
        },
        {
            "text": "tux place I have four weddings to go to this year four I I haven't been a groomsman in my life probably yeah and so I have four to go to this year because all my friends are my age and settling down and getting married and I'm just alone guys I'm just alone uh but we're yeah I'm super excited to try them out uh and it seems like a pretty easy process it totally worked they send in this little box and you open up the box and it you get the bow tie they even have it pre-tied so I don't need to do anything and uh anyway it lets you create your look or choose from tons of stylist selected outfits starting at just $95 after ordering your suit will arrive 14 days before your event so you have time to see if it fits right and like you can send them pictures and you know figure all that stuff out there's a full two weeks to try it on make sure everything fits you can get $20 off your order visit The Black Tux at thebl.com funny so Andy you're going to need to use thebl.com for $20 off",
            "start": 2001.28
        },
        {
            "text": "a full two weeks to try it on make sure everything fits you can get $20 off your Proactiv visit TheBl.com funny so Andy you're going to need to use thisblackx.com TheBl.com slf funny for $20 off your purchase all right hell yeah excited mhm all right story time this is from IGN Alex Gillis writes Pokémon Go has hit 65 million monthly active users that's still insane that doesn't make any sense W no way that shit's crazy so you know what blows my mind I went down to Microsoft uh like a month ago and everyone there I was with maybe like five people we're walking down the street going to lunch I'm like why what the hell is everyone doing and all of a sudden someone goes running off and and like oh there's a a Gyarados I'm like the **** a Gyarados the **** gen two it's some Gen 2 **** you got gen two in that **** yeah yeah they have like 80 or 90 from gen I might be wrong Gyarados Gore might be gen 3 I might just be talking out of my ass it was one of the ones from Gen 2 like I I I",
            "start": 2039.8
        },
        {
            "text": "you got gen two in that **** yeah yeah they have like 80 or 90 from gen I might be wrong Gore Gore might be gen 3 I might just be talking out of my ass it was one of the ones from Gen 2 like I I I didn't remember the name right and like she just goes run it off and I'm like is she playing Pokémon Go and the other guy's like yeah hey I'll be right back and he just runs off I'm like what but yeah know it's still going on developer Niantic Labs revealed the new milestone in celebration of the hit mobile game's achievement since its 2016 release including its recent British Academy Games Award it's a BAFTA for best mobile game later in the post Niantic also hinted at quote a lot more to come for Pokémon Go including all new Cooperative social gameplay experiences in Pokémon Go that will give trainers new and exciting reasons to get back into the sunshine it's a real Sunshine yeah my so when I was working at Rush Teeth uh my the producer on the games team Brian Riley who I hope is watching",
            "start": 2096.8
        },
        {
            "text": "trainers new and exciting reasons to get back into the sunshine it's a real Sunshine yeah my so when I was working at Ruseed uh my the producer on the games team Brian Riley who I hope is watching right now and if not I'm not your friend anymore I'm your friend Brian you've always been a very nice like you know I would just be sitting there and boy boy I would be I would be sitting there and we'd all be working I wouldn't be working I didn't do **** there we'd all be working and then I would just hear like the sound effect and he'd be like oh boy cuz he never expected the volume to be on and he he **** played the **** out of Pokémon Go and he was super stoked because the new building that we moved to is a PokéStop cuz the games and animation team moved uh and he'd be like I found a found an Eevee or whatever yeah so he'd go he'd go catch it youd go catch that **** and it was man you're still playing that yeah I love that I just looked at your phone and you had Digimon",
            "start": 2140.64
        },
        {
            "text": "a found an Agumon or whatever yeah so he'd go he'd go catch it you'd go catch that **** and it was man you're still playing that yeah I love that I just looked at your phone and you had the Digimon Wikipedia well I had to I had to make a joke Tim I had to I like what's what's AIM I just love pulling the Cur what's a digimon Agumon Agumon **** AUM **** Greymon that's the one that I just thought of that's another one yeah Digimon's so good just pulling the fourth wall I mean not like when compared to Pokémon don't even start Pokémon do not even start anyway speaking of of that cuz we're about to get into some anime talk here uh Pokémon there's some Pokémon news this is spoilers a little bit for the Pokémon anime that's still going on um from the the latest season about sun and moon there was a depressing as hell episode oh boy where like when Ash died uh I mean dude this sounds like some this sounds like some real real real **** can scroll down a bit",
            "start": 2187.6
        },
        {
            "text": "season about sun and moon there was a depressing as hell episode oh boy where like when Ash died uh I mean dude this sounds like some this sounds like some real real real **** can scroll down a bit more like awful child abuse or what's going on I mean so there's this one's Linton and then there's the the um Yorkie that turns into this giant Yorkie and I forgot what his name is starts with the N um I feel like this is going the route where fr's dog dies on that is the name of this dude that was awesome anyway L the cat is friends with with Stoltenborg the Yorkie and Stoltenborg kind of gets sick and then Stoltenborg dies oh my God Stoltenborg straight up dies what just just keep scrolling down you was the Poke Center too far the Poke they got him to the Poke Center and they said he's going to be okay and then he they they lied did he have cancer or what I don't know I just don't understand but it's really sad he's in heaven right there yeah look you keep going down Kev I don't want him look",
            "start": 2239.84
        },
        {
            "text": "okay and then he they they lied did he have cancer or what I don't know I just don't understand but it's really sad he's in heaven right there yeah look you keep going down Kev I don't want him look how sad that is who look we don't see that colors in Pokémon yeah this is super somber which sounds like a Pokémon oh man yeah that color scheme is so dark and sad like is that a screenshot from Inside or what keep going down Kev no can we just move no I like keep going down keep going down then he look he looks up the cat looks up in the sky and sees him up there he sees him yo I would be crying like a baby I cry for everything to right no oh my God so I'm just so sad about this oh God but I can't believe they they went there you know especially cuz I he this season's hella happy too so it's like came out of nowhere it's just like but hey you know what he's happy though he knows his friends in a in a poor Lon poor Lon I always wonder now there's a lot of fans",
            "start": 2291.4
        },
        {
            "text": "\"Hella happy too, so it's like came out of nowhere. It's just like, but hey, you know what? He's happy though. He knows his friends in a poor Lon... poor Lon. I always wonder now there's a lot of fan art of them here was my thing. What do you if there are multiple Litton mhm? Are like, do they all go by the name Liton mhm? Okay, but I have a Litton and you have a Litton. Do we call our Littens Litton or do is your... do you name yours something else? Like if we were in the world, I have a mom and you have a mom, and we both called it a mom. Oh **** that was really good. Holy **** really good. Yeah, this is some games journalism right here. This is real games journalism. Speaking of games journalism and sad Pokémon moments, it reminded me that I made a video on IGN called the six saddest Pokémon moments, and the clicks guys, the number one saddest moment was... how fat I am now compared to what I was about to say skin. Oh look at that little boy, little shirt. Look at that fresh boy. Oh I still\"",
            "start": 2346.24
        },
        {
            "text": "and the clicks guys the number the number one saddest moment was how fat I am now compared to what I was about to say skin oh look at that little boy, little shirt, look at that fresh boy, oh I still have that shirt, I don't look like that in it anymore was I there when you filmed this is this the one time we stayed hella late no no this is one of the one of the first ones hey I'm very proud of this video so Kev can you put it in the chat uh no dude put maybe at the end of the show I'm already getting sad just seeing this  I can't even handle it those those lower thirds are exactly the same ones we have now right well you know if you notice the music in this is is essentially whatever I'm not even State Farm oh it was Alexis let's get Lexi's voice sounds familiar this sounds familiar I've used this in many videos all right all right let's see what else do we got look how big I'm I have a lot of hand motions blah blah blah blah look how healthy you looked you look like the",
            "start": 2396.32
        },
        {
            "text": "I've used this in many videos all right all right let's see what else do we got look how big I'm I have a lot of hand motions blah blah blah blah look how healthy you looked you look like the **** what are those guys in Pokémon Sun and Moon oh the Skull Gang yeah sry not skull gang Team Skull team skull yeah oh man you know what let's read some tips do you hear my belly rumbling no there's a rumbling in my belly boys I was asking you this yesterday how does it feel to get the full Kinda Funny experience when you see the morning show you hear us talk about where we're going to lunch and then you go with us to lunch yeah that was great that was great so we went to Curry Up Now yesterday yeah we did went to Curry up now uh how was the water H the water was pretty good yeah it was it was pretty good yeah so we got um everybody else got that **** burrito the curry burrito I didn't get that **** cuz I was worried I wouldn't like it right so I got the wings but then I had a little",
            "start": 2439.84
        },
        {
            "text": "pretty good yeah so we got um everybody else got that **** burrito the curry burrito I didn't get that **** cuz I was worried I wouldn't like it right so I got the wings but then I had a little bite of Kevin's burrito bitten to Kevin's burrito so thick it like exploded in my mouth I kind of had some in my hair what did you say thick ass burrito so I ate that and then I went to and then I ended up getting the wings loved them and then Tim was like you know what we do after this sometimes when Nick isn't around cuz Nick is Mr Healthy boy we go get we go to cream which is cookies rule rule everything around me cream and you get some ice cream put some cookies around it like a ice cream sandwich of cookies ice cream sandwich got that macadamia nut cookie mhm with some chocolate chip cookie dough ice cream in the middle and I was like I looked at Tim there was a moment where we're walking down and it's kind of drizzling MH and I went to a very dark place and I was sad about what I had",
            "start": 2485.64
        },
        {
            "text": "dough ice cream in the middle and I was like I looked at Tim Gettys there was a moment where we're walking down and it's kind of drizzling MH and I went to a very dark place and I was sad about what I had just done I looked at Tim Gettys I said we this cannot become a habit we cannot do this all the time yeah because I just I don't I don't want to gain weight boys we've we've never done that before while working you know what I mean we've never taken a lunch to Curry Up Now mostly because the other kids are **** but like that's not going to become a habit don't worry about it okay certainly not ending with cream it was a good ending should we do it again today I don't know we'll see what happens we'll see where we're going today I don't know we'll see Kevin already suggested we go to FUD Rucker's which is holy **** which is AC which is across the bay like we would have to cross a bridge traffic there traffic right now right now it would take 20 minutes get we're going to Fun Rockers all right let's",
            "start": 2534.4
        },
        {
            "text": "holy **** which is AC which is across the bay like we would have to cross a bridge traffic there traffic right now right now it would take 20 minutes get we're going to Fun Rockers all right let's go boys are we wait are we really yeah we're going to F-Rockers man I'm so excited you getting the like one pound or the two lb I get like the third PB & 2B there's no 2B yeah they just get two one PB burgers together well I mean I guess technically the math does make sense all right where the hell are we I'm so hungry oh my God want to just end this **** early no no it's fine I'm just saying we can you're reading tips or some **** we got a tip from I hear cool Greg giggling over there R/S love R/S says long time first time just pay my birthday tax I'm having a party with lots of people in a couple days oh wait where already you read this one yesterday oh I'm reading yesterday's tips dumb ass I'm a dumb dumb oh there we go go now we're getting some Friday stuff Friday I do damage says",
            "start": 2578.92
        },
        {
            "text": "a couple days oh wait where already you read this one yesterday oh I'm reading yesterday's tips dumb ass I'm a dumb dumb oh there we go go now we're getting some Friday stuff Friday I do damage says in the chat GameOverGreggy and Nick are out the boys will play yeah I couldn't think of cat my SCH have fun hard at work Matt thanks to y'all my coworker and I have finally made our own podcast recorded at work during lunch it's the Hard At Work Podcast tipping early in case I miss you guys live check it out Hard At Work dude that's bad ass that's a good name they record it at lunch damn that's **** that's a great idea good for you guys that's efficient that is yeah eff we should do a podcast during work I I don't Kevin wants me to stream myself working on design honestly I love watching you make art cuz you're just sitting there like a God damn wizard just clicking **** and knowing what all the buttons do yeah and he's working on our Kinda Funny Live three designs right now for t-shirts and",
            "start": 2628.64
        },
        {
            "text": "cuz you're just sitting there like a God damn wizard just clicking **** and knowing what all the buttons do yeah and he's working on our Kinda Funny Live three designs right now for t-shirts and the one I have in the works I'm It's Hot Boys is it hot it's a it's a hot design I'm excited about it didn't look that great yesterday though oh yeah I was experimenting with some stuff I was like here's keev Kevin check this out this is what I want to do and I did the thing and I was like doesn't look as great as I saw it in my head but that's what the process is about you go out there you try to get better every day 110% you're first in the gym you're the last to leave uh's what's your thing with the gym and the last to leave this is the second time I've heard you say in the last two days it's just cliches you go out there you get better every day it's part of the process you know you want to you know you got to leave out the outside noise and just we can control what's inside of this",
            "start": 2679.64
        },
        {
            "text": "It's just clichés. You go out there, you get better every day. It's part of the process. You know, you want to, you know, you got to leave out the outside noise and just we can control what's inside of this locker room. Oh, that's how music's made. You take noise and you give it purpose. Sure, the process. Sure, I don't think that's accurate. The next tip, I don't know if I like the tip or the username better. Pop that baby maker H tips us and he says, \"How do you catch a bra with a booby trap?\" Oh hey, like that one, like that one... Yeah dude, I'm going to use that one. Is that going to be a new PiL? That's my Tinder uh profile. Um Eric JP tip says, \"How to leave a tip for Andy's first Kinda Funny Morning Show appearance.\" It's cool to hear that he's from South Texas. I have family in Alice, Kingsville, and Corpus Christi. Nice. It's really good to see you on the show. You pass by all of those cities on the way to Austin whenever I would drive back and forth to go visit my papa and my mama. Q Holtz tips and says Quinton.",
            "start": 2718.96
        },
        {
            "text": "Nice, it's really good to see you on show. You pass by all of those cities on the way to Austin whenever I would drive back and forth to go visit my mom and dad, Quinton Holtz tips and says. Quinton Holtz tips and says Chairball Champion 2017 never forget Andy. We almost missed you at the office; it's not the same around here. So we had a good chair ball tournament. Uh, Quinton's been the will the villain for a while in the office chairball. Chairball is a little sport that we created at Rusty Teeth Games, I'm the co-founder along with Brian Riley. You toss a ball out of a chair; it bounces once and you have to land the ball in the chair, of course. The chair has a little bit of curvature so if it sits in there, three points; if it taps the chair, one point. We had a big tournament on my final day; Quinton won. Uh, but I'm protesting to win 'cause I yeah, I want to review it and I want the uh Commissioners to see",
            "start": 2766.56
        },
        {
            "text": "\"Point we had a big tournament on my final day Quentin won, uh, but I'm I'm going to protest to win 'cause I yeah I want I want to review it and I want the uh the Commissioners to see what happened exactly to make sure he doesn't win. The RT life is actually going to be coming out pretty soon, I think maybe in the next couple weeks or so, uh, but um we're going to try to strip away that title from him because I think he was using performance-enhancing drugs. So got it okay yeah I mean there were some strong senses of Adderall on his breath yeah yeah can you smell Adderall? I think I did triple 87. Uh-oh, says my girlfriend Gina kissed Andy on stage in high school, not sure if that's my fault.\"",
            "start": 2814.6
        },
        {
            "text": "my girlfriend Gina kissed Andy onina o Gina that's that's I think that's my fault that you say in China remember oh yeah my girlfriend Gina kissed Andy on stage in high school not sure if jealous of him or her shout out to the # RGV RGV real Grand Valley 956 and the RGV we don't play no games boys that's too long so that's like a radio thing so um there's a good video that we got to check out really soon and it's a rap video made by a group back at home called the fallen angels and it's called in the RG I don't know what it's called but the chorus is in the RGV we don't play no games we don't play no games in the RGV we don't play no games it's really really good check it out on YouTube Follow Angel like comment and subscribe it's a great video man it's a great video king franchise 88 says here's to Andy's first time hosting the morning show and to many more to come love you guy # the Andy Cortez from kind of funny yeah Mario not bro says what's up guys man Callin sh has changed a lot",
            "start": 2859.52
        },
        {
            "text": "Here's to Andy's first time hosting the morning show, and to many more to come. Love you guys! The Andy Cortez from Kinda Funny, yeah Mario not Bro says what's up guys, man. Calling shenanigans has changed a lot since he... his hair's great now; he wears bomber jackets. It's like a whole different person, anyway. Bongo's but hole this table for four sometimes five... Yeah, thank you, Mario! Love you, man! Thanks for the words, dude. Alex A says Andy: when can we get a 30-second review of Post-Nerf for Locos? One of the greatest nerdy sayings of all time! This is back to PAX South 2016, okay? Right before I got hired at... at... Razer Teeth, and um, we were talking about like old alcoholic drinks that don't really exist anymore. And Alex Aiz mentioned: \"Man, remember, remember how four Locos were before they nerfed them?\" And I was like, \"God, we're losers, dude! We are losers!\" Yeah, they nerfed the heck out of them, dude! Absolutely, Dro! That's so funny! My brother; my brother's friends went a little too.",
            "start": 2919.6
        },
        {
            "text": "like God, we're total losers, dude. We are total losers, yeah. They nerfed the crap out of them, dude. Absolutely, bro. That's so funny. My brother, my brother's friends went a little too hard on the Four Loko pre-game, like that was a disaster. Like I remember one time I came home and people died... thankfully none of our people didn't die, but I remember coming home one time and like my brother's room was just it just looked like a colorful Tower of Babel, like it was just a like someone turned the vibrancy up in the room. Oh hell yeah, it was it was a lot to handle. Uh, Zigger tips, Zigger says it's always great to see you, Andy. I'm so happy for you, congrats on the new job. Sent you a welcoming present to the studio that you should be getting later today, a... you guys did we just get it? We just got a package, let's go, let's open that crap. Keep being awesome, see you soon, thank you Zigger, this show's fun, I like, I like, I like this show. That package said Zigger uppercut but if it's a",
            "start": 2967.04
        },
        {
            "text": "it we just got a package let's go let's open that  keep being awesome see you soon thank you Ziger this Show's fun I like I like I like this show that package said Ziger uppercut but if it's a little basketball hoop we don't need it this whole building is just going to turn into little basketball all his life man if you would have told me that like I wouldn't have said no five times to accepting this job yeah yeah if I would have said yes on the first time you to me yeah yeah yeah yeah it was a  process it talk about that some talk about that I that's why I really want to do like a a prop an exclusive like GOG to talk about I get I get questions all the time of like how do you know any advice on getting to the games industry uh what should I do advice what school should I go to this and that and I I feel like I've went through so many  weird turns and stuff to get here at this table um and I would love to explain it and just talk about my story and yeah so I think we",
            "start": 3011.28
        },
        {
            "text": "this and that and I I feel like I've gone through so many weird turns and stuff to get here at this table um and I would love to explain it and just talk about my story and yeah so I think we should do sounds like that would make a great games cast for maybe this month maybe maybe that would be the games cast exclusive for this month that would be fun our man says are we calling everybody boys now because I  love it boys welcome Andy well I've said boys my whole life um I actually my friend Matt uh Cortez also his same last name no relation are you sure he would say you're like a Pokemon he would say boys a lot oh maybe yeah so he would say boys a lot so I started saying it and then my friend Caesar and and Christian we all started saying boys and then it was only Amplified by whenever I would watch Griffin molyneux and and Justin and Nick Robinson stuff on polygon and they say boys all the time and I was like God it's like non-stop just boys just boys all the time having fun",
            "start": 3057.56
        },
        {
            "text": "by whenever I would watch Greg Miller and Colin Moriarty and they say boys all the time and I was like God it's like non-stop just boys just boys all the time having fun taking their clothes off next tip I knew you and Nick would get a lot so well pimping penguin 96 says Andy please tell us a dirty secret about Kevin that no one else knows oh man I like okay I know I know a lot of **** about Kevin I'm not going to say anything though I'm not going to incriminate him you know got one like funny one that CU when he goes to jail who else is going to run the console it's true it's true last tip of the day we're calling the tips wait what what what you calling them yeah I I didn't realize what time it was I think we have three more don't we those aren't tips those are subscribers oh Cray Trey 1310 says congrats Andy on your first Kinda Funny Morning Show glad there's some Cowboys representation on the show now love all you guys keep skating there is one",
            "start": 3104.92
        },
        {
            "text": "are subscribers oh cray Trey 1310 says congrats Andy on your first Kinda Funny Morning Show glad there's some Cowboys representation on the show now love all you guys keep skating there is one more tip we boys dog we didn't boys we D boys phoenix98 says Andy where'd you get that uh Diva shirt little how do you pronounce it is it div yeah okay Co little little independent website called Amazon they're going places they're going places great to see someone Kinda Funny is finally repping Overwatch yeah dog love Overwatch boys and do I use Diva a lot no but I just love her vibe yeah the colors I just **** with Diva so much I Mountain de and all that Kevin she's 19 okay or 20 or something like that don't give me that look we did a whole topic I think on about Overwatch porn yeah Ah that's good stuff I don't watch the show give a **** really all right let's get to the serious business here we're doing the giveaway it's giveaway time Andy did you know that there's four different ways",
            "start": 3155.8
        },
        {
            "text": "good stuff I don't watch the show give a **** really all right let's get to the serious business here we're doing the giveaway it's giveaway time Andy did you know that there's four different ways that people can win a video game that we toss out people every single day maybe what is the first Way by being in this chat yeah what is the second Way by being a subscriber on Twitch which if you're an Amazon Prime subscriber you get a free Twitch Prime account subscription thing every month you need to renew it every here's what I do with my Prime subscription I I switch it around I give it to different people that I love so like I'll give it to Alfredo one month and then I know that my month's running out and I'll give it to mney another month when that runs out I'll give it to whoever else and so I think that's what's really cool about the twitch uh I think I was watching one of y'all shows and it sounded really hard you all were describing it as if it was kind of hard to figure out",
            "start": 3203.24
        },
        {
            "text": "and so I think that's what's really cool about the Twitch uh I think I was watching one of y'all shows and it sounded really hard you all were describing it as if it was kind of hard to figure out how to resubscribe it's super easy you just go to the channel and the Subscribe button up there will tell you hey you've got a free Amazon month to give and then you just just go ahead and do it super easy you know yeah okay cool um so okay so being a subscriber being in the in the chat being a Patreon supporter supporter at the $2 above level $2 or above level on either Patreon patreon.com kindof funny or patreon.com kindof funny games both of which the new episode of GOG and Gamescast is live right now one featuring Andy Cortez and Gamescast featuring Andrew Goldfarb he's a cute boy he's a God the Dark Knight of news The Dark Knight of News himself and the fourth one I don't know the fourth one it was the two Patreon supporters oh okay yeah there you go I was going to say by I don't know never mind you want",
            "start": 3246.64
        },
        {
            "text": "dark KN of news The Dark Knight himself and the fourth one I don't know the fourth one it was the two patreons oh okay yeah there you go I was going to say by I don't know never mind you want to add another way to win maybe why not think about it you know giving me tacos if you give Andy Cortez tacos you're entered to win like if I if my name happens to get picked because I'm in both of those lists whoever gives me a taco will win the prize speaking of tacos this giveaway is brought to you by Blue Apron not all ingredients are created equal fresh high quality ingredients make a real difference so it's important to know where your food comes from for less than $10 per person per meal Blue Apron deliver seasonal recipes along with pre-portioned ingredients to make delicious home-cooked meals so Greg Miller he does his whole cooking with gregy thing you've had Greg's cooking what do you think I haven't had Greg's cooking yeah you have well you a barbecue oh du yeah okay um Nails",
            "start": 3292.16
        },
        {
            "text": "so Greg Miller he does his whole cooking with GameOverGreggy thing you've had GameOverGreggy's cooking what do you think I haven't had GameOverGreggy's cooking yeah you have well you a barbecue oh du yeah okay um Nails he's so good at it he's so good at it and he loves Blue Apron he loves every all the the different food that he gets from any of the ideas for the recipes and all that you can check out this week's menu and get your first three meals for free with free shipping by going to blueapron.com kfms it's a Kinda Funny Morning Show you'll love how good it feels and tastes to create incredible homecooked meals with Blue Apron so don't wait that's blueapron.com kfms what what's going on there I don't know Kevin's not he's Kevin's just he's on something right now he really is man he needs he needs to be stopped today we're giving away Puyo Puyo Tetris on the Nintendo Switch can I have it uh probably not this version but we could probably get I want that one though this one no that's too complicated for",
            "start": 3337.48
        },
        {
            "text": "today we're giving away Puyo Puyo Tetris on the Nintendo switch can I have it uh probably not this version but we could probably get I want that one though this one no that's too complicated for me to figure out uh we are giving it to Archie Crouch from the Kinda Funny Games Patreon account bow R Crouch my  I had a wrap I got the first line there Arch I've never heard that as a name ARA AR maybe it's Arin Crouch my Posh is really bad and I don't want to slouch sit up **** don't use that language show whoa whoa uh I always wanted to be a rapper when I was a kid H me too all about Macklemore and P Diddy and or Puff Daddy back in the day I like I like that you go to Mack yeah that's fun he became a preacher didn't he yeah he did and he got kicked out of Harlem it was the whole thing wait like the city yeah yeah how do you get kicked out of a city I mean not like by the city but by the people in the city like they'll be coming back here Mack and he's like all right wow and then that's why",
            "start": 3380.84
        },
        {
            "text": "the city yeah yeah how do you get kicked out of a city I mean not like by the city but by the people in the city like they'll be coming back here Mace and he's like all right wow and then that's why he had that song Welcome Back where he was trying to welcome himself back but it it doesn't work like that like no you can't come back ma no Mace Mr. Mace please all right Kev yo **** you want I'm gonna I want to skip forward to Orioto I want to send what's up we CL yeah let's close yeah yeah oh Sancho West to uh link the video for Fallen Angels in the RGB we don't play no games watch it after this have a good time send them some love yeah send them some sweet nasty love 956 so that's what we're doing right now we're sending some sweet nasty love uh Kev can you bring up the Orioto yeah sorry I was there we go so Orioto is this amazing artist you are probably familiar with him he does all of the background art for the Kinda Funny Games cast I've been in love with this dude's art for a while",
            "start": 3444.28
        },
        {
            "text": "Was there we go, so Orioto is this amazing artist you are probably familiar with him he does all of the background art for the Kinda Funny Games cast. I've been in love with this dude's art for a bazillion years even before you like started using as the background stuff he was my desktop wallpaper like whenever he put out a new thing, the Legend of Zelda: Link to the Past one, I love that one man, his shit's so good! I love his use of colors, I like, I love his, just the sheer variety of games that he covers. I want to look at the last couple new ones he did, so top left Kev click on it let's show the peeps, I need to update the Gamescast, I never had going to but yeah this is a Horizon Zero Dawn that's so awesome here we have some time... beautiful and then here we got some Skyrim action and then last one I want to show off oh my God that Metal Gear Solid hotness so this shit's so good so good um you can support him just by following him on Twitter and doing all that stuff.\n\nI corrected the following errors:\n\n* \"orioto\" → \"Orioto\" (proper noun, likely a reference to an artist or game developer)\n* \"Kind of Funny Games cast\" → \"Kinda Funny Games cast\" (corrected spelling and capitalization)\n* \"desktop wallpaper like whenever he put out a new thing the the top down Legend of Zelda Link to the Past One love that one man his shit's so good\" → reformatted for clarity, but no changes made to the original text\n* \"sanss\" → \"some\" (corrected spelling error)\n* Added missing capitalization and punctuation throughout the chunk.",
            "start": 3491.56
        },
        {
            "text": "action and then last one I want to show off oh my God that Metal Gear Solid hotness so this shit's so good so good um you can support him just by following him on Twitter and doing all that stuff make sure that everybody tweets at him he a patreon Orioto tweeted him saying you're getting some sweet nasty love from Kinda Funny yeah but he's been amazing for us to use his art in the shows and stuff and I I definitely want to show him as much love as possible but he does have a Patreon so if you want to support him there you can get all of his art early you can get giant 4K wallpaper versions uh you can get chances to get actual prints and stuff he's **** sick so I really want that Metal Gear Solid one so bad so nice man so go check him out send him that love and I also want to send a bit more love to the Pretending I'm a Superman Tony Hawk documentary that they're trying to fund so they're trying to get 75k to make this thing as hot as possible uh they're currently only at about 13k",
            "start": 3542.8
        },
        {
            "text": "more love to the pretending I'm a Superman Tony Hawk documentary that they're trying to fund so they're trying to get 75k to make this thing as hot as possible uh they're currently only at about 13k but that's that's weird I could have sworn it was higher earlier but whatever um no matter how much they get they're still going to make the thing okay this is all about like this just like how much like the goal to do all their dreams is 75k so as much as they get they're going to do it um I definitely just want to send them some love because this is something I want to see I'm supporting I want to see it happen um and they're really good dudes they're really talented so um out tall gamer 47 says send me some love all right tall gamer 47 here's some sweet nasty love here some love man Tim and Andy can I get the one all right that's my love there's your love thanks oh you can switch if you all right we're going to the chat we're going to do the patented three and three let's see the three",
            "start": 3588.12
        },
        {
            "text": "Andy can I get the one all right that's my love there's your love thanks oh you can switch if you all right we're going to the chat we're going to do the patented three and three let's see the three and three can we get like theme music for every like I want to dude I want to have like I was and three three that we talk about Kinda Funny I can't handle another console to press button you can't imagine segment introductions Kevin I believe in you Dude Love why don't we just get someone that sits here and presses those buttons and we just do it like teamwork like all right maybe we could I know you can do it Peru it Peruvian get it why is it always about like nationality with you I just I I appreciate your ethnicity thank you Frogg and bullfish 89 says did Nick and Alexis have an have an illegitimate child 30 years ago named Andy no but I like that um be keer 319 says we need an Andy Cortez hair tutorial oh we certainly do I'll tell you what I do no shut up no we need this to be a cool",
            "start": 3634.04
        },
        {
            "text": "child 30 years ago named Andy no but I like that um be keer 319 says we need an Andy Cortez hair tutorial oh we certainly do I'll tell you what I do no shut up no we need this to be a cool video no we use it we can do a 30 second I put product in my hair at night and Slick it back Slick Black that PS triple that's a reference some of youall will get and then I wake up and I just kind of like do that and hairspray keep it in place dude that's **** genius that is actually way more of a process than I've ever heard you do it the night before oh okay well I mean the process is I put the product and I just slick it back like there's no it takes like how do you get the back to like 40 seconds to like it's well cuz I I probably sleep on that side of my look look how cool it looks I probably just sleep on that side pillow sort of does its own work you look like if you try hard enough you could definitely become a Super Saiyan it's a collaboration between me the nighttime cycle the pillow we",
            "start": 3693.12
        },
        {
            "text": "Sleep on that side pillow sort of does its own work. You look like if you try hard enough, you could definitely become a Super Saiyan. It's a collaboration between me, the nighttime cycle, the pillow - we all work together, man, 100%. Go out there every day, get better; it's part of the process. F690 says Tim: The Rock and Disney are making a Jungle Cruise movie. I know I'm super hyped. What's what's that? The jungle cruise - it's a um Disneyland ride. Oh okay. Have you have you ever been to Disneyland? I've only been to Disney World, okay. I don't know if the jungle cruise is at Disneyland. I was at Disney World when I was uh in middle school, sixth or seventh grade maybe. We got to do a trip to Disneyland. You will appreciate it. I am so down dude. Jungle Cruise is is going to be your favorite ride of all time. You just get on this you get on this little boat and the the captain just makes a bunch of really shitty jokes and like puns and stuff. You love man, it's like... you're going to turn around and turn",
            "start": 3751.76
        },
        {
            "text": "you just get on this you get on this little boat and the captain just makes a bunch of really shitty jokes and like puns and stuff, you love man, it's like is you're going to turn around and turn back and I'm going to be the captain, I know dude my dream is to be that Captain all right uh Resident Evil says can Andy just say boy a few more times for us hey boys there we go I like how you already have your new catchphrase you have so many catchphrases already between boys and G whiz oh can we make that the uh the thumbnail sure oh give him the one look screenshots people screenshots make it less sexual no that's more is it yeah that's way more all right we're going to stop that was too much man all right the kids are going to get all worked up yeah I felt it kind of too I felt a little activity down there you know what I'm saying dead by Don 94 says can you guys start calling yourselves the Bomber Boys with a z i don't I'm kind of into it but that also sounds like terroristic at R",
            "start": 3796.28
        },
        {
            "text": "activity down there you know what I'm saying dead by Don 94 says can you guys start calling yourselves the Bomber Boys with a z i don't I'm kind of into it but that also sounds like terroristic at R teeth I was one part of the Naughty Boys and it was me Cole Gallion and Patrick Matthews U so send some love to those Naughty Boys over there I miss my Naughty Boys shout out to Cole Cole Cole's been there since not day one of Rooster Teeth uh and like he's he's a good dude I when I first started going to Rooster Teeth uh and like hanging out there uh he was an intern and he was such a sweet boy he's a great little boy man I love I don't like the little that freaks me out a little a bit too much this little thing that I did like everything that we would do basketball stunt shots right at the old Studio that the old version of Rooster Teeth and every good shot was a cute boy yeah so like you throw it and it looked like it was going in like oh man that was a cute boy the Boy",
            "start": 3851.08
        },
        {
            "text": "at the old studio that the old version of R-Type and every good shot was a cute boy yeah so like you throw it and it looked like it was going in like oh man that was a cute boy the Boyz has Legacy I've always tried to refer to us as the Kinda Funny Boys so I think this meshes so well with that plan I think it does things mesh things mesh see but here's the thing Admiral Christopher don't steal the boys from me yeah that's like that's the thing that kind of sucks about all this like they've cemented that as their thing like they they've done the boy stuff for a very long time and uh and I've and I've been doing the boy thing for I think before them but I was not on videos and it's just something my friends and I would do together yeah so I'll give them the credit though they're definitely you know I don't know it's like how Steve Jobs stole Xerox's plans for the UI of a computer like you know they weren't I don't feel like they were The Originators but they made it better",
            "start": 3897.08
        },
        {
            "text": "definitely you know I don't know it's like how Steve Jobs stole Xerox's plans for the UI of a computer like you know they weren't The Originators but they made it better than anybody else and so I don't know I'm just supporting them I love those going to shove that **** straight up it better no no no get sub only chat we going to make it better no we're not we're getting a sub only chat little bit random says the main question is how does Andy Cortez feel about Funimation Clips what side of this war are you on I'm on the side of Funimation Clips **** yeah you are I like fun yeah you do how you feel about Chips with the Z if it were Funyuns like snacks I'd be into it snack boys I'm so hungry dude oh man God how good is Fudruckers going to be I got a little rumbling in my belly and I cannot wait to stuff sh I am so excited I want that **** meat in my mouth Kevin yeah I know what are you going to get just a thick ass honk of meat just just slap my face with it man so",
            "start": 3946.48
        },
        {
            "text": "belly and I cannot wait to stuff this I am so excited I want that good meat in my mouth Kevin yeah I know what are you going to get just a thick ass hunk of meat just slap my face with it man so hungry so here's the question I know this is crazy it's probably not a good idea should we get hot Cheetos bring them to Fuddruckers and put hot Cheetos on everything yes you're smart Alex Z says this morning show looks like a deleted scene from Malibu's Most Wanted Alex is an easy piece of work let's go to Taco Deli tomorrow yeah we'll go for I used to go to Taco Deli like three times a week with Alex way too much yeah Taco Deli is the best Torreys is you go to Austin and have a gimmicky ass Taco it's like oh we put weird french fries in our Taco we're crazy like you put hot Cheetos on that",
            "start": 3993.2
        },
        {
            "text": "I love Torch is so overrated. Torches is, you go to Austin and have a gimmicky ass taco it's like oh we put hot Cheetos in our taco we're crazy like you just go to the Taco Deli is where it's at boys yeah I've never been in Torchy's the son of a gun won't take me they always like oh it's too far is there a Torchy's here no. Greywind 64 says Andy's like the perfect cross between Tim and Nick I can feel that like the genetically enhanced perfect version yeah Torches is so overrated it says jav 93 PR yep way to overrate it says Cray Trey hell yeah you guys are Cray Trey Mitchell I met him at uh I met Trey Mitchell the first day that I met you kids no way yeah RTX 2015 wow we were waiting at uh Easy Tiger oh my God yeah The Pretzel Place wow was that the first time we met that's the first time you and I met yeah holy crap there's so much footage of that day I wonder if we're in the background I wonder if",
            "start": 4042.52
        },
        {
            "text": "my God yeah the Pretzel Place wow was that the first time we met that's the first time you and I met yeah holy **** there's so much footage of that day I wonder if we in the background I wonder if I can the moment I met you that might be on camera oh yeah absolutely that' be pretty cool yeah that's when I met all of you guys yeah crazy here you are excited dude here I am so good here I am just you know letting my letting my liquid go all over this office man all right so we are going to read all of the subs and reubs thank you very much for joining us today on this beautiful Friday what is Andy Cortez's favorite video game of all time asks Yanks in Portland that's tough that's tough spot um cool spot yeah cool spots up there it's in the it's in the top three uh favorite game of all time it's always a battle for me between Metal Gear Solid and Mass Effect 2 it's always a battle between those two yeah that's a good battle yeah um oh actually before we we read the subs uh tomorrow is the last",
            "start": 4094.24
        },
        {
            "text": "a battle between Metal Gear Solid and Mass Effect 2 it's always a battle between those two yeah that's a good battle yeah um oh actually before we read the subs uh tomorrow is the last day of the Rooster Teeth 14th anniversary sale you can check it out over here Kevin says today is uh why are you pointing it's the other way you're pointing the wrong way there it is yep yeah anyway 14% off everything on the store at Kinda Funny.com/store check that out we should really buy these pillows it's going to be a good time the pillows are so cool have you seen one in real life no I haven't oh really no yeah I know oh they're they're awesome they're really cool they're dope as I remember snapping a photo to Kevin mhm when I first saw I was so upset I was like damn yeah that's back when uh when I still worked there I missed those guys and they fired you we had to take you up cap K08 subscribed for 28 months what was that I how to read cap yeah let me read them yeah yeah",
            "start": 4143.4
        },
        {
            "text": "when uh when I still worked there I missed those guys and they fired you we had to take you up cap K08 subscribed for 28 months what was that I how to read cap yeah let me read them yeah yeah go for it Andy hell yeah I'm so excited about this no I'm not very good at all did a few no reads I would always **** up the reads all right uh K's 176 subscribe for two months Mojo what subscribe for two months he says best decision of my life yep thank you Mojo oh there's Skilltacular 44 you **** that's Brian Riley one of my favorite human beings in the world he get him done right we some **** no oh you're right you're right BH gamer TV says all I want is a sexy wink maybe some tongue play give him the one oh God oh God you feel that I like it that was not good I think the city of San Francisco felt that too Dosh 033 just subscribed first time subscriber loser 7787 also just subscribed thank you so much Mighty Mouse 56 subscribe for six months says Bippity bitty Bongos Kevin can we",
            "start": 4188.6
        },
        {
            "text": "Francisco felt that too Josh 033 just subscribed first time subscriber loser 7787 also just subscribed thank you so much Mighty Mouse 56 subscribe for six months says Bippity bitty Bongos Kevin can we get a little Bongos no all right Quinton Holtz just subscribed thank you so much uh I still don't think you're the chairball champ but that's fine Matt M8 subscribe for seven months thank you so much Matt Brad 1575 just subscribed brand new subscriber the Kitten subscribe for two months says two whole days wow I don't know what that means yeah I don't either it's fine though solar powered nvg just subscribed first time subscriber uh Lok Kei Sam 0788 subscribed for three months Eric JP you can skip the tips oh okay you can CH the tips Matt Diablo 94 just subscribed thank you fris f shiz subscribe for two months thank you Nate DT just subscribed what does DT stand for you wonder double team dick Town dick D all right uh zero I was going to say zero **** 47 but",
            "start": 4244.08
        },
        {
            "text": "thank you for subscribing for two months thank you Nick Scarpino just subscribed what does DT stand for you wonder double team dick Town dick D all right uh zero I was going to say zero **** 47 but that's zero hit just subscribed for 3 months thank you um Greg Miller noo just subscribed for 9 months he had a baby nine months remember that movie with uh Hugh Grant good good hair good set of hair that Hugh Grant uh Jr oh I don't know see subscribe for seven months he says Hey Kevin if my if my pot smoking device was haunted would you call the spirit a bong ghost bong ghost bong ghost bong ghost bong ghost bong ghost okay uh that's a pretty good joke um no nostalgia 35 just subscribed thank you CR just subscribed hell yeah Greg Miller thank you um Jim Jim Bob Cooter who is an offensive I think offensive coach in the NFL and he used to be a head coach at one point but it was like that guy has the best name you wouldn't just call him Coach Cooter or like it it just you would go by the full name",
            "start": 4299.72
        },
        {
            "text": "coach in the NFL and he used to be a head coach at one point but it was like that guy has the best name you wouldn't just call him Coach Cooter or like it it just you would go by the full name Jim Bob Cooter thanks for the great content boys please put Andy on camera as much as possible you are funny as **** thank you Jim Bob Cooter also you call some great plays for whatever team you coach what if that actually was the coach that'd be cool Coach Cooter uh L turbo says Andy hype 27 months of subscription turbo thank you L turbo you're the **** man Bob wolf just subscribed for 10 months says Andy and there's probably two emojis next to that can't see them though I hope they're eggplant emojis though well and then on then on a different wolf under a different name he subscribed again hell yeah for 18 months Cortez oh I see he's doing Andy Cortez that's very smart I wonder if he had both tabs open like synchronizing that **** two emojis there don't know what they are either um",
            "start": 4372.48
        },
        {
            "text": "\"hell yeah for 18 months Cortez, oh I see he's doing Andy Cortez, that's very smart, I wonder if he had both tabs open like synchronizing that stuff. two emojis there don't know what they are either um chicks1 says less than three months till KindaFunnyLive 3 holy crap.com KFL 3 K Mitchell will be there for good K Mitchell will not be there you know sad story real talk I haven't told you this we legitimately reached out to Kell Mitchell to try to get him to come and he can't he's busy he's hosting some Nickelodeon show now oh no way game time or good for him good for K Mitchell I think it's called Game Boys, Game Boys yeah... God never mind that show The Hike Tia the hike T the hike subscribe for 10 months thank you welcome to the fan Andy loving that dope Diva shirt She's My Bae she is my bay too thank you um Trevor Starky says SC for 28 months\"",
            "start": 4413.44
        },
        {
            "text": "the hike Tia the hike T the hike Subscribe for 10 months, thank you. Welcome to the fan Andy. Loving that dope Diva shirt. She's My Bae; she is my bay too, thank you. Um, Trevor Starky says SC for 28 months. Good Lord, I think I'm around that amount too. Great! First episodes Andy here and on GOG. Hope you're having a great first week. Love you, buddy. Love you too... love you, Trevor. Thank you so much. The postman says keep... that chicken boy. Subscribe for two months Jam T 3003. Subscribe for 20 months. That is, that's more than 19 months MH. It's scat time all right! Nice. Yousef McEd says uh subscribe for 15 months. Annie might already be my favorite Kinda Funny member. Love the show today, fellas. Thank you. I appreciate again. Congrats on on the gig. What what gig? I don't know if I'm supposed to talk about or not. He got okay good got a cool gig though good gig. Youf uh spoony ambitious just subscribe thank you FM of death just subscribe T Tao just subscribed too Mela Mo Bradley subscribed for seven",
            "start": 4462.8
        },
        {
            "text": "or not he got okay good got a cool gig though good gig youf uh spoony ambitious just subscribe thank you FM of death just subscribe T Tao just subscribed too Mela Mo Bradley subscribed for seven months thank you master mind wolf says welcome Andy looking forward to seeing you and the crew grow I like the energy you bring keep it up much love for my fellow Texas native don't **** mess with Texas boys all right Texas make sure the label doesn't show make sure the label doesn't show uh James Den just subscribed thank you and **** 89 month number four thanks Amazon Prime hell yeah you like that what yeah I like it a lot crouch in the house subscribe for seven months here's more of Amazon's money thank you for that uh witty username 442 says I like this new boy thanks I appreciate that this is this is from ziger to you this is from ziger to me oh boy it's a gift for you a gift for me I'm going to open it after I finish reading this uh murder rizer 5280 subscribe for 7even months thank",
            "start": 4516.76
        },
        {
            "text": "is this is from Ziger to you this is from Ziger to me oh boy it's a gift for you a gift for me I'm going to open it after I finish reading this uh Murder Rizer 13 subscribe for seven months thank you Hassan X Hassan just subscribed Letha 7th House of K just subscribed Josh Errera like that roll in ours they gave you a boner boys uh just subscribe for three months three months of not forgetting to renew sub yeah that's pretty hard to do uh Nutty Muty 727 months love you guys keep that chicken you beauty boys thank you uh Brunos over Bronze just subscribe Br2100 just subscribe I didn't say that right 20,100 just subscribe Captain Kobe just subscribe uh John B mfu C my C I don't know what that means uh subscribe for two months AI Val say 99 subscribe for two months Donut Ples my boy Matt Cortez not no not related to me I wish he was though um Crazy Zombie also subscribe Mr Clanky subscribed for six months I don't know about this guy can Andy Cortez pontificate on polarizing political",
            "start": 4563.92
        },
        {
            "text": "Matt Cortez not no not related to me I wish he was though um crazy zombie also subscribe Mr Clanky subscribed for six months I don't know about this guy can Andy pontificate on polarizing political points let's wait for that next God guys we'll talk about all sorts of political stuff crazy climate right now man we can talk for a while it's a crazy climate crazy climate what's up I mean what's up with what's up with uh uh what's up with Reagan he's dead Dick Cheney Dick Cheney Your Dick Cheney joke got me so hard thank you I appreciate that all right let's open up the let's open up this gift from Ziger you're done with the names yeah all right great we done shut it down shut it down oh man I'm really nervous I got to PE PE so bad can I no I don't want to go p PE right now we're almost done oh wait on yeah we're almost done we're almost done got to go pee though tiger what is this what kind of wrapping is this uh Tim there's also one more tip oh I feel like I'm **** doing an",
            "start": 4618.08
        },
        {
            "text": "oh wait on yeah we're almost done we're almost done got to go peee though tiger what is this what kind of wrapping is this uh Tim there's also one more tip oh I feel like I'm messing doing an Uncharted puzzle something there's a knife right next to you use the knife get in there cut it up do you think it's a bag of Cheetos oh man if it's a small bag of Cheetos holy crap I'm going to lose my mind I'm real nervous about be careful care nervous about I'm nervous about knives blades wait the last can you read the last tip cuz I can't see it uh it's I'm just going to cut through this wrap so sorry that guy why you got harassed for real something to do with a transvestite can you oh he got caught with the transvestite can you thank you can what was his well who left the tip though I'm so nervous about the knife yeah I don't like the knife I'm so scared of it I'm so scared for that guy I brought my own damn can you not touch me can you not touch me penis gummies hell yeah dude I'm going to",
            "start": 4674.24
        },
        {
            "text": "about the knife yeah I don't like the knife I'm so scared of it I'm so scared for that the Knife I brought my own damn can you not touch me can you not touch me penis gummies hell yeah dude I'm going to eat so much penis tonight bachelorette party a big gummy big gummy pecker can I eat it right now yeah sure oh but I already made the thumbnail we're about to make a new thumbnail boys oh yeah get in there oh it smells really gummy put all that gum on all over my mouth Killam was who did it Killiam of course it was Killer Cam that's actually hilarious oh man wait before you don't don't bite yet cuz we need we need to get a thumb let's take it out of the plastic and like let's can we stop I don't like this no no I'm so sorry Mom and Dad I'm so sorry you think they're watching no stop they that movement go go back to the the one and then just hang it near your face like yeah cuz you need the thumbnail yeah there we go no open your eyes though yeah look at Tim Gettys look at Tim Gettys yeah look at me",
            "start": 4722.12
        },
        {
            "text": "go go back to the one and then just hang it near your face like yeah cuz you need the thumbnail yeah there we go no open your eyes though yeah look at Tim Gettys look at Tim Gettys yeah look at me look at Tim Gettys yeah that's exactly it all right now can we please get people screenshotting that yeah someone screenshot it send it to Kevin Coello thank you you got like you got to give this some love too though that's always cute all right we will see you guys on Monday when we return with the Kinda Funny Morning Show thank you Zigger thank you everybody else in the chat for joining us for very and not last Kinda Funny Morning Show send him some sweet nasty love send the sweet nasty love to Orioto send the sweet nasty love to uh pretending I'm a Superman the Tony Hawks Pro Skater documentary Fallen Angels fallen angels in the RGB we don't play no games mhm mhm get them up to a million views guys like comment subscribe oh man thank you Trevor look at that I want Kevin I want one more of when it's like you",
            "start": 4796.08
        },
        {
            "text": "Angels in the RGB we don't play no games mhm mhm get them up to a million views guys like comment subscribe oh man thank you Trevor look at that I want Kevin I want one more of when it's like you know I I mean I that's a special photo right there just wait a little bit and to see what gets sent to you all right cool all right until next time bye it's been our pleasure to serve all that stuff",
            "start": 4841.76
        }
    ]
}