{
    "id": 2562,
    "video_id": "dKOJJ04hzTs",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Kevin Coello",
        "Tim Schafer"
    ],
    "title": "Tim Schafer is a Super Villain - Kinda Funny Morning Show 04.18.17",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1492546827,
    "duration": 5167,
    "transcript_chunks": [
        {
            "text": "there's a lever you can do you can do the L I want to be as tall as you what's up everybody Welcome to the Kinda Funny Morning Show for Tuesday April 18th, 2017 I'm one of your hosts Greg Miller alongside the most legendary game developer in the room Tim Schafer hello look how tall I am now it I can even go lower watch and then then you look really tall and this hurts my how do you stop just watching yourself the whole time look how fast oh yeah I forgot you're one of these you're you're one of the normies yeah I'm not used to constantly staring at my Kevin we're need to turn off the confidence monitor no it's good it's good you're going to do it you're going to this is what did you call it confidence monitor confidence monitor confidence you're monitoring your own what's like a like am I looking at the right camera am I doing that you can see the monitor if you're not these show business people confidence yeah this is the one thing I learned from up at noon",
            "start": 1.24
        },
        {
            "text": "what's like a like am I looking at the right camera am I doing that you can see the monitor if you're not these show business people confidence yeah this is the one thing I learned from up at noon confidence monitors hello thank you for having me thank you for coming by I know I was on here recently you guys probably all sick of me but no you see that's the whole thing there's so many different shows we do that a lot of people probably didn't even see you when you were on before that's true why didn't why didn't they watch that they hate everything they hate people they you've never gotten to work a show with Kevin before Hey Kevin Hey how you doing well no it's he's gonna have to he'll have to hit 50 switches but eventually there it is see he pops up no he was laughing the whole time remember before yeah yeah he was laughing all right he laughing at what what what's that Kevin a lot of call outs for frames are we having frame difficulties over there what the hell they talking about",
            "start": 48.4
        },
        {
            "text": "before yeah yeah he was laughing all right he laughing at what what what's that Kevin a lot of call outs for frames are we having frame difficulties over there what the hell they talking about you look good Mack so the Transamerica Building there you go coming out of your head it's like one the dun cap remember the Dun Cap yeah remember remember the Dun Cap like did you ever oh they're saying frame rate yeah that's just how slow think framing framing look great you're doing great you're dominating the framing we're not having any issues on our end it's just my bad frame rate the same thing happened yesterday people said and then they refreshed right there hectic sausage says it's fine now for some reason yesterday's start and this start did too but I think it's on twitch's end you know twitch what are you going to do what are you going to do can't do anything just do your best yeah that's what you can do just try and uh talk slowly no no does that help no that doesn't help",
            "start": 84.92
        },
        {
            "text": "Twitch, what are you going to do? What are you going to do? Can't do anything. Just do your best. Yeah, that's what you can do. Just try and uh talk slowly. No, no. Does that help? No, that doesn't help with frames at all, not at all. How you doing, Mr. Schafer? I'm good, I'm relaxed. You know. Full Throttle, Full Throttle is launching. It's launched. Yeah, it's out there. Yeah, people are playing. Don't list well because they're going to get it on PlayStation of course. The PlayStation store doesn't update until Tuesday in the afternoon. I really thought it was today. Okay? You can get on Steam now and then you get on your V. You can play on the V while watching this amazing show. Yeah, I know that's where I've got it pre-loaded on my V at home. It's exciting. I'm very excited about it. We're going to stream some after the morning show. You and me, 20 almost 22 years to the day. What's that feel like? This month do you think you'll ever make new games or you just going to keep coasting on the coattails of your",
            "start": 123.56
        },
        {
            "text": "some after the morning show you and me 20 almost 22 years to the day what's that feel like this month do you think you'll ever make new games or you just going to keep coasting on the coattails of your old success yeah wouldn't you I mean how long do you going to want to work I mean I'm ready to bring back Psychonauts the remastered Psychonauts episodes any second go back and change your outfits and make you dress cool yeah just go back and reread my old IGN reviews into new videos or whatever like man I really I was right I nailed it uh I mean it's it's it is kind of strange to be like looking at your own writing from that time and like who you were at the time like wow I was really dumb I was writing about like when you write about things like life and death and I was like 20 something at that time I like I didn't know what I was talking about but I had you know read a lot of books and I was imitating sure what you think adults feel like about life and death right on the road I mean one thing",
            "start": 161.56
        },
        {
            "text": "I like I didn't know what I was talking about but I had you know read a lot of books and I was imitating sure what you think adults feel like about life and death right on the road I mean one thing I'm running about bikers like I know and I like this is before Sons of Anarchy we didn't have Source material we didn't know no we had the Wild One, the Marlon Brando movie which everyone should watch and then The Road Warrior was very you know the old that was my favorite movie at the time and um and Hunter Thompson's Hell's Angels book I read I was like we can't do any of this no this isn't going to Lucas won't go for this LucasArts is not going to go for this this is not how a Jedi acts and um that was my reference material gotcha and growing up is like a very safe childhood in Sonoma and you know so you had no no you didn't know what was like on the open road I had a motorcycle I you know I had a motorcycle through college and my brothers and stuff all rode motorcycles my dad's still has my",
            "start": 196.4
        },
        {
            "text": "and you know so you had no no you didn't know what was like on the open I had a motorcycle I you know I had a motorcycle through college and my brothers and stuff all rode motorcycles my dad's still my dad's like 82 he's still going to work he rides a scooter to work so we're well that's a scooter that's not a motorcycle he used to ride a motorcycle but he's trying to be careful he crashed it he crashed it once he would go for a joy ride on the way home from work and he crashed it on the Mountain Road and he had to set his own pinky on the side of the road did that ever happen on Sons of Anarchy? He said that's how hardcore I think Tim Schafer is, super villainous. Yeah, there are two types of riders: those who have crashed and those who are going to crash. Wow, because everybody eventually ditches it, they say it's not known for safety, no not at all. My dad, Greg Miller, came through a while back did a GameOverGreggy",
            "start": 236.72
        },
        {
            "text": "to crash because everybody ditches it eventually, they say it's not known for safety, no, not at all. My father, Greg Miller, came through a while back to do a Game Over Greggy show exclusive with me. You can get a patreon.com/kindafunny and uh, he was very stoic, a man not very emotional. I'm trying to be the opposite, I'm in there, I'm grasping, I'm trying to get the dirt on his life, you know what I mean? He and I will talk about your motorcycle accident because we've never actually spoken about it. I've heard stories about it, right? I'm like, \"What happened?\" He's like, \"Oh well, we were pulling up to some railroad tracks, my friend was in front of me or I wasn't paying enough attention or whatever, I forget one of the ways and they clipped the back tire and my dad tumbled over. He's like, 'Yeah, I hit my head and I got knocked out.' I was like, \"How long were you\"",
            "start": 273.16
        },
        {
            "text": "enough attention or whatever I forget one of the ways and they clipped the back tire and my dad tumbled over and he's like yeah I hit my head and I got knocked out I was like how how how long were you knocked out for Dad he goes you know 2 weeks I'm like that's a coma that is com, Dad like you need to start using the proper terminology telling the story talking like he got punched out by a pro fighter oh I woke up 30 seconds later no no he was out for a long long time yeah yeah yeah he's okay now yeah he's okay Ian some say he never came out of his emotions were knocked out of him yeah exactly he was super he was an artsy fartsy he felt you know what I mean he was a painter and then he's like you know what I'm going to go work in construction from here on out Dad won't your love for me wake up never that's never going to happen I'm a giant disappointment right Kev what was he impressed when he came to the studio oh he's super impressed with everything look at this Dad super",
            "start": 315.84
        },
        {
            "text": "for me wake up never that's never going to happen I'm a giant disappointment right Kev what was he impressed when he came to the studio oh he's super impressed with everything look at this Dad super impress super happy with everything to do Kevin we've been talking about Full Throttle a lot here you bring up the last two links I gave you these are the reviews right now oh wait that's put me on the spot with this gotcha review gotcha journalism three out of 10 no you did great IGN.com Mike Rorbaugh he reviewed it he gave it an 8.0 called it great Full Throttle Remastered improved looks no full th Full Throttle Remasters improved looks and sound make it a great way to experience a classic comedy adventure I agree and then over at Kotaku they gave it they gave it the ringing endorsement too because they don't do it you know they they they just recommend it you know what I mean yeah yeah Full Throttle Remastered kickass mood pixel art is still amazing fun protagonist but they said far too",
            "start": 352.24
        },
        {
            "text": "they don't do it you know they they they just recommend it you know what I mean yeah yeah Full Throttle Remastered kickass mood pixel art is still amazing fun protagonist but they said far too short maybe you should have made it longer this time around do you think about that I think we're way ahead of our time with our length on that game see that's the thing is like I was telling you when you got here like my like my Full Throttle memory is my best friend P Patrick Picchu coming over with it popping in the PC and plastic Pop came over and popped in the PC yep keep going with that you can't stop you can't stop with that uh he popped proceeded to play the point and click the poignant point and click yeah uh yeah anyway he popped and it was great but he never showed games to me I was always the guy giving him games so this it was always a distinctive memory of him bringing a game I had never heard of somehow putting into the PC us playing it there but I don't remember",
            "start": 395.88
        },
        {
            "text": "to me I was always the guy giving him games so this it was always a distinctive memory of him bringing a game I had never heard of somehow putting into the PC us playing it there but I don't remember it taking us 5 hours I remember it taking a lot longer it's only 5 hours when you have the internet to look up hints sure right back then we were a bunch of idiots it was like 8 hours yeah so I mean back then like 8 Hour games we always said these games were like 40 hours 50 hours but um nowadays I think there's a lot more place for like an 8 hour oh yeah yeah that's exciting when they say five hours now like oh something I can do meanwhile I'm looking down I still got like 120 in Persona to go like I mean that was some of the theories of why it's sold better than a lot of other Avengers games CU it was the biggest hit Adventure game we had at the time and some people were like that was the first game I ever finished a lot of adventure games before the internet um you just couldn't",
            "start": 436.32
        },
        {
            "text": "games CU it was the biggest hit Adventure game we had at the time and some people were like that was the first game I ever finished a lot of adventure games before the internet um you just couldn't finish him just got to you know maybe You' get like strategy plus magazine and like find some but you'd often get stuck and just put it down and and um and this one people finish and after you finish it you start you talk about it you tend to talk about it more like hey this game's great yeah I think it was mostly because was awesome great game sure that's why now did you ever think as somebody who made adventure games maybe you should just make the puzzles make more sense because that was always the problem right well I got this i got this cordless phone and if I throw it out the window when I hear the it bounces off the car hits that guy in the head he calls my mother she comes pick me up what puzzle is that I don't know that's a good one though I'm no don't do it because otherwise I'm",
            "start": 472.44
        },
        {
            "text": "I hear it bounces off the car hits that guy in the head he calls my mother she comes pick me up what puzzle is that I don't know that's a good one though I'm no don't do it because otherwise I'm going to steal that put in broken is to you know adventure games uh they really make sense when you're making them yeah yeah yeah when you're in your own head with your own logic it totally makes sense when someone describes I get a lot of pitches for adventure games too people are like this is this game and here's a puzzle if you do this you do this and mostly a designer will think about it only in terms of yeah the solution sounds like a reasonable thing we just talk about how would anyone ever know any of these steps so we do work really hard to try and make all the steps clear and also as a defender I'm s defensive but if you talk to if you talk to all the people in the world they usually one of them just tell you here's what you do to solve the puzzle so just enjoy the dialogue talk",
            "start": 506.72
        },
        {
            "text": "a Defender I'm s defensive but if you talk to if you talk to all the people in the world they usually one of them just tell you here's what you do to solve the puzzle so just enjoy the dialogue talk to all the people and then try all the objects on the things and eventually someone's going to be like hey dummy use to throw the cell phone out the window and record the siren going by that's pretty good recording the cell phone and I'm going to write that down go ahead go ahead and do it yeah well that's not paper that's just right panto theater of course ladies and gentlemen this is the Kinda Funny Morning Show each and every weekday here on twitch.tv/ kindafunnygames we run you through the nerdy news you need to know about before jumping in the chat to answer your questions comments and concerns in between those two segments I reached the internet grab a video game toss it to one of you Beautiful People spoiler alert It's Full Throttle Remastered today uh there's multiple ways",
            "start": 544.48
        },
        {
            "text": "and concerns in between those two segments I reached the internet grab a video game toss it to one of you Beautiful People spoiler alert It's Full Throttle Remastered today uh there's multiple ways to win of course I believe that's very good you can be in the C I heard it's an 8.0 according IG great nine and a half oh should be not they're doing that thing they're knocking you down yeah cuz it's old **** God I hate that you know what I mean that thing yeah that's the problem you got people like Marty Sartre over there like I don't want old games I want new games is that what he sounds I'm I'm Marty I an alcohol dependency problem um wow that's true I mean come on wow no I mean nail on the head but damn thank you Kevin all right yeah they're going to go remark the score now for you don't worry about it uh you can of course if you're listening to this later on youtube.com/ kindafunny or podcast services around the globe there are other ways to win the game we'll tell you about it",
            "start": 579.4
        },
        {
            "text": "Worry about it, uh, you can of course if you're listening to this later on YouTube.com/KindaFunny or podcast services around the globe. There are other ways to win the game; we'll tell you about it later. Before we jump into the real news though, yeah, Amnesia: Fortnite's going on right now, yeah, that's why I'm so relaxed because we do the Game Jam and it's like the company splits into four groups, and for those two weeks they have to make a game, and I don't have to do anything. So what? Yeah, what is Fortnite? So it's two weeks where we just call it \"Mia\" Fortnite because we forget what we were working on. Cuz the first one was in the middle of Brutal Legend, and that was a four-year project, so like two years in I was like, \"Oh, this kind of impressive big project that has like another couple years to go,\" and we're like, \"They think the team needs a break,\" so we took two weeks off from the project. Smart and sure they didn't have one at the time, oh.",
            "start": 616.36
        },
        {
            "text": "that has like another couple years to go and we like they think the team needs a break so we took two weeks off from the project smart and sure the lead that they we didn't have one at the time oh really I thought this is already on track this is this was in between publishers that Double Fine got back so we had this this two weeks where we just took a break um and we split into four groups and each group had to make a game in two weeks just like a full game and um and that very first one uh I believe that was the one uh no that was the one that we made Custodians of the Abyss which turned out to be Iron Brigade eventually okay and Happy Song which turned out to be Once Upon a Monster but it's just started as a c exercise like can you make a game in two weeks can this team that's making this like $20 million four-year game make a game in two weeks and it was just everyone just like exploded with like enthusiasm and it just gave a huge morale boost and it gave a chance for people who were like",
            "start": 651.04
        },
        {
            "text": "$20 million four-year game make a game in two weeks and it was just everyone just like exploded with like enthusiasm and it just was a huge morale boost and it gave a chance for people who were like a lead programmer or a lead designer to be a project leader and like try something new and everyone got to tread something new um and everyone was really excited about it and then we did it again and then after the project and then when we were working on Brutal Legend 2 that got suddenly cancelled and then we're like oh I guess we're going to go out of business or well it's been a good run everybody that was fun but we had these uh eight demos and we picked like our four favorite demos and we took them on the road and got them all signed in Costume Quest is one of them yep was the one that so it's pretty safe to say Costume Quest saved Double Fine it well I mean it was no way I was going to get us $20 million game signed in that before we ran out of money but those four little games we got each",
            "start": 691.64
        },
        {
            "text": "Costume Quest saved Double Fine, it well I mean it was no way I was going to get us $20 million Game signed in that before we ran out of money but those four little games we got each one of them signed and they did save the company and and it was the creativity of our team to save the company which is nice good that was a tier cuz it was inspired by Double Fine's Broken Age Extravaganza, having the documentary crew in the office we just got addicted to that much attention sure you love it yeah once once you once you have the limelight once you have the confidence to monitor you can't stop looking at it and um but also because we were really interested in transparency in the game development just like opening up let people see how games are made so you could see both that like oh they're made by",
            "start": 730.92
        },
        {
            "text": "it and um but also because we were really interested in transparency in the game development just like opening up let people see how games are made so you could see both that like oh they're made by dummies just like me right they're not like some other sure cuz I was a kid I always wanted to make video games I was like who who makes them they must be super smart who are these Wizards Wizards who like it must be like scientists and robots and all these people Al exactly those are the people making the games and then we're like nope dummies like you like like just not that you're you know what I'm saying dummies like us dummies like us yeah exactly like uh but just regular people and um also that to show the passion that goes into the see how much love and care the people who make games put into them and uh so so we decided to make it public and we the documentary crew filmed these teams and those stories just got people even more excited and our community is more involved as you know",
            "start": 770.4
        },
        {
            "text": "into them and uh so so we decided to make it public and we the documentary crew filmed these teams and those stories just got people even more excited and our community is more involved as you know like things have changed with um with like like the way you guys interact with your community it's very it's a very like high bandwidth back and forth you know and that's not the way the game development used to be it used to be like we were in this kind of Castle and we'd kick out the games and' be like hope you didn't like that who made that where they come from yeah and now it's just like a big back and forth whether it's the forums or the documentaries or just you know you know the the community is more involved and in fact this time the communities organize their own Jam they're going to do a jam along with us and and they they put up their pitches and they let their Community vote and they're making a game called Pong Ball it's like a physics based pong and pinball put together um and",
            "start": 807.4
        },
        {
            "text": "a jam along with us and they put up their pitches and let their community vote and they're making a game called Pong Ball, it's like a physics-based Pong and pinball put together um and so they're doing that alongside of us so it's just gets more and more open and participatory that's cool this is game development participation there is it's all moving around I see it's happening down there like air hockey sure exactly this table reminds me of air hockey it be great just million holes yeah well Kevin drill some holes in this thing and get air hockey up and running all right cool Kevin what are you playing over on your switch today PoPois thanks Kev uh the Elder Jew in the chat says I'm just sitting here he says hitting here but he means sitting here waiting for Costume Quest 3 yeah you got isn't there a cartoon coming and everything else now come on yeah it's going to be uh there's going to be a cartoon the Zack Norman the guy who did the book yeah I did is really",
            "start": 844.08
        },
        {
            "text": "Quest 3 yeah you got isn't there a cartoon coming and everything else now come on yeah it's going to be uh there's going to be a cartoon the Zack Norman the guy who did the book yeah I did is really really awesome um so you got to do it then that's how it works you need a costume Universe you need to get a game out there to promote the show the show to promote the game you know we're doing a lot of remasters and sequels now so I feel like it's great to think about like something new but also Costume Quest is the kind of thing I feel like will never go away cuz every Halloween think about it and you're like you know and I play through with my daughter we played one and two yeah um and and I was like these are great these are great games you know what would be great another one of those but I think we have to get um get the current um games out of our we're doing this big Psychonauts thing right now it's pretty big cancel it no I mean like for real you think people have waited a long time",
            "start": 882.96
        },
        {
            "text": "I think we have to get um get the current um games out of our system. We're doing this big Psychonauts thing right now, it's pretty big. Cancel it? No, I mean like for real. You think people have waited a long time for Psychonauts; they'll wait a little bit longer. They just got Ruin, they're fine. Yeah, yeah, yeah, yeah. Did um uh and the did you play that? R no, yeah. You gotta get one of those. I have it, it's the VR thing. But then I come home and there's like, you know, a dog, Persona, there's all these things happen. There's no time; that's what I'm saying. That's how I feel about that. You know, whatever. You know how you are. You caught up in every game out there right now? No. You think just because I bring you here all the time and use your celebrity to promote this show, well, want to go play your games? Yeah, all right. Well, I guess that would be a fair tradeoff probably. Yeah, probably would have been a fair trade. So uh, I played Fortnite; it's awesome. And I get to be here because the crew is working.",
            "start": 922.0
        },
        {
            "text": "your games yeah all right well I guess that would be a fair tradeoff probably yeah probably would have been a fair trade TR so uh I Fortnite it's awesome and I get to be here because the crew is working hard ex it's easy for you to get out and go do other things I'm going to go to Brazil tomorrow but not for fun well there's a games conference that I hope is Fun the uh Geek and Games of Rio conference is it down here and uh I'm going to go down there and I'm going to I'm going to watch the I'm going to watch the documentary episodes just like everybody else and to learn about what's going on at Dou are you giving a speech down in in Brazil there's going to be a panel I'm going to be talking to game devs and are you going to go to all the places they went to in Fast and Furious which one was that Kevin Brazil fast and furious five five where they went in Fast Furious yeah and I'm going to go that Brazil remember that been diesel I would do that but I think I've been sweating so oh no I",
            "start": 962.24
        },
        {
            "text": "that Kevin Coello fast and furious five five where they went in Fast and Furious yeah and I'm going to go that Brazil remember that been diesel I would do that but I think I've been sweating so oh no I understand no like this Brazil trust me this is the one show you don't need to worry did they jump off the arm of the big Jesus or that would no that's too much that's too far you got to respect the big Jesus first story yeah news comes from ign.com Marvel Heroes Omega has a closed Beta release date announcement thing of Ama  here on PlayStation 4 superheroes are boring we'll deal with that in a second Seth Macy says gazillion Marvel Heroes Omega close beta comes to PS4 Friday April 21st earlier this month gazillion revealed Marvel Heroes Omega is coming to both PS4 and Xbox one but the upcoming close beta for PS4 only uh an Xbox One beta is coming in the quote unquote near future once available buying a Founders pack through the PlayStation Store entitles you to Beta access",
            "start": 997.96
        },
        {
            "text": "close beta for PS4 only uh an Xbox One beta is coming in the quote unquote near future once available buying a Founders pack through the PlayStation Store entitles you to Beta access in according to a forum post from the developer and anyone who participates in the beta can look forward to receiving Daredevil at no cost uh the final game on Console brings 38 characters at launch with Iron Fist and War Machine exclusive to the founders pack for a six month period uh Marvel heroes Omega is one of many Marvel that's just I'm talking about now you going to play that before run there's a let's play up right now of Marvel Heroes Omega me Anthony and then Nick comes in as Nick Fury and starts screaming at us and shooting a gun and he does this he does a Samuel L. Jackson mixed with Morgan Freeman impression and I don't understand if that's racist or okay but he does it so that's where that is youtube.com/KindaFunnyGames what the **** superheroes are boring superheroes are so",
            "start": 1050.4
        },
        {
            "text": "Freeman impression and I don't understand if that's racist or okay but he does it so that's where that is youtube.com/ kind of funny games what the **** superheroes are boring superheroes are so stupid what are you talking about Psychonauts are kind of superheroes yeah but they're realistic psychic superheroes right they can use their mind the power of their mind that's the power uh I'm like I would destroy all superheroes if I could just like I'm like a arch villain yeah you're p a button to destroy all superill cuz then movies will get better what the **** comic books would get better oh you're sotic what does that even mean the comic books the life blood superheroes for sure we'd have paper girls but come on yeah Saga you really hate superheroes or just now they're super popular it's just like every time I see a trailer for new superhero mov I'm like okay I think they're just I think there's some enough do you watch any of the movies I do you",
            "start": 1090.12
        },
        {
            "text": "just now they're super popular it's just like every time I see a trailer for a new superhero movie, I'm like okay, I think they're just... I think there's some enough. Do you watch any of the movies? I do. You remember that Superman movie in the '80s that was that was really good, that was a good one. Lean in, your microphone, put down your Game Boy, son, talk to us. Put when I was young it was it was great rewatching it now it's like whoa, whoa, whoa, whoa, whoa. Okay, now I can't fight a war on all fronts. This is what you call the wedge. The first thing I have to do is come between you two, damn it. He's good at this. Wait, you don't like Superman the movie? No, I mean I love it but... in the same way that I love all right, all right, all right, all right. Can you read my mind? Yeah, can you read... she's also she should be dangling, she should be dangling the whole flight like this instead of like that. Andy, Superman the movie, good or bad, the first Superman the movie, Christopher Reeve, what the **** like I",
            "start": 1132.76
        },
        {
            "text": "also she should be dangling she should be dangling the whole flight like this instead like that Andy Superman the movie good or bad the first Superman film Christopher Reeve what the **** like I wasn't born I'm aware he wasn't born I'm aware I wasn't either this a movie I haven't seen since I was like maybe 5 years old sure I'm just saying every time I see a trailer I'm like what if they made something up and said something new they do that all the time and it's an indie flick and you don't go support them do you see Colossal yet didn't think so that's why it just came out that's why yeah we don't all get to see things before they come out like you play Mario Kart out Mario Kart's great do you want to play Mario Kart today I do that would be great I've been waiting for that let's just cancel the Full Throttle stream and play Mario Kart wow it's always an attack come on it's not an attack I'm just saying I know you're a busy guy you got things to do you're going to Brazil at least",
            "start": 1176.64
        },
        {
            "text": "cancel the Full Throttle stream play Mario Kart wow it's always an attack come on it's not an attack I'm just saying I know you're a busy guy you got things to do you're going to Brazil at least you played that game yeah I am I got to get out of here I got to hit the beach play Full Throttle here's my plan for Full Throttle and a question for you how quickly will I get a trophy in this game when I start playing cuz I am at level 29 99% so I'm right there at the Tipping Point but you know the percents keep it awkward do I need one bronze do I need three I there's a platinum in the game but I mean when we play today for we play 30 minutes we do a let's play or whatever stream how am I going to do you good trophy I could let's see if that does it that'd be big for me it'd be big to push me over you know what I mean but pushes you over okay try I I've waited my entire life Tim Schafer 34 years next week I've waited my entire life for there to be superhero movies like there are now just let me",
            "start": 1216.8
        },
        {
            "text": "Over you know what I mean, but pushes you over okay try. I've waited my entire life Tim 34 years next week I've waited my entire life for there to be superhero movies like there are now just let me enjoy this why do you why like you guys had your chance where were all these original IP indie movies that people were all about before you know what I mean? You had your Basic Instincts, then you open the door with X-Men and here we go. Is that the is that the choices we have in this world that's one of new IP movies Superman versus Batman Basic Instinct that's all I get to choose from yeah pretty much what I mean what who do you think's getting in the way? You think Zack Snyder is going to be out there making the next big new IP he tried what was it Skullgirls nobody liked it Sucker Punch I think it was Sucker Punch nobody liked it Sucker Punch yeah I mean I didn't hear I didn't see that heard that was not I didn't hear that was great but that was also wasn't that a comic book already",
            "start": 1256.44
        },
        {
            "text": "think it was Sucker Punch nobody liked it Sucker Punch, yeah I mean I didn't hear I didn't see that heard that was not I didn't hear that was great but that was also wasn't that a comic book already I don't **** know I thought it was an original thing I think it was original thank you thank you Kev I don't know you just like when everyone has a bunch of when someone has a bunch of money to invest in a thing they usually like okay how do we make sure this doesn't lose any money let's find something to slap on it y that whole process is kind of disheartening so here we go we're coming back to now we're getting you got a chip on your shoulder about video games no I think it's changed a lot like crowdfunding has let us like do things like adventure games that people wouldn't be able to do if they're always just trying to think about how to minimize their risk on every investment right sure yeah sticking with superheroes and that period of LucasArts where we made up our own things was",
            "start": 1296.68
        },
        {
            "text": "if they're always just trying to think about how to minimize their risk on every investment right sure yeah sticking with superheroes and that period of LucasArts where we made up our own things was because we were forced not to use existing yeah forced not to use Star Wars we couldn't use Star Wars and so we had to make up a bunch of stuff and we got a bunch of new IPs out of that but superheroes are fine they're fine yeah there's no Full Throttle too I noticed well yeah yeah I mean they tried did they yeah yeah lot of monkey business but I got it cancel with my mind oh good okay cool I was like no don't make that was it easier I mean to make new IPs back in the day easier than it is now mentally like or no I don't mean like man when you had more juice up here you were ready to get out there no that was just like we didn't realize I mean I I it was a really great opportunity to have have we're well funded we're sitting on George's Star Wars pile of cash yeah and we were forced to",
            "start": 1331.2
        },
        {
            "text": "there no that was just like we didn't realize I mean I I it was a really great opportunity to have have we're well funded we're sitting on Tim Schafer's pile of cash yeah and we were forced to make up new like but you can't use this original you can't use Star Wars got to make up new stuff like okay make up new stuff and then really in the in the world of like entertainment that's just such an unlikely opportunity to get yeah to get like a fund a funded new IP because now to launch a new IP like it takes a big publisher like Ubisoft like launching a new car brand you know like it's like we're going to put a ton T of money and we're going to bet everything on it right um and that's why I think we as consumers always get bent out of shape when it's like the game's not even out yet and they're like wow it's going to be this universe we're making this universe out of Watch Dogs people like we don't know if Watch Dogs is good yet slow your roll I don't need to buy the jacket yet",
            "start": 1375.44
        },
        {
            "text": "they're like wow it's going to be this universe we're making this universe out of Watch Dogs people like we don't know if Watch Dogs is good yet slow your roll I don't need to buy the jacket yet but then then they make it it's not that great but they're like well there's going to be a sequel there's going to be this they got to keep iterating on what they've learned because again they've invested so much money I just think as long as there's a breath you know as long as we have those kind of games other kind of games I think now we have a lot more uh diverse choices in games so it's great there's room for everybody okay yeah even superheroes next story even a okay twitter.com James Gunn that's right director of Guardians of the Galaxy two Screen Rant said Guardians of the Galaxy 2 has four post credit scenes James pops in it says five actually like they're different depending or they they just play one after another I think they're going to play one after the other not one after sure",
            "start": 1414.84
        },
        {
            "text": "post credit scenes James pops in, it says five actually, like they're different depending or they they just play one after another. I think they're going to play one after the other, not one after sure, it's like multiple times, like different theaters. No, that'd be uh, I'm excited about Guardians of the Galaxy 2 and here's my thing about Guardians of the Galaxy to stick with me and think about Guardians of the Galaxy one as well. Boop, the thing about it right up my nose, I'm just letting you know. Boop, uh, is that like that was the thing with the superheroes where they let you do something different? You know what I mean, like it wasn't like it wasn't cookie cutter, like Ant-Man, fine movie but it's pretty like by the number superhero. Think there's more comedy to it but not as much as there should have been if they Mr made it more entertaining exactly well Mr R's great of course but that's the thing is I feel like now that there's a spectrum of superhero movies you get cool stuff",
            "start": 1450.2
        },
        {
            "text": "there should have been if they made it more entertaining exactly well Mr. R's great of course but that's the thing is I feel like now that there's a spectrum of superhero movies you get cool stuff like that new Thor trailer him fighting Hulk that looks like a fun buddy cop movie, movie I'm in I haven't seen that it's good it looks good this one give it a shot give that one a shot okay for me did you like Guardians of the Galaxy one yeah yeah what's your daughter think about the Avengers movie do we need all these well no Civil War don't get me wrong Spider-Man was the best part of it I said it the airport scene when they all got together and fight was the best part of it I said it all right I said it yeah I'm not afraid to share my Civil War opinions you bring my daughter for I wanted does she like superheroes does it break your heart do you keep her out of those you keep her away from those movies like no go watch this French independent film read the subtitles no I mean she's drawn to things that have girls in",
            "start": 1486.04
        },
        {
            "text": "break your heart do you keep her out of those you keep her away from those movies like No Go watch this French independent film read the subtitles no I mean she's drawn to things that have girls in them it's a weird thing about girls girls are like where's the girl in that and so she there there actually a lot you know there are a lot of that um we didn't have an I was kid but like there's a lot of graphic novels for young readers and there's a lot of about Zita the Spacegirl and like they're like superheroes that are little girls going off into space and stuff so she's into that so if they ever make a movie out of those she'll be right there okay she like she likes Rey from Star Wars, reads the Amulet series and a bunch of uh uh the what was the one you said Ray from Star Wars like Rey yeah yeah okay when she gets a little older yeah how old is she now eight yeah a little bit older you should let her read a strong female protagonist it's a book uh it's a web comic I",
            "start": 1524.12
        },
        {
            "text": "Wars like Ray, yeah, yeah, okay. When she gets a little older, yeah, how old is she now? Eight, yeah, a little bit older. You should let her read a strong female protagonist. It's a book, uh, it's a web comic I picked up in Edmonton in a collected form, and it's about this, uh, superhero girl who eventually likes being a superhero sucks. This is **** I don't, I shouldn't be making these choices, and gives reveals her secret identity and then goes back to college and like all the shenanigans that happen in terms of like superheroes still want or villains want to fight her still how do you balance having these powers and as you want to be an adult? Ni superheroes are good, and I don't like I don't like what you've brought to the show today. I want you to know that with differing opinions, yeah, yeah, yeah, yeah. I don't like that. I like people agree with me, uh. I want to stick with not so much the fact that you hate you know things that are popular and that everybody else loves but with your Game Dev talk you",
            "start": 1559.64
        },
        {
            "text": "I don't like that I like people agree with me uh I want to stick with not so much the fact that you hate you know things that are popular and that everybody else loves but with your Game Dev talk you were bringing up we're jumping over to Kotaku.com over there Jason Schreier put up Horizon Zero Dawn uses all sorts of clever tricks to look so good now Kevin what I want you to do is and I can't see the screen so I'm relying on you wait what TV2 is off we never turn TV2 back before you get up just roll it down to see the gift just let everybody see the gift's gone just making sure um so this is an interesting story a friend of mine saw this on Reddit yesterday of like this is what happens when Aloy looks around the world and basically it's them rendering everything you'd see in front of you not behind you cuz you have to SPM back to that and stuff I thought oh what a cool gift and jump jumped out that you I mean nice that's fun and then today on Polygon I saw an opinion piece that was like game devs are",
            "start": 1599.56
        },
        {
            "text": "you have to go back to that and stuff I thought oh what a cool gift and jump jumped out that you I mean nice that's fun and then today on Polygon I saw an opinion piece that was like game devs are attacking this article from Kitakami saying that this is the most basic thing in Game Dev hahhaa why they think it's a clever trick but then there's this disconnect of what a Game Dev knows versus what a game player knows yeah what is this called Tim uh I mean this this happened even on our internal Slack someone was some of the team was like Hey look at this cool this cool GIF or GIF a super like to call it I nowadays I get so confused about what I call it that I just say both I us say it's a gift GIF GIF Gif and um it is a cool anime and someone posted like look this cool thing they're doing and then one of the programmers you mean like like it looks like just frustr from calling to me you mean like the thing like Carac did to talk about 20 years ago or whatever like it was not impressive",
            "start": 1643.44
        },
        {
            "text": "then one of the programmers you mean like, like it looks like just frustr from calling to me you mean like the thing like Carac did to talk about 20 years ago or whatever, like it was not impressive but um and so there was a little bit of that and someone like I just thought it was cool cuz even if you know all about it is a well Illustrated animated GIF. Jesus uh anim no I don't what do what do I call GI you call it gif it's got a g it's a GIF so um it is cool so I mean were they really attacking it or someone just tweet like that's just frustr from calling I mean it's it's the usual hey it's the internet let's be mad about something day where it was just like the developers being like I can't there was and they were like developers and I was like I don't know these guys it wasn't like Neil deMause was like what a bunch of idiots in KAK I think it is neat and I think even though they're just showing FR from calling here I bet the team that made that engine is doing a million",
            "start": 1686.28
        },
        {
            "text": "Neil Druckmann was like, \"What a bunch of idiots in Kojima Productions.\" I think it is neat, and I think even though they're just showing FromSoftware from calling here, I bet the team that made that engine is doing a million other things and invented a whole bunch of stuff that you can't really see from that. That's definitely going on, and I think it gets at that thing about pulling back the curtain. Like, there's a lot of stuff that we see every day that we take for granted - the fact that we're not rendering stuff you can't see. But if you've been playing a lot of games, you never really thought about it, and then you see this, and you're like, \"It kind of inspires you to like find out a little bit more about game development.\" Like, oh, that's really interesting, and how do they decide on the fly what to... because there are there's a lot of really cool math going on now. I sound like a high school math teacher - there's really awesome math going on using a lot of cool equations and um",
            "start": 1728.04
        },
        {
            "text": "are there's a lot of really cool math going on now I sound like like a high school math teacher there really awesome math going on using a lot of cool You know what's cool about this equations and um there's a lot of awesome awesome math about it and uh and if and we'll show it sometimes just the documentary like why are you showing like a wireframe rotation because we see this all day long we see characters being rotated in Maya or some other tool or ZBrush but if you've never seen how people draw like veins on someone's arm and ZBrush is like that pretty cool um so I think that's great do you I mean is there stuff you wish as a developer and you've obviously been better about it with the docu-series series and everything stuff you know as a developer you wish gamers understood more well I mean a lot of it is just trying to the human side of it like the the the emotions that go the the how much the people who make games care about the games and you know it's just from the other",
            "start": 1759.8
        },
        {
            "text": "well I mean a lot of it is just trying to get the human side of it like the emotions that go into how much the people who make games care about the games and you know it's just from the other side of it you might notice something really wrong with the game but you'll never notice that they got like 98% of the things they wanted to get done and that you're really just noticing like the two that didn't have time for sure I think it's probably more like they got the 45% done they wanted that's more realistic but um just that uh a lot of people see things in games as like oh there was a choice they chose not to put that feature in that I wanted but a lot of it was like they barely were able to get all those features you definitely needed in yeah um so where do you come down and now this is an example you don't have to speak specifically this example but where do you come down on the Halo right now with Andromeda where why did they ship this game without facial animations but then they",
            "start": 1798.8
        },
        {
            "text": "an example you don't have to speak specifically this example but where do you come down on Halo right now with Andromeda, where why did they ship this game without facial animations but then they patch it and everybody well it's clearly EA and it's got to be their fiscal year and I mean like I assume not being a developer but knowing that team up in Edmonton right right the fact of the matter is like they needed to get it out they knew it wasn't where they wanted to be but like that's they're still the chefs and the owner of the restaurant is saying get the food out kind of thing yeah I mean I don't know the exact specifics I hate to speculate about what's going on there but I know that you have like a million things to do and you have this deadline and there's too much money writing on the deadline usually and this is what CS in every game and you just prioritize that list and you get you get done the most important stuff in in order so if you see a book like that in the game",
            "start": 1838.6
        },
        {
            "text": "the deadline usually and this is what CS in every game and you just prioritize that list and you get you get done the most important stuff in in order so if you see a book like that in the game you know there was something much much worse they did they did fix that you never saw you know and you're just singing so they're like oh thank God it's just the animation they're talking about cuz like that whole thing used to actually erase save games and blow up your hard drive and like you know so that that's for my experience what usually happens you just prioritize that list of um stuff you got to get done and you and you and you do it in order but uh I don't know other than that that's why I know that's what I was because I mean yay I got PL Andy Cortez used to make games I like before we brought him over here to edit me and shirt shirtless outfits but got a good future yeah he's got something I don't know if this is the good future but he's got something going on over there came from",
            "start": 1875.32
        },
        {
            "text": "brought him over here to edit me and shirtless outfits, but got a good future yeah he's got something I don't know if this is the good future but he's got something going on over there came from Game Dev yeah come on over Andy tell them you're gonna Andy and I are going to record the bonus episode of the Kinda Funny Games cast today about his career in games and how it led from Psychonauts, very short-lived, but how he went from making games to then here doing nothing being stupid what games you work on uh I worked on uh Ron Gilbert's uh the Kickstarter one uh the one the Ultima successor that we couldn't call Ultima because EA owns that I guess uh and then I worked on a game based on an anime called Riven, not Ruby M at rer teeth and I I just did Art but yeah then you watch Greg show and you're like I'm fell in love I'm always the Game Dev apologist like whenever I see stuff **** up with different games it's like I get it though I've been there very long but",
            "start": 1912.32
        },
        {
            "text": "and you're like I'm fallen in love I'm always the Game Dev apologist like whenever I see stuff **** up with different games it's like I get it though I've been there like I wasn't there very long but I understand yeah yeah us poor B I mean poor BioWare I love understand **** love I mean you're you're near the the end of your development your game and you're always you know I'm writing up notes like I notice these three pages worth of stuff yeah and you're like I just hope you put them in order and you just hope get just my top three can you just do the top three things CU and they're like yeah but you know the more work you do near the end of a ship cycle the more likely you are to introduce a new bug you know so you gotta like at some point cut it off and uh yeah I gotta imagine that's got to be so tough but I I always feel that that's the double- edged sword is like when it gets to a consumer review and they're like well clearly this and I'm sure you as the dev the developers are like yes",
            "start": 1958.76
        },
        {
            "text": "be so tough but I always feel that that's the double-edged sword is like when it gets to a consumer review and they're like well clearly this and I'm sure you as the devs are like yes clearly we knew that this had to happen and why it had to happen this way and blah blah blah blah blah and it's what I was talking about you know for us with internet hate in general uh it's always the things that you don't like or that make you angry that you're most likely to talk about it's always the fact that a game will sell millions of copies but then there's a bunch of people on the internet mad about one thing and it seems like that's all it's talking about when in reality the majority who was silent about everything played the game enjoyed it and liked it just fine it was totally exactly what I thought it was going to be it was great but um there's this thing about the internet and volume just the way you perceive volumes of discussions",
            "start": 1996.76
        },
        {
            "text": "it's like this game was totally exactly what I thought it was going to be, it was great but um there's this thing about the internet and volume just the way you perceive volumes of discussions that's weird like you remember when email was first like get remember that when email was a thing before I had email but like at company emails there'd be a thing where someone would be like someone would make a joke and uh a couple more people would make a joke and then if it went to the whole company say 200 people saw it then like 50 people would be like this joke is stupid you guys stop making that joke so they think they're making just one response but really all of a sudden a string of 50 responses would go out and then everyone's like why is everyone so mad about this joke and then 50 more people be like hey stop cutting down that person who made the joke like and then You'd get 50 more and then pretty soon you get like 100 people versus 100 people yelling back and forth and it",
            "start": 2032.44
        },
        {
            "text": "and then 50 more people be like hey stop cutting down that person who jokes and then You'll be 50 more and then pretty soon you get like 100 people versus 100 people yelling back and forth, and it really was just this weird echo effect of people. Or have you been on one of those threads where everyone's like \"hey, everyone, stop reply all\" don't reply all, but then there are 50 messages saying \"don't reply all\"? And so it sounds like a loud, heated passionate discussion, but everyone's just posting like one message: \"I don't get this joke,\" or \"stop making us laugh,\" or \"can everyone shut up?\" Don't use reply all. But it just feels like a big thing happening. Like, was there a ton of people really complaining about that animated GIF? Probably not, probably not. It's just Reddit calling you idiots, yeah. The internet, we love it. Yeah, let's get out of the game world and go to Variety.com, where Joe Earson says Carmen Sandiego is getting an animated series.",
            "start": 2066.52
        },
        {
            "text": "it's just Greg calling you guys idiots, yeah the internet internet we love it, yeah let's get out of the game World we're going to variety.com where Joe Henson says Carmen Sandiego animated series greenlit on Netflix starring Gina Rodriguez. How do you feel about this? I don't feel much, what the heck really, he doesn't feel anything anymore, he's dead inside. You don't care about Carmen Sandiego, I never liked the show, what the heck growing up, I did know Micro Machines, great, he's a kid, he's a kid, he's a kid, it was I Love Andy, did you like Carmen Sandiego? Oh yeah, thank you Andy's old as heck, I know but you, he looks like a kid, but he's, I'm really old and I didn't know. Is this a game people played for fun? I thought it was when they got forced to play in school, yeah it was the fun educational game like Oregon Trail for us, yeah yeah we played Oregon Trail too, number one MERS, yeah what do you got Andy? I only remember where in time was Carmen Sandiego, she time traveled there was that was like",
            "start": 2104.92
        },
        {
            "text": "game like Oregon Trail for us yeah yeah I we played Oregon Trail too number MERS yeah what do you got Andy I only remember where in time was Car San Diego she time traveled there was that was like the where in the world last one that's the one I remember watching I don't remember like where in the world and all that God they were so the games were great I assume you knew everybody who made them right you hanging out with these people GDC 1990 maybe I don't know I think that was done by Broderbund right when as in LucasArts very close maybe it wasn't maybe it was being made Westwood world no or Westwood the people who did Monopoly game I forget we should know these things no we shouldn't it's a PC game nobody knows long time ago exactly uh but it the games were great the show was great with Chief Gumby shoes come on remember the show you watch the TV show no oh my God they had A cappella singers too it was a weird choice but they had them no big deal and then these kids ran around",
            "start": 2153.36
        },
        {
            "text": "with Chief Gum Shoes come on remember the show you watch the TV show no oh my God they had a cappella singers too it was a weird choice but they had them no big deal and then these kids ran around they tried to find them nobody it was like super rare that some kid actually caught Car San Diego but good on them so are you happy they're making a car or do you like what if that group made a new movie about well let's read about that I all I know is the headline let's read what's going A Cars San Diego animated series is in the works at Netflix with Gina Rodriguez attached to voice the title character for it has learned Rodriguez is best known for starring in the CW series Jane the Virgin for which she won a Golden Globe in 2015 she also I don't care just get back to the KC because she's Reed I don't care who she read the series will be based on the iconic educational computer game franchise that followed San Diego and she traveled across the world stealing National Treasure treasures it",
            "start": 2197.12
        },
        {
            "text": "care who she read the series will be based on the iconic educational computer game franchise that followed San Diego and she traveled across the world stealing National Treasure treasures. It will offer an intimate look into the character's path, where viewers will not only follow her escapades but also learn who in the world is Carmen Sandiego and why she became a super thief. The series is produced exactly what you always want I've always wondered what why does she steal the stuff why did this one trick pony become a superhero and I want to know what kind of hat she's going to wear are they going to really go for that big hat oh yeah of course can you pull a human a real human wear that car look at that collar is like an 8 inch collar no I mean Inspector Gadget couldn't wear all the gadgets he was made of but that's why it's cartoon San Diego will well I'm sorry San Diego was the main antagonist of several games including Where in the World is Carmen Sandiego, in addition she was",
            "start": 2235.12
        },
        {
            "text": "Carmen San Diego was the main antagonist of several games, including \"Where in the World is Carmen Sandiego?\" She was also featured in multiple books, a live-action TV game show, and an animated series called \"Where on Earth is Carmen Sandiego?\", which ran for 40 episodes between 1994 and 1998. Netflix has ordered 20 new 22-minute episodes. I'm excited that Carmen Sandiego's back; maybe we'll get another Carmen Sandiego game. That was always fun, using deductive reasoning to figure out where she was from. I remember one case where we found salt residue, and it was like, \"Well, where are they from?\" And it was like, \"I sent them to the icy tops of some mountain.\" Because I was like, \"Oh, the salt,\" and it was Salt Lake, no, it wasn't Salt Lake. You know, no, it was somewhere... there was something weird about mastodons or something going on.",
            "start": 2275.24
        },
        {
            "text": "Mountain cuz I was like oh the salt and it was Salt Lake no it wasn't Salt Lake, Utah - you know no it was somewhere I think we were there was there was like weird not mastodons something something going and that's why you know so much about Masons and Carmen Sandiego and her giant hat okay let me I'm going to try and care about Carmen Sandiego for a second Kevin hold on hold on Kevin can we get the one for Tim he's trying to he's trying to care about Carmen Sandiego oh God I it's hard for me I'm I think I'm a little bit too old but you were coming up at the same time you know what I mean you were making games at the same time with these people this is a thing I thought thought all these PC game devs like you guys would be sticking it out together, game dorks well they're trying to we were trying to rot their minds this is like someone was trying to help kids in okay that I understand yeah you're the candy company we're the big sugar the vegetable people get them the hell I'm sure it was a fine",
            "start": 2319.28
        },
        {
            "text": "rot their minds this is like someone was trying to help kids in okay that I understand yeah you're the candy company we're the big sugar the vegetable people get them the hell I'm sure it was a fine game uh for short story if Mavis Beacon got her own show I'd be excited I don't know Mavis Beacon she teaches typing H please God damn you Tim Schafer over at Gamespot Eddie says Alan Wake Quantum break Dev confirms new project code Nam p7 what's next for Allan Wake and Quantum break developer Remedy as part of its latest earning reports The Finnish Studio shared some further Insight including the confirmation of a new game project that is code named p7 that the game exists is all about all we know however Remedy did say that his goal for it is to release on a wider range of platforms which suggest it won't be limited to just one system uh Remedy also made this point uh that the Northlight game engine will support PlayStation 4 this engine was used to create Quantum break which was",
            "start": 2355.92
        },
        {
            "text": "suggest it won't be limited to just one system uh remedy also made this point uh that the Luminous Engine will support PlayStation 4 this engine was used to create Quantum Break which was exclusive to the Xbox and PC do you think that means Persona 7 no you think they're going to like merge like the Alan Wake and like they're going to skip Persona 6 take it over there it's going to take so long to make they'll make another Persona game but the timelines will be United no I don't think that's going to happen I like Alan Wake I like the in the DLC for it where you like the words yeah American Nightmare American Nightmare American Nightmare like it was kind of like like stuff you do in Psychonauts where it's kind of like psychic weird surreal things going on and you didn't play Quantum Break you were saying earlier it's on your pile I wasn't going to bring that up but I was going to throw it out there for you CU I sitting right next to my you have",
            "start": 2404.04
        },
        {
            "text": "on and you didn't play Quantum Break, you were saying earlier it's on your pile. I wasn't going to bring that up but I was going to throw it out there for you. CU, I'm sitting right next to my Xbox, you have to play it, you haven't played R, but you played Quantum Break, yeah that's right, weird. I'm just saying like you know, interesting choice. Well, you know this was like a mixture of like you know, Iceman and the guy from Game of Thrones, there's a superhero angle, like there's like that kind of thing. I really enjoyed about this versus Rhus Seraon is like Quantum Break head gameplay, you know what I mean? There was like I did the demo it, I'm on the airplane, yeah, yeah, yeah, it's an adventure game, yeah, like Full Throttle bringing it all around. All right, well Full Throttle we're going to play here in a little bit, play 30 minutes of get me some trophies, get me there, I should set that up probably huh, yeah you probably should. I mean you still got we still got lots of show left don't worry about it let me",
            "start": 2443.32
        },
        {
            "text": "bit play 30 minutes of get me some trophies get me there I should set that up probably huh yeah you probably should I mean you still got we still got lots of show left don't worry about it let me let me get through the last two stories Good get there's only one left we'll drag this out all right so then the final story comes from TV Line where Michael Aspinall says The Walking Dead promotes three actors to series regular ahead of season 8 uh you can see right there the characters we're here because our boy Steven Yuen who was just on the show Friday I thought he was going to bite it like he he was like they were going to go pick up those supplies I really thought dude come on what wait that spoil did I don't know man I just like shouting **** we're going to talk about Walking Dead but now he's regular yeah's he's not going to die he might die this next season I'm just saying it seemed like he was heading for like a violent well they're all see my whole thing with him is that he's too",
            "start": 2479.48
        },
        {
            "text": "regular yeah's he's not going to die he might die this next season I'm just saying it seemed like he was heading for like a violent well they're all see my whole thing with him is that he's too I think too popular too good at it you know what I mean like he is when they need somebody who can go and like rough up Rick Grimes and that can't be Negan every time so now you bring Negan there I do think he'll probably get killed this season during All Out War but maybe he won't maybe maybe you know they'll do everything that happens in the comics and then where we are in the comics right now he'll be part of that I'm not caught up in the comics that's why I'm being very vague okay this is my question that with the Saviors yeah this okay how long after the fall how how long after the zombie apocalypse it hasn't been that long right and these people are all like oh super weird they somehow forgotten how to speak English I want to talk about have you",
            "start": 2523.8
        },
        {
            "text": "after the zombie it hasn't been that long right and these people are all like oh super weird they somehow forgotten how to speak the English I want to talk with your man **** talking about have you been in the Wasteland for 50 years lady you worked at Target six months ago this is like the that's the way the generation after the last generation the last generation that has no recollection of humanity would talk maybe the time travelers maybe they came back to just oh no I I can't explain it or my thought was that maybe it was a bunch of like Dutch tourists it's not like they can't speak it's just that they don't speak English although Dutch probably all speak English some and they're and they got they were in America on a big tour bus and this is the bus and then thank you these are the zombies and then they got stuck in America yeah their guide was killed and they just were parked in the junkyard and then they just like I guess we don't know English the rough thing about The Walking Dead",
            "start": 2558.2
        },
        {
            "text": "and then they got stuck in America, yeah, their guide was killed, and they just were parked in the junkyard. And then they just like I guess we don't know English. The rough thing about The Walking Dead if you really want to sit there and like talk, you want to get in like go to the Reddit or whatever and like get in with the like super nerds where it's like the timeline is so much shorter 'cause like the show's been on for what now? Is it seven years? You know what I mean? Like you think in real time that's how long it's been going when in reality, like Rick's life has just been garbage week after week last season, like only two days long, something like that. Yeah, it was. I mean, like maybe not that, I I don't remember. It is that short but the comic's shorter you're saying no, the com the comic's gone on longer and they spoil they jump time in the comics they they make up time or whatever, but it's like the show has been very short and it's like is the amount of things that happen and change and",
            "start": 2597.92
        },
        {
            "text": "on longer and they spoilers they jump time in the comics they they make up time or whatever but it's like the show has been very short and it's like is the amount of things that happen and change and all these different things and like you're saying of like we're like oh well years in of course you're like the comics it's those scavengers are from a think come later no well no no no same thing I'm saying the timeline's garbage all around I'm just like I just don't know why they're so different and strange why not well there's a lot of they seen a lot of **** Tim Schafer you want to be the same guy over there you want to be **** cracking jokes left and I wouldn't be like I won't I will lay with your man do you mind you might be you never know you're not in that situation walk a mile in her shoes y there's a lot of that stuff in that show this is really weird for a TV show like the kind of thing you'd see in a comic or graphic novel yeah but then you're like oh in a comic in a graphic novel this would look totally normal",
            "start": 2633.56
        },
        {
            "text": "There's a lot of that stuff in that show. This is really weird for a TV show, like The Walking Dead, and stuff. Yeah, but then you're like, \"Oh, in a comic, in a graphic novel, this would look totally normal.\" Like, a tiger being like, \"Yeah, exactly.\" That's the whole thing when Nick and I talk about the show or whatever. Nick's just like, \"I don't like Negan; he's one note. He's got no...\" I'm like, \"Yeah, but like, he's based on a comic character that was like the same way.\" Now, granted, The Governor, they gave a lot of depth to for somebody who wasn't like fleshed out that much in the comics, but uh, it's like whatever. It is the thing of like, \"Yeah, there's a tiger that doesn't make any sense.\" How does Shiva know who to attack and who not to attack? Whatever, I'm not going to think too hard; she's got like one of those little Empire Strikes Back things around the back of her head, and he just commands her. Exactly that guy, but yeah, yeah, I mean those two guys, The Governor...",
            "start": 2671.76
        },
        {
            "text": "she's got like one of those little Empire Strikes Back things around the back of her head and he just commands her exactly that guy but yeah yeah I mean those those those two guys, The Governor and Negan, I both as soon as they were introduced I was like oh I don't want to watch a whole season of these guys just bullying people going around being horrible J and it's going to take so long to kill these guys yeah that's what I think every day at work too if you didn't know ladies and gentlemen this is the Kinda Funny Morning Show each and every weekday here on twitch.tv/ kindof funny games we come to you with the nerdy news you need to know about then we jump in the chat to ask your questions comments and concerns but in between those two segments I reach into the internet grab a video game and toss it to one of you how do you win the video game it's simple be in the chat like many of you are right now on twitch.tv/ kindof funnygames that means you're automatically entered to win for",
            "start": 2705.0
        },
        {
            "text": "and toss it to one of you, how do you win the video game? It's simple: be in the chat, like many of you are right now on twitch.tv/kindafunnygames. That means you're automatically entered to win for free and don't have to worry about anything. However, if you're one of the people who watch later on youtube.com/kindafunny or listen on podcast services around the globe, or just want three other ways to win, there are three other ways to win. Number one, you can subscribe to us here on Twitch; it gets you the Kinda Funny logo next to your name, cool emotes, private chat time with us, and you get to play multiplayer games with us like so many of you did April 28th when I beat the living **** out of Ziggy in Mario Kart. Yeah, you know what I'm saying; I'm putting you in the ground. $50 running on this twice? Why would anyone not subscribe to that? I don't know. Uh, and you get to show off your adree unless we bake them in. We're not baking them in today. Also, of course, if you have Amazon Prime",
            "start": 2742.08
        },
        {
            "text": "running on this twice why would anyone not subscribe to that I don't know uh and you get to show adree unless we bake them in we're not baking them in today also of course if you have Amazon Prime you have Twitch Prime which gives you one free sub every month you could just give it to us and take back that money Amazon's taken from you H you know what I mean Mayan I should do that think about how much money you've given Amazon this is your chance to take five bucks from them every month you got to do it every month you can't just let it you can't let it sit you give it once and then it'll roll over you got to do it again okay so that's what you do oh that's right the connection it's all it's all there now it's all there now or you can go to patreon.com kindof funny or patreon.com kindof funny games if you give us $2 or more you are automatically entered for every giveaway we gave away on Twitch and you get the bonus episodes like the one I'm going to do with Andy like the one I",
            "start": 2778.92
        },
        {
            "text": "funny games if you give us $2 or more you are automatically entered for every giveaway we gave away on Twitch and you get the bonus episodes like the one I'm going to do with Andy like the one I did with my dad today random number generator has decided already we're giving away Full Throttle on PC for all you PC dorks this is Full Throttle remastered PC dorks there's a lot of you guys it's been remastered we put a lot of work in it you know we we looked at it the timeline it took like a year and a half to remaster it it took a year and a half to make the first game and then we looked at the budget pretty much comparable this is going drum roll please this is going to patreon.com SL kind of funny supporter Stephen Hooker stepen Hooker really bam I've sent it off to you wow congratulations stepen hooker thank you for playing uh there's a lot of trophies in that game don't look up any hints on the internet if you just talk to all the characters you'll get all the hints you need is that",
            "start": 2813.36
        },
        {
            "text": "stephen hooker thank you for playing uh there's a lot of trophies in that game don't look up any hints on the internet if you just talk to all the characters you'll get all the hints you need is that true just me selling adventure games okay just in general every Adventure game yeah I appreciate that I appreciate talk to people you know we worked hard on that dialogue we wrote All That dialogue it doesn't always a long time like like here with you the words are just I've thought often that we need to sit here and like we could just we speak all the game dialogue right and then somebody else over there just writes Greg roach writes it all down like types it does all typ this all comes easy we do the writing they do the typing exactly exactly exactly that's the way you do it right that sounds a lot easier did you have to go through in full throttle and like fix any uh dated references like talking about like the Reagan Administration or something you want to well we always no those games",
            "start": 2860.64
        },
        {
            "text": "a lot easier did you have to go through in full throttle and like fix any uh dated references like talking about like the Reagan Administration or something you want to well we always know those games we always try to pretend they're in this other world like they we don't we don't reference like Harley-Davidson we talk about Corley Motors you know so all that stuff kind of holds up because you don't want to get sued though that also is a thing but one thing was funny because the thing the enemy of the the game the thing that was going to threaten their way of life is that Corley Motors is going to start making motorcycles and start making minivans yeah so it's just kind of like back then in the 90s minivans were like the epitome of like um suburb settling down I mean now I would love to have a minivan it'd be actually very convenient where would you park at San Francisco um I thinking we should get a minivan we should get a minivan yeah lunch and team van okay can we paint",
            "start": 2903.16
        },
        {
            "text": "to have a minivan, it would be actually very convenient. Where would you park in San Francisco? Um, I'm thinking we should get a minivan. We should get a minivan. Yeah, lunch and team van okay. Can we paint it funny blue and put the... Okay yeah yeah. It'd be like Ken Key. You guys just drive that bus around. Look it up, I guess. I will look up Ken Key, whatever. Let's jump into the tips. See what's happening over here. Uh, Drew Wizzle gave us a tip said \"just paying my birthday tax from Sunday.\" Tell Nick if he needs Bongos, I'm free anytime winky face. We will tell Nick that when he comes back from Austin. That's a tax tip yeah. When your birthday comes around you owe us money oh really yeah that's nice that's the way we do it here Kinda Funny so yeah uh Sushi girl Ally gave a tip and said \"finally played Broken Age a couple months ago and I loved it so much that I had to get the Platinum thanks for an amazing game Tim.\" On your uh Platinum, a lot of work yeah it is a lot of work. Did you put a goofy one's I",
            "start": 2942.08
        },
        {
            "text": "Age a couple months ago and I loved it so much that I had to get the Platinum thanks for an amazing game Tim Schafer on your uh Platinum a lot of work yeah it is a lot of work did you put a goofy one I remember your Grim Fandango one you don't like the tank controls yep the tank control one tanks for the Memories uh nothing that goofy in this I think there's a speedrun one maybe or there's but um thanks for playing awesome uh V is a boss heart and then sequel she puts a question mark oh I don't know doing a lot of I I think you know we got a lot of ideas yeah for other so now how do you now how do you deal with that being 2017 it's it you're I feel like you've lived this interesting timeline of game development where like you're saying you're at LucasArts all right they have a lot of money so make new IPs then you guys originally went out you started making new IPS for other companies but then like you're saying companies want to fund sequels then you got to that point where you're",
            "start": 2981.6
        },
        {
            "text": "so make new IPs then you guys originally went out, you started making new IPS for other companies, but then like you're saying companies want to fund sequels, then you got to that point where you're like I want to do an adventure game nobody will fund an adventure game, I'm going to do a Kickstarter thing and now you're double F which can do kind of whatever the hell it wants exactly so do you feel the pull now are you more towards where you were with LucasArts of like let's just keep making crazy **** and whatever we want to do or do you also feel the pangs of well we are a business and people want another Psychonauts we should go do that I mean I think you got to take that information is intended like if someone wants a sequel It's just this really flattering nice thing they're saying they like the thing you made in some ways and they want more and that's a great state to have someone be in when they finish one of your games but it doesn't mean necessarily that's exactly",
            "start": 3025.68
        },
        {
            "text": "saying they like the thing you made in some ways and they want more and that's a great state to have someone be in when they finish one of your games but it doesn't mean necessarily that's exactly the right they don't that might not that might not necessarily be exactly what they want they just they love that experience and they want to feel that again and and giving them something new might be the way to do that um but there's some games that we make seem more um uh I say uh Evergreen you know what what refers like periodic like like Costume Quest okay like every year that Halloween comes around you're kind of like feels like you could tell another chapter in The Adventure of those kids lives and it seemed like the kind of thing that makes sense to do like we did a sequel with that and where something like Grim Fandango seemed like we wrapped it up you know and it really like the story was done yeah the story felt like it was done and if we were going to go back to that world I feel",
            "start": 3061.24
        },
        {
            "text": "where something like God of War seemed like we wrapped it up, you know, and it really felt like the story was done. Yeah, the story felt like it was done, and if we were going to go back to that world, I feel like we'd almost need new characters to do that. But then you know, um, sometimes when you look at at sequels and movies and stuff, you're like, \"I wish this team had just gotten together and made something new.\" But those are hard to get funded, and so I think we're... but now we're doing not just one big game; we're doing multiple games. We can do both, so we're going to do some sequels like Psychonauts, not Stew, and some new stuff like Headlander, and mix it up. Headlander is really good; it's a good game. Yeah, thanks for playing uh C Foster 5 Greg have you changed your Wing recipe? I saw your post on Instagram hash cooking with Greg yesterday. Never had your wings really spicy, super spicy. Oh, it depends on the sauce to put on them. Yeah, I can make them super spicy if that's what you want. I'm just curious.",
            "start": 3097.2
        },
        {
            "text": "Greg Miller was cooking with him yesterday, never had his wings really spicy, super spicy. Oh, it depends on the sauce to put on them. Yeah, I can make them super spicy if that's what you want. I'm just curious about his barbecue wings; they're better. We barbecue here once a week. You should come over. What day do we change it up all the time? Tomorrow, I think. We're doing ribs tomorrow, but you'll be in Brazil. It'll be in Brazil, remember that? Yeah, yeah. But they say Brazilian meat's the best. They do say that. Brazilian... I'm sure you're going to taste a whole bunch of Brazilian meat every country I go to; they're like our beef is the best. Went to Argentina; they're like beef, Argentina's beef is actually the best. Though and they cut it; they cut it like um, it's more like Korean barbecue, like they cut it with the ri those little pieces of rib in every strip. Okay, okay. I would eat any of it. Okay, uh. They looked awesome. Still using Frank's Red Hot. They looked grilled or did you?",
            "start": 3133.16
        },
        {
            "text": "like they cut it with the ribs those little pieces of rib in every strip okay okay I I would eat any of it okay uh they looked awesome still using Frank's RedHot they looked grilled or did you just use less batter now love you guys uh yesterday I was lazy and so what I do when I'm lazy is yeah I don't do the whole egg wash uh bread you know what call yeah if I'm doing it right and there's a video you can see on the internet of this of course I what I do is I take the wings clean them cut them up and then I put them in the egg wash then I put them into you know flour panko mix with you know garlic and pepper and all sort of stuff kick them around then put them on a tray what I what I've been doing when i'm just lazy like I was last night cut them up uh roll them just in some uh that Joe's BBQ rub I have and then just bake them that way no batter at all and that's faster that way it was good it was delicious naked Wings you know what I mean not put anything on them well I still",
            "start": 3167.04
        },
        {
            "text": "barbecue rub I have and then just bake them that way no batter at all and that's faster that way it was good it was delicious naked Wings you know what I mean not put anything on them well I still use Frank's RedHot uh SoJO says Hey guys been a big fan for a while in fact you guys are what I aspire to be in the video game industry I just wanted to say thank you for giving me entertainment and information about the things I love no problem sorry Tim had to be here to Li you about superheroes today I'm I'm upset that we let him on I'm upset we gave him this platform for hate it's not what Kinda Funny's about Ignasios gave us a tip and said Greg are you so afraid of losing in Mario Kart 8 that you have to train so far in advance anyway I'm going to beat your ass and take the $50 also since there's an official penguin can I be the official Chilean now Ignasios this is not I am not betting you $50 all right I have a we're going to play April 28th everybody's welcome",
            "start": 3213.2
        },
        {
            "text": "$50 also since there's an official penguin can I be the official Chilean now Ignacio Roca this is not I am not betting you $50 all right I have a we're going to play April 28th everybody's welcome a big tournament yeah go sign up over on the forums you can play with us but it's the the $50 bet is me versus Zyger Zigger has put $50 on the line I also have a $50 bet with Shawn Pittz but he's betting on Zero that's the thing I'm there's no way for him to make money off this the CH no no Ignacio Roca he's just trying to get here we don't we don't we don't like Chile also Kevin's got this weird thing about Chans having the best meat in the world no their meat sucks that's what I've heard is there a big CH Chile Peru rivalry is that the thing is it all about soccer no they like took a big chunk of land after they beat us in a war no what year was that oh you got me bud long time ago like a 100 years ago yeah something like that never forget never forget exactly they gave a bunch of books back",
            "start": 3256.0
        },
        {
            "text": "land after they beat us in a war no what year was that o you got me bud long time ago like a 100 years ago yeah something like that never forget never forget exactly they gave a bunch of books back recently though from a library they stole Oh okay that's cool guess we had these checked out for a 100 years I don't know what the finds are but uh here they are Final Fantasy XIII comes from Waterman Chafing he says Brutal Legend any chance for a music related project in the future Chance of Brutal Legend and chances of Gang Beasts on switch tips have been called wow that's a multifaced question so would you ever want to do another music related game uh yeah that was awesome I mean what kind of music yeah Alter do Weezer game it's all about a sweater Yar Yar was about y was the prequel of the sweater um uh yeah I mean that was just that that was mostly about the metal and like the the uh yeah all about the metal you know in new Fortnite there was like four pitches that were for musical based",
            "start": 3302.84
        },
        {
            "text": "uh yeah I mean that was just that that was mostly about the metal and like the the uh yeah all about the metal you know in new Fortnite there was like four pitches that were for musical based there was like a straight-up musical a musical combat RPG and so there's like music in the air okay okay and then chances of a port for Brutal Legend that's all goofy right that's tied up with um we're trying to get it in the backwards compatibility at least for Xbox one so that's just got to go through this uh system that uh mystery of Black Box to us okay and then they say chances of Gang Beasts on switch I say zero you can't even get it on PlayStation 4 you've been trying forever I I got to play this thing PlaySta I know yeah this it's coming it's just like **** Nathan V with below it's coming eventually yeah when it's done developers you're all Duke Nukem in it okay here we go we have a story about how a game comes out it's got too many bugs in it everyone's mad yeah and then you have a story",
            "start": 3355.6
        },
        {
            "text": "yeah when it's done developers you're all Duke Nukem in it okay here we go we have a story about how a game comes out it's got too many bugs in it everyone's mad yeah and then you have a story about a game that when that game is going to come out which do you guys want do you want games to get done have be good and have no bugs or do you want games so you're saying when Gang Beasts comes out be no bugs in it at all well the whole game a game that's pretty much about bugs being goofy and weird when the developers feel like it's good enough for you that's when you want the game right okay okay not a minute before that's true uh time to jump in the chat we're going to do the old Mortal Kombat 3 and three Kevin Y where are we with BeepBoop is that happening today uh do you want to try to order it back to the audience on your phone is that that makes you look really smart like thinking about you want a burger they think you're up to something back there best in the world oh that's the one they have",
            "start": 3401.48
        },
        {
            "text": "to the audience on your phone is that that makes you look really smart like thinking about you want a burger they think you're up to something back there Best in the World oh that's the one they have their awesome sign yeah I'm getting really fascinated with this wall all of a sudden go keep on going on without me oh wow it's just dots man isn't that crazy it's full of dots it's all dots man I just want to fall into it and there's a little is that a little cross down there what are you trying to well yeah but that's just a picture we didn't we didn't insert the cross there's a cross I don't think there's one there I don't I don't think you know you know what I mean I don't think you know did you ever notice how much that uh that hotel looks like an Imperial Shuttle yeah right no I do see that I'm sorry everyone's knows that before Andy come over here and talk you got to you got to fill up some space here while I do the uh while I do the beep no I'll talk let's talk about R.U.B.I.S. of Run",
            "start": 3439.32
        },
        {
            "text": "that I'm sorry everyone knows that before Greg comes over here and talks, you've got to fill up some space here while I do the uh, while I do the beep. No, I'll talk. Let's talk about Rbus of Run the game, that too hard for Greg to finish; it's not too hard, it's just really challenging, and he did the virtual reality makes him scared - that's not true, makes him frightened. But I heard as well that is what I heard, yeah, he feels like he's going to get lost in that reality never come out, but it's a fun game; I've heard it's a fun game. Do you miss developing games? Do you miss game development? I do or is this easier to this easier - this is easier, yeah, but yeah, I'm definitely having fun right now, Andy, yeah, right, Andy. They have a good time here; they're barbecuing, you know. There's a severe lack of dogs here though; a lot of dogs over at Rooster Teeth, no, yeah, we don't believe in that stuff. Aren't you allergic? No, allergic to cats; we've got a lot of people who are like, \"Have dogs at home.\"",
            "start": 3483.88
        },
        {
            "text": "of dogs here though a lot of dogs over at Rooster Teeth, no, we don't believe in that stuff. Aren't you allergic? No, allergic to cats. We've got a lot of people who are like, \"Have dogs at the office, you'll kill that guy, you will kill that man, he'll die.\" Everyone thinks they're really cool, like, \"Dogs are such a fun place to work,\" unless you can't breathe. Yeah, that's true. Okay, sure. I feel like the ratio of people who have dog allergies to cat allergies is severely weighted towards cat allergy. I was looking into getting a cat for a brief period. You want a burger? Count me in. You count you in, be in. You want a double cheeseburger or just a cheeseburger? Just a cheeseburger, all right. Cool, I'm going to get that. So that means we're getting you the fourth pound burger here. What kind of cheese do you want? American, yeah. It's the only kind of cheese for me. Do you want bacon? You want onion, jalapenos? No, they have avocado, yeah. They got avocado, take avocado, California.",
            "start": 3522.84
        },
        {
            "text": "Here you what cheese you want American, yeah it's the only kind of cheese for you. You want some bacon? You want you want onion jalapenos? No, they have avocado, yeah they got avocado. Take avocado California St that's a premium ingredient. You want fries or anything? No, all right cool. Or as we like to call it, \"Avocado okay.\" Now here's what I'm going to give you very specific instructions right cuz you got to walk around. I get everybody's order okay do that when it's all done before you submit well I guess just bring it back to me and I'll screen cap it cuz sometimes the Postmates it beeps now they're all like oh it's too busy we can't take phone orders and so then it all gets deleted and we have to write. We'll do it all before we submit it so you go get everybody's order out there and you come on back. You can now you get a lot of money now now Mr Yas man 300 is keeping me honest which I appreciate Tim, yeah you've met Andy our newest hire, yeah you have not met Chad yet where's Chad? Chad of course",
            "start": 3561.56
        },
        {
            "text": "you can now get a lot of money now Mr. Yasman is keeping me honest which I appreciate Tim yeah you've met Andy our newest hire yeah you have not met Chad yet where's Chad? Chad, of course, he's the second newest hire. No, this is Piranha Plant puppet we got from ThinkGeek. All right, Chad. Now the thing about Chad is that everybody has a different voice for Chad, everybody does something different with Chad. So if you're on the show, you have to use Chad and give us a Chad voice. Oh, you know I have a history with puppets; it's not always worked out for me. Just stay away from any topical anything, be... oh look at that, I'm already uncomfortable. Do I can I read the news? Do we have pickles here? Can I read the news? Hell yeah! Why did he say it's so angry? What you got now sounds like Tom; we I was in give him to me kind of monstery no you don't like that name no that's good, you did it. No we like that, we like that no that's... I'm going to try not to move my mouth",
            "start": 3602.24
        },
        {
            "text": "in give him to me kind of monster, no you don't like that name, no that's good, you did it, no we like that, we like that, no that's I can't CL thank you, thank you, I'm going to try not to move my mouth, this is going to this is going to turn against me, I know this, like there's going to be an image taken of this, oh nobody watches this **** yeah Full Throttle is out today, I think that's the more important one to push, you take it off now, yeah you done, you did you did your homework thank you for that thank you just now you're being mean now you're shoving right in there yeah oh it's coming out the back yeah exactly there you go Chad lives up there now let's see what's happening in the chat um Ry dog V says Greg I loved your Periscope last night with py in the Bark Box showed my wife and we subbed our German Shepherd Boba Fett for a year be sure to collect your commission no commission anymore collected on bark boxes that deal ended a long time ago but they're awesome so thank you for supporting",
            "start": 3657.28
        },
        {
            "text": "German Shepherd Boba Fett for a year be sure to collect your commission no commission anymore collected on BarkBox, that deal ended a long time ago but they're awesome, so thank you for supporting them. I I subscribe just like you call HR see Kevin's HR we have to worry about it what's up see yeah yeah yeah oh Almighty kfish says Greg how's Guardians uh Guardians of the Galaxy uh episode one Telltale Game Andy you played it with me or you played on your own I did it's fine it's it was I I like I see the it's getting good scores and I'm just like I don't see that why that's happening um it was fine it enjoyable it was really hard that Star-Lord isn't Chris Pratt and he's doesn't look like any of the star like it's this weird vibe of trying to mesh with that character Scott Porter's performance is great you know what it reminds me of what's that when Jim Carrey did not voice The Mask and the animated show, that's it was like kind of feels knock offish yeah so it took a while to sink in",
            "start": 3705.24
        },
        {
            "text": "is great you know what it reminds me of what's that when Jim Carrey did not voice The Mask and the animated show that's it was like kind of feels knock offish yeah so it took a while to sink into it I think and like get comfortable with it it's it's telling an interesting story it started in a way I was like oh that's going to be like a dream sequence or something and no that's really what's happening okay cool and so it ended in a place that I'm like I'm interested to play more of it Nolan's great as uh Rocket Raccoon but yeah it was like I don't know for first impression I was like whatever you hard to please not really I'm the guy who's talking about how much I like all the superhero movies right like I'm not that bad I me uh ba yeah Bazza or Monk Tim which in Psychonauts was your favorite to develop which character in Psychonauts was your favorite which character in Psychonauts is my favorite to develop yeah uh I mean the the most fun I had writing in Psychonauts was those G-Men",
            "start": 3753.8
        },
        {
            "text": "to develop which character in Psychonauts was your favorite which character in Psychonauts is my favorite to develop yeah uh I mean the the most fun I had writing in Psychonauts was those G-Men, those G-Men who like I'm I work in the I work in the sewer that that you you could play the game after you finish Rhombus go back and play second cuz that was like I was supposed to the writing on the game was almost done and we were Eric WPA was writing dialogue and we were trying Eric write these G-Men and then he was too busy and he couldn't do it like a I have to write them it turned out to be my favorite writing and then it was like it was the best you never know you never know that's a good you never know what's going to happen yeah yeah G-Man are fun to write I got to get a rhubarb joke in there Adam Neely says First episodes are always weird to me for Telltale Games I'm going to wait till it's done and pick it up then smart way to do it I think that would have benefited uh me with Walking",
            "start": 3797.52
        },
        {
            "text": "Adam Neely says First episodes are always weird to me for Telltale Games I'm going to wait till it's done and pick it up then smart way to do it I think that would have benefited uh me with Walking Dead season 3 that's going on right now where episodes one and two came out I thought episode two ended with a really good Cliffhanger then episode three came out I I had a bugged version crashed my system a bunch of times got is that like with TV shows like I think I enjoy TV shows when I binge watch them more than when I wait every week sure because the pacing is so much more fast and yeah no you you do it at your leisure you can go through you just crush it all right I just want to make sure that they got my order right you just rote it you mean they I know okay only lettuce EXT extra toasted buns okay you're learning a lot about how to order H extra toasted buns what does that mean like real toasty oh I you know what I think you're going to get I think you're going to get another bun oh",
            "start": 3837.6
        },
        {
            "text": "buns okay you're learning a lot about how to order an extra toasted bun what does that mean like really toasty oh I you know what I think you're going to get I think you're going to get another bun oh an Extra Toasted Bun oh should I just put toasted buns like dude let's just move on we just I'm checking out we're doing with see what happens oh it's gone you had your chance now you live with it say dry dry what you mean like I don't want no oh no you're **** on that that's too late that's gone one block that direction right yeah I've always wanted to go there though cuz the sign is amazing it's like from the 1950s and it's and there's a McDonald's across the street yeah and like they're like we're not moving **** you yeah we'll see if it gets turned down which it probably will why would they turn you down cuz I think I think beeps now just goes now we're tooo busy we don't want to do that cuz there are a bunch of **** um if you want to do that we can then call it",
            "start": 3874.2
        },
        {
            "text": "will why would they turn you down cuz I think I think beeps now just goes now we're tooo busy we don't want to do that cuz there a bunch of **** um if you want to do that we can then call it in I screen capped it yeah all right it's been it's been picked up we'll see if it gets canceled that's usually what happens all right man why would they it's too busy I don't want to do it it's like the suit Nazi yeah pretty much anyway I'm going scrolling through the chat here you know what I mean stuff so we talked about Thrasher was goodless really really good mhm super cool throttles coming out Waterman chaing says Tim Schafer yeah what music you've been listening to recently uh what I've been listening to recently uh I always have the same Pandora heavy metal station on when I'm riding yeah it's like it plays a lot of like weird old metal and Manilla Road and stuff I'm going to go see Slayer at the Greek Auditorium June Slayer awesome and I went to the Damned reunion it that was funny to see",
            "start": 3921.4
        },
        {
            "text": "it plays a lot of like weird old metal and Manilla Road and stuff I'm going to go see Slayer at the Greek Theatre June Slayer awesome and I went to the Damned reunion it that was funny to see the Damned they're a band fig yeah I pied and um but they're like they were like seeing them it was like the audience here is is these are like most of these people are like 60s in the 60s but like punk rock 60s people who were super punk in the 60s and then the guys on the stage were like you know they're like 62 65 and they're still playing punk rock and it's weird to get old yeah I bet it is but it was a great show good show I just went and saw Vanessa Carlton she put on quite the performance I'll let you know uh SKC new the R Club or whatever your name is eating Shakespeare's Pizza right now it's so freaking good yes it is shout out to Columbia Missouri that's in Columbia Missouri oh okay uh Confucius says Tim I miss you then he puts a heart in",
            "start": 3966.08
        },
        {
            "text": "Right now it's so freaking good, yes it is. Shout out to Columbia, Missouri - is that a neighborhood? Pizza no, that's in Columbia, Missouri. Oh okay, uh Confucius says Tim, \"I miss you.\" Then he puts a heart in there. He says, \"Greetings from Norway.\" Oh yeah, we went to Norway last year. We met like a bunch of people from the Norwegian game I've seen - they're super friendly and nice. The Albion guys were there; the Kill Bright team - when's that coming out? Boy, boy, it's out now. Uh, yeah, like three months ago. Yeah, no way. Yeah, that's awesome. Yeah, they finally made it. What console, PC? Oh, that's why you don't know about it. They're beta testing it for us one day they'll come to the real units, the real consoles. Didn't it come out also on something else? We'll check that out. I don't think so. We miss you too, Norway. I got really hooked on uh eating salmon every day and aquavit - it's aq... it's like a liquor that only like Norwegian sailors drink. That's like a caraway seed, I think most.",
            "start": 4017.36
        },
        {
            "text": "so we miss you too Norway I got really hooked on uh eating salmon every day and aquavit it's aq it's like a liquor that only like Norwegian Sailors drink that's like a caraway seed I think most people like oh God it smells like medicine like a lot of like like I got really hooked on it not hooked on it I mean that's a serious I can't stop somebody help me I became a fan of it and um yeah Norway's love the country you like Norway still will you ever go back yeah I hope so okay I got to visit the church where my great-grandparents got married oh yeah sweet adorable yeah did they do you have any photos or anything for like no proof I have no proof up there just my family stories gotta gotta got family memories who fan W we're still looking good on the delivery so far so far so good Tim says any Tim any plans to work with Jack Black again oh uh he said he would be in second too really we just haven't figured out which character he would do but he's in the opening pitch video because he",
            "start": 4055.88
        },
        {
            "text": "any Tim any plans to work with Jack Black again oh uh he said he would be in second too really we just haven't figured out which character he would do but he's in the opening pitch video because he said he would uh nice okay I love an excuse to work with Jack he's really friendly really nice really creative guy likes to get in there and like improv and figure out what to do he seems Co I've always liked him from what I know I mean from you know as a as a consumer of movies yeah I've enjoyed his yeah yeah he's got like a theater background he's always into like improvising and and I don't know it's fun to work with creative people yeah Tenacious D you ever listen to that I do yeah a band he did did you know that he was in that what no oh my God I didn't know that didn't know I didn't know that loveely person uh Dr funder says Brutal Legend helped expand my love of metal as a teen and introduced me to a ton of bands I had not heard like Ang witch thanks for making a game like that",
            "start": 4110.96
        },
        {
            "text": "know that lovely person uh Dr. Funder says Brutal Legend helped expand my love of metal as a teen and introduced me to a ton of bands I had not heard like Angel Witch thanks for making a game like that that's awesome you know I learned about Angel Witch like I had the kind of metal that I knew about like New Wave of British Heavy Metal mostly and then that game uh Emily Ridgeway our music director found a whole bunch for because we had all those factions so we had to have a breath of and I got into I found out a lot about like Black Metal and a bunch of different um industrial stuff I didn't really know about and a bunch of old older stuff like Budgie which is almost like Proto metal anyway I learned a lot there was 107 songs in that I learned a ton about metal that I thought I already knew all about but um and hearing that someone else learned about it too is great that's awesome that's got to be one of the fun things make like that no no you can't kill metal never no the metal will live",
            "start": 4149.56
        },
        {
            "text": "about but um and hearing that someone else learned about it too is great that's awesome that's got to be one of the fun things make like that no no you can't kill metal never no the metal will live on metal forever it's tenacious D, Jack Black, oh okay Robert Ramirez 92 says hey Tim how was it meeting Lemmy from Motörhead? oh the lake R ly turn it was amazing he was like we were really intimidated but our publisher was a Vendetta at the time they had made a uh I think Scarface game that had Lee in it a character and they're like don't worry about it I've been in the studio with him just uh set up some Jack and Coke and Cheech and Chong and an ashtray and he'll come in he'll sit there to smoke and drink and then leave the mic on cuz when he's ready he'll just go and so we were like all right and we got the Jack and C and and he came in and he was friendly but he was he was kind of quiet and he just sat there and he made a drink he offered me a drink and he was like you took it right yeah he's",
            "start": 4188.52
        },
        {
            "text": "got the Jack and C and he came in and he was friendly but he was he was kind of quiet and he just sat there and he made a drink he offered me a drink and he was like you took it right yeah he's like you want a drink and I was like yeah get Jack Coke you want some water he goes I don't want water fish **** it like WC Fields kind of and um that was a terrible let me impression that's I was right there with you I was in the booth yeah I was right there with you so and he was we just started talking about stuff like he was really when I was explaining what Brutal Legend was and it's going to be this mix of like cards and also swords he's like he talked about Morrowind like you read any Morrowind like he does stuff like that and he goes I got a I got a Roman sword collection too I'm really into that kind of stuff you want if you want to see you can come by afterwards I was like okay I guess I'm going to Tim's house afterwards and then and then he started here's the script and he started doing",
            "start": 4233.64
        },
        {
            "text": "Kind of stuff you want if you want to see, you can come by afterwards. I was like, okay, I guess I'm going to Tim Schafer's house afterwards, and then...and then he started here's the script and he started doing the lines, normally like Jack would do, like eight takes of every line. Let me just did one; he liked it in his own voice, and uh...and then he was done. I was like, wow, wow, that was fast. He goes, yeah, I'm really fast, and then...uh...and then we went to his house afterwards. He brought us to his apartment, and that's where the story ends because I can't tell you what happened; no, it was uh...he went to his apartment, and he had a bunch of Flyers like rock show flyers everywhere, and he had a rack of guitars, uh...and a rack of his like outfits, his like military-looking outfits. He sews his own patches on everything, and that's awesome. And so the weird thing was...well, not not weird but...he was like Braveheart was playing; like we walked in, Braveheart was playing on TV, he's going nonstop.",
            "start": 4269.04
        },
        {
            "text": "own patches on everything and that's awesome and so the weird thing was well not not weird but he was like Braveheart was playing like we walked in braveart was playing on TV he's going nonstop and there was a bookshelf he had a bunch of Kinder Egg toys he has a collection of Kinder Egg toys okay and then in his bedroom Star Fox Assault was on a GameCube nice like he was a big Star Fox fan and he liked um Crimson Skies and other like flight combat games so he's that's what L was like and he's lovely lovely how long you hang out at his house for like half an hour he had to the driver who drove us there he's like I promised I guy some CDs so he's like sign some CDs downstairs he um he sat and chatted and he was he's just a lovely fellow did he talk about Triple H cuz you know he worked with Triple H in the WWE for a little bit that didn't come up cuz I don't know that's what I would ask whatever think I hate superheroes oh don't do this to me Schafer get vzy says Tim what is",
            "start": 4308.4
        },
        {
            "text": "worked Triple H in the WWE for a little bit, that didn't come up. Cuz I don't know, that's what I would ask. Whatever, think I hate superheroes. Oh, don't do this to me, Schafer, get vzy says Tim. What is the one thing you know now (non-financial) that you would tell your younger self about video game development? Like, what's the what's your advice to would about video games final? I think they because I always say I would buy real estate in San Francisco. Sure, yeah, okay. So I don't know. It's easy to look back and tell yourself not to worry about stuff cuz that's easy. Course, oh yeah, we didn't actually go out of business when PSN got cancelled. But um, so this is something I don't know if it's good advice or not. But I I kind of feel like I regret some of the crunch modes that I did. You know, like, when you're young and you're just like nervous about making the best thing you like, crunch, crunch, crunch, crunch. And um, looking back on it, there's this point of diminishing returns.",
            "start": 4348.72
        },
        {
            "text": "like, when you're young, and you're just nervous about making the best thing, and you have a lot of crunch time, and um, looking back on it, there's this point of diminishing returns where you're like, if you're past midnight, and 2 in the morning, you're not necessarily doing your best work, and then you're super sleepy, and your brain just goes away. I feel like I wonder if I could have done exactly the same amount of work, and just worked normal hours, and not had it impact my social life as much, and I don't know, so I think I uh maybe told myself that, but then what if that means I never would have gotten all the stuff done that I yeah, yeah. I had this recurring nightmare that I do go back in time, it's like the beginning of Grim Fandango, and I think on one hand, oh this is great, I know how to design this game, but I'm like what if I don't remember, what if I had to write rewrite all this dialogue from memory, and I just can't remember that's not what I",
            "start": 4392.84
        },
        {
            "text": "oh this is great I know how to design this game but I'm like what if I don't don't remember what if I had to write rewrite all this dialogue from memory and I just I can't remember that's not what I originally said that's not what it was supposed to be no I hear you on that ladies and gentlemen don't go anywhere we're about to do a full throttle stream but this has been the Kinda Funny Morning Show each and every weekday here on twitch.tv/kindafunnygames we come to you with the nerdy news you need to know about are we ending we're ending this part and then going into the stream but Kevin wanted a clear normal break for the morning this might be the end say bye you go get water well no you're staying for the stream you're not leaving yeah some people Subs I'm going yes that I'm the normal cut off I cut them off I didn't know if I take off your microphone and go fill your water I know you're thirsty go I'll wait till you go fill your water you want me to go fill your water I'll stick",
            "start": 4430.12
        },
        {
            "text": "cut off I cut them off I didn't know if I take off your microphone and go fill your water I know you're thirsty go I'll wait till you go fill your water you want me to go fill your water I'll stick here to the end of this thing cuz I want to say bye but then we need you for the next thing thanks for having me I got to read subs too there it's ending twitch.tv/kindafunnygames each and every week to hear on that thing you want ice you can also watch it later on youtube.com/kindafunny or listen to a podcast services around the globe you can give us money that's great if you do if you don't no big deal it's cool you you can win games free you can do it later we odor beeps a lot now I'm going to read subs and resubs Subs if I read your name you're sub or resub if I read a little message it means you have a little message when you resubbed starting with Jedi pyro so many good things have happened in the past 12 months here's to another 12 keep up the good work guys Smiley we will",
            "start": 4464.4
        },
        {
            "text": "it means you have a little message when you resubbed starting with Jedi pyro so many good things have happened in the past 12 months here's to another 12 keep up the good work guys Smiley we will uh is this where you want me to go no now you're just here now it's fine now it's just you ruined it it's fine you're here I was trying well see that's what I was trying to give you the out for just go just go meet you guys Mario one jonesing Simba so Jago free agent kind of funny for Life geek jump woot six months just started reading Invincible on number five liking it so far hash Greg was right it's gonna get even better Spyro beond bass monkey no well bass monkey or Bass monkey who knows 11 white crow 05 Scott dude son Dr funer Junior people my birthday was this past weekend on Easter but if there was any possibility can big Kev dog give me Bongos as late birthday gift hard KN on that one all right sorry uh Greggy 85 Real Talk Long Island sucks moving in North Carolina next month",
            "start": 4504.4
        },
        {
            "text": "but if there was any possibility can big Kev dog give me Bongos as late birthday gift hard KN on that one all right sorry uh Greg Miller 85 Real Talk Long Island sucks moving in North Carolina next month Chick-fil-A and cookout all day every day cookouts are amazing never gone that's one I was telling you about with those amazing milkshakes milkshakes uh Evanor s Tim Schafer is a penis taper I wish you was here to hear that one well say that one he can put in his next game new type 86 Tim should read the Boys by Garth Ennis that is a good one nothing but superhero trashing and keeping them in check keep up the good work guys Tim of course has bad taste so I'm sure he wouldn't like it Tri Keith 13 greeting Greg and sexy Tim Greg really looking forward to you beating Ziggler's ass on the 28th nothing gets me more excited than the thought of a little ethnically diverse boy getting his ass pounded by a large Pale Man see you in June unsexiest comedian it's always a pleasure Cameron Hunter kw17 Gabe Winter",
            "start": 4555.04
        },
        {
            "text": "more excited than the thought of a little ethnically diverse boy getting his ass pounded by a large Pale Man see you in June unsexiest comedian it's always a pleasure Cameron Hunter kw17 Gabe winter laser cool lasers are cool 19 they are just finished Kingdom Come and thought it was a fantastic look at Superman's flaws thanks for the suggestion Greg and keep **** that chicken best friends we will the Andy Prince says heart you Tim uh Tam Tran 48 light lightning hat uh I've been here longer than four months gosh darn it really wish that twitch Auto twitch new to Auto resub to you guys cuz you're the best love you all yep sucks remember of course twitch Prime users can't Auto renew you got to come and give it to us every time res 13 Steven male Spaceman spiff 0000 one month ago I sat in a bar and shared an old fashioned with Greg Miller thanks for coming all the way to Edmonton cheers hi Tim thank you for coming out Tim can hear you he knows you said hi JB joshb uh Fox big bad Beluga",
            "start": 4600.44
        },
        {
            "text": "Greg Miller thanks for coming all the way to Edmonton cheers hi Tim thank you for coming out Tim can hear you he knows you said hi JB Josh B. uh Fox big bad Beluga love to spend love to spend 26 plus plus months with this wonderful community Tim how much do you love Brutal Legend and can you share any updates on Psychonauts 2 well I think we've covered how much he loves Brutal Legend psychonaut 2 update we I'll try to get when he gets back here Kevin remind me of that uh okay Ricken Dragon Rican Dragon Empire chaotic Zephyr 7734 ow with antlers Michael dg1 W beams 76 4 months wo woohoo low Keen Tim I'm currently playing Grim Fandango remastered going for the Platinum but playing with tank controls is annoying as hell I already called him on that **** he's a son of a **** he doesn't respect the Platinum uh here it goes Campo 63 Mr. Tim Schafer I recently graduated with a degree in architecture but my passion has me wanting a game in video games",
            "start": 4651.68
        },
        {
            "text": "a son of a **** he doesn't respect the Platinum uh here it goes Campo 63 Mr Tim Schafer I recently graduated with a degree in architecture but my passion has me wanting a job in video games what can I do and I'll stress what type of jobs are for people with my degree in that field lot of questions I mean that's a weird one I don't think an architect is going to come over too handy but maybe building stuff yeah what if if Campo 63 had a degree in architecture how could he use that to make video games I mean build stuff in wireframes well actually a lot of their level designers come from architecture school there you go cuz when you study architecture you think it's going to be great and then you get out and you find out you're making like you're laying electrical in someone else's building now you're doing a lot less glamorous work often for um Mr. Schafer look made it look cool in games yeah they always make like oh I'm going to design buildings",
            "start": 4707.76
        },
        {
            "text": "electrical in someone else's building now you're doing a lot less glamorous work often for um Mr. Brady look made it look cool in Brady yeah they always make like oh I'm going to design buildings cool table the person who gets to design buildings is like the 80-year-old person whose name is on the company and then everyone else has to like put the bathrooms in a BART station or something and so but but so a lot of those architecture students go into games where they can make whole worlds and fantasy things and awesome things up there what was the game you asking about I'm coming back to that one okay big bad Beluga had a question for you while you were gone he said how much do you love Brutal Legend I think we've covered that you love it a lot I love R.  Legend and then can you share any updates on Psychonauts too oh we're working on an update okay uh working on Raz of psychic psychic new psychic powers adding some new psychic powers cool stuff we got a first um we got some first couple",
            "start": 4753.92
        },
        {
            "text": "on Psychonauts too oh we're working on an update okay uh working on Raz of psychic new psychic powers adding some new psychic powers cool stuff we got a first um we got some first couple mental worlds okay happening you're making a game over there now we don't know like we got you know we're transparent and everything like we're getting to the point where like we' be showing a lot of spoilers I'm trying to balance that out by just showing maybe some wire frames and white boxes sure that after that camera here while you work and then they can't see what you're working on but they you can be like oh that's a good one this is the kind of VIs the storying vision that I doesn't but they want to see that's the thing they want to see to they can see it when they get the little bit random says four months through Amazon Prime love it and love you Mr Schafer thank you a lot of people have been shouting you out saying hi they love you this stuff Sweet Love from the internet Tim",
            "start": 4789.04
        },
        {
            "text": "random says four months through Amazon Prime love it and love you Mr. Schafer thank you a lot of people have been shouting you out saying hi they love you this stuff Sweet Love from the internet Jay Goldman 91 uh Arville sinard is there any chance of a new Monkey Island game in the future somewhere uh well I mean that's a Disney property yeah as you know uh so it's it's not likely not likely unless like Ron wanted to do it and um you know crazy things have happened crazier things have happened yeah or we can do something new Ron's got a new game weed Park just came out last week you play play that nope it's with there I got a well you know I got the thing I got to start it soon lot of stuff lot a lot of stuff I kind of want to play on Console cuz you know you play on Xbox one yeah or yeah or just wait for PlayStation 4 one day probably uh Ry dog V says funneling that Amazon money to the best dudes on the internet also thanks Tim for sharing your awesomeness with the best friends today",
            "start": 4828.32
        },
        {
            "text": "or just wait for PlayStation 4 one day probably uh Ry dog V says funneling that Amazon money to the best dudes on the internet also thanks Tim Gettys for sharing your awesomeness with the best friends today that's awesome Stoke 636 Tim video game development studio video game development student from Michigan State here spring break 2018 the program will be heading out to SF to visit Studios any chance of visiting Double Fine expect a request from us soon awesome you should talk to our community manager or mail the info line info double fine or @DoubleFine at our Twitter account get their attention one of those ways just show up oh don't just show up it's all about timing I hear you sometimes people show up and just pour oil on them whoa is it hot sometimes they come in and we're really nice you never know you never know what kind of mood we're going to be in R oh no h t but we have students in all time RX 98 good to see Tim Gettys on the show on another note Greg any plans for Cooking with Greggy",
            "start": 4874.64
        },
        {
            "text": "know you never know what kind of mood we're going to be in. But we have Tim Schafer on the show today. On another note, Greg, any plans for Cooking with Greggy? We'd love to see one. Uh, I have nothing to announce at this time and I don't comment on rumor or speculation, sweet or ongoing investigations. Yeah, yeah. Conversation with a nerd. Oh no, that's one of these ones. Hold on, Kevin is a tiny font. No, it's the one... remember yesterday when there was the gibberish? No, and then but then you wanted real words in the middle of it. There's real words in the middle of it. No, I didn't say it's going to be super dirty with I see what the real words are. Mike Feser is a gaffe. Oh me Greg was a hidden message if you wanted to know. Oh is that how people hit on you apparently uh Commander Miloon whatever why did you read that whole thing cuz it's a fun little gag we",
            "start": 4917.88
        },
        {
            "text": "Greg was a hidden message if you wanted to know oh is that how people hit on you apparently uh Commander Miloon whatever why did you read that whole thing cuz it's a fun it's a fun little gag we do I used I used to subscribe to Kinda Funny using old Subway gift cards thanks for letting me know I can sub with Amazon Prime this is way easier all right Mel Morris MGear Leo Willie Badman random peanut only three more months winky emota that'll be nine months then we'll have our our Twitch baby uh Martin Green Master Exploder you are the final sub of the day now we're staying on of course to keep doing throttle to keep doing yeah to do some Full Throttle but real quick I want to this is one I wanted to call back another tip you missed while you're gone Evanor s tipped and said Tim Schafer penis taper is that a new nickname guess I don't know Schafer does that even rme does that really taste ladies and gentlemen this been the Kinda Funny Morning Show we're not going off the air we're",
            "start": 4973.84
        },
        {
            "text": "\"Penis Taper is that a new nickname? Guess I don't know Schafer does that even RME does that really taste ladies and gentlemen this has been the Kinda Funny Morning Show we're not going off the air we're going to stream Full Throttle here on Twitch.tv/KindaFunnyGames and in 2 minutes Latoya is delivering Burgers so we're going to eat those on the stream probably too uh if I don't tape it down it intimidates people all right you've been thinking about it you've been thinking about Penis Taping uh so yeah if you're watching on Twitch hang out for a second if you're watching on YouTube or listening on podcasts later thank you so much until tomorrow it's been our pleasure to serve you and so that's why I don't go to Georgia anymore got legally I I can go to one state nearby but are we 11 oh what's up everybody Welcome To Us streaming some Full Throttle here I spelled your name right right no I'm missing I'm missing I knew something I was missing nope Schafer like thin as a wafer oh okay right\"",
            "start": 5023.96
        },
        {
            "text": "up everybody Welcome To The Kinda Funny Morning Show streaming some Full Throttle here I spelled your name right right no I'm missing I'm missing I knew something I was missing nope Schafer like thin as a wafer oh okay right Tim Schafer hates superheroes kind of funny Morning Show Andy Jesus that's your Andy clickbait please make thumb clickbait it's funny no I Tim Sher is a super villain is what I'd like to I'm going to destroy all superheroes with this button no I don't like that as much that doesn't get as clicked I mean I can do it if you want hey Andy yeah would I just put in the request for a thumb from you cuz I your help making a thumb for this the morning show we just did the headline I gave you was Tim Schafer hates superheroes Tim would like Tim Schafer is a super villain no I would like do you want to have some fun with Photoshop and make t do a super villain all right cool then do that that sounds be more fun what did you Kevin",
            "start": 5110.88
        }
    ]
}