{
    "id": 3022,
    "video_id": "1__XzuD0OLk",
    "show_name": "Party Mode",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Greg is Annoyingly Great at Battlesloths 2025 - Party Mode",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1506528339,
    "duration": 1278,
    "transcript_chunks": [
        {
            "text": "What's up guys, welcome back to Party Mode. Today we're playing Battle Sloths. Battle Sloths 2025. When you made this guy the great Pizza Wars, what do you have to do with this game? I'd help test on it a bit. You do anything? The guy's an invisible collective. Phil worked closely with us because it's a Rooster Teeth published game. So when I was there, we helped test on it and we gave advice and stuff like that. Did they name the game after your Black Eyed Peas topic on GOG? Yeah. Yeah, it seemed a great if your lives you look there. They actually added your hair into the game. They did. Yeah, most pretentious. I think it's Tracer, but it kind of looks like mine. Really? Controller disconnected. A surprise PC gaming. My controller's still disconnecting. What's going on, guys? You demanded to use your own. You demanded to use the one you created. Um, I just, I was charging a living in your face, but the red is you haven't been like a race wagon, something red face room. What? Help someone help him mean the stakes.",
            "start": 3.8
        },
        {
            "text": "demanded to use the one you created. Um, I just, I was charging a living in your face, but the red is you haven't been like a race wagon, something red face room. What? Help someone help him mean the stakes with the PC gaming and choosing to come work here and lots of mistakes. Maybe. So Battle Sloths is essentially a couch co-op game, right? Very similar to TowerFall where your four Sloths on the screen and you're trying to battle out and get pizza back to your base. Let's Sloths move slow, but this turbo mode. Oh, these these Sloths are totally fair. Very. So whenever only if I kill you, Greg, you drop a pizza. I take it back to my base and my pizza number increases. So the way you played is like the first 15 slices collected. Okay, but there's times where you've killed a **** ton of people. You have like eight slices. You're going back, then you get killed. All those nine slices are now sure up for the taking of great for taking struggle. We play it once when we went down to a lot of fun. It's a lot of fun. It's got a",
            "start": 54.39
        },
        {
            "text": "you're going back, then you get killed. All those nine slices are now sure up for the taking of great for taking struggle. We play it once when we went down to a lot of fun. It's a lot of fun. It's got a great style. It's super fun. It's irreverent. We have 40. So the cool thing about this is that they have streams every once in a while where they just draw faces and hats for the game. Yeah, and there's like at least eighty five, eighty nine thousand hats or 48 million hats. Just go up that one fly anything. Let's say that. Let's play in the dogs area. All the Kinda Funny logos are pretty cool though. Pick up a lot of thematic. So like maybe it's prettier, you know, Kinda Funny Games for this. Good. Let's play. I might be, I might go Funhaus. Don't do Funhaus. There's a Gavin Free on the bottom. Make the right choice. Yeah, I'm gonna go Game Clock. I mean, I'll go Funhaus. I really like those guys a lot. I mean, I wish I could work for them. Cool. We're ready to go. Login. Cool. First of 15 slices. Now, are you",
            "start": 109.43
        },
        {
            "text": "choice. Yeah, I'm gonna go Game Clock. I mean, I'll go Funhaus. I really like those guys a lot. I mean, I wish I could work for them. Cool. We're ready to go. Login. Cool. First of 15 slices. Now, are you gonna let us get our sea legs here? You tested this game, of course. How are you coming in here? So here's what I'm most worried about. What did what are you most worried about? It make beating me because I have the most experience of this game and if Nick beats me, I will never live it down. Oh, turn hazards off. Okay, aim, hoverboard, shoot, interact, dodge roll. Yeah, there's a lot of buttons. Assam on the left. Oh, I think that's gonna sorry. You're so speaking to slices. You're just waiting for you all. Anybody wants to come get them. Don't you ****. God damn you, Kevin. Use your microphone, Kevin. No, I'm up on my keyboard. I can't do it. Is weird having use your microphone. I am using it. Should make sure I love very much. Kevin, you're good, guys. You **** break. It's my god. Hope for me. Oh **** yeah, big dogs.",
            "start": 157.6
        },
        {
            "text": "my keyboard. I can't do it. Is weird having use your microphone. I am using it. Should make sure I love very much. Kevin, you're good, guys. You **** break. It's my god. Hope for me. Oh **** yeah, big dogs rolled up here. Nick, I love to do do don't. That is a wife **** bag. No, left trigger. Because here's turbo. What is this thing I have? I said, oh, this ****. Oh my god, Nick's doing so good. **** revenge smells like even know why Nick's over here. It's so Nick's side. Why is there a devil thing right in my **** spot? Because that's yeah. **** no, Greg winning. **** Tim headed up, but no one great. No **** Tim. Tim, you're at zero. This is really sad. No, no, I cannot live. Holy ****. Why the bouncer? Wait, why am I in a stupid **** aisle with you? Got to come to see. That's how it. We need to turn the hazard off next time. I don't like hazardous **** **** you. They have low. The hazards are like a quicksand and **** like that. You know, different environment hazards came and you old Baba. Damn you, Greg.",
            "start": 218.6
        },
        {
            "text": "off next time. I don't like hazardous **** **** you. They have low. The hazards are like a quicksand and **** like that. You know, different environment hazards came and you old Baba. Damn you, Greg. The **** away from you since ****. Greg is one away from winning. Nancy, that's the game. Why it's so that's great, guys. This is fun game. I like it. At first I thought this was more Rooster Teeth ****, but this is good. The thing is, I thought Andy was really gonna give us some upfront money in there, but it just turns out he's the **** broke ass right now. Why did I got my own customized Xbox controller? No batteries in this crazy eyes man's got the left. It does. So I wanted to swim in them. Alright, so we'll do. We're gonna turn hazards off. Okay, let's **** that. Go somewhere else. Let's go. Oh yeah, let's go to Cyber. Oh yeah, Cyber's left this deck. That's fine. Okay, so remember, left trigger is your is your turbo. Sure, share hoverboard mode. **** you, Greg. I had a rock and grenades pop. What the ****",
            "start": 297.65
        },
        {
            "text": "go to Cyber. Oh yeah, Cyber's left this deck. That's fine. Okay, so remember, left trigger is your is your turbo. Sure, share hoverboard mode. **** you, Greg. I had a rock and grenades pop. What the **** did I just shoot? Ya boys. **** you, Sam. Yeah, great one. Oh **** you. Okay, we're Nick's gonna be okay. It's Nick's always inside of me. No. Oh no, that's a lot of sliced pizza. Yeah, Tim, that's what I'm talking about. See, little motivation gets against you. Andy, **** off. You guys, thank y'all for fun. We're done. No, Greg. Oh, I saw in the donker. No, Greg's right there for those slices. Oh, and he's gobbling up, gobbling up. I hate you, that monster. Oh **** **** **** Nick with a shotgun. Get the **** out of here. Oh, oh no, the side that I have shotgun. Oh no, **** that. God dammit. Go get Nick. **** god damn it. I can't get in there though. You're slices. Oh **** oh **** fudge my fat face. God a man last play that sure in. Yeah, Godzilla first. Yeah, fight over my ****. There goes a Nick right there.",
            "start": 367.39
        },
        {
            "text": "damn it. I can't get in there though. You're slices. Oh **** oh **** fudge my fat face. God a man last play that sure in. Yeah, Godzilla first. Yeah, fight over my ****. There goes a Nick right there. Janet, hump report seems hoverboard. You're right, you're right, Alex. Forget about the hoverboard in this side. Then Nick, I get want that shiner. What are you doing? She let me respawn in a pile. Greg, oh, there goes gravity. God damn it. I was trying to sneak up on y'all asses. Oh yeah, all right, there we go. The **** you're gonna spawn. Can't ****. Hey, don't do that to me. Okay, you know, no, I was like, you ****. Oh my god, ask. Oh my god. Oh yeah, you mean that O+D, manic. Eat it. Eat my **** pizza, bro. This is fun. Should we do teams now? Should we do? Yeah, let's do one more free-for-all. Okay, we'll do one more free-for-all and then you me. Yeah, cuz if we whatever. No, it cannot be Greg and I think that makes sense. Andy, we're gonna win. I don't want to meet teams anymore. I'll be I'll be",
            "start": 467.38
        },
        {
            "text": "Okay, we'll do one more free-for-all and then you me. Yeah, cuz if we whatever. No, it cannot be Greg and I think that makes sense. Andy, we're gonna win. I don't want to meet teams anymore. I'll be I'll be someone little closer to Home Brews cuz I know him a lot better. The thing is, I know Greg that you're really good at Battle Sloths because you've got a lot of experience, but I did not expect Andy to be this poor Sloth. Catacombs are wide open. Look at that. I don't like that. Oh, what a dangerous boy. Oh Jesus. What is right off your toxic ****. Oh Jesus. It's also ****. God damn you. There's a Game of Thrones. You run out of it though, Kevin. That's why it like whenever I'm not, it's because I've come out a lightsaber. This is chaos. God dammit. Dude, stop to tears. Go away, people. You're shopping. Oh **** Greg. **** Nick. Holy said. God, I mean, just a story to this and he's winning. I'm terrible. Oh my, I need my **** turbo to come back, man. It's gonna camp out here. Old Bruce Green. Oh cheese. God dammit.",
            "start": 584.79
        },
        {
            "text": "Nick. Holy said. God, I mean, just a story to this and he's winning. I'm terrible. Oh my, I need my **** turbo to come back, man. It's gonna camp out here. Old Bruce Green. Oh cheese. God dammit. Greg was one little peashooter. **** much thought takes me. This is so much pizza. Oh ****. God **** our walk. Dammit. Anyway, I'm doing pretty good, Kevin. I'm very confident. Oh, I gotta move this stupid turbo back to a better time. Yeah, what's this far as Andy, the one is winning. I just tied it, but no. I blame you. Stop by. I had the **** thing on slices and a rocket hit me. Sorry. I was terrible that round. Alright, we're doing teams. Doing the Green Team. TSP, Danny, go intro. Yeah, and showy. Mm-hmm. Here we go. Trying to fill any time you're not one guy. What's important thing about this is remember, Oh, scream gang of lag, guys. I do a sweep and I'll let them live. Yeah, if you wanna swing, you'll never live this nap. I fight. You know that we are the two reigning champions have cut exactly. So we're",
            "start": 654.8
        },
        {
            "text": "Oh, scream gang of lag, guys. I do a sweep and I'll let them live. Yeah, if you wanna swing, you'll never live this nap. I fight. You know that we are the two reigning champions have cut exactly. So we're going to the Mutant Sewers. Hazards off. Alright, I use my team and show you how to use a goldfish. I know. Oh, I killed myself. Oh **** **** no. Oh god, this is very off to a bad start, guy. Oh yeah, I got your back to my got. Thank you, thank you. Yeah, sorry, but he's still got my slice. Whoa, she's **** back. But I think if Howser Durrani would focus on ****, they got a bunch. Stay there. No, I died. Can't come up on it blank. If I can play. Okay, the slices. Tim, goddamn it. No, no, I'm getting ****. Oh, get a break. Yeah, give that pan. Get that maggot. I'll take it in there. You got some slices. We got some slices. Are they were almost a double digits? They almost are. Oh ****. I got we gotta stop going in there. I keep going over there. You write that. Let me get him. Oh, he's dead. That's over. What? How did I die? We ran to",
            "start": 763.67
        },
        {
            "text": "were almost a double digits. They almost are. Oh ****. I got we gotta stop going in there. I keep going over there. You write that. Let me get him. Oh, he's dead. That's over. What? How did I die? We ran to their base. Oh my, kills me. Yeah, **** plague. Oh **** Nick. It sucks when I get you, right, Andy? Greg has like skill. I just like working out like a nasty **** ****. Ah, damn it. Don't keep coming up, Nick. It's my. Oh god, I don't like this one bit. I want this short range **** in this shotgun. You know, one shut up. Oh my gosh, I got to start at the hazard. It'd kill me. You took your own slice back. **** **** yourself. No, I'm running away. ****. Yeah, yeah. So what's also sort, you guys, there's a logic run, right, Nick? There one slice away. What the **** is that? Oh my god, that was a Sloth's bullet. ****. Go to the market. Yes, the Pac-Man Road. The ruining man. We're gonna do one match. Uh-huh. There's a ten rematch. We'll do a rematch. Show the silver rematch. I'm gonna grab ads and I want those blackberries. We",
            "start": 851.96
        },
        {
            "text": "to the market. Yes, the Pac-Man Road. The ruining man. We're gonna do one match. Uh-huh. There's a ten rematch. We'll do a rematch. Show the silver rematch. I'm gonna grab ads and I want those blackberries. We need those blackberries. I go low, go low. I'm staying long. You just, you just evaporated meat. Go get it, go get it. He didn't have shitty enough ****. No. Oh God, they got my slice. Cody, no. I'm out of **** ****. I'm not a **** weapons. Yeah, get that thing's a bad. Get that nice that back. That pretty appears that. But how long I was gonna like bounce around? Sure, sure, sure. So I'm saying, you know, he's cheating using the fair stuff. He knows so much other ****. Oh god, how did not one of those hit you? The arrow would not touch him. Ernest goes to camp. Duh. ****. I got a bow and arrow, dude. Hey **** ****. You think that roll, man? A nasty roll. Oh Jesus Christ. No, I ran right into the **** trap. **** goddammit. Granulomas. I'm doing nothing this round and I'm sorry. They're beat their asses.",
            "start": 936.16
        },
        {
            "text": "Let's keep. We gotta conserve energy here. The pizza. You're gonna wait for the line. One more. No, you're not. You can't. I'm bringing out the big guns right now. Bring them out or not the big guns in the game issue. Yeah. Oh great. Yeah, bring out the big guns, guys. Winner feels like you don't tell the truth. It's the worst when I win, right? It's the word. Uh-oh, you know what **** it. We need them. I'm saying, I know these has it that right. Sorry. Goddammit. Okay, I did not realize what kind of what I could not have you had. Okay, we got one without one of the bag. Tim, one of the back over there doing the bush. You know they say what kind of bushes. Oh, how does it? How it's a goddamn crank. So I love the same **** this. Okay, I'm good. Oh, here we go. Let's go. Do you guys know? Let's go in.",
            "start": 1016.31
        },
        {
            "text": "there doing the bush. You know they say what kind of bushes. Oh, how does it? How it's a goddamn crank. So I love the same **** this. Okay, I'm good. Oh, here we go. Let's go. Do you guys know? Let's go in this back there. Fishing is back. I don't like that. Stay this day. I feel swears. No reason to run. Oh, I have a gun. I'll shoot enough blocking. He's eating our **** lunch right now, bro. Yeah, yeah. Oh yeah, lose the weight here. There's no reason to get flanked. Damn it. Oh **** oh ****. Well, as you know, no, no ****. Oh man, don't play with **** the hazard on those videos. Pizza slices. Yeah, we got here missile slices. Oh **** that's **** now. Some national ****. See this Cheeto. Another great Party Mode, guys. There's great pilot available. Barry, great episode. Sidebar. Toi, party on. Oh my good man. Yeah, oh yeah, great day, dude. What a great day this was.",
            "start": 1178.78
        }
    ]
}