{
    "id": 3018,
    "video_id": "2IZ9CKgaFg0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Defines \"Cool\"? - The GameOverGreggy Show Ep. 199 (Pt. 1)",
    "description": "Thanks to Blue Apron for sponsoring this episode. Go to https://blueapron.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1506322800,
    "duration": 1760,
    "transcript_chunks": [
        {
            "text": "You seen that Cooking with Greggy Show I'm doing on YouTube, it's great. Well, you know what helped me learn to cook? Blue Apron. They're our sponsor this week and they are honestly great. Blue Apron's mission is to make incredible home cooking accessible to everyone, just like living with Greggy. You sign up, pick your meals, and Blue Apron delivers pre-portioned ingredients alongside easy-to-use instructions. You assemble the meal, learn to cook, and you look good doing it. Don't believe me? Well, go to hell. This really worked for me. I'm not lying. Upcoming menu items include summer vegetable and egg paninis with Callum Brian's chili. I don't know, that's our crazy chili. Have you ever heard of that chili, Kevin? Me neither. Mayonnaise and Caprese salad, soy glazed pork and rice cakes with bok choy and marinated green beans and garlic butter shrimp with corn and green bean salad and roasted purple tomatoes. Blue Apron knows you're busy, so now they're offering 30-minute meals. These meals are made with the",
            "start": 0.0
        },
        {
            "text": "green beans and garlic butter shrimp with corn and green bean salad and roasted purple tomatoes. Blue Apron knows you're busy, so now they're offering 30-minute meals. These meals are made with the same flavor and farm-fresh ingredients you know and love and are ready in 30 minutes or less. Check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Greggy. That's BlueApron.com/Greggy. Blue Apron, a better way to cook. What else can eat a shoe? Don't make me yell at you again. Really makes me mad. I know, I was making sure. What's up, everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. Why are you in the nice shirt? Because we did those school photos. Oh, you mean the Patreon.com/KindaFunny fan mail tier for the month of September? And here's what happened. I put the shirt on. I was like, oh, this show actually looks pretty good on me today. And",
            "start": 44.07
        },
        {
            "text": "oh, you mean the Patreon.com/KindaFunny fan mail tier for the month of September? And here's what happened. I put the shirt on. I was like, oh, this show actually looks pretty good on me today. And then I remembered someone in the Twitch chat earlier today said the gray shirt that I was wearing maybe it was too big and I look stupid. You did. Yes, the morning show said you're not. We are in a Jackman-off. You need to show the guns. You need to see what's going to look at the definition you've got going on right here in the veins in your hand. Have you asked Hugh Jackman to have a muscle competition? No, my mind, my soul for the Jackman-off is just between myself and Darren Brazil. The Jackman, yeah, when she was short enough with all the Jackman called the Jackman-off. Is that when we're in a hurry, we call it a Jackman-off. Whichever one of us looks better, more like Hugh Jackman, we might want to get you Hugh Jackman in as you judge this competition. Every tweet of Hugh Jackman. What about a Hugh Jackman",
            "start": 102.26
        },
        {
            "text": "called a Jackman-off. Whichever one of us looks better, more like Hugh Jackman, we might want to get you Hugh Jackman in as you judge this competition. Every tweet of Hugh Jackman. What about a Hugh Jackman look-alike? If you have a Hugh Jackman look, what I've got. Oh, I've got a whole person named Hugh. Yeah, or someone with muscles and a beard over there. The pure one, handsome. Yes, let's see. Most, that is my favorite Nick Scarpino shirt you debuted at Kinda Funny Live. I don't know my damn thing. You do look good more. And this is Kinda Funny Live 050. Now it's confusing. So 199, but then I got posted on Patreon as 00. And but that was, it wasn't even live yet. And they're figuring that a lot over there. So don't worry about over here making her GameOverGreggy Show debut, Sloane Earl. Now a lot of times people come on this show, Sloane, they got something to promote. They're here to do this thing. They want people to go check out this thing. Yours here 'cause you're awesome. I also want one of those things now.",
            "start": 140.57
        },
        {
            "text": "come on this show, Sloane, they got something to promote. They're here to do this thing. They want people to go check out this thing. Yours here 'cause you're awesome. I also want one of those things now though. What, a motorcycle related? You want to pimp me something? I want to pimp. Can I pimp it right now? Sure, 'cause it just, well, I mean, remember, I think this is going to come into play. Nick, stop it. Let's, you can pimp it right now. Wait for the pimping. Okay, I'm just here to have fun. Yeah, just happens to come. Let's just say we met. I met you through young, fresh Canadian woman named John. We have St. Paul. And I met you and I was like, you need to come, you need to come regale us with stories. I'd love to do our fascinating, interesting person. Thank you. I call you the well. Yeah, because you're deep and you got things in there and I like to take my bucket and just put it down, come up a clown, maybe some fresh water. Exactly. Yeah, gentlemen, this is The GameOverGreggy Show each and every week, four, sometimes five, best",
            "start": 192.02
        },
        {
            "text": "in there and I like to take my bucket and just put it down, come up a clown, maybe some fresh water. Exactly. Yeah, gentlemen, this is The GameOverGreggy Show each and every week, four, sometimes five best friends gather on this table, each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can get each and every episode early. How early, Nick? So like right now, you'll be watching it right now with us, possibly still not sure if the live stream is working over there. Usually you can watch it live as we record it or you pick it up Friday as an MP3 or video. If you don't do any of that, you have no bucks to toss our way, no big deal. Head over to YouTube.com/KindaFunny where you get the entire show broken up topic by topic, day by day until it goes up as one big video and MP3 the following Friday. Gentlemen and Sloane, make sure you understand you're represented here. Yeah, last night, yeah, I went to a little show called Monday",
            "start": 227.8
        },
        {
            "text": "day by day until it goes up as one big video and MP3 the following Friday. Gentlemen and Sloane, make sure you understand you're represented here. Yeah, last night, yeah, I went to a little show called Monday Night Raw, WWE Monday Night Raw. I believe the longest-running television program of all time or some garbage like that. Live of a play, something like that is better. And I was there with Cool Greg. I was there with Kevin. I was there with James Burke. James Burke, I'll tell you right now, in terms of the people I like, he's always rising on the list. Every time I hang out with this kid, I'm like, he's a young prospect, he's an upstart. I'm the cool kid list that Greg knows. He's been on the show. He's been on the wrestling streams before. I mean, he's not your like a McDonald's All-American. Greg, you just came on your sinking threes and I'm like, get out, get up here, get on the show. James Burke's out there in Double-A, Triple-A. He's working out the kinks, doing all these different things. He's trying to prove",
            "start": 272.41
        },
        {
            "text": "on your sinking threes and I'm like, get out, get up here, get on the show. James Burke's out there in Double-A, Triple-A. He's working out the kinks, doing all these different things. He's trying to prove something. The scouts are telling them, Sloane, you're too old, give it up. You can't get on the list. And he's like, no, I'm going to do, I'm going to eat wings and drink beer and I want to impress Greg. And he's doing great things. I digress. I'm driving home from the wrestling competition. The whole thing was very nostalgic for me. That's Raw. What way growing up, I was a huge wrestling fan, right? So like I did the normal, you know, little boy thing where you watch wrestling in his home in the warrior and you're into it, you love it, it's great. Your parents take you and you're all wide-eyed watching Undertaker fight Undertaker. It's amazing in your face. Exactly. Yeah, just really tight tights, really making you understand. Yeah, and then in high school was when the Attitude Era hit and Stone Cold, The Rock and all that",
            "start": 319.21
        },
        {
            "text": "Undertaker. It's amazing in your face. Exactly. Yeah, just really tight tights, really making you understand. Yeah, and then in high school was when the Attitude Era hit and Stone Cold, The Rock and all that stuff. And it brought people back in and it was like, hey, we're going to make references to sex on TV. And so all, you know, these high school boys are like, we're watching this. We want to know what's going on. What's happening over there? Are you finally changing our chair? Are you finally changing other chair? Some, they're alive. I come back. I'm enjoying it. I'm enjoying this wrestling competition. I'm having fun. We leave and I'm driving and I'm flooded with all this meant more like I was at the show being like, man, I haven't been to a WWE TV show in a while. I'm seeing it right there at great seat. So reminded me of SummerSlam '94 with my folks. Yeah, exactly. SummerSlam in LA. At one time I went with Jose. I digress. But I get in the car and I'm driving home and I'm thinking back on all",
            "start": 354.7
        },
        {
            "text": "seat. So reminded me of SummerSlam '94 with my folks. Yeah, exactly. SummerSlam in LA. At one time I went with Jose. I digress. But I get in the car and I'm driving home and I'm thinking back on all this and I'm going back through this. And I'm like, I wonder what it would be like to be able to have those touchdowns to go back and talk to myself in high school, to go back and talk to myself as a kid watching this thing. Then I play around, you know, I always want it stories all this time how I'd really like to figure out how to break time travel in a way that pretty sure you would break the time continuum. Well, see, that's what this is where the hang-up is. And I haven't figured it out because anybody can time travel backwards, but you're, you don't want to throw it off. What I'm trying to figure out is how can I get Benjamin Franklin right before he dies, but not worries like sick and he's about to die. Pause him. I just want to talk to him and show him the iPhone stuff. And up next, look at all this",
            "start": 397.51
        },
        {
            "text": "is how can I get Benjamin Franklin right before he dies, but not worries like sick and he's about to die. Pause him. I just want to talk to him and show him the iPhone stuff. And up next, look at all this technology we have, Sloane. You know what I mean? The Benjamin Franklin. Yeah, and I'll sing about it myself. And then I started thinking about, would young Greg think that I'm cool? Would this be a thing? So my question, my topic is to all of you, are you cool? Are you cool, Tim, Greg? I'm not cool. I think those are two very different questions though. Would young Tim think old Tim is cool? Absolutely. But, but I'm not cool. Those, that's different. See, I don't, I don't agree. In the general public, you might not because I'm just definitely not. I've seen people that are similar to me. Yeah, but they're cool. No, I'm not. Then so he wearing a barrage. I know, right? That's cool. Yeah, that's life. Maybe the outside's cool, not the inside. I don't know. You know the inside. I meant something. The jacket he's wearing, it's decided. Oh, I",
            "start": 433.87
        },
        {
            "text": "so he wearing a barrage. I know, right? That's cool. Yeah, that's life. Maybe the outside's cool, not the inside. I don't know. You know the inside. I meant something. The jacket he's wearing, it's decided. Oh, I don't agree with that at all. Sloane, are you cool? Yeah, yeah, yeah, yeah, you're cool. Thanks. Like I just **** Austin's. I saw your helmet. I'm like, well, she got here two very, it's a helmet I wear all the time depending on dates. It has a brace in it. Yeah, oh, my mouth. Yeah, no, it's a helmet for motorcycles. Oh, yeah, exactly. Also, I think, and the more I thought about it last night, I'm cool. I think I'm cool. Like I'm a dork, but I'm cool. So we'll get to that in a second. You're not. Nick, are you, are you cool? I have, wait, which part of mine? I am I a dork or cool? Let's go back. Cool. God damn it. Greg Miller is not cool. What? I'm sorry. Do you know how many platinum trophies I have? Do you know my PSN level? It's cool. Oh, that's actually cool. I actually legitimately, I think I have moments of coolness. Yeah, I don't think I",
            "start": 481.99
        },
        {
            "text": "what? I'm sorry. Do you know how many platinum trophies I have? Do you know my PSN level? It's cool. Oh, that's actually cool. I actually legitimately, I think I have moments of coolness. Yeah, I don't think I walk around cool. Cool Greg is cool. Cool Greg, give me a walkthrough. Just this behind. Just give you a walkthrough the ring. This is a cool man who is cool at all times. Cool Greg and Sloane are in the same bucket. Cool at all times. That's just cool, guys. Different types of cool. Yeah, look at one like he's very similar to cool. Yes, Nick is cool. You think that's cool? Okay, the thing is, Nick, there are moments, I don't say a lot of moments where I'm like, what if I had to decide, isn't it cool or not? I think at the end of the day, I'd probably still say no. But lasting, but, but I think we all think we're cool 'cause we're all nerds, right? No, it's not. That's the thing is that I think going back and talking to Greg in high school and even then I was like, why not in high school? Yes, and I squad my friends and I was",
            "start": 531.68
        },
        {
            "text": "we're all nerds, right? No, it's not. That's the thing is that I think going back and talking to Greg in high school and even then I was like, why not in high school? Yes, and I squad my friends and I was funny and you know, anything. But like, I wasn't like cool. I was that cool. No. What were you? And I dressed as Pikachu, not on Halloween. And I still know. I want to hear all about this. That's how you get my donation. I was total dork. Oh, so is that the thing is that we just came into our own because I was a big dork. Everybody who's cool now was not cool in high school. That is, I think that's a very, you know, there's a lot of data for that and science. Benjamin Franklin would agree. Sure, of course. That he when you definitely found this, did you love it? I think that's part of it though. Why you're you. I think I'm a dork and I am a dork now, but dorks are cool now, right? We won. The nerds have inherited the earth. The dorks think it's acceptable. Cool is not the word. What do you think cool? Cool. You need to think",
            "start": 591.11
        },
        {
            "text": "a dork and I am a dork now, but dorks are cool now, right? We won. The nerds have inherited the earth. The dorks think it's acceptable. Cool is not the word. What do you think cool? Cool. You need to think what is cool and then totally relatively cool kids in high school peaked in high school. I say, I mean, I probably, I don't know. I think like, I don't know any that we got to talk to him anymore, right? I think every time you see a picture of Steve McQueen, you're like, cut, he's so cool. **** what was he like in high school though? He's probably cool. Yeah, so if I say right now, who's cool? You a blank slate. Who are you going to say? Who's a person right now alive, cool? Huh? We have a friend named Tybee Diskin. Her Instagram, he just clearly made her Instagram is HelloTybeearin. I mean, everything she's ever done or said to me, every picture I've ever seen of her, she's like, **** you're so cool. Yeah, but that's curated cool. That's Internet curating cool with her, which doesn't mean she's not going to know she's cool. She's",
            "start": 648.31
        },
        {
            "text": "or said to me, every picture I've ever seen of her, she's like, **** you're so cool. Yeah, but that's curated cool. That's Internet curating cool with her, which doesn't mean she's not going to know she's cool. She's cool. She's always cool. She watch everything. If she's watching, she's cool. Exactly, exactly, exactly. I think you guys like, look, I feel like a Michael Fassbender is cool. You know, he's cool on film. Exactly. Is he cool or does he play cool people? I think he plays cool people. Bond. I don't know at all. Fonzie. Well, no, see, that's the, there you go. Well, the fictional character of Fonzie is cool. Henry Winkler is a lovable dork, not cool at all. What about Arrested Development? Are you all well versed? Yeah, oh, not cool. Michael Cera as George Michael. Yeah, not cool. Not cool at all. But like Michael Cera seems like he's cool sometimes, but he's not. He's terrible dork, but he's kind of cool. How do you engage them? No, Michael Cera is not cool. The Rock is by definition. Got too close to your nose. I think Michael Cera",
            "start": 713.86
        },
        {
            "text": "cool sometimes, but he's not. He's terrible dork, but he's kind of cool. How do you engage them? No, Michael Cera is not cool. The Rock is by definition. Got too close to your nose. I think Michael Cera is cool. I'm just asking in real life. Yeah, like people think it's cool 'cause he's such a dork. I'm realizing with this in real life, I'll say I have Jonah Hill cool. Why in real life? 'Cause he's like a chubby dude who probably smokes weed all the time. Yeah, yeah, he's like, I remember I watched some interview with him where somebody asked a really dumb question of like, how do you, it was something effective like, oh, after you lost the weight and they were like, so not, is it hard for you? You've always been the fat guy in Hollywood and now you're not the fat guy. He listen, let the first question discussed. We also have any non stupid question. And I know that there's some rock to throw Jonah Hill. I forget where he did something where he got in a fight with somebody and called them harder or something to that",
            "start": 767.41
        },
        {
            "text": "have any non stupid question. And I know that there's some rock to throw Jonah Hill. I forget where he did something where he got in a fight with somebody and called them harder or something to that effect. Anybody apologize for after the fact. But he calls me a **** or something like that. You know what I mean? But I, is that what it was? It was selling fast. Yeah, exactly. That's the whole thing. Every stupid. I think we're all cool. I'm just going to, no one's cool. What? Where I said the four of us, it was not the Royal we. It's just us. You meet people in life where you're, where you look at them and you're like, this person has sort of like an effortless like cool. It's about them, you know? And then you see a bunch of your friend. I guess. Yeah, you can start to break that down with anyone, especially with the celebrities. We go over on-camera. Like, yeah, there is a cultivated, like curated coolness to the series. Like you're not allowing someone to take a picture of you while you're taking a **** on Instagram",
            "start": 816.28
        },
        {
            "text": "we go over on-camera. Like, yeah, there is a cultivated, like curated coolness to the series. Like you're not allowing someone to take a picture of you while you're taking a **** on Instagram or something like that. Well, why go back to would you like me like you like? And your Instagram photos are the ones that are curated. Other ones look cool. It's like, I follow you on that screen. Hi, Dik Pix. Right? Yep. How you spell that? It's me. It's D-I-K P-I-X. Yes, that'll be what's up. She's a reporter. It's fantastic. Yeah, no, don't put yourself on a corner. But like, you know, those photos are great. It's you on motorcycles. You hang out your friends like writing and it's, it's **** cool. See, that's the annoying thing about you is that you're cool on your curated list. And when you hang out with you as well, your birthday party I went to down at, you know, the Chrissy Field or whatever. You know, all your friends there and they're all cool now. Cool trendy things. And one guy had a drone. Everybody drinking, having",
            "start": 861.4
        },
        {
            "text": "party I went to down at, you know, the Chrissy Field or whatever. You know, all your friends there and they're all cool now. Cool trendy things. And one guy had a drone. Everybody drinking, having fun and like eating crazy. And you're like, well, I'm like, you should come on the show. You like share. But I'm going to Burning Man. I'm going to do this thing. I'm riding motorcycles. I'm not a coast. Yeah, you went to Comic-Con and read Plato's cosplay at his Red Sonja. Yeah, it was great. That's cool. Yeah, that's cool. That was fun. I just wanted to wear a chainmail bikini and throw a sword around. Sure. And I'm sure everyone was very respectful to you about it. Absolutely respectful. Yeah, really? Yeah, actually, I was never scared. Just look at them. Yeah, and then they would shiver, but they'd be like a little aroused and scared at the same time. Sure. That's the coolest margins you want to exist in. Like if you think you're cool, you're not cool. All of those out there who think, but I just said, look, it's not right boxes",
            "start": 904.05
        },
        {
            "text": "scared at the same time. Sure. That's the coolest margins you want to exist in. Like if you think you're cool, you're not cool. All of those out there who think, but I just said, look, it's not right boxes you in. I don't know. That's maybe that's what Tim's doing. Tim is so cool in wanting to be cool that he sings mind game. In real life, my girlfriend Gia came up to me. It was like, hey, am I cool? And he has an easy answer. No, she's not real, guys. She drinks wine. No, she's at the house. Warm you in a matter of. She drinks a lot. She drinks wine. She's funny. She's got an adult job. She listen to us. She know. He said she's not going to listen. Oh, break up with his ass. That's when she asked me. And do you think, you know, we're not cool. But oh, I say, okay, this is confusing. So you two are not cool together. We're just not cool. Maybe that makes you cool though. She's got good style. Yeah, well-spoken. Yeah, that's good. Look. All right. She takes good freaky, freaky cool, cool. I mean, by the way, we should that we should clarify of",
            "start": 940.57
        },
        {
            "text": "maybe that makes you cool though. She's got good style. Yeah, well-spoken. Yeah, that's good. Look. All right. She takes good freaky, freaky cool, cool. I mean, by the way, we should that we should clarify of course that being a murderer dork is not necessarily, it's not really. We are always positive. I'm in this set. I am in this for networks. We are, we are dorks. We're allowed to say it and talk about it. But I mean, we're cool. Wear with pride. You can be both. No, that's cool. Like all going a Hot Topic now. They do have a lot of good Funko Pops. Funko Pop slip on the Internet from the privacy of your own home and you never have to leave your house. You know, yeah, so you don't feel like a Hot Topic. George Clooney is cool. You know George Clooney's **** cool. George Clooney, you think George is clean? You're like, damn, man, I'd like to hang out with him if that's okay. I don't like him in real life. Exactly. People, maybe you look at his life, right, Kratz? You don't know any. We look at his Instagram and Facebook page. I",
            "start": 1003.57
        },
        {
            "text": "man, I'd like to hang out with him if that's okay. I don't like him in real life. Exactly. People, maybe you look at his life, right, Kratz? You don't know any. We look at his Instagram and Facebook page. I mean, but I mean, you know, he married a beautiful, it was a human rights lawyer. And like Stacy Keibler. No, no, he didn't marry Stacy Keibler. And that's why he's dead to me. All right. Stacy Keibler, salt of the earth. I was there from the beginning. Started his own, he said he's a mega ambassador for making watches, which is kind of cool. He started his own tequila brand. This sold for like half a billion dollars. But didn't people, didn't his PR firm do all this stuff? But he's the face of it. But I see the baby red cool that you have other people doing it for. That is cool actually. But is it cool? It's not. It's not. It's cool. You just do cool stuff and you think you're cool in a casual way. And other people are like, that's cool. I think that's cool. Look at that. Make sense. I mentioned it earlier. I think is cool.",
            "start": 1056.6
        },
        {
            "text": "not. It's cool. You just do cool stuff and you think you're cool in a casual way. And other people are like, that's cool. I think that's cool. Look at that. Make sense. I mentioned it earlier. I think is cool is The Rock. And The Rock is Wayne. They're 100% cool. Yes. Why? The Rock is very cool. Aside from being a beautiful specimen of beautiful, a big man. Aside from looking from everything. And then over that crumbled off the shoulders and put it on me. Right. The Rock's good-looking. Who's well-spoken. He's super talented. Yes, to me. Right. But he's also very inspirational. Right. Gym, like five, six hours himself. That's the thing about The Rock comparing to George Clooney or another Steve McQueen or Michael Cera in terms of like cool. We don't know what they're up to. The Rock is sharing it all the time. He's taking photos with the military, starting to do this. His dog falls in the pool. He jumps in to save it. You know, a man said this guy is salt of the earth. He's real cool. And he was a nerd as well. Okay, what I love",
            "start": 1097.07
        },
        {
            "text": "with the military, starting to do this. His dog falls in the pool. He jumps in to save it. You know, a man said this guy is salt of the earth. He's real cool. And he was a nerd as well. Okay, what I love that no school. There's a nerd in that Central Intelligence movie. He was following me. But it's cool that he wasn't cool back. There's a, there's a, there is a pupa stage there of The Rock. When you see these things and he's like in trouble. Like he talks about it all. Exactly. When he was The Pebble and he's talking about how he was in trouble with the law and is down on his luck and had no money. And he made it all happen. Here he is. He's taking every day not for granted. He's even push-ups. Shiny, shiny, shiny. Now a lot of people would look at The Rock and say there's something about him that's familiar. I can't put my finger on it. What it is, of course, is the vein in his head has the definition that the veins in Nick's hands do. Jackman-off 017 on the judging table as he comes up. That's pretty much it.",
            "start": 1157.91
        },
        {
            "text": "put my finger on it what it is of course is the vein in his head has the definition that the veins and Nick's hands do. Jack went off on the judging table as he comes up. That's pretty much it. That's it. Yeah, did you just definitely had that Kareem's is gonna be the thumbnail for this. Is it more relevant than the farm and there's no rock? We just talk about songs. Indiana Jones, fictional. Okay, no, I was about to you about fictional character. Exactly. Yeah, yeah. So what do you define as cool then, Tim? I don't know. You just know what you see. It's like, it's like a pornography. I think that that really has a lot to do with it. It's just you just know. There's just some swagger about it where you're just like, 'Fuck, that's it.' I think it's something, it's you're born with it. And even if you're a fictional character, it's just like, it's just this essence thing. I'm just, I just will never know, will never have a. It's one of those things. What's the old adage? What's like the guy was a senator was talking",
            "start": 1203.93
        },
        {
            "text": "character. It's just like, it's just this essence thing. I'm just, I just will never know, will never have a. It's one of those things. What's the old adage? What's like the guy was a senator was talking about porn? We like, 'I don't have a definition for porn, but I know it when I see it.' No, that's cool, right? Yeah, like I was in The Mission the other day, right? And by the way, The Mission's like, I took my wife to the Alamo Drafthouse. Great. And she freaking loved it. We went to Sausage Party and we already did the review on that A More Perfect Union show. But we were walking across the street and this girl was coming toward us, right? Mid-20s, beautifully styled and had like really well-placed tattoos. You know, the kind of tattoos where like, I couldn't have done that. I would not have thought. Like she had a triangle that was right in between her bosoms, like right, right, right on her sternum, right? But that went down just the right amount so that when her blouse was like looking, you know, she's gonna slightly lower cut, you",
            "start": 1251.96
        },
        {
            "text": "was right in between her bosoms, like right, right, right on her sternum, right? But that went down just the right amount so that when her blouse was like looking, you know, she's gonna slightly lower cut, you could just see it a little bit, but not not just tastefully. And my wife and I passed this girl, we both looked at each other and were like, 'Wow, she's like cool.' It was cool. Like that was, she just looked like she looked as she was walking across the street that the day was hers and we were just borrowing a little bit of that. I like that. Yeah, you know, you say that reminds me of someone else that's undeniably cool. Griffin Ramsey. Great name. That is she's Jeff's wife. She, I mean, so you don't know her. Lives in Austin, Texas. Has a really cool haircut. Has really cool family. Has tattoos like crazy. And then does chainsaw art where she like, you know, takes the log and like makes it into statues and shit. She's so cool. Yep. Yeah, yep. And I feel like there are certain aspects that if you do all the things",
            "start": 1290.45
        },
        {
            "text": "does chainsaw art where she like, you know, takes the log and like makes it into statues and shit. She's so cool. Yep. Yeah, yep. And I feel like there are certain aspects that if you do all the things, you're it helps you try to be cool, but not everyone. You need to be born a little something. Lose that when you do those things, it works. Cool. No, Tim is fuckin' cool. Fuck. Okay, on Twitter. Yeah, okay, great. He's so cool. There's somebody Carbon Copy Drake. That's all it is. All right, that's all he does. But Drake's cool. Tim's cool. But what I want, which is hard for me to wrap my head, we've stumbled into something here. I don't want to let it get away. Although J.D. says he's cool. I don't know anything about Drake in real life, but I know Lou's cool. The only thing I don't like about Lou is that he introduced these weird sweatpants to Tim. Now he wears small joggers. Yeah, I know, not now, but I'm saying like the funny thing is, yes, he had a look. Greg, you've stumbled on something interesting here when we start",
            "start": 1336.68
        },
        {
            "text": "weird sweatpants to Tim. Now he wears small joggers. Yeah, I know, not now, but I'm saying like the funny thing is, yes, he had a look. Greg, you've stumbled on something interesting here when we start, when he mentioned tattoos, I jump to Geoff Ramsey's cool. And then you bring up Griffin. And then Millie is cool as well. They're their daughter who's like what, ten? I will argue that Geoff Ramsey's just cool. And here's why he's cool. Because he told him to his face that he was cool. He was like, 'Cool.' He would argue with you and maybe like this a cup of you like, 'Not cool.' But he's got 78 tattoos. Why he has that arrow. Got like the sweet. He doesn't not care. It's just like nothing's really gonna bother me today because I'm just the right amount of shit. Yeah, at any given time, it's a sliding scale of shit. It could be zero. But well, I'm getting one, giving all the shit in a situation that clearly needs zero shit. He's over there on the zero side. I'm like, 'Nick, you're doing it wrong.' Todd's channel, he's",
            "start": 1382.28
        },
        {
            "text": "it could be zero. But well, I'm getting one, giving all the shit in a situation that clearly needs zero shit. He's over there on the zero side. I'm like, 'Nick, you're doing it wrong.' Todd's channel, he's cool. He is cool. He gets custom Vans, which I'm like, 'I know.' I was like, 'Dude, are those custom Vans?' He's like, 'Yeah.' Me, me a custom Converse. Go get the custom Converse. That's not cool. I suppose. Okay, so now you don't think you're cool? No, but to younger Tim in high school, would you be cool? Yeah, you would. I mean, I think that's just it. Yeah, this thing is different question. It's like, it's cool that you end up being you're dreaming you. Is it a different question though? Because that you're you're the one who decides what cool is. If you're cool to your younger self though, there's no, this is like trying to review video games 100-point scale. There's no scientific method to tell you what it nets out to. I feel like different because it's like, are you asking are you cool in the general sense compared to",
            "start": 1428.33
        },
        {
            "text": "to review video games 100-point scale. There's no scientific method to tell you what it nets out to. I feel like different because it's like, are you asking are you cool in the general sense compared to everybody else? Well, I think, yeah, do you think you're cool? I think that's it. Based on who you are. Yeah, in your bubble and yourself. Yeah, but it's not just worried about you and your thumbs cool. I look at G-Eazy. He's a rapper. I'm not gonna comment on the quality of his raps. Not sure. I look at him and I'm like, 'Fuck, that guy's cool.' Like he tries really hard to be cool, but it works. And there's something about the way his body looks, the way that his hair flows. Okay, okay. Every picture he takes, I'm like, 'I will never take a picture that looks that cool no matter if I was wearing the same clothes, same shape.' Who? I don't know. The Weeknd. Every time I see pictures of The Weeknd, I'm like, 'That guy's very cool.' I just don't. Well, you shouldn't have taken the name The Weeknd. The Weeknd's real cool. Pretty",
            "start": 1475.88
        },
        {
            "text": "shape. Who? I don't know. The Weeknd. Every time I see pictures of The Weeknd, I'm like, 'That guy's very cool.' I just don't. Well, you shouldn't have taken the name The Weeknd. The Weeknd's real cool. Pretty cool. I lost him. There was some great example I had, but you kept going. Do you guys know Rich Chigga? No. What? He's just like 16-year-old rapper from Indonesia. He's not. And he's, he's Asian and he's super dorky. He wears like polo shirts and a fanny pack. But his his lyrics and his rap is amazing. And I watched a video online of like all these hardcore rappers watching him rap and it just like blew their minds. I feel amazing. They're out there who have so much talent that no matter how exactly they are, they hit cool, right? His voice, Logic is good and his rhymes are amazing. Who is Logic cool? Now, Tim is now the judge of cool. Logic, the rapper Logic, we officially named him the judge of cool. What general society thinks is cool. I guess he is our best conduit. Cool. It's not just annoying",
            "start": 1517.88
        },
        {
            "text": "cool. Now, Tim is now the judge of cool. Logic, the rapper Logic, we officially named him the judge of cool. What general society thinks is cool. I guess he is our best conduit. Cool. It's not just annoying jingle-jangling. I can't tighten it. Nick is cool. That's fine. Again, it goes back to the G-Eazy thing of like, like Logic looks cool in pictures. Looks Logic and pulls shit off that I couldn't no matter how hard I tried. But now you're comparing yourself. Yeah, Logic, 'cause I'm not cool. Yes, you can do the things. Okay, all right. Here, how about this? Never really. I think it's we're shaking up here and what's happening. I'm gonna fix this later 'cause I'm sure it's all, 'Oh my God, gentlemen, sure we'll stop jingle-jangle on this thing around.' It's Troy Baker cool. Troy Baker is the essence of cool. Yeah, do you know Troy Baker? No. Okay, he's a voice actor. He always wears scarves and hats. But what is even what, what does he do voice acting for everything? I mean, she's cool. Yeah, he's in The Last of Us. He's",
            "start": 1564.8
        },
        {
            "text": "Yeah, do you know Troy Baker? No. Okay, he's a voice actor. He always wears scarves and hats. But what is even what, what does he do voice acting for everything? I mean, she's cool. Yeah, he's in The Last of Us. He's doing The Last of Us. He's Nate's brother in Uncharted. He sounds great. He's Joker in Origins. He's Batman in Telltale's Batman. He's very in demand. And he wears scarves. He was, he wears a lot of scarves. Cloud Strife in Final Fantasy, whatever the fuck. Found an extremely good-looking. Everyone sees. For what he's like, he's on fire. He sounds pretty cool. I'm gonna call mom. You see, it has different hair and it always works. I think hair is a key component to coolness. Jon Hamm. Jon Hamm. He went to Mizzou. Of course he's cool. He's also cool because the dorky roles he plays in other shows like Kimmy Schmidt. Plays the dork. It was like he's so buddy, et cetera. Because right back to being cool. I love him. Big penis. Got a great face. Big penis. I knew it. The more chiseled, the more chiseled the jaw.",
            "start": 1631.52
        },
        {
            "text": "plays the dork. It was like he's so buddy, et cetera. Because right back to being cool. I love him. Big penis. Got a great face. Big penis. I knew it. The more chiseled, the more chiseled the jaw. The biggest one. Yeah, yeah. No, it's nothing. Well, that's the thing too. A cool person would answer their phone. I know. Do any of you answer your phones now? What? I'm always afraid someone's gonna call me. So I'm always afraid he's gonna be somebody like, 'You owe me 400.' You picked it up. Mm-hmm. I'm not going. Okay, here it. You're making a very good point there, cool. A very good point on this. Now let me ask you guys, it's very important question. Yeah, some people were like, 'You know what's really cool? Not buying into the need to upgrade your iDevices every year.' I mean, I haven't upgraded in like six years. That's pretty cool, right? Yeah, no, look at this cool phone. It's not. But isn't it too far behind? You know what? You know, I don't need it to even work. It's a flip phone. It's like a Nokia. This is a Nokia original. Thanks for",
            "start": 1678.56
        },
        {
            "text": "right? Yeah, no, look at this cool phone. It's not. But isn't it too far behind? You know what? You know, I don't need it to even work. It's a flip phone. It's like a Nokia. This is a Nokia original. Thanks for watching everybody. Click here to subscribe to our channel. Click here to go to our Patreon. Click here to check out other episodes of The GameOverGreggy Show. And click here for Greg's Mystery Box. What's in it? Lit things.",
            "start": 1728.9
        }
    ]
}