{
    "id": 2969,
    "video_id": "dyCZ48ictcE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How Early Should Kids Have Cellphones? - The GameOverGreggy Show Ep. 196 (Pt. 3)",
    "description": "Thanks to ProFlowers for sponsoring this episode. Go to ProFlowers.com and use promo code: GREGGY\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1504681201,
    "duration": 1651,
    "transcript_chunks": [
        {
            "text": "Hey everyone, you know what? I am hideous. Do you know what else I am? Married. How do I distract Jen so she doesn't realize what a mistake she made? I give her flowers all the time. And now with our sponsor ProFlowers, you can too. Seriously, I bring flowers home to Jen all the time and she loves it. So you know someone in your life will enjoy a bouquet for no reason. The last batch of ProFlowers we got in the office were lush and beautiful. If I'm lying, I'm dying. These puppies look great. ProFlowers wants to help you surprise someone for no reason at all while also surprising you with a special deal. Get 0% off any of their unique summer rose bouquets or any other bouquet for $29 or more. Bouquets are guaranteed to stay fresh for at least 7 days or your money back, and you control the delivery date. So don't wait to get 0% off summer roses or any other bouquet for $29 or more. Go to ProFlowers.com and use my code Greggy at checkout. That's ProFlowers.com, my code Greggy at checkout. Don't",
            "start": 0.0
        },
        {
            "text": "date. So don't wait to get 0% off summer roses or any other bouquet for $29 or more. Go to ProFlowers.com and use my code Greggy at checkout. That's ProFlowers.com, my code Greggy at checkout. Don't wait to make somebody's day. You, Nick, yeah, what's topic number three? Has to do with small children. How many are you now? AG, right? With a computer, with a computer. I see this all the time now. I see kids with with cell phones, like playing with their parent's cell phones and all that stuff. And I'm like, what the fuck is this doing to these children? Like at what point, granted none of us are parents, so we really shouldn't weigh in on this, but we're gonna do it anyway. It's our fuck show, we'll do what we want. If you're probably not gonna be, suck it together. At what point do you think it would be it's appropriate to give a kid a cell phone? Well, you dial it back. I want background information. When you got your first cell phone? I mean, I'm old, so I'm her cell phone until college. I had a Nokia over the",
            "start": 46.32
        },
        {
            "text": "to give a kid a cell phone. Well, you dial it back. I want background information. When you got your first cell phone? I mean, I'm old, so I'm her cell phone until college. I had a Nokia over the first. You're talking circa 2000, 2001. When I got my license at 16, mmm, there was a week my mom put the second cell phone or whatever, her old cell phone right into the glove box. I don't count that with the exception that my number kept going with that. So I had that in the glove box for emergencies, which of course would never help you because the battery's gonna be dead and like you have to pull it out and charge it and your shit on fire car. I guess I don't know, it doesn't happen. But it was that sophomore year at at college at Mizzou, at the end of the, you know, beginning of the year, I got the blue Nokia mailed down to me. And yeah, and because I remember it was that at the end of freshman year, we were at the Antler House and Adam White walked in with a new phone. We're all like, wow. And then that next year my",
            "start": 103.48
        },
        {
            "text": "down to me. And yeah, and because I remember it was that at the end of freshman year, we were at the Antler House and Adam White walked in with a new phone. We're all like, wow. And then that next year my mom was like, you, I'm mailing you one. Like you need to have one touch. And I'm a write, took a terrible photo of Goose on Rosemary Lane because I was walking down playing with his phone as if I loved Goose. No, no, no, he's very, you know, know that you're they gonna Travis Goose is just a fat guy. Hmm, shorted a lot of fat guys, my antlers. But hence, well, I mean, I totally stole Team Fat from them and they've never so sued me. So they come out as we're shit big guys and more. Now they're all cowards, they got kids. We know how to fall hard. So in sophomore year, got that phone. And I also remember this is still the time to, I don't know how much you had to deal with it, of like, all right, cool, I'm gonna text whoever. Oh, it's a long distance. No, I'm gonna go, it's a long distance number. Like, fuck, is anybody from",
            "start": 157.99
        },
        {
            "text": "the time to, I don't know how much you had to deal with it, of like, all right, cool, I'm gonna text whoever. Oh, it's a long distance. No, I'm gonna go, it's a long distance number. Like, fuck, is anybody from that area code? Can someone else call this person? Oh, I remember that. Yeah, yeah, yeah. I remember way too long. Yeah, we're even fuck, we had different area codes. So I, my phone would have been 2000. Then what about how old are you then? I would sophomore in college, so 19. And then how old were you? I was, I probably have been 2000. Wait, I can't work, be right? Cause we're way, I'm way older than you. Are you like, how will the excitedly only two years older than me? Yeah, 9:34. I'm 34. Oh, guys about it. I'm 37. So maybe mine was a little earlier. My 98-99 issue. How old were you? No, 18, by 18, 19. Okay, summer on this, somewhere around 2000 was when I got a cell phone for the first time. I want to say I was probably 16. Okay, so my parents were always really cheap. No, no, they were. It was 14 when I started",
            "start": 206.72
        },
        {
            "text": "summer on this, somewhere around 2000 was when I got a cell phone for the first time. I want to say I was probably 16. Okay, so my parents were always really cheap. No, no, they were. It was 14 when I started going to Community College. And it wasn't like starting Community College at 14. Yeah, okay. It was like the side classes. Yeah, exactly. It for state. Like I knew that was my plan. I was like, do your pee now, cause it's like summer and you can knock it out. Huh? Yeah, it sucked. It like, I didn't have a summer. But you had some sweet-ass arrow lessons, dude. Man, I could shoot an arrow. You know what I mean? If you like of a bowling class, let's go hunting. They don't have to know. I mean, like in high school, look the fuck out of that. I can't. I bully so hard to fuck count should be bad. Yeah, it's dumb. Anyways, um, so yeah, somewhere around 14, maybe 15. Tim, would you get your from 8th grade? I was 13, the year 2003. And I got that fuck sweet nasty Motorola T720, the flip wise, not the Motorola RAZR later. Oh, I was at T720, dude. No, T720.",
            "start": 256.43
        },
        {
            "text": "around 14, maybe 15. Tim, would you get your from 8th grade? I was 13, the year 2003. And I got that fuck sweet nasty Motorola T720, the flip wise, not the Motorola RAZR later. Oh, I was at T720, dude. No, T720. Didn't you get a RAZR eventually? Mm-hmm. I loved that shit. I I wasn't, the RAZR was cool. Didn't some of the RAZR, this was this phone, you totally had a RAZR. I think you had a blue RAZR. Never had a RAZR. I didn't have a RAZR. Didn't ever trace it to T720. It was like the the first next-gen phone, cause there's the flip phone, but then the RAZR was the one that came in and that was like, this was the Dreamcast. Yeah, yeah. I got that black RAZR after I had a graduate and started working at the Tribune. And I was out on assignment or something and I pulled it out in this like, it was, I forget what I was at school. There was all these kids and I pulled that, it went like that. And these kids lost their fuck mind. I suddenly became the coolest adult in the world. The RAZR, that was the first really",
            "start": 309.11
        },
        {
            "text": "I was at school. There was all these kids and I pulled that, it went like that. And these kids lost their fuck mind. I suddenly became the coolest adult in the world. The RAZR, that was the first really fuck a cool, that's a pricey thing with commercials that, yeah, yeah, very cool looking. Yeah, it was a dope fuck. Yeah, definitely. And just how thin it was. Like that was when it became a big thing about, yeah, small the phone could be. Yeah, cause the big one with mine was it was one of, it was in the line of the first phones that had the polyphonic ringtones instead of MIDI. So you could actually buy ring tones that were song, still weren't song, right? Cause they sounded like later, but it sounded more like it than just the like, it sounded more like a Super Nintendo than a Nintendo, right? I want to say I had one of them actually. I think I did have one of those. I think I got that. I was looking, yes. And what was great about this phone is that you can take the cover off and replace it with like industry for a",
            "start": 373.17
        },
        {
            "text": "of them actually. I think I did have one of those. I think I got that. I was looking, yes. And what was great about this phone is that you can take the cover off and replace it with like industry for a second, right? That like a vacation that would like bejeweled. And I mean, now that shit's all gone. It's all gone. What's all just replaced? Yeah, but you remember like for instance, I used to drive by this place. There used to be like all these stores like for beepers, remember that? And you'd get like different body to the beat board, all that stuff. Dude, it was a bit, it was like a big deal for like 10 years. And then cellphones demolished that. And now smartphones have demolished all this. Well, I remember when cell BlackBerrys anymore. But it does have a phone when my mom got the first cell phone for the family or whatever. It was when I think now I'm grandma's sick. But old pop, he was gonna say whatever. When her parents were starting to go and she, it was one of those that came in like a bag that she had",
            "start": 416.04
        },
        {
            "text": "or whatever. It was when I think now I'm grandma's sick. But old pop, he was gonna say whatever. When her parents were starting to go and she, it was one of those that came in like a bag that she had. This like bag that you like, I'd unzip the top of like an old camcorder bag and open up the weapon phone where he's like, yeah, he must be. It was fuck huge. Yeah, but it's how you had to do it. Huh? Anyways, so now 2017. Yeah, when do you think, well, how old should a kid be to have a phone? I'm I'm yeah, I mean, Tim, you answered immediately. Just put the phone in the kid's hand. Going back like looking at my life and going back to the last topic we just talked about. One of the biggest hurdles in my life is that I didn't know how to use computer when everyone else around me did. So guess what? Phones aren't going anywhere. The Internet's not going anywhere. Kind of a kind of a must-have. See, cause I have in a way that like, I feel like people should learn how to use the stuff effectively and efficiently as soon",
            "start": 462.18
        },
        {
            "text": "anywhere. The Internet's not going anywhere. Kind of a kind of a must-have. See, cause I have in a way that like, I feel like people should learn how to use the stuff effectively and efficiently as soon as possible. Are we late? Are we counting iPads in this equation? Yes. What I see now is when I go to the restaurant and the kid is on the iPad on the Internet, all the horrors, majesty of the Internet. What about just like if it's not on the Internet, but playing like one of the like any game? Well, first up, it's fucked up if you're like, you can have a cell phone, but you give the kid the flip phone is for like the I I agree that they should have their phone like a phone right away just because I think people should be accessible. My everyone might need your creator answer this question would be before we start getting the weeds of it would be as soon as the kid's going off and doing things without me. Yeah, you know what I mean? I like you just playing in the woods, do whatever the fuck. Like one when you",
            "start": 504.3
        },
        {
            "text": "we start getting the weeds of it would be as soon as the kid's going off and doing things without me. Yeah, you know what I mean? I like you just playing in the woods, do whatever the fuck. Like one when you I don't need to be holding you little punchy fuck hand and walking around a goddamn playground acting like I'm having to drive eight. That time should be for the like flip phone where it's like it can do phone calls, it has no games. I get off on their own. What are they gonna do? Like they're out of mice. If they're out of my sight for that long, they're with a babysitter or somebody where they stole your credit card over order an Uber. And we are you on the same page with me where they go off on their own? Well, yeah, when so when they go off their own, so they have accessibility to call. But like I don't think that like games or you can put things on that, right? You have like that's there's always ways around that. Sure. Yeah, let's see. I think you're also getting the fact that year, I mean, Tim's",
            "start": 548.82
        },
        {
            "text": "I don't think that like games or you can put things on that, right? You have like that's there's always ways around that. Sure. Yeah, let's see. I think you're also getting the fact that year, I mean, Tim's right, right? Like you can only control what your kid does. You want you want to let your kid go off. You want to put a chip in him like a dog or whatever. So you can like find him and chalk it whenever you want. Like that's something you could do, right? I don't think legally you can. I want to pull the car over for a second, put on the emergency flashers and tell a story that's somewhat related to what just happened, but not all related a topic. Are we okay with that? I climb into the Uber a couple weeks ago, gonna go home, get in, get in there right under the phone, answering emails, doing Slack stuff, whatever. You know what I mean? Drive and drive and drop in. And about halfway home, some traffic a cruise. And so we is a stop. We have a moment to catch our breath. And I'm finally like, you know, doing that thing",
            "start": 588.2
        },
        {
            "text": "you know what I mean? Drive and drive and drop in. And about halfway home, some traffic a cruise. And so we is a stop. We have a moment to catch our breath. And I'm finally like, you know, doing that thing where you're like, ah, Robin the Bridget, you know, is put this phone in the pocket. Like I'm just gonna look out the window and relax for the next 15, 10 minutes, whatever. As I do this, my driver looks back in the mirror, knees goes, you know, Greg, I just feel like we never got a chance to connect on this ride. And I laugh and like, I was a funny thing to say. Again, I know, man, you know, the work never stops. He's like, no, I understand. And it was that thing of like, all right, cool, we're gonna leave it that. That was just a funny joke. I can see myself saying something like that to somebody is doing work and being busy. And instead we go another minute and a half and he just goes, so Greg, how do you feel about microchips in humans? RFIDs? Did he explain? Oh, well, he explains, trust me. Let me let me my first point. I put",
            "start": 631.58
        },
        {
            "text": "and instead we go another minute and a half and he just goes, so Greg, how do you feel about microchips in humans? RFIDs? Did he explain? Oh, well, he explains, trust me. Let me let me my first point. I put up my fuck like, and I knew his name. I dare offer, yo, to us, put him. And I'm like, you know, Daryl, you talk about like, you know, the things you put under your skin that you can check yourself out with or get yourself into a your apartment, wherever. He's like, yeah, I'm like, I'm not gonna be Gen One. I'm not gonna be Gen One of that technology. But I'm not gonna hold it against anybody who wants to do that in themselves. And he's like, hmm, like, what did you think, Daryl? He's like, oh, I got one in me. There it is. And I'm like, oh, you do? Like, oh. And I'm like, tell me more about that. He's like, well, I was put in there against my will. Oh, wow. And I was like, by the aliens to be. All right, I see. All right. And he's like, yeah, the story goes bridged that Daryl has his friend who has this new friend. And Daryl goes over to",
            "start": 665.18
        },
        {
            "text": "against my will. Oh, wow. And I was like, by the aliens to be. All right, I see. All right. And he's like, yeah, the story goes bridged that Daryl has his friend who has this new friend. And Daryl goes over to the new friend's place in there with their crew friends. That's the role there, the crew. They're drinking out a Red Solo Cups. Daryl makes this clear. They're drinking Jack Daniel's. And at some point, the new friend comes over with a shot glass filled with what Daryl soon was Jack Daniel's and says, hey, welcome you to the crew. Daryl's like, all right, man, thanks. And he shoots it in like 5-10 minutes goes behind. Daryl's like, I don't feel good. I'm feeling like I gotta go to bed now. I'm gonna go to bed now. He's like, he tells his friend, I'm gonna go. And the old friend, new friend of like, no, I dude, you can't. You've been drinking. You gotta sleep here. You got to stay here. And Daryl's like, all right. And say Daryl says they pile together clothes and make him a little bed. Daryl lays down. Next thing no Daryl knows, he",
            "start": 712.19
        },
        {
            "text": "been drinking. You gotta sleep here. You got to stay here. And Daryl's like, all right. And say Daryl says they pile together clothes and make him a little bed. Daryl lays down. Next thing no Daryl knows, he wakes up with the new friend on top of them. And then Daryl's puking. Which Daryl is like, what's going on? He's like, you're getting sick. We were trying to. He's like, okay. And he runs to the bathroom, continues to get sick there. Then he when he's done getting sick, he comes up and looks in the mirror. He's here. He's bleeding. He comes out. He's like, what the fuck happened to my ear? Why is my ear bleeding? New friend says, you fell down in tears. Like, I was asleep. How did I fall down? He's like, I don't know, man. You got up and you fell down. And we were then you started puking. And Daryl's like, all right, man. I don't know about that. Literally, that's what stories left with me. And then it's like, instead, so he's like, so long story short, I have a microchip in my head. And I was like, what is what does that mean?",
            "start": 755.87
        },
        {
            "text": "I don't know about that. Literally, that's what stories left with me. And then it's like, instead, so he's like, so long story short, I have a microchip in my head. And I was like, what is what does that mean? Injuries could lead to ear bleeding and puking. He that's not crazy. I'm like, well, what do you what do you mean? And he's like, well, you know how I was complaining? He's like, well, I started hearing things and seeing things. And I was like, all right, no sign of a concussion. All right. And he's like, so I went in to the doctor to get the an MRI, at the CAT scan. It was like, all right. And I'm like, what? And he's like, he's like, they, he went into the doctor, get them on the CAT scan. And you know, these new chips, they're made of silicone. They can't be seen by the MRI, the CAT scan. And I was like, so did the did a MRI findings? Like, no, can't find it because it's silicone. And it's it's grafted inside of my head to my nerves in both my ear in my eyes. Hmm. And I said, okay. And he's like, and I'm like, so what is what are",
            "start": 794.6
        },
        {
            "text": "findings? Like, no, can't find it because it's silicone. And it's it's grafted inside of my head to my nerves in both my ear in my eyes. Hmm. And I said, okay. And he's like, and I'm like, so what is what are you seeing? What are you hearing? He's like, well, what it is is the government recording me. Obviously, they're they're watching what I'm doing and stuff. One another buddy, this is where Daryl and Daryl makes it interesting. This is where this is where I guess actually Daryl tells me that he's finally figured out that his visions are the camera working both ways. So they can see what he's doing, but he can see them what they're doing. He's like, I see them in lab coats. How can I see them walking around with lab coats since man is named? One of the women has high heels. I said, all right, cool. Mike, how often do you see these things, Daryl? He says, all the time. He's seeing it right there. At which point, I was like, oh, this is my stop off. I'm sorry that happened. He and I got out and got out of the car. He's",
            "start": 842.58
        },
        {
            "text": "do you see these things, Daryl? He says, all the time. He's seeing it right there. At which point, I was like, oh, this is my stop off. I'm sorry that happened. He and I got out and got out of the car. He's good. Cause I hope he wasn't driving to your house. Yeah, that's one of those situations where if that had happened to me, I'd be like, who do I have to call to get this person off the road? Because that person is not mentally sound. There's a lot of problems. At any point in that story, I thought you were just gonna be like, and that's the plot of some. Well, I thought you fucked with us too. I thought, I mean, I think he's like, how is it? Let's see how I set that up for myself with my own storytelling abilities. That's a real story. Story that's yeah. During that, did you think this guy is gonna drug me or maybe I already have a chip in me? Well, what I did is that I, the problem was is that Daryl had a brand new car we're in and he's registered through Uber and he seems like a nice guy. And so as I've reflected",
            "start": 884.64
        },
        {
            "text": "already have a chip in me? Well, what I did is that I, the problem was is that Daryl had a brand new car we're in and he's registered through Uber and he seems like a nice guy. And so as I've reflected on this story, as I often do, not often enough things I forgot to tell any of you the story. If I told Jen as soon as I got back, is maybe Daryl is in line with me. Maybe Daryl is unless, you know what? We've been driving for 15 minutes. We're halfway to the sky. Whatever is gonna happen, we're stuck in traffic. I'm gonna fuck with this guy. We haven't connected much of this. Now we haven't. Here is this fuck random a story about me getting microchipped and seen both ways. That's some fuck that you would do. Like that's what I'm saying. You're unique. Oh, I don't think that a lot of people would do that today. A lot of people do that. What ant thing, the ant thing in the flowers? Your mom gets the flower, she's lost. I think it's coming out. That was another one of your moment through. It's like, Jesus, Daryl",
            "start": 929.61
        },
        {
            "text": "a lot of people do that. What ant thing, the ant thing in the flowers? Your mom gets the flower, she's lost. I think it's coming out. That was another one of your moment through. It's like, Jesus, Daryl broke. Daryl never broke. He never laughed at the end of my hand. And then like, I mean, were you not uncomfortable? No, I there's pretty early on that story. I was uncomfortable just hearing you say sure. Being in an Uber with this dude. Yeah, I don't like Uber drivers talking period. Yeah, if they start saying some fuck fuck like that. Yeah, I I'm pretty sure I would ask how many stars did you give him? Totally forgot to leave the review. Fine. I would've loved that review. That would have been a, well, I meant to do it of like, hey, it's got in this is sums weird. I don't know. But I don't know the microchip in his head. You know, he's pretty sure of it. Yeah, I mean, he's got compelling evidence. I'm just trying to figure out how in this guy's in this guy's mind, he was like, I was out for 30 minutes and they did",
            "start": 972.17
        },
        {
            "text": "his head. You know, he's pretty sure of it. Yeah, I mean, he's got compelling evidence. I'm just trying to figure out how in this guy's in this guy's mind, he was like, I was out for 30 minutes and they did brain surgery on me without leaving any mark. I'm sure there's some sort of tool you just put in easily-accessible. He's making a lot of sense. How did it get past the ear drum? I don't know. Nobody knows. I went through and through the nose and the air at the same time. Know is actually a good call because bleeding out of the ear. So my apologies. Wean, I'm taking the flashes off when get back on the highway here. It's gonna be talking about this thing. So we're back on. I don't know what the topic is. Oh, the kids, right? Yeah, yeah. When they get their cell phones. So Tim says immediately, I say don't give him a cell phone and just put a chip in their eye sockets. You can hear in the listener. Oh, the Daryl chip. We've heard so much a lot of the news recently. Sounds like a good plan to me, right? If you know",
            "start": 1014.74
        },
        {
            "text": "a cell phone and just put a chip in their eye sockets. You can hear in the listener. Oh, the Daryl chip. We've heard so much a lot of the news recently. Sounds like a good plan to me, right? If you know your kid is at all times, they can just see you pop up like, come home. Like imagine if your kids, their kids first sexual experience, right? No, why would you want to imagine that? He's gonna make out with a girl for the first time and she starts to touch his penis and he's like, this is fantastic. And you're like, Boop. Should I fuck with this kid right now? Or I'm watching this happen. It might be legal. You're like, every aspect. You pop over like, the devil is in your penis. You know what I mean? Why would you tell them for life? Fuck up your first thought you were gonna have sex. I can't. How's your watching me watching you? That's fucked up, right? Tim brings up a really good point in it that if you don't give them your kids accessibility to technology, then they are behind. And I think that like, I hadn't thought",
            "start": 1058.84
        },
        {
            "text": "you. That's fucked up, right? Tim brings up a really good point in it that if you don't give them your kids accessibility to technology, then they are behind. And I think that like, I hadn't thought about that. Like that is a real like, I I don't want my kid to be all day playing on stuff. But I'm going to be there, right? Because you're putting you're putting the world's most addictive legal technology in the hands of a brain that's not formed yet. Like what does that do to a kid? Again, it's another thing where the grass is always greener and you're trying to get the thing that you can't have the moment you have it. Sure, it's less like not everyone is like that. A lot of kids are though, right? I think most kids are most this even awesome technology. I can't wait for PS4, Switch, whatever, some device, some device. And you get it and it's great. And then it just becomes probably life. And it's like, oh, I haven't played the Switch in extra weeks. I would say yes when it comes to I would say yes when it comes to",
            "start": 1102.96
        },
        {
            "text": "and you get it and it's great and then it just becomes probably life and it's like oh I haven't played the Switch in extra weeks I would say yes when it comes to I would say yes when it comes to things like that but for whatever reason the cell phone is different the cell phone is like we're all addicted is yourself a cell phone I would put there there's restraints I'm sure and I know that yeah the kid could break through when he get wants to yes you could want to but I guess that's learning something important to how to break that system you know that's very but yeah I'm out you have it if your kids didn't know keyboard commands now it would be mine that was gonna happen when your kids when you have kids and they're cool and they go hang out with Uncle Nick and they come back and they're like I need a Mac no Mac no no Mac I'm gonna get your kid see and it's not working and you're gonna be like well you have to hit commands no because we'll see it's your cool kids hit Command C",
            "start": 1149.97
        },
        {
            "text": "like I need a Mac no Mac no no Mac I'm gonna get your kid see and it's not working and you're gonna be like well you have to hit commands no because we'll see it's your cool kids hit Command C doesn't know what cool kids are I'm really uncomfortable now like this and you're like wait I'm sorry Nick Scarpino is here again he violated the restraining order again Paula dude and then you pop up what is the breakdown on your kids being vegetarian oh no no no the very beginning I was like hey you're gonna try to raise them as vegetarians and if you put in the work you you know figure out getting the meals yeah they're gonna be like that's what they're gonna eat but every once in a while I'm gonna come in with several pounds of whatever animal I've decided on and I'm gonna cook it up in a great way and they're gonna be like this is all I ever want to eat so I'm letting her if she wants to the vegetarian nonsense I'm gonna take in the Flavor Country did you see this news report going around",
            "start": 1189.27
        },
        {
            "text": "way and they're gonna be like this is all I ever want to eat so I'm letting her if she wants to the vegetarian nonsense I'm gonna take in the Flavor Country did you see this news report going around today no this over in I think it's England these firefighters saved these piglets or whatever during this farm all the hay caught on fire and as a reward the woman made them into sausage it brought them into the firefighters but see they served a purpose yeah oh my god you f*** almost got barbecued like hey I risked my life to save these things and you just I mean that's how the story played out in the first few graphs I'm not sure save the farmer it's exactly what they were meant for and like they lived in serve their purpose connected see I think no I guarantee the firemen were like f*** sucks they like delicious I'm sure they weren't excited to save these f*** little piglets yeah I know I'm sure it's a certain point like it wasn't like the fire like the thing was coming down in",
            "start": 1246.45
        },
        {
            "text": "sucks they like delicious I'm sure they weren't excited to save these f*** little piglets yeah I know I'm sure it's a certain point like it wasn't like the fire like the thing was coming down in the fire fire like trips and he looks over and Babe the pigs just staring at him and like he grabs it and they run out and like as the barn explodes and the Babe looks up to him they lock eyes and then a day later he's eating Babe like I don't think it was like there's like six months pretty sure it was exactly different it's great don't give a f*** about animals if I saw the pig I don't want to eat the pig if they looked at me and like nudged me I've like f*** I can't eat this big I can't expect that's why they say on farms like you can't name the animals yeah those kids always do my uncle has like a mansion and he like part of it is a farm in Peru and they always name the pigs and every time they have the big party and they they hang up the pig and slit its throat he's like you",
            "start": 1297.03
        },
        {
            "text": "uncle has like a mansion and he like part of it is a farm in Peru and they always name the pigs and every time they have the big party and they they hang up the pig and slit its throat he's like you shouldn't f*** I told you last time not to name it yeah yeah kids are 35 years old yes yeah I see I feel like what I back to this topic of conversation mmm-hmm we all jump to iPhones smart devices that's what the phones are now I I agree that's what I would do I think I'll put restraints on it in terms of what it can and can't do mainly it is a phone or calling or texting depending on all the shows and then iPad / video games / TV or whatever screen time is not limited like you look at Urban Chick Town you've got 15 minutes left of your hour a day it's just like are you being social are we doing something how are you making work I think that's the way to start the to start is teaching them what to do and how to get give them something that they want early on when my dad taught me how to",
            "start": 1340.59
        },
        {
            "text": "something how are you making work I think that's the way to start the to start is teaching them what to do and how to get give them something that they want early on when my dad taught me how to turn on the f*** I don't even know what the machine was called nowadays TV the cable box I guess yeah but I was a kid walks or something something different would be to change that maybe change the channels I was the cable box it wasn't a box it was before we got cable but I just teaching me with the go go to channel 15 for this go to channel whatever then it's like cool I'm gonna do that thing because that gets me what I I want well I'm not just exploring the world of all the other channels those are boring they're the news I'm not trying to watch scrambled for every Sunday I'm Nick it was Nick News with Linda it's all you needed me that's all you need they brought your items garbage you like that Nick News yeah where they like come together and talk and they'd have like all the kids on the",
            "start": 1384.54
        },
        {
            "text": "News with Linda it's all you needed me that's all you need they brought your items garbage you like that Nick News yeah where they like come together and talk and they'd have like all the kids on the stump so they tie all right let's talk about what AIDS is and they be like no that's what you need it that's that's why you're f*** up that's why you're just oh Fred's first thing that I love you he's like all right cool first thing we're at each one says hey don't oh joy don't you ever didn't they get slimed yeah yeah obstacle course yeah I don't know for me I think I I I mean I'm conflicted I I agree with him I like I think you've got a the kids gonna have a phone eventually like dive in but then I also think of myself I'm like there's so many other skills interpersonal skills that I feel like the kids just not gonna get if they're always attached to their phone and like no man I've learned my inner personal friendship connections for me I am like I just don't think that those",
            "start": 1426.9
        },
        {
            "text": "I feel like the kids just not gonna get if they're always attached to their phone and like no man I've learned my inner personal friendship connections for me I am like I just don't think that those arguments hold up because I suppose basketball in the park where I texted my friends hey you want to play basketball in the park you know I'm like I all those experiences are still being had you sure the playgrounds there's still kids and playgrounds you know you go to other things kids do like swimming pools they're still there tree rope swing you there's a line of kids waiting to get on that sure there's no line but here's the difference all those kids are moving all that stuff and they're holding their phones their hand they're communicating with each other through the phones so it's like but I see it like I see it even with us right like we all do this every time we said it alone there's a lot of them as we go to that because we're it's way more fun talk to our phones and it's talk to",
            "start": 1477.32
        },
        {
            "text": "I see it like I see it even with us right like we all do this every time we said it alone there's a lot of them as we go to that because we're it's way more fun talk to our phones and it's talk to me I mean I think it's more fun oh I think we all feel responsibility to be like oh I haven't gone through Tweets I know I'm gonna have hello later I haven't checked my Instagram post like are the other things who is like I understand that you know the argument people make is like oh you're so detached cuz you're all on your phone or whatever but it's also the fact that the phone is just the portal to the people who mean the most right like we're out and I love you guys and we run a great business and so much fun but like oh hey Jen's texting and I have something I want to say to Jen that I text her to do it and it's not like that but it's also that thing of all you're thinking of your mom or something to say your mom you say it to her right there right then where and before it was like wait",
            "start": 1520.88
        },
        {
            "text": "her to do it and it's not like that but it's also that thing of all you're thinking of your mom or something to say your mom you say it to her right there right then where and before it was like wait to get home to make the phone call or just wait to see that person right it's even now where it's like you know I the people I look at you know the train or whatever and people just always on their phone or whatever and like you go back and like there's that great photo of everyone reading the newspaper oh yeah it's like that's where all the informations at your fingertips but so is every other human being you want to talk to or need to talk to that moment and what we do when we are arts luncheon it's like you're done checking in on Twitter because you want to make sure everything's fine or seeing on Instagram or posting what you just took with cool, Greg you put it down and you are there when you're something soxhlet but even on the car ride home today me Tim and Joey were not even on our",
            "start": 1563.18
        },
        {
            "text": "on Instagram or posting what you just took with cool, Greg you put it down and you are there when you're something soxhlet but even on the car ride home today me Tim and Joey were not even on our phones at one point we're all just like sitting there just like totally spaced for a second of hey we don't have to talk to each other right now and it's chilling out and then I broke the silence f*** him something about that f*** I was the Sugar Pine 7 so I was stuck in my head and I didn't want to put it on it's stuck in everyone my problem my problem slash blessing is I still haven't heard this song so I know that Andy and they keep video I'm sure it is they do great work over there remember when we talked about making music videos for like three years we've made multiple music videos a million-plus viewed music videos I'm right f*** at mm-hmm thanks for watching everybody click here to subscribe click here to see a playlist to other videos click here to go to our Patreon page and",
            "start": 1594.27
        },
        {
            "text": "million-plus viewed music videos I'm right f*** at mm-hmm thanks for watching everybody click here to subscribe click here to see a playlist to other videos click here to go to our Patreon page and click here to go to the Vortex of Darkness I don't know what it is",
            "start": 1634.53
        }
    ]
}