{
    "id": 3000,
    "video_id": "F5EXx7Sw-uw",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Andrea Rene"
    ],
    "title": "PlayStation's TGS - Kinda Funny Games Daily 09.19.17",
    "description": "Andrea and Greg run you through the announcements from last night's PlayStation conference at TGS. \n\nThanks to our sponsors DraftKings and SkillShare. \n\nPlay for a hundred thousand dollars in total prizes this Sunday at http://www.draftkings.com/ with the promo code KINDAFUNNY. \n\nThe first 500 people to sign up will receive a 2-month free trial. Go to: http://skl.sh/kindafunny to start your trial now.\n\n02:10 - Time codes you say?\n03:10 - Roper Report begins\n03:32 - Playstation TGS Conference coverage\n13:09 - Phil Spencer is on Microsoft's Senior Leadership Team\n17:30 - Insomniac new logo\n18:50 - Toys R Us officially filing for bankruptcy \n23:36 - Destiny 2 Raid is shuffling events\n33:36 - Destiny 2 Clan comment\n34:40 - Official list of upcoming software\n36:50 - Would you consider writing a book about the games industry?\n38:17 - New dates\n39:35 Reader Mail begins\n40:48 - Playing Destiny 2 as a parent: is it practically impossible?\n47:14 - Path to Platinum Destiny 2\n50:25 - Why is everyone squeezing PUBG in GOTY discussions?\n54:32 - Fortnite Xbox One & PS4 Cross play - what's up?\n58:59 - You're wrong\n1:00:41 - Squad Up\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1505857247,
    "duration": 3915,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to Kinda Funny Games Daily for Tuesday, September 19, 2017. I'm one of your hosts, Greg Miller, alongside the busiest lady in the business, Andrea Rene. Greg, what's on your face? I'm trying to, it's every ten years I say, let's see what the beard looks like. Let's go. I haven't tried to grow real beards since I insulted Ryan Geddes on a Game Scoop back at IGN. Wow, 2007, 2008. And Jen was like the other day, she's like, I let it go because I was playing Destiny like a bum and not showering and just saying, they usually, hey, I was in the same place this weekend, it's okay. Did you, on, tell you to let your beard rot? She's like, no, I just lean into this, just keep going. So I'm giving it till Saturday, 'cause like, you got to check in sometimes and see. Yeah, it feels like we know the shit he's shaving every day. It feels like it was coming in thicker than it was ten years ago, but you don't know, you know, I was gonna let it go and see. It looks better on Instagram, not on",
            "start": 3.61
        },
        {
            "text": "know the shit he's shaving every day. It feels like it was coming in thicker than it was ten years ago, but you don't know, you know, I was gonna let it go and see. It looks better on Instagram, not on the YouTube videos I've been seeing. Now it just look as you have dirt on your face. From a distance, it looks like I'm doing like a cartoon hobo look. Gentlemen, this is Kinda Funny Games Daily. Each and every week, on a variety of platforms, we run you through the nerdy video game news you need to know about before giving you perspective, answering your questions, and having a good time. Remember, be part of the show at KindaFunny.com/KFGD. You can watch live as we record it on Twitch.tv/KindaFunnyGames. However, you can't see us do it. We don't see your chattering, that stuff. You have to go to KindaFunny.com/You'reWrong. Tell us what we screwed up as we screw it up so we can set the record straight for everybody watching later on YouTube.com/KindaFunnyGames and listening on",
            "start": 49.42
        },
        {
            "text": "KindaFunny.com/You'reWrong. Tell us what we screwed up as we screw it up so we can set the record straight for everybody watching later on YouTube.com/KindaFunnyGames and listening on podcast services around the globe. Housekeeping number one: Party Mode is up on Patreon.com/KindaFunnyGames. It might be the funniest Party Mode we've ever done. You should go check it out. If not, you can catch tomorrow on YouTube. And then also, sometimes were brought to my attention yesterday, yes, we make a lot of content here. That's true. You do fire it out into the internet. It goes out there. It finds you, the viewer, finds you, the listener, everybody. Yesterday, Community Manager Joey Noel hit me up and was like, so what are we gonna do about all the YouTube comments on Kinda Funny Games Daily? Like, what do you mean? And I went there and saw a small revolution of people asking for time codes. That they wanted time codes. They want the show broken up by time codes. And they're, you're doing it in",
            "start": 93.76
        },
        {
            "text": "like, what do you mean? And I went there and saw a small revolution of people asking for time codes. That they wanted time codes. They want the show broken up by time codes. And they're, you're doing it in a funny, interesting, good way, not being mean about it, which I respect a lot. Obviously, we've been doing shows for a long time. People have asked for time codes for a long time. And it's always that, it can't be that hard, can it? They ask. And it's not that it's that hard, it's just cumbersome when as soon as we, and here I go, make, publish information, I go do this. You run to your next job. You're going over there. Cool. Dragonetti, we're not, we're seven people, right? It's, it's a lot for us to do. However, we're gonna try it for you today. Will be the first Kinda Funny Games Daily where we tried doing time codes. Andrea's doing them as co-hosts right now. Are you putting them into the Google Doc? Is that what the plan is? I'm just writing them into an email draft right now. That's us. And then I'll kick it over",
            "start": 139.39
        },
        {
            "text": "Andrea's doing them as co-hosts right now. Are you putting them into the Google Doc? Is that what the plan is? I'm just writing them into an email draft right now. That's us. And then I'll kick it over to your heads. Thanks for this, Danny. Oh, do why I can do it tomorrow. He's already checked out. These are staying off Merrill. He's got senioritis for now. Let's begin the show with what is and forever will be the Roper Report. Time. There's a lot on the Roper Report. It add-in actually kind of, but there's a ton. I don't know what to say. Say your baker's dozen. It's still the same thing. No, you're a given number. You can't just, I'm not gonna count it. We'll just guess seven. There's more than seven. A baker's dozen is not only short ones in there. They're just like, you know, I did see it. Yes, mention the first one is a huge one. PlayStation had its TGS conference last night. It is chock full of huge news, all sorts of things happening. Uh, let's start at the top. This is, I'm taking IGN's rundown of the PlayStation TGS",
            "start": 177.31
        },
        {
            "text": "a huge one. PlayStation had its TGS conference last night. It is chock full of huge news, all sorts of things happening. Uh, let's start at the top. This is, I'm taking IGN's rundown of the PlayStation TGS conference. Square is making a game called Left Alive. IGN writes it as the title, which Square Enix describes as a brand new survival action shooter set in a dark and gritty world, is being directed by Armored Core director, may be Shima, will say, and features character designs by Metal Gear character designer Yoji Shinkawa. Mech designer, another guy who worked on Metal Gear and Xenoblade Chronicles X, is also involved in the project. Does this do anything for you, Andrea? Nothing. At TGS, generally doesn't exactly. To be honest, I like the occasional Japanese game, but when I, I know Armored Core, we've talked about it a million times here where I understand you, you out there, Kinda Funny fan, see, like Armored Core. I'm glad for you, it's happening out there. Ah, Caleb, we're right. I just wait for Alexa Ray to",
            "start": 221.5
        },
        {
            "text": "about it a million times here where I understand you, you out there, Kinda Funny fan, see, like Armored Core. I'm glad for you, it's happening out there. Ah, Caleb, we're right. I just wait for Alexa Ray to explain everything to me. There's a lot for her to unpack as we continue to go through this. Monster Hunter: World is coming worldwide on January 26, 2018, to Xbox One and PlayStation 4, PC at a later date. Eric Myers writes into KindaFunny.com/KFGD and says, hey, Greg and Andrea, how well do you think Monster Hunter: World is going to do as a series? It certainly has name recognition and it's coming out in January. Seems like a smart move considering it's out of the way of the holiday rush. I'm personally interested in trying the series for the first time and I'm curious how many other people will be in the same boat. Thanks, your time, Erik. What's your prediction? Yeah, but do you have a read on the new Monster Hunter: World? I mean, I don't really have a prediction per se. Um, I think it's excellent",
            "start": 273.1
        },
        {
            "text": "in the same boat. Thanks, your time, Erik. What's your prediction? Yeah, but do you have a read on the new Monster Hunter: World? I mean, I don't really have a prediction per se. Um, I think it's excellent that, you know, it's coming to console. I think that's great. That's a good step. Monster Hunter was never something I really wanted to sink a lot of time into because it's a giant RPG in a sense that you have to probably dump a good 100 hours in before you even kind of like break into the, to the meat of the game. And that's like, that's a big commitment for a lot of people. So it just was never my thing. So my prediction, I think it's gonna do real well. Oh, no, it's gonna do excellent, I think. And I think it's gonna get new fans in as well as somebody who used to review the Monster Hunter games on PSP for IGN. That, you know, that, and this is at a time when I knew shit about Monster Hunter, but it was one of those, we reviewed everything. Here's what your assignment is. I went and did it and put a lot of time",
            "start": 314.56
        },
        {
            "text": "IGN that, you know, that, and this is at a time when I knew shit about Monster Hunter, but it was one of those, we reviewed everything. Here's what your assignment is. I went and did it and put a lot of time into it, worked with Capcom in terms of like having like Alicia come over and play with me with her 99, but Julian, our save, and showing me how to do this, that and the other, and learning the ropes of that game and coming to understand it, coming to respect it, coming to enjoy it. I remember when it came to Wii and it was that one that came to Wii with that controller, like its own special controller, and people there really liked it and got in. I remember like Charles Onyett and other people from IGN jumping on board in there. And I wanted to, but didn't just because I was like over my Wii, we're at that point. I think coming into, coming to consoles, coming Xbox One, coming to PlayStation 4, I think is going to capture obviously the install base that already cares about Monster Hunter, which is huge. And then I",
            "start": 358.3
        },
        {
            "text": "I think coming into, coming to consoles, coming Xbox One, coming to PlayStation 4, I think is going to capture obviously the install base that already cares about Monster Hunter, which is huge. And then I think it is going to be one of those things where even though, yeah, it's a huge investment, so are tons, me if, so is Destiny 2, right? And it's one of those, any, absolutely, people playing it and they're like, hey, this is awesome, jump in here and do these small level bosses with us and then come with us to drive to go for these giant dragons or whatever. I think it's Jeff. And the release date is a nice time period because it's late January, so they're probably had, they probably have a solid two to three weeks before we see anything in February, of possibly a month or two before we get like the late March or April releases. Yeah, whatever, places with God of War and all these different things. Exactly. Yeah, it'll be interesting. I think it's, I think it's, I think it's got a good obviously name recognition",
            "start": 394.78
        },
        {
            "text": "or April releases. Yeah, whatever, places with God of War and all these different things. Exactly. Yeah, it'll be interesting. I think it's, I think it's, I think it's got a good obviously name recognition share. I think it's at one of those games that's finally coming to a platform everybody really is excited about. And then, yeah, I think it is a good time period. A PlayStation also showed a new Shadow of the Colossus trailer. Final Fantasy IX is out on PlayStation 4 now, apparently, or out tomorrow, they were saying last night, which makes it confusing. Also, I was reading over, I think it's everywhere, but it might just be Japan. You got a check on that one for me, KindaFunny.com/You'reWrong, of course. Tell me what I screw up as I screw it up. But I assume it'll be coming out today on PSN. Zone of the Enders: The 2nd Runner Remastered is coming in Spring 2018 in Japan with VR support, 4K visuals. Noctis is joining Dissidia Final Fantasy NT. And I assume Alexa died somewhere when that wasn't us.",
            "start": 431.92
        },
        {
            "text": "Zone of the Enders: The 2nd Runner Remastered is coming in Spring 2018 in Japan with VR support, 4K visuals. Noctis is joining Dissidia Final Fantasy NT. And I assume Alexa died somewhere when that wasn't us. Dragon's Crown has been confirmed for PlayStation 4. It's coming to Japan on January 25th, 2018. Of course, this is rumored. Now we actually have it locked thing there. Japan Studio VR Music Festival is the upcoming PS VR experience which features various Sony Japan Studio franchises including Toro and Gravity Rush that we released in Japan on September 20th. Okay, what do you offer? According to GameSpot, Final Fantasy IX is available in the US at a discount for a limited time, dropping its regular price of $21 to $16.79 until September 26. Okay, I understand. What's the news with them? I'm not sure because it was, yeah, it's like, well, I mean, because it's like, it's, it's obviously a game that was released already. Okay, so it says, um, did you do go to, I don't know, like what the news is, go to IGN.com and tell",
            "start": 465.19
        },
        {
            "text": "yeah, it's like, well, I mean, because it's like, it's, it's obviously a game that was released already. Okay, so it says, um, did you do go to, I don't know, like what the news is, go to IGN.com and tell me what's going on with this Final Fantasy IX for PlayStation 4 out now. Why is that news if it's already been out? And I'm not young to re-release. Okay, you know, you're doing okay. Neko Atsume, oh, the cat collecting sim is coming to PlayStation VR in 2018. You might remember this game because one, the dark knight of news, Andrew Goldfarb over at IGN.com was obsessed with it for a while. I reached out to comment from Andrew Goldfarb, the biggest fan I know of Neko Atsume. I said, is this a big deal? What do you care about it coming to PlayStation VR? He says, he says, it means I get to look around and be surrounded by a bunch of amazing cartoon cats and once I go in, I'm never leaving. You can't stop me. Then he follows up, I think it's cool seeing weird unique stuff like this coming to PlayStation VR and it",
            "start": 522.51
        },
        {
            "text": "by a bunch of amazing cartoon cats and once I go in, I'm never leaving. You can't stop me. Then he follows up, I think it's cool seeing weird unique stuff like this coming to PlayStation VR and it gives me hope that Sony still has interest in small weird games. So according to Andrew Goldfarb, yeah, it will include trophy support, share button functionality, and remote play via the PlayStation Vita. It also includes HD versions of cut scenes and characters and autosave functionality has also added seven booster features including high speed mode, the ability to turn off random enemy encounters, and the master all abilities booster, which will allow players to automatically master equipped weapon weapons in gear. And players will be able to max out character levels, magic stone counts, and Gil using boosters. Okay, so this is different than the version that's are that has been out before. Correct. Gotcha. So this is the re-release, remaster, whenever, but not remaster, just a re-release. Oh, you did this thing like the",
            "start": 573.52
        },
        {
            "text": "so this is different than the version that's are that has been out before. Correct. Gotcha. So this is the re-release, remaster, whenever, but not remaster, just a re-release. Oh, you did this thing like the guy from the internet and then from Destiny. I want that emote. So go ahead, keep shit putting money in. And then Earth Defense Force: Iron Rain is in development in Japan. It's coming in 2018. This is back to IGN's verbage. Publisher D3 is calling Iron Rain a new territory for the EDF franchise as it looks to move away from his traditional style. This can be seen in the trailer as our narrator delivers despondent lines including, war is all we know, a far cry from the playful premise of a giant bug invasion. The other major difference, it looks a lot nicer than the mainline EDF game, even the upcoming Earth Defense Force 5, which has been shown, was, which was shown off at the same conference as well as you fighting bugs. Oh, so don't worry. So here's the thing, Andrew, yes, as predicted",
            "start": 613.03
        },
        {
            "text": "even the upcoming Earth Defense Force 5, which has been shown, was, which was shown off at the same conference as well as you fighting bugs. Oh, so don't worry. So here's the thing, Andrew, yes, as predicted yesterday on the show, a lot of announcements here really affecting the Japanese market and then obviously Western gamers who care about Japanese titles, right? Well, I think the takeaway from this outside of people being excited about this Final Fantasy, which I know whether you wrote in about either mad that you've to rebuy it again or excited that you get to play it again, outside of Left Alive having this really cool group that, you know, it's pulling from all sorts of people in Metal Gear and seeing the waves and everything else, is the fact that I, I'm, I'm with Goldfarb here that it's interesting to see VR keep popping back up and popping up with franchises that matter, right? Zone of the Enders is getting one that's super interesting. This Japan Studio thing is interesting, even though I don't",
            "start": 658.18
        },
        {
            "text": "to see VR keep popping back up and popping up with franchises that matter, right? Zone of the Enders is getting one that's super interesting. This Japan Studio thing is interesting, even though I don't know exactly what this musical festival's gonna look like or how it's gonna play. But the fact that it is first party PlayStation making something for VR, as we've been worried about what is going home with VR, and we talked, you know, with PlayStation at the GameStop Expo about, are you still committed to PlayStation VR? Is this still a thing? And then being like, you know, no, we are, and here's why, and showing, showcasing stuff that's coming along. And you're looking at the Supermassive game and all that jazz and what they have announced. It's interesting now to still see new announcements of our PlayStation VR. No, I mean, I don't, I mean, interesting, sure. But I mean, clearly it's a piece of hardware they plan on supporting for quite some time. So we're going to continue to get announcements and, you know, Paris",
            "start": 693.4
        },
        {
            "text": "VR. No, I mean, I don't, I mean, interesting, sure. But I mean, clearly it's a piece of hardware they plan on supporting for quite some time. So we're going to continue to get announcements and, you know, Paris Games Week is coming up. Hopefully we'll get some new game announcements there, some updates on some stuff that they've already announced. Then of course, PSX. Sure. I just think it's been doom and gloom for a while. What do you mean doom and gloom? That PlayStation hasn't, PlayStation specific, hasn't been talking about VR in the way of like, hey, here's a cool franchise, you know, here's Zone of the Enders that's actually doing something with VR rather than it just be, here's a VR game is coming out this week that we're not promoting too much. And that granted, there's Farpoint, there's other things they've come on done. But it's nice to hear new announcements. It's nice to see it on a press conference stage, which again, I think in the Western audiences is way more geared for PSX than this for E3, right?",
            "start": 731.53
        },
        {
            "text": "come on done. But it's nice to hear new announcements. It's nice to see it on a press conference stage, which again, I think in the Western audiences is way more geared for PSX than this for E3, right? Still, I think after Vita and after a move, like you're right to be gun-shy. And I think as much as we've talked to PlayStation spokespeople who've said, no, no, we're still involved and here's why. It's always nice to see more proof when we're not even asking for it. I can't disagree with that. Okay, good. Thank you. Number two on this Roper Report of how many, I don't know. Phil Spencer is now on Microsoft's Senior Leadership Team. This is via ZDNet. Microsoft is adding another of its executives to its Senior Leadership Team. I'm sorry, of top internal advisors in a move that indicates gaming is increasingly important to the future of the company. Microsoft CEO is informing employees today, September 19, that Phil Spencer, who is now Executive Vice President of Gaming at Microsoft, the SLT. Let's back to the",
            "start": 769.75
        },
        {
            "text": "important to the future of the company. Microsoft CEO is informing employees today, September 19, that Phil Spencer, who is now Executive Vice President of Gaming at Microsoft, the SLT. Let's back to the Senior Leadership Team. Microsoft's SLT now has 16 members, including that CEO. During his time at Microsoft, Spencer has been the head of Xbox, Microsoft Studios, and game studios before being named Executive Vice President today. Spencer is in charge of leading Microsoft's gaming business across all devices and services. The gaming organization is still part of Microsoft Windows and Devices unit. Microsoft has been looking to gaming as one of its main ways to help monetize Windows. Some of the company's new initiatives like HoloLens and mixed reality, as well as 3D for everyone, focused on the Windows team, are linked tightly to what Microsoft is doing in gaming. What do you think of this? Congratulations. Yeah, of course. I think the answer is a wonderful person. I've known him for several years now and",
            "start": 816.22
        },
        {
            "text": "team are linked tightly to what Microsoft is doing in gaming. What do you think of this? Congratulations. Yeah, of course. I think Andrea is a wonderful person. I've known him for several years now and I've had the honor to interview him on multiple occasions and he's just always so excellent. And what's great about Phil Spencer being at the top of a leadership org like Xbox is that he actually plays video games. There's a lot of execs that don't. And it's so nice that he's so connected to the video games community and he's thinking about what gamers want and what they want from Xbox and how he can translate what Microsoft has, a global business needs, and how he can kind of parry that as best as he can as, as the guy who's leading that team to make it aligned with what gamers also want from that brand. 'Cause it's tough. A lot of companies don't necessarily have that perspective. Sure. And so I think this is nothing but good news. Here's my one question, Andrea, final paragraph that I put in here.",
            "start": 858.28
        },
        {
            "text": "that brand. 'Cause it's tough. A lot of companies don't necessarily have that perspective. Sure. And so I think this is nothing but good news. Here's my one question, Andrea, final paragraph that I put in here. Because the article was on with more BS stuff that doesn't matter. ZDNet says Microsoft had been, gaming is one of its main ways to help monetize Windows. Some of the company's new initiatives like HoloLens and mixed reality, as well as 3D for everyone, focus on the Windows team and are linked tightly to what Microsoft is doing in gaming. Concerning at all, there's no mention of Xbox there. That they're talking about making my, bringing gaming in and monetizing Windows and talking about how they're doing this. And then the new technology is not mentioning Xbox One X. Granted, this is all a writer writing this through their lens for ZDNet, which is obviously a wider reach than GameSpot or IGN. And I should say wider perspective, I guess, in terms of who's coming to read those articles. It's more tech",
            "start": 907.06
        },
        {
            "text": "this through their lens for ZDNet, which is obviously a wider reach than GameSpot or IGN. And I should say wider perspective, I guess, in terms of who's coming to read those articles. It's more tech focused, right? The gaming focus. So I'm not surprised at the language that you see in that article. Why don't we take a look at some other articles and see how other people are mentioned it. Did Phil give a specific statement? Not that I've seen. I piggybacked off the ZDNet thing. Let's go to Twitter and see what he said. But it was a little Twitter. Strap in. Keep your arms down. Don't put any seat belts. Items may shift during your move to Twitter here. I'm Kinda Funny Games Daily. Remember playing Destiny, of course, 'cause he's a normal person who has no taste and stupid. He hasn't risen probably. In true fashion, he hasn't responded because it would probably seem a little arrogant to be like, I got a promotion. I'm over here doing this cool pending everything. So I'm great. I'm just putting it out there.",
            "start": 949.48
        },
        {
            "text": "fashion. He hasn't responded because it would probably seem a little arrogant to be like, I got a promotion. I'm over here doing this cool pending everything. So I'm great. I'm just putting it out there. That's all. And I'm not trying to be do man, take a shot at all. Hi. I don't find it alarming. I think you're being an alarmist right now. I'm just, I don't think Microsoft would invest millions of dollars in a new piece of tech and then just push it aside. Wait, who am I kidding? Of course they would. Microsoft has so much money. You find out where the gaming organization is still part of Microsoft's Windows and Devices unit. The Xbox hasn't spun out and do its own units. I think it is. Are you tell me ZDNet is lying in this article? No, I'm not saying they're lying. I guess I just, I don't know when that happened because I'm, I'm fairly confident that Xbox is its own unit. It should be. Well, why don't I tweet to him and see if he'll respond? Sure. Okay. I know it's KindaFunny.com/You'reWrong if you",
            "start": 994.89
        },
        {
            "text": "because I'm, I'm fairly confident that Xbox is its own unit. It should be. Well, why don't I tweet to him and see if he'll respond? Sure. Okay. I know it's KindaFunny.com/You'reWrong if you know something else. Maybe Phil can go there, register on the forums, answer all this for me. While you at the next item on the Roper Report. Another is literally one sentence. Square is hiring scenario staff for a Nier-related project. This is via Twitter. Found it on NeoGAF. Somebody translated it. It's all we know. There you go. And a lot of Nier fans, though, Nier are happening maybe kind of sort of years from now. Who knows? Next one's super simple too and not great for you audio listeners. Or I guess even if you're watching the show, Insomniac has a new logo. Thought that was interesting. They sent a cake. It was delicious. I am hopped up on sugar. I was quite, I was quite a handful on the morning show before this. What do you think of it? The cake or the logo? Logo. You have anything to say? It looks fine.",
            "start": 1041.64
        },
        {
            "text": "it was delicious I am hopped up on sugar I was quite I was quite a handful on the morning show before this what do you think of it the cake or the logo logo you have anything to say it looks fine it's like I like it I might think about it if you don't have it in front of you I mean obviously if you Google this real quick you remember the old Insomniac logo with the moon in the oh this one is more locked in bold text and then the oh now is like two semi circles that are blue and harkening back to the moon but moving on forward they I went like Insomniac put up a whole blog post about it and I went oh maybe they'll be stuff in here and it gets into that whole like graphic design this that oh my god this is a too heavy in terms of the space I just was wondering why you changed it and basically that being no they're not the same company they were when they made the real logo and putting the quotes in 00 that's when they started this other one there was a reminder revamp in 003 but time",
            "start": 1083.25
        },
        {
            "text": "that being no they're not the same company they were when they made the real logo and putting the quotes in 00 that's when they started this other one there was a reminder revamp in 003 but time to move on get ready for the Spider-Man I'm so excited I want to follow up on something we talked about before I'm going to Kotaku for this one Toys R Us has officially filed for Chapter 11 Kotaku breaks it down now faced with five billion in long-term investment debt and fierce competition from a rapidly changing retail marketplace toy and children's goods retailer Toys R Us has filed for Chapter 11 bankruptcy don't start mourning or sharing childhood memories just yet it's not it's not the shutting down sort of bankruptcy as it turns out Toys R Us is operating revenue hasn't been enough to make a major dent in their debt between competition with physical retailers like Walmart and Target and the rise of Amazon as a dominant online retail force operating revenue hasn't been great not only",
            "start": 1123.48
        },
        {
            "text": "a major dent in their debt between competition with physical retailers like Walmart and Target and the rise of Amazon as a dominant online retail force operating revenue hasn't been great not only as Toys R Us been unable to handle the debt the retailer hasn't been able to commit any money to efforts that might make it make them more competitive they need money to be competitive but they aren't competitive to make money that's where Chapter 11 bankruptcy comes into play like Chapter 7 which involves a company liquidating its assets and dissolving Chapter 11 bankruptcy is a restructuring aimed at giving a company a company in debt more flexible means which with which to address what they owe and resolve the situation for example Toys R Us has already secured a commitment of over three billion dollars in financing for various lenders and investors to help things keep running while Chapter 11 process takes place if all goes well Toys R Us could emerge from Chapter 11 protection in a much",
            "start": 1167.4
        },
        {
            "text": "dollars in financing for various lenders and investors to help things keep running while Chapter 11 process takes place if all goes well Toys R Us could emerge from Chapter 11 protection in a much better shape in much better shape to take on competing retailers online and offline there's still a chance it could all go south but the company remains hopeful that it will work out CEO Dave Brandon certainly seems optimistic in the official announcement saying quote today marks the dawn of a new era Toys R Us where we expect that the financial constraints that we have that have held us back will be addressed in a lasting and effective way all right it was we reported on the rumor this might happen right now it's happened as Toys R Us gonna pull out of this they gonna pull through I think if they can be absorbed by a larger retailer and remain an independent brand that would allow them to stay you know and yeah not go the way of Blockbuster but um it's tough I mean online shopping has hit a",
            "start": 1208.44
        },
        {
            "text": "can be absorbed by a larger retailer and remain an independent brand that would allow them to stay you know and yeah not go the way of Blockbuster but um it's tough I mean online shopping has hit a lot of brick-and-mortar retailers extremely hard yeah and if they can't keep up with their digital infrastructure and really service the the desire for people to buy things online then they're just going to fall away I mean this is why we're seeing even massive retailers like Walmart buying companies like Jet to try to infuse their online shopping experience to compete with Amazon I mean really it's like everyone's trying to compete with Amazon it's a tough market yeah the world right I don't think I mean I think this delays it obviously but I don't think there's a future forever for Toys R Us it seems so the reason Walmart can be Walmart in Kinston you want is that they do so much they're so diverse right and I think that's actually in the same breath what hurts Toys R Us is the fact that",
            "start": 1251.94
        },
        {
            "text": "it seems so the reason Walmart can be Walmart in Kinston you want is that they do so much they're so diverse right and I think that's actually in the same breath what hurts Toys R Us is the fact that you're at Walmart there's a toy department there you could get the toys you're looking for they're great not as much of a selection but then you could go to Amazon you could go to Walmart.com I don't know how many people about walking through a toy store I love Toys R Us I loved Toys R Us I've gone in one outside of a random place oh my god how am I going therefore to buy video games I get that off Amazon oh **** oh my did you anyway Andrea you don't know see yeah I like my I like my discs in the boxes shelf okay yeah what's your what's your balance right now you think you see is it all you still try to buy everything digital or or I'm sorry oh yeah I'm probably maybe somewhere between eighty twenty and seventy thirty physical versus digital I'm so still predominantly physical I'm",
            "start": 1303.87
        },
        {
            "text": "you still try to buy everything digital or or I'm sorry oh yeah I'm probably maybe somewhere between eighty twenty and seventy thirty physical versus digital I'm so still predominantly physical I'm still getting used to the idea that I have you know two terabytes of space and my new hard drive to like fill up with games but games are just I like keeping them I like being able to pop them in and play them whenever I want and just redownload them whenever you want no it takes too long well then garbage and trash out of your house stop it video games are not trash Greg Miller the future no the games aren't the goddamn boxes and plastic everywhere are these **** goddamn collector's editions with terrible statues I don't mind if you have a good statue when I get excited I get it is just this flimsy plastic statue I'm like oh you **** me good on this one do you have someone specific you would like to call out is DC Universe Online's Batman statue you sucked okay the enemy right I said it",
            "start": 1346.0
        },
        {
            "text": "flimsy plastic statue I'm like oh you **** me good on this one do you have someone specific you would like to call out is DC Universe Online's Batman statue you sucked okay the enemy right I said it cool goggles telling don't say and I said it had to be said according understands that Uncharted One that's a good one I have one of those yeah I'm sure you know I have one unopened in the box no one I'm trying to find a way to get rid of it give it away on What's Good Games maybe I will there you go I think again I didn't number these cuz I'm stupid yeah final item on the Roper Report Destiny 2 is flipping around the raid stuff this is via GameSpot stick with me strap in each weekly reset and Destiny 2 presents you with a slate of new things to do for the week including another batch of rewards and will - raid in a move that should help to keep feeling keep it feeling fresh from week to week the reset also apparently shifts aspects of the raid around the second weekly reset occurred",
            "start": 1394.84
        },
        {
            "text": "rewards and will - raid in a move that should help to keep feeling keep it feeling fresh from week to week the reset also apparently shifts aspects of the raid around the second weekly reset occurred earlier today and introduce this week's Nightfall Flashpoint and so on but this was the first one since the launch of the Leviathan Raid and we didn't know what to expect as previously announced any raid keys you were hanging on to have been removed from your inventory so you'll need to reacquire those each week when attempting the raid but more notable is the order of the major encounters throughout the raid Calus remains the final boss and that will presumably always be the case but the three trials that precede the fight are apparently not locked in into any specific setup according to users on Reddit whereas the raids first week had you tackle Royal Pools Pleasure Gardens and the Gauntlet in that order this week presents you with Pleasure Gardens then the Gauntlet and then finally",
            "start": 1437.17
        },
        {
            "text": "users on Reddit whereas the raids first week had you tackle Royal Pools Pleasure Gardens and the Gauntlet in that order this week presents you with Pleasure Gardens then the Gauntlet and then finally the Royal Pools before dealing with Calus the specific strategies for dealing with all these remain unchanged but am sorry and you can consult them in the GameSpot Destiny raid guide but this adjustment of the order has benefits for seemingly everyone the hardcore crowd that plans to regularly run the raid gets a significantly different experience from week to week and more casual players who can't necessarily make it through the entire raid yet will have an opportunity to figure out how to tackle the Pleasure Gardens this week last week they could only do so if they managed to complete the Royal Pools first Andrea yes we've put in a lot of time to the raid you put in more than me right now though with this moving around stuff because you are one of the hardcore Destiny people is I'm",
            "start": 1479.08
        },
        {
            "text": "Royal Pools first Andrea yes we've put in a lot of time to the raid you put in more than me right now though with this moving around stuff because you are one of the hardcore Destiny people is I'm this is my first raid I'm enjoying it I don't really care that they're movie things around - you know actually I think it's a good thing that they're moving it around because as somebody on my Twitter feed accurately pointed out if you never get to the final instance like if you never actually made it to the Gauntlet yeah then you would have to constantly be explaining to new people how to do it but now that it's rotating maybe you'll get the Gauntlet first and then you can enjoy ladies right exactly I kind of like it and it kind of makes it a nice little change of pace for people who were on the raid multiple times are you gonna be running the raid every week every week oh no it's way too much work to run it every single week and trying to organize it's not good but I definitely obviously",
            "start": 1515.65
        },
        {
            "text": "raid multiple times are you gonna be running the raid every week every week oh no it's way too much work to run it every single week and trying to organize it's not good but I definitely obviously need to get the trophy and then once I'm ready to run it on Prestige I'll try that eventually down the line but I'm definitely going to go for the Prestige Nightfall for that trophy instead of oh yeah no no the raid I mean like I'm gonna try it eventually once I'm like super-powered but generally what I'll do is I'll wait till the expansion comes out and then they raised the level cap and then you get like you know stronger and you can go back and do the Prestige and you're like ah I mean obviously still takes coordination but the the the ads aren't overwhelming you like they are right now what is your power level right now - 89 I think we're jumping in to Snuggle Grumps Snuggle Grumps roading yesterday that KindaFunny.com/KFGDD had his question make the sheep I wanted hold it for",
            "start": 1565.75
        },
        {
            "text": "is your power level right now - 89 I think we're jumping in to Snuggle Grumps Snuggle Grumps roading yesterday that KindaFunny.com/KFGDD had his question make the sheep I wanted hold it for Andrea he says or she how was your raid experience my group and I finished the raid last night I say finished because we wiped as the boss died we all sat there as our ghost balls watching the boss die we couldn't respawn and kind of broke the game we also ran into some other problems I somehow lost my chest keys and we ran into some other problems none of us got the achievement and only a few of us got the milestone completing completed saying we finished it I really just want to hear your experiences did you finish it have any problems like we did thank you for everything and keep up the good work there are definitely bugs in the raid that need to be fixed without a doubt particularly little glitches and problems when you are in the Mind's Eye in the boss fight so that's where we're up",
            "start": 1612.82
        },
        {
            "text": "work there are definitely bugs in the raid that need to be fixed without a doubt particularly little glitches and problems when you are in the Mind's Eye in the boss fight so that's where we're up there and the where I'm calling it the Shadow Realm yes you got sir so that's the fresh that's super frustrating because that part in particular requires such precision in order to make it through to actually get to the DPS phase of the boss fight real quick time out how many hours have you played this right 0 hours and in that time we probably rotated through at least a dozen different Guardians because what happens is is you play in one session some Joker's like oh sorry gotta go I'm like no man when you commit to the raid you commit to the raid yeah and I understand that when you're playing it for the first time it takes longer than normal because you gotta figure it out sure um and so we did a 5 hour session and then for my first stream I was a part of that for the first part yeah and",
            "start": 1654.28
        },
        {
            "text": "it for the first time it takes longer than normal because you gotta figure it out sure um and so we did a 5 hour session and then for my first stream I was a part of that for the first part yeah and then I did 3 hours on Saturday and then you join us we do like another like six hours and that was routine and like here's the things we did in six hours and that's when we got to the boss right yeah your skin our heads kicked in everything else right we spent 90 minutes just trying to figure out how to get through the Mind's Eye it's so hard I know like Nick makes fun of us when we talk about this year right but it's so hard even me on the outside before we were doing the raid or whatever where people would be like ah have we spent you know nine hours like I definitely want to spend nine hours trying to figure out this right away you're crazy you're an insane person playing that raid with you on Saturday night where it was literally like all right Jen's leaving and I'm gonna get dinner",
            "start": 1709.81
        },
        {
            "text": "trying to figure out this right away you're crazy you're an insane person playing that raid with you on Saturday night where it was literally like all right Jen's leaving and I'm gonna get dinner with her later or whatever and she busted 6:30 or whatever and then it was like we stopped playing at 1:00 or 1:30 yeah and there was a point where I was like we were doing it we're talking we're communicating I looked up the clock and I was like holy **** we've been playing for three hours and I was like I should say that but then we were like in the middle I'm like I'll say it in a bit I'll remind them cuz it it was good it was just like going sand through your hands and we went back and I looked up and it was holy **** we've been playing for four hours I haven't had a video game experience like that in a long time whereas literally just a time warp when it happened that day I took off where I blew out my eye the same thing every time I looked up four hours ago my like what the ****",
            "start": 1748.93
        },
        {
            "text": "like that in a long time whereas literally just a time warp when it happened that day I took off where I blew out my eye the same thing every time I looked up four hours ago my like what the **** is going on as possible and not only that to get our heads kicked in to make so little progress they're not even I'm so anxious to get my Guardian to 80 right and but I put in so much time in this raid where we didn't get that much gear and this didn't really happen that didn't happen but I still like this is so much fun yeah so much fun and it is Andy and I make fun of the E3 demos all the time when somebody's playing a multiplayer game like all right you go over there all right I'm reloading I got eyes on I'm like you know how they talk like that stage numbers like nobody talks like that that's how we're talking this rate you have to write like so far it's that's what's great about raids and like even though I woke up this morning and I tweeted that I'm a little salty about everyone",
            "start": 1783.67
        },
        {
            "text": "that's how we're talking this rate you have to write like so far it's that's what's great about raids and like even though I woke up this morning and I tweeted that I'm a little salty about everyone who's like oh we completed it we finished it because there was even some members who of the What's Good Guardians Clan who we rated with on Thursday that went and completed it with other groups yeah I came back and we're trying to help us get through the problem is is even if you like if you watch my stream from Twitch from yesterday when I was doing this boss fight for five **** hours for five minutes well what happened was is like I even though we got our suction in the Mind's Eye the three of us who were there like down to a science it didn't matter because all it takes is one tiny mistake from somebody on the other side in order to kind of like wipe the whole team and that's what's frustrating about about where we're at right now so another time I had to explain this is something he's",
            "start": 1821.29
        },
        {
            "text": "from somebody on the other side in order to kind of like wipe the whole team and that's what's frustrating about about where we're at right now so another time I had to explain this is something he's not playing Destiny but listen watching this show right is that you go into this boss's throne room all these ads come out you kill them and then he snaps and sends you into the Shadow Realm yeah and then you have to send half your team back down half the team stays up and then they need to communicate about what they're seeing in the Shadow Realm so that you can process of elimination figure out who you need to attack down there it's similar in an essence to the mechanic in Vault of Glass with the Atheon boss fight with warping through the portals but this is much more complicated because at least with that I felt like you could make a mistake you could have a Guardian go down and it wasn't the end of the world er yeah and now it's like if you have a Guardian go down you have 30 seconds",
            "start": 1862.24
        },
        {
            "text": "least with that I felt like you could make a mistake you could have a Guardian go down and it wasn't the end of the world er yeah and now it's like if you have a Guardian go down you have 30 seconds - or even less maybe no it's 30 to revive them and then if you don't revive them you're dead hmm like the whole thing wipes and you start you start to boss fight over again and that's incredibly frustrating especially when you only have one revive available which is like okay it's normally mechanics like that in in D1 we reserved for the Prestige level or the the hard mode of the raid which would make sense like make it harder it's already hard enough with all of the enemies that you're fighting and the mechanics it's just it's it's a little frustrating and like the bugs on top of that I kind of like uh like oh okay I'm done yeah but Who am I kidding I'm gonna try it again this weekend that's the thing it's like all I want to do is just sit there and get at my power level and come back to",
            "start": 1899.56
        },
        {
            "text": "of like uh like oh okay I'm done yeah but Who am I kidding I'm gonna try it again this weekend that's the thing it's like all I want to do is just sit there and get at my power level and come back to this because that was the thing even though we were signing off Saturday were like alright we'll try it again no way I'm not trying this again until I'm like 85 I was getting there in here and some guy was trying to like mansplain me today on Twitter about like did you use this gun you know you're supposed to use this gun useful to do this I'm like I know exactly what I'm supposed to do just couldn't execute as a team but that's a testament to the level design the Bungie has created so like let's get back to why we were able to stick in there for so long we always felt like we almost had it yeah because they made it engaging they made the puzzles just hard enough they made the exploration in the underbelly of a Leviathan really interest and kind of like a fun trick to solve with your",
            "start": 1945.28
        },
        {
            "text": "it yeah because they made it engaging they made the puzzles just hard enough they made the exploration in the underbelly of a Leviathan really interest and kind of like a fun trick to solve with your near fire team the music is great the art direction is great it's it's a really well done raid there's just a couple problems that I think that they should tweak to make it you know not so impossible at least on the regular level if you want to like amp up the difficulty for hard mode or Prestige absolutely that's what it's there for yeah but I shouldn't I never I never ran into this problem with any of the raids in original Destiny so goddamn it yeah I don't know here's the Destiny palette cleanser for you Tim writes in to KindaFunny.com/KFGDD just like you can and says hey now I really question but a comment so I've been a best friend since you guys left IGN I'm an introvert so I have never really been involved with the community I just want to thank you for opening up the Destiny",
            "start": 1986.32
        },
        {
            "text": "question but a comment so I've been a best friend since you guys left IGN I'm an introvert so I have never really been involved with the community I just want to thank you for opening up the Destiny 2 claim he's not my the Kinda Funny one Andy and I started without the carrot of possibly being able to play with you I doubt I would have joined the clan now I'm a way more engaged part of this community and Destiny as a whole I'm constantly check yeah I'm constantly checking the clan chat and already have a bunch of more friends on PSN I did the Nightfall of some best friends and I also got a chance to run through the Crucible with you Greg on Sunday and that was awesome thanks for giving me the opportunity to connect with other best friends Tim PSN DuPontTC4 thank you Tim I was fun playing with you and everybody remember that's what it's all about being best friends don't be shy go hang out with each other hit up the forum's hit up the Reddit hit up the Facebook group if you",
            "start": 2030.05
        },
        {
            "text": "playing with you and everybody remember that's what it's all about being best friends don't be shy go hang out with each other hit up the forum's hit up the Reddit hit up the Facebook group if you understand Discord hit that up that's I don't know I'm too old for this court I can't figure it out I don't know I'll show ya there's a million rooms ICESCR I don't know it's gonna Andrea yes we're playing Destiny we were but we will be for quite some time yes but if I wanted to know what came to the mom and pop shops digital and shops where would I go you would go to the official list of upcoming software across each and every platform as listed by the Kinda Funny Games Daily Show host each and every weekday yeah it's Tuesday there's a lot strapping 36 Fragments of Midnight comes to Vita Omega comes the Windows PC Blackguards comes to PlayStation 4 and Xbox One Burly Men at Sea comes to PlayStation 4 in Vita N Space comes the PlayStation VR Factum 90 comes the PlayStation 4 and Vita",
            "start": 2070.07
        },
        {
            "text": "comes the Windows PC Blackguards comes to PlayStation 4 and Xbox One Burly Men at Sea comes to PlayStation 4 in Vita N Space comes the PlayStation VR Factum 90 comes the PlayStation 4 and Vita Hidden Dragon Legend comes the PlayStation 4 Ink comes the PlayStation 4 Marvel vs. Capcom Infinite comes the PlayStation 4 Xbox One PC Mary Skelter Nightmares comes to Vita Mekko Tales comes to Vita Minecraft Story Mode Season Season Pass Disc covers PlayStation 4 Xbox One Minecraft Story Mode Season Episode 3 comes the PlayStation 4 Xbox One and PC Morphite comes the PlayStation 4 on Windows PC NBA 2K18 comes the PlayStation 4 Xbox One Windows PC and Switch I guess there was that early edition legendary thing that came out of Friday when we were talking Pankapu comes to PlayStation 4 Robonauts comes to PlayStation 4 Shop Keep coming PlayStation for The Binding of Isaac: Afterbirth+ comes the PlayStation 4 The Coma: Recut comes PlayStation 4 there is a Forza Motorsport",
            "start": 2112.55
        },
        {
            "text": "robot Robonauts comes to PlayStation 4. Shop Keep comes PlayStation 4. The Binding of Isaac: Afterbirth+ comes to PlayStation 4. The Coma: Recut comes PlayStation 4. There is a Forza Motorsport 7 demo and, and I think a first for this show, Significant Zero, Walt Williams' book, a book making it to the new release, comes out about his trials and tribulations in game development, which you might have heard of on the Kinda Funny Gamescast, which is live right now on podcast services and youtube.com/KindaFunnyGames. Matthew writes in and says, \"Greetings Greg and Andrea. I would like to start by saying a massive thank you to the Irish Cream Danny O'Dwyer for being a wonderful co-host the past few months. You've been a delight to listen to. Anyway, on to my point. I have just finished listening to last week's Gamescast and found Walt's views really interesting and witty, so much so that I'm going to order his book Significant Zero when I get home tonight. My question for you two are, can you\"",
            "start": 2166.58
        },
        {
            "text": "to last week's Gamescast and found Walt's views really interesting and witty, so much so that I'm going to order his book Significant Zero when I get home tonight. My question for you two are, can you recommend other books about game development that will provide an insight into the industry without taking itself too serious? And would either of you ever consider writing a book about your time in the industry? Lots of love, Matthew on the Isle of Man, parentheses, a small island between England and Ireland. Very interesting. I always jump to Console Wars by Blake Harris. That was a one that he had hit me up when he started, when it was about to get published, sent us, sent me prints for IGN with passes around. It's about, you know, Sega trying to come back and fight Nintendo and take them down. And that's a really great book. Andrea, I don't read nonfiction. Yeah, straight up. I read fantasy lit. Like that is it. So I can't recommend any specific books. I know that people love Masters of Doom. I was always one",
            "start": 2208.34
        },
        {
            "text": "a really great book. Andrea, I don't read nonfiction. Yeah, straight up. I read fantasy lit. Like that is it. So I can't recommend any specific books. I know that people love Masters of Doom. I was always one that people are really big on. Mm-hmm. I know that Mike Futter just wrote a book about game development. Dude, you had to about something about crunch. Let me look it up. You do it. Jason Schreier's book's coming out too, right? Blood, Sweat, and Pixels, which is like the behind the scenes on contemporary games. Talks about Uncharted 4 in there. I think Destiny's in there as well, in terms of like the unheard stories there. It's called The GameDev Business Handbook. Okay. All right, there you go. Faithful companion, how-to guide for growing your studio, featuring interviews with dozens of experienced developers. Nice. New date time. There's a new level for, oh, I Expect You To Die. I was like, I expected, I put two eyes in there, which make it look like, there's a new level coming for I Expect You To Die on October",
            "start": 2249.68
        },
        {
            "text": "date time. There's a new level for, oh, I Expect You To Die on October 4th. Ghost Recon Wildlands: The Ghost War beta will be available on all platforms from September 21st through the 25th, with preload beginning September 19th. This is the new 4v4 PvP mode. Dynasty Warriors 9 will be launching in early 2018 on PS4, Xbox One, and PC. And Shadow the Hedgehog will feature in Sonic Forces as free launch Day DLC. Meanwhile, deals of the day for you. This one I took from GameSpot, who took it from Wario64. If you've been wanting a PlayStation VR, but the prices kept you from buying, Amazon has a deal for you. For a limited time, you can get nearly 100 percent off the price of a PS VR plus camera bundle with the special discount, with a special discount code. The regular cost of buying the bundle at Amazon is 398 bucks. But if you type in the code PSVRSAVE, all one word, you can",
            "start": 2298.49
        },
        {
            "text": "PS VR plus camera bundle with the special discount, with a special discount code. The regular cost of buying the bundle at Amazon is 398 bucks. But if you type in the code PSVRSAVE, all one word, you can get it for just 300 dollars. The top code was tweeted by Wario64, which by the way, I would then recommend you to go to twitter.com/Wario64 and click through his link, because it's probably an affiliate link. He gets money for that. And Wario64 is incredible. If you're not fun, you're not following him, you absolutely should. Yeah, looks great. Let's jump into Reader Mail, Andrea. Let's do it. I'll tell you, it's brought to you by DraftKings. Football season has begun, but it's not too late to get closer to the game you love with DraftKings one-week fantasy football. This Sunday, DraftKings is hosting a $100,000 Pick'em contest that is totally free to enter. Pick'em is the newest way to play one-week fantasy football. Drafting your team is faster than ever. DraftKings has organized players into eight",
            "start": 2350.48
        },
        {
            "text": "$100,000 Pick'em contest that is totally free to enter. Pick'em is the newest way to play one-week fantasy football. Drafting your team is faster than ever. DraftKings has organized players into eight tiers. All you have to do is select one player from each tier. Choose between public contests with big cash prizes or private contests where you can compete against a group of your friends. DraftKings also has beginner and casual contests where you play against people of a similar skill level. The best part is, you get to draft a new team each and every week without any commitment. DraftKings.com/ no necessary DraftKings.com now and use the promo code KINDAFUNNY, all one word, to play in DraftKings' free contest for $100,000 in total prizes this Sunday. That's promo code KINDAFUNNY to compete for your share of $100,000 in total prizes. The contest is totally free to enter. Why wouldn't you try it? To DraftKings, the game inside the game. Eligibility restrictions apply. See DraftKings.com for",
            "start": 2396.46
        },
        {
            "text": "for your share of $100,000 in total prizes. The contest is totally free to enter. Why wouldn't you try it? To DraftKings, the game inside the game. Eligibility restrictions apply. See DraftKings.com for details. Where do I want to start with you, Andrea Rene? Cause I got some **** things to say to you. Okay, we got good questions. That was always, let's do two Destiny ones right off the bat. All right. Matt A. Playsright Cena says, \"Yesterday Kotaku published an article about playing Destiny 2 as a parent. Many people took to Twitter to voice their grievances with the author about the article and the headline, which was perceived as misleading. My question is, does this make it a successful article? I only clicked to read it once I saw so many people tweeting about it. Is this interaction intentional? And is it fair to the author? Presumably a copywriter and editor also worked on this, but the author received the brunt of the public backlash. Did you see this?\" I saw the headline. Yeah, it was like Destiny 2",
            "start": 2439.6
        },
        {
            "text": "to the author. Presumably a copywriter and editor also worked on this, but the author received the brunt of the public backlash. Did you see this? I saw the headline. Yeah, it was like Destiny 2 was impossible to play as a parent. I think something of that effect. Yes, I get that. What did you think? Did you read the article? I didn't, cause I'm not a parent. It didn't really apply to me. Um, but I play with lots of parents in my clan, so I'm not quite sure why they think it's impossible to play. I certainly think it's challenging to do anything in life if you have kids, based off, you know, my experience talking to my sister about her life with her son and other friends of mine that have kids and how they really have to, you know, rearrange their life around their kids' schedule, which, you know, as part of being a parent, I think the word impossible is unreasonable. Yeah. So if to bring you up to speed, it's from Kotaku UK. The title is, Destiny 2 is practically impossible to play if you're a parent. So,",
            "start": 2482.38
        },
        {
            "text": "part of being a parent, I think the word impossible is unreasonable. Yeah. So if to bring you up to speed, it's from Kotaku UK. The title is, Destiny 2 is practically impossible to play if you're a parent. So, practically. And is written by Keza MacDonald, friend of the show. She's been on the Gamescast before. Obviously, we worked at IGN. And it's start going through the fact that she's a new parent and it's her and her partner going through talking about this. Wait, so there's a difference also between having a newborn or an infant and having children that are, you know, starts. I had a baby nine months ago. As you might expect, this has exactly changed my relationship with video games, at least temporarily. It has made them intend to switch my favorite console of all time because I can play it both in the big screen and the occasional evening and in my hands. But going through most of all, it has erased my ability to join in with things like Destiny time-limited communal gaming experiences that",
            "start": 2524.05
        },
        {
            "text": "and the occasional evening and in my hands. But going through most of all, it has erased my ability to join in with things like Destiny time-limited communal gaming experiences that rely on having several hours of owner up trip game time at specific moments of the day. And we go on to talk this way. Really, that's only for raids. I don't know why you would need to be on a specific time unless you only want to play with specific people, in which case I would say you're missing out on the Destiny experience. I've met so many new players playing Destiny 2 with people I've never played with before. Sure. I was surprised there was such a hullabaloo about this that it got, that it was getting tweeted around. I saw other parents I follow tweeting me like, I don't agree with this. I'm playing Destiny if you and I have a kid in blah, blah, blah. I do think it's again, it's in the first nine months of this child's life, which make it a little bit more cumbersome to get around and get into something.",
            "start": 2566.29
        },
        {
            "text": "if you and I have a kid in blah, blah, blah. I do think it's again, it's in the first nine months of this child's life, which make it a little bit more cumbersome to get around and get into something. And I remember when Roper had his baby. Yeah, I couldn't play certain games, but he's playing Puzzle Quest a lot because he could play with one hand. I feel like that's, it's just such a small set of circumstances that she's filtering her experience through. Oh, sure. It's just a quick baby headline. You know, I think it's, it's fine to talk about your experience being a parent and how it affects your gaming habits. But to say something like practically impossible, it's because it's practically impossible because you only want to experience the game in a very specific way, because there's many options to play Destiny with, with matchmaking and with other people. First off, I love your nails. I just noticed. Thank you. The purple and the gold. Very nice. What up, Vikings? My response though, is what question I guess.",
            "start": 2610.12
        },
        {
            "text": "Destiny with, with matchmaking and with other people. First off, I love your nails. I just noticed. Thank you. The purple and the gold. Very nice. What up, Vikings? My response though, is what question I guess. Personally, I read the headline in like, month. I didn't mind. I didn't, I didn't jump to clickbait. I didn't jump to, but I read it as seeing come up. I'm like, oh, this is an opinion piece. Jump in. Sure enough, it's a very personal, this is what I'm going through. It's not a review. It's not her demonizing or selling Destiny. It needs to change for her whims. All right. Even in the end of her thing, she's like, you know, it's just not a game for me right now, kind of thing. And based on what she's going through, do you, would the reaction been different, you think, if it said like, opinion: Destiny? She was right. Like if that, that was out there front. Are people just getting mad without actually reading the content? No, I think people understand that it's an opinion. I mean, cause clearly, I mean, many people, many people",
            "start": 2649.66
        },
        {
            "text": "if that, that was out there front. Are people just getting mad without actually reading the content? No, I think people understand that it's an opinion. I mean, cause clearly, I mean, many people, many people disagree with the headline. Yeah. Um, I just think what's frustrating for me as a longtime Destiny player of hearing somebody say that, especially playing with so many parents, is that, um, I don't want her to turn other parents off of trying this game because her specific situation is just that, it's very specific. Okay, that makes sense. You know, so if you're a parent out there and you're worried about trying Destiny, you don't need to be on a very specific time of the day. Yeah, unless you want to do these raids, like we're talking, unless you're trying to coordinate a raid with a group of people. But once Guided Games begins and is on beta and is up and running, you'll be able to hopefully raid at almost any time of the day if you can, you know, find a group that's willing to trip you through. Yeah, and",
            "start": 2690.89
        },
        {
            "text": "Guided Games begins and is on beta and is up and running, you'll be able to hopefully raid at almost any time of the day if you can, you know, find a group that's willing to trip you through. Yeah, and everything else you can match me. You can do almost all of Destiny alone if you want to. So don't do that. Don't play with you. I mean, obviously it's more fun when you play with people, with meet people. Join a clan. Yeah, join the Kinda Funny Clan. Join the new, we have a second What's Good, Guardians Clan. Yeah, there's dozens now have Kinda Funny Clans, which is way it should be since there's only a hundred person limit, which sucks, but whatever. Yeah, I mean, I get from infrastructure side a number. So I'm the guy paying somebody to come in and delete my PSN friends. So I can't be sitting like me like, why should be everybody breaks everything? Really? Are you really paying someone to do that? Yeah, there's, I hear about this. No, regular and Kinda Funny is warlock. We can't fit any more people in this",
            "start": 2733.85
        },
        {
            "text": "why should be everybody breaks everything? Really? Are you really paying someone to do that? Yeah, there's, I hear about this. No, regular and Kinda Funny is warlock. We can't fit any more people in this office full-time. You know what I mean? Like we've done it. Yeah, hired our people. Greg Miller Industries is looking for one qualified candidate. Come in for a crisp $50 bill, a free lunch with Greg, and I'm gonna give him a game, right? Yeah. And then they can add themselves at the PSN list. But then I'm gonna have him sit there and just delete all my friends except for like, please don't delete me. I said that the one of the qualifications, obviously, have to be in San Francisco, cause we're not gonna fly here. Yeah. Other qualification is you have to like know the industry, right? We're in. Looks like, cause like again, no offense to Cool Greg, Big Cap Dog was like, you can just have Cool Greg do that. I'm like, I don't think Cool Greg is on the ball enough in terms of like, if he sees Jeff Gerstmann, don't delete Jeff",
            "start": 2773.69
        },
        {
            "text": "no offense to Cool Greg, Big Cap Dog was like, you can just have Cool Greg do that. I'm like, I don't think Cool Greg is on the ball enough in terms of like, if he sees Jeff Gerstmann, don't delete Jeff Gerstmann. Yeah, like somebody who consumes all the content. Am I right? That's, oh, that's fair. Cool Greg. All right, just making sure. Thank you. That's why we need it though. I don't send any. I, there was a whole thing in the morning show, send in application videos. I've gotten too many. I'm sorting through them as we speak. Okay. Except for the fact that right now I'm doing the show. But, you know, Samson, uh, I was gonna do this one. I feel like we're running out of time. You gotta go, right? Yeah, you got 15 minutes left here. Platinum in Destiny 2 comes from Who Does Who Says. Greg looks like your path to platinum in Destiny is well on its way. Do you think you will continue to play Destiny after you have achieved the platinum? There are so many games to play and trophies to earn. I find it hard to justify continuing",
            "start": 2811.48
        },
        {
            "text": "and Destiny is well on its way. Do you think you will continue to play Destiny after you have achieved the platinum? There are so many games to play and trophies to earn. I find it hard to justify continuing to play a game I've earned all the trophies in. Just curious your thoughts since you have been a join me game so much. PS: Destiny 1's first DLC did not include additional trophies. It was until The Taken King one year later that more trophies were added. Thanks, Who Does. I, I don't know. My plan right now is, yeah, platinum Destiny 2, which is going to take time. I'm about to knock out my Titan subclasses though. I got that shard already done. So I'll have that one done. Then I'll have to move over to the other one. Who's the other guy? Warlock. Warlock. I mean, these guys look like Jedi. I keep hearing, fine, whatever. I'll go in there and do that. Yeah, it's a great trophy list and I put in most of the work that I'm right there on most of them. Eventually we got this raid one. I've unlocked Trials of the Nine. I'll",
            "start": 2850.51
        },
        {
            "text": "whatever. I'll go in there and do that. Yeah, it's a great trophy list and I put in most of the work that I'm right there on most of them. Eventually we got this raid one. I've unlocked Trials of the Nine. I'll be trash at it. Off the hit up, hey, who's **** awesome? I mean, Simon's will take. We just got a win one. We just got a 1/1. You know, I got you. Okay, cool, cool, cool. My plan though would be that right now, short, which is hard to say because you're in the middle of it. Once I platinum Destiny, right now I'm not playing Destiny 2 and having a great time because I'm worried about the Platinum. The Platinum is something I'm like, oh yeah, I should do some work on that. Like Jen wanted to start her character this week and, oh cool, I'll start a new Titan. I'll start a Titan to go through and get that out of the way. I'm not sitting there like thinking about all the trophies because the trophies gonna come naturally as you play the game. My hope would be that once it's platinum and I'm great at the raid and I know",
            "start": 2887.65
        },
        {
            "text": "I'm not sitting there like thinking about all the trophies because the trophies gonna come naturally as you play the game. My hope would be that once it's platinum and I'm great at the raid and I know all that stuff that I'll keep coming back when there's like, oh, I need to get my stats up to this or I need to do that because there's, there is a cap, right, on how much power you can get. Yes, but we don't know the cap yet. I don't think like these people who are rolling another character, they didn't go get weapons so then transfer them back to themselves and then infuse them. Like that ain't gonna be me. That's where I'm gonna draw the line. You know what I mean? Like I want my power level to be great. You say that now, we'll see. But I think, I think I'll keep playing it. I'm excited for the December content drop. I want to keep playing with you. I'm having a great time with the clan. Like I'm using the clan chat too, which is weird to be out there with Portillo and like ask questions there, cause it's",
            "start": 2925.19
        },
        {
            "text": "content drop. I want to keep playing with you. I'm having a great time with the clan. Like I'm using the clan chat too, which is weird to be out there with Portillo and like ask questions there, cause it's like so much nicer. No offense to the Destiny subreddit, but there was some question I had where I went and posted it and didn't get a response. But I put in the clan chat, immediately responds. Okay, great. My top level, I just need this quick answer. Here it is. And then it was like, hey everybody, I'm gonna just run Crucible for a while and try to grind out this trophy and get some XP. Anybody want to join me? I'm opening up for friends and client. And people joined on me and was like, it's **** rad, right? And like when I do need to run it, when you're not available, you don't play it. I want to run a raid and yeah, I got Andy or something. Like I hope to stick around. I think I will. But we'll see. Figure I, you know, do you for DC Universe Online? I platinumed, kept playing for a while. Great years and",
            "start": 2958.98
        },
        {
            "text": "a raid and yeah, I got Andy or something. Like I hope to stick around. I think I will. But we'll see. Figure I, you know, do you for DC Universe Online? I platinumed, kept playing for a while. Great years and years and years. Am I gonna keep playing, you think? Yes. Okay, cause it's fun. I'm addicted. And that's genuine. I came home yesterday and she had been playing more with her character and I saw she was level 20. I'm like, oh, awesome. And then she was like, oh, but I waited. I say, I saved the story stuff to do with you. I mean, your second carry, do this story. Do not. I just need the subclass thing. I have the shard and I throw in public events. All I want to do. I do miss the daily story missions. That was always a fun way to get some in-game rewards. But you're not doing that right now, right? Aaron DeWood writes in the KindaFunny.com/KFGD, just like you can, and says, \"Why the **** is everyone trying to squeeze PUBG in the Game of the Year discussions? There's sort of accolade provided just by putting in the",
            "start": 2991.35
        },
        {
            "text": "KindaFunny.com/KFGD, just like you can, and says, \"Why the **** is everyone trying to squeeze PUBG in the Game of the Year discussions? There's sort of accolade provided just by putting in the conversation. PUBG doesn't deserve to be talked about when we have a plethora of quality games released this year: Zelda, Horizon, Persona, Hellblade, and probably Mario, to name a few. When you break down PUBG, it's just a great game mode as a single entity. That's **** it. There's no stories. Janky graphics suck. And there's no content. The tech is great at 100 players, but also expected at this day and age. And the game is undoubtedly fun. But how does it contend with, argue with some of the best games of the past few generations? Overwatch checked all the boxes last year and ran away with Game of the Year title from many esteemed critics, including IGN. PUBG really only checks the fun box. Well, I keep fighting for PUBG. Does it really stand a chance? Or is it just, it's just for recognition sake, dragging\"",
            "start": 3037.7
        },
        {
            "text": "title from many esteemed critics, including IGN. PUBG really only checks the fun box. Well, I keep fighting for PUBG. Does it really stand a chance? Or is it just, it's just for recognition sake, dragging the Kinda Funny crew? You're all amazing and I'm really gonna miss the Irish Cream Danny O'Dwyer. Thanks for all you do. Aaron DeWood.\" Aaron, you took the words right out of my mouth. When I heard Tim and Greg discussing this yesterday, I was like, no, no, no, no, no. There is no way. There is no way PUBG wins Game of the Year in anybody's book. Will it win maybe best shooter or best action-adventure? Potentially. Yeah. But there is no way it's beating Zelda at the end of the day. I'm a Horizon Game of the Year person, but it will never be Zelda for Game of the Year. Like, come at me if you actually think PUBG is going to be Zelda for Game of the Year. Okay, we, this is, do you think PUBG would be Zelda on some people? Yeah, for some list. No, I'm talking about actual credentialed media outlets. Your people who are",
            "start": 3082.55
        },
        {
            "text": "going to be Zelda for Game of the Year. Okay, we, this is, do you think PUBG would be Zelda on some people? Yeah, for some list. No, I'm talking about actual credentialed media outlets. Your people who are actually voting for game, having a conversation. Call and I or somebody and I had, maybe this Tim, I forget. We did something on this where I forgot what game it was where I argued it would win. And I gave, we gave 10 outlets and like, in edit, four or five of them gave it a Game of the Year. Four out of, we're talking now, I don't think a single outlet will give PUBG Game of the Year. Okay, well, before I shake your hand, well, we're gonna come back to this on Thursday. We will build a list. We will sign this bet. We will put a steak dinner on the line, Jim Riley style. Okay. All right, cool. I'm put that in psych. I, I mean, why I think he, why do I think it's gonna win? Again, don't get me wrong. I wanna, I'm not cast my vote for PUBG. I think that if you were to ask me to put together a top 10 list of nominations, I",
            "start": 3131.63
        },
        {
            "text": "would put it on their top 10. It's a completely different conversation. Hey, I'm with you. Just saying, I'm with you. When it's gonna be that do't argument. If he were like, well, yeah, there was all these games that were more polished and more story and I played for this and I have great memories of. But I've played this game 500 hours and I've done, well, what I played Destiny for 500 hours and I never thought it should be a Game of the Year contender. Sure. But you're balanced up here. A lot of other people name these Dota kids. They ain't that. Mitch Dyer, Brian Albert. These people are **** crazy. Dyer didn't actually think Dota should win game. I don't know what he thought anymore. You know, I know you're listening to this show. Write us in. Let me know. You wait to me. What's he gonna vote for this year for?",
            "start": 3172.28
        },
        {
            "text": "actually think Dota should win Game I don't know what he thought anymore you know I know you're listening to this show write us in let me know you wait to me what's he gonna vote for this year for Game of the Year Star Wars all right great he's biased Oh what do I want to talk to you about now sure mmm oh my doubled up no **** Andrea you get to pick okay we can either talk we're gonna end on this Fortnite cross-play stuff okay but we're either gonna talk right now about a remote play or we're going to talk about Uncharted and expectations because both are callbacks to yesterday's show yeah you you listen do you understand what I'm saying yes um I mean I feel like we've talked about both of those you want to move on we don't have to do well here's the thing like we've talked about Uncharted and expectations several times no I'm the new one Uncharted going back and playing old Uncharted rumor this kid yesterday Uncharted 1 that sucks right you suck I find if they tickling your",
            "start": 3212.48
        },
        {
            "text": "Uncharted and expectations several times no I'm the new one Uncharted going back and playing old Uncharted rumor this kid yesterday Uncharted 1 that sucks right you suck I find if they tickling your fancy we're moving on to Garrick Garrick writes in and says it was reported yesterday by IGN that Fortnite had a brief period of cross-play over the weekend where Xbox One and PlayStation 4 players were playing together yes it was actually reported what it showed up on Reddit and then everybody picked it up I saw it yesterday when I was with compiling Kinda Funny Games Daily News but at that point it was literally the Reddit are not read and I apologized NeoGAF arguing with each other of like well maybe they were signed into this maybe they were that Beauvoir and I was like I don't want to get into this I don't have anything for you ah Epic Games responded Garry continues saying that there wasn't cross-play due to an accidental configuration issue then Derrick says angry Greg voice why",
            "start": 3264.41
        },
        {
            "text": "get into this I don't have anything for you ah Epic Games responded Garry continues saying that there wasn't cross-play due to an accidental configuration issue then Derrick says angry Greg voice why how and what you're telling me that this game is designed for cross play from the get-go why is it not always turned on what's keeping Epic Games from allowing cross play all the time and why won't you hey let us change our PSN name well Garrick the reason Epic isn't allowed to do cross player isn't allowing you to use cross play is because of the platform holders and the agreements they sign to go on there this is not news Rocket League talks about this all the time right that there's literally one box they need to tick and then everybody would be playing but PlayStation doesn't want that Minecraft Xbox mobile PC all enough Switch all playing together or about to I think is in beta right now but not on PlayStation 4 because PlayStation won't allow that it's just PlayStation doesn't want",
            "start": 3306.59
        },
        {
            "text": "Xbox mobile PC all enough Switch all playing together or about to I think is in beta right now but not on PlayStation 4 because PlayStation won't allow that it's just PlayStation doesn't want that they don't want you using other ecosystems they don't want other users coming in there on the back end I'm sure there's a bunch of stuff happening in terms of why this is what the agreement is maybe they're talking maybe they're not Xbox is always walking up to ever you see Phil Spencer walks into a men's room there's a microphone there and he grab he's like wait we're open across play but it's you know I mean like they're all about it like hey it's this clearly on them so where that goes and where that conversation that's out I don't know but it has been known that that's the thing and it was interesting that it actually got live for a little bit I have to hope that PlayStation is talking to Xbox about this issue the problem with developers kind of jumping the gun on the platform",
            "start": 3351.74
        },
        {
            "text": "it was interesting that it actually got live for a little bit I have to hope that PlayStation is talking to Xbox about this issue the problem with developers kind of jumping the gun on the platform holders making the call themselves is that clearly PlayStation has kind of dug in their heels on this for four reasons that they are not outwardly disclosing the children remember Jim Ryan said the children think it was children Andrea we know that that's BS so like I think we can you know take guesses as to what these reasons are but Sony has not publicly said what their real reasons are for this as a fan of the idea of cross play being able to get all of the guardians in my Destiny 2 clan to be able to cross play together would be so incredible yeah I want it to happen but the realist in me know that like if we as the community try to force them to do this that they kind of it's not gonna like benefit as I feel like PlayStation's in that or like this position where they just need to take",
            "start": 3388.79
        },
        {
            "text": "know that like if we as the community try to force them to do this that they kind of it's not gonna like benefit as I feel like PlayStation's in that or like this position where they just need to take their own time coming to the solution that they want and not be pushed into it have you ever been in a situation where you feel like people are just kind of dogpiling on you but then you get stubborn about it and you're like well because you're dogpiling on me I'm not gonna do it and ever so I feel like that's where PlayStation's at right now and I think that they are probably open to the idea of it but because everyone's like so aggressive like you're **** you won't let us do it why won't you just let us do it and like I think if we all just maybe look at this from a different lens cuz screaming at them clearly isn't working yeah right maybe I'll just take a step back say okay you take your time you work it out we will tell you respectfully that we want this it's I mean that's the way",
            "start": 3443.77
        },
        {
            "text": "at them clearly isn't working yeah right maybe I'll just take a step back say okay you take your time you work it out we will tell you respectfully that we want this it's I mean that's the way you say hey that's a cool feature we'd really like that maybe using a different approach using a different tactic might get the result that we want instead of us being like an angry mob and going after time so just food for thought on a such a smaller scale I mean look at today with the time code thing where I've seen random people and things like why don't they have time goes Easy Allies as time goes Bo wah and they get thumbs up and sometimes the people are really mean about it's whatever you guys started a movement with the little flames about wanting time codes of the YouTube comments I'm like you're not being dicks and that's actually cool but like suddenly all the comments were like time codes, fireballs are like alright cool let's try it well see yeah it's gone today I don't know um so far",
            "start": 3488.06
        },
        {
            "text": "you're not being dicks and that's actually cool but like suddenly all the comments were like time codes, fireballs are like alright cool let's try it well see yeah it's gone today I don't know um so far so good so far so good Danny I don't think can read so I'm worried about him trying to type Andrea yeah time to squad up but instead I'm gonna ask you to go to KindaFunny.com/you're wrong because I need to get you out of here I'll wrap the show without you okay let's see anyway sorry so if we screw something up while we record the show live of course you can go to KindaFunny.com/you're wrong tell us what we screwed up we'll set the record straight everybody out there has a good time and dances with somebody on the street they don't know okay here we go um Final Fantasy IX came out for PS4 last night globally alright covered that that's another thing okay that's not a thing great tips I'm like that's not what your wrong is for um we can talk about it later also it's",
            "start": 3528.53
        },
        {
            "text": "9 came out for PS4 last night globally alright covered that that's another thing okay that's not a thing great tips I'm like that's not what your wrong is for um we can talk about it later also it's something I've already discovered thank you very much I learned it the hard way you keep looking figure out you're wrong as a fact we screwed up if it's literally like yesterday who you know who else would you want to see guest host the show here is rate tip something KindaFunny.com/KFG cuz I read every one of them and then I'll filter out if I need to Jason Schreier's book came out on September 5th damn it's on my bookshelf I have it haven't read it yet but damn I'm so level cap is 305 ok it says hi Andrea it's me LonelyBeerTV hello thanks for hanging out with me came towards chat last night and super good advice that's not a you're wrong we will yeah that's it so just the Jason Schreier thing in the level cap perfect get out of here okay thanks Riley help Andrea goodbye I'm not",
            "start": 3570.18
        },
        {
            "text": "last night and super good advice that's not a you're wrong we will yeah that's it so just the Jason Schreier thing in the level cap perfect get out of here okay thanks Riley help Andrea goodbye I'm not gonna go it let me get the last time code oh we're gonna go into squad up right you're squatting up right now this is where one of you writes in to KindaFunny.com/KFG you tell me your name you use your name the platform you're playing on why you need help I read it all here kids come and find you they help you and everybody has fun today Torin writes in he's on PlayStation 4 he needs help his PSN is Poopa Loompa that's P oo mpa underscore Lu I'm sorry l oo MPA Poopa Loompa hey everyone my younger brother and I are struggling to do the Nightfall strike to complete the Rat King exotic quest this is Destiny 2 - if you're not a complete loser like myself and doesn't understand and I'm joking because I make for myself I'm not saying we're losers with Destiny Nick got in my head got",
            "start": 3629.8
        },
        {
            "text": "this is Destiny 2 - if you're not a complete loser like myself and doesn't understand and I'm joking because I make for myself I'm not saying we're losers with Destiny Nick got in my head got demon anyways back to Poopa Loompa if any best friends can help us out that would be awesome I live on the west coast and my brother is in Hawaii and with school / work it works best to play on the weekends many best friends want to help us out that would be great and maybe even join our clan Lupul and the claim is Loompaland that's **** awesome I'm a big fan of that he says thanks again I say there you go if you want to run the Rat King quest in Destiny 2 - and how about Poopa_Loompa hit him up on PSN PlayStation 4 that squad up was brought to you by Skillshare Skillshare is an online learning community for creators with more than 17 000 classes in design photo and more categories can be altered depending on audience and channel oh that's what I mean cuz I was when you do these",
            "start": 3685.75
        },
        {
            "text": "learning community for creators with more than 17 000 classes in design photo and more categories can be altered depending on audience and channel oh that's what I mean cuz I was when you do these ad reads right they put in there like here's where you can talk about whatever you want to talk about but I was like designed photo and more actually work out well for all of you right cuz I take photos for Instagram of course design you guys are designed and stuff and then we're about to talk about the French stuff and then Tim talked about before I digress Premium Membership gives you unlimited access so you can keep learning find inspiration and take on new projects whenever you want the first 500 people to use the promo link and I'm gonna read below remember it's confusing from yesterday we'll get there first two months free and then it's as low as 10 dollars a month after that to continue learning if you like or cancel if you don't there's no risk you can learn from anywhere download",
            "start": 3730.15
        },
        {
            "text": "get there first two months free and then it's as low as 10 dollars a month after that to continue learning if you like or cancel if you don't there's no risk you can learn from anywhere download the mobile app on Android or iPhone and tap into classes even when you're offline I brought up yesterday and I still have to do it three-minute French they got on there so I can actually learn what the hell Jen's family saying about me and then of course Tim brought up for video production that they have a bunch of stuff in there like you go in there you can learn bite-sized tutorials like 10 minute stuff about a very specific thing rather than jumping into a giant hour-long video and not understand what the hell's going on Joey Noelle is coming in here what's going on oh okay cool thank you John Drake for looking out for the hinging the first 500 people sign up will receive a two month free trial you need to go to Skillshare's website and put this in again is gonna sound confusing it's SKL.sh dot",
            "start": 3768.76
        },
        {
            "text": "for looking out for the hinging the first 500 people sign up will receive a two month free trial you need to go to Skillshare's website and put this in again is gonna sound confusing it's SKL.sh/kindafunny to start your trial now so SKL.sh/kindafunny to start your trial now if you're watching on YouTube.com/KindaFunnyGames the links down below in the description that makes it pretty easy to click on and go do the thing no rotating segment today tomorrow's hosts Danny O'Dwyer remember this has been Kinda Funny Games Daily each and every day we run you through the video game news you need to know about before give me a perspective answering your questions and hanging out with you because we're all best friends if you like that it'd be awesome to go over to Patreon.com/KindaFunnyGames kick us a couple bucks you can do it just once you don't have to do it forever doesn't be a thing just do a one-time donation here at so many people love the show if",
            "start": 3804.54
        },
        {
            "text": "over to Patreon.com/KindaFunnyGames kick us a couple bucks you can do it just once you don't have to do it forever doesn't be a thing just do a one-time donation here at so many people love the show if you don't got the money no big deal of course you can watch it live on Twitch.tv/KindaFunnyGames as we record it you can go to YouTube.com/KindaFunnyGames and subscribe for today it's been my pleasure our pleasure to serve you Joey's, Andrea isn't my pleasure to serve you nailed it",
            "start": 3853.38
        }
    ]
}