{
    "id": 2967,
    "video_id": "GHWA8pSzZD0",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Anthony Carboni"
    ],
    "title": "Destiny 2 Day - Kinda Funny Games Daily 09.06.17",
    "description": "You've got tons of Destiny 2 questions. Let's see how many Anthony Carboni and Greg can answer. Thanks to DraftKings and Leesa for sponsoring this episode. Go to http://www.draftkings.com and use promo code kindafunny. Go to http://www.leesa.com/kindafunny and use the promo code: kindafunny.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1504731682,
    "duration": 2765,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to Kinda Funny Games Daily for Wednesday, September 6, 2017. Hey, Andy Cortez, is it Destiny 2 Day? Everybody on every host, Greg Miller, alongside, hi, I'm Anthony Carboni. So you do so much stuff, there's no easy way to introduce. Short Star Wars shows, not returns, yep, those are them. CarboniSexTape.com, mm-hmm, and that's, I run that, I own that, every revenue stream, that's how you make money. How excited for Destiny 2 are you? I got a couple hours in with my, with my beautiful boy last night. Yeah, was it nice to be reunited? It was nice to be reunited. If you, if you recall, when I was here on Monday, yeah, I had said that I was gonna, gonna roll me a new, roll me a new boy, and what'd you do? Did not. I saw my, saw my classic boy looking at me all happy, slightly upgraded shaders and polygons. How great is that intro where they go through, they show you like what you, here's the things you've accomplished, here's who you did it with, memories, yeah, ah, near-death experience, life",
            "start": 0.28
        },
        {
            "text": "and polygons. How great is that intro where they go through, they show you like what you, here's the things you've accomplished, here's who you did it with, memories, yeah, ah, near-death experience, life flashing before your eyes. So good. It was good, man. So I went with my classic boy. Nice. Line. It was great. It was great. How was your experience been? Awesome. Yeah, I just want to keep playing more. Played all yesterday with Andy Cortez, then went home, played more. We're gonna play after this if you're watching live on Twitch.tv/KindaFunnyGames or anymore. It's gonna be me, Anthe, and Andrea Rene from What's Good Games. Hey, sitting here with TV screens. Oh, playing together. How wonderful. In person fireteam. We're pretty stoked about it, baby. No, it's, gentlemen, this is Kinda Funny Games Daily each and every week to end a variety of platforms. We run you through the nerdy video game news you need to know about. We jump in, give you some perspective, answer your questions, maybe read your bad PSN names, have a",
            "start": 60.7
        },
        {
            "text": "week to end a variety of platforms. We run you through the nerdy video game news you need to know about. We jump in, give you some perspective, answer your questions, maybe read your bad PSN names, have a great time. And today we're and talk about a lot of Destiny stuff. You can watch live when we record it at Twitch.tv/KindaFunnyGames. However, we don't look at the chat. Instead, you can only go to KindaFunny.com/You'reWrong. Chime in, tell us what we screwed up, as we screwed up just the facts, ma'am. I don't want your editorializing. So that when people watch it on YouTube.com/KindaFunnyGames and listen on podcast services around the globe, thank you so much, they get the record set straight, they get one great show, and everybody has a good time. Housekeeping: Party Mode is live right now on YouTube.com/KindaFunnyGames. Check that out. And like I said, we're streaming Destiny 2 right after this, and we're streaming Destiny 2 right after this, except for tomorrow.",
            "start": 100.63
        },
        {
            "text": "right now on YouTube.com/KindaFunnyGames. Check that out. And like I said, we're streaming Destiny 2 right after this, and we're streaming Destiny 2 right after this, except for tomorrow. All week tomorrow, we're streaming the Gamescast afterwards, where we'll talk about Destiny 2 and kind of review and stuff like that. But for now, let's begin the show with what is and forever will be the Roper Report. Five items on the Roper Report today. A Cheeto is not a chip. That's fair. Thank you. Thank you. Thank you very much. Anything. I was a good guy. My drama. Number one, if you haven't noticed yet, Destiny 2's Clans won't be live for a while. Bungie tweeted, quote, in game Destiny 2 clan features will be unavailable for the first several days after launch. Stay tuned for announcements of availability. IGN expanded a bit, not with any more information on it, but more of what's happening with clans. If you're unfamiliar, clans are communities of like-minded Destiny players who are able to journey",
            "start": 136.02
        },
        {
            "text": "IGN expanded a bit, not with any more information on it, but more of what's happening with clans. If you're unfamiliar, clans are communities of like-minded Destiny players who are able to journey through the game together and benefit from each other's achievements. Although they exist in the original Destiny, they were only accessible through the Destiny website and function essentially in the background. And Destiny 2, much like the story of Destiny, they've been overhauled and brought to the forefront of gameplay, featuring, featuring in the user interface and allowing Guardians to join their fellow players on-the-fly, creating fireteams with other clan members and leveling the clan up as individual members work their way through the game. Does this break your heart, Anthony? No, because my own personal meta game with online multiplayer games to see how much of it I can do alone anyway. Social player. Yeah, unless it's, unless it's with specific friends that I, that I know IRL, I'm very, I'm a lonely",
            "start": 180.27
        },
        {
            "text": "meta game with online multiplayer games to see how much of it I can do alone anyway. Social player. Yeah, unless it's, unless it's with specific friends that I, that I know IRL, I'm very, I'm a lonely boy. Sure. Video game. So did you ever join a clan last time? I did not. I did not. Lone wolf in it. And lone wolf in it. We all know that one. Well, yeah, yeah. How about you? Yeah, we formed an IGN clan, I think, early on, and I was in it, but I never used it for anything. Yeah, I, I never raided in the original Destiny, 'cause like I had fallen off by the time all that really started happening, right? And so we've made, there's a lot of kids tweeting me last night about, hey, I want to join the Kinda Funny raid where, or the clan, where is it? I'm like, well, again, there's one up on the forums in the Facebook people have made, but there's only a hundred in there. And so I say, just go off and make it. We made one, me and Andy, and that we're getting again, a get Gary Whitta, and we're pretty stoked about it. Mouse Cards Gary Ackley.",
            "start": 218.16
        },
        {
            "text": "there's only a hundred in there. And so I say, just go off and make it. We made one, me and Andy, and that we're getting again, a get Gary Whitta, and we're pretty stoked about it. Mouse Cards Gary Whitta. And go through that, have that ready, and just do it. But I'm not opening that up 'cause it's gonna be keen. I hate, it's so complicated to get people in and get them out. And like, I really, maybe I'm wrong, I want to see what happens with my addiction to Destiny 2 before I invite other people into it, 'cause I only let them down. And I've also found that clans and, and sort of factions in different games to me really serve a peripheral purpose. Like, I joined one in, I joined one in Injustice 2 just because like I wanted to play Multiverse planets, sure. And then I found that most people play it the way that I do, where like nobody was talking to each other. Nobody. Exactly. Yeah, we'll see how important Destiny makes clans and how well they integrate it and what they do. And based on that,",
            "start": 263.32
        },
        {
            "text": "play it the way that I do, where like nobody was talking to each other. Nobody. Exactly. Yeah, we'll see how important Destiny makes clans and how well they integrate it and what they do. And based on that, yeah, sure, I'll join a clan, but I'm not too worried about them not being a cap on it of a hundred people. I really don't want to go in and take somebody's spot that's not gonna, in that exact, especially because they are leveling it up and doing these different things. Like me and Andy **** around, whatever, who cares? Yeah, totally. And I, you know, much like the raids, much like the first raid not being available this week, we're all grinding out our first character this week. So I think that's totally for some people. I mean, aren't even grinding that. I'm seeing like, like I was playing, there was level 20 people playing last night. That's when he's like, you guys, it's crazy. I did get to ten. Nice. I got to ten. I went to bed. Yeah, that was the thing. I don't want, I don't want it all to go, you know, away, and I don't",
            "start": 301.51
        },
        {
            "text": "playing last night. That's when he's like, you guys, it's crazy. I did get to ten. Nice. I got to ten. I went to bed. Yeah, that was the thing. I don't want, I don't want it all to go, you know, away, and I don't to get too far away. Rush it, man. Yeah, I'm not gonna let the, the peer pressure rush me through. They don't do it. You ain't, man. Rush it, so **** why you rushin'? Uh, number two on the Roper Report, Mahatma Gandhi. That was Pimp Juice by Nelly, actually. Yeah. Abraham Lincoln. Okay. WB won't profit from Shadow of War DLC via Eurogamer. Had you been following this last week, Anthony Carboni? I wasn't following much last week because of PAX. So Mike Forgey, he, or maybe Forgey, there's just, there's debate on the internet of how to say, because he's little. If you, anyways, doesn't matter. Passed away. He was working on this game, right? They put him in as an Orc that you can get as DLC. They can be on your team. They'll save you the last minute. It's really cool. The truck's great. Trailer almost makes you cry. WB says, and",
            "start": 335.02
        },
        {
            "text": "this game, right? They put him in as an Orc that you can get as DLC. They can be on your team. They'll save you the last minute. It's really cool. The truck's great. Trailer almost makes you cry. WB says, and when they put it out, part of these profits are gonna go to his family. Not all of them. Part of them are gonna go the profits, right? $3.50 of every purchase. I'm gonna pick up with, all right, last week we reported on Mike Forgey, who died at 43, do this. And it's a Forgey Orc Slayer. Warner Bros. is selling before we, this is the other thing, Forgey Orc Slayer DLC for $4.99. And it said it would donate $3.50 of every purchase to the Forgey family throughout, through the 31st of December 2019. However, small print in the trailer for the DLC revealed that WB Games would only donate money to the Forgey family from purchases over the Forgey Orc Slayer DLC made from most of the states in the US, thus excluding countries outside of the US. The small print suggested that if you're in Europe and you buy the DLC, none of the",
            "start": 375.55
        },
        {
            "text": "over the Forgey Orc Slayer DLC made from most of the states in the US, thus excluding countries outside of the US. The small print suggested that if you're in Europe and you buy the DLC, none of the money would go to the family. This detail, buried as it was at the end of the trailer and in a YouTube video description, led to some, led some to accuse Warner Bros. of at best a failure of communication, at worst profiting from the death of, profiting from the death of an employee. We followed up, this is Eurogamer again, we followed up with the Warner Bros. to ask an explanation, and it sent over the following statement, quote, neither Warner Bros. Interactive Entertainment nor Monolith Productions will profit from any sales of the Forgey Orc Slayer DLC, regardless of the territory in which the DLC is sold. Period. End of statement. Okay. Eurogamer picks back up. Now this statement, while frustrating in its lack of clarity, does suggest that no matter what, which territory you buy the Forgey Orc",
            "start": 421.32
        },
        {
            "text": "the DLC is sold. Period. End of statement. Okay. Eurogamer picks back up. Now this statement, while frustrating in its lack of clarity, does suggest that no matter what, which territory you buy the Forgey Orc Slayer DLC from Warner Bros. will make its $3.50 donation. For me personally, this is even worse of a PR move. You know, people, because what happened is he got announced, we talked about on the show, I think it was Tim and me, and we, I was like, this is awesome. It's a really cool way to honor him. I'm glad they're doing this. I'm glad they're getting to work on something for the friend. I'm glad money's making its way to the family. And then when it was like, well, it's like, because it's weird, it's like excluding certain states, right? And I was like, that, I understand certain states have weird **** rules about charity and taxes in this. I understand you can't do it. But where is that money going? If I'm in Illinois and I buy this, where do you have money go? Like, Warner Bros. really needed to get in front of",
            "start": 460.98
        },
        {
            "text": "charity and taxes in this. I understand you can't do it. But where is that money going? If I'm in Illinois and I buy this, where do you have money go? Like, Warner Bros. really needed to get in front of this because it was, we're like, oh, it's still cool, it's business. He kind of understand it all. And then it was like, um, a TotalBiscuit like took him to task. They did like a 10-minute video of like, this is **** ****. The shortest video Jon has ever made. Of course. Yeah. I charity, charitable rules, giveaways, donations. I mean, you know, you've, you've run charity marathon stuff before. It's complicated. Yeah, you have to, there, there are things, there are ways you have to report things, ways you have to give things, ways you have to set up even taking the money into your accounts. So I understand it. But when you're trying to clear up the fact that you're not profiting off of someone's death, no, like really go into detail. Exactly. Feel free to give me a paragraph instead of a bullet point. You know, and that's",
            "start": 501.33
        },
        {
            "text": "trying to clear up the fact that you're not profiting off of someone's death, no, like really go into detail. Exactly. Feel free to give me a paragraph instead of a bullet point. You know, and that's what's gonna happen here. This is a totally, you've bundled it and maybe the situation worse. Yeah, because this isn't, and there's going to now have to be another statement, a blog post from Monolith being like, hey, well, how it's going, even ending this with, we're gonna follow up with a breakdown of how this. Yes. Yeah, yeah, that's totally fine. 'Cause I understand even making this statement and then thinking to yourself, man, I got to organize and collate all this information. Say that you're doing that. Yeah, say that you're doing that. Get off. This is even worse, I feel like, than what the original statement was. 'Cause you risen, all right, cool. But then, yeah, what's like, why if it's excluded in states and countries, what are you talking about? How is that going to, how are you gonna donate them? That's like me walking out",
            "start": 548.89
        },
        {
            "text": "you risen, all right, cool. But then, yeah, what's like, why if it's excluded in states and countries, what are you talking about? How is that going to, how are you gonna donate them? That's like me walking out of like a Walmart as a teenager with like, with just like stuff, video games shoved down my pants. So me being like, Walmart guy being like, hey, did you put those back on the shoving? Like, yeah, we're good. I did. No, I did. That's what it comes off on. So I'll wait. I'm sure in two more episodes of the Kinda Funny Games Daily, we'll have another update on this. Yeah. Number three, that everyone from everybody from WB Games has run off to the Cayman Islands all off the Forgey DLC. They all live in Switzerland now. Pokémon Company's CEO, Tsunekazu Ishihara. You wanna take a crack at that name? Because I have to sound it out. Sure. That's Tsunekazu Ishihara. I wish I could do stuff like that. You're very impressive. He didn't believe in the Switch. This is according to Bloomberg. This Bloomberg has video. IGN translated it or",
            "start": 587.35
        },
        {
            "text": "that's Tsunekazu Ishihara. I wish I could do stuff like that. You're very impressive. He didn't believe in the Switch. This is according to Bloomberg. This Bloomberg has video. IGN translated it or not translated, copied it down it into text that I use. So here are the quotes from it. I told Nintendo that Switch wouldn't be a success before it went on sale because I thought that in the age of the smartphone, no one would carry around a game console. It's obvious I was wrong. I came to realize the key to succeed. Oh, xxxx. Well, stick it, Tsunekazu Ishihara. I came to realize the key to a successful game is quite simple. Software with absolute quality leads sales of hardware. Playing safe can be flexible if the software is attractive enough. Playing style, playing style taught me. Thank you very much, Tsunekazu. It's just so rare that somebody who knows how to host and read shows up on this show. I'm glad you're still that still hasn't happened to. Playing style can't be flexible if the software is",
            "start": 628.06
        },
        {
            "text": "Tsunekazu. It's just so rare that somebody who knows how to host and read shows up on this show. I'm glad you're still that still hasn't happened to. Playing style can't be flexible if the software is attractive enough. Then he goes on to talk about making games and how Pokémon might or might not work and stuff. So I'm gonna give you these quotes as well. Yeah, with the Switch, he explained, we see it as a chance to create Pokémon that goes deeper and with a higher level of expression. As a result, that makes it an extremely important platform. Right now, we're using seven to eight inch screens, but on a high definition TV, you can express a whole different world with graphics and sound. Until now, games were made as one, one for one person. But now you can go home and play with everyone. So how do we tackle these themes and how do we make sure it's not complicated? It's not in this back to IGN. It's not entirely clear whether the thinking centers around this, which is a, the Switch console's innate social",
            "start": 674.32
        },
        {
            "text": "these themes and how do we make sure it's not complicated? It's not in this back to IGN. It's not entirely clear whether the thinking centers around this, which is a, the Switch console's innate social aspects, split Joy-Con play or more familiar online play. As for whether a new Pokémon game would come with extra peripherals, previous games have introduced the Pokéwalker, the Pokéwalker, Pokéwalker, and Game Link ZR. Totally. Come on, guys. E-Ring toys. He said, quote, I can't say that we'll release accessories, but I'd like to think of that possibility. I got a lot of thoughts about this. Do you like Pokémon? Uh, I do like Pokémon. I'm not Pokémon obsessed, sure, but I know enough people that are. Yeah, it's, it's really funny and really telling about the relationship between the Pokémon Company and Nintendo because every once in a while, because it feels like such a, such a synergistic relationship at times, you think you can't think of one without the other, really. Yeah, but it's really funny to every once in a",
            "start": 714.37
        },
        {
            "text": "every once in a while, because it feels like such a, such a synergistic relationship at times, you think you can't think of one without the other, really. Yeah, but it's really funny to every once in a while see how much power the Pokémon Company has in sort of decision-making and stuff. Because where's my Pokémon game on the Switch? That's the first thing everybody was thinking. Is that what everybody was thinking last year? It's what everybody was thinking this year at E3. And it's really funny that it's just like, oh no, we didn't believe it. The other thing that I find is really interesting is the, golly, how would we make a multiplayer Pokémon game? And how would that work with online? And how would that work when everyone's connected to each other? He said, ignoring 50 fan games that have literally made it work. Everyone says, oh wow, MMO Pokémon. Yeah, yeah. Uh, it's very interesting, but I'm glad, I'm glad he's on board. Yeah, I'm glad we got our favorite Lightning Rat coming to the Switch. It's, it's, it's",
            "start": 758.5
        },
        {
            "text": "it work. Everyone says, oh wow, MMO Pokémon. Yeah, yeah. Uh, it's very interesting, but I'm glad, I'm glad he's on board. Yeah, I'm glad we got our favorite Lightning Rat coming to the Switch. It's, it's, it's interesting and cool to see him being honest about it. Yeah, head of like, yeah, I don't think it's gonna be good. And then you can read the tea leaves and that's why we didn't get one. And then also then why it is that, because it was that weird thing of like, oh, Nintendo just tacked on this thing of him being like, we're gonna make a Pokémon for this thing. Yeah, it's like, oh, 'cause they were worried like, it is the number one requested thing. I would love to not see hardware accessories. I'd love to see less plastic tchotchkes from Nintendo this generation. Yeah. Period. Yeah, I think I would venture a guess that you wouldn't. I don't, I mean, these are all different in the Pokéwalker, right? Like that was part of it because, all right, cool, you're, you wanted this for your portable game, your portable games in your",
            "start": 800.55
        },
        {
            "text": "you wouldn't. I don't, I mean, these are all different in the Pokéwalker, right? Like that was part of it because, all right, cool, you're, you wanted this for your portable game, your portable games in your bag. You want to make, making progress. Nintendo so clear all the **** time about this is a console. Yes, the call say it's so outmoded now. I feel like they have the, they have the Switch app. They have Pokémon Go. I feel like there are very interesting ways to connect whatever the Pokémon Switch game is to your smartphone if they wanted to add that sort of functionality. I'd like to think we're gonna see fewer, I don't know, microphones and cameras and boomerangs and whatever the hell it has. Nintendo makes, never count them out. You don't know. Always could be a boomerang. Number four, Suda51 has finally given some details on this. Travis Strikes Again. I thought this might be one of your games. Of course, announced over the weekend. Everybody was like, what is, or the Nindies event, I guess, last week. Yeah.",
            "start": 844.26
        },
        {
            "text": "given some details on this. Travis Strikes Again. I thought this might be one of your games. Of course, announced over the weekend. Everybody was like, what is, or the Nindies event, I guess, last week. Yeah. They were talking. Suda51 was talking to GameXplain, and then IGN put it down into words. According to an interview Suda gave to the YouTube channel GameXplain, Travis Strikes Again will feature similar gameplay to the first two No More Heroes games, which employed a mix of motion and traditional button controls. The game will feature motion controls, but more importantly, it can be played entirely with one Joy-Con, Tony. According to Suda, co-op play was not confirmed, but Suda hinted that it was something that was on their mind. Yeah, love and No More Heroes. I love it. No More Heroes. It's that you want motion controls back, huh? No, No More Heroes was better without the waggle control. They did the, when they did the PlayStation Ultimate version or whatever it was, I was like, oh great, finally No More",
            "start": 882.3
        },
        {
            "text": "motion controls back, huh? No, No More Heroes was better without the waggle control. They did the, when they did the PlayStation Ultimate version or whatever it was, I was like, oh great, finally No More Heroes on PlayStation. Yeah, so I'd like to see a, it sounds like there will be options, so that's good. You can play it either way. Yeah, that's fine. More choices, never bad. What was your takeaway? Oh, I mean, 'cause it's like, it's Shovel Knight's involved, you know, Hotline Miami's involved. They're bringing all is, are you worried this is not, not going to be a No More Heroes? He was very clear in the interview as well, like, this is not a seat, this is not a numbered sequel to No More Heroes. No, well, I think it's interesting because No More Heroes came at a time when the sort of self-aware mixing of pop culture universes wasn't happening as much in major stuff. Like now we're used to it. Now we're used to a world where like somebody in a movie can be, can have like a favorite comic book that you have, or a favorite",
            "start": 923.54
        },
        {
            "text": "wasn't happening as much in major stuff. Like now we're used to it. Now we're used to a world where like somebody in a movie can be, can have like a favorite comic book that you have, or a favorite, you know what I mean? Spider-Man and Civil War can talk about Empire Strikes Back. Exactly. So, uh, Return of the Jedi. I like that. I like that Travis Touchdown plays Hotline Miami because of course he does. Yeah, that's his game. Like, that's totally a dude who would play Hotline Miami. So I, I'm, and the original game had this sort of mixing of like, it's a video game, but now it's a video game like within a video game within a video game. And so I feel like this will all play very, very well. You're more like, sometimes it would go 8-bit, sometimes it would go like 16-bit with like little mini games and stuff. So I like it. You're all over a Suda. I love, I love that boy. He's a good boy and he makes good games. Okay, good boy. Good time for your fifth item on the Roper Report. And it's also your dies. It seems every",
            "start": 963.59
        },
        {
            "text": "I like it. You're all over a Suda. I love, I love that boy. He's a good boy and he makes good games. Okay, good boy. Good time for your fifth item on the Roper Report. And it's also your dies. It seems every other day update for PUBG and how it's dominating the world. Like how I snuck that in at last. PlayerUnknown himself tweeted, 10 million copies sold. 10 million sold. Never did I think we would reach such a number. Thank you all for your continuing support of the PUBG team. Where that's amazing. Heart. And then GameSpot gave some context of this. PUBG has hit another milestone. On August 27th, for the first time, it became the biggest game on Steam in terms of concurrent players, temporarily surpassing Dota 2. Wow. PUBG is now far, now far outpacing. Today's peak player count was over 960,000 compared with 73,000 for Dota 2. That still isn't an all-time record as Dota 2 has topped 1 million before, but PUBG may get there yet. Golly, man. GameX173 chimed in by writing.",
            "start": 1008.65
        },
        {
            "text": "was over 960 mm compared with 7 3 thousand for Dota that still isn't an all-time record as Dota has topped 1 million before but PUBG may get there yet. Golly man, GameX173 chimed in by writing in to KindaFunny.com/KFG D, just like you can, and says, \"Hey Kinda Funny Crew, I read today that PUBG has sold over 10 million copies and I swear it was only about two weeks ago that you mentioned it was at 8 million sales. It was at Gamescom. My question is, how many copies do you see PUBG selling and will it go down as one of the greatest games of all time? Thanks for all you do, GameX173.\" Greatest games of all time is something that's early to say, hard to tell. I think it's so subjective. Yeah, where my, I think that's easier, that's for me, honestly, that's the more interesting part of the question. Yeah, what does PUBG sales gonna top out at? I have no fucking clue. Not anybody does. They haven't even gone on like any sort of, any sort of like major sale yet. No, yeah, yeah, and it's that",
            "start": 1053.71
        },
        {
            "text": "the question. Yeah, what does PUBG sales gonna top out at? I have no fucking clue. Not anybody does. They haven't even gone on like any sort of, any sort of like major sale yet. No, yeah, yeah, and it's that thing of like, and remember like whenever they, when they start doing sales or bundles or things like that, most games on Steam get a second life. They get like a huge bump inside. Well, don't forget too that like when you talk about like life to date sales of this as a franchise, like it's coming to Xbox One, it's not even there yet. And then out, you, and I, I would bet the house that then it's coming to PlayStation 4 as well. Like, and the people who have already bought it on PC, like myself, to play a few rhymes, be like, \"Oh, this is really cool. I'm 1,000% buying that again when it comes to course on Xbox One and then probably PlayStation 4 again,\" where it's one of those, the sales are gonna continue to go fucking crazy in terms of how far this is. I think at the very least, we've reached the point where PUBG",
            "start": 1104.2
        },
        {
            "text": "and then probably PlayStation 4 again, where it's one of those, the sales are gonna continue to go fucking crazy in terms of how far this is. I think at the very least, we've reached the point where PUBG is a cultural touch point for games. Whether it be considered one of the greatest games of all time, I don't know. It depends on how you're ranking greatest games of all time, and that's such a subjective list. My thought on the prawn thing will be no, it won't be. I don't think it'll go down as a game it's remembered as one of the greatest games of all time. I think it's gonna go down as one of the most fondly remembered games of all time. And this is always the arguments we get in at IGN trying to do these top 100 lists or whatever, right? Is the fact that mechanically it's a little clunky and a little weird when you watch it and stuff like that, but the experiences you're having with it, right? You know, in a lot of ways, it's the same reason I'm so excited for Destiny 2 is the fact of like me, Andy, and",
            "start": 1146.38
        },
        {
            "text": "when you watch it and stuff like that, but the experiences you're having with it, right? You know, in a lot of ways, it's the same reason I'm so excited for Destiny 2 is the fact of like me, Andy, and Andrea today playing together and going after, I don't, well, the story's cool so far on Destiny 2, but I'm not gonna get to the end to be like, \"Fuck what emotional tales me, oh, so much fun, fuck around with my friends forever.\" Exactly. And this is the same thing. Well, that's why that, yeah, that's, we talked about it on Morning Show, when Destiny starts with the memories, yeah, it makes sure not to just show you, \"Hey, here are all the major things you event that you, you completed.\" It shows you the, the players that you completed it with, because it is about those stories. We're, and when I say like this will be a cultural touch point, the last few years and maybe the next few years in games are about the sharing of emergent and unique stories within games. Yeah, not so much the story of Breath of the Wild, not so much",
            "start": 1187.4
        },
        {
            "text": "touch point. The last few years and maybe the next few years in games are about the sharing of emergent and unique stories within games. Yeah, not so much the story of Breath of the Wild, not so much destroying Ganon, but the different things that I did that you didn't do when we were destroying together, the things that we do together online when we're playing these games. And when people go back to talk about that trend years from now, this game will be brought up. Exactly. Yeah, and I think it's gonna continue to sell. It's in the same argument though of like, is Dota one of the greatest games of all time? I don't know if I even have, I don't have, I literally don't have enough information personally to tell you if that's true. I think so. Yeah, I think so. It's been around for so long and it, and it's like, like you said, it's subjective. Like, are we, are we comparing it mechanically to things? Who knows? But can we name 10 other games that have like multi-million dollar televised tournaments? Not yet, but",
            "start": 1223.55
        },
        {
            "text": "like you said, it's subjective. Like, are we, are we comparing it mechanically to things? Who knows? But can we name 10 other games that have like multi-million dollar televised tournaments? Not yet, but it's not, yes. Then I use the same argument too, is GTA V one of the greatest games of all time? Cause that, those sales are enormous, right? So last time, at last check, it was still the best selling game in the UK this year. Yeah, it's one of those where sales are great, and sales that when we sit down, you talk about the greatest games of all time, I think you're always gonna be like, \"GTA III.\" I think I was gonna talk about that GTA that changed everything. Whereas GTA V Online is awesome and continues to sell that game. The stories were cool and multiple characters, but, but it's a, it's a refining, it's a comic, we're finding and building. Yeah, this is a sales don't equate to this is the greatest thing of all time. I think absolutely not. Yeah, it's like, it's like saying box office makes the greatest movies. Exactly.",
            "start": 1262.91
        },
        {
            "text": "finding and building. Yeah, this is a sales don't equate to this is the greatest thing of all time. I think absolutely not. Yeah, it's like, it's like saying box office makes the greatest movies. Exactly, right? Well, buying, that's the thing. Well, then man, that killing with this DC extent. Hell yeah. Oscar award-winning squad. Oscar award-winning. Soon as which Oscar, we don't gotta me award, won an Academy Award probably for Jared Leto. Probably just a singer, man. I can't wait to see what the numbers net out for PUBG. And also like the way this thing is, look at Minecraft when it launched and look at Minecraft now, right? And the things that got refined and changed and added and just, and that's the thing. Well, this is early dangerous versions of this game. Yeah, exactly. Early days, Anthony. I can't wait to play PUBG on my Xbox One and then eventually my PlayStation 4 in Turin trophies like a real man. Eventually on my, eventually on my most of my smartphone and on my Nintendo Switch. But those games aren't",
            "start": 1304.43
        },
        {
            "text": "PUBG on my Xbox One and then eventually my PlayStation 4 in Turin trophies like a real man. Eventually on my, eventually on my most of my smartphone and on my Nintendo Switch. But those games aren't, heard it here first, those games aren't out yet. Anthony, if I wanted to know what came to mom and pop shops today, where would I go? Why, you would go to the official list of upcoming software across each and every platform as listed by the Kinda Funny Games Daily show hosts each and every weekday, as if you needed me to tell you. Out today, Destiny 2, Xbox One, PC. Like the only game that could possibly compete with Destiny can be thrown, Senko no Ronde 2, on PC. I'll tell you, it was tough for me to decide. I know, right? Well, I mean, like it's that thing, you can't play Destiny 2 on your PC. Yeah, so clearly, yeah, this is, so if I'm a PC gamer only, does it calculate? It's a Senko no Ronde 2. And you knew you had to get in there. You had to get a part of it. New dates where you Call of Duty",
            "start": 1352.79
        },
        {
            "text": "PC. Yeah, so clearly, yeah, this is, so if I'm a PC gamer only, does it calculate? It's a Senko no Ronde 2. And you knew you had to get in there. You had to get a part of it. New dates where you Call of Duty: Infinite Warfare fourth DLC pack Retribution is coming to PlayStation 4 September 12th. And then Pinball FX3 and Universal Classics Pinball come to PlayStation 4 on September 26th. That from that dark cinematic universe. Apparently that's exactly their dark, their dark universe. I get a Tom Cruise tip. Do you care about these pinball games? I like them every once in a while. Yeah, but I tend to like, I think if you're gonna do a pinball game, I like it a little more in the, in the way of like a Sonic Spinball or whatever that, whatever that great Capcom one was, where like the camera thing, the, the camera would keep changing and you had like little mini games that were actual video games. I'm just saying, I'm playing pinball on a console. I understand they're a pinball purists. Yeah, yeah, a little video",
            "start": 1401.84
        },
        {
            "text": "would keep changing and you had like little mini games that were actual video games. I'm just saying, I'm playing pinball on a console. I understand they're a pinball purists. Yeah, yeah, a little video game to my pinball. Well, that's always the difference I think, right? With Zen Pinball and Pinball FX. Yeah, if memory serves, Zen Pinball is the crazy one. They make the Walking, they make the Walking Dead Telltale game, yeah, table, the All Star Wars ones. And then Pinball FX is like, these are real cabinets, these play like they really felt. Exactly. And they were great. I was into him. I mean, with like a toe in the water with 1V first when they first on the Vita. Yeah, cause I remember playing one at the DMV when I stuck there for like, oh yeah, they were great. You could turn it, you could turn your Vita. So there's cool there. It's hard, it's just crazy they're still making it. But I know there's definitely, I know Sam Claiborne, Scott Bromley, people are obsessed with pinball. They're all over it. And I'm",
            "start": 1444.23
        },
        {
            "text": "so there's cool there. It's hard, it's just crazy they're still making it. But I know there's definitely, I know Sam Claiborne, Scott Bromley, people are obsessed with pinball. They're all over it. And I'm glad this is there for them. Good time for Reader Mail, which is brought to you by DraftKings. You've been waiting for this since February 6th. The football season is here and there's no better way to get closer to the game you love than with DraftKings one-week fantasy football. To celebrate, DraftKings is hosting $100,000 contests this Sunday that's totally free to enter. And if you draft the perfect lineup, you can win 1 billion dollars. Choose between public contests with big cash prizes or private contests where you can compete against a group of friends. DraftKings also has beginner and casual contests where you'll play against people of similar skill levels. So billion-dollar, thank you, Anthony. Get to DraftKings.com now and use the promo code Kinda Funny to play in DraftKings free contest for",
            "start": 1478.46
        },
        {
            "text": "where you'll play against people of similar skill levels. So billion-dollar, thank you, Anthony. Get to DraftKings.com now and use the promo code Kinda Funny to play in DraftKings free contest for $100,000 in total prizes this Sunday. And if you draft the perfect lineup, you can win 1 billion dollars. That's promo code Kinda Funny to play this for your shot to win one. So why wouldn't you try DraftKings, the game inside the game? Eligibility restrictions apply. See DraftKings.com for details. 1 billion, you're just putting too many in there. You know, Aaron Boerner writes in to KindaFunny.com/KFG D, just like you can, and says, \"Hey Greg and Mr. Carboni, well, when Destiny launched last night, there was a mystical, magical digital queue to be able to get in-queue.\" We warned you about this, Aaron. Kinda Funny Games Daily, of course, this has become the standard for launch. You have pretty much every large online game, and yet there were many who seem surprised and/or furious and having to wait. My question",
            "start": 1523.7
        },
        {
            "text": "Games Daily. Of course, this has become the standard for launch. You have pretty much every large online game, and yet there were many who seem surprised and/or furious and having to wait. My question is, who gets the blame here? Should game companies build huge expensive infrastructures that launch and scale down over time, or should gamers do a better job expecting these launch delays? Huh? You know, I don't think it's that they didn't build a huge expensive infrastructure for Destiny 2. I think, I think they definitely did. I think you, you will never, you will never be able to truly estimate how many concurrences you're going to get day one, night one. Yeah, and you are, no matter how huge a system you build, you want to throttle it a little bit. I gotta say, my queue wait wasn't very long. How long? Mine was about three, four minutes. I think it was, it was not bad. Right at nine. See, I did a thing where I had the code ahead of time, so we played all yesterday. No queues, of course, at all. Right? And then in fact,",
            "start": 1583.36
        },
        {
            "text": "about three, four minutes. I think it was, it was not bad. Right at nine. See, I did a thing where I had the code ahead of time, so we played all yesterday. No queues, of course, at all. Right? And then in fact, it was so, know what the population was so small that I got, you know how it randomly pairs, he was somebody in the very front, or you randomly put me with Destiny Gary. And then by the time I jumped on at home, it was still before anything happened, so I never saw a queue. I was very lucky in the fact of that. Yeah, like five minutes. Yeah, it was, wasn't bad. I, I think we should, I think we should expect these things day one, night one. If it becomes something where you're waiting 30 minutes, yeah, an hour, one, an hour and a half. I mean, 15, yeah, when you get to double gases, where I'm like, why, I have it, why's this happening? Five minutes, I want to care. Five minutes is totally fine, especially because with the opening of Destiny 2, and this is not, no real spoiler, but the, the first time you are sent in and and",
            "start": 1630.58
        },
        {
            "text": "happening. Five minutes, I want to care. Five minutes is totally fine, especially because with the opening of Destiny 2, and this is not, no real spoiler, but the, the first time you are sent in and and paired up, it's only with like one other person. Yeah, so they really wanted to throttle that opening experience, I think. Yeah, that's kind of hard to do. Yeah, I think it's a bit of both in terms of it. I think that there's case by case. It sounds like with what Destiny 2, with your passing thing, when I think Aaron's seen, and the fact that I didn't see more outrage, it seems like it was fair enough. I think it is tempering expectations. I think you do have to realize that, yeah, the game went live at 9:00 and everyone's trying to go. I think most of the posts that I saw were like, \"Of course.\" Yeah, I mean, more like videogames, not, not really being an anything. Now it'll taper off. I mean, I would be surprised today if you see queues when you got home, cause now it is that thing where now there's the staggered. I'm",
            "start": 1674.59
        },
        {
            "text": "like videogames, not, not really being an anything. Now it'll taper off. I mean, I would be surprised today if you see queues when you got home, cause now it is that thing where now there's the staggered. I'm coming home from work in a different time zone. Whereas before it was this game's live at 1:00 Eastern / you know, 9:00 p.m. Pacific, an entire country of gamers is trying to get in there and get it. Yeah, you should be alright. We find everybody. Cory wrote in to KindaFunny.com/KFG D, just like you can, and says, \"Hey Greg and Anthony, hello, longtime listener, first-time writer. The much-anticipated release of Destiny is finally here. I, as someone who quite enjoyed playing Destiny and his first few expansions, though I never got deep into the raids, have picked it up and enjoying it so far. I was curious about the possible trophies I could get for my new game and opened up the list to be surprised to see there are only 14 trophies, 11 gold, two silvers, and a platinum. I thought this was a surprising as in",
            "start": 1715.92
        },
        {
            "text": "the possible trophies I could get for my new game and opened up the list to be surprised to see there are only 14 trophies, 11 gold, two silvers, and a platinum. I thought this was a surprising as in most games you have a lot of bronze trophies to fill out the list. Perhaps this is to do with Destiny 1 having, I've heard, a difficult trophy list / platinum. What do you think of this short trophy list? Is it good for making the Platinum more attainable or simply too short to be satisfying? Thanks for everything you marvelous, fantastic people do and love from Australia, Cory.\" Oh, this is definitely a Greg question. I cared all about trophies or achievements. Anything? I don't. I'll sometimes, I'll sometimes peek like when I get one for doing something interesting in a game. I'm gonna look and peek and be like, \"Oh, that's kind of clever.\" And kind of see what other ones there are. But I don't, I don't hunt trophies and I don't worry too much about trophies. As somebody who does occasionally hunt trophies and",
            "start": 1759.51
        },
        {
            "text": "like, \"Oh, that's kind of clever,\" and kind of see what other ones there are. But I don't, I don't hunt trophies and I don't worry too much about trophies. As somebody who does occasionally hunt trophies and definitely worries about them all the time, and yes, it, the internet, I personally like Destiny 2's list a lot. And I know that it's getting a lot of flack on the internet from the announcement of it. If you haven't paid attention to it, like it said there, it is short, but not my first thing when it popped is I tweeted out like, \"Hey, I don't know, Destiny fans, is this easy?\" And everybody's like, \"It's not easy, but it's attainable.\" You know what it is, is I think it really, well, the reason I like the Destiny trophy list from what I understand of it, and cause I, you know, it's easy stuff, right? So like if the silver is reached level 20, right? You're gonna get that. That's great. And then it's like gold for get every, acquire each Titan subclass, Hunter, Warlock subclass, all the subclasses, right? Can we call the",
            "start": 1797.19
        },
        {
            "text": "silver is reached level 20, right? You're gonna get that. That's great. And then it's like gold for get every, acquire each Titan subclass, Hunter, Warlock subclass, all the subclasses, right? Can we call the progression trophies? Sure. It's all these different things, right? And like, I'm so as you get into the deeper stuff, complete 30 challenges, do all this. What I like about this is what I'm always talking about with trophy lists, where so many people don't understand trophies. They don't understand their consumer. They don't understand the ecosystem. And that's why Sonic Mania doesn't have a platinum and nobody thinks that's weird. And it goes out and then everybody freaks out. All PlayStation Platinum people freaked out about it, right? Right. What I loved about the Destiny trophy list is that it's built for the Destiny fan. It's built for, \"Hey, you're gonna, we saw how you guys played this game. You played more challenges. You, we, you went through and built different characters to get everyone their subclasses.\"",
            "start": 1830.61
        },
        {
            "text": "Destiny fan. It's built for, \"Hey, you're gonna, we saw how you guys played this game. You played more challenges. You, we, you went through and built different characters to get everyone their subclasses.\" Like, we're not sending you to do things that are weird or strange or feel like errands. We are doing what trophies are supposed to do, which is rewarding you for the things that you feel like are literal achievements. Exactly. Exactly. We're, we've paid attention to what our game is and how you consume it, and we're gonna do that. Does it benefit me as someone who likes to get Platinums even if I'm not like forever into a game? Not necessarily. But I like the fact that if I get hooked by Destiny, I'm gonna be rewarded on the back end. Yeah, that my hours and hours and hours and hours will be there for me. Yeah, it feels like something where you can't just run in and be like, \"I'm getting all the trophies,\" and you just kind of like, yeah, do your thing. This is like, well, but if you play and you",
            "start": 1869.01
        },
        {
            "text": "there for me. Yeah, it feels like something where you can't just run in and be like, \"I'm getting all the trophies,\" and you just kind of like, yeah, do your thing. This is like, well, but if you play and you really play, yeah, it makes sense in that. Sure. I like what you're saying is it's not arbitrary stuff. It is stuff of like, \"Alright, cool. Go through this and the way you play the game, you're eventually gonna get pop and rewarded for it.\" And I for even, you know, like Andrea was one of the people who chimed in back when I put up the list and was talking about the fact of like, yeah, like the Leviathan Raid has a trophy attached to it. Like that's clearly gonna be a while to do. It's gonna be hours to invest, but it's doable. You'd get it and you'd feel like you accomplished something. Whereas the opposite can be said, I feel, with Friday the 13th trophy list. As somebody who loves Friday the 13th: The Game, the trophy, you know, it's like it, 666 kills, it, Jason, like, \"Fuck you!\" I got a 890. Me like, I understand that like,",
            "start": 1907.5
        },
        {
            "text": "be said, I feel, with Friday the 13th trophy list. As somebody who loves Friday the 13th: The Game, the trophy, you know, it's like it, 666 kills, it, Jason, like, \"Fuck you!\" I got a 890. Me like, I understand that like, yeah, I'm gonna be playing that. You want me to be playing this for years, but like, I'm never, it's so far, the goal posts are so far. These goal posts, like, man, if I really play Destiny the correct way and then play through and do these things they think I should do, come on, man. Come on, man. Man, Brandon wrote in KindaFunny.com/KFG D and says, \"Why Destiny 2, huh? Hi Anthony and Greg. I've been making my way through my backlog and I'm now hooked on Ghost Recon Wildlands. I think the massive open world is impressive and the gameplay loop is a lot of fun. It reminds me a mix of The Division and Metal Gear Solid V, two of my favorite games of the generation. Your Let's Play of Wildlands was one of the funniest streams I've seen and I've watched it multiple times. Jesus, that one was for you, John.\"",
            "start": 1939.12
        },
        {
            "text": "Metal Gear Solid V, two of my favorite games of the generation. Your Let's Play of Wildlands was one of the funniest streams I've seen and I've watched it multiple times. Jesus, that one was for you, John. That's a compliment train pulling into the station. Shoutout to John Drake who tweeted last night, \"This favorite thing about Kinda Funny Games Daily is hearing me yell over traffic every three minutes.\" Heck yeah. Just is a very expensive studio. We're really just buying air conditioning unit work. Anyways, back to Brandon. Now you guys are hyped to play Destiny 2. I didn't play Destiny 1, so I'm curious what about Destiny 2 has its hooks in you that you're so excited to play now and what Wildlands needed to include to get you more interested. Thanks, love the show every day. Keeping, I'm not super, I, I didn't play a lot of Wildlands. I maybe, I maybe just kind of dipped into it real quick. But um, this feels kind of apples and oranges to me. Yeah, as like what grabbed you about what would Wildlands need to do",
            "start": 1984.88
        },
        {
            "text": "play a lot of Wildlands. I maybe, I maybe just kind of dipped into it real quick. But um, this feels kind of apples and oranges to me. Yeah, as like what grabbed you about what would Wildlands need to do that Destiny's doing? And it's like, I don't know, spaceships. I, I like, I don't know, know why we were super excited the demo and we all played together and you're like, \"Holy shit, there's a lot of fun.\" When we got it here, we did a stream and where we all played together. And for me, the problem with it was, and it might have been that we've jumped in together, like Destiny, you jump in with other people. Me and Andy did it yesterday, right? And the story and the objectives are all simple enough that you can go through and fuck around with each other and tell each other dumb stories and do this and not have to be fully invested in the world and what's happening. Yeah, whereas with Wildlands, it was like, \"Alright, cool. We failed the mission. Why?\" It makes like, \"I shot a guy.\" I'm like, \"Why? Easy the house.\" You know,",
            "start": 2027.74
        },
        {
            "text": "what do you do? Is that it sounds so stupid, but like when you're wrangling cats, when we're trying to get in, Nick and Tim are so excited, these goofy guns and they're trying to take motorcycles off something. Like, what can you focus on the far right? You're doing that. And like, how do you, okay, I'm dead over here. Oh yeah, Kevin set off this random raid. It's for people who want to get in, do something to murder based tactical play their part. Yet his squad do the thing. That's what he hits on with like comparing it to Metal Gear Solid V, right? Like Metal Gear Solid V is such a fucking awesome game, but it would have been a nightmare to have four Snakes running in there and like, and one of them, you know, as we're like, \"Do it stealthy.\" He's got the number of balloons, the number of things attached to",
            "start": 2070.59
        },
        {
            "text": "it would have been a nightmare to have four snakes running in there and like Enix one of them you know as we're like do it stealthy he's got the number of balloons the number of things attached to balloons at any given time and a multiplayer yeah no I think they're I think they're two different things the things that have me excited about Destiny 2 are the same things that have me excited about Destiny 1 first there's the there's the sort of intangible things well not intangible but the visual the aesthetic things Destiny 2 and Destiny have some of the best world designs your interface design like it's just beautiful it actually reminds me a lot of like if Phantasy Star Online had continued it would have turned into Destiny eventually I love I just love the design of the characters and finding new gear and I'm not a gear guy usually yeah but there's something beautiful about like tricking out the characters in Destiny the world is big enough and silly enough but fun enough like",
            "start": 2107.37
        },
        {
            "text": "and finding new gear and I'm not a gear guy usually yeah but there's something beautiful about like tricking out the characters in Destiny the world is big enough and silly enough but fun enough like I'm riding around on pikes last night I'm like rolling through ruins it's it's just a good fast-paced sci-fi shooter that you can play with friends and it's it's simple enough and not in a negative way but you're talking about where I feel like I'm playing by myself I'm playing with him I'm jumping around I'm so stoked to get my first shader and change my color put on a new mask and then I do want to just go off and hey I've been collecting these tokens or whatever the **** they are that you wanted yeah who sounds like the guy from Game of Thrones hello it is me a real a real guy with a real accent yeah here in this church where I am collecting your accent man coin exactly ladies and gentlemen it's time to squad up this is where Anthony checks out KindaFunny.com/you're wrong",
            "start": 2153.24
        },
        {
            "text": "accent yeah here in this church where I am collecting your accent man coin exactly ladies and gentlemen it's time to squad up this is where Anthony checks out KindaFunny.com/you're wrong - tell me what we screwed up but where I read one of you who wrote in - KindaFunny.com/KFJ - tell me your name the game you need help in the platform you're on and why so you're really here and get you sorts of best friends Michael writes in he needs help on as a Nintendo Switch get ready there's a Nintendo Switch code as SW-1445-0699-9396 Michael says bit of a different one here I'm not looking for anyone to play with what I am looking for is some friends to add that play their Switch frequently I love looking at all the games people play on their Switch and watching their time played on their games pick up I like going through my recently play list and seeing 300 hours on Tetris for example thank you and I hope you're all having",
            "start": 2193.98
        },
        {
            "text": "on they're Switch and watching their time played on their games pick up I like going through my recently play list and seeing 300 hours on Tetris for example thank you and I hope you're all having a great day at Kinda Funny so far so good in the day you're an interesting man Michael Denis which code is SW-1445-0699-9396 let them watch you do stuff weird anything what are we getting wrong uh remember if you watch live on Twitch.tv/KindaFunnyGames your job is to keep us honest code what KindaFunny.com/you're wrong tell us what we got wrong we'll set the record straight forever be on YouTube and podcast first ones a continuation from yesterday about Everybody's Golf are you totally interested custom clubs don't work the way you mentioned them they're essentially you're given Big Air or Infinity Club but you get to pick where you can assign these stats a ranked one Big Air Club gives you eight extra power you get eleven",
            "start": 2239.19
        },
        {
            "text": "mentioned them they're essentially you're given Big Air or Infinity Club but you get to pick where you can assign these stats a ranked one Big Air Club gives you eight extra power you get eleven power-ups to assign to any of the four categories up to a total of eleven upgrades parenthetical 110 gems of which you can get around twenty a day just running around the courses the club does not replace your club levels which is your character progression got you thank you very much number two that PR guy says Destiny 2 clans can be set to open so you can set it or forget it set it and forget it Greg even though you went against your own challenge you can enjoy being a part of a community clan without worrying about the people in it online clan members will be displayed in game so you can just leave the fireteam open to friends and clan members and you'll be good to go sure there's come how I assumed it worked I just I don't know I just don't want to be hundred spots and then the final",
            "start": 2284.85
        },
        {
            "text": "leave the fireteam open to friends and clan members and you'll be good to go sure there's come how I assumed it worked I just I don't know I just don't want to be hundred spots and then the final one here is from Awesome Awesome A Stick. Pinball FX and Zen Pinball are the same game they just have different names on different platforms Oh which me right sounds fine there's a different there was a different Bally's Pinball is that was sunken if there was definitely Pinball Arcade that might have been in yeah I remember there being one that was like hey here's like the classic tables you've played of your whole life and hey here's like the crazy **** we're making you yeah yeah yeah and that's it awesome anything Carboni I have one segment left but I promised you get you out at 1:05 so walk away just **** walk away it's like I'll shake your hand I miss you love you I miss you too alright yeah thanks for having me no problem get your computer get the **** out of here yesterday I",
            "start": 2325.08
        },
        {
            "text": "walk away just **** walk away it's like I'll shake your hand I miss you love you I miss you too alright yeah thanks for having me no problem get your computer get the **** out of here yesterday I asked you Destiny 2 PC players to write in because we don't really know why you'd wait do you care about the wait you did not that many PC players listen to us cuz I got those dual 1080s in SLI I would play now gets my cool drag so in a new segment I'm calling why I'm waiting Tunde writes in and says hello Greg it's almost like you knew Anthony would have to leave yesterday you asked if there was anyone in the part of the Kinda Funny community that was waiting for Destiny 2 to come to PC and I'm one of those people having Triple-A I'm sorry having Triple-A games come out later on PCs and consoles is quite and what it's quite an is unusually oh he's we're having some grammar problems here and I think it's just in English on its first language we run in power through later on PC than",
            "start": 2367.17
        },
        {
            "text": "consoles is quite and what it's quite an is unusually oh he's we're having some grammar problems here and I think it's just in English on its first language we run in power through later on PC than consoles is unusual so that the devs can make their game run on a modern-day PC configurations I play the PC beta I can safely attest the fact that Destiny 2 will be one of the best PC versions made for a Triple-A title I'm currently playing the game on PS4 but will jump to PC once it come out so I can run raids without Alfredo Diaz and its Twitch crew. Shout out to Alfredo's place. Also the PC version is coming out later than the other versions usually do does not affect PC sales if it is a highly sought-after title for example GTA V came out a year later on PC after it was announced at the same time as the PlayStation 4 version and that sold 1 million copies on PC on day one keep up the good work Tunde. Nathan also wrote and says hey Greg and Danny just kidding Danny is never there I'm riding in",
            "start": 2408.34
        },
        {
            "text": "as the PlayStation 4 version and that sold 1 million copies on PC on day one keep up the good work Tunde. Nathan also wrote and says hey Greg and Danny just kidding Danny is never there I'm riding in as a Destiny fan that played around 1500 hours of the first game I only recently bought a PC and didn't want to play it there until the beta it played so well and looked incredible at 4K and it looked incredible in 4K 60 frames per second so I will be playing the PlayStation version until the PC release so I can avoid spoilers no way I could avoid them otherwise thanks for some show keep it up Nathan so you guys are just totally you just biting on what they want Bungie, Activision they want you to buy it twice and you're like I will gobble gobble gobble just gobble it up and I'm knocking you go for it enjoy yourselves I'm enjoying myself in fact I'm enjoying myself so much I'm about to play alive here on Twitch.tv/KindaFunnyGames with Anthony no and that's wrong he's gone Andy is",
            "start": 2451.93
        },
        {
            "text": "for it enjoy yourselves I'm enjoying myself in fact I'm enjoying myself so much I'm about to play alive here on Twitch.tv/KindaFunnyGames with Anthony no and that's wrong he's gone Andy is really cool Greg I'll be honest with you really **** me up this week having Andy and Anthony in here the names are just so similar yeah and then I'm not let's add Andrea in here today for this stream to I mean Andy and Danny that's in trouble how that one gets you see oh yeah a lot of times I started to say Anthony but I'm looking at Andy and I've just cut myself off it's a real these are the these are the troubles we have at Kinda Funny anyways we're about to play some here tomorrow your host is gonna be Andrea but first I need to tell you that reader mail was brought to you by Leesa whether you're upgrading your home your health or your state of mind there's one surprising item that belongs in your shopping list yep a mattress with over 10,000 5-star reviews the Leesa mattress is in a",
            "start": 2497.08
        },
        {
            "text": "you're upgrading your home your health or your state of mind there's one surprising item that belongs in your shopping list yep a mattress with over 10,000 5-star reviews the Leesa mattress is in a league of its own when it comes to combining quality innovation and making a difference the Leesa mattress is 100% American-made and delivered in a compressed box to your door it's thoughtfully crafted with high-quality materials to create what Leesa calls their Universal Adaptive Feel it's three foam layers provide support pressure relief and cooling that adapts to all body shapes sizes and sleeping styles yes I've heard it's amazing what you feel on one side of the mattress will be different than what your partner feels on the other avoid awkward showrooms the Leesa mattress is ordered online and always shipped to your door for free within days the Leesa mattress compares with brands that cost hundreds of thousands of dollars more but because they didn't believe in all those unnecessary extras",
            "start": 2536.16
        },
        {
            "text": "always shipped to your door for free within days the Leesa mattress compares with brands that cost hundreds of thousands of dollars more but because they didn't believe in all those unnecessary extras Leesa's prices start at just five hundred and twenty five dollars for an extra $100 off that's right $100 go to Leesa.com/kindafunny and enter the promo code kindafunny all one word that's Leesa.com and if any promo code kindafunny believe it or not ladies and gentlemen that's on the show in the books Andrea's here tomorrow we're gonna play Destiny right now if you're watching live Twitch.tv/KindaFunnyGames weirdly the same thing we did yesterday take a break eat some food set up a crazy set up here come back so probably like 30 minutes from now I would say probably back live playing some Destiny hopefully won't be 8-bit again we'll figure all around you know cool Greg knows what he's doing there that wasn't it wasn't reassuring are you know you're doing now",
            "start": 2575.17
        },
        {
            "text": "back live playing some Destiny hopefully won't be 8-bit again we'll figure all around you know cool Greg knows what he's doing there that wasn't it wasn't reassuring are you know you're doing now right we know we're doing for streaming yeah you confident no no I'm just talking to you cuz you know Anthony Carboni is he just doesn't get the job done yeah I mean yeah he's like this in bed - yeah just doesn't get the job done that too far you see dammit I just seen it again I look at Andy and I say Anthony come talking on microphone yeah something same you saying the microphone here you know we have an extra PS4 right I thought Andrea was bringing hers for Carboni Oh what he's gotta go I thought is he not going now I thought you were leaving okay you try to see how PlayStation 4 from us he's standing at a friend's place oh oh sure you can come back with us yeah okay yeah so let's Andrea in five or six okay oh sorry sorry you're so busy well doesn't matter ladies and gentlemen this has",
            "start": 2620.83
        },
        {
            "text": "standing at a friend's place oh oh sure you can come back with us yeah okay yeah so let's Andrea in five or six okay oh sorry sorry you're so busy well doesn't matter ladies and gentlemen this has been Kinda Funny Games Daily each and every weekday on a variety of platforms we come to you with the nerdy video games you need to know about we jump into it we you know give you all the stuff we gave you the perspectives we have weird conversations where we're playing content on the show but you love it it's great who cares right it's all fun we love you guys so much I love making this show I'm glad you guys love it so much I really appreciate everybody who at PAX came up to tell me how much this shows awesome and I post on Reddit about it in the forums and the Facebook groups I assume people are talking about Discord too but again Joey doesn't let me in there I don't know what how it works I just did confusing until next time ladies and gentlemen it's been our pleasure to serve you",
            "start": 2674.81
        },
        {
            "text": "are talking about Discord too but again Joey doesn't let me in there I don't know what how it works I just did confusing until next time ladies and gentlemen it's been our pleasure to serve you it's no hand to shake",
            "start": 2728.36
        }
    ]
}