{
    "id": 2968,
    "video_id": "hKhhp1XQf2o",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Anthony Carboni"
    ],
    "title": "Star Wars Director Roulette - Kinda Funny Morning Show 09.06.17",
    "description": "Anthony Carboni returns to the Kinda Funny Morning Show to dodge all the drama around the Star Wars director switch! Thanks to our sponsors Dollar Shave Club and Nature Box. Go to http://www.dollarshaveclub.com/morning and http://www.naturebox.com/morning for rad deals!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1504732436,
    "duration": 4415,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to the Kinda Funny Morning Show for Wednesday, September 6th, 2017. I'm one of your hosts, Greg Miller, alongside Anthony Carboni. Hi, Star Wars show, from the we have concern. Yeah, yeah, Anthony Carboni, from from the critically acclaimed Monday Kinda Funny Morning Show. True, it's true. Were you fired much of the staff? Yeah, and I'll tell you what I've been watching this week, and it was a great decision. A lot of people have come, we've stepped up, they've stepped up. Now, Andy Cortez and Andrea support has Maximum Cortez from the chat. Yeah, he's come, he was he's a fan, of course. Yeah, he won the Patreon competition yesterday to play Destiny with me on stream. What an exciting thing for you as a fan. He wanted to come as a fan. Come on here, come on, don't be afraid of the come on, don't be ready. Yeah, Cortez, it's fine. He's just he's just a he's just a regular best friend, just a regular fan, just like you guys hanging out in the chat every day. You just wanted to come.",
            "start": 1.1
        },
        {
            "text": "the come on, don't be ready. Yeah, Cortez, it's fine. He's just he's just a he's just a regular best friend, just a regular fan, just like you guys hanging out in the chat every day. You just wanted to come in to wrap up your future employment opportunities. Yeah, I don't have hiring ability. That's what's unfortunately. I can only fire, and I do with extreme prejudice. Okay, dream prejudice. You have the ability to hire people to Greg. Yeah, are we hiring Andy back, Andy? Yeah, I Maximum Cortez from the chat. You made yeah, you may know him as Maximum Cortez. I know it was Maximum Cortez. No, that's not don't stand there. Well, that's we're in the middle of the show. We don't can't afford it yet. Okay, alright, sorry. One of these days, it's crazy. Is it if Cool Greg and I ever touch with our abilities of hiring and sharing, sure the entire universe gets destroyed. Now, is it we have that's why Greg has to be all the way over there. Is it a Wonder Twin situation? So this is light, is it's this is like Hancock.",
            "start": 54.12
        },
        {
            "text": "and sharing, sure the entire universe gets destroyed. Now, is it we have that's why Greg has to be all the way over there. Is it a Wonder Twin situation? So this is light, is it's this is like Hancock, the hit movie Hancock. It's exactly a **** situation, right? You are least there on they couldn't get too close or whatever it is. 100% a Hancock situation. We got a Hancock situation, hands. That is exactly the reference literally everyone would have made. It was that Timecop. Hey, we're gonna go that was the Wonder Twins, Firestorm. There's a much different things, gentlemen. This is the Kinda Funny Morning Show. Each and every weekday, we run you through whatever the **** we want to talk about, and you have a good time. You can watch it live on Twitch.tv/KindaFunnyGames, where we urge you to subscribe and hang out and support us. Why is that, Cool Greg? Because right now, if you subscribe there, first subscription, if you ever sit for your first time ever subscribing, it how much the sense he need?",
            "start": 106.14
        },
        {
            "text": "and hang out and support us. Why is that, Cool Greg? Because right now, if you subscribe there, first subscription, if you ever sit for your first time ever subscribing, it how much the sense he need? Greater than half off. There it is, 50. Now, but we get all the money that we're supposed to get, and I'll see if Amazon Prime, you got Twitter on, give us that free sub. Or if you have raking the money, just give us real money. That works too. Remember, you can watch the show later on YouTube.com/KindaFunny or podcast services around the globe. If you do that, thank you. Like, subscribe, share, all that stuff. You get rid of this not Cool Greg. There you go. Thank you very much, Anthony Carboni. How are you? I'm good, man. I'm good. It's been so long since we've hung out. I missed an entire day. You're like, yeah, what what did you do? You left here Monday. Did you go to bed? I I did. I slept quite a bit. Did you did you get a did you once you were done with all of your powers up powered right through? I stayed up all until like",
            "start": 148.29
        },
        {
            "text": "you do you left here Monday. Did you go to bed? I I did. I slept quite a bit. Did you did you get a did you once you were done with all of your powers up powered right through? I stayed up all until like a normal hour of the night. I went to bed. You you're a you're a steamroller of a man. So they call me Big Old Steamer. Yesterday, yesterday, I sat and watched the countdown timer for Destiny for quite a bit. Okay, did that did you give him last night? Did you start pulling days? Oh, I do same for games. I did. But I know yesterday I shot the Star Wars Show. Nice. Very uneventful day for Star Wars. I would say probably not a lot of news, true. Yeah, I think it was just a normal it was just a normal shoot and not gonna happen. Go to the let's go to the first news story. Cool Greg will come back to the housekeeping buddies. Yeah, can we get there? But no, the first story that happened yesterday comes from Deadline. Colin Trevorrow, Trevorrow, how do I pronounce that? Trevorrow out as Star Wars Episode.",
            "start": 188.22
        },
        {
            "text": "buddies. Yeah, can we get there? But no, the first story that happened yesterday comes from Deadline. Colin Trevorrow, Trevorrow, how do I pronounce that? Trevorrow out as Star Wars Episode IX director. Did you see this? Oh, okay. I'll read it. Another Star Wars director change from Lucasfilm just now, which has announced that Colin Trevorrow has left Star Wars Episode IX. This is the statement from Lucasfilm. Lucasfilm and Colin Trevorrow have mutually chosen to part ways on Star Wars Episode IX. Colin has been a wonderful collaborator through the different throughout the development process, but we have come to the conclusion that our visions for the project differ. We wish Colin the best and we'll be sharing more information about the film soon. Trevorrow, whose blockbuster cred was set with the huge success of Jurassic Park franchise reboot, Jurassic World, was confirmed as director for the ninth film in the main Star Wars franchise back in August 2015. At the time, he said, quote, this",
            "start": 237.45
        },
        {
            "text": "with the huge success of Jurassic Park franchise reboot, Jurassic World, was confirmed as director for the ninth film in the main Star Wars franchise back in August 2015. At the time, he said, quote, this is not a job or an assignment. This is a seat at a campfire surrounded by an extraordinary group of storytellers, filmmakers, artists, and craftspeople. We've been charged with telling new stories for a younger generation because they deserve what we all had, a mythology to call our own. We will do this by channeling something George Lucas instilled in all of us, boundless creativity, pure invention, and hope. Film is currently I'm sorry, the film currently has a May 24, 2019 release date. The eighth movie in the series, Star Wars: The Last Jedi, hits theaters December 15th. Wow. You know what I mean? I don't know. I like Jurassic World fine. I'm not familiar enough with Colin's work, I feel, to have a strong opinion on it. What I would say is that, and this is funny, you guys misses you saying that a lot of stuff Star Wars",
            "start": 280.39
        },
        {
            "text": "Jurassic World fine. I'm not familiar enough with Colin's work, I feel, to have a strong opinion on it. What I would say is that, and this is funny, you guys misses you saying that a lot of stuff Star Wars happened yesterday, and while you were filming the Star Wars Show. But if you jump to the next story, Cool Greg, they're now saying Rian Johnson returned for Star Wars Episode IX. Now, you remember the name Rian Johnson, ladies and gentlemen, of course, because I hate the fact that he spells it weird. Spell it normal. I understand your parents cursed you with this Rian, but you have chance to fix this. You would chance to set the record straight and put a Y in there. Just be normal and help us out. But you also know, of course, because he's the one directing Star Wars: The Last Jedi. You missed all this though. Weird, isn't it? Exclusive. Put Rian Johnson atop the shortlist of directors who might replace the recently departed Colin Trevorrow in Star Wars Episode IX. Insiders said that nothing is done yet, but",
            "start": 331.12
        },
        {
            "text": "weird, isn't it? Exclusive. Put Rian Johnson atop the shortlist of directors who might replace the recently departed Colin Trevorrow in Star Wars Episode IX. Insiders said that nothing is done yet, but that prospect is certainly in the air right now. The Looper helmer fits seamlessly in the Lucasfilm machine, which is no small feat given the number of star directors who would shoot up and spat out under the creative differences line in existing Star Wars movies. You've heard of that, right? All these people getting the Star Wars. Okay, you get you get parts. We'll fix it up for Deadline was the first to tell you that Ron Howard was the top choice to replace Phil Lord and Chris Miller as director of the Han Solo movie, and that came to pass. If Rian Johnson, who directed the December 15th, yes, get him some more water. He's dying. I'm pleasing Andy, give him that water. Yeah, give him that one of them Star Wars Episode IX movie. Even if Rian Johnson, who directed the December 15th launching Star Wars: The Last Jedi, does in",
            "start": 370.51
        },
        {
            "text": "more water. He's dying. I'm pleasing Andy, give him that water. Yeah, give him that one of them Star Wars Episode IX movie. Even if Rian Johnson, who directed the December 15th launching Star Wars: The Last Jedi, does in fact come back to take the reins in the next movie, it's somehow it seemed like destiny when Deadline revealed that the Looper helmer was being hired to take on Star Wars. The original intention was for him to direct two movies. Stay tuned, it might come to pass. Now, that's interesting. Now, sorry, I missed all that. You know what you missed it? Oh, well, not now. Sorry, I missed all that. Move out of that story. No, no, now that you're done, you can discuss it. Let me see him to go to the bathroom, and you come in here, Andy Cortez, from the chat. And we like to get the chat involved as much as we can. I just I'll jump in as soon as I finish this. Your parts. You just got here. You're just tired. What do you take away from all this Star Wars drama? Um, I didn't love Jurassic World, exactly. I liked it enough. I'm not super",
            "start": 412.57
        },
        {
            "text": "in as soon as I finish this. Your parts. You just got here. You're just tired. What do you take away from all this Star Wars drama? Um, I didn't love Jurassic World, exactly. I liked it enough. I'm not super bummed out. Sure. Rian Johnson, however, directed Looper, right? Looper was a good movie. I don't like their I don't hate it there. Okay. But he also directed the best Breaking Bad episode of all time. Which one's that? Ozymandias. Which one's that? The second third to last hour. Side, just tell me what happens in it. **** you guys. Did you now watch Breaking Bad yet? Where they kill Hank. Oh, no, that's a great episode. Alright, alright, jump in to say that was a great episode of Breaking Bad. Thank you. Alright, I like that one. Well, then that gets me excited. And the fact that I mean, I haven't seen The Last Jedi, of course. Anything you seen Last Jedi? They let you see the Australia, I was seeing The Last Jedi yet. But if they like him enough to bring them back for another one, I'm all for it. You know what I'm saying? What the man? Yes.",
            "start": 454.06
        },
        {
            "text": "course. Anything you seen Last Jedi? They let you see the Australia, I was seeing The Last Jedi yet. But if they like him enough to bring them back for another one, I'm all for it. You know what I'm saying? What the man? Yes. Yeah, now in the chat, Reborn91 says, I prefer the idea of mixing up the director for each film. But then again, Disney doesn't seem to let their directors add their own to it. Who knows? I feel like they I as much as I loved Force Awakens, and again, I am a Watto fanboy. Sure. You know what I'm saying? I feel like they have something going. They know what they're doing over there. I love Rogue One. You know what they're doing over there. I credit Gary Whitta with it, of course. He brings funny food to my show. I like Gary Whitta a lot. We all love Gary Whitta. Now, scared Gary Whitta? Mouth guards, Gary Whitta! Please welcome Belize, Gary Whitta! What could be lies, dear? Another great phone, another great film. Yeah, okay, okay. I'm interested to see what's happening. That's the your Star Wars summary, Anthony.",
            "start": 501.67
        },
        {
            "text": "Anthony Carboni, ever glad is the host of The Star Wars Show for Lucasfilm. Yeah, that I could be here to share my perspective and my inside my inside information. A lot of the insight is that what's going on over there. If your audio is very greatly intact, people think, you know, I'm they keep me very locked down, and there are things I'm not allowed to say, not allowed to comment on. But as we can all see from what just happened on my own, man, you can't tame that. Or no one get know I'm a wild wild stallion. I'm Spirit: Stallion of the Cimarron. That is what you are. That's your demon of horses. Exactly what I think of all the time. Now, I don't know how does this affect you? Another Disney property. Reporter says Disney's live-action Aladdin cast Billy Magnussen as Magnussen. Practically, the actor will play an",
            "start": 544.42
        },
        {
            "text": "think of all the time. Now, I don't know how does this affect you? Another Disney property. Reporter says Disney's live-action Aladdin cast Billy Magnussen as Magnussen. Practically, the actor will play an original character not seen in the 1992 animated pic. Yeah, yeah, yeah. Because they finally they managed to to cast the entire movie without whitewashing it, and they were like, just in case, we got to get one white guy in here. Am I right? Yeah, well, I mean, oh, we're not white guys at. Am I right? With all due respect, can I can I go see a movie? Can I have a separation? I need a character to identify with based on first off, good looks, great hair, and skin color. Yeah, you know what I mean? I go there and be like, maybe not necessarily in that order. Well, you know what I mean? I mean, as long as all three are there, who knows? Look at us right now. Look at me and Billy here right now. I can't tell them you take them off. Yeah, you've been Superman this whole time. Exactly. Saying that I could do it. I can do this. See, by the",
            "start": 593.92
        },
        {
            "text": "knows. Look at us right now. Look at me and Billy here right now. I can't tell them you take them off. Yeah, you've been Superman this whole time. Exactly. Saying that I could do it. I can do this. See, by the way, did you see by the way, this is a total digression. Okay, everybody, finally the entire internet just caught on to how great Christopher Reeve is apparently. Yeah, what the ****? I was so upset. That was, you know, that Christopher Reeve was a good at acting, man. He was a good Superman. We'll get him stand up straight here. I'm like, ****, I've been saying that three **** years about him. He's literally the best. He's literally the best. And like the internet just caught on to that yesterday. Everybody's like, the best special effect in Superman had nothing to do with green screens. But like, how did you miss this, you idiot? Watch Superman. That is literally one of my favorite things. Like when I decided I was gonna do stuff on camera and everything, like I was a Superman fan as a kid, but also just such",
            "start": 642.6
        },
        {
            "text": "miss this, you idiot? Watch Superman. That is literally one of my favorite things. Like when I decided I was gonna do stuff on camera and everything, like I was a Superman fan as a kid, but also just such a fan of that moment of the way he just like go like, well, he was two different people. If you didn't know, ladies, you know, man, this is a Kinda Funny Morning Show on Wednesday, which means it's a Comic Themes Up episode. Snotgirl was your required reading. We'll talk about that in a second. But already can do it. ****, there's a white guy in the Aladdin movie. He's a new character. Why we add new? We definitely show **** cares. I don't need a new person. We don't know the white guys. The movie was fine. It's perfect. We don't need to worry. It's great. You know, this is an interesting one. You're talking about. I'm gonna try to pull it up, cuz I I was seeing go around on the it was the trending topics over on Twitter. Yeah, do you know where it started? Why this started? Cuz I did about a clicking in. I",
            "start": 688.95
        },
        {
            "text": "about I'm gonna try to pull it up, cuz I I was seeing go around on the it was the trending topics over on Twitter. Yeah, do you know where it started? Why this started? Cuz I did about a clicking in. I believe I want to say I saw I saw when Digg tweet something or retweet something that was just a that was just a GIF of the moment. Yeah, yeah, where he's where he's trying to decide whether he's gonna talk to Lois on and over a Polygon that did something and then been picked up an article. Yeah, and I don't know whether the article or the tweet was first. Well, Greg, I'm giving you a link here. I'm gonna toss it in right after the Aladdin business. Remember, they put a white guy in Aladdin. Everybody celebrate. They put, oh, yeah, we did it, guys. We're finally we finally have something in Hollywood. I was just afraid of agency. I don't Rahul Kohli and his people have enough screen time, if you ask me. Yeah, you know what I mean? Too much Rahul Kohli. You know what I'm saying? Exactly. And as people as I say like,",
            "start": 729.27
        },
        {
            "text": "of agency. I don't Rahul Kohli and his people have enough screen time, if you ask me. Yeah, you know what I mean? Too much Rahul Kohli. You know what I'm saying? Exactly. And as people as I say like, calm down already. Report on the line of questioning. Not very good. Alright, maybe we'll dial it back. Now, Cool Greg, fill this one up. Yeah, so this is a Best of Past Sub yesterday. Superman's most amazing special effect didn't require computers or green screen. And then roll down to the GIF, which Ben, I love you, and I love that you wrote this kind of like see to it. And this is the whole thing. We're four people always say like, how could you actually be tricked in? You know, look at the confidence he goes from in the egg Bob with all the respect. You should watch the scene because the GIF is like, okay, good. They keep showing you something. Yeah, but they gave me a GIF is just one moment in there. And yeah, he and then and then he goes right back down again. Yeah, he's gonna do it. He's gonna tell her when she",
            "start": 768.42
        },
        {
            "text": "they keep showing you something. Yeah, but they gave me a GIF is just one moment in there. And yeah, he and then and then he goes right back down again. Yeah, he's gonna do it. He's gonna tell her when she turns around. Yeah, and it's just wow. He talked he did a lot of interviews about how he based he based his Clark Kent on Cary Grant. I'm like the old like when Cary Grant was like one of the most like beautiful original Hollywood heartthrobs, right? Sure. But he started off doing these like romantic comedies, and Cary Grant would play like these like stumbling, stuttering nerds. Yeah, but like clearly when you saw Cary Grant in real life, he was just like this matinee idol. And so Christopher Reeve was like, I just thought about Cary Grant in my head and the two different ways he was. And like, I don't know, nobody has done nobody has really nailed it the way he has ever done. Well, I mean, that was the thing. And but I'm to an extent, I'm glad they have any Anthony Carboni because again, this speaks back to",
            "start": 813.06
        },
        {
            "text": "what I always talk about with my love affair of Superman in like why I loved American Alien so much, a while of Smallville so much, is the fact that this is fine, and this is great acting, and I loved what he did here. But the fact of man, what a shitty existence to go around and need to be the old Lois. You know what I mean? I don't know, lo. But like, yeah, I like the ones where it's definitely himself still, but he needs to dial it backward. You know, it's definitely more Pre-Crisis. I mean, it's it's so, you know, Silver Age. These movies were like what, 1980 was Superman: The Movie? It was. Yeah, yeah, yeah, yeah. So obviously, like 5, 10 years before they they just completely rebooted everything, Man of Steel, and gave him a little bit of gave him a little bit of that confidence and gave him let him be more him.",
            "start": 857.22
        },
        {
            "text": "all the times actually. Exactly. In that business. And this is my other product, the physicality. Brandon, okay, so Brandon Routh got the some of the physicality aspects. You're right. But we didn't see a lot of obviously, we didn't see a lot of Clark in Superman Returns. And the ones we did, just like, yeah, Clark and Superman just came back on the same day. Nobody's nobody's finds it specifically. No, it's like, hey, guys, I'm back. Yeah, same suitcase. That everything is this happening? Same suitcase, same shot, same everything. Exactly. You know that movie like a long time ago, guys. Again, 30 years later, you remember that thing, the movie? Yeah, yeah. But yes, he he just is absolutely nailed it. And I I would love to see more of those qualities in future live-action Superman portrayals. Not you don't have to go all the",
            "start": 900.12
        },
        {
            "text": "that thing, the movie. Yeah, yeah. But yes, he he just is absolutely nailed it. And I I would love to see more of those qualities in future live-action Superman portrayals. Not you don't have to go all the way. Shout out to Dylan in the chat who says, look at these two old ax men right here. Ask your parents about Superman: The Movie. Here's the I love Superman: The Movie, of course. Yeah, I'm not gonna and I'm I enjoy I enjoy it. I think it's great. I think everyone should watch it. Great characterization. Bubble one, Superman: The Movie is Exhibit A in how it poisoned multiple generations to Superman. Mmm, because he's too powerful. Yes, they're Superman is again Pre-Crisis. So he can rewind **** time universe. Are you so boring? There's no stakes a moment. Thank you. Yeah, God, I hate you. Well, and it's weird because the original Superman I & II were originally written as one mammoth 500-page movie. And so it was like it didn't end with Superman turning back time, and then more **** happens. And it's like everybody sits",
            "start": 944.7
        },
        {
            "text": "Superman I & II were originally written as one mammoth 500-page movie. And so it was like it didn't end with Superman turning back time, and then more **** happens. And it's like everybody sits in the second film going, but can't he do this? Why does he do that? That was supposed to be the end of both. But still, reversing time by flying around the Earth, not the not the greatest now, the great greatest plot scheme. Not the best representation of Superman. Well, smells a bunch of people. Yeah, the Fortress of Solitude. Yeah, well, all the Kryptonians just dead. No, no, doesn't care. Do you know? We don't know. I mean, they have no powers, and they just kind of leave them in credit system. Who knows what's down then that crevasse? Hey, hypothermia. Where they will just sit. And I also a power that never got brought back that I really wish got brought back. It's like when they give Spider-Man a car. Yeah, cool. Anyway, Aladdin. Yes, they double back real quick. Cost up. There's a community meet up at EGX. Give you a",
            "start": 995.25
        },
        {
            "text": "that I really wish got brought back. It's like when they give Spider-Man a car. Yeah, cool. Anyway, Aladdin. Yes, they double back real quick. Cost up. There's a community meet up at EGX. Give you a quick pimping for that. Kellen Morin tweeting about it Thursday. They're gonna go see the Kingsman 2 and eat em. You what are they gonna eat? I don't know. It's in the UK. Probably fish and chips. Oh, shoot. Maybe issue bangers and mash. Bowling on Friday. Saturday, the big one at BrewDog. I don't look the big one is what is that? Anyway, all the knickers will be in a twist. That's now we're talking. Now, I don't need to be. Alright, is that regular bowling or is that metric bowling? I don't know if they have the same kind of pins or balls there. I don't know. So no, they I think they do it. I think they do it like a 90s Nickelodeon TV show where the pins are all people and they just roll a giant ball. They hadn't created to you. I think I think that's just British bowling. Now in the chat, yeah, MonkXXXS.",
            "start": 1042.95
        },
        {
            "text": "sometimes Spidey goes out in the countryside where there are no buildings. It's true. And it's the saddest saddest time in Spider-Man's life when he's getting out of city bus. I think about that all the time. Like doing wrong. What was your what was your take on Spider-Man: Homecoming? A lot of Spider-Man: Homecoming. Yeah, right. Spider-Man: Homecoming was and listen, the Raimi version of Spider-Man, I think, was was really wonderful. I think Spider-Man 2 is probably the best of his movies. But but Spider-Man was was really amazing. And I love the the kind of portrayal. But I got the vibe from it that a kid would get watching the Richard Donner Superman right now. Like you were talking about. It feels it feels like Raimi really grew up with the 60s and 70s Spider-Man, right? And I think Homecoming was the Spider-Man.",
            "start": 1095.21
        },
        {
            "text": "watching the Richard Donner Superman right now like you were talking about it feels it feels like Raimi really grew up with the 60s and 70s Spider-Man right and I think Homecoming was the Spider-Man that I kind of expected and and grew up with a little bit more you know yeah totally even even Raimi Spider-Man reminded me so much of the 90s cartoon Spider-Man with you know the **** Spider-Man where are they from what timeline do they inhabit but you'll never know that you'll never know when you watch that cartoon or when even I think growing up I was reading the Spider-Man oh my god even the first Spider-Man book I remember getting and getting into an issue after issue was McFarlane's run yeah number one on where he's already married to Mary Jane he's already an adult yeah and so when I fall out after the Clone Saga I miss kind of the whole the reboots they do they all re-number back down and the whole Ultimate thing and stuff so then getting back into comics in Marvel Comics now in",
            "start": 1140.39
        },
        {
            "text": "fall out after the Clone Saga I miss kind of the whole the reboots they do they all re-number back down and the whole Ultimate thing and stuff so then getting back into comics in Marvel Comics now in reading them Ultimate Spider-Man is so good yes joy and that's the thing where I as a kid growing up reading Spider-Man and watch the Spider-Man cartoons always thought of him as the Marvel hero and so often wearing a tucked in rugby shirt you know the Met Gala then the lens change while I'm gone of no no he's a kid and there are bigger heroes there are people who are doing more crazy things I loved how that was represented in this movie it's perfect and I honestly I was really worried before the Sony Marvel deal was made where I was like how are you gonna do Civil War without even a little bit of Spider-Man yeah because in that in the in Civil War Spider-Man wasn't just you know the kind of the kind of young kid trying to figure himself out and figure out where long as the world oh yeah",
            "start": 1202.04
        },
        {
            "text": "of Spider-Man yeah because in that in the in Civil War Spider-Man wasn't just you know the kind of the kind of young kid trying to figure himself out and figure out where long as the world oh yeah bit like he was like the audience surrogate Spider-Man was like us watching Civil War gosh you know what I mean like Peter Parker in the story was like us being like oh I like Captain America but he's doing some bad stuff he's my friend exactly I like all these guys and what am I gonna do and I've got this I got my all these people that I love and so when they were like Civil War I was like not without Spider-Man ya know uh yeah and I also thought that Civil like when I saw Civil War Spider-Man I was like question this is gonna be great I always talked about like that that segment of the movie ruin the movie for me because in the entire lead-up to and like the 30 minute mark I leaned over to Tim at Alamo Drafthouse Spider-Man came yeah oh and it was like everything I wanted yeah and",
            "start": 1249.25
        },
        {
            "text": "movie ruin the movie for me because in the entire lead-up to and like the 30 minute mark I leaned over to Tim at Alamo Drafthouse Spider-Man came yeah oh and it was like everything I wanted yeah and they're like alright we're gonna break away and go do and the moment between him and him and Cap where it's like yeah Queens, Brooklyn yeah from the Chad Maxima Cortes is asking where does Homecoming rank on your head and see that go by in the chat using the new audio to is using Twitch audio functional supporter where he quit his job and moved to San Francisco to sit in the audience it's that's a Patreon tier that you can have that's the that's the $4,000 a month tier the privilege of being in the audience Homecoming ranks pretty high up for me pretty high up we did an episode where we ranked all it'd be tough for me to sit down and rank them all now I would have to do some real organization of my I might have to whiteboard it out at this point I mean at the whiteboard right there I'm I'm",
            "start": 1298.42
        },
        {
            "text": "all it'd be tough for me to sit down and rank them all now I would have to do some real organization of my I might have to whiteboard it out at this point I mean at the whiteboard right there I'm I'm good to do it all right yep I'm good to do it we have markers over here but I think like where do I stand Iron Man is way high not Iron Man Iron Man 3 is way high up there yes I love this Iron Man 3 is dope Shane Black do an Iron Man whoo there's actually repercussions for something that happen in this universe PTSD it's awesome it's so good a great idea and me why you like Iron Man to like an 88 no negative negatory can we get a moderator in the **** chat to take care of this kid timeout he gave us $4,000 say whatever he wants with peanut gallery we accepted a bad point but I love Shane Black everything yeah I I really do love whenever they take a Marvel movie and put somebody on it and give them it's really tough like we saw with Edgar Wright to put somebody who really is an",
            "start": 1361.57
        },
        {
            "text": "Shane Black everything yeah I I really do love whenever they take a Marvel movie and put somebody on it and give them it's really tough like we saw with Edgar Wright to put somebody who really is an author into a Marvel movie and let them do what they want yeah you know it works better it works better the lower stakes the character actually is so like James Gunn could come in and be like yeah here's what I like about Guardians of the Galaxy here's my pitch you go do your tree movie bring like nobody really stopped him from doing what he wanted yeah whereas like but I it's you know it's really hard for somebody to get their own personal style in a movie and I felt like Shane Black had his fingerprints all over Iron Man you know and I love I love like so much good dialogue and characterization and Tony just being Tony and hanging out with that kid and talking that kid like I liked that I'd I've seen him be Iron Man a million times and I've seen this a million times since then it",
            "start": 1429.16
        },
        {
            "text": "and Tony just being Tony and hanging out with that kid and talking that kid like I liked that I'd I've seen him be Iron Man a million times and I've seen this a million times since then it was kind of like you know it's one of those things where you can only take a character like Iron Man he has he has all the money he has all you know this is the Batman problem yeah you can only you can only take him to be so rich to have so many gadgets to do so many things before you're like all right tear it down yeah what can we do with him that is a base yeah that you can't just solve instantaneous yeah so I liked Iron Man 3 that ranks pretty high up there for me see what I here's when I did my ranking yeah the chat or I'm sorry to comment on YouTube and the people at the table universally agreed was the best one I said the problem I had is that I think Spider-Man: Homecoming and it's so fresh I know there's a mole thing to say but I think I'm right is my favorite Super Heroes I think they got Super Heroes",
            "start": 1480.17
        },
        {
            "text": "was the best one I said the problem I had is that I think Spider-Man: Homecoming and it's so fresh I know there's a mole thing to say but I think I'm right is my favorite Super Heroes I think they got Super Heroes right this is a super here this is the best Marvel movie I think it's my favorite Marvel movie I love it however in my rankings I had to put a I put on my editorial hat you know could be a little trying to be as objective as possible and put Avengers ahead of it but they would try cuz that's always the cheat I feel Avengers has been built up to over when it was six hours of film or more than eight hours of film till we got there so when we got there it could just be you know all these guys let's go and have fun but also did a great job of spinning all these plates you know keeping all these things in keeping all these balls in the air keeping all these things going but like I remember I went and I saw Avengers with a friend at the time who hadn't really seen any of the Marvel I",
            "start": 1518.84
        },
        {
            "text": "these things in keeping all these balls in the air keeping all these things going but like I remember I went and I saw Avengers with a friend at the time who hadn't really seen any of the Marvel I think maybe saw Iron Man I didn't see the rest of the Marvel movies up until then and still like understood Avengers got it thought it would have moved click you know that was a hard movie to make sure that's a hard movie to make and those kind of The Avengers movies are gonna get harder and harder and the Marvel movies are gonna get harder and harder because now the movies are kind of becoming what the comic books are where it's like I hope you know all of these things before you do your homework before you come watch movie yeah yeah so yeah I would put Avengers pretty high up there but also I think because you are you are probably somebody who has done so many ranking lists sure throughout your career you know that like its kind of its kind of tricky putting the new one up top yeah but you",
            "start": 1561.56
        },
        {
            "text": "because you are you are probably somebody who has done so many ranking lists sure throughout your career you know that like its kind of its kind of tricky putting the new one up top yeah but you also probably at this point can trust your gut I mean I just I don't know if it's cuz the bar was so low for Homecoming it's just I thought that I've been burned you know I was we were coming off of Amazing Spider-Man 2 clearly the high point of Spider-Man films it gets a lot of hate to deserve it it was not bad it was it was it great it was it was one of those matter I enjoyed I enjoyed Andrew Garfield and I enjoyed Emma Stone and I like I like those characters and I like I liked Amazing Spider-Man 1 enough I like to know my favorite thing about those two movies was like like you were saying Garfield and Stone playing these like two teens that you believe are intensely in love yeah yeah and the moments that were Peter and Gwen were so wonderful and I really believed that they believed",
            "start": 1604.48
        },
        {
            "text": "and Stone playing these like two teens that you believe are intensely in love yeah yeah and the moments that were Peter and Gwen were so wonderful and I really believed that they believed what they were doing and their emotion I could tell that they were having fun with it more so than like Maguire and Dunst what I felt like never really had that chemistry yeah but you know overall the story the plotting the whole I mean Spider-Man the Amazing Spider-Man 2's like knock right is that I feel like it's it was too much a comic book where it was like hey Rhino's in the front and in the end and that's the end and then this and then like Jamie Foxx's is bumbling idiot who's now Electro, give them power it's like yes dumb **** comics I can start dumb when you spell them up Marvel has created a very intense problem for everyone including DC regardless of where you where you sit on the DCEU I can tell you this table is split but we're really not but because Marvel did",
            "start": 1652.42
        },
        {
            "text": "Marvel has created a very intense problem for everyone including DC regardless of where you where you sit on the DCEU I can tell you this table is split but we're really not but because Marvel did everything so right and built this amazing Cinematic Universe which was not a phrase we had before Marvel sure now everybody's rushing to catch up and his Sony practically tripped over themselves running so if asked to catch up yeah because they were just like now there's a Spider-Verse it's like hold your horse you have not earned a Spider-Verse yeah use your six standalone movie why the **** would I want that it's all starting with Tom Cruise in The Mummy and it's the kid it's obvious it's the characters teens love Dr. Jekyll and Mr. Hyde man oh it's every Captain Nemo coming back yeah no it was it was a rough going different I don't think we're as far apart on the DCEU as you like to believe we are really yeah I don't think is this a I couldn't tell if you actually drink",
            "start": 1697.54
        },
        {
            "text": "yeah no it was it was a rough going different I don't think we're as far apart on the DCEU as you like to believe we are really yeah I don't think is this a I couldn't tell if you actually drink that was not a bad that was not a bad well we're very you and I spoke after Man of Steel and we were very we were very torn on Man of Steel I don't know if you're ready time Man of Steel I was like I was super disappointed in okay and I and I what I always say with Man of Steel is that I'm super disappointed in it because the trailer was so **** good the trailer looked like hey I'm Zack Snyder and this is DC and we get what Superman is and we're gonna give you the Superman film but can I tell you I think the further the more I see trailers for Zack Snyder movies the more I feel like Zack Snyder is a is a very ambitious very visual guy who gets caught up in his in his set pieces and his moments and then and then literally figures out the through line of his story maybe while he's editing and",
            "start": 1754.02
        },
        {
            "text": "is a is a very ambitious very visual guy who gets caught up in his in his set pieces and his moments and then and then literally figures out the through line of his story maybe while he's editing and that's why his trailers are always so pitch perfect moment perfect down to the two fathers trailer yeah for Man of Steel I still think might like my hair is literally standing on end right now still think about that trailer Man of Steel trailer is the best Superman movie yeah but that through-line wasn't wasn't really there and the ideas were very muddled in there you know is is Clark like this this bitter outsider or is he somebody who feels like earth is his home you know what is Zod trying to do is he trying to get Clark over to his side or is he trying to destroy Clark where are these were these three lines how does everybody feel what are they doing no I know motivations were lost and there was this and it wasn't the Superman film we were promised yeah and that's why I was so knocked",
            "start": 1805.74
        },
        {
            "text": "these three lines how does everybody feel what are they doing no I know motivations were lost and there was this and it wasn't the Superman film we were promised yeah and that's why I was so knocked down because I was talking about it you know I went to screening pre-screening with WB at E3 mm-hmm and I came back the next day and Rich George you know IGN Comics at the time sat down he's like how was it it was like it was committee he's like oh my god it's bad I oh my god based on this reaction I can tell this is bad I was like but it isn't but it wasn't in it it wasn't till yeah a year and a half later I didn't see the theaters I didn't know that which is like telling you like I assume it returns that's a billion times yeah I saw super I even saw Superman Returns like twice Superman I've seen five times now or whatever that's your choice you live your life when I went back finally a watch Man of Steel again my expectations again were so low that this time I was like okay",
            "start": 1856.26
        },
        {
            "text": "it's a sci-fi movie more than a Superman movie yes it is very clearly you see what you just talked about it is in the shadow of the Marvel movies where DC was like we can't just be we can't just make the movies we want we can just make superheroes the way we make superheroes in the comics we need to go somewhere different because we'll just be compared to Marvel then everyone get sick of them we have to we have to be different we have to be different yeah and I think there's also a much bigger problem aside aside from Batman I think there's a much bigger problem adapting DC characters into film and and keeping a long-term continuity I mean we see it with DC Comics as well where like they do a lot of reboots and things because the characters at DC are more mythological they're more representative",
            "start": 1894.03
        },
        {
            "text": "keeping a long-term continuity I mean we see it with DC Comics as well where like they do a lot of reboots and things because the characters at DC are more mythological they're more representative of ideals and archetypes if you could tell you could teach in a mythology class right after Greek and Roman mythology and Norse mythology you could teach DC right along with it why frequency somebody recently I was talking to and they use his adage I've never heard before but that Marvel characters are mortals suddenly embodied with the powers of gods whereas DC characters are gods trying to live as mortals it's Zeus coming down and dealing with somebody who's trying to trick Zeus yeah exactly and and so and that's the reason right like sorry to cut you know but for DC right Batman's far and away the most popular person why he is you he's a person who is like he you you could see someone doing that although I will say we do get to the point in DC Comics where Batman in a lot of ways is the",
            "start": 1939.78
        },
        {
            "text": "the most somehow unbelievable course Superman yeah it all starts with that what do you remember this one Wizard magazine article somebody who did a think piece and Wizard where they're like the Justice League turns on itself this is how it goes and they wrote this entire narrative in an edited with Batman being the one who beat everybody because everyone finished that they're like oh yeah Batman can beat everybody and that's been the argument through mine forever and ever never no yeah yeah yeah and I think it's I think it's true in situations every one of them can win in situations exactly Batman's is hey do I have time to do this literally from the shadows yeah can I turn you against each other can I use what I know about you can I Superman a Batman standing in a room exactly there's no",
            "start": 1984.45
        },
        {
            "text": "is hey do I have time to do this literally from the shadows yeah can I turn you against each other can I use what I know about you can I Superman a Batman standing in a room exactly there's no there's no reasoning your way out of that but I feel like the DC Comics now are very much like a will reason our way out of it even with Batman Metal right now I haven't started it you have you started it's good it's very um Snyder and Morrison man yeah Snyder and Morrison with Batman I I just love because they really do want to turn Batman into this mythological character like very literally yeah they want to turn him into like this you know this magical bat force that's been around since the dawn of time you know since like The Return of Bruce Wayne they there's like I have been here throughout all time and the bat has always been with you and it's said wow he's a rich guy he cares I don't know and that was I mean that was the other thing too like you know again why I like continuity in",
            "start": 2025.25
        },
        {
            "text": "all time and the bat has always been with you and it's said wow he's a rich guy he cares I don't know and that was I mean that was the other thing too like you know again why I like continuity in certain aspects like when they did the Death of Bruce Wayne right before New 52 and Dick took over the cowl and had to work with Damian through those books were All-Star Batman and Robin man Oh mmm Dick Grayson Batman was so good yeah was so good wasn't it just Batman it was it just bad oh yeah there's witty kid yeah also I wasn't is the no wait what am I thinking which one's I'm the Goddamn Batman yeah that's All-Star yeah that's awesome God you haven't read All-Star Batman and Robin you need to go back up when he picks up Dick Grayson and just Google because you've definitely seen people make fun of it it's so good man I'm the Batman screams like it's like Mark Millar would like with Captain America and The Ultimates that one panel is just like the a on my helmet doesn't stand",
            "start": 2080.76
        },
        {
            "text": "people make fun of it it's so good man I'm the Batman screams like it's like Mark Millar would like with Captain America and The Ultimates that one panel is just like the a on my helmet doesn't stand for France all right anyway there's a white guy in Aladdin are you excited for Justice League or have you been burned too many times now I'm gonna go see it yeah I'm certainly gonna go see it I you know there are there there are things where Justice League makes me feel a little pre burned in a weird way and it has nothing to do with the rest of the DCEU I love Ezra Miller love Ezra Miller yeah brilliant actor entertains me and everything he's in I love me Grant Gustin though yeah yeah and it's like I understand we're gonna we're gonna use Infinite Earths as our way to explain this away but Grant Gustin's my Barry Allen right now what I say right is that Grant Gustin's performance and how good Flash Season 1 and 2 were is the reason why I can't even read Flash comics right now",
            "start": 2131.61
        },
        {
            "text": "because I crack them open I'm like this is it my Barry this doesn't look like maybe well I told you I actually hear you and I've talked about this I actually hear Grant Gustin's voice in my head for Wally West because the the CW Barry Allen is kind of a mix of the two yeah with everything that's going on with him and I I really started getting into the Flash with with Wally West on the Mike Wieringo run and I'm so good and Mark Waid and just all that **** that's the back to the point of why DC was awesome yeah there was actually a lineage that I was Kid Flash Barry gives his life and I step up and put on this mantle here's my stories yeah and all the stubble bit like the Speed Force and all that stuff and all that all those ideas kind of think of as that run yeah so I always hear Grant",
            "start": 2180.42
        },
        {
            "text": "up and put on this mantle here's my stories yeah and all the stubble bit like the Speed Force and all that stuff and all that all those ideas kind of think of as that run yeah so I always hear Grant Gustin as as Wally West in my head but yeah yeah so I love to see Grant in the movie he's not in the movie I also love Ezra Miller yeah but also I'm just kind of like how long are they gonna hide Superman get on us exactly I mean how much Superman am I gonna get and is he gonna be can he come back as he did in death and return over my dead body and just be just be the Superman I want him to be yeah see how that's the promise you won't leave that film I don't think knowing that yet yeah I don't think they're gonna give you closure like especially because like you said you think all trailers right yeah I assume that last one where like Alfred in the wall like vibrating like we're expecting you or something you assume that Superman they're gonna um I don't I don't want to this isn't really",
            "start": 2227.52
        },
        {
            "text": "this isn't really this isn't really a spoiler but I think they're gonna kind of Twin Peaks: The Return us where we're like Twin Peaks: The Return just Twin Peaks: The Return just just finished up and the whole thing was like when what what episode do we get Agent Cooper Agent Cooper the main character original where when's Cooper when's Cooper when's Cooper it's like booths a little too long you know what I mean that we were waiting and I have a feeling it's gonna be some third act and that literally deus ex machina Superman will literally be the God in the machine who comes down much like a Greek myth yeah and is like don't worry guys I'm here and I love that you're all working together and we're all friends yeah it's your friendship promise I mean like in my head right of like wrapping around how this is going",
            "start": 2274.77
        },
        {
            "text": "to happen and how they're going to do this yeah I really hope and I adapted it but I really hope the trailers so far are like you know just we're seeing a third of the movie and then there's so much he comes back at the end of Act one right at the beginning back to you don't even meet building with that more reality what I think's going to happen is that water shaking on the table is gonna be the Kryptonian biosuit that brought him back right punching through a wall in the Batcave or digging up through the ground coming there and then hitting him out get him being there and being like well Metropolis are my dead body and then flying off to wherever they are to beat the **** out at Steppenwolf with them and then that's the end of the movie how long you think cuz I feel like Zack Snyder's a",
            "start": 2318.39
        },
        {
            "text": "are my dead body and then flying off to wherever they are to beat the **** out at Steppenwolf with them and then that's the end of the movie how long you think cuz I feel like Zack Snyder's a guy who just loves the idea of Superman in a mech suit how long do you think he drags that on I wouldn't be surprised if we start seeing it really early yeah this thing burrowing through the ground are coming at that you know that's what's coming that's such a Snyder image to me that just the dark Kryptonian battle armor yeah but then there's hope I mean I in the same breath I wouldn't I think it'd be really cool if it was you know an agent of Darkseid or whatever yeah I mean that they haven't taken his body and then that and they get they have to shake him loose of that with like Golden Lasso and here's the memories and stuff like that yeah I don't know I want us I wanna I want it to be great but I've just been burned yeah here's where I am I'm gonna go see everyone yeah and that's then they",
            "start": 2359.12
        },
        {
            "text": "here's the memories and stuff like that yeah I don't know I want us I wanna I want it to be great but I've just been burned yeah here's where I am I'm gonna go see everyone yeah and that's then they know that that's where I am yeah they got me do you like the idea they're blowing away from continuity in doing these like Joker not not just the Joker versions like doing movies that are just like one-offs or whatever they keep talking about Red Son comes out nonsense I would rather see that stuff yeah I wouldn't because I think that stuff allows both like it allows writers and directors to do what they're strongest at yeah you know find the director who's perfect for read such a great story yeah find the director who who maybe could even do God do you remember that one they did in the 90s where it was uh where was Superman was was like Tarzan and the jungle totally wrapped together it was during the Elseworlds annuals so good and there's there's a lot of stuff of the you know like",
            "start": 2392.88
        },
        {
            "text": "90s where it was uh where was Superman was was like Tarzan and the jungle totally wrapped together it was during the Elseworlds annuals so good and there's there's a lot of stuff of the you know like Speeding Bullets or even Gotham by Gaslight like a lot of these things where it's like yes yes give me those women and then it it lets the characters also be the best at where the Beth what they are the best at as well yeah Batman walks into a room and you know what this movie is about because you know what Batman represents exactly I would I would love to see the Elseworlds you know whatever label they want to call it take off just so we could get a Kingdom Come movie yes what I've always said anything Carboni is if I can get rich and I'm trying here Patreon.com/KindaFunny yeah if I can maybe just need a few more people at the maximum coordinate a thousand dollar-a-month level what I'd want to do if I got a lot of money is start making famous friends and then I would just want",
            "start": 2434.84
        },
        {
            "text": "I can maybe just need a few more people at the maximum coordinate a thousand dollar-a-month level what I'd want to do if I got a lot of money is start making famous friends and then I would just want to put together I would I would spend all this money just to make a trailer for Kingdom Come and it would be Jon Hamm is Superman in a you don't I mean and we're going we're going with the Christopher Reeve suit so not none of this molded plastic **** it looks like Alex Ross right it's it's just spandex over him or whatever the black thing and we're going through with doing it all and then at the very end like the singer I have right it's like you know it's like boom Kingdom Come whatever year mm and it's like the conversation of him just going Bruce you know I don't have that dark side it's it's a wide shot of the cave or whatever yeah and then it's from the back of the bat chair and he just spins around it's Michael Keaton he goes tell that to Taylor yeah you don't know me that's all",
            "start": 2477.32
        },
        {
            "text": "it's a wide shot of the cave or whatever yeah and then it's from the back of the bat chair and he just spins around it's Michael Keaton he goes tell that to Taylor yeah you don't know me that's all eyes and I got a boyfriend Michael Keaton and I got up a friend Jon Hamm what you filming listen we fill most of here bro I have a feeling what I mean one of those two people probably watches right yeah sure yeah Ali watching point Jon Hamm or Michael Keaton's probably watching the Kinda Funny goodbye right now and also Jon Hamm and Michael Keaton if you haven't used your half-priced Twitch subscription yet get on it I want to give a nice to have Amazon Prime I mean you have Twitch Prime it's free this week for the comics episode was Snotgirl Volume one written by Bryan Lee O'Malley if you're a fan of this book love this book are you now yeah me all about it so Snotgirl is about a fashion blogger hmm named Lottie Person because she has a lot of person she really is a lot to me and I",
            "start": 2513.59
        },
        {
            "text": "a fan of this book love this book are you now yeah me all about it so Snotgirl is about a fashion blogger hmm named Lottie Person because she has a lot of person she really is a lot to me and I love it it's very Bryan Lee O'Malley yeah and it's all about the life of somebody who basically makes their living being this sort of digital media influencer fashion blogger and but is doing it to kind of combat their own insecurities yeah she names all of her friends all of her other friends are influencers as well and she gives them all these horrible nicknames they're all horrible to each other yeah exactly so it's like she is Snotgirl because she hides the fact that she has these horrible allergies she is less than perfect and she doesn't like to show it well the best part is that she doesn't name herself Snot now Cool Girl does cool Cool Girl names are Snotgirl yeah I was on early in the book a Cool Girl befriends Lottie Lottie immediately knows Cool Girl is cooler than her hence calling",
            "start": 2557.95
        },
        {
            "text": "name herself Snot now Cool Girl does cool Cool Girl names are Snotgirl yeah I was on early in the book a Cool Girl befriends Lottie Lottie immediately knows Cool Girl is cooler than her hence calling her Cool Girl yeah Cool Girl calls her Snotgirl and that's when things get bad because no she's the one who gives up the nickname yeah it's like Cute Girl Norm Girl who is it's Cute Girl Norm Girl Cool Girl wasn't like Anime Girl no that's Cute Girl be the photographer she gives everybody these names but the deal is Lottie befriends the girl that she names Cool Girl at the same time she starts taking new medication for her allergies and this comic that starts off about kind of the superficial friendships of these people turns into this really weird almost European thriller where you don't know where what's real and what isn't real is somebody was somebody murdered with somebody not murdered was Lottie's house body the killer is Cool Girl real how come Cool Girl only shows up when Lottie's",
            "start": 2608.38
        },
        {
            "text": "where what's real and what isn't real is somebody was somebody murdered with somebody not murdered was Lottie's house body the killer is Cool Girl real how come Cool Girl only shows up when Lottie's around like yeah it becomes like this very weird almost Brian De Palma thing via Scott Pilgrim yeah yeah yeah and that was what was weird for me is Snotgirl had so much hype leading up to launch bond as she wanted launch read issue one it didn't like it and kind of because it was it gets weird at the end and the cliffhanger that oh and this is required reading you're supposed to read it so the supposed death there and it didn't hit me hard enough because I was like still trying to wrap my head around the world that they were building yeah it sounds like and I never picked up he she never did then we were doing a comics in the park where we go drink beer and read comics me and Jen and Jen got this one from the local shop and I was like okay she finished it loved it handed to me and I read the",
            "start": 2661.3
        },
        {
            "text": "we were doing a comics in the park where we go drink beer and read comics me and Jen and Jen got this one from the local shop and I was like okay she finished it loved it handed to me and I read the rest of the way and I was like oh okay I didn't give this enough time yeah sure because I'm totally into it but now the problem I'm in is I'm very much in how I was with when I started reading Walking Dead way with I mean in 001 No 005 um where I've bought a train so now I'm just gonna buy trades like I saw I'm waiting I keep a cube I went straight to for a Snotgirl coming up oh it's still on that **** yeah it's got to be soon though because they just someone I just did six yeah last month but I I get what you're saying because now I probably read more I don't know how many slice-of-life comics you read right now pick up a few but now that I'm not like all over them I'm kind of into him like I'll read like I'll read Lumberjanes and Giant Days and things like like I love these like",
            "start": 2704.15
        },
        {
            "text": "comics you read right now pick up a few but now that I'm not like all over them I'm kind of into him like I'll read like I'll read Lumberjanes and Giant Days and things like like I love these like how is Giant Days so good I just saw we're gonna I'm gonna pull up for us to make pic of the weeks but I noticed the cover today wow that looks actually it's a it's like a college friendship comedy like so there's not a lot of you know there's not a lot of it's it's just a comedy it's a slice of life comedy so I'm kind of into this sort of stuff so I was probably a little more into the first issue than you were but one of the things that kept me going for issue wasn't so much the strength of issue 1 as a plot but just Bryan Lee O'Malley is so good at not writing a story about a scene or a type of person like oh I know about it or I know those people but like he is one of those people sure he wrote Scott Pilgrim you're like oh of course this is this like lost slacker you know kind of",
            "start": 2745.85
        },
        {
            "text": "a type of person like oh I know about it or I know those people but like he is one of those people sure he wrote Scott Pilgrim you're like oh of course this is this like lost slacker you know kind of hipster guy that was like in in and around the 006 rock scene you know yeah yeah and he felt like he was a part of that when he wrote Seconds it felt like he was part of the restaurant scene and the foodie scene that was like very popular -3 years ago like everybody was a foodie yeah you know what I mean with this it really feels like oh he gets the fashion bloggers thing this feels like I know who these people are now through reading this they feel real and I also just kind of love the idea of using these digital influencers as the archetype for like hey when we're all in our mid early to mid 0s we're all motivated by insecurity sure and we're so afraid of our tiny insecurities and the tiny things we hate about ourselves that we go so far out of our way to hide them that we wind up",
            "start": 2789.47
        },
        {
            "text": "mid 0s we're all motivated by insecurity sure and we're so afraid of our tiny insecurities and the tiny things we hate about ourselves that we go so far out of our way to hide them that we wind up doing more damage and doing much more horrible things to people and if you are saying one of the most honesty scenes I think in the book right is that Lottie's ex-boyfriend Sonny is dating Charlene who is this like plain-Jane girl used to be a lot easy system but she just forgot all about her she just works at a coffee shop now yeah and Lottie is increasingly shittier and shittier to Charlene and at one point Sonny calls her on this at a party he's like yeah what the why are you doing this and she's like if you'd let me explain and he's like all right explain it and she runs down all the things in her head and it's like oh these are all terrible just terrible yeah you like with somebody finally like no **** explain why you're like this you're like you know you're right I'm doing a lot of",
            "start": 2837.38
        },
        {
            "text": "in her head and it's like oh these are all terrible just terrible yeah you like with somebody finally like no **** explain why you're like this you're like you know you're right I'm doing a lot of shitty thing I am the bad person I am a bad person this story so I just I just love that I love the way I love the way they use that as this sort of background for a slightly supernatural or heightened reality story yeah it's good man I really enjoy we haven't talked about it love the art and in VR it's really really powerful the colorings really it pops in a way that a lot of comics I don't think you yeah it's not afraid to use first off of me like crazy text but then I'm not crazy sex with different text and then like just really explore a color palette well it's very Leslie Hung does a very something you see a lot in in Korean and Japanese comics which is things are not super detailed except for the things that are the most important to the story so like it's very cartoony and very",
            "start": 2881.63
        },
        {
            "text": "very something you see a lot in in Korean and Japanese comics which is things are not super detailed except for the things that are the most important to the story so like it's very cartoony and very simple yeah but the fashion because it's the thing about people into fashion yeah be the outfits are real they look very real and very detailed well I mean that's the thing about when I first started reading it reminded me so much of Batgirl of Burnside right yes when Babs started it and like I would talk to her about like the choices she was making she would talk about like we know what fashion is a huge thing for me so I'm putting them into outfits that are contemporary and what people would be wearing and make them feel real yeah rather there's other tank top and jeans no that's like whatever they wear a he wears a suit and it's fine until he becomes Batman yeah it's just suit and it's easy like a tuxedo it's really great and if you read all the way up to six it just keeps heightening and",
            "start": 2919.34
        },
        {
            "text": "they wear a he wears a suit and it's fine until he becomes Batman yeah it's just suit it's easy like a tuxedo it's really great and if you read all the way up to six it just keeps heightening and heightening and heightened and that's my question I guess for you've done the extra credit as we like to call it you read beyond the required reading when do we get answers in the books you've read we get answers we get more questions okay that's the thing where I am caught up where I was like egg is even required reading right like it looks like she kills Cool Girl mm-hmm but then Cool Girl's fine but then this Cool Girl real and at the end of this one does she killed Charlene for real and that's like that yeah where I am like when is vol coming and I keep doing the door on his by him but I know if I just buy him Jen's gonna buy the trade then I got all these goddamn issues fulgrim yeah yeah oh god the long boxes Greg go back I'm back to the long boxes I can't stop no can't do it I like",
            "start": 2963.45
        },
        {
            "text": "know if I just buy him Jen's gonna buy the trade then I got all these goddamn issues fulgrim yeah yeah oh god the long boxes Greg go back I'm back to the long boxes I can't stop no can't do it I like that's why I'll buy trades put them on the bookcase they look nice I can share them and then I buy him on that do you want to know you won't you know what happened was you know last year Trish and I were hosting that show for Comic-Con HQ yeah the yeah yeah yeah Nerd HQ for Zachary Levi's Nerd HQ there was never a Comic-Con HQ and we never having to discuss it again but you're not seeing that show what's news and I was like I'm gonna use this as my excuse to get way back into comics I'm gonna start reading oh yeah reading everything again and I just it just became long boxes again and now I can't stop like why don't you if I did you know like I do everything too but I by digitally cuz I love cuz I loved just having the comics interest sure now I have an iPad Pro I went on going on grow",
            "start": 2999.33
        },
        {
            "text": "can't stop like why don't you if I did you know like I do everything too but I by digitally cuz I love cuz I loved just having the comics interest sure now I have an iPad Pro I went on going on grow now you're talking that was the first device where I looked at it a friend brought one over and I was like this is a comic yeah so I started buying digital but now I love the people at my local comic shop so much outside LA Secret Headquarters in Silver Lake if you're ever there you go in you say hi to Lea and Julie for me and you tell them that they're Wonder people just say hey I'm here to pick up Anthony Carboni spoilers don't do it I'm gonna come out with a bag like this this is a pray this is a prank it's a prank I cannot pick up this comment because now they and they also do the thing now where they're like they just throw **** in because they know yeah yeah I know I'm gonna like it well that's my favorite thing to do here is every so often like I was telling you about Southern Bastards",
            "start": 3043.85
        },
        {
            "text": "now where they're like they just throw **** in because they know yeah yeah I know I'm gonna like it well that's my favorite thing to do here is every so often like I was telling you about Southern Bastards love Southern Bastards Southern Bastards is a trade that Daniel Dwyer recommending that I had never done and he's like you should go downstairs again I'm like alright and he left and I went downstairs and bought it right and it's the same thing whenever I go in there because I like the books on the Shelf look anyway I go in there and I ignore the singles cuz I'm buying them on ComiXology that's my that's my jam but then I look through in it I love going to their little day of the little recommended this is what we recommend yeah look out **** and I just sit there and pick all this different **** up and put it bring it home and do that yeah man it's tight it's dangerous so here's the question for you for me we love Snotgirl we love Snotgirl you can prep your questions comments",
            "start": 3086.91
        },
        {
            "text": "**** up and put it bring it home and do that yeah man it's tight it's dangerous so here's the question for you for me we love Snotgirl we love Snotgirl you can prep your questions comments concerns for anything you wanna talk about on the show but it's also Snotgirl here because we're gonna get to that in a second you get to the choice to pick next week's required reading it can either be Southern Bastards or it can be Giant Days I say or if you think there's something else we're all missing that we need to jump into no no I think I think if you haven't done Southern Bastards it would be it would be a disservice to allow you to do anything except Southern Bastards there you go ladies we down the next week required reading volume one of Southern Bastards share you like Jason Aaron yeah yeah yeah you read that Doctor Strange run I know I haven't Mikey being recommended to me there's a whole bunch of runs I'm missing cuz I said I I was talking with her right like I bought Marvel Unlimited",
            "start": 3117.75
        },
        {
            "text": "yeah you read that Doctor Strange run I know I haven't Mikey being recommended to me there's a whole bunch of runs I'm missing cuz I said I I was talking with her right like I bought Marvel Unlimited mm-hmm I read my mom reading some Marvel books money all new over and of course I've been Tom Taylor anything I'm on sure but I'm trying to expand like I said I'm still hardcore DC with the unlimited I am like what's a Marvel comic I need to read yeah yeah the the Jason Aaron Chris Bachalo run of Doctor Strange they did that did that Marvel soft reboot because they knew a movie was coming out yeah where they don't reboot yeah where they don't reboot everything but they're just like here's a good starting point sure it's so good anyway cool next week's regarding Southern Bastards cool Greg can you bring up this ComiXology page we want to run through Anthony well if you have any pity what's Pick of the Week so it's Giant Days 30 more people and this is what we're gonna read you know say we're",
            "start": 3158.88
        },
        {
            "text": "bring up this ComiXology page we want to run through Anthony well if you have any pity what's Pick of the Week so it's Giant Days 30 more people and this is what we're gonna read you know say we're not assigning it for me obviously it's Walking Dead 171 this is this week yeah this is what pop this morning well I do love I do love Shade, the Changing Girl do you know oh my god I'm in Reno everything Young Animal does but that one's real that one's real surreal it's not it's not really for everyone's scroll down what else we got what else we got The Woods has been pretty pretty decent have you been keeping up at all with this War of Jokes and Riddles with Batman I have I haven't you hear me son reading doors I have obviously I'm gonna pick up WicDiv obviously got it yeah I don't know Pick of the Week that's tough that's pretty good this is pretty good that's a pretty good front page for each page yeah it's just page one cool I think I also think this week is when Motor Crush comes back",
            "start": 3196.98
        },
        {
            "text": "the week that's tough that's pretty good this is pretty good that's a pretty good front page for each page yeah it's just page one cool I think I also think this week is when Motor Crush comes back this know yeah if you go to I think it's on page two Babs is a Motor Crush oh then definitely Pick of the Week is Motor Crush for me as a comic now you right now Motor Crush, Motor Crush you need to tell me and sell me on it because I love Babs obviously I love the old Batgirl of Burnside team and that's we're over here making books great I read a shoe one didn't like it enough because of the motorcycles and stuff and can't ever walk now isn't your thing no should I give another shot no and did I do a Snotgirl to what where I gave up too early yeah I think so I think so they Lena as it goes on they lean more into the sci-fi of it okay and things start getting by the time you end with six which was a couple months ago I've been waiting I've been waiting for seven for so long because they finally cranked",
            "start": 3245.2
        },
        {
            "text": "into the sci-fi of it okay and things start getting by the time you end with six which was a couple months ago I've been waiting I've been waiting for seven for so long because they finally cranked up the sci-fi and got into what this thing is gonna be yeah and it's very much like a cross between a between a western superhero comic and erasing anime okay and it's good it's gonna be very anime racing anime and I like a I don't know like a like a fighting robot anime like there's it's it's got some good it's it's got some good stuff alright yeah I got a Dark Souls it's almost comic what is that we're gonna jump into tips real quick we're running late but well you have to get out of here one you estimate would tell me wrap for Kinda Funny Games dealing do you have a hard out today I got I have somewhere I have to be at 1:30 but I think we're okay okay then I'll run through all this get you ready for Kinda Funny Games date okay Flame Boy Waffle gave us a tip and said Anthony how do you get so",
            "start": 3284.77
        },
        {
            "text": "I have to be at 1:30 but I think we're okay okay then I'll run through all this get you ready for Kinda Funny Games date okay Flame Boy Waffle gave us a tip and said Anthony how do you get so much done with ADHD we even with meds I find it almost impossible to get stuff like reading and writing done even though I usually enjoy those things yeah yeah it's tough medication definitely helps routine definitely helps you have to have you have to have and stick to a routine and you have to have and stick to some sort of organizational system so for me I use a Bullet Journal which seems to be the best for my particular mindset was Bullet Journal is every day you make it to you just make it to do those but it's it's your journal for everything so it's not just your to-do list it's also like if I get an idea for something I want to get put on and the secret to the Bullet Journal is the first few pages is an index so like if you come up with like an idea about a series that you're writing on",
            "start": 3329.26
        },
        {
            "text": "I get an idea for something I want to get put on and the secret to the Bullet Journal is the first few pages is an index so like if you come up with like an idea about a series that you're writing on you're gonna launch a new series on cuz you're funny and the idea first comes to you in the middle of the day on one day you put it in there and then you go back to your index and you go Kinda Funny new series page nine then as you're going if you get another thing like three days later and you write it down you're like oh that's another note about the Kinda Funny new series it's on page nine and fifteen gosh and then every day you just make a list of the things you have to do that day and then move them to the next day and you don't try to plan you don't try to get them do like a Getting Things Done like multiple lists and systems and projects just if it's like keep it simple stay focused try to do your thing the best you can but it's hard I don't get a lot done I don't I don't think",
            "start": 3379.53
        },
        {
            "text": "things done like multiple lists and systems and projects just if it's like keep it simple stay focused try to do your thing the best you can but it's hard I don't get a lot done I don't I don't think I get a lot done okay you're like one of the hardest-working people I know you got a million shows you're doing podcast left and right you're on our stupid stuff you're doing fine I feel very inefficient at all times though so that's just me stop see gave a tip and said hi Greg and Anthony took the day off of I'm sorry took the day off for Destiny to grind heavily I finally watched the show live for the first time in a while hope to see Anthony on GOG soon love you oh I've replaced and tired everyone so there's really no one else to be on the show I'm here and put you on here all day every day well thank you you're always welcome on Game Over Oh Sam Dino writes in and says three recommendations for required reading The Vision by Tom King yep a creepy tale The Vision creating a family for",
            "start": 3415.23
        },
        {
            "text": "well thank you you're always welcome on Game Over Oh Sam Dino writes in and says three recommendations for required reading The Vision by Tom King yep a creepy tale The Vision creating a family for himself hey there's another one people will tell me about it's very who's like the suburbs right it's very very good yeah Pluto 'no 5mins find a dead superhero that sounds awesome yeah yeah that one gets dark and Daytripper a story about life day trip rhymes hadn't read he's all sound variation yeah I'll write that one down based on the strength of your other two recs you can trust them yeah so Sole Porpoise writes in with the final or sort of soul yeah Sole Porpoise for the purpose for the final tip right now it's Hawking Porpoise coming in hot with some game codes I am become Oprah distributor of free **** enjoy Batman: The Enemy Within season pass and my computer ran out of battery right there no code so we'll come back for that code cool girl if you want to get my battery pack I guess yeah",
            "start": 3451.65
        },
        {
            "text": "free **** enjoy Batman: The Enemy Within season pass and my computer ran out of battery right there no code so we'll come back for that code cool girl if you want to get my battery pack I guess yeah I'm gonna need it don't know yeah I need it yeah well we do that jumper the chat we're doing three or three here we're doing out of order you're gonna live with it and deal with it don't worry   thank you for your donations oh here we go greedy years want to talk about Snotgirl what do you think the deal is with the cop who's really into fashion and Lottie that was the only part of it I didn't vibe with well then I could think I'm trying to think of where we are in issue 3 versus where we are now now right here he's come to the house and been like hey I'm a big fan like he's not there to investigate the death but he has the bag right I think so I don't remember the back part he he's like I'm just a big fan I'm just here to say hey right yes by the way I think these are",
            "start": 3495.58
        },
        {
            "text": "not there to investigate the death but he has the bag right I think so I don't remember the back part he he's like I'm just a big fan I'm just here to say hey right yes by the way I think these are yours I think I think it depends on how you read that scene I think he genuinely is a very big fan of Lottie and of and of everything she does and it does have a crush on her but he's also a cop and he's playing the fact that he has this crush to let him kind of maybe get a little sinister with it sure but that's also the vibe of Snotgirl right everything's always operating on two levels so he just like oh I'm such a big fan I love you so much don't worry you're not you're not a suspect oh but I found these and they're probably yours yeah and it's like bloody pills from the murder scene so there's a lot going on with also his name is Detective John Cho which I love yeah there's a lot going on with Detective John Cho I think all right keep reading we'll find out yeah Sole Porpoise is giving",
            "start": 3556.43
        },
        {
            "text": "a lot going on with also his name is Detective John Cho which I love yeah there's a lot going on with Detective John Cho I think all right keep reading we'll find out yeah Sole Porpoise is giving away Batman: The Enemy Within season pass on Steam get ready here it comes tzz gc3 a cutie are y x AP v m3 z t  r j8 b f  m w/j might have been to in there seems like because that's the next spot that's a Niner dagger and later in there go ahead and enter those to see what you get oh yeah oh man all right cool um time for PS I love this best friend xoxo Joey yeah Joey didn't put a joy didn't put any best friends in there where's it where's the best friends where's the giveaways it's just started it is 1:00 in the afternoon you came in late where he knew last night she got a switch man Oh Joey oh now you feel like a dick now you feel like but you couldn't have known you there was no way you could have known she put on social media Dennis I don't know I didn't see it you follow right am i a dick",
            "start": 3600.92
        },
        {
            "text": "you feel like a dick now you feel like but you couldn't have known you there was no way you could have known she put on social media Dennis I don't know I didn't see it you follow right am i a dick I don't know I don't know if I follow her does that mean to be a dick right now follow her right now everybody if I don't follow her everybody actually if you do follow her please send some some sweet words and sweet Nancy loved Joey no well yeah because that's rough man that's a tough day yes that's not a good oh I can't even imagine while Joey perhaps the best friend and the gift games we're gonna give away I'll tell you we're giving away two games because we have two sponsors they are the Dollar Shave Club Dollar Shave Club is the smarter choice get a great shave at a great price conveniently delivered to your door it's an awesome life hack a no-brainer choice you no longer have to schlep to the store and buy cheap disposable razors and you know who uses Dollar Shave Club Tim Gettys",
            "start": 3666.11
        },
        {
            "text": "delivered to your door it's an awesome life hack a no-brainer choice you no longer have to schlep to the store and buy cheap disposable razors and you know who uses Dollar Shave Club Tim Gettys that's right Cool Greg's older brother he uses it to trim it up eases the Dr. Carver's Shave Butter uses the executive razor and every time he shaves he calls me he goes and he gets a bath be like to him to make the smarter choice by joining Dollar Shave Club for a limited time new members get their first month free no that's not right first of all as an executive razor with a tube of Dr. Carver's Shave Butter for only five dollars with free shipping after that razors are just a few bucks a month that's a 15 dollar value for only 5 bucks you can only get this offer exclusively at dollarshaveclub.com/morning that's dollarshaveclub.com/morning I got there you'll know the calm you don't even have to say it anymore really it's implied second sponsor which means your second",
            "start": 3706.64
        },
        {
            "text": "slash morning that's dollarshaveclub.com/morning I got there you'll know the calm you don't even have to say it anymore really it's implied second sponsor which means your second video game free is coming from NatureBox we all want to eat better but when it comes to snacks sometimes it feels like the whole world is delicious and a billion calories versus boring and tasteless it doesn't have to be that way up your snack game with NatureBox NatureBox has over 100 snacks that taste good and are better for you all snacks are made with high-quality simple ingredients which means no artificial colors flavors or sweeteners so you can feel good about what you're eating just like we did when they used to send us free snacks the Kinda Funny Studio and I would eat the pretzels they had viewer on them they were great and now they have a bunch of jerky and they're sponsoring this show again but they haven't set any more samples which makes me very very upset and if Anthony didn't",
            "start": 3748.97
        },
        {
            "text": "had viewer on them they were great and now they have a bunch of jerky and they're sponsoring this show again but they haven't set any more samples which makes me very very upset and if Anthony didn't fire everybody I would have people sending letters in to them because I want more of this but we're running so lean now it's true no we're well it's all profit from here on out it's all fine it's so simple just go to naturebox.com/morning we'll deliver them right to your door NatureBox is offering Kinda Funny fans three free snacks with your first order when you go to naturebox.com/morning for free three free snacks with your first order NatureBox.com did I say that enough I think I did remember naturebox.com/morning thank you if you want to win stuff it's simple being the chat like so many of you are right now in Twitch.tv/KindaFunnyGames or if you're watching later on YouTube.com/KindaFunny yeah period or",
            "start": 3790.28
        },
        {
            "text": "to win stuff it's simple being the chat like so many of you are right now in Twitch.tv/KindaFunnyGames or if you're watching later on YouTube.com/KindaFunny yeah period or listening on podcast service around the globe no big deal you can enter by first subscribing to us on Twitch remember if you have Amazon Prime you have Twitch Prime we give away a free you need to give away a free subscription to each and every 30 days why not give it to us remember also if is you've never subscribed anybody on Twitch before it's only to $5.50 this time around why not try it out you get the Kinda Funny logos next name cool emotes private chat time with us you play games with us and get the show ad free unless we bake them in um you can also go to Patreon.com/KindaFunnyGames and find your Patreon.com/KindaFunnyGames support us there at the $ level you are automatically entered to win everything we give away here even if you're not here it's great it's fantastic plus if you",
            "start": 3834.14
        },
        {
            "text": "Patreon.com/KindaFunnyGames support us there at the $ level you are automatically entered to win everything we give away here even if you're not here it's great it's fantastic plus if you get the $ level and Kinda Funny Patreon.com/KindaFunny you'd get your exclusive access to Cooking with Greggy episode one that post Monday it's a symphony we go back sclusively before it goes live on YouTube I'm very excited for Cooking with Greggy that'll be every one of them - well I hope I get your dollar I'm not gonna give you a dollar I will never either remember I would never give you any you're the worst I would never give you I am I am your friend give it away I walk in the dark on Xbox One it's going to rock_be_loop in the Twitch chat and then we're giving away Little King's Story on PC it's going to LongHoferHopper may be hope for Huffer I think it's both you're committing it's a reasonable thing exactly where are you in the country me like a soda versus pop",
            "start": 3873.74
        },
        {
            "text": "King's Story on PC it's going to LongHoferHopper may be hope for Huffer I think it's both you're committing it's a reasonable thing exactly where are you in the country me like a soda versus pop let me tell you about P.S. I Love This Best Friend XOXO this is where one of you writes in the KindaFunny.com/BestFriend you nominate someone who's doing something awesome in the community we read their name here and everyone celebrates how awesome we are as best friends James Rodriguez is shouting out the one and only Cool Greg Gettys Oh meeting him in NYC a few weeks ago and watching his latest Raw and SmackDown live streams Cool Greg has shown that he's an incredibly humble person not only has he proven to be extremely helpful behind the camera whether it be helping run the shows and Kevin's absence or just making sure all the hosts and guests stay hydrated with their Sasha Banks cups he also helps to provide a chill atmosphere for best friends who appreciate wrestling and want",
            "start": 3915.17
        },
        {
            "text": "Kevin's absence or just making sure all the hosts and guests stay hydrated with their Sasha Banks cups he also helps to provide a chill atmosphere for best friends who appreciate wrestling and want to talk about it both in person and online so I just want to let him know that his hard work is appreciated and his contributions are much appreciated insert Spider-Man Kane's gang **** Thank You Man appreciate that shot too Cool Greg thank you so much for writing in remember now many people KindaFunny.com/BestFriend we are running late we're day three and three gonna jump in here I'm gonna get into this **** game show cuz you got to go let's do it will not be late let's do it or how far you going away I'm going back to the mission it's not too far okay you'll be right I'll be fine coping um comments you cranky move says god dammit I need to resub you do it's no big deal we're here for you though Jamie is continuing to talk about how she's eating lunch in her car and how",
            "start": 3961.34
        },
        {
            "text": "fine coping um comments you cranky move says god dammit I need to resub you do it's no big deal we're here for you though Jamie is continuing to talk about how she's eating lunch in her car and how perfect the weather is right great now that sounds like a really good day it does it does sound really right you know what I mean yeah now MadAtMedev7 says what about soda pop so you don't know some people call it pop some people call it soda in Chicago we called it pop I went to Missouri every thought that was crazy Cleveland my family calls it pop mmm-hmm in New York everybody called it soda Florida calls every kind of soda coke don't like that one bit don't like that one bit it's like Kleenex I do yeah Georgia does it - not all Florida not all Georgia but parts of the south the crackers parts call everything coke no I'll take a coke what kind seven uh yeah no I couldn't do that at all Tim would that's why I left Blanket1483 says Bodie what are you thoughts on No Man's Sky one",
            "start": 4001.3
        },
        {
            "text": "yearling I'll tell you what I love No Man's Sky from the get-go but I was a human being that tempered my expectation yes yeah and a year later I think if you are somebody who played it and went seems a little repetitive maybe not for me they have added so much now that it's almost like I'm not gonna say it's a completely different game but everything that you wanted in there is in there now the base building the freighters the home planet yeah you can go back to you they've done a lot plus a lot of just like general quality of life improvements I think I think it's a really great game but I always thought it was really great KickPBPopOff says Anthony I know this may sound crazy but have you considered firing famous Greg yet oh yeah but like he gets here so early it's true it's true I just",
            "start": 4045.82
        },
        {
            "text": "rolled in five minutes before we started with a coffee there's some there's some people that you got to keep around strategically of quarter your own benefit of course yeah that's a business so wants to do the work yeah yeah yeah gotcha and then I can take all the credit exactly then one day you're just Greg and then I'm famous Anthony oh we're gonna hire another Anthony the moniker no no no no I'm just gonna make everybody coffee TheSilentGamer said that will make my dream Kingdom come true I saw the ever since Greg that Batman and Robin run you mentioned it's currently on sale on ComiXology gentlemen worth sub-only mode this is one of the benefits of being a sub thank you so much for doing that I created a sub only jingle uh Andy I'm gonna need your help here our maximum Cortez fan",
            "start": 4098.17
        },
        {
            "text": "who's in the office today see is he a subscriber can we still see him see so sub yeah we can see and hear him yeah LakersHeadTo432 says Hispanics call every serial call them fleas is that real yeah I mean come on in here so it's like it's the way that most Spanish speakers pronounced cornflakes oh can I take one please oh yeah okay let's sounder like they call Pepsi Pepsi that sounds much more delicious than cornflakes which is what caught by the way if anybody came back from PAX West with the Dragon Con with the cornflakes you're in trouble what you do is you put all your clothes in a bag put vinegar in your bag CentralTimeScudworth says Anthony I got in the chat as you were talking about an app earlier something about a bullet journal app is not as funny Anthony you're",
            "start": 4150.79
        },
        {
            "text": "in a bag put vinegar in your bag CentralTimeScudworth says Anthony I got in the chat as you were talking about an app earlier something about a bullet journal app is not as funny Anthony you're somethin happenin oh I'm talking about a notebook but if you go I think it's just BulletJournal.com will teach you the system I find that my brain remembers things makes connections better does all that stuff better and easier and faster if I just write it down now here it comes one of those Paradoxical questions I need Anthony you need to be on task for this Cool Greg needs being a task for this alright hold on let me get my on task posture HoneyBooBoo says with the money you saved from firing everyone which is Anthony's department can you hire Anthony which is Cool Greg's department no we're still not there I'm not gonna I'm looking at the numbers and it doesn't work out San Francisco is very expensive and the final question of the day for the comic show comes from SolarPoweredNVG do",
            "start": 4206.98
        },
        {
            "text": "not there I'm not gonna I'm looking at the numbers and it doesn't work out San Francisco is very expensive and the final question of the day for the comic show comes from SolarPoweredNVG do you think Tobey Maguire I could play Clark Kent Superman no I Tobey Maguire no it's no what is Tobey it's gonna sound really insulting Tobey we're still making movies was last I haven't seen him he's doing stuff he just did something what do you just do the Siri, Alexa what did what was what still where Tobey Maguire I'm doing Siri, Google I'm Tobey Maguire in IMDb I am be decent Ask Jeeves for - geez remember that dog and Dogpile this Tobey Maguire where lot last thing he was adult him in Boss Baby oh sure he was sure and then I **** you not according to IMDb that's 2017 before that Pawn Sacrifice in 2014 before that Oh The Spoils of Babylon which I do remember that was that Will Ferrell show that he made with him and Kristen Wiig yeah maybe Tobey Maguire's taking a little Tobey Maguire",
            "start": 4250.63
        },
        {
            "text": "sacrifice in 2014 before that Oh The Spoils of Babylon which I do remember that was that Will Ferrell show that he made with him and Kristen Wiig yeah maybe Tobey Maguire's taking a little Tobey Maguire time you know he deserves it he's earned it he's earned it a lot ladies and gentlemen this has been the Kinda Funny Morning Show remember every weekday on Twitch.tv/KindaFunnyGames we come to you with whatever the **** we want to talk about you hang out in the chat you have fun we all have a great time you can watch later on YouTube.com/KindaFunny or listen on podcast services around the globe no matter where you get the show we love and appreciate you for in supporting it and taking care of it and treating it like a little baby if you can subscribe to us on Twitch that's great you can subscribe to us on Patreon that's great too remember Cooking with Greggy now debuts Monday the 11th of September I'm gonna start being like Miyamoto about it yeah September on",
            "start": 4307.51
        },
        {
            "text": "great you can subscribe to us on Patreon that's great too remember Cooking with Greggy now debuts Monday the 11th of September I'm gonna start being like Miyamoto about it yeah September on Patreon.com/CookingWithGreggy never forget there's all we should sell this there's gonna be a week of exclusivity on for patrons each and every time they will be live and free on YouTube eventually one of the other people from the other room I imagine Amy's gonna come in and read subs and read subs while we reset here were Kinda Funny Games Daily until next time oh and support Anthony watch the Star Wars Show follow my Twitter he's great I love them alone thank you and you're back on here doing the show again Thursday yeah no what are you back on the show is this your last one I think this might be my last one cuz I got a deal with the new I'm gonna do up at noon on Thursday have you ever heard of never heard of that **** it's a couple of young upstarts created it themselves and",
            "start": 4343.2
        },
        {
            "text": "they're really doing something with it I do have you on for Thursday so I got to update that pleasure to serve you you",
            "start": 4389.16
        }
    ]
}