{
    "id": 2997,
    "video_id": "idYc3e-vB6w",
    "show_name": "Cooking With Greggy",
    "hosts": [
        "Greg Miller"
    ],
    "title": "How to Cook the Perfect Breakfast - Cooking with Greggy",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get EVERY episode of Cooking with Greggy one week early: http://www.patreon.com/kindafunny\n\nGet your Cooking with Greggy shirt here: http://www.kindafunny.com/store\n\nTHE OMELETTE\nINGREDIENTS FOR OMELETTE\n2 Eggs per omelette\nGarlic powder\nSalt\nPeper\nWhatever you want to fill the omelette with! If you’re following my example, it’s…\nSpinach\nBroccoli\nProsciutto\nPepper jack cheese\nMarconi Hot Giardiniera diced\n\nSTEP-BY-STEP OMELETTE INSTRUCTIONS\n1) Decide what you want in that bitch and prep it all before. Cut up your spinach, shred your cheese, etc.\n2) Crack two eggs into a bowl and season with salt, pepper, and garlic powder to taste.\n3) Whisk those eggs, man!\n4) Get a nonstick skillet, put it on the stove, and light it up a little past medium. Let it get hot. We’ll say a minute and a half.\n5) Drop some butter in there and spread it around to grease the pan -- if you’re using a nonstick skillet, use a bunch of butter!\n6) Pour your eggs in. Use a spatula to pull from the outside of the pan in and the move the pan to fill the holes with egg.\n7) As it starts to firm up (about a minute or minute and a half), start adding the ingredients. I like to start with a cheese base, then veg, then meat. But it’s your call, man.\n8) I like my omelettes runny, but if you want them less juicy, that’s cool. Once the cheese is melted in and you have a pretty mix, get in there and flip one side over to make the perfect omelette. If you’re following me to a T, you’re waiting between 30 seconds to a minute after everything is on there before the flip, but this is all done by watching and deciding. It’s fast!\n9) Serve!\n\nTHE POTATOES\nINGREDIENTS FOR TATERS\nPotatoes\nOlive oil\nSalt\nPepper\nRosemary\nThyme\n\nSTEP-BY-STEP TATER INSTRUCTIONS\n1) Wash them taters. \n2) Dice them taters into bite size-cubes.\n3) Put ‘em in a bowl of cold water to destrach’em. Drain them. Cover them in water again. Repeat until the water is no longer cloudy. If you wanna plan ahead, you can do this the night before and leave them in the water and covered overnight. They won’t brown!\n4) Get a cast iron skillet. Turn it up to medium high. Put some olive oil in there. You want the whole pan covered.\n5) Towel dry the taters.\n6) Gettin’ some good heat off that oil? Toss them taters in there, man!\n7) Salt and pepper the taters. Toss in the rosemary and thyme, too. Repeat this to taste as you turn the taters.\n8) This is where I should tell you a time to cook’em, but it’s really up to you. If you like’em CRISPY like me, they’re gonna go for 10 minutes or longer. Regardless, turn them taters at your leisure.\n9) They look done to your liking? Great. They’re done. Turn off the heat, dump’em on a paper towel, and then serve’em!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1505750364,
    "duration": 870,
    "transcript_chunks": [
        {
            "text": "what's up everybody on today's menu it's the perfect breakfast what that means of course is a delicious omelette the perfect breakfast potatoes and then some fruit on the side just for garnishing whatever you want in there of course in the only whatever you want to but I'll get to that later I call it the perfect breakfast because for a long time I was searching for great breakfast potatoes Nick you like breakfast potatoes I love breakfast can you eat them anymore nope sure can yeah so that for the record if you're making this for somebody else which you should be hopefully you know what I'm saying you should probably make two potatoes I'm making one cuz I'll be the only one eating these potatoes but I went around for a long time going out to eat at different places and I'd go out for breakfast --is and I'd say hey you know what give me your potatoes crispy and they say okay and then the potatoes would always come in the same way not crispy at all and it would really make me",
            "start": 1.76
        },
        {
            "text": "for breakfast --is and I'd say hey you know what give me your potatoes crispy and they say okay and then the potatoes would always come in the same way not crispy at all and it would really make me angry so I finally said I got to take matters in my own hands here and make the perfect breakfast potatoes and so after some experimentation both with myself sexually in on the internet I discovered how to do it so what you do is take a potato and like I said take as many as you want as many as you got as many people are gonna have them we're gonna dice them up into very small cubes here but now the bowl of water you might say Greg what's that boil water for and I say man you are observant and I appreciate you for that if you leave potatoes out after you cut them up they are going to brown and look really gross number one number two we're if you toss in cold water they won't Brown number two when we toss them in there it'll be starch them the water will get cloudy we'll keep rinsing out the",
            "start": 48.59
        },
        {
            "text": "really gross number one number two we're if you toss in cold water they won't Brown number two when we toss them in there it'll be starch them the water will get cloudy we'll keep rinsing out the water there Nick do you miss potatoes I do like the devil you miss them like the devil I think is I love carbs carbs taste fantastic sure that's not particularly we're on that right now nutritionally sure it's not how I eat right now I'll put it you put a crispy potato for breakfast in front of me sir you you're gonna have to wrestle that away from me I'm gonna way to try on the face all right cuz I'm very proud of this like I said it took me a long time to figure you see it tom tossing them in there how they're small I'll get in the next potato this is like the end bit of the potato which is always like the sad thing you don't want to use it it's like the last kid you pick for kickball you know you don't want it you don't wanna make him feel bad I like to I like to get them into like is",
            "start": 85.22
        },
        {
            "text": "always like the sad thing you don't want to use it it's like the last kid you pick for kickball you know you don't want it you don't wanna make him feel bad I like to I like to get them into like is these little columns about that about that with their Nick you getting a shot of that what I want that cube to start as you want to bite-size want you can picture a fork going straight into that guy getting them there and match them all brown and on the side it's oily and salty just delicious all right Nick so the potatoes cut up as you can see here cloudy ass water weirdy starching them we're doing what they need you move them around like this now what I do is come over dump it put more cold water in it see how starchy that is dump it again if I need to and then just let them sit tall ready to use them I like this I like doing this Nick yeah cuz it seems it reminds me of like rainfall I mean like the potatoes remember what it's like to be in the Amazon okay the number one export of the Amazon",
            "start": 121.49
        },
        {
            "text": "them I like this I like doing this Nick yeah cuz it seems it reminds me of like rainfall I mean like the potatoes remember what it's like to be in the Amazon okay the number one export of the Amazon data that like that and a giant spider I say I was gonna go with the frogs that are like hallucinogens got the ones you lick and you just go on a ride you know now Nick it's time to start talking about this omelet what are you like in your omelets I like a lot of meat my omelet yeah yeah I love meat me omelets cool we're gonna do two veg and some prosciutto and presume some pre for you alright that's the Italia that's the that's the meat of choice for us it's Italians right now of course again with omelets you can put whatever you wanted what here's the thing we're filming the show all in one weekend you've been following us on Twitter you know who seem that these things are happening if if it wasn't really breakfast time in Nick and I weren't hungry I wouldn't start with the omelet yeah",
            "start": 160.53
        },
        {
            "text": "weekend you've been following us on Twitter you know who seem that these things are happening if if it wasn't really breakfast time in Nick and I weren't hungry I wouldn't start with the omelet yeah because here's the best part about the omelet Nick is that it's easy and impressive i when I started cooking when I fell in love with cooking I want to start making home I was like okay I like I almost I want to eat smiles I felt dumb cousin omelette you hear people say Oh almost are so easy to make and then you try and you end up making scrambled eggs you're like well I'm an idiot I must be a stupid idiot and I don't want to do this so I looked up how to make an omelet on YouTube found a little known youtuber had basically no subs had basically no support his name was Jamie Oliver and I watched his video on how to make an omelet and he made it really simple and I started doing out like man this was really simple I start making the omelets and I'm like do I post these on Instagram because",
            "start": 207.57
        },
        {
            "text": "his video on how to make an omelet and he made it really simple and I started doing out like man this was really simple I start making the omelets and I'm like do I post these on Instagram because it's gonna go one of two ways either I put it up and people are like you're an idiot that's so easy why are you showing me an omelet or that looks like a really good omelet how did you make it into my credit most of you have been hey how do you make that omelet so I'm showing you today the best part of the omelet is the omelet is just the garbage disposal what do you got left in the fridge toss it into an island with the next morning make it you think I made a chicken wing omelet before I've been chicken wing on one before think I'm a fried chicken omelet yeah chicken thighs yeah things other than chicken yes but I eat a lot of chicken is what I'm saying see the on what I'm making Nick is spinach broccoli portion pepper jack cheese okay pepper jack cheese mm-hmm spice yeah I like the spice",
            "start": 251.15
        },
        {
            "text": "chicken yes but I eat a lot of chicken is what I'm saying see the on what I'm making Nick is spinach broccoli portion pepper jack cheese okay pepper jack cheese mm-hmm spice yeah I like the spice now here's the thing is I'll show you the seat you want to know the secret ingredient it's coming up later on how to make okay very very impressive on what love is important too but for most the people you're making these for in the morning I bet they're not that it's not love it's just get out of eggs now you might say great you can just toss the spinach in there whole and you can but here's the fun thing about spinach is it likes to ruin meals it's a delicious food that I use all the time you'll see a pop up a lot on the show but the problem with it is if you toss in a whole piece like into a sandwich or something that Emily and then you bite into it the spinach comes out and your throws off the whole band you chop it up that's finish can't fight back anymore you're taking away this",
            "start": 285.47
        },
        {
            "text": "a sandwich or something that Emily and then you bite into it the spinach comes out and your throws off the whole band you chop it up that's finish can't fight back anymore you're taking away this finishes natural defense now let me ask you this question you're gonna chop the broccoli yeah do you sing the seminole song are you all the do you remember Dana Carvey Nick and idea so now here's where we get to the secret ingredient now um ladies and gentleman I'm sharing this with you friend a friend all right I'm how to make your omelets out-of-this-world but it's something of Chicago kids know all right right here you know this welcome for Talos right next we got that guarded Dean your relish that I can never pronounce how do you pronounce that Nick Giardiniera yeah I don't know jeered your Italian isn't an Italian word it doesn't matter these are the hot peppers they put on they put on Portillo's food you get a hot you got a beef with hot peppers there that's great what they even get the",
            "start": 327.77
        },
        {
            "text": "isn't an Italian word it doesn't matter these are the hot peppers they put on they put on Portillo's food you get a hot you got a beef with hot peppers there that's great what they even get the pepper the peppers are big they do dice them up though here these Marconi folks I'm mouth watering thinking about it right now buddy I just want you to know do it spin them you don't need to put this in there this isn't needed but I'm just saying if you want to show someone especially somebody from Chicago Heil is what we do and if they're like well I don't like Portillo's you can say get the out of my house you don't get breakfast with me so here's what's gonna go inside the omelet here are the potatoes over here potatoes I guess while I'm talking about it right now we're gonna get some rosemary and thyme in there too salt and pepper - but there's no prep working you for something now the one thing we haven't gotten into the force is the pepper jack now if you want to be let's just get to the",
            "start": 378.6
        },
        {
            "text": "thyme in there too salt and pepper - but there's no prep working you for something now the one thing we haven't gotten into the force is the pepper jack now if you want to be let's just get to the nuts and bolts of this thing to start with all right ladies and gentlemen why are you cooking at home I want to save money all I want to eat better okay all that's you want to impress people Pierre you you're there to it maybe you're like well I'm single I'm just cooking with myself that's true that's fine but you're getting ready to impress somebody are you not some of the dishes we're gonna do here I'm cooking with draggy our great date foods things you want to new things you can buy your pepper jack or whatever cheese you want to put in there shred it already but when you bust it out you start actually shredding there and this thing first off I personally think it tastes better maybe it's just in my head Nick is it in my head probably fresher thank you very much Nick and cool and secondly",
            "start": 410.88
        },
        {
            "text": "actually shredding there and this thing first off I personally think it tastes better maybe it's just in my head Nick is it in my head probably fresher thank you very much Nick and cool and secondly it just looks cool everything we're doing right now looks cool doesn't it and this what I'm the whole point of the show right is like I know master chef I don't know anyone over here but I do this stuff and you guys think it looks cool it's not even that hard you could all do you could all be this cool and look cool and you're gonna have some of you over there gonna be like oh man look at look at old Jeremiah they're making anomalous didn't do it from scratch she's got that cool team fat apron kind of seems like he's put himself down but he says it's not and that's cool these over here just doing this so now I'm Jen threw a wrench in my works bought eggs I've never used before never should the power I'm gonna need to crack them alright so I'm here yeah no these aren't tough we use these",
            "start": 447.9
        },
        {
            "text": "doing this so now I'm Jen threw a wrench in my works bought eggs I've never used before never should the power I'm gonna need to crack them alright so I'm here yeah no these aren't tough we use these organic eggs these farmer Judy eggs usually in these Nick I don't know the Kryptonian base is fine you got to give it everything you got and then they're still fighting back so I cracked the eggs yeah I'm putting the empty ones back in there I'll throw em away off camera don't worry about ah most people be like alright let's beat them up I don't do that I'm not about that life i salt and pepper in here we're gonna crack the crack pepper you don't have cracked pepper just usually your pepper black pepper you're fine but I like that yeah I got pepper corns you know what I mean again is it better cuz it's pressure probably this is the whisk because I'm fancy like that but you're gonna easily use a fork you don't have to get fancy you know I'm new in there it's a good whisk egg just get in",
            "start": 481.55
        },
        {
            "text": "cuz it's pressure probably this is the whisk because I'm fancy like that but you're gonna easily use a fork you don't have to get fancy you know I'm new in there it's a good whisk egg just get in there you want it to look now separated all the bubbles and you see all the peppers in there you can imagine all the garlic and salt in there seems we're gonna do now now it's time to dry these taters cuz they're going out in a second I stake them up I'm a handful spread them out we were drying them here they have to be bone dry I just want to dry them off a bit baby you want to pat him dry regardless even if you put him through the colander I just want to make another dish I got a life to live you I can't be in that in here cleaning all day long who's gonna be getting them platinum true who's gonna be making Patapon come back alright so now we move to my favourite cast-iron skillet if you don't have a cast-iron skillet you are up sir these things are goddamn fantastic I love them we're gonna",
            "start": 523.91
        },
        {
            "text": "be making Patapon come back alright so now we move to my favourite cast-iron skillet if you don't have a cast-iron skillet you are up sir these things are goddamn fantastic I love them we're gonna drop this bad boy here for the potatoes we're gonna reach down here we're gonna light them up there you go and we're gonna keep it medium high high because I want to get in there I want these mother crispy you know I'm saying Nick I don't I'm not crispy while that's going I'm gonna come up here get olive oil you might say Greg there a lot of olive oils on the market which one do you use I use vita olive oil Vita libs did you just pick that because that's Vita I sure did make sure did uh pains heating up but I'm gonna put the olive oil in there don't get crazy with it don't you know I'm not trying to deep-fry these potatoes but I down there what the kids on the internet call like this struggling Rachael Ray youtuber i watch turn of the pan I want a good turn of the pan in there a little bit",
            "start": 569.45
        },
        {
            "text": "to deep-fry these potatoes but I down there what the kids on the internet call like this struggling Rachael Ray youtuber i watch turn of the pan I want a good turn of the pan in there a little bit more cast iron gets super hot super hot so don't burn yourself with the oil anything else you can see now steam slash smoke coming off of it that's always a sign that motherfucker's hot and that's what you want drop potatoes in there and there we go now we're off to the races Nick I like to start seasoning right away cuz I want these all I won't go overboard with the salt Nick don't worry I know you help conscious all right so it's time these potatoes I've gotten them to where they're about there as the kids say they're about there so now it's time to get moving on the omelets now you mentioned earlier and I'm not sure if it may be edit nonstick skillet I when Jen and I got married our old landlord gave us a wedding gift a bunch of nonstick cookware to which I was like oh cool I already have",
            "start": 611.18
        },
        {
            "text": "and I'm not sure if it may be edit nonstick skillet I when Jen and I got married our old landlord gave us a wedding gift a bunch of nonstick cookware to which I was like oh cool I already have some but thank you and then I got home and realized I did not have nonstick cookware I had stick cookware they made almost 30 times harder than they needed to be now if you're not sure I'm gonna prepare this as if it was stick cookware it was just was just a metal pan and I'm gonna put an old knob of butter in there now I'm only gonna put a little bit in there mainly for flavor since these are nonstick if you have a stick one or you're concerned that you might put any more get nuts with it put some in there you want you because of this when you get an omelet to stick that's the worst okay some about those potatoes right now yeah they're speaking to me now here's what I want to do yeah it's gonna be loud I'm gonna kick on the exhaust fan for a second okay because our we have",
            "start": 660.92
        },
        {
            "text": "worst okay some about those potatoes right now yeah they're speaking to me now here's what I want to do yeah it's gonna be loud I'm gonna kick on the exhaust fan for a second okay because our we have very sensitive smoke alarms and I notice that I'm getting some off there these panes are looking good now again if your brain up finding you if you're afraid that you do have Stick cookware you want to put more butter in and you want to work it up around the sides because that'd be a big problem now what come over here and dump these guys on you just go the pan does the work moves it around now again I learned my omelette recipe many a moon ago from one YouTube guy nobody knows Jamie Oliver and what he did is he dumped him in then he did this where he pulled back and then filled in he's like this makes little things and I was like I don't know why people do that but Jamie Oliver does it so I do it so if you want to look good you can do it so you can see I'm gonna try to bring it up for",
            "start": 699.2
        },
        {
            "text": "this makes little things and I was like I don't know why people do that but Jamie Oliver does it so I do it so if you want to look good you can do it so you can see I'm gonna try to bring it up for you Nick can you see it alright you see like I'm already getting a very good firm outline of what the elements going to be getting some egg push back up there when you see that you're gonna start putting I put the cheese in first again how much is all jazz do whatever you want kangaroo just put it in there all willy-nilly however you like make it look good to you again you're the one who you're the only person who should see the Alma in this fashion but you see moving around like that see you next see how you move around that's what you want non-stick pans like I was talking about that's also how you know the Alma's cooking the way it's supposed to do I was gonna say a skosh Nick but it's done come on slide Spidey in flip them up like that that was perfect for videos you want to get in here",
            "start": 752.06
        },
        {
            "text": "you know the Alma's cooking the way it's supposed to do I was gonna say a skosh Nick but it's done come on slide Spidey in flip them up like that that was perfect for videos you want to get in here this looks great I'm just cleaning up the plate again it's all about presentation I think it's pretty I put him on a plate with a little bit of a little bit of the stem it says hey this we used to be in the earth we all come from the earth and eventually you will die go back to the area you don't to put too much food on the plate either plantings the one thing I'm still learning to so I'll just stop there so there you go ladies and gentleman that's Greg Miller's perfect breakfast it is simple it is easy don't be afraid get in there do it if you over brown one one gets done before the other just adjust in the fly you'll be fine put whatever you want the omelets enjoy the potatoes enjoy the fruit but you know switch it up have fun cooking supposed to be fun that's why I do it and that's what",
            "start": 791.81
        },
        {
            "text": "adjust in the fly you'll be fine put whatever you want the omelets enjoy the potatoes enjoy the fruit but you know switch it up have fun cooking supposed to be fun that's why I do it and that's what Cooking With Greggy is all about let me know in the comments your variation of my recipe of course tweet me images of your food as you do it with the hashtag Cooking With Greggy and until next time know",
            "start": 838.58
        }
    ]
}