{
  "id": 2214,
  "video_id": "2JQIrzEu9YA",
  "show_name": "PS I Love You XOXO",
  "hosts": ["Greg Miller", "Tim Gettys", "Colin Moriarty"],
  "title": "PSX 2016 Reactions - PS I Love You XOXO Ep. 64",
  "description": "The PSX Showcase just ended, and boy howdy, Greg, Colin, and Tim have thoughts about The Last of Us Part II, Patapon, and Crash! (Released 12.03.16)\n\nThanks to our sponsors Blue Apron and  MVMT Watches! Get three free meals and free shipping at http://www.blueapron.com/iloveyou. Get 15 percent off today —with free shipping and free returns — by going to http://mvmtwatches.com/love.\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://www.youtube.com/watch?v=ifgS3N6JZyc\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\n\nColin - http://www.twitter.com/NoTaxation\n\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
  "published_at": 1480811046,
  "duration": 4516,
  "transcript_chunks": [
    {
      "text": "what's up everybody? Welcome to PS I Love You EXO EXO episode 64. I'm one of your hosts, Greg Miller, alongside he only does everything, Colin Moriarty. It's good to be here with you today. It's good to be here with you today and the pure one, Tim Gettys. Let Tim uh ladies and gentlemen, if you're listening to this or watch on an MP3 version of the show or watching on YouTube, it's important to point out we are doing this live right after the end of the PSX 2016 press conference. So we'll go through, try to fact check as we go, but you know how these posts go. Something goes up, they didn't announce the conference is all there. We're just going to react to the conference though along with you if you're in the Twitch chat. Thank you so much. We'll be pulling questions from there and from Twitter and doing a full show for you. And of course, as I've said before, this is episode 64. It'll go live immediately then on Tuesday at 9:00 a.m. you'll get the the PSX panel that we're doing tomorrow, Sunday at noon.",
      "start": 0.5
    },
    {
      "text": "a full show for you. And of course, as I've said before, this is episode 64. It'll go live immediately then on Tuesday at 9:00 a.m. you'll get the the PSX panel that we're doing tomorrow, Sunday at noon. Colin, yeah, what' you think that was great? Uh before we the conference started, we talked about or something I just said was that I think that for Sony to really make PSX a thing and and for the press conference to be a thing and for people to pay attention, they need to have uh they need to make things pop. They need to have big announcements for people to pay attention outside of us, outside of the nerdy PlayStation kids. You're talking about us exactly and I think they did that. Naughty Dog opened and closed the show. So I thought that that and and Naughty Dog is predict uh a um you know, is is I think pretty easily the best developer in the world um and that's a Sony own studio and so to showcase them um in that way I think is really really bold and I think it's awesome and I think it was a nice",
      "start": 52.64
    },
    {
      "text": "pretty easily the best developer in the world um and that's a Sony own studio and so to showcase them um in that way I think is really really bold and I think it's awesome and I think it was a nice red herring to put Uncharted out there early because then I think that that took The Last of Us off of the board for a lot of people that there's no way that they would do both of those things. I don't think it it was you that I think that was your prediction one of them not an official prediction but it was that my prediction was that they would do a playthrough of the Uncharted story DLC and then yeah and that you added what if they end with Last of Us and we're all like that'd be **** awesome and that's what happened. So it's cool to see that um I I I like that they've announced it. I think now they need to do a similar thing they did with The Last of Us on to do disappear for a while and I think that I think they're going to I mean with the with the phrasing of it right Sean Layden saying",
      "start": 92.8
    },
    {
      "text": "now they need to do a similar thing they did with The Last of Us on to do disappear for a while and I think that I think they're going to I mean with the with the phrasing of it right Sean Layden saying this is from one of our developers it's incredibly early on I think that says all you need to see say right? I don't I don't think you'll see any more at E3 probably right? No, I don't think you'll see I I mean I would really love if we didn't see anything about the game until 2018 and then I think it'll probably be a 2019 game so um yeah so it was really really cool to see. I think it looks great. I happy uh that Joel and Ellie are back. We we often conjectured back on Beyond especially a lot about the way the game ends, the original game ends and my my thing was always that I wanted to take part like pick up right after that like to literally be in the ending in the beginning of The Last of Us Two. She looks like she's aged up a bit. Yeah, so she's older. It looks like a few years jump though yeah",
      "start": 124.32
    },
    {
      "text": "pick up right after that like to literally be in the ending in the beginning of The Last of Us Two. She looks like she's aged up a bit. Yeah, so she's older. It looks like a few years jump though yeah true true true true um and um good to see them reunited. I think that it would have been I think you could have gotten away with doing a different story in that world. I think that would have been a mistake though and I think that having those touchstones in that world um are really important. I mean obviously the Clickers and everything are are also touchstones in that world and the fireflies but Joel and Ellie are the characters we really care about um and we're getting way ahead of ourselves but my assumption is that they're really going to kill Joel this time to make sure that they don't do another one after this. I think they it's imperative to do this game. I like that they do part two that's a good title for it right and I think that that means that it's going to start right after the game",
      "start": 157.96
    },
    {
      "text": "one after this. I think they it's imperative to do this game. I like that they do part two that's a good title for it right and I think that that means that it's going to start right after the game. I think that there could be some form of time jump to because if you're going to if you're going to do this I do think that they need to make some big moves with it with the story and I think that a good way to get around that could be like this is what's happening time jump a little bit time jump a little bit as you see in The Walking Dead and I want to say so because I'm seeing some of in the chat people are saying it's going to be out in 2018. There's no way this game's coming out 2018. If you if you there's just no way so get that out of your mind now. No way. I think 2019 might even be pushing it so um they take their time uh the resources that clear you know Naughty Dog was two teams and now they're one team again and they kind of move and leave like desperate elements it seems like behind and that",
      "start": 190.04
    },
    {
      "text": "um they take their time uh the resources that clear you know Naughty Dog was two teams and now they're one team again and they kind of move and leave like desperate elements it seems like behind and that seems like what happened with the Uncharted for DLC. So this so the team is literally been working on this game for maybe 3 months, four months, 5 months and they're rendering things obviously and stuff like that. So there's absolutely no way in hell the game coming out 2018. So get that out of your mind now. Get it out of your **** faces. Tim, what did you think of the overall conference? Oh my God your dreams continues. I know right is it just a life of dreams now that's I hope so. I hope your Dreams 3 is right around the corner and I think it could be. I think that they they understand they obviously get it their conference is now minus the PlayStation 4 Pro conference which was a totally different type of thing and now again I was saying this on PS I Love You last week but I'm happy in",
      "start": 223.96
    },
    {
      "text": "obviously get it their conference is now minus the PlayStation 4 Pro conference which was a totally different type of thing and now again I was saying this on PS I Love You last week but I'm happy in retrospect that we had that because it allowed this conference to be this conference. It gave the space for this to have the big announcements and if we're going to get in a cycle where at E3 and PSX we get these levels of press conferences I'm **** down man that's two times a year you're getting hyped you're building things up you're here's a lot of stuff happening right now here's stuff happening really soon and here's stuff to look forward to in the future sure that's what you got to come with those punches well that's the I mean I think and this is this is one of those things where I always I feel like we have to have that try to step back and be objective right because I know at last year's PSX conference right we'll all admit the ending was bad right but boy was talking Adam boy",
      "start": 259.36
    },
    {
      "text": "I feel like we have to have that try to step back and be objective right because I know at last year's PSX conference right we'll all admit the ending was bad right but boy was talking Adam boy was talking about when they try to play in these conferences right they try to give all these different moments so that there's a moment or like three for every person so you don't care about every announcement but you have enough in there to care about and I feel like the deck is stacked here cuz two moments immediately are Uncharted and Last of Us which everybody cares about and then to throw in a Para of the Rapper to throw in a Patapon for me to throw in near you show different stuff I feel like this is a Dack that St or I'm sorry this this is a deck that's stacked right to get out there and show you like I mean Nounie showing more of that Gravity Rush of course so close uh the Gio coming out and talking to the Vita people which we I said he would I mean again Nob brainer that Gio is",
      "start": 295.32
    },
    {
      "text": "show you like I mean Nounie showing more of that Gravity Rush of course so close uh the Gio coming out and talking to the Vita people which we I said he would I mean again Nob brainer that Gio is going to do that this what Gio does but to come out and announce five VA games and say here they all are and this is what we're doing I think this is just a **** great conference in there the only downside is something we called out a couple times in there is I they did two sizzle reels in there for different here's other things coming from PlayStation 4 here's things coming to PlayStation VR and they didn't bother putting up logos or titles so I'm watching games I'm like that looks cool but I don't even know how to follow up on that yeah I um I I I agree with the you know we talked about this a long time ago that I think that because PSX and E3 are so opposed on the calendar that they do make the the perfect six six-month points for um for in order to announce things and I like that",
      "start": 332.24
    },
    {
      "text": "this a long time ago that I think that because PSX and E3 are so opposed on the calendar that they do make the the perfect six six-month points for um for in order to announce things and I like that they're kind of kind of maybe hopefully going to go away other than you have to give the the the TGs crowd a little bit of something and what not too um yeah I think that starting with Uncharted is a strong move uh and it looks great. I am a little concerned um with the idea of showing so much of it um if we go based on the only other time Naughty Dog has ever done single player DLC you're looking at something that's probably going to be maybe 90 minutes long and they basically just showed you 5% of it you know like if if we're going on that metric and I'm like well that's kind of what's interesting I don't I really don't feel like they should have showed anything I wish I didn't have to see that actually chat chat's calling us out and I want to throw it out there too on Noor's Twitter what",
      "start": 366.44
    },
    {
      "text": "I don't I really don't feel like they should have showed anything I wish I didn't have to see that actually chat chat's calling us out and I want to throw it out there too on Noor's Twitter what they tweeted is we have a new Uncharted game. Uncharted The Lost Legacy is is a new Standalone Story chapter. Khloe Frasier and Naen Ross are back interesting I I it's not even interesting that it's not being called DLC. I'm saying it's interesting it's being called chapter chap Uncharted chapters are very defined right they are an hour hour and a half like yeah it's going to be interesting to see how long this I'm shocked that it wasn't uh Sam oh yeah yeah whoa maybe there is a chapter with them yeah well I mean it's it's an interesting backstory right of course I I know that I think you and I disagree on this like I like Naen a lot I really enjoyed her character and her performance in there so get more of her a younger version of her to see how she went off onto this thing and how that crossed",
      "start": 409.24
    },
    {
      "text": "on this like I like Naen a lot I really enjoyed her character and her performance in there so get more of her a younger version of her to see how she went off onto this thing and how that crossed with Chloe I'm interested right and Sony likes to do you know I think people are reading a little too much into the Standalone thing uh Left Behind was also Standalone and uh the idea that um it's technically a prequel and so it's really should be played first if you want to play Things sequentially although I wouldn't because it spoils things in the in the actual game um but uh I remember when I went and saw the Left Behind before it came out saw it a few times and went to Naughty Dog um and went also to Sony HQ and uh they I think they play up the the short and tight and Standalone experience and I think that that's something that comes from first party it really actually started um with Infamous DLC being Standalone so people reading into that um I think are reading into it too much",
      "start": 445.48
    },
    {
      "text": "and I think that that's something that comes from first party it really actually started um with Infamous DLC being Standalone so people reading into that um I think are reading into it too much I think you're looking at a standalone thing but they're basically saying you don't have to have Uncharted 4 to play this it'll probably be $5 or $10 and I assume it'll be 90 minutes to two hours long so I that was my only you know I was excited to see it I was excited to see that it's a um that it's a story about characters we didn't get that didn't get quite a lot of love in the uh one character in particular I don't care really about Naen uh but Chloe in particular uh I think it's cool that we're giving her uh some love here because I think she's a really actually awesome and essential character to the story um and uh my only takeway yeah but I wish I didn't actually see any of that I wish I can take that on my head because I know that when I see play through that sequence that like well",
      "start": 483.4
    },
    {
      "text": "to the story um and uh my only takeway yeah but I wish I didn't actually see any of that I wish I can take that on my head because I know that when I see play through that sequence that like well you know something's ruined there or whatever I like to so but you got to jump on the grenade every once in a while I think it was a very strong um and awesome way to open the show sure uh followed up by I'm sorry you want to go I was going to say like I know that this is a there's a slim chance of this happening but what if that isn't in the game because this definitely seemed like a big reveal of Chloe that you wouldn't necessarily need in the game you know this seemed very PSXE very like I'm going to show you this and like that whole thing was a buildup to her taking the hood off yeah I definitely think it's in the game I think if anything you're going to get beforehand Chloe not in the thing talking like and then that leading into this mission of how this all happen and then you go from",
      "start": 519.48
    },
    {
      "text": "think it's in the game I think if anything you're going to get beforehand Chloe not in the thing talking like and then that leading into this mission of how this all happen and then you go from there yeah cuz you figure like uh when she's like dodging behind the door and people are opening like that's probably gameplay you're controlling that you know that is something that's the camera a lot closer too than it normally is more Last of Us than than even Uncharted 4 yeah yeah uh from there we jumped into Marvel versus Capcom Infinite which the thing is like that is such a huge moment that was spoiled because there was so many rumors going into it but like if that just came out of nowhere that would have been **** huge sure and I mean even now I think it's great that so calling it Infinite they're doing the platform thing they tried it with uh Street Fighter 5 but I think that now they obviously learned a lot and I think they're going to go forward with it and not putting a number to",
      "start": 554.56
    },
    {
      "text": "they're doing the platform thing they tried it with uh Street Fighter 5 but I think that now they obviously learned a lot and I think they're going to go forward with it and not putting a number to it is good because this is a game that we'll be able to get for years with a bunch of new characters constantly being added um you have so many characters on both ends and it's good it's like Smash Bros like like just end it here I don't need more sequels to it just keep adding on to what what is um the trailer honestly from a hype perspective it was a little low on the hyp but again I think it's cuz we got away rumors got away from this one that we knew it was coming and like I was waiting for Spider-Man to swing in and I was like is it going to be Insomniac Spider-Man is it going to be something cool like that and okay I think my problem is like uh like MVC 2 was so so awesome for me and I there was such a big gap between it and MVC3 and no one ever thought it was really going to happen",
      "start": 590.56
    },
    {
      "text": "cool like that and okay I think my problem is like uh like MVC 2 was so so awesome for me and I there was such a big gap between it and MVC3 and no one ever thought it was really going to happen and when that trailer dropped like that trailer had so many moments and even the first trailer showed a lot of people this one only showed four people and that's cool Mega Man **** huge him being back big deal um Captain Marvel awesome they're definitely going them MCU route like we we heard about but no X-Men right what this means to me is it's disappointing in terms of I wish that trailer was more hype but it's exciting that we're GNA get a lot more hype trailers we're GNA get a lot of character I mean you fig too and that's the big thing remember they're playing tonight at the Capcom cup they're going to sh debut game playay so you I would I'd imagine new characters there even where they're going to go out and show maybe I mean Capcom always has small builds I mean that's why I wasn't",
      "start": 627.28
    },
    {
      "text": "going to sh debut game playay so you I would I'd imagine new characters there even where they're going to go out and show maybe I mean Capcom always has small builds I mean that's why I wasn't surprised Capcom always reveals their fighting games with a few characters like bu in the builds anyway so and then slowly builds those out but not nc3 though right but but this game I think is under uh more scrutiny because first of all I think that they've kept things secret the fact that I think the big thing is that it's coming out next year um so the game's been in development for a long time and I think and it hadn't leaked actually for a long time which I think is is kind of interesting and I was disappoint it's not Mega Man it's X and that was one of the things that I was that I was a little disappointed in and was hoping I'm hoping I'm because I'm trying to read into things with Mega Man specifically the way Capcom treats him is that Mega Man being in you know having an amiibo and being",
      "start": 664.76
    },
    {
      "text": "disappointed in and was hoping I'm hoping I'm because I'm trying to read into things with Mega Man specifically the way Capcom treats him is that Mega Man being in you know having an amiibo and being in Smash Brothers is kind of cool and then X being in in this or whatever they're still in their minds and I'm hoping that hopefully we get something kind of cool out of it you know um in the future for a standal on Mega Man game which we want for a long time but I was like that and obviously Marvel versus Capcom 3 uh so the Marvel versus Capcom games being removed from PSN was a really big deal a lot of people were really pissed about that so having that back and getting over those Hoops with with Marvel is really cool and we can read a lot into the way Marvel's treating it **** now too I just think that now today out today as well the one thing that I will say about about Marvel Capcom Infinite I was curious as if Capcom's exclusive uh relationship on the fighting scene would stay",
      "start": 698.24
    },
    {
      "text": "I just think that now today out today as well the one thing that I will say about about Marvel Capcom Infinite I was curious as if Capcom's exclusive uh relationship on the fighting scene would stay with uh this particular game it sounds like not um based on some things people are sending me some tweet yeah there's a Capcom tweeted about it right saying consoles and I think it would be very stupid to leave it on um on I think that they might have learned their lesson with Street Fighter 5 actually so um yeah there's that you mean fighting game of the year Street Fighter 5 uh then up next was the Wipeout Omega collection which was cool it was really cool and it seemed like you're getting a new Wipeout game and then when was just the collection of everything that's come before like all right yeah I mean Sony shut that studio down so I I I feel like it would be a little shitty for them to be like we're makinging a new Wipeout game with just a new team although those guys are those guys",
      "start": 732.84
    },
    {
      "text": "yeah I mean Sony shut that studio down so I I I feel like it would be a little shitty for them to be like we're makinging a new Wipeout game with just a new team although those guys are those guys are banging around still but we haven't had a new Wi out game actually in a long time so um so it is cool that at least we're getting a collection and I think that they're doing these things with this uh with the Parappa Patapon LocoRoco collection and with uh Crash to I think kind of gauge interest on new games I think I think these are all options and so I think um I think crash a new Crash game is probably a given um based on the the reception of of that we'll talk about that in a minute yeah I mean yeah because next up is Destiny they they have the dawning whatever uh December 13th through January 3rd uh more Sparrow racing more things to do stuff like that if you're a Destiny nerd you know all about it probably then yeah Crash Bandicoot insane Trilogy how'd it look uh oh it looks great",
      "start": 767.88
    },
    {
      "text": "3rd uh more Sparrow racing more things to do stuff like that if you're a Destiny nerd you know all about it probably then yeah Crash Bandicoot insane Trilogy how'd it look uh oh it looks great it looks now you're giving up the ghost that they could play on Vita yeah yeah yeah yeah which thank God cool that's even you were just expecting it upred is that the deal uh well I mean he said from the ground up but I didn't expect it to look this this good I mean like when we were watching my live reaction I was just like man like there's nothing wrong with this and of course now I can be nitpicky now that I've looked at some screens and stuff it's like is a little too clean it is a little too cartoony compared to like the kind of Mossy look that the originals had but hey I'm **** super sold super stoked for it uh looking at the press release here um there's PS4 Pro support with enhanced FK finally Fork that's what I've been waiting for thank you very much the game is going to be $40 okay",
      "start": 806.8
    },
    {
      "text": "stoked for it uh looking at the press release here um there's PS4 Pro support with enhanced FK finally Fork that's what I've been waiting for thank you very much the game is going to be $40 okay um so that's cool and yeah over on the Playstation blog they have it up here saying that they're calling it a remaster plus rebuilt levels based on the original geometry rebuil characters following the original designs rebuilt cinematics inspired by the originals and then yeah adding a whole bunch of new features you're talking about already and um the most important things and this is where the the games needed some help is full analog stick support a United safe system and unified checkpoint system making it easier than ever for new fans to enjoy the classics so they're fixing the problems of Crash one great **** yes um obviously I'm very excited about this I thought they did a great job and it was way more impressive looking than I think any of us expected yeah yeah I I it was defin it's",
      "start": 847.4
    },
    {
      "text": "one great **** yes um obviously I'm very excited about this I thought they did a great job and it was way more impressive looking than I think any of us expected yeah yeah I I it was defin it's definitely cool it's u i it's one of those watching that like that's the way I'd like to play those games I need to play those games cuz obviously I give use so much **** for them in a jovial sense yeah but here I am I I'll I'll definitely jump in there for the insane Trilogy does what does the press release say just 2017 is that 201 sticking to that also uh weird name to call the insane trilogy but I enjoy that because it does kind of leave options open where it's like all right cool they might be doing more with with crash and I assume yeah like you're saying Colin if if does well they will I think they're just totally going to monitor these these different collections I think we're getting to I want to get to those please uh Crash Bandicoot yeah so that's great then RE7 has the final",
      "start": 884.08
    },
    {
      "text": "I think they're just totally going to monitor these these different collections I think we're getting to I want to get to those please uh Crash Bandicoot yeah so that's great then RE7 has the final demo coming out on Playstation that's huge uh demo today uh I mean I I didn't think for a second this game was going to get delayed and they're sticking to that date and I know that was something we were talking about specifically on the show so that that is coming out in January um and it looks **** awesome I I really really really really really can't wait to play that game in VR I think it's I I I really hope that it's uh The Proving Ground for being able to do AAA experiences in VR and giving devs a reason to go the extra mile to make their games render that way because um I think that Resident Evil obviously fits in the mold of a game you'd want to play in VR and I I was super happy to see the reaffirmation reaffirmation of the day yeah that's the thing of course I was making a bunch of",
      "start": 922.92
    },
    {
      "text": "evil obviously fits in the mold of a game you'd want to play in VR and I I was super happy to see the reaffirmation reaffirmation of the day yeah that's the thing of course I was making a bunch of predictions that I thought I was going to get delayed uh I'm still interested tomorrow is the big day for me in that game where I'm going to go take my private demo of it and see because I right now on paper watching the thing talking to you I feel like that's a game that you won't end up doing I think that you're you'd get it and just not going to work and that's just based on the Scuttle butt I've heard about Resident Evil VR so I'm excited to put on myself and have reaction for that PSX panel tomorrow either way excited about the game if I can't play in VR that would be very disappointing yeah um but I'm hoping that it works they're making a big deal out of it and I don't know that Sony would let them if or Sony would be in on it if it wasn't working properly sure but I'm I'm skeptical as",
      "start": 959.2
    },
    {
      "text": "um but I'm hoping that it works they're making a big deal out of it and I don't know that Sony would let them if or Sony would be in on it if it wasn't working properly sure but I'm I'm skeptical as well but I'm skeptical anytime I put on the headset until experience proved it to me uh Ace Combat 7 was the next VR game shown there cool yeah I mean VR is made for games like that and so I think that that's going to be you know it's very similar to E Valkyrie a game I wouldn't probably play otherwise yeah but yeah Street Fighter 5 debuted a new character Akuma not a huge surprise yeah yeah exactly and then yeah PaRappa the Rapper 20th anniversary edition there demo out right now on the PSN you can Chum up and get it but then the mo like out like Parappa had been leaked okay fine and then out of left field they end it while I'm taking notes that yeah they're also putting out a remastered Loco Roco and a remastered Patapon which is **** phenomenal and if I can ask you just buy the",
      "start": 990.16
    },
    {
      "text": "out of left field they end it while I'm taking notes that yeah they're also putting out a remastered Loco Roco and a remastered Patapon which is **** phenomenal and if I can ask you just buy the Patapon one I don't I mean buy any of the ones you want but buy Patapon so they make more Patapons that's all I'm asking you to do yeah again I I think this is another monitoring situation first of all made me feel old that Parappa is going to be 20th 20th anniversary I remember getting that game in 1997 and long time ago um and not really knowing what to expect very short experience but really really unique and important experience and what I what I was seeing when they were talking about the Parappa um uh 20th anniversary was I was like waiting for them to bring up UmJammer Lammy which is a great game or unfortunately PaRappa the Rapper 2 which is which is not good and I'm glad that they stayed away from I I would I could have done with Cham Lam because I think that game's **** Rad but um",
      "start": 1028.24
    },
    {
      "text": "game or unfortunately PaRappa the Rapper 2 which is which is not good and I'm glad that they stayed away from I I would I could have done with Cham Lam because I think that game's **** Rad but um prop the raer 2 is a really bad game and so I'm glad that they uh they stuck with that and then kind of extended it to some of the these other Japanese Centric a level IP um that have been dormant for a while because I'm really Loco Roo not so much but I am a little surprised that Patapon's kind of gone away yeah um and so um but this is I mean I'm a 100% behind you that it's a monetary situation because they they don't want to jump in and have what we talk about here all the time right where it's like okay dishonored was a critical darling let's make a sequel okay nobody cares about the sequel all right be on good and evil people want a sequel here it is uh people love me Ed let's make a sequel nobody's buying the sequel like you have to put your money where your mouth is right and actually",
      "start": 1062.12
    },
    {
      "text": "right be on good and evil people want a sequel here it is uh people love me Ed let's make a sequel nobody's buying the sequel like you have to put your money where your mouth is right and actually put it down granted Patapon not on the scale those games but the same business model applies right let's not go and make a new one if we can just **** figure out if people actually want a new one although it is disturbing they're putting on number one CU number one is the clunkiest craziest you're going to need a guide to play to understand who you're leveling up and why you're leveling them up whereas like two three got better and better but again beggars can't be choosers make a **** special edition PS4 Pro and I'll also I don't know that it's I don't know that it's beyond the realm of possibility that Within These collections individually will be PaRappa the Rapper like Loco Roo games and then and then um well I think they going to be three different things no I know that's what I'm",
      "start": 1100.2
    },
    {
      "text": "that Within These collections individually will be PaRappa the Rapper like Loco Roo games and then and then um well I think they going to be three different things no I know that's what I'm saying so that's why I'm wondering if like there will be actual verticals for all I hear you but I think that like Parappa they would have said that right like they did for Crash where they would have got they would have got out in front of that with this messaging if if if they had said that for Parappa and then been quiet about Loco and Patapon I'd be like oh okay cool but the fact they didn't I think it's just going to be these One games they just put out maybe I think that it gives them more opportunity to talk about it later sure but I think you would have talked about it now for Parappa uh then Knack the one it's been Mark Cerny's baby that's been developing since we've known about this game for a long time and and um not a huge surprise I think what they I think what they read into it here was",
      "start": 1129.04
    },
    {
      "text": "the one it's been Mark Cerny's baby that's been developing since we've known about this game for a long time and and um not a huge surprise I think what they I think what they read into it here was a they had the engine working uh and Knack sold really well now now the uh and I think that we're a little detached from the reality of probably normal people playing Knack like people that just bought it at launch or bought it for their kids or whatever there probably a different experience and I think there was some balancing issues and the game didn't run very well um crashed a lot um so I think that there's some things to fix but I'm not super surprised I mean it leaked in a CV like two years ago so this is a game that's been percolating for a while um I don't I'm not I'm what I'm more shocked about is that they announced that they had the ball to announce it at a conference the hype I'm telling you man they know they know that like as much of a joke as it is it's it's like a meme they",
      "start": 1162.28
    },
    {
      "text": "about is that they announced that they had the ball to announce it at a conference the hype I'm telling you man they know they know that like as much of a joke as it is it's it's like a meme they they want that **** even for the PSX people people lost their **** is what it is people are excited about announcements and sequels and some people yeah had fun there in that Knack World Knack world I don't think anyone dude but you could get small remember you could be big or you could be small iied to I tried to give him my all when I hard locking on you right Gravity Rush 2 then got a trailer uh Grant Turismo got a trailer then and then they got to the big one Ni No Kuni 2 2017 yeah I'm surprised I don't believe it uh we'll see what happens uh when the time comes the I took a few interesting components out of Ni No Kuni because I'm a huge fan of Ni No Kuni I really really loved the first game um the combat so we got to see gameplay which is cool the combat looks great I noticed that there were no",
      "start": 1202.52
    },
    {
      "text": "components out of Ni No Kuni because I'm a huge fan of Ni No Kuni I really really loved the first game um the combat so we got to see gameplay which is cool the combat looks great I noticed that there were no animal or monster proxies in in the combat I'm wondering if they're keeping that out because you really weren't typically fighting with your own characters in the game wonder if they going to ease that later or if the mechanics are changing I wonder if people didn't find that Pokemon aspect of it satisfying I thought it was **** and that's really at the heart of the game so I doubt that they're going to get rid of that but I did notice that in the combat um that that that seemed to have been missing but maybe I missed it maybe it was going too quickly or I just I just missed that particular scene the art even though Studio Ghibli has nothing to do with this the art looks uh fantastic both ingame and in the cutcenes uh the Whimsical and kind of fantastic nature of the game I think was what what",
      "start": 1243.88
    },
    {
      "text": "the art even though Studio Ghibli has nothing to do with this the art looks uh fantastic both ingame and in the cutcenes uh the Whimsical and kind of fantastic nature of the game I think was what what why it was so good and it was super **** sad and I'm wondering what uh what the plot will be the because the big draw of Ni No Kuni was that the the dude's mom dies and you're trying to like go find her like or Revival or whatever and it's like **** really sad game and really really really shockingly remember we were at IGN and I got permission to post the beginning of the game early so to show everyone and people were like **** heartbroken and I'm like that that was the key to that game was the sorrow and I wonder if um well yeah the storytelling was important but the sadness was like the the ju deposition of the colorful nature of the game and the cartoony nature of the game with the actual really **** sad and dire story I thought was really cool and so I'm interested to see what the",
      "start": 1273.84
    },
    {
      "text": "ju deposition of the colorful nature of the game and the cartoony nature of the game with the actual really **** sad and dire story I thought was really cool and so I'm interested to see what the story of this one is but I mean I'm obviously in I mean it looks great yeah yeah yeah uh then it was my boys the Yakuza Yakuza 6 and Yakuza Kiwami Kiwami out summer 17 17 I think Yakuza 6 was what is it fall 17 or uh I saw it on the blog here a second ago uh I'm it's fine I'm I'm stoked I love Yakuza games uh but the problem is once you play one Yakuza game you've played all the Yakuza games so whichever one you jump into I wouldn't be expecting to jump into the next one necessarily I know a lot of people love it I love Cosmo don't get me wrong but they all fall into the same thing pretty quick uh Colin then it was Danganronpa V3 yeah uh we we got we finally get a little taste of it looks awesome I was afraid when they first showed it because NIS is bringing the uh the first two to Playstation 4",
      "start": 1313.28
    },
    {
      "text": "Colin then it was Danganronpa V3 yeah uh we we got we finally get a little taste of it looks awesome I was afraid when they first showed it because NIS is bringing the uh the first two to Playstation 4 in a couple of months and they had just announced the date um so I was a little I was like oh like it's great to see Danger on the stage but I thought that they were just showing um you know Danganronpa one and two but they were showing three and uh it's good that there's a whole new murder mystery going on you're going to be killing kill people in order to stay alive Monokuma uh in it Monokuma Cubs this is exciting you freak big now I got to because you know the second one introduced Monami who was the who was the the female monok now maybe they have some some so I'm super stoked about that Danganronpa really is a fantastic and very special franchise um super Japanese but really really really really really great uh very well localized by NIS as well and uh coming to Playstation 4 NV some",
      "start": 1352.36
    },
    {
      "text": "raer really is a fantastic and very special franchise um super Japanese but really really really really really great uh very well localized by NIS as well and uh coming to Playstation 4 NV some people were confused about that but they really are they are bringing this game to Vita in the west um so super super stoked about that one of five Vita announcements from good friend Gio Corsi when he was out there so that's always exciting to have him out there doing some stuff um catching back up with then we had a Nier Automata trailer Tim you're in on it looks hype yeah great yeah can't wait release date March 7th yep looking forward to that 17 they were previously saying February I think so so this a big one Whatever at least there's like a date sure then it was Ys Origin yeah Ys Origin is coming so um we had uh not Oel that was on PSP but the what was the one that came out a couple of memory of yeah of Celceta uh which I thought was really really great and um really itch scratch and itch on Vita",
      "start": 1394.6
    },
    {
      "text": "um we had uh not Oel that was on PSP but the what was the one that came out a couple of memory of yeah of Celceta uh which I thought was really really great and um really itch scratch and itch on Vita action RPGs do really well and this is an old series I mean this series goes back to like turbo Graphics this is a um a really really special franchise so I'm glad that it's I'm not super surprised that it's coming West because other games of a similar ilk not necessarily in gameplay but in terms of um that the anime aesthetic uh like um that what's that what's that one that Sword Art Online they keep bringing those games out they keep banging those games out of Bandai Namco so it's not a huge surprise that well others are looking at this and saying well we can find a niche here of people that want to play this game and again coming to Vita so at PS4 as well um so uh we so obviously I'm in and it's soon is coolo 2017 uh then they showed uh Dreadnought which will be a Playstation 4 console",
      "start": 1435.12
    },
    {
      "text": "that want to play this game and again coming to Vita so at PS4 as well um so uh we so obviously I'm in and it's soon is coolo 2017 uh then they showed uh Dreadnought which will be a Playstation 4 console exclusive this is a game I've talked about it before it just didn't work for me when I played at E3 years ago but I know that it is a hit it's big on PC so exciting that it's coming here uh Pyre was next from our friends Supergiant people who did Transistor uh again there's a let's play up on youtube.com/kindafunnygames uh game's beautiful as always looks like a lot of fun those guys Supergiant gets it man they're **** awesome yeah and I think again what I was saying about their particular games as being their third is that they seem to understand um again everyone's hung up on the aesthetic which I think is great but the design philosophy behind their games is is super cool because they're different um they're really all radically different games but they have an RPG heart that",
      "start": 1476.16
    },
    {
      "text": "which I think is great but the design philosophy behind their games is is super cool because they're different um they're really all radically different games but they have an RPG heart that like they they they know what they want to make they're making role playing games so I I um yeah I'm stoked to see that as well I never even got through Transistor so I need to go back and that's like a game that's like it's like so far gone now I don't know if I know that's the problem yeah I remember I was I was I was super hyped on Transistor uh off of packs and different things then it came out at a bad time and I played it and I left it was one of those games I left like halfway through and then tried to come back and you have to I have to restart it at some point if I really want to do it but Bastion of course out in Vita right now so everybody should be playing the one and only Bastion uh then Vane got announced that looks awesome yeah some crows in a weatherman yeah yeah it's another one of",
      "start": 1512.84
    },
    {
      "text": "of course out in Vita right now so everybody should be playing the one and only Bastion uh then Vane got announced that looks awesome yeah some crows in a weatherman yeah yeah it's another one of those things where who the hell knows what the game actually is but I mean that I love the tone love the the music and the look of all of it so that's one that I'm definitely keeping my eye on a lot of time passage going on there is things were being built in the background and being broken down I game play doesn't have any of that like I hope that it's not like a buildy type thing I don't want a Minecraft **** I that's story elements and **** yeah you just want to see a landscape that's influenced by your actions that sounds good uh next up was Absolver this is a 2017 game it's from Devolver Digital uh Playstation 4 has exclusive content but it's online melee action that's what they're describing Devolver publishing getting publishing I forgot I I didn't see which studio was making it but",
      "start": 1543.32
    },
    {
      "text": "uh Playstation 4 has exclusive content but it's online melee action that's what they're describing Devolver publishing getting publishing I forgot I I didn't see which studio was making it but the the uh uh they're they're putting out more and more um codes which I think is really really cool or uh codes sorry I'm texting some about a code now actually someone you know but uh I already have a code then for you oh you do yeah cool I'm getting another one get one for Tim okay hold on a second but yeah um if I'm thinking about who it is uh yeah okay yeah it it's interesting yeah Devolver though if I think Devolver is one of those if you're not watching the industry close enough you wouldn't understand how many games they're putting out whether it be Nuclear Throne whether it be something else they're doing a lot of great stuff over there a lot of good **** if people say so yeah keep an eye on that then we got a a new trailer for What Remains of Edith Finch uh you know we love those guys",
      "start": 1577.36
    },
    {
      "text": "they're doing a lot of great stuff over there a lot of good **** if people say so yeah keep an eye on that then we got a a new trailer for What Remains of Edith Finch uh you know we love those guys yep Giant SP Giant Sparrow so for people that don't know these are the guys um well so they've been they've been at Sony Santa Monica actually for a pretty long time they um come from the same mold of that game company uh the same idea theyve signed a three- game contract Unfinished Swan and so Unfinished Swan was the first one Finch the second one and they'll have a third one after that they seem to um uh they hired I don't I think they made I think they made um Unfinished Swan without a producer or got a producer very late um which I think kept them off schedule and it seems like they're maybe wildly off schedule again um so I'll be interested to see what it is I'm sure it's going to be fantastic it seems very strange um and that's what they're all about and you guys should really go back",
      "start": 1618.16
    },
    {
      "text": "wildly off schedule again um so I'll be interested to see what it is I'm sure it's going to be fantastic it seems very strange um and that's what they're all about and you guys should really go back and play Unfinished Swan if you haven't it's a very quick experience and one of the great games of that year 2012 also available on Vita so why not jump in there you know what I mean come on now then calling your boys Housemarque next Matterfall Yep this is the Jarvis game this is the Eugene Jarvis game that they teased a long time ago of course Eugene Jarvis is really the guy behind Defender which is one of the great games and and what was interesting about that is one of the great arcade games of the of your uh Resogun is heavily inspired by Defender and so I think that that brought a conversation upon with these two people where uh they made a different game some people are confused thinking that Matterfall was renamed or canceled this is a different game than Matterfall yeah they announced",
      "start": 1657.92
    },
    {
      "text": "upon with these two people where uh they made a different game some people are confused thinking that Matterfall was renamed or canceled this is a different game than Matterfall yeah they announced two things out there yep so uh Matterfall I think is much closer and I'm surprised that we haven't seen it yet and I'm going out to lunch with them tomorrow on with Housemarque and with Eugene so um I'll be able to talk to them more about this game but particularly I want to know about what's going on with Matterfall as well the cool thing about this is that they've similar to Alienation they've seem to invested in storytelling art and like cut scenes that are a little bit more Dynamic than say what we saw in Dead Nation yeah well that's what's interesting over on the Playstation blog if you don't mind Mik our friend popped up and he has a post here about the game right and so he goes blah blah blah talking about it the most explo explosive top down action shooter Housemarque has ever",
      "start": 1693.72
    },
    {
      "text": "you don't mind Mik our friend popped up and he has a post here about the game right and so he goes blah blah blah talking about it the most explo explosive top down action shooter Housemarque has ever created taking hits from both Robotron and Smash TV next Mocka focuses on pure arcade Act action voxal destruction and competition but before delving into that more of that I want to talk about the game setting and it goes in in a world where humans have become more and more addicted to technology machines have evolved from simple helpers to replacements for unwanted jobs conscious entities with their own feelings and he goes on like you're talking about was World building stuff right that isn't foreign to Housemarque but never the big part it's interesting their first step here their first impression is look at our cut scenes look at this let me tell you on the Playstation blog all about this it's a little different I know some people are anxious for them to do something else and they have",
      "start": 1723.92
    },
    {
      "text": "is look at our cut scenes look at this let me tell you on the Playstation blog all about this it's a little different I know some people are anxious for them to do something else and they have done other things they they you know Outland was a was a totally different game which was awesome as well um which I think is going to actually be like Matterfall those free Xbox uh live games with gold right now so you get picked that up yeah oh great um so yeah I will be interested to see how this particular game turns out I'll be interested to see what they say to me on the record tomorrow as well about it um and about Matterfall but my assumption is that this is there's going to be a lot of Alienation in this particular game and I think that there's going to be a lot of Outland in Matterfall so um or something combined with Resogun I still feel like that they're going to be but I know some people are like well you want to see them do something else I'm like no you you don't I mean that's",
      "start": 1760.0
    },
    {
      "text": "so um or something combined with Resogun I still feel like that they're going to be but I know some people are like well you want to see them do something else I'm like no you you don't I mean that's that's the thing is that you really don't want to see them do something else these guys understand gameplay unlike the thing way that no one else get you want to see them do something else but they do something else every time this is what this is always the thing of like oh man another Mario game but every Mario game is different in some way right there are these different buckets the Mario games go into so to see them yeah do an Outland or do a Dead Nation or do uh super Stardust or you know I mean jump around and make some these aren't the exact same similar Concepts but that looked **** awesome does and they're also not afraid of walking away from things too Superstar Ultra wasn't even done by them so uh they they were they they helped and helped produce that but",
      "start": 1792.72
    },
    {
      "text": "that looked **** awesome does and they're also not afraid of walking away from things too. Superstar Ultra wasn't even done by them so uh they they were they they helped and helped produce that but that's not an they don't own these IPs. I I'm curious about this particular one because I have to go back and watch the trailer again. Did did is Sony publishing this one as well? Because originally this was supposed to be a game that was supposed to be on all platforms um or at least that they weren't they were trying to do something outside of the Sony ecosystem. If they're doing another game with Sony it's like just get why not just get in there? I I don't understand. They've only released one game that's not that's not exclusive the PlayStation in the last 10 years so other than they did like Angry Birds ports and stuff like that too but all of their games are PlayStation exclusives except for Outland so something interesting to consider very very indeed but they should just do what they do",
      "start": 1825.0
    },
    {
      "text": "Birds ports and stuff like that too but all of their games are PlayStation exclusives except for Outland so something interesting to consider very very indeed but they should just do what they do best. They they do twin stick shooting better than anyone and that's pure gameplay and they know what the **** they're doing they're so good. Up next was the sizzle of console first titles included Chasm which we love Dan Adelman title we're big fans of it very very cool hope to see Dan tomorrow. Nidhogg on there and then there's a bunch of stuff but again this was bitching about earlier in the show great Sizzle reel some of those games I was like what is it why aren't you telling me what that is exactly? Then uh Grasshopper's Let It Die popped up uh they say it's one of those that's out now for free it was always going to be free to play I remember them they've been trying to get me to take demos forever on this game um skateboarding death or whatever yeah looks goofy I mean it's free jump in",
      "start": 1860.56
    },
    {
      "text": "it was always going to be free to play I remember them they've been trying to get me to take demos forever on this game um skateboarding death or whatever yeah looks goofy I mean it's free jump in there and have whatever. Uh Mother Russia Bleeds is out today as well. Uh then it was what Garou that's not how you say it Garou Mark of the Wolves is what I wrote down but I think that's Garou Mark of the Wolves that's today that's a Vita game as well. Surgeon Simulator VR is out today I that sounds **** awesome. I brought in the VR hoping to try to get a let's play done with it I don't know if we actually get it done in time. Uh Laura Croft Go is out PlayStation 4 Vita uh oh yeah yeah play that **** man yeah know I beat the hell I Jen she's a brand manager on the game I played the hell out of it when it came out on uh the iOS last year and man like I it's one of those games where you want to go back and three star and stuff and just like now it has trophies like **** new levels Give Me a",
      "start": 1897.08
    },
    {
      "text": "when it came out on uh the iOS last year and man like I it's one of those games where you want to go back and three star and stuff and just like now it has trophies like **** new levels Give Me a Reason back in hell yeah I think it's my favorite of the Go Games. Dayex is great and Hitman Go is awesome as well but the this one's really special yeah uh then Windjammers got announced for PlayStation 4 and Vita which honestly I really appreciate don't know **** about that game at **** all but from what I'm reading it sounds like that's a Giant Bomb it is in joke thing there's as soon as it well Gio during the thing made Dave Lang's worst nightmare come true and then everybody broke out this clip that looks ancient of Dave saying that the wind jur would never happen and I don't know what the context is I love it though that's your dreams type **** it's also one of those that I think reinforces what PSX is of like hey insulated community that un only percentage of you will understand",
      "start": 1934.0
    },
    {
      "text": "context is I love it though that's your dreams type **** it's also one of those that I think reinforces what PSX is of like hey insulated community that un only percentage of you will understand a Dave Lang reference on stage but we're going to **** make it that shit's awesome and as soon as the the crash **** started everybody starts tweeting at me like John the thing Co Shinobi was tweeting at me about **** Pat. I got to say like I I feel like I have a pretty good grasp on games and game history like I you at least heard of things if not if you've not played them or whatever and I I I take a lot of pride in that because I I've been playing games for a long time I that was one of those moments I have no idea what the **** this game is like it it so was a a moment of deep humility for me as well. Windjammers also known as flying power dis in Japan is it an SNK game um yeah a fast-paced sports action or Sports arcade game released by Data East on the Neo Geo arcade system in",
      "start": 1978.76
    },
    {
      "text": "for me as well. Windjammers also known as flying power dis in Japan is it an SNK game um yeah a fast-paced sports action or Sports arcade game released by Data East on the Neo Geo arcade system in 1994 and later on the Wii Virtual Console in Japan on June 2nd 2010 yeah yeah okay so yeah I I uh I never it looks like a Neo Geo game it screams like an SNK game so so uh not a surprise also they've had a relationship with SNK going a long time I mean a lot of Metal Slug and all these games have been coming to Vita and PS4 so not a huge surprise that they're going to continue to roll them out I guess yep then PlayStation VR got a little bit a time uh they they LED in the main focus was Star Blood Arena PSR or PSVR Star Blood Arena was the game first per it's it looks like ship combat or whatever you're running around multiplayer there is a single player mode spring 2017 interesting wrinkle there is San Diego is helping to produce that game so I wonder if it's done or has gone through because",
      "start": 2015.28
    },
    {
      "text": "you're running around multiplayer there is a single player mode spring 2017 interesting wrinkle there is San Diego is helping to produce that game so I wonder if it's done or has gone through because they pretty much laid everyone off it's not working on baseball exct so you have to assume that that that ship is has sailed as well for for the people that working on it internally but they're still getting credit for it then they that I I was surprised there wasn't more about PlayStation VR honestly there was that and then it was a VR Sizzle reel Star Trek was in there that was an identifiable game and a few other ones but yeah I don't understand why they did that I I because there was some cool like I don't know like what are the touchstones in which you describe the game or go look for things I'm sure that there'll probably be a post on PlayStation blog or whatever but I thought that was a huge Miss because there was a few things in there I was like it would be nice to have known yeah",
      "start": 2061.84
    },
    {
      "text": "I'm sure that there'll probably be a post on PlayStation blog or whatever but I thought that was a huge Miss because there was a few things in there I was like it would be nice to have known yeah yeah I feel like they they totally didn't do what I thought they would which was like kind of bring back all the experiences they talked about E3 we didn't see Final Fantasy 15 nothing about Star Wars like what it seemed like such a missed opportunity and there was no game that made you go oo yeah there and I I was surprised there was no available now yeah the Star Wars you know or demo or whatever is up and you can go play it right now kind of thing like did I miss some release date or something about the X1 I saw Ryan Mcaffrey tweeting about it I think it's coming up soon is DLC okay they reached out to me and told me to come play it so I I I I so it's on the floor and then I think yeah probably somewhat imminent you have to assume I don't think they're going to hold it for like Battlefront",
      "start": 2092.72
    },
    {
      "text": "out to me and told me to come play it so I I I I so it's on the floor and then I think yeah probably somewhat imminent you have to assume I don't think they're going to hold it for like Battlefront 2 or anything like oh no no no yeah I think it's just DLC but I'm not sure what the date is on it chat might let us know if they know as this slowly catches up to them yeah I'm definitely where are they going to talk about wave two of PSVR yeah like I don't I don't they're not they can't wait until E3 that's way too far I think that they're probably um altering the they're going about things as we talked about uh it was info scouter one of these Big Marketing firms had released as we talked about I think on Colin and Gregor somewhere uh they cut their PSVR forecast by 3/4s for the year it's a massive calaminus collapse of that particular Market if people aren't interested in I think they were predicting something like 0.8 million or something and then had forecast it down to 750000",
      "start": 2128.36
    },
    {
      "text": "a massive calaminus collapse of that particular Market if people aren't interested in I think they were predicting something like 0.8 million or something and then had forecast it down to 750000 December 6 Tuesday is Star Wars the VR experience out and a lot of people are calling out I think they're missing the point I was making there uh they're like well Surgeon Simulator VR is out today they LED they talked about Resident Evil in the front R yeah and it's like I understand all that but I'm saying that there wasn't a VR announcement saying hey going forward hey get it hyped for 2017 because of this that's all I'm saying I think what we're realizing with them is that they're kind of caught between a rock and a hard place with too much Hardware to talk about they talked a little bit about Pro which is nice I was surprised they didn't talk about numbers so they must have not reached that eclipse or don't want to talk about it yet maybe they'll save it for January or for another time",
      "start": 2169.2
    },
    {
      "text": "Pro which is nice I was surprised they didn't talk about numbers so they must have not reached that eclipse or don't want to talk about it yet maybe they'll save it for January or for another time uh but between Vita which I think that they're not too concerned talking about with anymore but then Pro and the PS4 slim the standard PS4 and then PSVR I think that they just have too many balls in here especially because the the the thing only lasted like a little over 70 minutes so I was a little surprised too but I I think PSVR is doing softer numbers than I thought and I I don't know if they really wanted to the they're here they don't need to talk to these people that kind of stuff I think is for E3 but I think this is the particular quandry that they're in right now these people have PSVR you know sure but I mean but I wanted to them I want to justify the purchase I want to show them I'm supporting it I want to show that you are still going to get Triple A huge experiences big",
      "start": 2205.12
    },
    {
      "text": "PSVR you know sure but I mean but I wanted to them I want to justify the purchase I want to show them I'm supporting it I want to show that you are still going to get Triple A huge experiences big licenses here and that's what I'm saying where it could have just been like I mean look at us we we didn't even we're not even paying attention that the Battlefront thing you know first person things out Tuesday that could have easily been a real quick thing just we're going to show you two seconds of it and remind you that it's out to they pick it up I mean and that's the thing is like they did it with Last Guardian and they show trailers to remind you and they should have reminded us about that yeah yeah uh after the VR Sizzle re it was Neo the team ninja game out February 9th looks great yeah you excit for that one yeah I'm super stoked about it as Tim and I were saying I think it's about as close to anim Musha as we're going to get in terms of style um and I mean mean that by aesthetic",
      "start": 2237.72
    },
    {
      "text": "you excit for that one yeah I'm super stoked about it as Tim and I were saying I think it's about as close to anim Musha as we're going to get in terms of style um and I mean mean that by aesthetic style because the gameplay is not anything like anim Musha but uh it's supposed to be like Dark Souls meets anim Musha um so there's uh there should be a a nice level of um difficulty there that's actually absent in the anim Mushi games theim Mushi games weren't hard at all so I I like the idea of this and also this game similar to Final Fantasy 15 similar to the last Guardians actually been was actually announced a really long time ago and been reworked a lot of times so we'll see if it can live up to a much smaller level of hype than those other two games had but but this is a game that was announced I think when I was in college the demo out a couple months ago and it had some issues but the people that played it seem to love it it's definitely like one of those Darlings yeah uh to Techo",
      "start": 2268.92
    },
    {
      "text": "I think when I was in college the demo out a couple months ago and it had some issues but the people that played it seem to love it it's definitely like one of those Darlings yeah uh to Techo CO's or Co Techo I guess now their credit to their credit uh they did release those Demos in a somewhat broken or somewhat un unfinish State intentionally in order to Garner feedback in which they then released another demo with things that were fixed in it which I think is really cool as opposed to hyping people up two weeks before they released a demo they're actually soliciting feedback and I think it's actually a smart marketing move on their on their behalf as well to get this game out this very a level game that's not going to get commercials on TV or sell millions of copies so okay uh then they did a whole MLB the Show section Ken Griffey's there old school Ken Griffey home run challenge stuff at the end that was cool y yeah man uh then Horizon got a longer trailer more stuff Colin you're",
      "start": 2304.36
    },
    {
      "text": "did a whole MLB the Show section Ken Griffey's there old school Ken Griffey home run challenge stuff at the end that was cool y yeah man uh then Horizon got a longer trailer more stuff Colin you're you're starting to freak out you've seen too much yeah at the very end I really think they're starting to spoil things now and we're sold on it is going to be PlayStation's xran big franchise I think that's obvious and so we're going to get one of these every two two and a half years I think for a little while and and there's lore and deore building here you know as we've said before many times the guy that wrote New Vegas wrote this game he's going to be sticking around it looks like a gorilla he's actually giving a panel or giving having a signing of some sort I think at PSX I think it's a signing so they're they're keeping him around and they're going to uh continue to build this world and so I don't think that there's any I F I got very big spoiler vibes from the very end of that",
      "start": 2342.56
    },
    {
      "text": "a signing so they're they're keeping him around and they're going to uh continue to build this world and so I don't think that there's any I F I got very big spoiler vibes from the very end of that trailer I I didn't like what I saw there with the metal door opening seen them before showed us that yeah I don't but I don't I've avoided most of the things and I think that they have to avoid um really uh cuz I I try to stay with away from anything about this game when I have to watch it I have to see it I just don't know what they benefit from from teasing uh that I think that they should bury the lead there a little bit with the game just from a thematic standpoint but it looks awesome it's going to be great we play I mean I played it extensively it is great so um from what I played so very close and again it's not delayed I know people think this game is going to get delayed they're not delay they're not delaying this game and then finally of course we end with The Last of Us Part Two",
      "start": 2375.08
    },
    {
      "text": "close and again it's not delayed I know people think this game is going to get delayed they're not delay they're not delaying this game and then finally of course we end with The Last of Us Part Two now we'll talk about it while we've been going Neil Druckmann posted over on the Playstation blog I'm going to read you the section okay I can't tell you how satisfying it is to finally be able to say that Ellie and Joel are back for another intense harrowing and emotional Adventure like many of you we have a deep love for the world of The Last of Us and its characters and while a sequel may have seemed like a foregone conclusion that wasn't the case we knew that it needed to be a story wortht telling and perhaps more importantly a story worthy of Joel and Ellie after spending years on different ideas parentheses and almost giving up we finally uncovered a story that felt special a story that evolved into an Epic Journey it's still early days for the project the game's release is a ways off but",
      "start": 2413.24
    },
    {
      "text": "parentheses and almost giving up we finally uncovered a story that felt special a story that evolved into an Epic Journey it's still early days for the project the game's release is a ways off but we couldn't wait any longer to give you a glimpse of what's to come we're going to let the trailer coming soon to this post speak for itself but expect more information on the Last of Us Part Two in the coming months then he of course says that they have a panel tomorrow no today at 1 pm uh if you're watching this live there'll be a panel there but keep telling yourself it's com out in 2018 that's what makes that's what makes you happy Ashley and Troy will be there of course Troy and the GameOverGreggy show next week Shameless plug uh great trailer yeah the trailer was awesome who do you think she's to kill I assume the fireflies that are that are going to be very mad about what happened at the end of the last game so um and I think that we can spoil it pretty easily I mean you you had your",
      "start": 2449.28
    },
    {
      "text": "to kill I assume the fireflies that are that are going to be very mad about what happened at the end of the last game so um and I think that we can spoil it pretty easily I mean you you had your chance at this point yeah uh but you know the dynamic between Joel and Ellie in the last hour of the game considering what they were doing I think in Salt Lake or whatever the **** they were uh makes it they killed a lot of people a lot of important people and a lot of knowledgeable people which is going to be something that becomes more and more scarce in this dystopian world where they're not there aren't doctors going around they're on people with this like systemic knowledge and and um they're not going to be too happy with them and I assume um the scene we saw there was maybe an ambush or something like that that you know um will play out in the middle of the game somewhere but clearly it's the fireflies I mean yeah it looks like it yeah but it's just interesting that she would go on",
      "start": 2485.88
    },
    {
      "text": "something like that that you know um will play out in the middle of the game somewhere but clearly it's the fireflies I mean yeah it looks like it yeah but it's just interesting that she would go on the offensive like that I wonder if Joel lied to her if Joel said something else you know what I mean and that's now embedded in her head and that's where he's like you really want to go through with this in terms of like he had to tell her a lie when he whisked her away right that it wasn't going to work they were going to kill you they were bad people and now she thinks they're bad people and now she wants to go out this and every time they they come for Retribution or to we really need your help she has it in her head that you can't be trusted you need to die so when we play the game in you know I assume 2019 we'll have um a nice uh maybe a little later than that but I would say no sooner than 2019 I think what we'll have is a nice little you know a reason to go back and play the",
      "start": 2524.4
    },
    {
      "text": "in you know I assume 2019 we'll have um a nice uh maybe a little later than that but I would say no sooner than 2019 I think what we'll have is a nice little you know a reason to go back and play the original one again sure and uh see how they connect um and what I would really love is if there was some sort of again like like these games being so intimate this being part two what's exciting about this is the idea that they could patch The Last of Us on PS4 or even make it available for free on Playstation Plus say in the spring of 2019 or whatever with some heavy patches that let you um like that somehow Garner the way you play or some some things that happen in the game that will affect the last of us two in not systemic Mass Effect ways obviously but in ways where it's like well this is pretty cool like certain things or certain you know she has a certain line here because of some the way she I think that would be pretty neat and it gives them then they have a lot of time to figure",
      "start": 2555.24
    },
    {
      "text": "pretty cool like certain things or certain you know she has a certain line here because of some the way she I think that would be pretty neat and it gives them then they have a lot of time to figure that out I doubt that's going to Happ that's not going to happen but yeah but it would be it would be a pretty neat thing more along the style of what we really wanted with um Infamous yeah that **** looks **** good I the thing with Last of Us and we've talked about it so many times but like it doesn't need a sequel and like the first one was so good that it could have just been there and been done with it and the fact that we're getting one with drol and Elli I it's surprising to me because this shows and like he said in the blog post that they do believe in this and they do believe that there is something worth telling because they wouldn't do it otherwise and cuz it's going to face a lot of scrutiny and them going forward with it it's very exciting because that shows that this game",
      "start": 2599.6
    },
    {
      "text": "there is something worth telling because they wouldn't do it otherwise and cuz it's going to face a lot of scrutiny and them going forward with it it's very exciting because that shows that this game they believe could be better than the first one so that's awesome yeah yeah I think you know I sat with Neil we' sat with him many times when I was doing the history of Na dog and then I went back down there with follow-ups I asked him about a sequel and and it's exactly what he said and it's exactly what I related to people a long time ago which is like we we don't have a story to tell and we we we need to figure that out first and that's what he reiterates in the blog post that I had just read that you read as well that I had just read before right we on when the show started which is that I like that they are not forcing it I do think the last of us could use a sequel I think it could stand alone too but I think it was clearly wasn't going to and the financial imperative is certainly",
      "start": 2635.48
    },
    {
      "text": "I like that they are not forcing it I do think the last of us could use a sequel I think it could stand alone too but I think it was clearly wasn't going to and the financial imperative is certainly there for them to do it as well and I think that there's more stories to tell I wouldn't be surprised if this wasn't the last one either but I do think again similar to the way we talk about Uncharted could Uncharted continue without Drake I think it actually could I just think you have to give it a lot of space and time and I think the way the game ends indicates that it's going to continue in a different way in the future and I think you can do the same with the last was two give us one more with Joel and Elli and then let it breathe a little bit and then maybe we'll get you know you know by the time this game comes out 2019 2020 whatever we're going to be you know more anxious for it than maybe it seems right now so I think even people that are skeptical about it will come around you",
      "start": 2674.36
    },
    {
      "text": "by the time this game comes out 2019 2020 whatever we're going to be you know more anxious for it than maybe it seems right now so I think even people that are skeptical about it will come around you know and in the meantime that's what's so exciting that's why you just know that this game is so far away not only because they're saying it but also because there's so many unannounced uh or things that Studios that you know like Sucker Punch I don't know what I was going to say do you think Sucker Punch goes before last I was two uh yeah I think I think whenever Sucker Punch is working I will definitely be Happ before the last of us two they're probably just not ready or anxious or wanting to show anything yet I think that's an E3 given exactly um but I also think that we have a stack of games piling up now of tripa exclusives that we've been waiting for that fill out a good two years on the calendar between 2017 God Detroit there's no Horizon obviously Spider-Man why so even if so even",
      "start": 2708.96
    },
    {
      "text": "piling up now of triple-A exclusives that we've been waiting for that fill out a good two years on the calendar between 2017, God, Detroit, there's no Horizon obviously, Spider-Man. Why so even if so even if The Last of Us 2 was ready in 2018, there's no way it's going to be but even if it was going to happen there's no way for them no reason for them to actually push it there. Yeah let them take their time and they're going to do that as everyone on the team lurches back uh after the Uncharted DLC comes out. Now Colin we have a lot of questions sure piling up on Twitter piling up in Twitch but this is an official numbered episode yes of PS I Love You XOXO so if I wanted to know what was coming to the digital mom and pop and retail shops where would I go it's not it's not up yet the they put it up they put it up yeah they put it up you want me to really read this yeah why not give him a real show all right you go to the official list of upcoming PlayStation 4 PlayStation 3",
      "start": 2741.48
    },
    {
      "text": "the they put it up they put it up yeah they put it up you want me to really read this yeah why not give him a real show all right you go to the official list of upcoming PlayStation 4 PlayStation 3 PlayStation Vita PlayStation VR sometimes PSP they never do this on a where is it I can email you if you want or I can do it find it no it's okay I find it I think they put it out so it wouldn't get buried into on or it would you know it wouldn't get buried on Sunday by all the PSN uh hash kill all zombies comes to Vita digital # kill all zombies is thrusting civilians into a fight of survival against the Unleashed population of ravenous zombies and you're the only one who's destined who only one who destined to repulse them that's what it says who destined to repulse them 33 freestyle uh comes to PS4 digital welcome to the one of the most vibrant diverse exciting and competitive sports in the world street basketball pick your player from a pool of custom designed one-of aind characters",
      "start": 2781.36
    },
    {
      "text": "to PS4 digital welcome to the one of the most vibrant diverse exciting and competitive sports in the world street basketball pick your player from a pool of custom designed one-of aind characters based on real life street basketball players team up with your friends online or in person and hit the court to play authentic fast-paced gameplay arcade archives Neo Geo Samurai Showdown comes out to PS for digital it's an a Thursday release Samurai Showdown is a fighting game that was originally released by SNK in 1993 the game features 11 sword Masters each of their with their own unique personality they will battle am among each other before taking on Shiro tokas tokisada I'm sorry um Amakusa Shiro tokisada Amakusa in the game's climax okay gotcha Arc survival evolved finally comes to PlayStation 4 digital finally yeah it's been forever stranded on the shores of a mysterious island you must learn to survive use your cunning to kill or tame the primeval creatures roaming the land and",
      "start": 2822.12
    },
    {
      "text": "4 digital finally yeah it's been forever stranded on the shores of a mysterious island you must learn to survive use your cunning to kill or tame the primeval creatures roaming the land and encounter other players who survive Dominate and Escape Demetrios the big cynical Adventures comes to Vita digital Demetrios is a quirky Adventure game packed with tons of humor bejor thin a slob of an antique dealer living in Paris is robbed on night after coming home drunk forced to conduct his own investigation with the help of his neighbor s Sandra he ends up involved in a murky mysterious Affair will these unlikely Heroes be able to rise up and discover ancient Secrets betting on it you think they're going to get this one too I think they got it they got these secrets okay flying bunny comes to PlayStation 4 digital it's on on Thursday gravity bound shooter shooting Runner cute anime characters with cool abilities over 5 bosses with powerful attacks never ending stages all right I'm YouTubing",
      "start": 2868.56
    },
    {
      "text": "4 digital it's on on Thursday gravity bound shooter shooting Runner cute anime characters with cool abilities over 5 bosses with powerful attacks never ending stages all right I'm YouTubing this what it's just those just bullet points put into a paragraph The Last Guardian comes to PlayStation 4 digital and Retail in a strange and mystical land a young boy discovers a mysterious creature with which he forms a deep unbreakable Bond the unlikely pair must rely on each other to escape towering treacherous ruins filled with unknown dangers experience the Journey of a lifetime it's finally here last Guardians here nubla or Nua comes to PS4 at digital discover the wonderful world of nubla full of puzzles and forgotten places who has not dreamed of plunging into one of the paintings hanging on the wall of a museum and venturing into an unknown World Kevin you've been doing that you've been dreaming about jumping into paintings he's nodding yes Red Faction comes to PlayStation 4 digital",
      "start": 2906.2
    },
    {
      "text": "on the wall of a museum and venturing into an unknown World Kevin you've been doing that you've been dreaming about jumping into paintings he's nodding yes Red Faction comes to PlayStation 4 digital lured to Mars by the alter corporation's promise of a better life thousands have come to seek their fortune and work for the massive mining company but all is not as it seems a deadly plague is sweeping through the barracks and miners suffer daily abuse at the hands of the alter guards is a revolution on the I I've bought many many hundreds of games in my life and I remember specifically buying red f I remember actually going and buying it I so excited about it I was uh punch holes in the goddamn wall are you kidding me I was a senior in high school I think yeah it was my freshman year of college that checks out space overlords comes to PlayStation 4 and Vita Digital four brothers known as the overlords have been incarcerated by the evil cadan for many years while he was slowly destroyed",
      "start": 2943.68
    },
    {
      "text": "that checks out space overlords comes to PlayStation 4 and Vita Digital four brothers known as the overlords have been incarcerated by the evil cadan for many years while he was slowly destroyed the cosmos you and your brothers must rise up and Purge the evil contaminating the planets you have nurtured over the centuries werewolves within a little less evil comes to PlayStation VR digital oh my God and Retail after several attacks on Town folks the medieval village of Gallow has had enough with a special guide book in hand players congregate to vote and eliminate any and all possible werewolves hiding disguised in the village werewolves within is a fast-paced game of hidden roles and social deduction for five to eight players whoa it's very interesting Tim you want to be a werewolf with me sure and that is all for the games excellent Colin thank you so much let's jump into reader mail mail call Ma Ma on Twitter says uh predicted crash remaster release date would like to know what Tim",
      "start": 2978.32
    },
    {
      "text": "sure and that is all for the games excellent Colin thank you so much let's jump into reader mail mail call Ma Ma on Twitter says uh predicted Crash remaster release date would like to know what Tim Gettys thinks I'm a little concerned they didn't say spring 2017 or March 2017 it feels like a March game to me um this strikes me as this could do good in the summer it's too late too late for what me oh okay you can't wait that long yeah I don't know this sound I want this earlier than later like let's let's get things but I mean like you figure you don't want I mean the spring this year is **** packed right now there's so many good games yeah but I mean these are they're remastered platformer games like they're not long to play sure this is a that's like a but you want them to shine you want people to get excited and have money for I know but like think about it this way I'm thinking I want it to come out before the switch comes out oh no **** away yeah no that",
      "start": 3021.64
    },
    {
      "text": "them to shine you want people to get excited and have money for I know but like think about it this way I'm thinking I want it to come out before the switch comes out oh no **** away yeah no that was never going to happen why it could have no before March no well early March like the week before the switch you're SC I'd have been down no no no not going to happen you'll forever you'll still be playing that Horizon you'll be all up in that it's true yeah yeah you're going to be okay don't worry I I don't know man I don't know if I'm going to be okay I think you can make if this **** comes out the week of E3 I'm going to be pissed why that's what Happ Last of Us it was fine everybody was fine no yep it did I remember that it was so weird yeah I was so happy that we got you know we got it early so I was happy to get out of the way I would have been so angry that's what I'm saying if youash early I hope they'll let you play Crash early don't worry I'm playing Crash tomorrow and also",
      "start": 3072.08
    },
    {
      "text": "it early so I was happy to get out of the way I would have been so angry that's what I'm saying if youash early I hope they'll let you play Crash early don't worry I'm playing Crash tomorrow and also no one can SPO it for you you can play too if you're a PSX yeah people were telling me in the chat that Jeff Ke's periscoping it right now he's over there playing his demo right now oh really yeah um over on Twitter slth FMA says in what ways do you think this PSX conference rivaled Sony's E3 conference from this year I think they're apples in oranges to an extent yeah this the reason I I tweeted about it last night PSX is my favorite show and it's my favorite conference and the reason is they're speaking directly to us and you and every nerdy PlayStation fan who loves Kinda Funny content and so they have Gio out there holding aita talking about it making jokes talking about uh **** Dave Lang is awesome while the E3 Sony conference is this year especially trailer trailer trailer",
      "start": 3107.68
    },
    {
      "text": "and so they have Gio out there holding aita talking about it making jokes talking about uh **** Dave Lang is awesome while the E3 Sony conference is this year especially trailer trailer trailer trailer hype hype hype hype here's all these amazing AAA things you're getting knocked on your ass that you didn't expect to get mhm that's what I I I love that but I love this too cuz this this the PSX conference for better worse always feels like a conference we produced yeah it feels like we'd be like oh yeah come show your your video game yeah come do this dumb thing yeah it's it's interesting I feel like it's a nice answer to their E3 conference where it's just like all right cool they they did this and then this is kind of the thing of like seeing the feedback of what other people are saying to like kind of counteract it but the problem is you can't please everybody always so with this there's people are going to complain about certain things that they'll be nd3 hopefully if they",
      "start": 3145.64
    },
    {
      "text": "saying to like kind of counteract it but the problem is you can't please everybody always so with this there's people are going to complain about certain things that they'll be nd3 hopefully if they keep with this trend because at any moment they can **** it up and go back to how things used to be sure so I don't think they will yeah I think you know so the cool thing about it is I agree with you Greg there are apples and oranges I think they're different kinds of show and what I think what's important here to to Garner especially with The Last of Us 2 is I'm not a huge fan of showing games so far away we're talking about a game that's three years away right maybe possibly I mean probably even more so I feel like let's just say it's three years away right it comes out fall 2019 or maybe two and a half years spring 2019 what's important now is to just show and then and then kind of retreat and make the game and only come back when you have something to Show game CU I I again I was",
      "start": 3184.24
    },
    {
      "text": "two and a half years spring 2019 what's important now is to just show and then and then kind of retreat and make the game and only come back when you have something to Show game CU I I again I was so happy to not see Kojima at the on the stage I was so happy not see Death Stranding shown in a different way it's like just this isn't good this doesn't work out it almost never works out the way you wanted to uh when this kind of thing happens and so that's my one big takeaway is like yeah show us a little something but sprinkle it in there um in a very anti Bethesda kind of move but then go away and I think that's exactly what's going to happen I don't think you'll see The Last of Us 2 even at E3 so I think that the the show was a great success I was happy with lot of the games that were shown and I think that between E3 and between this I think all bases are covered and now we have a lot of really game you know both first and second party exclusives to be excited about as well as",
      "start": 3225.16
    },
    {
      "text": "shown and I think that between E3 and between this I think all bases are covered and now we have a lot of really game you know both first and second party exclusives to be excited about as well as some third party stuff obviously that we're excited about all kind of culminating over the next 18 months to 24 months and and so I think that that's really really super exciting plus games like Death Stranding um and Uncharted or The Last of Us 2 rather that are clearly very very far away and just dangle those a little bit but be smart enough to dangle them responsibly well I mean that's dang responsibly dangle your Dingle is responsibly but that's what you're talking about right is that it was very clear that okay cool we have so much **** going on that yeah there's no reason for Spider-Man here there's no reason for God of War here there's no reason for Detroit here we don't have to do that you you have the most up-to-date information and looks at those games they'll come along when",
      "start": 3265.88
    },
    {
      "text": "here there's no reason for God of War here there's no reason for Detroit here we don't have to do that you you have the most up-to-date information and looks at those games they'll come along when they need to come along mhm what do you take about Duckman saying that we'll get more information in the coming months I think that's something I think that's probably whatever you know what I mean that that's like exactly I mean that's just such what a whatever statement cuz you 12 months from now is still the coming months there's still something to be said and I mean it'll there's going to be I'm sure information in te's and this that the other and you know like on Twitter I'm sure they'll be now that they're we know it's happening I'm sure you'll see Ashley and Troy putting up images from the map area you know what I mean when they're out there doing their stuff and I don't think that's yeah I think based on the based on the fluctuations at Naughty Dog in terms of what happened",
      "start": 3301.64
    },
    {
      "text": "from the map area you know what I mean when they're out there doing their stuff and I don't think that's yeah I think based on the based on the fluctuations at Naughty Dog in terms of what happened between Drake's Fortune and creating project big obviously and to Uncharted 2 they were able to do that as one team very quickly and so there's reason to take heart in a quick turnaround but the really truly quick and astonishing turnarounds happen when they split into two and then had Uncharted 3 in The Last of Us went in two years and now that they've combined back into one and had such problems with Uncharted Four although a lot of that happened on the production side with Amy leaving and all that kind of stuff my my theory is that they're just going to take all the time they need and I bet you that internally they probably don't even have a Target that it's just we're going to make the game we're going to be very deliberate about making the game they're going to take their time it's",
      "start": 3338.12
    },
    {
      "text": "you that internally they probably don't even have a Target that it's just we're going to make the game we're going to be very deliberate about making the game they're going to take their time it's probably going be there'll probably be a date announced then delayed and um I think what's most important to them and I think Sony knows this I think Naughty Dog Neil and Bruce clearly know this and I think also uh all the all the people in in that ecosystem and in that orbit know that they're just going to release it when it's ready M and uh it's uh so exciting to think that we're going to get something you know go back into that world again I'm so **** excited The Last of Us is so immaculate it's so good and it's for as good as Uncharted is The Last of Us is better than any of those games and so I'm super super excited for for Neil and Bruce to get back in there so excited I want to give a shout out to peanut 04 3 in the chat when I mentioned that key was periscoping Crash Bandicoot he says",
      "start": 3369.8
    },
    {
      "text": "I'm super super excited for for Neil and Bruce to get back in there so excited I want to give a shout out to peanut 04 3 in the chat when I mentioned that key was periscoping Crash Bandicoot he says I'm surprised ke's not in Japan killing Konami employees God damn that one got me good job peut um everybody wants to talk about The Last of Us uh part two so Chris Moore says uh there is talk that Joel could be dead and Ellie is imagining him there would you accept that twist yes it's a really interesting take and I totally would accept that because it that was my my thing of like I'm looking at the hands while the guitar is going I'm trying to see if if if she has breasts well I'm trying to figure out is This Ellie is This Ellie and when they pull back and it is Ellie and she's been aged up I was like okay and then when Joel walked in granted it's basically a silhouette he's in the doorway I he didn't look grayer he didn't look older and again first glance I'm watching off a TV 5et away",
      "start": 3404.48
    },
    {
      "text": "I was like okay and then when Joel walked in granted it's basically a silhouette he's in the doorway I he didn't look grayer he didn't look older and again first glance I'm watching off a TV 5et away from me that I'm immediately turning those wheels too that would be **** awesome I think if it was he that would make sense that would make sense finally I don't think it makes sense for her to say I'm going to go kill everyone I'm going to go kill all of them that did this to the fireflies who are hunting them that doesn't make sense to me if the fireflies killed Joel and now she's out on her own and she are you and he's in her head are you really going to do this and she goes yeah I'm going to got and get every one of them that makes perfect sense for the setup of that game it's it's possible I think I think we're getting and that's lame lame I don't like that that's so generic we'll see I I trust him I TR but if you start the game think of it this way like you said the cut scene",
      "start": 3446.2
    },
    {
      "text": "possible I think I think we're getting and that's lame lame I don't like that that's so generic we'll see I I trust him I TR but if you start the game think of it this way like you said the cut scene could be halfway through the game if you start the game with Joel everything's fine you've been living on the farm for whatever 3 years hooray we're at the **** Hydro Dame then fireflies get there and they're like **** you guys killed all of our you know our Brain Trust here and they there's they start a war or whatever like Negan in the S Negan in the hilltop or whatever and then the war happens Joel gets killed right and then she's on the run she finds this house she kills all these guys and she sits there and start playing the guitar from the song Joel totter or whatever and then in her in her head he walks in she has this conversation that is the yeah I'm going to go do this and I'm not saying that from there on out he's like it's not like Joker in Batman Arkham Knight",
      "start": 3485.8
    },
    {
      "text": "then in her in her head he walks in she has this conversation that is the yeah I'm going to go do this and I'm not saying that from there on out he's like it's not like Joker in Batman Arkham Knight it's like literally that's it I'm going to kill every one of these **** she gets up and walks out and he's never seen if we get a moment I'm okay with that but if it's just like it's like Joel and La just freaking kind of no no I don't want the whole and I don't want it to be like usual suspects at the end it turns out he was never there obw canob **** yeah no no the thing is that that's that's entirely possible and maybe even likely depending on your interpretation of that I'll have to watch it again yeah but we're the fan the you can't start fan theories already like yeah you can we used to write articles about all this **** that early I know but but it was it was it was in said it's like it's fun I don't know I I I I just I I want I just they teased in and let's like see what that",
      "start": 3525.72
    },
    {
      "text": "to write articles about all this **** that early I know but but it was it was it was in said it's like it's fun I don't know I I I I just I I want I just they teased in and let's like see what that more they have to say I'm sure they'll answer these questions and spinning our wheels for a lot of a lot of nothing although I think that like it's easier to do this than it is with like Death Stranding when you it's it's like a **** assd trip G Del Toro is stealing invisible babies everyone understands that one just fine that one makes perfect sense too when you think about it uh PX says while we've been doing this they put up a Persona 5 story trailer from PSX I'm good just **** put out Persona I don't need to see anymore you know what I mean come on now um yeah everybody's just chatting now all the and all the comments are about Last of Us we've covered that for a while here so I guess you want to do some final thoughts on PSX it was great I thought that was a great conference it",
      "start": 3560.4
    },
    {
      "text": "now all the and all the comments are about Last of Us we've covered that for a while here so I guess you want to do some final thoughts on PSX it was great I thought that was a great conference it was a very very awesome conference I think it was a um a great pallet cleanser um for some other you know more subpar conferences or things that we that didn't go quite as planned I think Sony has been doing a really nice job I think uh things are getting much more competitive between Sony and Microsoft the last year or so and so I think Sony needs to and Sony has is in really no danger of losing this generation but the next year to 18 months is going to be very interesting for them as Scorpio rolls out and as Sony or as Microsoft starts getting some of these big games out that that that have been um incubating on their side and so I think Sony coming out with a preemptive strong foot forward for 2017 2018 2019 I think makes a lot of sense I think they have to continue to manage very smartly",
      "start": 3601.8
    },
    {
      "text": "um incubating on their side and so I think Sony coming out with a preemptive strong foot forward for 2017 2018 2019 I think makes a lot of sense I think they have to continue to manage very smartly and very wisely this portfolio that's growing exponentially as people have pointed out many times they keep adding games to the first party roster Without Really releasing anything so now you have like this this this this uh Welling of water behind a a cracking Dam that's about to break out I think with Horizon and then you're going to have Gran Turismo and and so on and so forth God a war days gone um you know the Last Guardian obviously coming out soon Gravity Rush two people are excited about that so I think that uh this was a really really great conference small uh audience comparably compared to the huge Arena that they would play to typically at E3 uh much more um uh targeted message catered to that particular audience to the me and you and all us of the worlds that have our vas and have",
      "start": 3640.8
    },
    {
      "text": "to the huge Arena that they would play to typically at E3 uh much more um uh targeted message catered to that particular audience to the me and you and all us of the worlds that have our VR units and so I think that they should be applauded for doing a very nice job showing a lot of restraint no need you know one of the interesting things that we haven't really talked about that I think that I think is a good good kind of buttress to this or an end note is no days gone we didn't know we knew God of War wasn't going to be there um yeah we talked about this you were looking at some stuff spider no Spider-Man no Detroit no days gone I mean they have so much now that they don't need to do that really pleased about that and I think that that's really smart because now they have this like sorting hat that you can just kind of grab a few things out of every show moving forward and I think you can also start to see a dynamic sort of release schedule kind of um taking",
      "start": 3680.08
    },
    {
      "text": "they have this like sorting hat that you can just kind of grab a few things out of every show moving forward and I think you can also start to see a dynamic sort of release schedule kind of um taking shape based on the way that they're talking or not talking about specific games and so I really do think that uh Horizon and Grand Turismo obviously early to mid 2017 games but I think you're going to get one of those games dropped at the end of 2018. My theory is that it's going to be uh Detroit um or Days Gone and then in 2019 or 2018 you start moving into God of War and you start moving in whatever the other game wasn't that was there hopefully something unannounced maybe Sucker Punch's game in there, Spider-Man, then in 2019 you get The Last of Us uh Two, you get some other things, Death Stranding. I think you see things starting to turn a little bit and and this is when it needs to happen because PlayStation I don't want to say struggling I think that's hyperbolic but it's not quite so",
      "start": 3720.12
    },
    {
      "text": "I think you see things starting to turn a little bit and and this is when it needs to happen because PlayStation I don't want to say struggling I think that's hyperbolic but it's not quite so clear that they are just killing everyone now and so this happened at a very opportunity time and I think that they should be applauded for that it was a great conference yeah it's a metaphor Ellie is a metaphor for PlayStation they're going to kill them all oh okay I serious fantastic conference oh my God I love this man I love this era that we're in that that people get it people **** get it it reminds me a lot of what we've seen with uh things like the Transformers cartoons the Ninja Turtle cartoons where people grew up with them so now the new ones coming out are fantastic because they're being made by people that **** love those franchises that mean something and I think that press conferences and stuff are getting to that point where these are people that grew up reading EGM people that",
      "start": 3759.72
    },
    {
      "text": "made by people that **** love those franchises that mean something and I think that press conferences and stuff are getting to that point where these are people that grew up reading EGM people that grew up watching these press conferences on IGN or wherever they did and they're now um designing them and making a run of show and producing them in a way that is well paced and is giving the people what they want while also being realistic and creating a nice kind of uh forecast of a schedule that people are going to be really excited about and it's like it's telling you why you are a PlayStation fan why you should be a PlayStation fan and why you're going to keep being being a PlayStation fan yeah fantastic and thank God Shui was there no Batman though no Batman any way not here and not at the Game Awards yeah but the Batman Damien Wayne rumor thing that's been going around I I think that was just timed with this I don't think it was timed with they're going to announce at one of these",
      "start": 3798.6
    },
    {
      "text": "the Game Awards yeah but the Batman Damien Wayne rumor thing that's been going around I I think that was just timed with this I don't think it was timed with they're going to announce at one of these shows as much as it just kind of happened and got caught up in the same thing I mean from everything I'm reading that not happening is as shocking as if Marv Capcom 4 wasn't there wow okay CU some of these things were just so intrinsically tied where like at neither of these things there was anything for Batman shocking and don't forget Patapon ladies and gentlemen if I can just ask you one favor just buy this Patapon re-release when it comes out I don't even care if you don't play it just do it so they keep making Patapons and Crash and Crash buy Crash Two for Tim I'll get on that train right now uh that's reader mail and it was brought to you ladies and Gentlemen by Blue Apron if you didn't know I've used Blue Apron I like Blue Apron they send food to your door that you get to cook and you get to",
      "start": 3841.0
    },
    {
      "text": "reader mail and it was brought to you ladies and Gentlemen by Blue Apron if you didn't know I've used Blue Apron I like Blue Apron they send food to your door that you get to cook and you get to look like a badass cuz you know what Tim cooking's fun I like cooking yeah I know you do you have great Instagram posts about it very jealous instagram.com gameovergregy uh Blue Apron is the number one fresh ingredient and recipe delivery service in the country it's very simple they send you prepackaged goodies along with a nice little checklist of what you need to do you tear them open you make them you do all stuff you put it in the pot you put it in the pan then you bring it out and you put it on the plate and people go holy **** this guy can cook and you're like yeah I can don't tell them it's Blue Apron though cuz Blue Apron makes it so simple to do it's it's a lot of fun it's super simple to do the food's good it's healthy they made buffalo chicken sandwiches once for me I was a big",
      "start": 3881.52
    },
    {
      "text": "it's Blue Apron though cuz Blue Apron makes it so simple to do it's it's a lot of fun it's super simple to do the food's good it's healthy they made buffalo chicken sandwiches once for me I was a big big fan they've also made the burgers the cheddar burgers with the pretzel buns oh yeah they they taught me how to make uh french fries with the potato cut them into the wedges do all the stuff I still use that they teach you things they do so ladies and gentlemen you should try Blue Apron and use our code it's very simple check out this week's menu and get your first three meals for free with free shipping by going to blueapron.com love you you will love how good it feels and taste to create incredible home-cooked meals with Blue Apron so don't wait that's blueapron.com I love you Colin yes are you ready to meet your new best friend yes uh this of course is a segment we call PS I Love This best friend uh XOXO this is where one of you beautiful people goes to kindafunny.com forums goes",
      "start": 3914.28
    },
    {
      "text": "are you ready to meet your new best friend yes uh this of course is a segment we call PS I Love This best friend uh XOXO this is where one of you beautiful people goes to kindafunny.com forums goes the PSI lovexoxo board and posts your PSN name so you can be inundated with friend requests for the games you want to play and just messages of being awesome because everybody loves to be reminded that they are great on the PlayStation Network this one comes from Sam Sam writes in and says hey dudes I'm just a guy I looking for what all men need at some point in their lives help delivering cocaine I've been loving the New Biker DLC in GTA Online but all of my friends who play Live across the pond parenthesis you can say that in an accent if you'd like I don't like that I'd love a few new friends who want to help me in my biker club sergeant peppas like salt and Peppa rule the roads of Los Santos and drive off into the sunset popping wheelies love what you guys do Sam Sam's PSN name is s",
      "start": 3952.08
    },
    {
      "text": "who want to help me in my biker club sergeant peppas like salt and Peppa rule the roads of Los Santos and drive off into the sunset popping wheelies love what you guys do Sam Sam's PSN name is s worms swarms 1989 s worms 1989 SWS even though it's not SWS no he got war no he should have picked a better PSN name if he wanted that which you still can't change him you still can't change your PSN names we'll get to that time Tim for the Forgotten PlayStation game of the week you ready for this one yes he says wait who said this what how Specky Specky I it's Specky but I'm going to go speaky Specky says greetings from Ireland wait for Greg to say something about his shalele oh AAL got to go down to the Irish Spring don't you know oh oh a amills I got a suggestion for this week's forgotten PlayStation game let me cast you back to the distant year of 2007 PSN was brand new thank you very much trophies didn't exist and most importantly the now defunct game developer Game Republic released toy",
      "start": 3999.36
    },
    {
      "text": "game let me cast you back to the distant year of 2007 PSN was brand new thank you very much trophies didn't exist and most importantly the now defunct game developer Game Republic released Toy Home for the Playstation 3 Colin do you remember Toy Home no it's not that great but it was it such a deep cut I had to use it it was forgotten designed to showcase the power of the six axis controller the game would have players smashing a toy car into different obstacles using only the accelerator button and motion controls I remember playing this at no end a cheap fun experience for all ages thanks for all you folks do Specky I don't remember this game at all I remember this I mean this is I it was in 2007 I'm not sure if you were there yet but I remember the second one that stumped me so far since we started the show I never I've never seen this is one I remember I think I I don't know if I reviewed it but I definitely did videos for IGN for the PlayStation team for it of playing Toy Home",
      "start": 4054.48
    },
    {
      "text": "we started the show I never I've never seen this is one I remember I think I I don't know if I reviewed it but I definitely did videos for IGN for the PlayStation team for it of playing Toy Home driving this little **** antique car around slamming into **** acting like an idiot thanks a lot Dunham God damn it now it's time for PSN's worst name of the week of course ladies and gentlemen when you make a PlayStation network name you can't change it no matter how many press conferences come and go you're never able to change your name so each and every week here on PS I Love You XOXO we beg Shui Yoshida to let him change this one comes from Spey Dump in the name of the Colin the Greg and the holy Shui my last confession was 10 years ago forgive me PSN admins for I have sinned I must confess that way back in the pre- trophy area me era sorry me and my best friend thought it was a good idea to play a little Crystal Bassoon the night I got my PlayStation 3 for the first time one thing",
      "start": 4102.08
    },
    {
      "text": "that way back in the pre- trophy area me era sorry me and my best friend thought it was a good idea to play a little Crystal Bassoon the night I got my PlayStation 3 for the first time one thing led to another and our adolescent Minds gave me the PSN name fishy tacos 6969 969 yes that name lasted for a while until I got balls deep in modern warfare's multiplayer upon getting banned after a few weeks of that I reemerged as the illustrious fishy Taco pounder once that was banned as well and all trophies rolled around I changed my tune and decided to go with a fairly innocuous username to no to one I from a he's this is an interesting sentence structure basically saying he ends with I miss the fishy Taco he's a boring name oh sorry Spify Dump but it might have been Speedy Dump but it says F in there uh he says sincerely hail Colin we're sorry it was such a bad name Shui please let him change his name back to something crazy fishy Taco 6969 all right but fishy Taco pounder too far dude",
      "start": 4145.72
    },
    {
      "text": "F in there uh he says sincerely hail Colin we're sorry it was such a bad name Shui please let him change his name back to something crazy fishy Taco 6969 all right but fishy Taco pounder too far dude fish taco 696969 I don't think that that doesn't even sound offensive enough to get banned yeah fishy Taco 69 this story is fishy 696969 if you're asking me yeah why I I don't know that fishy Taco 696969 would have gotten you banned without you doing something on yeah he's probably just cheating being a dick fishy Taco pounder a little more explicit yeah but but is it even that is That explicit I know it's very graphic and it definitely HS me in a way that I'm like you like it no I'm offended oh wow okay my um but I don't I don't think that that would get banned sure but it did apparently or he's just lying in either way they're funny well whatever I don't care somebody banned him from the forums that's how Kevin get on it bam ban him from kindafunny.com fors you're just clapping uh",
      "start": 4198.8
    },
    {
      "text": "or he's just lying in either way they're funny well whatever I don't care somebody banned him from the forums that's how Kevin get on it bam ban him from kindafunny.com fors you're just clapping uh PSN's worst name of the week was brought to you by someone as well before I read the ad I just do want to point out cut me some slack usually I'm better at spacing out the ads but it's a special show where we're running through all this different stuff this bad PSN name was brought to you by MVMT watches that's movement watches uh Tim we got these movement watches didn't we they're very nice they're fancy yes they're cheap too cuz you know watch retailers they jack up the price are you aware of this mhm uh you can get starting at $95 they're a good deal damn I have I have a one that's a black band thing oh here it is is this mine or is it that's mine isn't it the black one black band black face little bit of red hands on there big fan of that one uh and they their whole shtick right now",
      "start": 4244.96
    },
    {
      "text": "band thing oh here it is is this mine or is it that's mine isn't it the black one black band black face little bit of red hands on there big fan of that one uh and they their whole shtick right now is we get it holiday shopping can be tough but thanks to MVMT watches all that giftgiving anxiety can disappear with the Press of a button these watches make the perfect purchase for just about anyone in your life guy or girl and remember they start at $95 uh movement watch is again $95 at a department store you're looking at 400 to 500 bucks but movement figured out a way that by selling online they were able to cut out the middleman and get rid of the retailer markup uh they have more than 500 000 watches sold in more than 160 countries but of course it's the internet you put it on my shoulder it's like your Championship what time is it oh looks like it's fashionable in many I can't see it's too close to my face my glasses don't work that way ladies and gentlemen get 15% off today with",
      "start": 4286.72
    },
    {
      "text": "it's like your Championship what time is it oh looks like it's fashionable in many I can't see it's too close to my face my glasses don't work that way ladies and gentlemen get 15% off today with free shipping and free returns by going to mvmtwatches.com SL love and join the movement ladies and gentlemen this has been PS I Love You XOXO episode 64 it's been a whirlwind it's been different it's been crazy thank you for joining us live if you're joining us live thank you if you go to the PSX conference and you go to our panel tomorrow Sunday noon of course followed by a meet and greet at 1:00 right there uh if you didn't know PSI love you XOXO is kindafunny.com PlayStation podcast it posts every Tuesday at 9:00 a.m. Pacific Time on podcast services and youtube.com/ kindof funnygames and of course it's all gravy because",
      "start": 4329.36
    },
    {
      "text": "PSI love you XOXO is kindafunny.com PlayStation podcast it posts every Tuesday at 9:00 a.m. Pacific Time on podcast services and youtube.com/ Kinda Funnygames and of course it's all gravy because you're so good to us you take care of us and we love you a lot you're really good people you make it the number one PlayStation podcast I tomorrow hasn't happened yet but I'm sure you're all going to come out and support us there it'll be crazy crowd everybody's going to be insane we have bunch cool guests and it's going to be awesome remember you're hearing this early uh the PSX panel will go up as Tuesday at 9:00 a.m. episode because that's how we roll every episode of PS I Love You XOXO ends in a song in a segment we call singing a Shoei this is where one of you talented ***Kinda Funnyof funny.com PSM and gives me an MP3 of your song and a YouTube link of your song I put the MP3 at the end of our MP3 and I annotate your to your YouTube at the end of our YouTube Today's comes from",
      "start": 4371.76
    },
    {
      "text": "of funny.com PSM and gives me an MP3 of your song and a YouTube link of your song I put the MP3 at the end of our MP3 and I annotate your to your YouTube at the end of our YouTube Today's comes from Austin Killian Austin Killian says what's up Colin and Greg not much PSX was pretty good longtime listener here and itching to have the classy Greg Miller read this message and help share this song with the world world but more importantly share this song with Naughty Dog you see I'm just a young married man with his first child on the way and have the desire to support my new family by following my dreams and scoring the soundtrack or trailer music for video games after playing The Last of Us a few years back I decided to play my guitar to see where this masterpiece left my mind emotionally and this song is what finally turned out not only would I love to have this beautiful Community listened to it but to share it with the best developers in the industry naughty golly G would make me the",
      "start": 4409.76
    },
    {
      "text": "this song is what finally turned out not only would I love to have this beautiful Community listened to it but to share it with the best developers in the industry naughty golly G would make me the happiest little school girl to be contacted by them and have my song in one of their trailers or something for The Last of Us Two you can go to Finley house.bandcamp.com to download this song it's called Story of Ish tweet the link to Neil and Bruce if you want to and help them help me out trying to make my dreams come true so ladies and gentlemen this is the story of Ish it's inspired by The Last of Us it's from Austin Killian you can go to Finley house.bandcamp.com to get it and until next time it's been our pleasure to serve you C",
      "start": 4453.48
    }
  ]
}
