{
  "id": 2238,
  "video_id": "FFzY-Zzct60",
  "show_name": "Gamescast",
  "hosts": [],
  "title": "How Should The Game Awards Change? - Kinda Funny Gamescast Ep. 98 (Pt. 3)",
  "description": "How can The Game Awards improve?\n\nThanks to Video Blocks for sponsoring this episode. Go to http://www.videoblocks.com/gamescast2016\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1481724000,
  "duration": 2309,
  "transcript_chunks": [
    {
      "text": "This episode of Kinda Funny Gamescast is brought to you by what, Greg? Video Blocks. Video Blocks, my favorite stock footage website. Talk about it many times, use it. Kinda Funny Live One and Kinda Funny Live Two. Well, I use it for Kinda Funny Live Three. The answer is yes. You can go there 100% royalty free even after your subscription comes to an end. So it's a subscription based thing. You go in, you get unlimited, get whatever you want. There's also audioblocks.com. Do me a favor and shut up. Guess what everybody? I used Video Blocks in the V relocation program. You think I filmed a family at the beach? Didn't funniest moment of the video. Thank you. It was great. It was fantastic. Video Blocks is offering you all a year subscription to both Video Blocks and Audio Blocks for only $149. This is a $100 discount off the usual price tag for our followers only. An incredible discounted deal to get both stock video and audio. Get your subscription today for only 149 at videoblocks.com/gamescast2016. See",
      "start": 0.2
    },
    {
      "text": "discount off the usual price tag for our followers only. An incredible discounted deal to get both stock video and audio. Get your subscription today for only 149 at videoblocks.com/gamescast2016. See it all. That's videoblocks/gamescast2016 for this. You're not making it better, you're making it worse. See my head's blocking now you're Video Blocks. Can we make them stock footage? We should make them some stockage of what next topic? The Game Awards. Game Awards 2016 happened last week. Uhhuh. We did a predictions topic on Gamescast. We did the week before. You won. Congratulations. I won. I won. Tim was right. Um, thank you, Kevin. But during the the Game Awards, there was a lot of conversation that we were having and then later on NeoGAF of what the **** is this? **** is this what the Game Awards should be? Sure. So the topic here is what should the Game Awards be going forward? Uh, and specifically talking about Jeff Keighley's Game Awards. Uh, what did they do right? What did they do wrong? Where can they",
      "start": 38.28
    },
    {
      "text": "be? Sure. So the topic here is what should the Game Awards be going forward? Uh, and specifically talking about Jeff Keighley's Game Awards. Uh, what did they do right? What did they do wrong? Where can they learn? And more importantly, just like what what is it that we expect them to be and can that thing even exist? Big question. Uh, I love the Game Awards. Uh, Jeff Keighley obviously a friend of ours. We we voted on the Game Awards judging board this year. Uh, I thought and I've been I've been a fan or at least and I've been interested in them since they were the Spike TV Awards of course, right? And I think for me what the game the Game Awards are Head and Shoulders above what the Spike TV Awards were, right? I always talk about when I went to the one down in LA where Elijah Wood came out and announced on Chard or whatever, right? And it was like what what's going on and like what how is this this is weird and all these celebrities are up there that have you know Samuel Jackson it's just like well don't hate an",
      "start": 103.52
    },
    {
      "text": "whatever, right? And it was like what what's going on and like what how is this this is weird and all these celebrities are up there that have you know Samuel Jackson it's just like well don't hate an SLJ. I love SLJ but I'm just saying there was a lot of pandering there, right? Of like this is what you want, right? Blah blah blah blah blah. And when Jeff got away from Spike that was like I think for a lot of people in the industry and not I talked to Jeff I think tangent before but never really you know what I mean? So he struck out on his own and did that first Game Awards with the first PSX or around the first PSX in Vegas and I remember being at that first one where it was uh Imagine Dragons perform with the Nintendo guy, Koji Kondo. Thank you so much and like to be in the room I was like holy **** this is awesome like that is such a great moment and it was such a big deal that it was being funded through these different ways and it wasn't do the traditional ad model and it was more for the",
      "start": 151.84
    },
    {
      "text": "this is awesome like that is such a great moment and it was such a big deal that it was being funded through these different ways and it wasn't do the traditional ad model and it was more for the gamers by The Gamers, right? And I felt like the Game Awards there were such a great step that was such a great step such a great show is the first time I remember watching the Game Awards and that's including VGA and being like wow they're on to something here it's this if Jeff's on his own and can do it this way it's going to be something special, right? During our the stream for the latest Game Awards I was talking about last year's Game Awards and I'm like I'm incredibly biased here I was there and it was a **** fantastic night for me because I won but I remember having that same feeling where I'm in the audience and Stephanie Houston comes out and does Quiet's theme live and Jeff has the great Kojima speech about like he's not allowed to be here so **** these guys I had a good speech",
      "start": 190.52
    },
    {
      "text": "I'm in the audience and Stephanie Houston comes out and does Quiet's theme live and Jeff has the great Kojima speech about like he's not allowed to be here so **** these guys I had a good speech there were good trailers there it for me being there felt like it was about the developers and it was about the games and it was about the actors and actresses, right? Troy was in front of me the lady from Her Story was over there she went up and won The Witcher kept winning Awards left and right like it in the room felt like it was about games and it was now getting to year three I and I you know we talked about it on the show and we're going to talk about it here obviously I felt like it was a minor step back backwards I don't think it's off track I don't think it's spinning off into VGA land but the the Schick Hydro Razor guy uh the kick the backstage kicks to Kyle Bosman reminded me a lot of I forget what VGA it was but the one where they kept kicking back I want to say to Allison Hype but",
      "start": 232.52
    },
    {
      "text": "the the Schick Hydro Razor guy uh the kick the backstage kicks to Kyle Bosman reminded me a lot of I forget what VGA it was but the one where they kept kicking back I want to say to Allison Hype but I'm not sure if that's correct where they were doing like weird mini gamess and there was like pies coming out at one point and they were trying to make and it was like what the **** is this why are you doing this like this is time that could be spent on a video game on an award on a developer speech and I I again I'm not saying this year's VGA or Game Awards were a VGA performance they weren't I just feel like for the first time it was a bit of a step backwards where it was very blatant that here shtick and the Hydra Razer and this thing and here's Kyle in the back who he's making some reference to whatever the hell was another ad kind of thing I forget my exact example I'm thinking of but the VR one that he put on and like you and I had a conversation on the Game Awards stream I was like",
      "start": 272.2
    },
    {
      "text": "to whatever the hell was another ad kind of thing I forget my exact example I'm thinking of but the VR one that he put on and like you and I had a conversation on the Game Awards stream I was like uh and you're like hey they got to pay the bills which I we of course appreciate we have to that too obviously but it was that thing of like I understand that but when we do an ad read you and I try to have fun with it or we do something and granted I guess they're trying to have fun here and I can kind of see and you can saying I think they're in on the joke and I was like are they it wasn't transparent enough that hey everybody we're doing this because we have to do this haaha it was so that was for me the one problem because it then became that I felt like there were not as many awards being put on stage and it it wasn't as much about it but it's so hard for me to say cuz the past two years that were the game WS I was in the audience and clearly they weren't showing me all the ads and",
      "start": 317.84
    },
    {
      "text": "put on stage and it it wasn't as much about it but it's so hard for me to say cuz the past two years that were the game WS I was in the audience and clearly they weren't showing me all the ads and doing it all so I'm skewed and I don't know if it's reality if it's just my own bias from being at two shows where I got to see what I got to see yeah I mean for the sake of this whole argument I'm definitely on on a side that I think is unpopular when it comes to people's thoughts on this whole thing from a a viewer perspective because I'm looking at it as a production and I think about the award show as this huge uh thing that so many people are working on to create an event that is both for the people in the room and for viewers at home now from that yeah the the bills got to get paid there's not commercials in here you can bring up all the other award shows the the VMAs the AMAs the Grammys Oscars whatever those are all either on cable channels getting paid for that way in addition to",
      "start": 352.0
    },
    {
      "text": "not commercials in here you can bring up all the other award shows the the VMAs the AMAs the Grammys Oscars whatever those are all either on cable channels getting paid for that way in addition to commercial time every **** 5 seconds or uh on EC or whatever and they have the uh commercials in addition to things like Ellen pulling up a Samsung phone to do the the Selfies and stuff it's like there those Integrations are happening everywhere, right? So with this it's like all right was the the Schick Razer man like over the top yeah and the reason I think that they were in on the joke and I think it might have missed the Mark just because they're in on the joke doesn't excuse them yeah uh is the fact that it's Kyle and all that Kyle and with the Easy Allies the the advertising is kind of a joke so it' be the equivalent of what if we were part of the the Game Awards and if someone pitched me hey Tim you want to like interview the razor guy like we would think it's funny and our audience",
      "start": 395.24
    },
    {
      "text": "joke so it' be the equivalent of what if we were part of the the Game Awards and if someone pitched me hey Tim you want to like interview the razor guy like we would think it's funny and our audience would think it's funny that I'm doing that cuz they know me they know that stick and I feel like with Kyle is the same way Kyle's that guy for that group where he makes fun of the the sponsorship so him doing it it's kind of the joke again misses the mark when most people don't get that reference but at the same time it had to happen for this thing to happen on the scale that it did and unfortunately a lot of it comes down to all right well they needed money to get celebrities to do this thing but we don't want celebrities we want to see Awards we want this whatever the problem is they don't care what you want they care what the majority of people want they care about growing this thing they they have their obvious business ramifications that they need to consider but they also have goals",
      "start": 438.16
    },
    {
      "text": "what you want they care what the majority of people want they care about growing this thing they they have their obvious business ramifications that they need to consider but they also have goals that they're trying to push that aren't thinking about what NeoGAF has to say about them sure uh I think that when it comes to like so many people are bitching about why aren't all the Awards being shown because people don't care that's called the DICE Awards and nobody watches them that's the GDC Awards there's all these different prestigious award shows that nobody watches at all so it's like all right there's no money there there's no viewers there those those are happening so it's like cool if you just want people to get their time and their Awards that's happening watch any award show they're not showing every award like if there's 10 Awards you'll be like get seven of them right like and I'm talking about things like the VMAs even on the Oscars and Grammys there's hundreds and hundreds and",
      "start": 478.16
    },
    {
      "text": "showing every award like if there's 10 Awards you'll be like get seven of them right like and I'm talking about things like the VMAs even on the Oscars and Grammys there's hundreds and hundreds and hundreds of Awards being given away and most of them aren't televised because then you're going to be going down the list of best VFX in a TV show and it's like it's so specific that there's just not time to show this stuff so I think that they did a really good job of pinpointing the awards to televis televis in quotes uh to kind of tell a story uh I think that focusing on the trending gamer is really important despite the internet being like who gives a **** about this award the people because the trending gamer it's trying to show people what gaming is as a culture and what gaming can be and in addition to that things like the the Kojima stuff where people are like oh did he really need to you know give his freaking love speech to Kojima for 10 minutes and like make it so much about",
      "start": 518.8
    },
    {
      "text": "and in addition to that things like the the Kojima stuff where people are like oh did he really need to you know give his freaking love speech to Kojima for 10 minutes and like make it so much about Kojima to the point that it's awkward it's like well I would argue yeah because that's trying to treat Kojima like a celebrity trying to treat him like he matters which will then get us to a point that the Game Awards can be stuff where we are awarding game developers for being celebrities for being things that for being people that people should know because until then we're just going to get real celebrities like because that's what people know people latch on to that that's what trends on Twitter uh and the argument about the musical perform performances it's like I get it from both sides but they're also producing a show for the people in that room and the people in that room are into it or the journalists that aren't into it and they're not going to be into anything so the they're just",
      "start": 562.6
    },
    {
      "text": "they're also producing a show for the people in that room and the people in that room are into it or the journalists that aren't into it and they're not going to be into anything so the they're just there for the announcements and stuff um and I I also think it's unfair to look at the the musical act and just be like oh man this has nothing to do with gaming it has everything to do with gaming that's what games are games are licensed music whether you like it or not 90% of video games now are licensed music and the the rappers that want Run the Jewels and Ray Sremmurd whatever the hell he is Run the Jewels had a a Gears tie in they've been in like every video game this year so it's like there that's where that comes down they also did the Doom soundtrack which is their equivalent to the Koji Kondo thing a couple years ago and to Stephanie Jon last year uh and then the Rae Sremmurd guy number one song in the world right now so it's like okay cool they're they're doing this stuff for reasons",
      "start": 602.28
    },
    {
      "text": "thing a couple years ago and to Stephanie Jon last year uh and then the Rae Sremmurd guy number one song in the world right now so it's like okay cool they're they're doing this stuff for reasons last year they had Churches what did Churches have to do with video games oh they're in a couple of them you know so it's like those are the things where it's like I get that you don't like that but those things need to happen for this and at the end of the day the Game Awards the awards part of it is just part of it video games are in a unique place where unlike any other industry there's things like E3 where hey watch us do a press conference where we announce a bunch of **** and show you trailers do movies have that the closest thing is the Super Bowl right like it's not like there's some music day where people come out and like whole bunch of artists come out and be like here's the albums coming out this year right or and movies it's like Marvel Marvel did that thing one time where they",
      "start": 638.32
    },
    {
      "text": "day where people come out and like whole bunch of artists come out and be like here's the albums coming out this year right or and movies it's like Marvel Marvel did that thing one time where they had their press conference to kind of talk about what the MCU was going to be but besides that you don't see you know even if it happens it's definitely not a big mainstream movie event this in the way that in video games it is mainstream for uh these game announcements and I think that the Game Awards has filled a void of the late year E3 it's that second thing we got PSX but where else are we going to see all the other guys have stuff you know Nintendo for years has been debuting things there whether it's **** like Cranky Kong's playable and Donkey Kong Tropical Freeze or things of substance like uh Zelda Breath of the Wild before we knew was Breath of the Wild being shown for the first time and even with like a lot of people are like oh man like what they show this year sucked it's like",
      "start": 678.12
    },
    {
      "text": "like uh Zelda Breath of the Wild before we knew was Breath of the Wild being shown for the first time and even with like a lot of people are like oh man like what they show this year sucked it's like okay watching it expecting to be blown the **** away yeah but compared to the last couple years we actually got a **** ton this year like every year they're getting more and more exclusives that matter more and more uh even if they're not exclusives just like new looks at things uh of substance I mean looking at this year we got Mass Effect Andromeda Walking Dead premiere uh Zelda Breath the Wild trailer and let's play things showing more than we've ever seen in that game when we didn't expect to see anything from it until the Nintendo presentation Shovel Knight Spectre torment Halo Wars 2 Death Stranding Dauntless Bulletstorming Master Tell Tales Guardians the Galaxy Law Breakers Warfare the Assassin's Creed experience whatever that's enough games where it's like that's a wide net where",
      "start": 721.76
    },
    {
      "text": "Stranding Dauntless Bulletstorming Master Tell Tales Guardians the Galaxy Law Breakers Warfare the Assassin's Creed experience whatever that's enough games where it's like that's a wide net where yeah you may not like everything and there was Prey as well um but there's something for everybody there and I think that that's important because to give people these seeds means next year they'll have more and see that's I think part of it that I I was driving at before you just gave a very good rundown of you know what I mean because again didn't hate him just thought I think it might even be my own personal bias right in the fact that it's a kind of like PSX 2014 15 right it's 2016 now so last year's PSX 2015 in the way of PSX remember had a bad ending and then also when you talk to Adam Boyes afterwards or I if that's even correct when we talk to anybody afterwards they like we want have a few different things in there right we want we want to have something where somebody comes and they",
      "start": 763.84
    },
    {
      "text": "afterwards or I if that's even correct when we talk to anybody afterwards they like we want have a few different things in there right we want we want to have something where somebody comes and they leave and they have two to three things inside of this conference they were super pass passionate about right and so for me it was like Mass Effect was great Breath of the Wild I've played this that and the other then even Awards right like again I'm not one of the guys who's saying 2016 was bad for games I am saying that I think 2015 was way better for me there were a lot of great games this year but Overwatch isn't my jam right so am I super stoked that they're out there winning Awards and people are going up there and I don't know anybody on that team again personal bias of it's exciting to see oh man like I I thought The Witcher was great they're honoring The Witcher oh man me gear was greato Kim got this thing it's not happening but oh my God Her Story was great uh Emily was a away",
      "start": 805.6
    },
    {
      "text": "to see oh man like I I thought The Witcher was great they're honoring The Witcher oh man me gear was greato Kim got this thing it's not happening but oh my God Her Story was great uh Emily was a away was great all these different things you know where that was like such a big deal to see those people honored where this year it's like yeah these games are great oh good I'm glad they're winning but I'm likeah I'm not as invested in it maybe is the problem and that's maybe a problem for other people too uh I I think I thought you gave a very eloquent rundown of why I think a lot of the things worked and I and I'll also say that I I feel um that having firsthand knowledge and experience and being able to to um have witnessed uh smaller productions being done in the in the lift that those require from people that know way more about it than me um you know I give them a lot of credit for for pulling the show off uh the thing the thing that I'll say is that um I think the balance between",
      "start": 838.72
    },
    {
      "text": "from people that know way more about it than me um you know I give them a lot of credit for for pulling the show off uh the thing the thing that I'll say is that um I think the balance between Awards and chicanery and reveals was totally off and uh I did look into it I actually remember talking to Nick he drove me home that night and I was like the Oscars show way more Awards than this right and he was like yes and so I was like but for the record there's more Oscars I think that's part of the problem well sure but I was also like so there's what Oscars more Oscars the Game Awards in general has what the Oscar are also like three three and a half hours long um and so I was like okay so that's that's an interesting thing that I wanted to walk away from but specifically um you had brought up which I think is a Salient point that you know our E3s and Gamescom and TGS's and Paris Games very unique and very endemic to to the gaming industry no one else has those and it's true um we are a",
      "start": 879.88
    },
    {
      "text": "up which I think is a Salient point that you know our E3s and Gamescom and TGS's and Paris Games very unique and very endemic to to the gaming industry no one else has those and it's true um we are a unique and Forward Thinking industry and we have been for 40 years uh long before any of us were born and um E3 was born out of CES because of the idea that uh we can do it differently and do it better right we didn't we could have just stayed with technology and stay with computers and we didn't we chose not to do that to me the the Game Awards are very 20th century and it reminds me a lot of um this drive to try to get gaming movies right like we have to have an Uncharted movie we have to it's like no you don't what like what are you trying to prove to everyone like we we should be the ones in which that are emulated uh in terms of the gaming industry because we are we have a very forward-thinking interactive pioneering industry that requires pioneering solutions to Old problems about",
      "start": 919.36
    },
    {
      "text": "in which that are emulated uh in terms of the gaming industry because we are we have a very forward-thinking interactive pioneering industry that requires pioneering solutions to Old problems about like how would you how do you honor game creators how do you reveal a product how do you celebrate game culture and I just feel like it's a nice attempt and I think it's the best attempt possible right now uh considering what people want to put into it but I I don't think it's I don't think it's a hit I don't think it's I don't think it works and and and I and I just want to say that I think that it's nothing against Jeff I like Jeff I know Jeff I think he's a great guy and uh I think that the production based on what it was was fine I think it was fine it was interesting I watched it it was I think the right amount of time I just want us to come up people smarter than me and more intelligent than me and and have with more intuitive ideas come up with something that makes sense for us",
      "start": 964.6
    },
    {
      "text": "I think the right amount of time I just want us to come up people smarter than me and more intelligent than me and and have with more intuitive ideas come up with something that makes sense for us because this doesn't make sense for us and that was my one big takeaway I don't need another show with reveals in fact I would rather have them have clever ways to just celebrate you know we talk about DICE and the GDC Awards and all that kind of stuff and that's fine I don't care about those either I'm I'm interested in the winners I don't watch them but if we want to celebrate game creators then and the people that work so hard on these games and let's do that and and and not worry about getting uh eyeballs based on uh reveals they they're two different things you know they're they're they're separate you know at the Oscars they don't reveal typically M you know a slew of movies you know and they just celebrate the people that have already made the movies and so to to Tim's point and I",
      "start": 1004.52
    },
    {
      "text": "separate you know at the Oscars they don't reveal typically, you know, a slew of movies you know and they just celebrate the people that have already made the movies and so to Tim's point and I think it's important that that might not get eyeballs or Garner eyeballs but it's probably the right thing to do and we already have an E3, we already have a Gamescom, we already have a PSX, we already have all these things we don't need another one already you and that's and that's we don't we already yeah we already have a George it's like I was saying about absu we already have a journey see my AR argument to that though is we already have award shows we already have IGN's game of the year we already have all of that and I think that what we don't have is something like this we don't have something that is this is the VMAs of games and I think that having that where it is a self-produced event that celebrates games the way that they are celebrating them I think that it it is unique compared",
      "start": 1044.44
    },
    {
      "text": "that is this is the VMAs of games and I think that having that where it is a self-produced event that celebrates games the way that they are celebrating them I think that it it is unique compared to everything else in the gaming sphere is it just copying what you know movies and them do yeah but like the the thing there is again trying to step away from the Academy Awards and think more of it as an MTV movie awards or VMAs where it's like what happens at those shows trailers for new movies performances by artists and they give away a couple Awards and I think that that's what this is and I think that this it stands alone then because it's not quite an E3 where it's just uh messages being delivered by the people like that are making the games and that's all that it is and numbers and graphs and all that stuff but it's also not uh Awards and just reviews and celebrations of games for what they've done it is kind of mixing of the two to then have games be celebrated in a way outside of",
      "start": 1083.28
    },
    {
      "text": "and all that stuff but it's also not uh Awards and just reviews and celebrations of games for what they've done it is kind of mixing of the two to then have games be celebrated in a way outside of Gamers and I think that that is what its goal is whereas The Gamers wanting to celebrate games they're going to IGN to see what IGN game game of the year you know and **** about in the comments um and then on the other side they're going to wherever it is that go to get their trailers and stuff to give their opinion on the new movies they've seen this is ironically unique in the gaming world and I I think necessary because like it's enjoyable It's Entertainment content what's I mean what's unique about it and what I've always liked about it I I when I say that I mean game awards and then to an extent I guess more like judges week right when they would they do an E3 game of the show is the fact that when I was working at IGN and even I guess I don't know if I really knew about it when I was",
      "start": 1131.32
    },
    {
      "text": "extent I guess more like judges week right when they would they do an E3 game of the show is the fact that when I was working at IGN and even I guess I don't know if I really knew about it when I was on the outside of it existed but the idea of it being the Justice League where it is all right kinda funny votes and IGN votes and all these other different sites and people vote so you get this consensus right and yeah you know we call that dice Awards you could put the baftas in there you could put uh the GDC Awards in there and how okay well nobody watches those those are ones where I don't feel those are meant to be watched necessarily you know GDC is always the GDC Awards and the independent game awards right idas are all at the same time ID gfas whatever there's two award shows back toback but they're for the developers that are all there who want to come out and honor each other and dice is the same way right all right cool all these developers in their tuxes who want to honor",
      "start": 1173.48
    },
    {
      "text": "toback but they're for the developers that are all there who want to come out and honor each other and dice is the same way right all right cool all these developers in their tuxes who want to honor each other dice is I mean like I've never been to a dice it is it seems always very like I went to one dice and it is it is that it's a lot of let's get dressed up and CBR celebrate other yeah and like that's not necessarily meant for our prying eyes that isn't supposed to be the live stream and so what I love about the game awards is the fact that I think Jeff is on to something and I think every year it is he's making this stew or soup right and he's adding a little bit and tast uh he's doing isn't this how you make soup and stew he's he's puts a little bit in then tastes it and then comes away from it and like that and I love the fact that like the day after he put tweeted like what did everybody think I really want to know right I'm sure he's watching this video and I feel like he's",
      "start": 1211.36
    },
    {
      "text": "away from it and like that and I love the fact that like the day after he put tweeted like what did everybody think I really want to know right I'm sure he's watching this video and I feel like he's going to get it and I think there you brought it up in the your the beginning of your part that there's a balance to it and maybe this year it was the chicanery as you said out balancing the awards and I think that's something to take to heart and bring it back the other way because it is that and I don't know if it's just me and like these even the seeds of the speech from last year for me right of the fact that I feel like developers don't get enough time and enough game players don't understand the people who are behind it and like the **** speed for that Dragon cancer right man I want **** people to see that and I want that to have a platform and I want that to get to people so they understand and as we build Troy Baker's and Nolan North and you know Mark Ceres and personalities",
      "start": 1255.6
    },
    {
      "text": "**** people to see that and I want that to have a platform and I want that to get to people so they understand and as we build Troy Baker's and Nolan North and you know Mark Ceres and personalities you start to get to the point where we always talk about it right Oscars work because movies are sold by who's in them and maybe as we continue down this line of games and you have Kojima coming up right and you have David CES coming up maybe we get to the point where oh man Cliff Blazinski made this game everybody's going to Care on a different level and we get to that point where that can be this is all still this is all part of the same ground swell where in I always you know talk about how I think up at noon was ahead of its time in a way right in terms of like we we started like Dave Fenoy is more popular because of up at noon and but but it's also he's more popular because Telltale did amazing work with him and really **** broke down a lot of walls with The Walking Dead Season one",
      "start": 1289.84
    },
    {
      "text": "is more popular because of up at noon and but but it's also he's more popular because Telltale did amazing work with him and really **** broke down a lot of walls with The Walking Dead Season one so all these things are happening at once and we're all trying to get it and figure out how to make it something yeah I I mean dude I think you really hit the nail on the head there it's like it takes the up at noons to get stuff and it takes the Jeff Show Now on YouTube where it's like it really you look at it and you're kind of like o why are you doing that like why do we need all this high production value as I sit here in a freaking room with a a video wall it's like this stuff's necessary for this **** to be taken seriously to for more money to be put here organically to be able to do the things that we want to do not the things that we feel like we have to do and and all that and you're right like you what up and noon did up and noon for better or worse changed the industry of video",
      "start": 1328.64
    },
    {
      "text": "things that we want to do not the things that we feel like we have to do and and all that and you're right like you what up and noon did up and noon for better or worse changed the industry of video game videos right and how people thought of uh that type of content in an interview content you interviewed people about their roles on games whether they're a voice actor or a director or a level design editor whatever it is like you gave them you made them celebrities for that 15 minutes right and I think that we need more of that and that's why I think going back to what I was saying that him giving Kojima that moment was important you know and I I feel like Kojima is probably the the top of the the food chain when it comes to that but it'll trickle down and it does require time to get all of this stuff going uh but it's important for up at noon to copy talk shows to be able to do its own thing cuz you can't just do your own thing or else it's going to fail uh when it comes to this type",
      "start": 1365.08
    },
    {
      "text": "this stuff going uh but it's important for up at noon to copy talk shows to be able to do its own thing cuz you can't just do your own thing or else it's going to fail uh when it comes to this type of stuff and it's just a tried andrue sad fact but you can't do the um the thing for the love of it until you do the thing to make money to do that thing for the love of it yeah I think I mean you're right I mean there I I'm cons I'm always concerned Even in our own Corporation when we talk about it but with generally about the the incessant drive for the monetary reality yet it is important to have the monetary realities at the Forefront or you can't you know it's chicken or the kind of situation I stand the coima thing I thought was funny I thought that he was talking about coima like his playing crash in Vietnam and he was a p for seven years so I thought that that was pretty fun and I got a lot play on Twitter I thank you for that but the uh specific thing that I think I'll stand by is",
      "start": 1407.2
    },
    {
      "text": "crash in Vietnam and he was a p for seven years so I thought that that was pretty fun and I got a lot play on Twitter I thank you for that but the uh specific thing that I think I'll stand by is that I think it is a 20th Century television era solution for an internet driven 21st century industry and the the only reason that so much money the shtick man in the video game you know all that kind of stuff has to be shown is and the ads there was a lot of G emic gaming ads showed is because of the scale of the production and I don't agree that it has to be that way in an era where twitch people are twitching to hundreds of thousands of people from their bedroom I actually think that uh stripping it down and making it more personable Jeff Keeley in a room like this and a couch having developers come in to get their Awards um I think is would require almost no money they'd probably have a bigger margin and they would be able to do what is necessary to attract a younger 21st century gaming",
      "start": 1447.2
    },
    {
      "text": "come in to get their Awards um I think is would require almost no money they'd probably have a bigger margin and they would be able to do what is necessary to attract a younger 21st century gaming audience and that's that's all I'm trying to say I I I I think one of the telling things that that I saw I was surprised about how empty that place was and and that it doesn't need to be in that venue like it's not impressive it's actually depressing to see it in that venue when it's not full and so it they I think it has to scale back I think the balance you know the CH canery V reveal V award thing I mean that's something I have to figure out but I think that it doesn't have to be um I really feel like we're I again I think the the corer to the movies is really important to gaming movies where it's like we don't we find our own solutions to all these problems and I think again you bringing up E3 is a great IDE like a great point where it's like we have unique solutions to Unique problems",
      "start": 1488.6
    },
    {
      "text": "it's like we don't we find our own solutions to all these problems and I think again you bringing up E3 is a great IDE like a great point where it's like we have unique solutions to Unique problems or unique um set of circumstances in gaming that movies and and TV and and all these things don't and music they're from another era in another time and we can show them how it's done you know and I think that that's that what's so fun about it and so that's my my big takeaway and my big recommendation to Jeff is just and they won't they it's going to be the same place the bigger and better proofs in the pudding and and I think that that that's that's my that's my the problem but also I think it was at a different place this year so I mean it could be a different place next year right but what I mean is like it's going to be a a large theater with uh you know high production values and I'm sure hundreds of thousands of dollars worth of staff and equipment and all that kind of",
      "start": 1532.68
    },
    {
      "text": "but what I mean is like it's going to be a a large theater with uh you know high production values and I'm sure hundreds of thousands of dollars worth of staff and equipment and all that kind of stuff and I just I just don't I just don't feel like it's necessary and and that's and and so that's just my my takeaway that said I think the show uh was just fine I I don't think it was bad at all I just uh I just want us to remember how unique we are as a as a group you know and and that um we we love interactivity we love storytelling we love all these things and yeah the dice Awards might not attract eyeballs but it's because they're not doing it right and I want someone to take a very button- up approach to this at some point and just try it um well I just want to point out like people have tried it and the proofs in the pudding and it didn't work out when we were at IGN we did that that Judgment Day that's what that is right it was inviting devs to come and talk like give Awards and and",
      "start": 1573.0
    },
    {
      "text": "it and the proofs in the pudding and it didn't work out when we were at IGN we did that that Judgment Day that's what that is right it was inviting devs to come and talk like give Awards and and do that whole the whole like exactly what you just said and it wasn't worth the trouble you know like it didn't get the the views it just caused a lot of **** storm in the comments of negativity and stuff because that's what award shows do um disagreeing but I mean move desk out of the side put up a whatever background we do an award show here we totally but we do it I mean we do on Gamescast like just giving out like our game of the year we invite Tim Shafer over and and he just accepts every award on behalf of whoever of whoever yeah and I mean that's that's actually a really good video I'm definitely definitely year overwat here to accept Sher yeah I'm down for that but I think that is the the problem is that there is realities to this and even as simple as having developers come out that",
      "start": 1613.96
    },
    {
      "text": "definitely year overwat here to accept Sher yeah I'm down for that but I think that is the the problem is that there is realities to this and even as simple as having developers come out that cost money you got to fly them out you got to put them up and it's like you have all these different teams where their PR people that have representation like even us getting Let's Plays we did a let's play yesterday and there's freaking 10 people in the room you know imagine people wanted to be here for an award show that's a whole another frustration with just the Publishers and marketers just blowing **** money although it's it's not as bad as it used to be I was talking to someone about that but that's a whole another problem about like how like why do these companies spend so much money on all this **** because spending the money makes money and I think that's that is really what the saw boils down to and I know that I'm beating a dead horse again but it's just like there's so much",
      "start": 1653.24
    },
    {
      "text": "all this **** because spending the money makes money and I think that's that is really what the saw boils down to and I know that I'm beating a dead horse again but it's just like there's so much behind the scenes **** that make these things the way that they are it's not like Jeff Key's making this and is just like I'm blind and deaf and don't hear and don't understand what you guys are saying it's that I hear what you're saying but there's a butt you know and I think that we are really making good steps towards the game War is getting better and better every year we're getting more reveals which is why I watch them who wins the award great I don't need to watch that I can watch the I can look at the a recap later and see who won and see who had good speeches and that is a thing that I want to give a shout out to and I said this during the the show itself but I think that your speech motivated people to step their speech game up because it's the game awards you win stuff cool you",
      "start": 1688.52
    },
    {
      "text": "I want to give a shout out to and I said this during the the show itself but I think that your speech motivated people to step their speech game up because it's the game awards you win stuff cool you get to go thank my mom thank my dad thank my team cool bye but it's like no because of your speech you took that **** seriously and you had a platform you put your money where your mouth is when it comes to this conversation and you tried making the game awards better you tried making the game awards what it should be and I think that you changed them I think that every speech that we saw this year I think to some extent was influenced by your speech and whether or not it's directly to you like I think that you making setting that standard and setting that level allowed other people to have powerful speeches that weren't all just the same thing and I I I think that Nolan coming out and taking the opportunity to say the things he said was powerful and awesome I guess that's part of it",
      "start": 1729.24
    },
    {
      "text": "powerful speeches that weren't all just the same thing and I I I think that Nolan coming out and taking the opportunity to say the things he said was powerful and awesome I guess that's part of it maybe that's part of this why this one is I feel a step back or weird is the fact that you're right the speeches all were good and so it was that Jos of going from Nolan speech of like holy **** everyone a lot of people didn't even like really catch I'm like holy **** he's talking about like he's the first ever giant video game actor to come out and be like this strike's **** and he's saying that right now and it's like holy **** we've been waiting for someone to say something and here it is and it's happening live as he wins this award for his voice acting was like holy **** was that powerful so then to jump to he something Goofy and they even had the problem with the dragon that Dragon cancer speech where they came back and it was like you could see them not stall but I I feel I",
      "start": 1770.04
    },
    {
      "text": "powerful so then to jump to he something Goofy and they even had the problem with the dragon that Dragon cancer speech where they came back and it was like you could see them not stall but I I feel I felt like they were trying to this middling area of like let's talk long enough about this to get you away from that cuz there's no way to pull out that without a commercial break and that's the problem it's it's like these guys give these rousing amazing speeches and then dubstep music plays that's really interes and then it's back to Justine and Matt Pat who delivered the award and how are they supposed to handle that and then the internet rips everyone apart because it's just like it's so insensitive for them to play this music like they don't even care it's like that's the that's the problem of the live production aspect of it where it's like this is an award show and this is a thing where it's like yeah the music is like transition music it's not an emotional uh like like score to",
      "start": 1808.72
    },
    {
      "text": "of the live production aspect of it where it's like this is an award show and this is a thing where it's like yeah the music is like transition music it's not an emotional uh like like score to what just happened and it's like not reacting to what people just did it's moving the show along and that that that gets super complicated and it go also goes back to you know me and you got to do something super unique this year and host the Final Fantasy uncovered event and I never thought I'd be in a position where I get to be the guy on stage that I'm making snarky comments about online and it's just like you know we did a bunch of **** and said a bunch of **** in a way but you nailed it it only took us like 40 minutes I don't know when this topic started but you nailed it of what what was wrong and I couldn't put a my finger on it it was tone Final Fantasy sure we acted like goons and we interviewed Lena and it was there was great parts and weird weird parts right but and I'm sure",
      "start": 1846.88
    },
    {
      "text": "was wrong and I couldn't put a my finger on it it was tone Final Fantasy sure we acted like goons and we interviewed Lena and it was there was great parts and weird weird parts right but and I'm sure there were for the main comments I saw were like Ohan you guys did a great job that was a lot of fun DA they wasn't like you **** you guys all this other crap and I'm sure they're out there again well that's anything you do on the internet but what I'm saying is our tone was consistent from point A to point B on that thing whereas the tone for the Game Awards this year felt like it was all over the map was all of a sudden we're doing the award show we're honoring the developer we're honoring Kojima here's the Razer we're here's his great speech all right we're back down here with some rap group you've never heard of all right we're back yeah I mean see I think that it's it's a little unfair to say that because even the Final Fantasy thing all of a sudden we're promoting a car cuz it's",
      "start": 1889.8
    },
    {
      "text": "group you've never heard of all right we're back yeah I mean see I think that it's it's a little unfair to say that because even the Final Fantasy thing all of a sudden we're promoting a car cuz it's in the Kings glaive movie sure you know and it's like yeah we handled it goofy but that was their way of handling Goofy and I'm sure that we thought it was funny but I know for a fact Neo didn't think it was funny you know but that's the thing is it's like there's no these people and no matter who's on the stage no matter what they do there's no pleasing people you can take out these people yeah everybody has a different opinion that's what I'm saying is it's just like there is no perfect award show so I again just just to your point I'm sorry to interrupt just look at the VA relocation program which you brought up before I read the neoa threat on that oh my God it's like are you **** kidding me they're joking guys like no we're not nothing that like that will satiate you know the very",
      "start": 1925.16
    },
    {
      "text": "which you brought up before I read the neoa threat on that oh my God it's like are you **** kidding me they're joking guys like no we're not nothing that like that will satiate you know the very the specific crowd that will look for anything to **** about I get that so I understand yeah and it's it's it's just hard because these these guys that stand on stage all right I think one of the most astute comments that I've read uh in the last year and it was geared towards us um but it fits this totally is all right we're gaming personalities so we can critique games for them being games people are allowed to critique us for our personalities was like huh you're **** right yeah you know so the moment someone goes on stage and is presenting this can be critiqued as presenters and that's what they're doing and cool fair enough I get it I know that we didn't nail the fall fantasy thing we nailed it as much as we had to right I had a great time you had a good time we both stood by what",
      "start": 1961.8
    },
    {
      "text": "what they're doing and cool fair enough I get it I know that we didn't nail the fall fantasy thing we nailed it as much as we had to right I had a great time you had a good time we both stood by what we believed in we knew what we're doing we were doing a job and I feel like we did it well uh while holding on who we are you know in almost entire it was almost a joke how much they let us do whatever the **** we wanted to do um but that's the thing was with these game awards it it is Jeff Jeff was the one consistent tone throughout the whole thing yeah when other people come up and they're reading off a prompter and then some guy gives a rousing speech that's super emotional how you going to plan for that you know no and I'm not saying exactly I'm not saying what am I saying I guess I I I've been wondering why these game awards felt weird or different or a step backwards just a minor one again and I think it's the tone and how do you plan for that I think everybody",
      "start": 2008.72
    },
    {
      "text": "I guess I I I've been wondering why these game awards felt weird or different or a step backwards just a minor one again and I think it's the tone and how do you plan for that I think everybody has to take it seriously not to the point of there's no fun here no whenever we come out of a speech I'm going to act like they just told me President Kennedy was shot no I mean there's a balance to it though that was interesting and how to strike that is weird cuz that's the even with the musical performances I feel where like uh Imagine Dragons and Koji Kondo than Kondo sorry I'm so sorry uh serious and gaming but fun you know what I mean and Stephanie Jon serious gaming fun churches I feel not serious but game me of course like you're talking about and fun like there's a tone to the the problem here those then we're just getting into musical taste what's the difference between churches and rap groups you don't like rap you're not going to **** like this but but that's the problem is I think",
      "start": 2050.36
    },
    {
      "text": "those then we're just getting into musical taste what's the difference between churches and rap groups you don't like rap you're not going to **** like this but but that's the problem is I think the Doom section is the more apt thing to to talk about here and it's like okay cool Doom is comparable to Koji Kondo and sure um quiet's theme but the other stuff that's churches and if you either like churches or you don't you either like rap music or you don't if it would have been they PE breaks that they need to be pre-re if it would have been the rits I would have been fine AKA white jesus strange music represent Strange Music any closing words call no I just I hope Jeff uh made a lot of money I mean that all sincerity you know because because I I think it's a it's a it's a big lift and you're right you know like the the everything is open for criticism including us you know I'm criticized every day uh we all are but there are uh ways to go about that I never tried to be super",
      "start": 2097.24
    },
    {
      "text": "and you're right you know like the the everything is open for criticism including us you know I'm criticized every day uh we all are but there are uh ways to go about that I never tried to be super mean-spirited or or attack individuals and I think that's the big difference so if you have something to Del to Jeff you should just deliver it about the show and not about him personally that's that's my line and where I like lose my **** mind on people um but I agree with you I think I think it is important to be open to to the criticism and the and to the uh the concerns of those out there and um you know I think that they can better tailor the show to to be what it needs to be but I I you know other than that I I you know again knowing what you guys went through with Kinda Funny Live and Kinda Funny Live what we've gone through with E3s and I mean and GDC I mean these are like **** minuscule herculan for us let alone this that's what is a it is a lift and and and you do have",
      "start": 2138.96
    },
    {
      "text": "Kinda Funny Live what we've gone through with E3s and I mean and GDC I mean these are like **** minuscule herculan for us let alone this that's what is a it is a lift and and and you do have to appreciate that you do not respect what what folks behind a camera or or in production go through until you're you're in it you just don't and and whether or not you like it or not like I I certainly Lear have learned a great deal in the last 10 years about what goes into all this **** and especially in the last two years and you just do you do become a little Kinder about misses because of the work that they that goes into them and so that's important and to Colin's point like I hope Jeff made money but I more importantly hope Jeff keeps at it like I do think he is he is pushing the sled he is moving the needle he is doing something that if he didn't do it would be all right there's the IGN game award and this like they would all matter less because there were so many of them I just",
      "start": 2177.76
    },
    {
      "text": "he is moving the needle he is doing something that if he didn't do it would be all right there's the IGN game award and this like they would all matter less because there were so many of them I just want to put that on Colin's ring finger already come here let me Marry You wa Let Me Marry You yeah I think I think that's the thing you know he'll forever get **** for being the Mountain Dew Dorito guy but like because he did that I'm the lay guy from the rest of my life but because he was that guy he gets to do the game awards the way he wants to do and the way he believes in it and I think that that's what's important he obviously has a ton of people that support him the same that we have a ton of people supporting us and people can complain about how we do ads or people can complain about the content we do or this or that but it's the people that believe in us that allow us to do the things that we want and with everything it's a multi-step process where it's like all right we're",
      "start": 2214.44
    },
    {
      "text": "the content we do or this or that but it's the people that believe in us that allow us to do the things that we want and with everything it's a multi-step process where it's like all right we're doing this to be able to get the means to do that and it's not just money it's money it's um you know fan base it's Community it's trust it's all these things and like I can tell you for damn sure that you winning trending gamer meant so much to Kinda Funny that changed so much from a a business standpoint of being able to talk to advertisers and be like we have trending gamer of the year last year I will always be trending gamer of the year 2015 you just always phrase it that way or we could buy boogie yeah um but that helped us you know so it's like these game awards they mean stuff to people you know you walk into the to these any game developer that has one stuff and it's prominently displayed you know it's like these you watching it a lot of people could think that it's a joke but it's",
      "start": 2249.56
    },
    {
      "text": "you know you walk into the to these any game developer that has one stuff and it's prominently displayed you know it's like these you watching it a lot of people could think that it's a joke but it's not a joke to the people that it matters to so I really think he's doing a great job and I think that he needs to keep at it but",
      "start": 2290.52
    }
  ]
}
