{
  "id": 2243,
  "video_id": "VS7f2a3y1Mc",
  "show_name": "Reactions",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino", "Colin Moriarty"],
  "title": "Rogue One: A Star Wars Story FULL SPOILERS Review - Kinda Funny Reacts",
  "description": "We review the first Star Wars Story.\n\nhttp://www.casper.com/kindafunny\nThank you to Casper for supporting our channel! Get $50 off toward any mattress purchase by clicking the link above and using promo code “kindafunny.”\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1481880263,
  "duration": 2548,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to a Kinda Funny Reacts for Rogue One: A Star Wars Story. I'm one of your hosts, Greg Miller, alongside the producer, SL Seducer Nick Scarpino. I'm one with the force, the force is one with me. Greg, almost sure are you're one with the Heather Grey shirt over here. The pride of Long Island, Colin Moriarty, bring back Dengar sooner or later. And over there, wor the pure one, Tim Tim host. I thought was just Tim Gettys for now. Tim Gettys, uh so here's how it works. This is our review or spoilercast for Rogue One. The first part as always spoiler free. We're not going to spoil anything. We're going to talk about what we liked, if we liked it, if you should see it, that kind of thing. That'll be very short of course and then we'll get into full spoilers that hopefully if you watched the movie then you stick around you have some to discuss it with. And if you haven't watched the movie yet you can watch the rest of this video later. So Nick, yes start me off, did you like it? I liked it a lot.",
      "start": 0.12
    },
    {
      "text": "then you stick around you have some to discuss it with. And if you haven't watched the movie yet you can watch the rest of this video later. So Nick, yes start me off, did you like it? I liked it a lot. Yeah, I thought it was really well made. I thought there was a lot of great things happening in this. Um it's not that it's flaws but I think that ultimately in in the in the sort of um you know order of Star Wars movies this one's this one's ranking toward the top for me right now. Very interesting. I liked it. Um it wasn't until maybe halfway through or three quarters of the way where I was like oh **** this is really good. Yeah, this is getting really good. The first I maybe it was I we'll talk about it I'm sure maybe it was that I didn't know the characters and I I didn't have a Anchor Point to it but I was just like watching all right cool this is fun. But then it went got to they started paying off on the relationships they've been building I was like all right this I'm I'm in this is good. Uh yeah I",
      "start": 43.36
    },
    {
      "text": "just like watching all right cool this is fun. But then it went got to they started paying off on the relationships they've been building I was like all right this I'm I'm in this is good. Uh yeah I think it's great. Um I think that uh similar in some ways to episode 7 I I think that there's some issues with it and I actually think there's a couple of significant issues with this movie. Um but I still think overall it's a great movie and uh the fact that I like it so much with with uh these issues I think as a testament to it. I think every Star Wars fan obvious to see it and I I um I think it's good for reasons that I think um some people won't well we w'll talk about when we spoil it but I think there's some things about it um specifically with the way they build the Empire um in the movie that I think is actually super important to the rest of the movies um and I think was unintentionally so. Um yeah I think it's great. Tim, oh my God I think it's amazing. I think it has issues I think that",
      "start": 87.0
    },
    {
      "text": "I think is actually super important to the rest of the movies um and I think was unintentionally so. Um yeah I think it's great. Tim, oh my God I think it's amazing. I think it has issues I think that it is way too long and there's a lot of editing problems and there's a more than one scene that I can like point out and be like that should be cut and that's not good for a movie of this caliber because it really should just be like trim all the fat. Having said that are you **** kidding me this was great. It was so great and I I was telling Nick this a couple days ago I was like he asked me he was like do you think that we'll ever have something that makes you feel the magic that Force Awakens did and it's like that movie had so much hype going into it and so much just like expectations and we were just like man this is going to be amazing and then it was and it had that payoff of like oh my God these characters and these the sounds and these like things that we we love so much are are",
      "start": 125.0
    },
    {
      "text": "we were just like man this is going to be amazing and then it was and it had that payoff of like oh my God these characters and these the sounds and these like things that we we love so much are are here for the first time in so long in the right way and I was like I don't think you could ever match that I was so wrong. There's a point in this movie where things all of a sudden start paying off and I'm just like I'm I feel like a **** little kid you know this movie made me feel like a little kid. Do you think it's going back now this way better than Force Awakens? Yes okay Colin um it's different than the Force Awakens sure I I don't know that it's better like the Force Awakens is just a New Hope again um so I would say that Rogue One's probably a better movie but uh probably less resonant at the same time. M yeah I mean this this is always the fun thing cuz we do so many comic book things but this is one of the ones you know I don't have that attachment to Star Wars I like it fine I",
      "start": 166.84
    },
    {
      "text": "at the same time. M yeah I mean this this is always the fun thing cuz we do so many comic book things but this is one of the ones you know I don't have that attachment to Star Wars I like it fine I enjoy going to these movies with you guys are talking about it just don't know the nerdy **** like you. I thought Force Awakens was way better. Force Awakens I mean literally I was Greening that entire movie and when it ended like that was so much fun. Now granted Rogue One's not trying to be a fun movie and Rogue One's a great movie don't get me wrong but I like Force Awakens but do you think that's because we already had Forest wakens you know because you've already been exposed to that level of Star Wars in this Modern Age? I I don't know I think honestly it might have something to do with the fact that I I was never so into the original trilogy right so that like it's like okay cool and it's like all right we doing the Death Star this all right I know but then like when we get to like the",
      "start": 207.6
    },
    {
      "text": "fact that I I was never so into the original trilogy right so that like it's like okay cool and it's like all right we doing the Death Star this all right I know but then like when we get to like the battle scenes and everything is happening at the end with the characters and stuff I was like oh this is okay this is great. But yeah it just didn't get me like Force Awakens did. I thought force Force Awakens was brand new yeah yeah I mean that's my with the exception that it was episode it was New Hope sure but we hadn't seen something on that level you know in a very long time and and and and to this movie's credit it does a lot a lot of things right in my opinion oh yeah it really shows up shows us uh sort of a part of this world that we haven't seen before it's this is a darker way darker movie this is not um to your earlier Point like this is not all funny games you're not going to be smiling through most of this in fact a lot of it's kind of really kind of **** up I mean what I",
      "start": 241.2
    },
    {
      "text": "movie this is not um to your earlier Point like this is not all funny games you're not going to be smiling through most of this in fact a lot of it's kind of really kind of **** up I mean what I think is awesome is it makes you think about the the ones that we love in a different life yeah it definitely does like it it the good guys aren't really good guys and the bad guys I the bad guys the the lines are blur like the good guys are doing bad things you know I like that I really like that and like I I want to be careful without spoiling anything sure they did such a good job of like taking the stuff that we know and dirtying it up a little bit yeah what I thought was interesting and I've seen it resonated uh and responded to online already is the fact that I really want to go watch episode 4 now you know what I mean like now that I'm done I'm like oh I want to see that with that this lens on there and know a bit more about I just bought the all six of them unfortunately I had to buy",
      "start": 281.8
    },
    {
      "text": "4 now you know what I mean like now that I'm done I'm like oh I want to see that with that this lens on there and know a bit more about I just bought the all six of them unfortunately I had to buy one to 3 to get the good price but they're on my they're on my P they're on my PS4 if you want to watch them okay thank you very much that's good before moving into spoilers I I want to say and I said this on call Greg live a couple days ago but like this movie is what everyone's been asking for forever where it's like oh the blur trailers for The it's fan service the movie and that's for better and worse obviously but I think uh overall it's for the better and there's moments in this movie that I'm like they **** did it yeah they **** did it you had said that you know we talked about this when you saw and you came with call Greg live but you didn't say anything spoiler but you said the whole blur trailer thing and I and I I kind of forgotten that you had said that until the moment at",
      "start": 319.4
    },
    {
      "text": "when you saw and you came with call Greg live but you didn't say anything spoiler but you said the whole blur trailer thing and I and I I kind of forgotten that you had said that until the moment at the end there when I was like oh that's like pulled right from one of those blur trailers and this is **** awesome this is tot great before we go spoilers one last point was I think that this this to me proves a very very very important thing right is that you can make a Star Wars movie and skate that line of like PG-13 and R like there it was it wasn't I don't think it was anywhere close to R but I think you can really start treating like if there's one thing I've learned is that you could treat Star Wars take the **** Kitty gloves off and let's keep pushing that envelope because it's not like we need it to be dark like this sometimes it can't always be poppy and happy and go lucky well that's the what's exciting about them what they're doing right I always talk about with video games",
      "start": 359.12
    },
    {
      "text": "like we need it to be dark like this sometimes it can't always be poppy and happy and go lucky well that's the what's exciting about them what they're doing right I always talk about with video games pulling the Silly Putty in different directions so you get different movies like all these Star Wars stories I think are going to be markedly different hopefully the main Saga story is like I hopefully the second main Saga story is different as well a little a little different as well sure okay so spoilers then oh my God what do you want to spoil to everything holy **** I mean there was the thing for me is like the movie had very uh Polar Opposites for me as far as like things that I thought were **** amazing and things that I'm like I could have done without that right could have done without a lot of uh the facial reconstruction stuff that they did with Tarkin yep uh didn't didn't really care for that didn't think it really played it never really plays it didn't it didn't do well in",
      "start": 395.88
    },
    {
      "text": "a lot of uh the facial reconstruction stuff that they did with Tarkin yep uh didn't didn't really care for that didn't think it really played it never really plays it didn't it didn't do well in Tron in fact the only movie that I can remember doing well in is Benjamin Button oh say Fast and Furious well that didn't look good in that either unfortunately because they didn't to work with it played enough because you were like I'm crying anyway because this is very emotional moment when he when you you first walk in and he's got his back to you and you see him in the window I was like oh they're going to use like little camera tricks like that to use him and not draw out the The Uncanny Valley and and he turns around immediately and I was like okay maybe we're to stay wide oh we're getting close we're in it's because you see the animations I I there there's a moment at the end that I I almost still don't even want to spoil but it like that I feel like they they handled it uh so much",
      "start": 433.92
    },
    {
      "text": "close we're in it's because you see the animations I I there there's a moment at the end that I I almost still don't even want to spoil but it like that I feel like they they handled it uh so much better like it's that that was just like it was enough and it was so fanservicey and whatever it's like okay cool there wasn't animations going on with Tarkin they just kept saying my problem with the highs and lows I thought Tarin one of the best things about the movie except for the facial animation stuff like all of his lines **** awesome his character was **** awesome his speech that he gave to um the other Imperial dude Krennic **** awesome but I just wish we never didn't see his face as much yeah I feel like some of that a lot of there's there was quite a few things thrown in for fan service which some of them I think played and some of them I just don't think don't didn't play very well uh the the overuse of Tarkin I thought was a little bit too fanservicey we didn't need that",
      "start": 472.16
    },
    {
      "text": "service which some of them I think played and some of them I just don't think don't didn't play very well uh the the overuse of Tarkin I thought was a little bit too fanservicey we didn't need that much to tell the story that we were telling right especially since Tarkin and then you also had Vader right and ultimately Vader trumps tar doesn't really matter um there was that another thing that I didn't particularly care for was the score I did not understand why we didn't use the main Star Wars theme I just don't get it and I I know why it's because they wanted to set the movie apart they wanted it to feel like a Star Wars story not a Star Wars main Saga film I get that but I just I can't it just there's some part of my brain that will not allow a Star Wars logo or like to see the rug One logo and not be a main theme that I know and love from John Williams see the thing for me is I I agree with you to an extent where I'm like I would have been okay with it if it was a theme that I",
      "start": 510.56
    },
    {
      "text": "One logo and not be a main theme that I know and love from John Williams see the thing for me is I I agree with you to an extent where I'm like I would have been okay with it if it was a theme that I felt was awesome but this wasn't like the score the score Felt Like a Star Wars video game score where was someone imitating what Star Wars should be and it's like it's like what a cartoon tries to do a Star Wars score but they're like we can't do the Star Wars score kind of do it that's kind of what it sound like yeah and so like I I was telling Kevin this when we we first saw like the score did feel off to me but then when it felt right it felt real parts of it were parts of it were great there was just the part where I'm like I just want the goddamn Star Wars theme like I don't understand like the main thing like why isn't it why aren't we having that triumphant moment and at Parts at Parts it felt almost comical uh how the music kind of align with the visuals and I was like ah all",
      "start": 547.88
    },
    {
      "text": "like the main thing like why isn't it why aren't we having that triumphant moment and at Parts at Parts it felt almost comical uh how the music kind of align with the visuals and I was like ah all right then we got to another awesome part I'm like **** him that's cool yeah but then in in terms of what you're saying about the whole it trying to sear itself from the main Saga films I like that we still got the a long time ago a galaxy far far away and that **** hard cut that nobody **** like every you know you expect the title scroll and stuff even though we knew going in that it wasn't going to be there I liked how they did that cuz it was so jarring and it it it made you feel like oh **** I don't like this but then immediately I'm like we're not getting Circle wipes we're not getting the you know the wipe Transitions and whenever we go to a new planet like the text comes up I'm like this is an action movie like this is not a type of Star Wars movie we got but did it work cuz",
      "start": 583.64
    },
    {
      "text": "the you know the wipe Transitions and whenever we go to a new planet like the text comes up I'm like this is an action movie like this is not a type of Star Wars movie we got but did it work cuz it was that thing where even me as a casual Star Wars viewer was just like the fact that it isn't I couldn't even I wouldn't even tell you about it was Circle wipes and that kind of **** but like with the the sound effect the text on screen and the hard Cuts I was like this feels weird it does feel like not a knockoff in the sense of that but like an imitation of what Star Wars is but I understand they want to do him different and make it different if that makes sense it felt like a close like like a close cousin like you know what I mean where it's not your brother it's not your sister it's just a cousin kind of looks like you comes from the same blood still but you can still have sex though yeah okay is it okay to think yeah um so those are some of the things that for me just didn't",
      "start": 618.72
    },
    {
      "text": "just a cousin kind of looks like you comes from the same blood still but you can still have sex though yeah okay is it okay to think yeah um so those are some of the things that for me just didn't necessarily mesh but again it's because I think they were purposely trying to set this aside from the Star Wars Universe go into the fan service you did like then cuz I mean of course old butt mouth and **** up nose guy they're back I know their arms get loed off eventually so that yeah I mean that was that was another nod I'm like all right that's fine I can deal with that that was I like that where I was like that's enough yeah like that's cool don't no more R don't know why they were in it no it doesn't make sense well it makes sense but it should have been implied by the ending you didn't need to see them like you know they're there so like uh like that was and Vader I think needed to be in none of it except for the end that was that was the other thing I think was a huge mistake like",
      "start": 656.24
    },
    {
      "text": "need to see them like you know they're there so like uh like that was and Vader I think needed to be in none of it except for the end that was that was the other thing I think was a huge mistake like the the the bath Tarkin well the back seeing him in the back the tank seeing in the back of the tank is interesting I was confused why Emperor's guards were there but the uh but nonetheless like seeing that was was that's how he gets out of the thing they they're not put down their giant like but but the hes and come over but the thing that the thing they they set it up so perfectly and I think they **** it up in in a in a way with if the first mention of Vader and the first and you never saw him before was tarkin's like Vader's going to take care of the fleet that was like one of his lines he's like I'm like that would have been awesome because then you're like like oh like Vader is going to appear and then it just ties it into a New Hope and that would have been it and that would have",
      "start": 693.16
    },
    {
      "text": "he's like I'm like that would have been awesome because then you're like like oh like Vader is going to appear and then it just ties it into a New Hope and that would have been it and that would have been way better than what what what we had like like period so like that was one of the things where I was like you don't like Vader actually served almost no plot purpose in in the movie at all anyway until the end so like there was no reason for him to be in it and that was that was one of the things that I was disappointed about to towards the things you guys were talking about with Tarkin I agree with you when I saw tarkin's reflection in one like that's awesome Tarkin is an essential character actually in this story because he's so important on the Death Star and A New Hope and his leadership in in the Empire um but like they didn't need to show him that much either and I hate that on C on cany Valley **** and I **** hated that they did that with Leia too like they they like it",
      "start": 731.36
    },
    {
      "text": "in in the Empire um but like they didn't need to show him that much either and I hate that on C on cany Valley **** and I **** hated that they did that with Leia too like they they like it didn't look right and they should have just showed her from behind you know that's all it's just she could have literally turned and like you know like Tarkin too far Vader too far Leia too far those were like one some of the things where I'm like all right guys like we don't need to have all this fancy facial reconstruction **** like it's implied and that's great but people are stupid and that's the problem that's the problem that really is I did pop for the Leia I liked Leia I thought it was cool it got me but uh at the same time you have to beat people over the head sometimes I assume that you know there's not that many like think of new audiences that don't really kind of understand what's going on probably even haven't seen the original trilogy and this is their first time seeing it the",
      "start": 764.36
    },
    {
      "text": "know there's not that many like think of new audiences that don't really kind of understand what's going on probably even haven't seen the original trilogy and this is their first time seeing it the you know this their exposure to this this story particularly um and they're now they're going to they're going to want to go watch A New Hope right kind of makes sense but they have to you have to kind of like really kind of put it out there for him subtlety doesn't really doesn't really play in mod audience when when they were running around the rebel base that and before 3PO and all that stuff that was what I was doing is again as just a super casual guy I was looking in the background because I thought it would have been cool to have R2D2 you know Roll by there with 3PO or something or and I you know I again I I knew the time didn't match up but eventually have Leia or anybody back there that I would recognized it was just a redundant C **** was Porkins like red leader is in it like",
      "start": 801.96
    },
    {
      "text": "I you know I again I I knew the time didn't match up but eventually have Leia or anybody back there that I would recognized it was just a redundant C **** was Porkins like red leader is in it like like I someone tweeted at me saying that that uh Organa makes a statement that seems to reference wedge I have to go back and listen to that because I don't I don't remember that so it was cool there was like little cool nods or whatever but it seemed R2D2 and C3PO in particular seemed redundant because of the end so like because they're there they're on the corillian Corvette so we know they're there we don't need to see them plus we let's be honest we've seen them already we've already seen him in in uh episode 7 we saw him right so not you know there's not that it's cool it's fun but it's not hit like wow hits you right in the **** heartstrings um Cameo it just I'm kind of with you on that it got me I liked it it was okay it's cool it's cool but it like it's one of those things where",
      "start": 834.88
    },
    {
      "text": "hit like wow hits you right in the **** heartstrings um Cameo it just I'm kind of with you on that it got me I liked it it was okay it's cool it's cool but it like it's one of those things where the um do really serve the plot because one of the things that I think that this and that was I was referencing in the spoiler free section one of the things I think this movie does that's very important is it gives actual scale for the first time to the Empire the the scale of the Empire is always again implied it's an implication you never see it like we know that they have reach but you don't know where they're like we know corant in this movie I caught that the second time watching it the first time I missed it yeah there was like a during during the second flashback scene when she's having a dream and uh her her dad puts her to bed they're on Corson like um yeah reminded me of the prequels um the I think that that's a really",
      "start": 875.68
    },
    {
      "text": "a during during the second flashback scene when she's having a dream and uh her her dad puts her to bed they're on Corson like um yeah reminded me of the prequels um the I think that that's a really important thing because it it it can it can uh seep into the other movies especially four five and six we kind of get actually when you think about Yavin 4 and all these places the Rebellion actually looks like it has a much greater scale per capita or whatever than the Empire because we never see how the **** how anything works for them and in this movie you see a lot of **** about their infrastructure which I think is really cool and I know that's like a very nerdy Star Wars thing but that's actually like my major takeaway from this is like they actually have incredible power and incredible might and it's no longer implied you can see it and they they have an entire planet for their archives with a shield around it they have like all they have a planet where they're just they're just",
      "start": 910.04
    },
    {
      "text": "might and it's no longer implied you can see it and they they have an entire planet for their archives with a shield around it they have like all they have a planet where they're just they're just refining materials they have a planet where and I'm like that's cool because now it's not like they just show up on H they just show up on Endor they just like right this is where they are and I think that that was pretty neat and I and I like that that was one of the major things about this movie that I think is really cool it it built the lore in a really cool way and to go back to what you're saying about why did Vader have the the Imperial guards I liked that on the the Jetta Planet when it's just like all right cool this is the Jedi kind of holy space or whatever that whole thing added so much layers that we didn't even know like we've gotten so much from the prequels about the Jedi and the Sith and all this stuff but metan and in the medoran um but with with this it was cool because",
      "start": 952.28
    },
    {
      "text": "much layers that we didn't even know like we've gotten so much from the prequels about the Jedi and the Sith and all this stuff but metan and in the medoran um but with with this it was cool because the seeing all the different aliens and of course it's Star Wars and now we're like trained to look around and look at all the different guys there was like uh a bunch of Imperial Guard looking dudes but in almost journey ask outfits did you do you see what I'm talking about and I like that because it kind of goes back to it's like well at one time the Jedi at like before the empire was formed like those CS would have been for the Jedi you know so they're there guarding the Jedi like like place and there's like that weird transition period And it's like until the emperor is really the emperor and an Empire like that I like that there's that that transition kind of going through and just seeing that that planet for the first time it's like it was cool cuz it wasn't tattooing you know it's",
      "start": 989.8
    },
    {
      "text": "and an Empire like that I like that there's that that transition kind of going through and just seeing that that planet for the first time it's like it was cool cuz it wasn't tattooing you know it's not just another uh desert Planet it's this that City we were in had a real purpose and it's gone which is cool yeah it is it was it was very neat I I I I agree with you building here was important and I agree with you that because A New Hope is so um um so contained in a way where it's like tattooing uh some space stuff and death star I mean that's basically kind of it and so like you don't and mosle is really where you get the uh character with the character and like the culture right like the grit and the dirtiness and you get a little bit from Uncle Owen and amaru and their moisture farm and all that but you don't really see it and they spend a lot of time like you see people cooking on the street you see people like it's it's kind of neat like you you just throw all of that now that",
      "start": 1029.28
    },
    {
      "text": "and all that but you don't really see it and they spend a lot of time like you see people cooking on the street you see people like it's it's kind of neat like you you just throw all of that now that that knowledge into the into the into the trilogy and I actually think it helps the trilogy not that the trilogy really needs help and and that's the best thing as I was telling Nick on the drive over here I think this movie made the good movies better uh forever it was just like all right New Hope I'll give you it but why the **** would the Death Star have that flaw here's your answer in a really cool way that actually makes a lot of sense makes a lot of sense that that's what I thought was one of the most genius parts of the actual writing right I loved that it was a little bit of a surprise to me how it ended right that we ending right as as New Hope kind of picks up that was I for the biggest surprise was and it wasn't it should be obvious right it should be obvious the whole movie",
      "start": 1069.36
    },
    {
      "text": "to me how it ended right that we ending right as as New Hope kind of picks up that was I for the biggest surprise was and it wasn't it should be obvious right it should be obvious the whole movie is based on this concept but it took me by surprise any nonetheless was that he put the **** design flaw in there on purpose it was like the only thing well not the only thing but one of the biggest glaring problems in a new hope you're like why the **** would they build this giant thing with this with a hole right in the middle that goes right to the the Death Star **** works from mind lightsaber crystals are you **** kidding me blast is lightsabers yeah that was pretty awesome Yes um but oh I'm sorry goad go go for I was just going to say the the ironic thing about this and this is what I was talking about with Kevin on the way over was that it solves plot holes in the New Hope or like kind of makes it a little more believable but there are significant plot holes now in Rogue one as",
      "start": 1105.24
    },
    {
      "text": "I was talking about with Kevin on the way over was that it solves plot holes in the New Hope or like kind of makes it a little more believable but there are significant plot holes now in Rogue one as as it stands itself because one of the things I was telling not plot holes but just weirdness where I'm like why would the chief science officer or the the Chief Architect of the Death Star reach out in some sort of Prin leay like to Obi-Wan Kenobi message and give them none of the information like the the entire movie never needed to happen like he could have just been like I don't might have the schematics but this is everything you guys need to know you know instead he us his three minutes inste leave this letter telling you how to get it when I could just say I've built in this thing shoot it down the hole it makes no sense and that's and that was like one of my things where I'm like oh this is really gnawing at me because I'm glad that it makes no sense in the sense because then we",
      "start": 1145.48
    },
    {
      "text": "it down the hole it makes no sense and that's and that was like one of my things where I'm like oh this is really gnawing at me because I'm glad that it makes no sense in the sense because then we get this great movie which I think is a testament how good the movie is because it still makes sense but it could have been 15 minutes long because they literally could have delivered that message and given the entire all the information it doesn't make any sense why he didn't give all the information there and Kevin was saying and maybe it's true that like they don't trust him and they doesn't have access to all the plans but he knows how it works so he could just describe it it's not needed it's not that's going to be a hard thing Kevin screaming use your microphone big dog come on Bow Wow Wow it is a mooniz base so it's not like you can just be like it's in the top take a left at the the gr thing this one like trench that will take you down I mean it's it's very spe spefic like they",
      "start": 1184.44
    },
    {
      "text": "Wow it is a mooniz base so it's not like you can just be like it's in the top take a left at the the gr thing this one like trench that will take you down I mean it's it's very spe spefic like they needed I think that they needed the plans and I don't think it was as easy as him being like hey here's the hard drive with my plans take it you know I guess I mean that the other thing too is the pilot actually physically delivered his message so he could have physically delivered but that's the thing like I don't think that sorry let me just finish this last thought I don't think that like right now someone can get plans for like even a battleship that like exists now and be like oh here here it is to someone you know that was the whole point of the planet right like the the planet in the place where they store it all they had they had to get the giant communication dish to able to send as much data they made they made a big they made a big point about how the how big the files were to",
      "start": 1217.6
    },
    {
      "text": "where they store it all they had they had to get the giant communication dish to able to send as much data they made they made a big they made a big point about how the how big the files were to transfer and stuff I mean I think really make sense that stuff I mean that's the thing though like you know you start if you start really scrutinizing any Star Wars movies you're going to start getting to those kind of little leaps and logic so you just kind of have to that's why we have to suspend dis sure because you could to your to the credit of Kevin and other people Leia does the same thing with Obi-Wan so like like you know so it's not like literally the same thing like she could have literally told him way more and I know R was all **** up but they did fix him and then and and it's all like so like she's like everyone's a little vague in this galaxy um where they needed to be but the the the problem um then kind of uh transcends because uh the Empire is aware of the flaw and still",
      "start": 1256.08
    },
    {
      "text": "like so like she's like everyone's a little vague in this galaxy um where they needed to be but the the the problem um then kind of uh transcends because uh the Empire is aware of the flaw and still deploys the weapon and that was and that was one of the the major things too they know it's it's not a secret they know that Tarkin knows that the Death Star has a fatal flaw and the emperor knows yes like they're they're openly talking about it aren't they not not with Tarkin though just kic no cuz I think he I don't think they know and he was like we have to figure out what's going on with this like but I guess no she tells him right or he tells him yeah I krennic never I don't think hiding it because K didn't want taret to know cuz krennic wanted credit for the Death Star that's why he went to go see Vader I don't think he knew there was a flaw did he krennic yeah yeah no he knew that there was a flaw he knew that uh jy's dad was sending out messages which he kind of I guess I got to go",
      "start": 1294.16
    },
    {
      "text": "to go see Vader I don't think he knew there was a flaw did he krennic yeah yeah no he knew that there was a flaw he knew that uh jy's dad was sending out messages which he kind of I guess I got to go back I don't think he knew there was a flaw he just knew that there was messages sent out he didn't know what they were so that's what his whole purpose of going back to that planet with the data on it was to figure that's why he was like go through everything we have to figure out what he sent out right but at the very least I guess it could be narrowed down more at the very least that they knew that the plans were out or something was transmitted about the Death Star and they just wanly uses use it anyway it just people that know that blew up though they were all and they also just assumed that it was they're like great everyone has the plans this so wait a second then indr as we try to plug or answer Colin's questions follow me on this then yeah is he is he sending the coded messages",
      "start": 1337.56
    },
    {
      "text": "that it was they're like great everyone has the plans this so wait a second then indr as we try to plug or answer Colin's questions follow me on this then yeah is he is he sending the coded messages or not even coded but like do all this stuff like leaving a bread Trail because the guy in the white coat who I can't remember his name ever CR CR I'm sorry thanks for helping me out CR is he goes there and he knows he's going to look through all the messages so even if he finds the message if the message was hey there's a **** hole on the top and take a left and you'll find it then they'd all know so he's sending coded messages so that even if they found the message they wouldn't have enough information to figure out what it is to stop it that makes sense that that does make more sense that explains that and I feel like I'm also focusing on the negative because there's a lot to or not the negative because I don't really even think they're negative it's these are necessary things for the",
      "start": 1371.56
    },
    {
      "text": "explains that and I feel like I'm also focusing on the negative because there's a lot to or not the negative because I don't really even think they're negative it's these are necessary things for the story to even work um or to happen yeah you have to have those but I think one of the strong points of the movie other aside from like you don't want to go too far down that rabbit hole because at some point You' like why didn't he just design it so that the first time he used it it **** blew up you know I mean that's actually he goes in and turns great point I don't know yeah like like like he's so that he designed this **** giant thing and he just like just designs the first time they fire it up it just blows up like d Kevin says there's other Engineers working on it that they they would but he was the he was the lead engineer though you get the point that all the other Engineers were like subjugated as well like you know they",
      "start": 1412.04
    },
    {
      "text": "but he was the he was the lead engineer though you get the point that all the other Engineers were like subjugated as well like you know they didn't look like they were there on their own accord you know what I mean sure but you say one thing they go they go **** squeal on you but to Nick's that's a really interesting point and to ni and well to Nick's point they but they wouldn't have known about the flaw that he only engineered that's the thing he he was developing it for years and like incorporating into it so deeply that like it's too trick everyone yeah it's a moood point really at the end of the day if if he done that we don't have a movie we don't get a fun movie you know we get watching for two hours the cast is great I don't mean the acting I don't know I I I don't speak to that too well but I I I liked the characters and uh I like that they all die all **** die in the most action movie way possible you cared about all of them my my thing is when when I'm really",
      "start": 1445.92
    },
    {
      "text": "to that too well but I I I liked the characters and uh I like that they all die all **** die in the most action movie way possible you cared about all of them my my thing is when when I'm really looking at the movie and especially not I've seen it twice the second half of the movie is what makes it amazing the first half is kind of weak and there's a lot of **** the the pilot mind reading alien scene moner didn't make any sense there's a lot of random stuff it's like okay we've seen 13 planets uh in the first this movie and I'm like this is a lot to take in but that's what makes the second half worth it you only cared about those characters because you saw them in all these weird ass situations growing together and I'm like that's what a movie is this was a Standalone movie that is way better if you've seen a new hope I think uh you know think that's the thing too they could have cut a little bit of it down but I think it really did build toward that second half and that second",
      "start": 1484.24
    },
    {
      "text": "way better if you've seen a new hope I think uh you know think that's the thing too they could have cut a little bit of it down but I think it really did build toward that second half and that second half second is awesome really fun like all this **** that was in the trailer promised was **** rad and here's my favorite thing about this movie that makes me love it more than pretty much any movie I've seen this year or ever is where was 70% of the stuff we've seen in the trailer not in this movie what will you become yeah yeah yeah you know the Tie Fighter coming up behind her her and Death Star looking thing none of it in it all the trailers wore was **** footage da the movie thank you give me the tone of what the movie is don't give it away so awesome yeah I mean for me that this is part of the fun of of watching this movie was the cast right I think they they had a great cast with this I think that um uh Alan Tudyk I think stole the show okay the robot hilarious I think he did",
      "start": 1529.0
    },
    {
      "text": "part of the fun of of watching this movie was the cast right I think they they had a great cast with this I think that um uh Alan Tudyk I think stole the show okay the robot hilarious I think he did a great job and you can tell some of some of that was probably improved so kudos to him cuz that the right amount of Comedy there was was just mixed in with that in the two leagues die Diego and is it Felicity Jones um they were great they had good chemistry together and it was it was believable that they they had a genuine affection for each other at the end knowing that I mean the second they Ste put on that planet they were going to die they're going to die so they knew that and like you see it in their eyes and they just it it it worked that and the pilot man I thought the pilot was such a a cool character just I mean besides the Mind wiping **** like I just think like the way that he acted like it was so genuine of him just being like **** man like I I defected and I'm really",
      "start": 1567.36
    },
    {
      "text": "a a cool character just I mean besides the Mind wiping **** like I just think like the way that he acted like it was so genuine of him just being like **** man like I I defected and I'm really concerned about everything and I fix this stuff and he was like the Donatello type which is cool and my favorite was the **** two dudes man the the blind Force guy and the Machine Gun **** the gay couple the first the gay couple in Star Wars I mean yeah they definitely loved each other I don't know if they were gay I I think that that it was it seems like that could that could be a thing I mean I I loved those characters and I I liked we see no lightsaber except for Vader using his or whatever and there no obviously cuz they're all pretty much **** dead at this point they still work in the magic of the force and what it means to Star Wars and I actually would have been fine without any references to the force and any lightsabers and all that kind of stuff because I think that that's",
      "start": 1608.08
    },
    {
      "text": "magic of the force and what it means to Star Wars and I actually would have been fine without any references to the force and any lightsabers and all that kind of stuff because I think that that's the natural reality in quotes of the Galaxy at that point like it's not one of these like so everyone saying May the force be with you like what the hell are you guys talking about like that really didn't I I don't did you guys care about this until like Luke shows up Luke and obiwan stuffes I think that like that they built that into the movie where it was these religious zeits that were kind of like really into it and I think that them all being around each other is what was really influencing her and it's also like that her parents who did grow up in uh the other timeline like the the Jedi and all the force that was real to them so they they would teach her that but I think that her being in the ship on the way to the final battle and saying May the force be with you and everyone kind of",
      "start": 1652.2
    },
    {
      "text": "all the force that was real to them so they they would teach her that but I think that her being in the ship on the way to the final battle and saying May the force be with you and everyone kind of clapping and laughing even in the ship that was cool like that was them being like all right yeah whatever it it is neat the other thing that I want to point out before I forget because this just came to my mind was we were talking about how The Empire is given uh like like texture in this in this movie and like we see you know as I was saying when we when we analyzed the first trailer like it was cool like the obvious um dissonance between like adats on a tropical planet and all those kinds of things like it's neat and and I like that this also adds texture to the Rebellion that they're not cohesive at all and they're not cohesive When A New Hope starts that's a that's a really important point because by the time they Retreat to ho and Empire they're not that far removed from almost not",
      "start": 1693.48
    },
    {
      "text": "cohesive at all and they're not cohesive When A New Hope starts that's a that's a really important point because by the time they Retreat to ho and Empire they're not that far removed from almost not from almost fracturing and actually giving up and we don't know that in a New Hope like so this again gives a lot of weight to now the Rebellion um and their movement because M mothma couldn't even keep them together until the until literally the day before the the the Death Star plans are stolen right so that is also really cool I think that that's what's so important about this movie I think what's most important about this movie is just again how it builds into these things and gives you know it's what Lucas tried to do I think with the prequels to give some sort of governmental structure to what was going on and I think he succeeded actually in some ways I think that's some of the more interesting things that didn't play well like the Trade Federation trade roots and all I mean like",
      "start": 1731.96
    },
    {
      "text": "to what was going on and I think he succeeded actually in some ways I think that's some of the more interesting things that didn't play well like the Trade Federation trade roots and all I mean like that's not interesting stuff but it was trying to say like this is political like this is a political thing there's like and that showed us for the first time that like man mothma and all these people have massive disagreements B Orana going back to alderan where he's about he's days away from being killed the but we you know it's that's important stuff too I think that when I walk away from Rogan and really marinate and think about it and pull things away from it it's always going to be the additive nature of giving context to everything else as opposed to what is in the movie itself because these are all people that are nameless Heroes like they're not maybe they'll work it into eight or nine something where there're something named after them or something but these are people that just",
      "start": 1773.16
    },
    {
      "text": "these are all people that are nameless Heroes like they're not maybe they'll work it into eight or nine something where there're something named after them or something but these are people that just died you know doing something that was very necessary um and it was cool to see the Rebellion on the on the on the ropes they were about to they were about to lose what's the line in A New Hope when they talk about the plans and she said says or somebody says like many many bothans to die to give us information that's what's a **** Botham Jedi that's in that's in Return of the Jedi for the second death star Death Star what uh okay I got confused when we talked about this a long time ago I thought that was what this was the and again we talking about plot holes it's like it took them decades to make this and then it took them like a couple years a couple years to make the second one and it doesn't really make any sense either but building them back the it's just it's it's so the movie's",
      "start": 1808.68
    },
    {
      "text": "to make this and then it took them like a couple years a couple years to make the second one and it doesn't really make any sense either but building them back the it's just it's it's so the movie's cool I mean that's like kind of what I want like take away from it is like yeah there are all these issues but it's **** cool and these characters are great and I'm glad I saw it and I really liked it and it gave me I agree with you I could have I think it was a mistake not to open with a crawl I don't like that they're not doing that with these movies and all that kind of thing about the crawl is what would the crawl be because if you look I read the after watching this movie I read the crawl of the New Hope again I'm like oh the crawl of the New Hope is literally this movie word for word like the whole Civil War I mean that's the the crawl was always meant to kind of set up a little bit of the stuff that they didn't NE need to show in the movie itself right so to Colin's earlier point",
      "start": 1844.64
    },
    {
      "text": "the whole Civil War I mean that's the the crawl was always meant to kind of set up a little bit of the stuff that they didn't NE need to show in the movie itself right so to Colin's earlier point I I I could have seen a crawl and I could have seen it saying something along lines of like the Rebellion is fractured right all these all these dissidents are coming together and trying to figure out how to beat this Empire that is growing in power because remember before this there's still a senate in this movie there's still a group of people who are trying to fight against the the the Rebellion right um I guess it's the same with New Hope but hope but there's stuff I could have used in there well the thing is I I think that there was a crawl but instead of being a crawl it was the flashback scene of her being a kid like that's CW would have been sure I I agree I mean the craw could have been as as simple as like the Empire is on the verge of a great scientific achievement blah blah",
      "start": 1880.68
    },
    {
      "text": "scene of her being a kid like that's CW would have been sure I I agree I mean the crawl could have been as as simple as like the Empire is on the verge of a great scientific achievement blah blah blah blah blah like their you know the Rebellion is scattered Mon Mothma can't hold is a hard time holding them together it does it just it's not necessary for the plot but the crawls aren't really ever necessary for the pl actually if you read episode one crawl it's actually what the **** are you even talking about you know so like but it's it's just the way Star Wars begins yeah but I understand it's a like you said we said a Star Wars story you know and are we going to get like the Han Solo Lando and Buddy movie is that going to have a crawl no so I I I understand doesn't and I think my my biggest thing is this movie sued over this movie succeeded at what it tried to be and what it needed to be and all of those things and again it has it has flaws it has many flaws but at the end of the",
      "start": 1915.12
    },
    {
      "text": "thing is this movie sued over this movie succeeded at what it tried to be and what it needed to be and all of those things and again it has it has flaws it has many flaws but at the end of the day this was an awesome action movie that developed characters that we didn't know before that we loved by the end of the movie and all of their deaths resonated in a way that I'm like **** I wanted more of this character that's great and I can say that about all of them and that's super cool because that's not necessarily always true like the the one thing the prequels did was there was some characters that I'm like oh man Qui-Gon was pretty cool j you know then it's been Jar Jar yeah Jar that Jar Jar I mean to the like Jimmy Smith's being in it was B Oran is a direct lineage to the prequels and that's an interesting it's not only corant like Timothy Zan kind of **** like that is actually a man that was in the prequels and I think they're trying to subtly pay homage to movies they know",
      "start": 1951.72
    },
    {
      "text": "and that's an interesting it's not only corant like Timothy Zahn kind of **** like that is actually a man that was in the prequels and I think they're trying to subtly pay homage to movies they know their audience doesn't like and and saying like they actually matter and maybe it'll have like people be able to revise the way they look at them moving forward I'll never be able to revise the way I look at them moving forward but but uh I'm sure like there seems to be a revisionist history actually even going on with the prequels now so do people like them yeah you could see a lot of like a lot of people stop no mean got a good Star Wars prequel let's just be happy with it all right I agree so well and it's funny cuz when we did the swoop coming in and there was all the lava I was like oh man he's got the high ground and then it was Vader I was like oh V coming back to where he got me it brought it brought me back to like oh I **** hate so much the choke line it's like dude no man",
      "start": 1991.56
    },
    {
      "text": "man he's got the high ground and then it was Vader I was like oh V coming back to where he got me it brought it brought me back to like oh I **** hate so much the choke line it's like dude no man like that's that's way too fan servy in in a in a cheap bad way whereas the the Vader SC I agree that if they it would been awesome to not have Vader at all until the moment light I love the B the the bat scene I thought that that was cool it no no it was cool I'm just saying that would have been a really awesome pop to end it on I also don't think it takes away from the end scene I think the end scene the end Vader scene is all I mean he **** comes in turns on the lightsaber throws the guy on the ceiling someone shoot like blasts at him and he like reflects the blast and shoots him back takes all their weapons slices his **** it's like that is again that yeah that was the first time in a long time I've seen a scene like that where I'm like that reminded me of the first time I watched",
      "start": 2028.72
    },
    {
      "text": "all their weapons slices his **** it's like that is again that yeah that was the first time in a long time I've seen a scene like that where I'm like that reminded me of the first time I watched Terminator where you see this Unstoppable **** monster and you know and you know you know that everyone on that ship is dead cuz we know cuz we literally know how that **** **** you know we know what happens with the with the cruiser that that launches from it um that was **** awesome it was really cool was a massive and how to direct the scene you felt it too like with the with the mention of the corillian crafts and stuff like that with uh the Admiral acar guy I don't I don't know that particular uh name but the um where I was like it became clear that it was the same fight and that was and they were like first of all the uh the Star Destroyer showing up as they're jumping is really awesome which was really cool and then um yeah Vader doing all those kinds of things because Vader's",
      "start": 2072.88
    },
    {
      "text": "and they were like first of all the uh the Star Destroyer showing up as they're jumping is really awesome which was really cool and then um yeah Vader doing all those kinds of things because Vader's so effortless uh like people make fun of the David prow like fights with Obi-Wan and stuff where they're really bad and stuff but I was always like well if you read it it differently it's that Vader doesn't give a **** about this old man or any of these people like he's way more powerful than them even when he fights Luke and Empire he's doing with one hand you know like like he's he doesn't care and and and you see that where the very effortless doesn't really stop moving and actually the cooler part of that even Invader was watching The Rebel soldiers trying to get that information out which was awesome like just take the **** like and they're all running away and then you see them all set up and I'm like that is the scene from A New Hope ties it perfectly together they should have",
      "start": 2115.0
    },
    {
      "text": "was awesome like just take the **** like and they're all running away and then you see them all set up and I'm like that is the scene from A New Hope ties it perfectly together they should have never showed Leia's face totally show it was so **** Co seeing her it's the same way I feel episode where I'm like what they should have done is never showed Luke just have a cloaked guy on the and you know it's him you know like and that would have been or is it you know especially in episode 7 I was like maybe it isn't it clearly was L you didn't need to show that's a Walking Dead moment you don't want to do that that's a bad Cliffhanger not a good one so I I feel like Leia like we know her iconic look even if she even if it was behind she didn't have her hood on and you see her buns like it's clearly L cuz I I get The Uncanny Valley **** from har even worse than I got it from Tarkin and uh yeah like I I looked at I'm like this doesn't look right she wasn't animating at all it was just",
      "start": 2151.08
    },
    {
      "text": "clearly L cuz I I get The Uncanny Valley **** from har even worse than I got it from Tarkin and uh yeah like I I looked at I'm like this doesn't look right she wasn't animating at all it was just like no it it doesn't matter how she's animating just doesn't look it doesn't look right to me it didn't look right Tarkin looked weird too because I think they pushed it too far but I'm like we we got to slow down let's not do this you know you don't need to do this let's let's let's let's leave a little bit to the imagination I think there's nothing wrong with that you know um but I think it was a great success and it makes me cuz I'm real skeptical of the Lando Han thing I don't think that sounds interesting at all God it sound so good but uh so good just because well just because you kidding me are you **** kidding Harrison for and Billy D Williams are those characters yeah I'm not going to be able to but I TR I trust in Kathleen Kennedy I trust that they will that they they put those",
      "start": 2183.92
    },
    {
      "text": "me are you **** kidding Harrison for and Billy D Williams are those characters yeah I'm not going to be able to but I TR I trust in Kathleen Kennedy I trust that they will that they they put those two in a room together and they have that same chemistry so we'll see what happens so for me it was the the scene where the rebels joined the final fight when I watched the first time was when I looked at Kevin I'm like this movie is **** awesome and then it just from there just kept getting better the the Hammerhead thing that they did when shove the star into the other and then it crashes the thing it's just like this is Star Wars and I think that's the thing they **** made a movie that makes me say this is Star Wars and that's so awesome that whole final fight was great and I cannot wait to talk to Gary W about this because I remember when he was on the show uh this upcoming week on Patreon Friday yeah Friday night on patreon patreon.com uh when he came years ago week on on game",
      "start": 2219.72
    },
    {
      "text": "wait to talk to Gary W about this because I remember when he was on the show uh this upcoming week on Patreon Friday yeah Friday night on patreon patreon.com uh when he came years ago week on on GameOverGreggy show we were talking about Star Wars and I think just Star Wars was the topic and he was talking about how his favorite thing in the entire Trilogy is at the end of Jedi when the there's like the three fights going on at once there's on land there's in space and all stff and they all worked together in a way that wasn't direct but these people needed to achieve this in order for these people to do that whatever and like watching this movie I'm like oh yeah he's doing it yeah this is happen three plan action happening at the same time and I thought that I thought it was masterful I thought that the how that they all interacted how even on land the the multiple story lines of the different cast members yeah Grant there was a bunch of **** of like you need to climb this Tower",
      "start": 2258.56
    },
    {
      "text": "I thought that the how that they all interacted how even on land the the multiple story lines of the different cast members yeah Grant there was a bunch of **** of like you need to climb this Tower and this weird **** door CL Tower then there was the uh dock we have to go 88 miles an hour so you have to tether this thing to the **** uh you know the the to the clock tower oh God they even had the the was like it's not long enough and I'm like oh my God that was come on guys I loved it I thought that the it that whole thing was paced really well yeah Tim tell us about our sponsor this kinda funny reaction is brought to you by Casper mattresses Greg yeah I got a Casper mattress me and Gia just moved in yeah did so what are you doing on that mattress sleeping a lot it's been great it's been fantastic there's the the two different types of of uh foone going there's the memory phone there's right just the right amount of Bounce and all that stuff you know what I mean I know before",
      "start": 2299.8
    },
    {
      "text": "been fantastic there's the the two different types of of uh foone going there's the memory phone there's right just the right amount of Bounce and all that stuff you know what I mean I know before we know what's up with that Cas mat technology once and I lost my mind and longlasting supportive Comfort cast mattress is oneof a kind a new hybrid mattress that combines premium latex foam with memory foam so much foam that's what we were talking about obsessy engineered mattress at a shockly fair price just the right think just the right bounce that's what I was talking about uh they come together for better nights and brighter days you can get a risk-free trial and return policy try sleeping on a Casper mattress for 100 days you get free delivery if you don't like it you can send it right back and we got a deal for you you can go to casper.com SL kinda funny and use code kinda funny to get $50 towards any mattress mattress are usually really expensive in America oh no I know I know",
      "start": 2339.8
    },
    {
      "text": "and we got a deal for you you can go to casper.com SL kinda funny and use code kinda funny to get $50 towards any mattress mattress are usually really expensive in America oh no I know I know this one made in America yeah cheaper than all the other ones wow mhm we're talking 00 for a twin 950 for King I went Queen I went Queen I should have went King I'm going to be honest with you you got $50 off yeah I **** up stupid that was a dumb move send it back get the queen get get the king casper.com kinda funny use from kinda funny thank you very much Casper for sponsoring this video so any closing thoughts are we good I love this movie we're good I think I I think it's a great movie and I think that I think people should definitely go see it um and uh really really soak it up cuz I I don't know that they're all going to be this good you know that that'll be interesting to see if when there's a miss again from the new regime here of Star Wars who seems to be doing everything",
      "start": 2378.68
    },
    {
      "text": "I I don't know that they're all going to be this good you know that that'll be interesting to see if when there's a miss again from the new regime here of Star Wars who seems to be doing everything correctly and and oh let me let me with this because this is interesting thing A lot of people are saying that this is a very Empire Strikes Back like movie and I think it is um and it makes me wonder it make it gives me hope that they're not going to ape Empire with episode 8 because I feel like they aped the tone of Empire with this movie and so I think that there is a signal being sent through this movie that they know that the seven was New Hope and they're not going to do Empire because this was Empire in its tone Nick what what are you to say oh just shout out to the casting crew I mean they did a great job and I was just looking up his his cinematographer because I thought it was shot pretty beautifully uh who is Greg Frasier well never heard of him but I'm sure he's done lots of",
      "start": 2423.36
    },
    {
      "text": "they did a great job and I was just looking up his his cinematographer because I thought it was shot pretty beautifully uh who is Greg Frasier well never heard of him but I'm sure he's done lots of cool stuff let's see Zero Dark 30 yeah he I loved the shots of the they looked like GoPro action shots on the ships on the back of the ships yeah there a l I brought this up to Kevin and and he was just like do you think those were Miniatures with cameras on them I'm like oh maybe they had like a real physicality to them that's super sick yeah I thought I thought there were just some I think some of the cinematography in this is the best in in any of the Star Wars movies by far um the shot of what we saw in the trailers that is still Pro probably the best shot of any Star Wars film with the the Star Destroyer coming out of the shadows as the sun's like creeping up and then we see it then we see the scale for the first time of the Death Star you're like **** and the whole the eclipse too that",
      "start": 2463.96
    },
    {
      "text": "Destroyer coming out of the shadows as the sun's like creeping up and then we see it then we see the scale for the first time of the Death Star you're like **** and the whole the eclipse too that cool stff a lot of beautiful things in this movie so I think they did a lot great I mean this is kudos to to the team that worked on this was awesome well ladies and gentlemen what do you think of Rogue One a Star Wars story let us know in the comments below share the video with your friends of course come back to the GameOverGreggy show either Friday on Patreon or next week when Gary WID will join us of course he was one of the guys behind the story on this one and until next time no it's been our pleasure to serve you and W should get his own movie W did you see the look alike it might have been her it wasn't sadly it might have been her",
      "start": 2505.52
    }
  ]
}
