{
  "id": 2261,
  "video_id": "W9ETTwWT7Y0",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "The Rock - The GameOverGreggy Show Ep. 160 (Pt. 2)",
  "description": "Tim Gettys loves The Rock.\n\nThanks to Mac Sales for sponsoring this episode. Visit http://www.macsales.com/ps4 and step up your gaming with the OWC DIY PlayStation 4 Hard Drive Upgrade Kit.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1482825601,
  "duration": 1510,
  "transcript_chunks": [
    {
      "text": "The GameOverGreggy Show is brought to you by the OWC DIY PlayStation 4 hard drive upgrade kit available now at macsales.com. Now that Christmas is over, you have one thing left to do: install all those new video games you received with gifts on your PlayStation 4. But with games taking up to 50 GB of storage space, your drive can fill up fast. If you need more storage on your system, quadruple the storage space on your PS4 with the OWC DIY PlayStation 4 hard drive upgrade upgrade kit. Not gide, that's not a word, right? Cool. Greg, not a word. With the OWC kits included terabyte hard drive and all the tools needed for installation and to transfer your data, you'll be able to spend less time managing game data and more time actually playing video games. The kit includes an enclosure so you can reuse the PS4's original hard drive as an external drive. There's even an instructional video instructional video to guide you step byep through the installation. Visit macsales.com PS4 and step up your game with",
      "start": 0.0
    },
    {
      "text": "original hard drive as an external drive. There's even an instructional video instructional video to guide you step byep through the installation. Visit macsales.com PS4 and step up your game with the OWC DIY PlayStation 4 hard drive upgrade kit. Tim, what's your topic? My topic is The Rock. We love The Rock. Is he the hardest working man in the world? Yeah. Yeah. Some people say the president. I say no. The next I think he's going to be the president president. We're all gonna vote for him. Rock the vote. He's gonna oh Rock the vote. Damn it, right? See, this is the thing. This entire conversation started with me and Nick today driving to get his rental car and we're talking about like, man, The Rock is just insane how much he works, how many jobs he's doing, how good of a job he's doing and how it it wasn't always this way. He's always been dope, yeah, but now he's at an all-time high of just he can't miss. He's just he cannot miss. Got that animated flick, the Baywatch one. He's got Under Armour.",
      "start": 45.36
    },
    {
      "text": "it it wasn't always this way. He's always been dope, yeah, but now he's at an all-time high of just he can't miss. He's just he cannot miss. Got that animated flick, the Baywatch one. He's got Under Armour. He's just an animated flick, the new Disney movie Disney music Moana. Moana, there you go. Sorry. Moana. **** love it. Totally totally different thing. But then the question becomes it's like, all right, well, Kevin Hart's right there with him the entire time. So is he the hardest working person too? No, because The Rock needs to work out as well and then he needs to document it all on social media and I know a lot of people think that's easy. That shit's not easy having to freaking make sure you do it. He does things almost daily that it's the best social media in the game and one of the reasons like I don't get me wrong, I love The Rock. Everybody knows that Rock if you're watching for you got to come on the GameOverGreggy Show second you got to host Kinda Funny uh Live 3. We got to talk about this.",
      "start": 105.88
    },
    {
      "text": "get me wrong, I love The Rock. Everybody knows that Rock if you're watching for you got to come on the GameOverGreggy Show second you got to host Kinda Funny uh Live 3. We got to talk about this. But that the thing about it is yeah, he's his first off I I like him in general. I liked him when he was a wrestler. Actually, I didn't like him that much when he was a wrestler, but we'll get into that I'm sure in a second. But it was like then as he moved over and started doing movies he's making choosing the right roles. He's killing the right roles. Then he is killing like tweeting everything. Then his Instagram posts aren't just **** Instagram posts. Like I've taken cues from him on how to use Instagram cuz he gets in there and he tells these insane stories of like it's just a photo of some guy with the sign he like this is Jack and he's a Marine and he wored for me for 1 hours so after I was done killing it I came out here and I said **** what's up brother it's like damn Rock like this is a",
      "start": 145.84
    },
    {
      "text": "the sign he like this is Jack and he's a Marine and he wored for me for 1 hours so after I was done killing it I came out here and I said **** what's up brother it's like damn Rock like this is a **** emotional story you're taking me on I love it he's so good yeah he's very inspirational and he deserves it and that's the thing too it's like I was joking around in the show this morning when I said like this is an example of someone who has talent who didn't **** his life up with some sort of substance abuse problem right because how many well there was definitely some substance abuse that was the joke The Rock uh exactly but but you know all kidding aside like this is an example of someone who's got his got his **** together is talented motivated and this is where they can go and you look at all those other celebrities like there's not a day that goes by they don't watch a movie and be like what the **** what happened to that person like why isn't that person still big like",
      "start": 181.52
    },
    {
      "text": "you look at all those other celebrities like there's not a day that goes by they don't watch a movie and be like what the **** what happened to that person like why isn't that person still big like did they just stop getting rolls and more often than not it's just cuz they like they **** imploded well it's what's fascinating about The Rock is that he and he mirrors so much of what we talk about where I talk about all the time right where we'll talk about what past mistakes were and how we've changed it and we try to express that as a lesson to the audience right and rocks the same way and like I was a shitty kid I was a shitty teenager I was in trouble with the law and I was doing all this and I had $ in my pocket and I went and I started doing these choices and decided to change my life and got to this point where I feel like rather than be somebody who was you know Rose to start him and then fell off and you're like what happened he did it the opposite way where it seems like",
      "start": 217.0
    },
    {
      "text": "life and got to this point where I feel like rather than be somebody who was you know Rose to start him and then fell off and you're like what happened he did it the opposite way where it seems like he had a rough go of it in the beginning and got there and to jump to like when he was in WWF at the time man I remember I was such a Mick Foley fan that like in Beyond the Mat when he like when Mick Foley's all mad that he didn't like shake his hand or come to check on him after the the **** after he beat the **** out of him yeah and I was like wait **** The Rock wait a second what is wrong with this **** and you couldn't argue with like how great he is on the mic and how entertaining is is The Rock saw connection man well and that's the thing that's when it starts to swing back but it's like even then at the time wrestling even for as much as it is like see behind the curtain you know reading dirt sheets and Raj WWF or whatever like it was okay is it is it just an angle is he a",
      "start": 253.64
    },
    {
      "text": "it's like even then at the time wrestling even for as much as it is like see behind the curtain you know reading dirt sheets and Raj WWF or whatever like it was okay is it is it just an angle is he a douche what's happening blah blah and so then for him to get out and start working at it and doing it and then now to be able to yep I'm going to Instagram I'm trying to the one from uh Ballers I think it was or maybe it was Central Intelligence a or whatever one of the thousands of movies he's put out where he was you know finally got a chance to go eat and he heard something out the window open it's all these kids trying to see him so he makes an Instagram it's like damn man you're awesome when you're killing it and I don't know if it's learning from you know past arrogance is and changing but like I'm I've totally flipped over the years I mean I've been a rock fan for a long time now yeah I mean he's just he's just he took that level of stardom to the next level you know like you",
      "start": 291.24
    },
    {
      "text": "but like I'm I've totally flipped over the years I mean I've been a rock fan for a long time now yeah I mean he's just he's just he took that level of stardom to the next level you know like you mentioned Kevin Hart with him as well he's like Kevin Hart's doing the exact if you watch like Kevin Hart's recent rise as well like he's doing all the movies he's all he's like if you watch his Instagram also he's in the gym working out because you do a couple movies with The Rock how can you not be motivated like I can do he's like pal I just want to get bigger with some weights look like The Rock and he tries so then The Rock just like he's so good a mountain of a man who just just like a giant person he's like keep working out cuz it's 4:00 a.m. you need like 30 minutes of sleep that guy can't sleep it doesn't I don't think he sleeps I think he's like and I love his diet good let's go I need all the fish just blinks hard for a second he like I'm back in it I'm back in it okay I forget who",
      "start": 328.04
    },
    {
      "text": "sleep it doesn't I don't think he sleeps I think he's like and I love his diet good let's go I need all the fish just blinks hard for a second he like I'm back in it I'm back in it okay I forget who it was but someone was like uh it was going the rounds were going around of of some YouTuber trying to do his diet oh yeah it was an article I I read maybe it was BuzzFeed it was BuzzFeed um it's ridiculous I mean he he's like 9 lbs of cod a day yeah like **** ridiculous 1 Meals the 1 Meals the Rockets ready for Hercules like holy **** but like that takes that's just I just wonder if that's something that you get inherently like if that's something that's just you're conditioned to do or if you can actually build yourself into that you know what I mean physically you mean no I just mean mentally like physically anyone can do it anyone can get that jacked physically if you're but it's the mental thing that's the hardest right when when you have The Rock Sheen well no but not necess",
      "start": 363.96
    },
    {
      "text": "mentally like physically anyone can do it anyone can get that jacked physically if you're but it's the mental thing that's the hardest right when when you have The Rock Sheen well no but not necess I'm just saying like in in general like you can get you could anyone can get into shape anyone can go put pack muscle on anyone can go work out for a week can you do it every day of your life for hours eat a certain way and **** shoot a movie afterward and then work out again and that's the thing is like it's not like he's doing it every day in the same **** spot right like how many of his Instagram posts are like yeah we came and we shut down this boxing gym so I could it's the the fact of like yeah and he travels with Bera that giant machine it's just like you know like it's like **** I you know I'm I'm eating well right I'm having yogurt for breakfast and then I go to pack it's like **** it whatever I I and my excuses like shoveling all this **** Cheesecake Factory blasters",
      "start": 406.08
    },
    {
      "text": "I you know I'm I'm eating well right I'm having yogurt for breakfast and then I go to pack it's like **** it whatever I I and my excuses like shoveling all this **** Cheesecake Factory blasters into my mouth it's CU well I'm **** on the road what am I going to do yeah and and the other thing there too is like for us being in production that **** is so tiring even doing this show sitting here talking when we're done with the show all of us have that like yeah we're tired oh man like I I feel like I did I want to go work out for six hours but that's the last thing that I would want to do and it's crazy because like this is the tamest version whenever we do Bigger Productions like I remember we did the non another zombie apocalypse like those days those were short days for a shoot but they were like what 1 hour days and it's like feel so done your body is just like what are we doing here and like I can't even imagine him doing his own action scenes in Jumanji Baywatch yeah he's the",
      "start": 441.72
    },
    {
      "text": "they were like what 1 hour days and it's like feel so done your body is just like what are we doing here and like I can't even imagine him doing his own action scenes in Jumanji Baywatch yeah he's the star so odds are he's probably in every scene too so he's probably needing to be there at least and the thing about him is I'm sorry I was going to say at least 90% of the time and it's you know the fact that uh he doesn't like again with the Instagram stuff and I'm sure don't get me wrong he has his moments of being like powering down but his Instagram everything else would lead you to believe he doesn't and I'm not even talking about like seeing the fans but like like the recently from the Jumanji set right like the thing where he threw like a fake spider on Kevin Hart or like when he jumped out of the car and scared Kevin Hart I mean mainly it's just **** with Kevin Hart but still like you know what I mean like we don't like we know what it's like to be totally down like don't ****",
      "start": 481.24
    },
    {
      "text": "out of the car and scared Kevin Hart I mean mainly it's just **** with Kevin Hart but still like you know what I mean like we don't like we know what it's like to be totally down like don't **** speak to me don't leave me alone right now yeah no man it's crazy and this goes back to another conversation to bring it back to the WWE thing uh that I was having with I don't remember who it was another guest that came through off camera where it's like WWE is such a weird thing where their Superstars I mean they're literally called Superstars but like WWE stars are celebrities in the most unique way where there are very few people on the planet that can come out in front of 30,000 people and get cheered the way that they do for a year and then fall off the face of the planet and never to be heard of again and like you no longer a celebrity you no longer have people going crazy over you and then you end up like recently you've been going to the APW shows and you see guys like Matt Hard",
      "start": 517.76
    },
    {
      "text": "heard of again and like you no longer a celebrity you no longer have people going crazy over you and then you end up like recently you've been going to the APW shows and you see guys like Matt Hard whoever W Chris Master and you're like damn you were like **** Untouchable and now you're here in a **** gym again which is usually the Ascension the the the masterpiece like the Master Lock it's like it's like oh you can pay $30 to get a picture of you in the Master Lock and it's like I'm not even hdden on the hustle there it's like you're doing you it's just mindblowing to me that it's like you go from being an arena in front of tens of thousands of people to being in the same school gym that Kevin graduated Middle School in literally and it's like this is it's weird but then you take things like The Rock and it's like he kind of took that power and then just really did take it to the next level in a way that no one else has there's other guys like John Cena Hulk Hogan like these guys",
      "start": 561.32
    },
    {
      "text": "like The Rock and it's like he kind of took that power and then just really did take it to the next level in a way that no one else has there's other guys like John Cena Hulk Hogan like these guys they are all they're going to be they are celebrities they are straightup celebrities they're not just wrestlers right they they do the movies and do whatever but Rock went through that phase of the Cena movies where it's just like rock Doom how do we this m oh The Rock and I don't mean everyone in Hollywood exex I mean the people that's the thing he somehow figured out like right around like he was nothing until The Rundown right you remember The Rundown that was with him and Walkin that is I think the movie that cemented him as like Sean Williams Scott yeah Sean William Scott when Sean Williams Scott was a bigger celebrity than The Rock yeah cuz he was the lead of that movie um actually Guess The Rock was the lead but they were like co-stars um but he somehow figured out he was after that",
      "start": 604.76
    },
    {
      "text": "Scott was a bigger celebrity than The Rock yeah cuz he was the lead of that movie um actually Guess The Rock was the lead but they were like co-stars um but he somehow figured out he was after that project he was like holy **** wait this is a good project I'm only going to do good projects from now on and he's done some interesting films here and there like I think he did one with the grid iron or uh he does a lot of bad movies recently he has been on a **** he paid his dues and he got better at acting like that's you know what I mean like I think as somebody who once in a while is called upon to act at the very bare minimum as soon as I do it I'm like I'm **** terrible and this sucks and I'm awful what you know what I mean like but I'm going to need my own gym built and my own diet supplements to commit to it and like what you're talking about is to go beyond the Cena movies and go beyond the Hogan movies and continue to be there Suburban command is a great movie uhuh keep theaker",
      "start": 650.44
    },
    {
      "text": "to commit to it and like what you're talking about is to go beyond the Cena movies and go beyond the Hogan movies and continue to be there Suburban command is a great movie uhuh keep theaker yeah the Bounty Hunter with the high voice right as you keep going though to commit to that and get better and better at it and pay your dues to the point where yeah like now you like he was the highest grossing actor last year I mean ridiculous Ballers I legitimately love I love Ballers it's the same thing where he does what we do with milli ions of people where it's like you guys are supporting Ballers and you made it we have a second season thank you for making he gets the relationship and and that's what's crazy because WWE is such a weird special unique thing in that where else do you have to go do something put on a semi choreographed but semi not choreographed thing where you are acting you need to speak to people it's also improv you need to do all this stuff you can get injured at any",
      "start": 688.0
    },
    {
      "text": "go do something put on a semi choreographed but semi not choreographed thing where you are acting you need to speak to people it's also improv you need to do all this stuff you can get injured at any point at which point you need to just improv that as well you need to build a character hope that the character uh reacts well with people that character needs to have a storyline where you go from being the good guy to the bad guy constantly oh now you need to change your character go over like that's there's so much going on there and you need to do all that in front of so many people under so much scrutiny constantly and not **** up and not **** up keep growing and growing while other people are growing and then go outside of that thing and keep all that stuff going and then act and still keep that because you can't betray the fans you know then then you just become oh you're a part-timer in WWE and all the wrestling fans start to hate you and you become Jack Swagger but but then",
      "start": 731.56
    },
    {
      "text": "keep that because you can't betray the fans you know then then you just become oh you're a part-timer in WWE and all the wrestling fans start to hate you and you become Jack Swagger but but then there's The Rock who comes back and is instantly right back **** in the swing of things and like everybody's so **** jazzed the one WrestleMania I went to uh going back to the first topic of us talking about place to sending you ridiculous um you know Journeys and **** TQ sending me to Wrestlemania 28 in Miami getting to see The Rock versus John Cena that was **** awesome but nobody was just like ah he's only here for the **** man event he wouldn't be it's like everyone's like yes please let The Rock win this is going to be **** awesome then The Rock won it was **** great well that's the I mean that's the thing about wrestling right is like they've never WWF has or WWE has never recovered from The Attitude Era and that's why the video games chase it and try to do like modes for",
      "start": 769.04
    },
    {
      "text": "the I mean that's the thing about wrestling right is like they've never WWF has or WWE has never recovered from The Attitude Era and that's why the video games chase it and try to do like modes for it and put Stone Cold in the cover it's cuz they had something they had lightning in a bottle for that one segment of what that was and they've never been able to pull out so like when Rock comes back you're excited that Rock's back because he's back there to do something awesome he's the only guy who can like after that when he won he came out and challenge John Cena to next year's WrestleMania the day after the last WrestleMania like 364 days from now you John the like what he's like I'm just going to Main Event this event in a year so don't die or get hurt or just stay healthy please but it's cool and then I think that a lot goes into it where it's you know there was so much legal **** about The Rock and is he Dwayne Johnson or is he The Rock Dwayne the Rock John The Rock Johnson for a",
      "start": 809.24
    },
    {
      "text": "cool and then I think that a lot goes into it where it's you know there was so much legal **** about The Rock and is he Dwayne Johnson or is he The Rock Dwayne the Rock John The Rock Johnson for a while he couldn't say that you use The Rock then Vince had to be a a producer or whatever the I don't know where it's at now but obviously he seems to be The Rock like people promote him as The Rock all his Instagram and social Rock so it's like I think that is the answer is The Rock as a brand oh sure is not just a person it is a brand it doesn't just mean a wrestler it doesn't just mean an actor or producer or whatever the **** it is it's like this dude is a brand that people believe in and you can put that thing in anything it's on Under Armour now I think it's got his own shoes there's what is it seven Buck or Seven Bucks production production yeah whatever stuff make a boss really yeah it's crazy man yeah no The Rock's amazing yeah shout out to his team too by the way cuz we give",
      "start": 847.56
    },
    {
      "text": "what is it seven Buck or Seven Bucks production production yeah whatever stuff make a boss really yeah it's crazy man yeah no The Rock's amazing yeah shout out to his team too by the way cuz we give Rock obviously a lot of credit but I'd love to see behind the curtains on that and how many people he has working with him I love just hang out with Rock I've interviewed a lot of WWE guys over the years that's the one that's evaded me that I wanted to really yeah he's probably a **** awesome guy he seems like he would be what would you do if he was just an **** though it would be great if he was because i' be like yes cuz I know like I've met Hogan and Hogan was a great guy to me but my buddy waited in line for him he was like can I take a selfie no brother he was like **** Hogan he's a dick you're ruin wrestling for me that's so my little brother super into wrestling so it's like when there all those moments it's like the Eminem stand moment that can **** break you like uh I used",
      "start": 888.04
    },
    {
      "text": "dick you're ruin wrestling for me that's so my little brother super into wrestling so it's like when there all those moments it's like the Eminem stand moment that can **** break you like uh I used to take him to a whole bunch of like autograph signings and **** and like so such good experiences John Cena such a nice **** dude um uh Randy Orton like all these dudes are so great Batista **** **** and it was just like that one experience he be he could be the nicest dude ever but we were at Stonestown and uh we were there on time to to make the the cut off but he was leaving early and was like walking out and my brother just real quick was just like hey can I please get this thing signed and he lo I forgot what he said but it was like really rude and I was just like oh God **** Batista bombed him right there and it was just like that's one of those things where it sucks because being on the other end of that now where we there's so many scenarios where we're rushing off",
      "start": 927.6
    },
    {
      "text": "Batista bombed him right there and it was just like that's one of those things where it sucks because being on the other end of that now where we there's so many scenarios where we're rushing off somewhere we need to to be like sorry whatever and it's like no matter what we say I don't know how they're that person's taking it Batista could be the coolest dude ever but that moment **** him you know and I never recover talked about Punk before and like that like that and that is the thing where it's like it sucks that the way these relationships and that relationship and all these like relationship of entertainers go is the fact that yeah you have one bad moment right or you are in a thing and that person thinks you **** suck and there's no way to get that back cuz it's you know it's gone and that's why it's so weird for me to think back to uh when again Attitude Error is popping off and I was such a Jero fan and cuz like August 9th 1999 changed my life I always say it right and",
      "start": 968.6
    },
    {
      "text": "gone and that's why it's so weird for me to think back to uh when again attitude error is popping off and I was such a Jericho fan and cuz like August 9th, 1999 changed my life I always say it right and Rock is such a huge part of that cuz he cut great promo on Jericho nothing ever came of it like all right whatever um but I remember then you know whatever a year later, 6 months later when WWE came back to town we had a we had a tip so like cuz like you're we were kids it's different now with the internet I'm sure and everything else but like we had a tip on where the wrestlers were staying because at no point did we think these wrestlers are probably staying in hotels but there was one they usually stayed at around the Rosemont Horizon All State Arena and so we went there and we were chilling out and I I just brought the one Jericho photo I wanted to get a signature from Chris Jericho I never saw him that but saw everybody else and like I have in those photo albums I think I showed you I",
      "start": 1005.12
    },
    {
      "text": "out and I I just brought the one Jericho photo I wanted to get a signature from Chris Jericho I never saw him that but saw everybody else and like I have in those photo albums I think I showed you I have like the click wind up photos of like there was the bar and we're all under AG we have to stand outside of it while like like Devon Dudley was in there and like he came out and was talking to clearly a friend of his and I took like a photo of him candidly or whatever and he looked up and he's like oh hey man I'm just having a conversation I'm like I know sorry he's like no the **** away from me kid but like that that would have been a legit response too of like what the **** like I'm you could have asked why you tak your clicky wind up Kodak thing you know what I mean but they were all super nice to everybody and I think there is part of that is like for the most part that the business gets the fact that great we're on top now and in six months we could be wrestling in the Indies",
      "start": 1043.8
    },
    {
      "text": "super nice to everybody and I think there is part of that is like for the most part that the business gets the fact that great we're on top now and in six months we could be wrestling in the Indies again and we need people to support us and stuff like that yeah but I love the Rock God bless God bless the rock indeed future president future president of the United States I and that's the thing is like it keeps getting kicked around and he's like all F he'll be play it off it's like **** do it dude it's happening I honestly believe it's happening I I don't think it'll be 2020 I think it will I think I think Trump the the situation that Trump has going now there's no way the rock doesn't get involved if he does I mean if he does he's got to do it is like he's standing up to save the world you know what I mean mean need to like a Captain America out for the entire time dude I'm still telling you too they **** up with this Shazam movie he should be Shazam he should be Billy B because",
      "start": 1079.4
    },
    {
      "text": "you know what I mean mean need to like a Captain America out for the entire time dude I'm still telling you too they **** up with this Shazam movie he should be Shazam he should be Billy B because like that's the thing about Central Intelligence Agency and again back to how good of an actor he is right is like he plays a very like aloof you know like nerd who got yolked or whatever so he's like you that and even imagining him playing like the g wow I don't know what's going on oh my God you're Superman like but being the rock that would be so awesome yeah I'd watch it yeah Black Adam whatever how was he huh how was that that movie which one Central Intelligence Agency it was fine it was fun I mean that's the thing about the rock strikes me so much as so many of our YouTube friends were they're in a movie or a thing and I'm like oh I love that person y'all watch that or whatever you know what I mean Central Intelligence was like I love the Rock and I love Kevin Hart so yeah here's my",
      "start": 1117.52
    },
    {
      "text": "in a movie or a thing and I'm like oh I love that person y'all watch that or whatever you know what I mean Central Intelligence was like I love the Rock and I love Kevin Hart so yeah here's my money I'll go see this in theater and this is like a comedy anybody else was in I probably want to go see this one but it's like they look funny and you get in there and it's yeah it's them ping around being having fun it's like you know whatever but as far as like a plot sure but it's them having fun and being together that's why it's like same thing with Jumanji where I was like I don't want another **** Jan Rock and Kevin har All Right The Jungle Cruise movie **** yes but the the the rock is awesome because the Rock movie is a thing like that makes sense in the same with Adam Sandler movies made a thing back in the day right remember those yeah I do when you cared but now it's like The Rock and he can be in any genre doing anything and it's like what with Moana I think it's really crazy",
      "start": 1158.12
    },
    {
      "text": "made a thing back in the day right remember those yeah I do when you cared but now it's like The Rock and he can be in any genre doing anything and it's like what with Moana I think it's really crazy because like his character in that movie he is just the rock which he is often times in movies Ash Fast and Furious uh dad's got to go to work so good so **** good but but when Moana he he is literally a freaking now kid celebrity as well you know it's like he's really getting the entire age group of people he sings He sings in a Disney movie yeah officially yeah it's wild when you think of uh so going back to that the to the was it the runaround The Rundown The Rundown thank you rapper The Reach round I think he was in that the bend over uh turn lights off um no but there's that one moment where he actually passes Arnold Swartzenegger in the hallway right and Arnold Swartzenegger says something like it's like it's up to you now or some **** like that like actually physically passing",
      "start": 1193.24
    },
    {
      "text": "where he actually passes Arnold Swartzenegger in the hallway right and Arnold Swartzenegger says something like it's like it's up to you now or some **** like that like actually physically passing the torch and everyone was like oh he didn't really become that now he is that he is he is in the 80s what Arnold I mean he is now what Arnold Schwarzenegger was to me at least in the 80s where it didn't **** matter what Arnold schz ner was doing I had to see that movie cuz it's Arnold that's but he even takes it a step further I think the rock but that's the thing is and he is and it goes back to the wrestling thing of the rock represents an era The Rock represents the best ERA and the rock is also the one dude that was in between where he had the passing of the torch from Hogan then he had the passing of the the torch to Cena and it's just like there was the handshake moments on both ends and it's like he will forever be welcomed back to go there until he tries to handshake with Roman",
      "start": 1236.52
    },
    {
      "text": "the passing of the the torch to Cena and it's just like there was the handshake moments on both ends and it's like he will forever be welcomed back to go there until he tries to handshake with Roman Reigns and like we're not buying that that was like my favorite moment of that when he came and people are still booing Roman Reigns and like Roman Reigns guys come on there's that there's that look where the Rock's like **** why no nobody likit so and here's the one question I have because I was sold on as soon as it got announced but I haven't had time because it's been such a busy couple days how is the Baywatch trailer oh God it's so good we should stop and watch it right now I really think we should it's so good okay it's so **** good let's just watch it we'll watch it as right now who cares I we can get audio on that so I'm going pull your phone I'm G pull it up on this no cuz that was the thing when he announced that I was like **** yes and then every Instagram post he's done",
      "start": 1273.28
    },
    {
      "text": "cares I we can get audio on that so I'm going pull your phone I'm G pull it up on this no cuz that was the thing when he announced that I was like **** yes and then every Instagram post he's done since then where he comes out and he introduces a new character or yeah and then like when he and he did he did the exact same thing too with this where it was like Hey everybody because of your support and this awesome screening we got this is an Instagram post that goes on forever we're moving it up to Memorial Day right or whatever and it's like hey because of that this is happening and we're going up against Pirates the Caribbean and I love Pirates the Caribbean I love Johnny Depp and it's going to be a lot of fun going up and two great mov movies and it's like you're **** awesome that is so awesome first off I'm definitely seeing that movie that weekend not the character well I mean if it's Memorial looks okay this time whatever I don't **** movie whatever it is all right all right",
      "start": 1314.96
    },
    {
      "text": "so awesome first off I'm definitely seeing that movie that weekend not the character well I mean if it's Memorial looks okay this time whatever I don't **** movie whatever it is all right all right prepare your body and soul thank you you am I live reacting to it the rock it's got a Beat some other time such a good plots you should at my to yours I love this Zach off's awesome too yeah he's so good with two medals how many medals do you have probably zero got a that's not our job says there's going over there and my say we check it out your sound likey girls I don't know they but is that uh they look like the chick from Quan Pur expain you're just oh the Dwayne yeah come on yeah looks fun come on now why wouldn't we love that look super fun looks great so good go damn it rock your National show oh give me Jumanji if you can do this for Baywatch what can you do for Jumanji just wait until he's in Golden Girls mind blown again I would support that the live action Dy trailer they did on SNL",
      "start": 1349.44
    },
    {
      "text": "show oh give me Jumanji if you can do this for Baywatch what can you do for Jumanji just wait until he's in Golden Girls mind blown again I would support that the live action Dy trailer they did on SNL I'd watch that movie oh my God I haven't seen that oh later we'll watch it it's literally the best thing in the world good",
      "start": 1486.88
    }
  ]
}
