{
  "id": 2211,
  "video_id": "x7aFvoHsu6Y",
  "show_name": "The GameOverGreggy Show",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino"],
  "title": "Comic Book Movies and Being Cold - The GameOverGreggy Show Ep. 156",
  "description": "We predict the future of super hero movies, discuss how we've failed as fans, and cold weather. (Released to Patreon Supporters 11.25.16)\n\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1480665606,
  "duration": 6613,
  "transcript_chunks": [
    {
      "text": "This episode of the GameOverGreggy Show is brought to you by Squarespace. Whether you need a landing page a beautiful gallery a professional blog or an online store it's all included with your Squarespace website. Start your free trial today at squarespace.com and enter our offer code KINDAFUNNY to get 10% off your first purchase. Some of that reading was shaky. Nobody tell Colin. Squarespace set your website apart. What's up everybody it's me Greg Miller and today's GameOverGreggy Show is brought to you by MVMT Watches. Kevin hit it. I'm going to a wedding this weekend. I'm wearing my MVMT watch. Look at that's a good zoom Kev good job. Let me tell you about MVMT Watches ladies and gentlemen. First off they're a great holiday gift don't be silly. MVMT Watches start at just $95 at a department store. You're looking at 400 to 500 bucks. MVMT figured out that by getting rid of all the middlemen and selling online and getting rid of that retailer markup they can get",
      "start": 0.0
    },
    {
      "text": "just $95 at a department store. You're looking at 400 to 500 bucks. MVMT figured out that by getting rid of all the middlemen and selling online and getting rid of that retailer markup they can get you the best possible price. They have classic design quality construction and stylized minimalism. There's over 500,000 watches sold in more than 160 countries. You can get $15 off today with free shipping and free returns by going to movementwatches.com slash Greggy. This watch has a really clean design. Honestly I get talked about all the time at the wedding. I think the bride might leave her man and come home with me. I'm just kidding Jen that won't happen. Anyways go to movementwatches.com slash Greggy. That's MVMT watches.com slash Greggy. Join the movement. Pew pew pew pew pew pew pew pew. Like a laser can you make a laser come out of it Kev? Pew pew pew pew pew pew. Remember payment is never in the hurry at asm stained glass device is never in the power and detail",
      "start": 36.84
    },
    {
      "text": "pew pew. Like a laser can you make a laser come out of it Kev? Pew pew pew pew pew pew. Remember payment is never in the hurry at asm stained glass device is never in the power and detail of patient's upon their own hands without the braving some pain of trial and error. Home salesmen in his endless life become a world of iners in labor ICU When he said that a bunch of times you're like why is he like morph so much they wanted us to like morph that's why morph morph do you remember that what's up everybody welcome to the GameOverGreggy Show your host Greg Miller alongside the producer slash producer Nick Scarpino hi Greg was that recorded or was that is that I just just put the fucking intro on it and let it go into the morgue he was super into him was like their mutants man Wolverine understands the more comes back like way later when he's fine Mr. Sinister spoilers well isn't that one over here the pure one Tim Gettys this is a beautiful shirt if you're listening to the",
      "start": 81.64
    },
    {
      "text": "understands the more comes back like way later when he's fine Mr. Sinister spoilers well isn't that one over here the pure one Tim Gettys this is a beautiful shirt if you're listening to the show the day it goes live for Patreon users you can get this shirt over on kindafunny.com/store because it's our Black Friday shirt yeah there you go Kevin Alex good it's black on black there you go thank you Jay-Z because I'm gonna say you see you led with if you're listening and I was like oh he's gonna explain this shirt for people who can't see it and then you're just like buy this shirt now if you're listening or watching on Friday that this is on Patreon cool or if not if you're listening to topic one on the Monday on the YouTube the Kinda Funny Thanksgiving weekend shirts shirt Strava gans shirt Strava gans I was a shirt a cooler shirt a killer oh say that one for later though yeah the shirt Strava gans is still going on so you can get a whole bunch of the classic Kinda Funny",
      "start": 177.76
    },
    {
      "text": "gans shirt Strava gans I was a shirt a cooler shirt a killer oh say that one for later though yeah the shirt Strava gans is still going on so you can get a whole bunch of the classic Kinda Funny shirts over kindafunny.com/store this one might still be there it's limited edition I don't know how long it lasts they didn't get a rubber yeah it's still there like kind of cat have a dope ass thing it says there's no way you can see this but since my time on the inside it says limited edition yeah it's pretty cool there you go there you go thanks Kev that's right Colin Moriarty off celebrating Thanksgiving yeah and so we often bring in guests mm-hmm we've been doing the patreon.com/kindafunny exclusive for the GameOverGreggy Show who lately been one-on-one when somebody's not here for a full-on show we usually bring in a guest but I wanted to get intimate with you too we've done it just the three of us before it's been a long time it",
      "start": 218.28
    },
    {
      "text": "been one-on-one when somebody's not here for a full-on show we usually bring in a guest but I wanted to get intimate with you too we've done it just the three of us before it's been a long time it has but it's it's always fun it's a different dynamic exactly up a little bit shake it up a little bit shake it out do this that piss shaking oh did you see so months ago maybe a year ago at this point there was the Drake and Taylor Swift commercial where's Taylor Swift running on the the treadmill future yeah and then like she falls yeah you love music Apple music I think yeah Apple music awesome something iPod no some shit I don't know whatever they made the flip version of it where it's Drake working out singing Taylor Swift oh that's cute awesome that's really cute I like what they did there yeah it was bad blood but you know I went off this I was segueing because we're talking about shaking it off sure yeah yeah you know I saw the song to right now maybe yeah I'll do it later I'm in the",
      "start": 260.64
    },
    {
      "text": "yeah it was bad blood but you know I went off this I was segueing because we're talking about shaking it off sure yeah yeah you know I saw the song to right now maybe yeah I'll do it later I'm in the first time I heard that that was a moment I remember the first time I heard we're never getting back together either and I was in cars like this sounds like Taylor Swift and it was and I was like what the fuck there's new music from just what's happening how did I miss this I follow her on all the Instagrams and the social medias yeah where was it they just drop shit out of the blue now they don't like like they're so big they don't need promotion anymore they're just like hey my Instagram is bigger than everyone else yeah just don't even give a shit Malcolm Moore comes out with his album last year okay comes out with this thing has all the songs he's dropping all the singles doing all that stuff albums been out a couple months it's not even that old he's already dropped two songs they",
      "start": 306.92
    },
    {
      "text": "year okay comes out with this thing has all the songs he's dropping all the singles doing all that stuff albums been out a couple months it's not even that old he's already dropped two songs they don't even on that album just bam there you go there's single it's the single life man everything is a single life yeah craziness yeah craziness if you didn't know this is the GameOverGreggy Show each and every week three sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com/kindafunny we put the entire thing up early as an mp3 and a video in a whole bunch of other exclusive perks goodies and tears are there for your amusement if you have no bucks to toss our way no big deal head over to youtube.com/kindafunny we're posting the entire show topic by topic day by day until it goes up is one big mp3 and video Tim yeah what's your topic my topic is predicting superhero movies way over",
      "start": 342.24
    },
    {
      "text": "slash Kinda Funny we're posting the entire show topic by topic day by day until it goes up is one big mp3 and video Tim yeah what's your topic my topic is predicting superhero movies way over a year ago at this point it was I remember this we had a print out a long time ago we had a printout with a whole bunch of movie posters and we're looking at the future of what was then the future of superhero movies and kind of predicting which ones are gonna be good which ones are gonna be bad which ones are gonna perform not even happen perform which ones aren't gonna happen I remember saying Fantastic Four is gonna be garbage mmm Fantastic Four two is not gonna happen mmm Greg was right so pretty much the reason I wanted to bring this up for this specific dog shows cuz Colin's not here yes Colin doesn't really like these topics and doesn't really you know like all it I can tell you what Colin would say they're all gonna fucking suck and the bombs gonna fall out and anything else no that's",
      "start": 381.36
    },
    {
      "text": "doesn't really like these topics and doesn't really you know like all it I can tell you what Colin would say they're all gonna fucking suck and the bombs gonna fall out and anything else no that's right that's that's that's pretty much it was the two big talk yes exactly so it can't go on he doesn't even say that yeah he's like the bomb is gonna drop out it's like it's been going forever and it's like zombies zombies been going forever too yeah they're still they're still going yeah yeah whatever so yeah we're gonna get there so a big a couple takeaways that we had last time were we were sure the Marvel movies are going to be fine we were a little trepidatious about Ant-Man can Dr. Strange yeah and Guardians of the Galaxy this was done interesting pros before Ant-Man and Guardians of the Galaxy oh yeah holy shit there's we are if I remember correctly there we've done this topic ish twice one was officially I think that was after Guardians okay but there was another time we did it and",
      "start": 426.06
    },
    {
      "text": "Galaxy oh yeah holy shit there's we are if I remember correctly there we've done this topic ish twice one was officially I think that was after Guardians okay but there was another time we did it and we mentioned Guardians and being like I don't know okay this seems like it couldn't work but but we were still like we were positive about it we're like we'll give it a shot sure like but Ant-Man we're like I don't know like we really don't give a fuck about Ant-Man when it got to Dr. Strange we're like Dr. Strange get the fuck out of with your magic bullshit but we were proven to be stupid for being so worried yeah they nailed it with all those movies then on the other side though it was the first one that I felt was like a by the numbers thing it was fun Paul Rudd is awesome the villain was garbage it wasn't bad it was like whatever fun exactly exactly it but are we just going by the blockbuster then the Transformer movie should win Best Picture but I said it wasn't bad and it did well",
      "start": 475.1
    },
    {
      "text": "garbage it wasn't bad it was like whatever fun exactly exactly it but are we just going by the blockbuster then the Transformer movie should win Best Picture but I said it wasn't bad and it did well it's both of those because on the flip side there's the DC movies which great they did well and they pretty much all went exactly how we predicted they would Suicide Squad being the thing that I'd say we were most off about it was like it has a chance of being really good no it didn't be the worst one that chance went away real one yeah but yeah if if I spoke positively about that I was just trying to be nice because I thought from day one looking at that trailer I'm like this is not gonna be a good movie like this is not gonna be good I think I remember saying that it's true Nick Nick talked a lot of shit about the trailers I looked at him and I was like I don't like like none of the one-liners hit I thought that Margot Robbie is Harley Quinn didn't hit like it none of it sold me in the",
      "start": 519.8
    },
    {
      "text": "a lot of shit about the trailers I looked at him and I was like I don't like like none of the one-liners hit I thought that Margot Robbie is Harley Quinn didn't hit like it none of it sold me in the trailer that this was gonna be like a team that actually mixed well chemistry wise and I was right I was unfortunately right because I wanted that movie to be good I wanted it to be a lot better than I heard there's an extra 30 minutes that movie that I could see right now yeah totally a lot of Jared Leto stuff yeah longer seen him fighting Batman actually I thought he was the best part of the movie I agree I liked him a lot but yeah so we all minority we all agreed that Fantastic Four was gonna suck and that there wouldn't be a Fantastic Four and that seems to be the truth although we don't know see I didn't think it was gonna suck that badly though I didn't realize it was gonna be that big of a train wreck now I watched Fantastic Four the one you're talking about the Miles Teller",
      "start": 560.9
    },
    {
      "text": "don't know see I didn't think it was gonna suck that badly though I didn't realize it was gonna be that big of a train wreck now I watched Fantastic Four the one you're talking about the Miles Teller Fantastic Four and Michael B Jordan it's not that the movie was terrible it's just that it wasn't very much fun and you can see that it was one of those we need to come save this movie so I watched that and I'm like I I watched it after obviously after they already canceled Fantastic Four but had I seen that in the theaters I would have sworn I'm like this is probably gonna make enough money to warrant a sequel really wasn't that terrible it wasn't any in my opinion any more or less entertaining than the other two fantastic well that's not saying much fantastic for us we're just Galba yeah just a Galba phone like she's wearing this ad you know the bad contacts and yeah the contacts terrible yeah it was very weird so yeah I mean that was that was unfortunate but yeah you're right man for",
      "start": 596.26
    },
    {
      "text": "a Galba phone like she's wearing this ad you know the bad contacts and yeah the contacts terrible yeah it was very weird so yeah I mean that was that was unfortunate but yeah you're right man for this year up at this point I didn't think Guardians the Galaxy was gonna be I thought it was a that was a wild card could be fun cuz you got a little Chris Pratt would have swore that Dr. Strange was gonna go the way of Thor in the dark world but it did not it went the way of Iron Man which was awesome mm-hmm yeah so we're right now well so then the the other thing that we were talking about was the X-Men movies and that was one where I'm not gonna say we were wrong but we weren't right we didn't know about Apocalypse back then though we did we knew it was coming did we think people were looking forward we gave it the surefire like it's gonna be good and it was right singers back on track that's the thing is like I'll give us partial credit but it we didn't expect it to to be bad and we",
      "start": 637.78
    },
    {
      "text": "forward we gave it the surefire like it's gonna be good and it was right singers back on track that's the thing is like I'll give us partial credit but it we didn't expect it to to be bad and we definitely didn't expect the Fox movies to have another like fail point and they definitely did here's the thing about Apocalypse we've all seen Apocalypse I've seen in theaters I did did you see you haven't seen period I saw it on a plane as I watch all my movies I think was that bad don't be wrong not good but people were talking about it as if it was bad on the level of Fantastic Four on Batman and Robin no no there's so much hyperbole now I came I get not liking Batman v Superman totally but when people were like it's worse than Batman and Robin I'm like that is bullshit it's impossible very few things are worse than Batman Robin when you know I I liked Apocalypse it just wasn't as fun and cool as the two that follow that's the problem is like inevitably they were on track to make really",
      "start": 676.34
    },
    {
      "text": "few things are worse than Batman Robin when you know I I liked Apocalypse it just wasn't as fun and cool as the two that follow that's the problem is like inevitably they were on track to make really good movies and one of them was gonna be not as good as the other ones this one just kind of failed by such a wide margin that I think that it was it was very apparent that they're starting to derail very quickly but the concept was cool and the implementation was cool it's just the kind of the third act kind of fails whereas I feel like the third act of Days of Future Past and and first class was really strong and fun and really gave you kind of a sense of where those characters are going well this one failed enough to drastically change the the path that Fox superhero movies are going they the there's rumors of them kind of rebooting the X-Men franchise entirely there's a chance they're crossing our fingers here that they could work with Marvel like Sony did with Spider-Man to get that",
      "start": 721.24
    },
    {
      "text": "the there's rumors of them kind of rebooting the X-Men franchise entirely there's a chance they're crossing our fingers here that they could work with Marvel like Sony did with Spider-Man to get that all going so anyway that's kind of the the tone that we're at here is like we we kind of predicted that a lot of the DC movies may or may not happen depending on how well Batman v Superman and Suicide Squad do they both did really well commercially did not do well critically so we're kind of in the middle on that 1 hours ago collider reported I saw this when we reading some other thing on con degree lives today Avengers and X-Men crossover is an impossibility says Marvel's Kevin Feige much like that much like how Disney and Sony made a pact to bring Spider-Man into the Marvel Cinematic Universe some fans have been hoping for something similar regarding 0th century Fox's X-Men and the Fantastic Four the future of the cinematic mutants is a bit murky at the moment and it's even worse for",
      "start": 758.4
    },
    {
      "text": "some fans have been hoping for something similar regarding 0th century Fox's X-Men and the Fantastic Four the future of the cinematic mutants is a bit murky at the moment and it's even worse for Marvel's first family unfortunately Marvel Studios head Kevin Feige put the brakes on the chatter in a recent interview speaking with variety about the potential crossover he said quote it's an impossibility at this juncture we certainly have enough films to keep us busy for a number of lifetimes at this juncture but I mean everyone I remember when it was supposed to be crazy for Spider-Man I'm just like hey I'm in a bad comments got it all and the the thing with the Spider-Man thing is like that happened like overnight where it went from an impossibility to well we're doing and there's partnerships so that's the thing is like he is correct Marvel has way too much on their plate but if Kevin were to oversee Fox making its movies and putting that in part of the universe as the reboot I think",
      "start": 806.48
    },
    {
      "text": "so that's the thing is like he is correct Marvel has way too much on their plate but if Kevin were to oversee Fox making its movies and putting that in part of the universe as the reboot I think they can make that happen sure but it's that it's all a matter of money it's all a matter of that share who's well honestly what I read between the lines on that with the court I just read right is the fact that I think he's saying he's taking a shot across the bow where I bet Fox is trying to play hardball of like you want this and you need this and he's like we could fucking make another 4,000 movies and never need yes man I'm sure they would love to have them but they don't need them and also the other thing to keep in mind is Deadpool had not happened yet right we did our last topic and we let's talk about now we all expected that to be great and it was and it did super well well I expected it to be good I didn't expect it to be like the best R-rated movie of all time as far as as far as",
      "start": 840.68
    },
    {
      "text": "talk about now we all expected that to be great and it was and it did super well well I expected it to be good I didn't expect it to be like the best R-rated movie of all time as far as as far as the box office is concerned I mean I think it is the highest grossing R-rated movie of all time and that was another paradigm shift with all those movies where now Logan is also coming out rated R because of that I know it won't be as fun but it's gonna be dark yeah hopefully dark all right so let's bloody let's go through this list here because there is a fuck ton yeah of superhero fun ton of superhero still to come and what are we trying if they're gonna be good we're making our predictions again this is your predictions that yes predictions of will it be good will it perform well and of course it's all relative so will it perform well compared to the other movies in its franchise okay and well and how will it change things going forward and the face of it happen or not the next one up and",
      "start": 881.08
    },
    {
      "text": "it's all relative so will it perform well compared to the other movies in its franchise okay and well and how will it change things going forward and the face of it happen or not the next one up and we're not we're not talking about Incredibles or Power Rangers which you could argue or superhero movies we're talking about DC Marvel superhero the things the top two Lego Batman oh that's gonna kill yeah it's gonna kill I think it's gonna be good the trailer didn't sell me it sold me actually but the second show the one we just saw when I saw a rival right tears off his pants yeah he's like running yeah that was the same trailer but there's something about seeing it on the big screen it with the audience and everyone getting into it I'm like I'm into this I'll watch this now yeah I love it love the Lego movie yeah but Lego Batman I'm like I want to love it I love the stylish it of it all but something about the trailer I'm with you the beats aren't hitting exactly right I think it's",
      "start": 920.36
    },
    {
      "text": "it love the Lego movie yeah but Lego Batman I'm like I want to love it I love the stylish it of it all but something about the trailer I'm with you the beats aren't hitting exactly right I think it's gonna do really well and I think I think it's going to be a good movie yeah I'm super excited I can't wait let Lego dimensions fun pack here I'm not sorry I'm sorry that Lego dimensions story back that looks fucking awesome they had me at the post get the little back of Batman when it said always be yourself unless you be Batman which I'm like that's fucking yeah that's this year still December no no it's February 10th 2017 we're done this year no one's going against Rogue One of the same yeah we're going like screw owning that shit we and we all agree that one's gonna be garbage first off now superhero movie second I know I know you who did you stay I'm just saying Gary would have wrote it mmm mmm mmm I'm kidding I love Gary would have come back and eat your spotted dick it's in my",
      "start": 966.98
    },
    {
      "text": "now superhero movie second I know I know you who did you stay I'm just saying Gary would have wrote it mmm mmm mmm I'm kidding I love Gary would have come back and eat your spotted dick it's in my cupboard still Gary Logan is the next superhero movie yeah March 3rd 2017 this is a tough one so rated R Hugh Jackman's last X-Men movie or last movie as Wolverine who's directing that ooh you guys keep talking Jessica Alba yeah but yeah rated R it seems to be a movie that it's in direct reaction to all of Apocalypse and all that where they're like all right you know what let's get away from the the timeline nonsense this movie seems to be standalone enough and far ahead in the future it's obviously going to be in one of the timelines but yeah James Mandel James Mangold yeah who's that he did the Wolverine and oh did he tend to Yuma 310 to you my enjoyed he's a good director oh he did walk the line to this one is real hit or miss I'm not sure they keep fucking up Wolverine movies well he",
      "start": 1003.4
    },
    {
      "text": "the Wolverine and oh did he tend to Yuma 310 to you my enjoyed he's a good director oh he did walk the line to this one is real hit or miss I'm not sure they keep fucking up Wolverine movies well he did the good standalone Wolverine yeah okay the what it wasn't terrible exactly what was shot with a magic bullet in the forehead and then suddenly can't remember shit even though I have the regenerative process through the head with this animating bullet how would that erase my brain I just have a bullet in my brain that I feel around right that doesn't take it out this is a surgical procedure I don't know why you're doing this I'm gonna walk for a long time because I checked on me to walk yeah exactly well yeah yeah Logan I'm it we've been burned so many times I've been burned on the standalone Wolverine movies you know I mean even and that's what I'm saying the Wolverine looked awesome yeah right it was supposed to be the Wolverine story we don't want it forever and then like you're",
      "start": 1048.92
    },
    {
      "text": "Wolverine movies you know I mean even and that's what I'm saying the Wolverine looked awesome yeah right it was supposed to be the Wolverine story we don't want it forever and then like you're always talking about and I you know that I'm not one of these film guys I don't know the film stuff we got to the third act yeah as you would say well there's just a giant robot samurai it's like what the fuck is this it was good up to them and then they cut the thing with him open in the box and having a suit in there leave the fucking scene in there you remember this yeah I thought that wasn't that deleted scene oh give me what I want give me the yellow and brown suit yeah I don't know why that was it turned out that was gonna be his last one as Wolverine Wolverine we know right now Logan with some weird future weapon acts in apocalypse so I just I feel like it's it's gonna be an interesting I think it's gonna be mixed back a mixed bag I don't think they're gonna be able to hit the level of",
      "start": 1103.2
    },
    {
      "text": "weird future weapon acts in apocalypse so I just I feel like it's it's gonna be an interesting I think it's gonna be mixed back a mixed bag I don't think they're gonna be able to hit the level of intensity that they need to hit with that rated-r movie because I just don't think that I don't know that Jackman what's that they have the balls to like I didn't have the balls I just think that Jackman's been playing that character for so long in a certain way that I just don't think and this is me just judging off of the you haven't seen it yet but there's a scene spoilers with weapon acts in excellent apocalypse and that's supposed to be intense grants that was a PG-13 film but it was supposed to be intense and it comes off really like it just doesn't come off as like in as as powerful and violent as it's supposed to be because I just don't feel like Jackman it was awesome it was by far the best part of movie it was cool but I just feel like they need to like when I think of what a",
      "start": 1136.92
    },
    {
      "text": "and violent as it's supposed to be because I just don't feel like Jackman it was awesome it was by far the best part of movie it was cool but I just feel like they need to like when I think of what a Wolverine movie should be like I think that it should be probably the most violent thing you've ever seen like I feel like it should be on the level of like intensity and shock value as like a RoboCop or something like that right where you're like fuck that was messed up like a weapon X story like it has to be so visceral and so fucked up like it's a combination of RoboCop and fear-loathing in Las Vegas right because that's how that's what's happening in his brain I just don't think that they're gonna go there yeah I'd like them to but I just don't think they're gonna they would have with Darren Aronofsky was supposed to remember back in the day he was supposed to do the Wolverine you know I mean they could learn and listen from all this right and like we get out of the Logan or the",
      "start": 1177.16
    },
    {
      "text": "Darren Aronofsky was supposed to remember back in the day he was supposed to do the Wolverine you know I mean they could learn and listen from all this right and like we get out of the Logan or the Jackman universe or ever they reboot it and then yeah okay let's let's give them a very very visceral thing but it's the problem is that for better or worse the X-Men they're like the runaway most popular all the time is Wolverine yeah and you really want to cut that off and not have kids dresses Wolverine and buying the toys and doing all these different that's the problem like that that character really warrants the the sort of you know Walking Dead treatment where it's like let's take the kitty gloves off let's make this fucked up because that's Wolverine he's a very flawed character when you make him and that's always been my problem with Hugh Jackman it's not his fault it's the direction of what they needed to do to market him is that he's always the happy he's kind of like the he's",
      "start": 1217.56
    },
    {
      "text": "you make him and that's always been my problem with Hugh Jackman it's not his fault it's the direction of what they needed to do to market him is that he's always the happy he's kind of like the he's the PG-13 Wolverine yeah well the good news is they're literally changing the name to Logan you know it's like literally this isn't Wolverine this is Logan so I think they're allowed to kind of go a little farther in terms of the kids you know the parents getting pissed off or whatever because it is a it's a different character sure and the trailer looks super awesome I love The Last Of Us vibe yeah has going and I feel like it is grown up enough and different enough and it seems like disjointed from the comic book II X-Men universe that I'm like I believe in it I do believe in it I that it really I think depends on will is if it's good or not will depend on how well it does it won't do as well as Deadpool and so I think in that sense it'll be a commercial failure for Fox like it's not",
      "start": 1249.52
    },
    {
      "text": "really I think depends on will is if it's good or not will depend on how well it does it won't do as well as Deadpool and so I think in that sense it'll be a commercial failure for Fox like it's not gonna be the hit that they need it to be yeah I want to believe I just can't next up remember in origins how bad his claws look when he lives in the mirror I can't get my god Guardians volume May 5th 017 with Kurt Russell is ego gonna be awesome yeah run away I've said definitely believe in that I'm there man come on now son that is see that the question is can it be can it come close to being as good and fun as Guardians the Galaxy one and I think it can really yeah why not so the thing is Marvel doesn't have the best track record with sequel number two or sequels of anything really like I think Captain America is the only sequel that was good Winter Soldier was a sequel right yeah and then three was Civil War Civil War so Captain America Winter Soldier awesome Iron Man not so",
      "start": 1288.68
    },
    {
      "text": "like I think Captain America is the only sequel that was good Winter Soldier was a sequel right yeah and then three was Civil War Civil War so Captain America Winter Soldier awesome Iron Man not so awesome Thor not so awesome Age of Ultron Age of Ultron not so awesome so we'll see but I mean still go but I mean I feel like they can do a lot more with Guardians that's the thing is I think you still have James Gunn there you still have the cast there they get with the humorous because they got to build it you know what I mean like it's gonna have you already know the soundtracks gonna be fucking awesome gonna be awesome they're gonna have all these zany wacky adventures whatever with jokes between each other and I think it'll be that like you already see some of it where it's um I forget his name Rooker's character the blue guy with the mohawk or whatever who can whistle and shoot the thing around interacting with them and actually being out yes big one of the team there's a new",
      "start": 1334.38
    },
    {
      "text": "his name Rooker's character the blue guy with the mohawk or whatever who can whistle and shoot the thing around interacting with them and actually being out yes big one of the team there's a new dynamic there now Groots the small guy like I think they're gonna have a lot of fun with it I think they have so many fun toys in that box to play with it's gonna be cool because it wasn't to compare it you mentioned group ensembles and did your little Nick wink you know what I mean there it is the thing here is that watching Guardians wasn't the same as watching Avengers whereas when they do this we always talk about when they spin around the Avengers the group shot you're like here we are finally here after all these years where's the Guardians wait from the gaggle you're like who are all any of these fuck guys and then they got together and you're like okay great but it wasn't like I was like oh man what the best part of Guardians is when they got together and fought that thing it was when",
      "start": 1370.98
    },
    {
      "text": "these fuck guys and then they got together and you're like okay great but it wasn't like I was like oh man what the best part of Guardians is when they got together and fought that thing it was when they went off and did crazy yeah yeah yeah sure Wonder Woman June nd 017 directed by Patty Jenkins as far as I know first female directed superhero movie mmm okay I know for DC for sure I'm not sure about Marvel but I think that's correct that sounds right sounds right have a shape nodding his head he's got a he's got all the world's knowledge at his fingertips but he's gonna nod pick his nose a little bit he's not you're my favorite Kev I I'm cautiously looking forward to this film I'm cautiously not apprehensive the opposite of apprehensive thank you cautiously apprehensive I'm optimistic I like the way the trailer looks I'm a huge huge fan of both Chris Pine and Gal Gadot good don't never say your name right that's how big of a fan I am averse it looks fun it looks cool the action",
      "start": 1408.04
    },
    {
      "text": "I like the way the trailer looks I'm a huge huge fan of both Chris Pine and Gal Gadot good don't never say your name right that's how big of a fan I am averse it looks fun it looks cool the action looks good and I mean I'm sure the story is very predictable but the trailer got me and that's something that DC movies haven't those point haven't yet well fuck now I take that back I'm sorry every DC movies trailer has gotten me up to this point with the exception of I was just gonna be a pilot dookie mm-hmm but yeah I'm I'm interested in Wonder Woman I'm more excited for it than I am a lot of the other DC movies at this point but it's I don't think it's gonna be good I wanted to I think it has a chance at being good I don't think it has a chance of being great that's a worry I think it has a chance of being the first good like start to finish oak like okay well put together DC film see I feel like at best it's gonna be as good as Man of Steel that's not bad though man I still wasn't a bad",
      "start": 1452.08
    },
    {
      "text": "of being the first good like start to finish oak like okay well put together DC film see I feel like at best it's gonna be as good as Man of Steel that's not bad though man I still wasn't a bad movie like everyone has to stop giving that movie such so much hate it just wasn't excellent it wasn't what the trailer led us to believe it wasn't the Superman movie you expected yeah that was the problem like that was the problem if I had seen that in a vacuum where I'm like oh super movie cool and I just started watching it like that's pretty cool I've watched it three times yeah every time I get to that part where he's like a good death is it's a reward I'm like I don't understand why any of this is happening like why did you know but cool you know it's the end I'm like he saved her great I'm gonna get some popcorn you get the popcorn after the movie I got off on a tangent there but I think Wonder Woman's gonna be fun I think it's gonna be a fun movie I think it's gonna build nicely into",
      "start": 1500.4
    },
    {
      "text": "gonna get some popcorn you get the popcorn after the movie I got off on a tangent there but I think Wonder Woman's gonna be fun I think it's gonna be a fun movie I think it's gonna build nicely into the into the DC movies and I think we'll remember this one hopefully with fondly a year from now we go back yeah and do this again yeah I'm interested I I'm very impressed by the fight choreography in both the trailers I've been like holy shit like the action looks like it's shot different and choreographed different than anything else we've seen which I think goes a long way because these movies at this point we've seen it all so to see something new is nice but the humor I'm not down with like that the zinger at the end of the trailer where it's just like I like the first thing you're supposed to fight in this and then I like to the fisticuffs fisticuffs I like the crisis in the movie the first one when they did the whole like that slavery or whatever oh I like her and they walked away",
      "start": 1538.06
    },
    {
      "text": "to fight in this and then I like to the fisticuffs fisticuffs I like the crisis in the movie the first one when they did the whole like that slavery or whatever oh I like her and they walked away in the first one Roman trailer I enjoyed oh that's a good zinger a good stinger as they said and then yeah the fighting one at the end there like it's like oh it's so pretty forcing this one right here yeah I'm terrified about Wonder Woman cuz it's either gonna go 101 I'm concerned on the level that I feel they learn their lesson with Batman v Superman okay that was too dark people didn't want that we need to have some fun with this but Wonder Woman was already in production nearly done by that point so are they fucked and they're trying to shove reshoots in it are they gonna just let it ride or maybe it never was it dark but who knows and then the trailer for me personally don't excite me I'm not I mean I love Wonder Woman don't get me wrong I'm gonna be there I love DC obviously but nothing",
      "start": 1581.02
    },
    {
      "text": "it never was it dark but who knows and then the trailer for me personally don't excite me I'm not I mean I love Wonder Woman don't get me wrong I'm gonna be there I love DC obviously but nothing about him are making me I thought the fights look cool I like her outfit I like Gal I like Chris Pine but even watching them interact I'm just like alright yeah whatever I'm not a big fan of this setting I'm not a big fan of one Romans origin in general I've never really seen it well done as a comic book reader I feel I've never read a book and been like oh man yes but then again it's just cuz I just don't think I care about gods and goddesses and you know all the stuff in Zeus and like magic is always such a hold up for me and at both universes theme song though done done done so I mean I'm stoked for that but I'm also I also bet what's gonna happen is it's going to be it'll be the first good DC movie that everyone universally agrees and I won't like it I was like didn't work for me it sucks",
      "start": 1618.26
    },
    {
      "text": "for that but I'm also I also bet what's gonna happen is it's going to be it'll be the first good DC movie that everyone universally agrees and I won't like it I was like didn't work for me it sucks I can't be on board with anything I think you I think you'll like it I think I think I was gonna watch it like that was good my main thing is I feel I worry about being shell-shocked and like you know now I'm just like very like you're saying cautiously apprehensive where it's like I don't know man like I what you think I think DC nails the trailers trailers they generally nail for all these movies where I watch those trailers I'm like fuck that was awesome I can't wait for this so for me like there's when I watched the original Batman v Superman trailer I was like something's off here right and I knew I knew that movie was gonna be a little bit of a jumbled mess like there were great scenes in that from the announcement right I mean great scenes in it but then you see the trailer and",
      "start": 1655.42
    },
    {
      "text": "and I knew I knew that movie was gonna be a little bit of a jumbled mess like there were great scenes in that from the announcement right I mean great scenes in it but then you see the trailer and you're like there's just a lot of stuff going on in here and a lot of these elements don't mix like to put it in a cooking analogy it's like just throwing everything in the kitchen that you possibly can't have a pot hoping to God it tastes good and then the the trailer is a little bit of spoon that you put in front of Tim and he goes he does that thing where you look like a cat was like no I don't want that no no I don't want that Suicide Squad we obviously saw everyone saw the trailer and when you got you were stoked about it so it your your vision is history on this yeah that's quite trailer we're all like that looks fun oh no he's not he was never down no I know but he said everybody for a second there I'm saying I'm dialing it back here chief but what I'm saying is I look at the Wonder",
      "start": 1699.3
    },
    {
      "text": "we're all like that looks fun oh no he's not he was never down no I know but he said everybody for a second there I'm saying I'm dialing it back here chief but what I'm saying is I look at the Wonder Woman trailer like this looks like at least a cohesive film yeah it looks like it's gonna have a definitive beginning middle and end there's one character that we have to worry about and Chris Pine who was gonna be the love interest which is good it's fun to see that role reversal and the action looks cool that's all I need really that's all I need like I'll put it on it's probably hopefully fingers crossed the best we can hope for it's gonna be Thor yeah and I'm okay with honestly okay best we can hope yeah and I liked Thor I'd like to see that chemistry see I think the fact that it looks like Captain so much like Captain America to me and I wasn't a big Captain America fan it's like I wasn't either for a cop one yeah it has moments and I liked you know I mean like it did a good job of",
      "start": 1732.22
    },
    {
      "text": "captain so much like Captain America to me and I wasn't a big Captain America fan it's like I wasn't either for a cop one yeah it has moments and I liked you know I mean like it did a good job of establishing who Captain America was mmm Spider-Man Homecoming July 7th hell yeah I think that's gonna do super fucking well and I think yeah it's gonna be a good movie the question right now there's no way it can be bad Wow Tom Holland is awesome mm-hmm the Spidey suit is awesome they seem like they're nailing everything about it they're going the spectacular out they're killing what does that mean the age high school yeah okay my question for you Tim is the biggest Spider-Man mmm aficionado in the house do you think this is like okay finally we're gonna be on I mean on on the right you know a train as far as Spider-Man is concerned because we've rebooted this already twice do you think this is it like third time's the charm yeah I mean absolutely it's under Kevin Feige that's all that I",
      "start": 1773.06
    },
    {
      "text": "a train as far as Spider-Man is concerned because we've rebooted this already twice do you think this is it like third time's the charm yeah I mean absolutely it's under Kevin Feige that's all that I need to know to believe in this and we've already seen this character we've already seen him in the world so good it's fantastic everything about it's like oh shit this is this is what Spider-Man should be which is something that I the the Sam Raimi movies god bless them for their time even Spider-Man people love Spider-Man I love Spider-Man I no longer love Spider-Man now that we've gotten so much other stuff I'm like it's hard it's very it's very hard and also it's just like Tobey Maguire at no point was Peter Parker never Spider-Man in those movies at no point was Peter Parker Spider-Man he was just the guy that had Spider-Man powers like it never it had all the drama and I had all the like you know him fight with Harry and Mary Jane and like the dynamics between they're like",
      "start": 1817.94
    },
    {
      "text": "he was just the guy that had Spider-Man powers like it never it had all the drama and I had all the like you know him fight with Harry and Mary Jane and like the dynamics between they're like cool you got the drama down but they never nailed the fun ever whereas I think the Andrew Garfield it's confusing not gold barbed movies we're setting that up they those movies could have been fucking spectacular mm-hmm if they weren't trying to build a universe that was the problem they got way too ambitious they were just they had to chase this thing of there's gonna be a Sinister Six movie then there's gonna be a Venom movie then there's gonna be a Mary Jane solo movie or Aunt May solo movie like it's like no no no no stop just make a movie yeah if they had just done that I think those movies were doing great because he was fantastic Peter Parker was more Peter Parker than he's ever been the Spider-Man was making quips the action was great so much was good Emma Stone was fucking awesome so",
      "start": 1859.66
    },
    {
      "text": "doing great because he was fantastic Peter Parker was more Peter Parker than he's ever been the Spider-Man was making quips the action was great so much was good Emma Stone was fucking awesome so much was good yeah and then they just kind of went overboard see it's so funny to me that you guys say that I remember watching the first one thinking well they really nailed that like I liked that movie a lot and then the second one I'm like it was a little it was a sequel like it was you know oh 50% less than the other one but I still enjoyed it 50% harsh 0% less than the first one which is to say probably just pointing for you guys and then I got what came in like sort of looking at comments and talking to you and you're like I just don't like any of those movies I'm like no that's I don't get not me that's not my sense on this well I just mean like those movies I like I actually like them way more than anyone else does like me and Kevin both of us agreed that the amazing amazing",
      "start": 1908.5
    },
    {
      "text": "don't get not me that's not my sense on this well I just mean like those movies I like I actually like them way more than anyone else does like me and Kevin both of us agreed that the amazing Amazing Spider-Man it has its issues and we're not blind to them but it I thought that it nailed the the comic feel what again going back to Batman v Superman the thing I liked about it is that it does feel like you're reading a comic book and like there's a bunch of cameos and this villain and these characters are here for a second and you don't need to understand why unless you've read their series as well and it's a lot but Amazing Spider-Man felt like the 90s Spider-Man cartoon and that's that there was a million bad guys and Oh rhinos only here for three seconds and whatever but it's like that's fucking that's cool but it doesn't make a good movie that was I mean that I feel similar to apocalypse where I went saw Amazing Spider-Man 1 in theaters and I remember the lights came up being",
      "start": 1944.78
    },
    {
      "text": "fucking that's cool but it doesn't make a good movie that was I mean that I feel similar to apocalypse where I went saw Amazing Spider-Man 1 in theaters and I remember the lights came up being like oh that was fine those fun but it was getting it for it was you know should have been I love Spider-Man so much and it should have been for me a standout because I was such one in Spider-Man went into fan of Sam Raimi's work you know I mean of like and I read the comics watch the cartoons did all stuff like I like Spider-Man when lights came up I was like oh it sucks that was just another superhero film it was fun but I don't remember anything super possibly and so then I never saw two in theaters heard everybody didn't like it that it was gonna fuck up the entire franchise and then eventually watched it on an airplane and I watched it and I was like yeah this was totally fun this is fine like it's I don't I thought that it but I understand that it was Jamie Foxx's you know nerd is",
      "start": 1981.66
    },
    {
      "text": "watched it on an airplane and I watched it and I was like yeah this was totally fun this is fine like it's I don't I thought that it but I understand that it was Jamie Foxx's you know nerd is over-the-top nerdy all this other shit and it was but it was like he's got he's fucking made electricity or whatever I don't really care exactly I mean the movies had a lot of flaws but I think that what they nailed is the thing that's most important to me was that Andrew Garfield was fucking awesome as Peter Parker and Spider-Man together and that is why I believe in these movies so much because Tom Holland is also doing that so hopefully we'll see movies keep that up so the next up is untitled Fox Marvel film on October 6th so what that not happening October is it's either gonna be an X-Men movie or a Fantastic Four movie or the Gambit movie or Deadpool something or other or what I'm supposed to be it's Channing Tatum is doing a Gambit movie that's way down TBA it was supposed to be last year",
      "start": 2023.14
    },
    {
      "text": "or a Fantastic Four movie or the Gambit movie or Deadpool something or other or what I'm supposed to be it's Channing Tatum is doing a Gambit movie that's way down TBA it was supposed to be last year got pushed back to this year then it got pushed to just TBA right so we'll see if that ever happens I know this October Fox movie not happening and a year they're gonna pull a superhero movie out of their ass no way yeah not happening then Thor Ragnarok November 3rd 017 I can't wait for that I'm excited that's the problem right is that like Thor 1 & or like man whatever Thor Thor 1 I thought was surprising because I didn't give a fuck about Thor yeah and I went out like huh I kind of think Thor's okay yeah I like I mean if that yeah sure I kind of felt that way too I mean like I loved it when he smashes beer but it was just like weird and it was also the same thing at the time and that was like our first real introduction to magic as well in that universe we're like I'll never forget",
      "start": 2064.5
    },
    {
      "text": "when he smashes beer but it was just like weird and it was also the same thing at the time and that was like our first real introduction to magic as well in that universe we're like I'll never forget in that small town magic it's science shut up in that little in that town when the other three Norse gods were walking down the street and I was like that looks so fucking fake and real in the real world the way they're like that was also because of the way it was shot that I stand by the fact that as much as I love Canada Bronagh as a as a Shakespearean actor and for his work and everything else is done I did not like the direction of that movie but what I think were it excelled and where I'm excited to see if they can get back to you is I love the chemistry between him and Natalie Portman another relationship I was like this is one of the best relationships I've seen in this in this universe up to this point granted there's only four movies before it but I love watching those two act on",
      "start": 2112.24
    },
    {
      "text": "relationship I was like this is one of the best relationships I've seen in this in this universe up to this point granted there's only four movies before it but I love watching those two act on screen I love Chris Hemsworth just take your shirt off and make out with Natalie Portman in front of me and you get my money there you go and also add the Hulk and potentially Dr. Strange they're talking about being like a buddy cop buddy got buddy car really directed by the people that did What We Do In The Shadows oh the guy that did What We Do In The Shadows yeah we can never say his name what's the rumor isn't the rumor like the first 15 minutes there's no dialogue it's Hulk getting shot into space or something and then he lands and he runs and he runs around a corner runs into Thor and like that's the start of the movie haven't heard that that's all right like Planet Hulk's all stuff or this is a old right her it's inspired by that oh awesome well that guy makes sense right yeah last time they",
      "start": 2150.56
    },
    {
      "text": "the start of the movie haven't heard that that's all right like Planet Hulk's all stuff or this is a old right her it's inspired by that oh awesome well that guy makes sense right yeah last time they we saw him he was like flying away flying himself away uh Justice League November 2017 it's gonna kill numbers wise it's not gonna get good reviews the trailer that ice that stuff they released I was like this looks awesome this is what I want to see and I know that I'm totally the DC fanboy whatever I enjoyed Batman v Superman take it with a grain of salt whatever but like that interaction between him and the Flash I thought was awesome the Aquaman confrontation I'm like I want to see all this play yeah I do too like how much of it great I'm listen I'm still trying to find the my thing about the Thor thing how much of it do you think is that we're still reeling from the Nolan universe and that people just don't understand the vibe of this versus they I mean the granted they haven't really",
      "start": 2185.16
    },
    {
      "text": "Thor thing how much of it do you think is that we're still reeling from the Nolan universe and that people just don't understand the vibe of this versus they I mean the granted they haven't really nailed it that much but like this will be the first one we see where it's it is that sort of like kind of plucky like the athletes cut you're not sure if he's trying to act or not the entire time but it's fun yeah you know what I mean yeah I give him two more movies from like I get it they will fail with me right where at first I didn't like Will Ferrell I don't get this guy's humor and then finally I watch Anchorman for like the 15th time I'm like I get it I get what they're going for here he's got a question for you Tim yes how many more superhero movies are on this there's a lot 74 here's what I want to do this is gonna be an unheard of thing yeah I think we could make we'll make a break right here cuz topic two we're we're flirting with about and I think we can apply topic two to everything else",
      "start": 2229.4
    },
    {
      "text": "to do this is gonna be an unheard of thing yeah I think we could make we'll make a break right here cuz topic two we're we're flirting with about and I think we can apply topic two to everything else we go through and we can pick up right here with what we're talking about the DC Universe right all right that topic was brought to you by Squarespace whether you need a landing page a beautiful gallery a professional blog or an online store oh god it's all included with your Squarespace website now as you all know Nick Scarpino bless his heart years ago made kindafunny.com the original kindafunny.com with Squarespace it was a big help to us and I'll tell you why first off it was easy creating your website with Squarespace is a simple intuitive process it's got free custom domains that's right Squarespace makes adding a domain to your site simple if you sign up for a year you'll receive the custom domain for free plus it has beautiful templates design a best-in-class online store",
      "start": 2267.04
    },
    {
      "text": "right Squarespace makes adding a domain to your site simple if you sign up for a year you'll receive the custom domain for free plus it has beautiful templates design a best-in-class online store with Squarespace award-winning templates customizable settings and more all without a single plug-in and did I mention ladies and gentlemen and I know he didn't because I'm just reading right down the page that Squarespace offers 24-7 customer support every member of the customer care team is an experienced Squarespace user working in a Squarespace office no matter how technical your problem or trivial seeming your question one of the team is always online to assist you so start your free trial today at Squarespace calm and then our offer code Kinda Funny all one word to get 10% off your first purchase Squarespace set your website apart they didn't say that like extend it like that I just did it cuz I thought it sounded epic so topic two yes comes I was literally just text from patreon.com",
      "start": 2306.08
    },
    {
      "text": "purchase Squarespace set your website apart they didn't say that like extend it like that I just did it cuz I thought it sounded epic so topic two yes comes I was literally just text from patreon.com/kindafunny where our good friend Aziz of course hit us up with a topic he supported us for a month got his topic on the air and his topic is how far can goodwill or bad will affect a future project he says eg movie show games he has a bunch of examples right in a food he seems they've lost the goodwill he ever had with this this year with the release of Mighty No. 9 and record how far how this affect his things his future project then he says because of Suicide Squad and Batman v Superman people are not as excited I'm sorry people are not excited and more pessimistic about the upcoming Wonder Woman Justice League movies parentheses which is crazy but understandable how far do you think this will affect DC and then he goes on to Marvel and like so now we're right the same",
      "start": 2347.16
    },
    {
      "text": "upcoming Wonder Woman Justice League movies parentheses which is crazy but understandable how far do you think this will affect DC and then he goes on to Marvel and like so now we're right the same wheelhouse here so that's the bit I am I and when it comes a popular opinion on the DC Cinematic Universe and me giving them rope and like no no no they're trying to be grounded Batman v Superman is gonna play on that you're a lot of laughs you're like that like that was always my thing right of like you were disappointed managed to feel fine the trailers for Batman v Superman look like they're dressing that head on that's an awesome thing and then what I kept saying right is that Suicide Squad would be the most important movie in the DC Cinematic Universe because it would be the first one removed from Snyder and for them to say no no it's not Snyder being stupid this is the universe you exist in right where it's darker and it's real enough that in that totally didn't work out you know what",
      "start": 2393.18
    },
    {
      "text": "from Snyder and for them to say no no it's not Snyder being stupid this is the universe you exist in right where it's darker and it's real enough that in that totally didn't work out you know what I mean like the movie sucked on its own without Zack Snyder being at the helm of it right so I do feel that I worry that Wonder Woman I think there's goodwill behind Wonder Woman that'll benefit it because not Snyder did everybody like every you know every it seems like it's like Wonder Woman was awesome in Batman v Superman we liked her we liked Gal we want to see what she's gonna do with the character okay we'll go do that I still think it's gonna struggle a bit and then I think Justice League is going to review it's it's interesting because I do think that in a lot of ways and not for Suicide Squad but the and I'm not even trying to play like fucking internet comment or here stick with me but I do think that DC's been behind the eight ball from ever there's been bad will behind them",
      "start": 2433.9
    },
    {
      "text": "Squad but the and I'm not even trying to play like fucking internet comment or here stick with me but I do think that DC's been behind the eight ball from ever there's been bad will behind them forever you're just copying Marvel you're late to the game why are you doing this right so every time they come out they are a nickel and dime for everything they do wrong and they do a lot wrong don't get me wrong but these movies get put under the microscope and really fucking torn apart whereas like I criticize Civil War right and it was like what are you fucking talking about I'm like okay sorry you know what I mean like I think it's a good movie fine just wasn't for me but it's like there is that dichotomy and I think there is goodwill infused with that I think Justice League has a chance to be better than the rest critically and received by the community because I think it's going to be what people always want and that's hat in hand you were right it's going to be Zack Snyder and the cast",
      "start": 2475.26
    },
    {
      "text": "better than the rest critically and received by the community because I think it's going to be what people always want and that's hat in hand you were right it's going to be Zack Snyder and the cast they're gonna have to answer this question on every fucking interview they do from here until the Justice League 2 probably of hey we heard you loud and clear you you didn't like what we were doing you didn't like this we're making it lighter we're putting humor in there this is written from this is this is planned from ground zero that way rather than Suicide Squad where it was like oh fuck there's there a bad reaction there let's get some reshoots in there let's try to fix this movie and give people what they want even though it's too late I think them coming out and saying that and being like we listened and we're working on it and this is what I think people are gonna go in there more inclined to give them a chance whereas I think Batman v Superman was no no no fuck you Man of Steel",
      "start": 2514.34
    },
    {
      "text": "like we listened and we're working on it and this is what I think people are gonna go in there more inclined to give them a chance whereas I think Batman v Superman was no no no fuck you Man of Steel was Man of Steel and this is Batman v Superman Suicide Squad is gonna be Suicide Squad oh fuck it can't be do this no it's too late you're too late on trying to build your universe you're doing it too fast you're too late and trying to put this humor in there don't do it I think if they come out this is their first chance to walk out and be like all right we've heard everything you said this is our answer let's go from here yeah I know I just don't think it's it's possible I think it very well might not be yeah I mean I'm on the other side in terms of the goodwill bad will thing I just think they're like they've they fucked up so badly that the in terms of will that Justice League is dead on arrival in terms of people's thoughts everyone's gonna go into",
      "start": 2555.22
    },
    {
      "text": "bad will thing I just think they're like they've they fucked up so badly that the in terms of will that Justice League is dead on arrival in terms of people's thoughts everyone's gonna go into that you talk about the microscope I feel like it's same so much a microscope as much as just looking like making sure you have glasses on like because it's when you talk about the Marvel movies you get criticized because people go into the Marvel movies based on their track record of how good's this one gonna be yeah you know whereas people go into the DC movies how bad is this one gonna be yeah so it's totally just a different lens so being critical of Civil War people are gonna be extra hard on you because you're going the other way sure and like being positive about the DC movies you're facing the other phone in their crowd and it's just hard because those it's those movies are set up to be what they are and I don't think that Zack Snyder or any of them are gonna change this single thing I",
      "start": 2590.94
    },
    {
      "text": "the other phone in their crowd and it's just hard because those it's those movies are set up to be what they are and I don't think that Zack Snyder or any of them are gonna change this single thing I think there's a hat in hand at all I think there he did with like that I mean like the the long footage of Justice League was paired was the what came out a week and a half after that studio set visit they brought a bunch of journalists to in there they were saying that like we want you to watch us film this bet in this Bruce Wally scene we're trying but I mean I think that's it's more Barry sorry I think it's marketing less than actual we're changing the movie you know actually fixing the problems they're just saying hey but look at this you know it's more of a distraction than an answer and I just think that like there's at this point because of the because they've spent so long building this universe they're fucked like they're already down this path you can all of a sudden change",
      "start": 2631.22
    },
    {
      "text": "and I just think that like there's at this point because of the because they've spent so long building this universe they're fucked like they're already down this path you can all of a sudden change things like we're talking about what Hugh Jackman's Wolverine like it's been so long that him being the Wolverine that we need him to be is impossible in the same way it's like with Justice League well now there's a whole bunch of characters that are gonna be Batman Superman to like there's no way around that no way yeah and it's the question is gonna be is it better than Batman Superman or not it's not gonna be is this movie good there's like very few people out there believe this movie could be good I think I think that audiences hold grudges up until the point where you give them something really good so if for any reason Batman the Justice League was just by some miracle I don't think will be but by some miracle fucking amazing I think you would get every single person back on board on",
      "start": 2670.42
    },
    {
      "text": "good so if for any reason Batman the Justice League was just by some miracle I don't think will be but by some miracle fucking amazing I think you would get every single person back on board on that train is it like like that I just don't think that like I you see time and time again people try things or they do or they fail at these projects and yeah people love to hate but you know what we love even more than that redemption of redemption we love seeing that champ get knocked the fuck out and then train real hard and then fight again and did he win we don't know right there was all the X-Men movies exactly that's a great point that I was thinking when you said that of like how bad you like how bad X3 was and how I was like fuck the X-Men movies not like I made posts and you went out or something but then First Class came around you're like oh fuck but there's differences though and the difference there is that was a reboot that was a different set of directors and that was after a",
      "start": 2713.54
    },
    {
      "text": "something but then First Class came around you're like oh fuck but there's differences though and the difference there is that was a reboot that was a different set of directors and that was after a significant amount of time not reboot it was a kind of yeah but in the next one right Days of Future Past then reboot that kind of no First Class was a reboot of X-Men it's just it was still in the same timeline but it was still rebooted frame that's the that's their problem right there that was they stupidly decided they were gonna stay stick with a can of the old one they should have just completely rebooted it but can't I could get off tangent continue but I mean I I mean I think that First Class like that universe was definitely a reboot of the X-Men franchise and yeah had nods here and there to the other stuff but it wasn't till Days of Future Past that they're like cool we can make this work in parallel universes because that's what comics do and we're at a point where odd new",
      "start": 2756.34
    },
    {
      "text": "and there to the other stuff but it wasn't till Days of Future Past that they're like cool we can make this work in parallel universes because that's what comics do and we're at a point where odd new moviegoing audiences can understand multiple timelines and like this is Marvel 616 this is Marvel whatever the house a casual fan I didn't understand that the I thought Days of Future Past was a prequel to X-Men the Bryan Singer movies and so I went through and then we got Days of Future Past nobody just is it is he's just saying it's sort of they're taking some liberties with it and they've just they're trying to reboot it kind of it's a reboot not in the most literal sense but in a hey spiritual we're trying to you know kind of you could watch and not know anything about the other movies and still be fine sure totally fine but it still does play into the canon of the other movies yes yeah yeah it's still it's still in the canyon but it's still a reboot you know and in the Days of Future",
      "start": 2790.5
    },
    {
      "text": "still be fine sure totally fine but it still does play into the canon of the other movies yes yeah yeah it's still it's still in the canyon but it's still a reboot you know and in the Days of Future Past rebooted the timeline right yeah yeah yeah where we had agree disagree yeah yeah that look at your face like I'm still confused no I got it I just don't understand what the original argument does it just go doesn't matter then yeah I'm sorry so continue Deadpool 2 is the next one January 1 2018 Tim Miller here's the project here's an interesting one right this is gonna be this is gonna be a very very very interesting movie to keep your eye on because if it fails that's it's gonna be fascinating and people are gonna play a lot of fingers at Ryan Reynolds and the producers of that movie well what a definition of fail is what critically yeah it's gonna do numbers no matter what it's gonna do business no matter what because I think coming off of Deadpool people are gonna go no matter",
      "start": 2833.18
    },
    {
      "text": "well what a definition of fail is what critically yeah it's gonna do numbers no matter what it's gonna do business no matter what because I think coming off of Deadpool people are gonna go no matter what anyone says about it they're gonna go they're gonna they're gonna flock to see do you think more than saw Deadpool 1 yeah more than I think yeah because think about all this like think about how many people you've talked to that wouldn't even have thought to see that pull one of the theaters and are now they watch the fan because they watched it on demand or on on HBO or wherever it's on my wife included where she was like I should I watch this Deadpool my sister told me to see it I'm like yeah you should watch it that's fucking cool she actually liked it will she go see in the theaters no no that's a Tim and Greg movie yeah according to her I like that actually still says Mike P movie but she means you guys that's like he lives in LA no see I think that it coming out in",
      "start": 2880.58
    },
    {
      "text": "no no that's a Tim and Greg movie yeah according to her I like that actually still says Mike P movie but she means you guys that's like he lives in LA no see I think that it coming out in early 2018 is like perfect for it because any later I think it would have been too far out and there's a chance that lot of bad movies could happen that would cause people to be like I don't know but I think that that's a perfect time Deadpool 2 I think still gonna see that's what's interesting and it goes back to the goodwill bad will thing is I don't know I don't know how many I don't think you could have enough bad superhero movies to do it because I feel like bad superhero movies don't necessarily affect the universe or other superhero movies they affect that franchise huh and that's what I think is happening with Deadpool where it's like I love Deadpool I've heard all my friends talk about Deadpool Deadpool's coming back out hooray hooray we're gonna go see we're gonna go see it and",
      "start": 2913.54
    },
    {
      "text": "I think is happening with Deadpool where it's like I love Deadpool I've heard all my friends talk about Deadpool Deadpool's coming back out hooray hooray we're gonna go see we're gonna go see it and I think it's a goodwill thing of there's so much goodwill behind the name Deadpool as a movie the director who left I don't know his name and I don't know his work I understand as a person who has pays a little bit of attention to film that that's going to change the tenant tenor of the movie and all this different stuff but having Ryan Reynolds and TJ Miller and all the same people back I don't think you're gonna lose as much now of course I'm the guy who you know was like Oh Spider-Man 3 sounds like a lot of shits happening but I love Sam Raimi he'll fix I'll fuck you know you get burned all the time yeah I think I'm talking more about just timing if there was a lot of bad movies around it like I think that it's kind of it's kind of the the video game argument we always make where it's",
      "start": 2955.22
    },
    {
      "text": "the time yeah I think I'm talking more about just timing if there was a lot of bad movies around it like I think that it's kind of it's kind of the the video game argument we always make where it's like early in the year you know when games come out it has to breathe and I think that people would be like oh cool Deadpool yeah like they won't even think of it necessarily as a superhero movie whereas if it were to come out at a time when there's an Avengers movie and another X-Men and all this stuff I think Deadpool could kind of get be like oh yeah there's a Deadpool I'll watch it later gotcha you know moving on Black Panther Angela Bassett just joined the cast as the recording list today the thing with this movie is I feel like they just keep adding cast members yeah and they're not making a movie like how many cast members in this movie sounds like an amazing cast though and I was in it directed by Ryan Coogler the Creed doctor so it's like cool and this is another one of those like",
      "start": 2990.22
    },
    {
      "text": "a movie like how many cast members in this movie sounds like an amazing cast though and I was in it directed by Ryan Coogler the Creed doctor so it's like cool and this is another one of those like I would put this in the Doctor Strange Ant-Man category go ahead and impress me I've like it's your game to fail my friend exactly exactly exactly but I think the only thing I think that it has going against it and this is the smallest of things is that leaving Civil War I wasn't like man Black Panther was awesome in that movie and you were alone in that thought oh really yeah okay I don't I don't I I thought he was cool yeah I'm I wasn't like oh man I can't wait for the Black Panther movie but people are like that everyone else it might just be that I was so hung up on Spider-Man that I wanted Spider-Man so bad I loved Ant-Man's contribution and I loved Falcon and Bucky's interaction there was so much going on that was so awesome and I wanted to know more and give me another scene about",
      "start": 3032.5
    },
    {
      "text": "Spider-Man so bad I loved Ant-Man's contribution and I loved Falcon and Bucky's interaction there was so much going on that was so awesome and I wanted to know more and give me another scene about that this guy with his dad been grieving about his dad then in the suit and me going I don't understand his powers really the suits the suits made a like fucking Captain America metal but he is he strong super strong like what's his okay and he's got a cave yeah you know I mean I was like all right like but it's the same thing of like I didn't give two fine fucks about Doctor Strange before this I thought he was a stuffy old guy it turns out he's awesome at least movie so why not yeah I mean like the whole thing of yeah go in there make what you gotta make I'm sorry about it I predict Nick's gonna love this movie like Black Panther I really think he's gonna love it okay the Flash then March 16 2018 the Flash is one of the movies I could see disappearing you know what I mean I I don't quick",
      "start": 3077.7
    },
    {
      "text": "love this movie like Black Panther. I really think he's gonna love it. Okay, the Flash then March 16, 2018. The Flash is one of the movies I could see disappearing. You know what I mean? I I don't quick. No, I I feel like that one could fall off the radar because correct me if I'm wrong, there's not a lot of concrete information on Batman, the Batman, Ben Affleck's Batman movie, right? Batman right now is untitled Batman tentative for March 2018 directed by like written starring Affleck and starring Joe DiMaggio. And the thing with that is that that date of March 2018 came from an interview they did where they said it was going to be I think like eight months after something after Justice League or so. Gotcha. There's something that they did that got us to March and what's what's the Flash date right? Because we're in 20 the Flash date right now is March 16, 2018. Yeah, I see. I think I think it's the thing we're talking about. I think everybody's gun shy right now based on Batman v Superman. I think you have",
      "start": 3116.82
    },
    {
      "text": "we're in 20 the Flash date right now is March 16, 2018. Yeah, I see. I think I think it's the thing we're talking about. I think everybody's gun shy right now based on Batman v Superman. I think you have to get Justice League out to see what people think of this Flash and I think DC is very like after Suicide Squad, you know, bombing critically. I think everybody's like what do we do? Hold on, Jeff Johns, what you know, you're in these meetings now what are we not very the lead Batman exactly exactly. And that's the same thing remember too that they were like all right, we are making another standalone Superman movie like that wasn't they had this whole docket right? Oh fucking 2010 II with 2000 with Green Lantern and then finally like oh fuck we'll do a Superman movie too. So it's like all right you're you're you were you thought everything's gonna go amazingly from the core you'd be able to expand the core is not stable so let's drop the Flash, let's drop Cyborg let not drop these characters like",
      "start": 3168.02
    },
    {
      "text": "you're you were you thought everything's gonna go amazingly from the core you'd be able to expand the core is not stable so let's drop the Flash, let's drop Cyborg let not drop these characters like never to have them again but like push their movies back get the Superman and Batman movies done get Wonder Woman out there get another Justice League maybe I don't want to but just leave yeah the Ezra Miller real interested in this guy fantastic visa where to find him I was like watching the movie I was like who the fuck is this yeah it took me a while too and I was like oh it's the Flash and I was like I don't know I'm not sold yeah I'm really not sold I didn't like him too much in the trailer and I fantastic be something yeah he's a really good actor what's the movie I saw where he was having I just saw the lady else too I can't remember was look at you guys keep talking big calves on it look like he keeps popping up and random things yeah it's not the fucking Flash he had long hair",
      "start": 3208.14
    },
    {
      "text": "I just saw the lady else too I can't remember was look at you guys keep talking big calves on it look like he keeps popping up and random things yeah it's not the fucking Flash he had long hair and he had sex yes somebody what what are we thinking but I remember he got a nosebleed oh I've almost got it I'm not gonna look at the screen I want to say it's something like this is 40 or no Trainwreck he was in Trainwreck right yes he was like was he was the one he was he was at mom's house right yeah yeah yeah yeah yeah yeah what I what I appreciate at a from two fucking seconds of as remiller is the Flash in that Justice League thing where it gets to talk is that he doesn't sound like Grant Gustin he is clearly some other he seems like he's a an indoor kid Flash you know he's got all his Rick and Morty things playing and he's sitting there and he's socially awkward and he's very different and I like that idea of a character of like okay cool what's gonna happen with that but I",
      "start": 3251.94
    },
    {
      "text": "his Rick and Morty things playing and he's sitting there and he's socially awkward and he's very different and I like that idea of a character of like okay cool what's gonna happen with that but I don't know anything about it in terms of like if that was just him being awkward with Bruce Wayne and Batman or if he's like that all together because he gave me that a Sheldon from the Big Bang Theory kind of vibe yeah yeah interesting see that with powers like why not yeah okay and we've talked about this million times with the Justice League trailer but like for me I loved it when he was just like I'm joining you yeah and I'm like oh that's awesome like you're just stoked about this but then he goes a little too far and I'm like no don't do that please don't do that you know what that but that's the thing like that is that's one of those things I'm like the trailer guys should have cut that out they had a perfect beat where he was like I'm in he's like really yeah that was that was it was",
      "start": 3299.38
    },
    {
      "text": "the thing like that is that's one of those things I'm like the trailer guys should have cut that out they had a perfect beat where he was like I'm in he's like really yeah that was that was it was so that is so that one example is so it's such a kind of shines a lot of light on where their heads are at with with this whole thing is it just doesn't have the finesse that what the Marvel films do but that's why I'm interested to see what Jeff Johns does like I'm sure he'll come in and be like okay let's let's start to just sculpt this thing toward something that we would consider in the animated realm being a success yeah I don't know the Flash is gonna be very interesting and see how it all plays and it's another thing too of like goodwill bad will kind of thing of like the Flash on TV is the best live-action superhero show I've ever seen it's nailing it it's consistently amazing it's in season 3 right now what I mean what are you talking about like the from Flashpoint on yeah I like",
      "start": 3335.5
    },
    {
      "text": "the best live-action superhero show I've ever seen it's nailing it it's consistently amazing it's in season 3 right now what I mean what are you talking about like the from Flashpoint on yeah I like that fine I like the Eddie of that I like that's time of the day then okay fine we are okay yeah I mean don't be wrong I whatever the season's over because season one was like some of the best television of all time for superheroes but anyways back to the point is that the Flash TV show in Grant Gustin's portrayal of Barry and Flash has ruined the Flash comic for me to where I try to read the Flash comic and I'm like he doesn't look like grant grant want to do this this isn't how the that's great dude it's great there but like the problem is now I'm not alone in that yeah like you know what I mean you're going to get a bunch of DC fans who step in and are like that's not how we did it and I don't based on what they're showing the fact they're going so drastically different with this the",
      "start": 3376.14
    },
    {
      "text": "I mean you're going to get a bunch of DC fans who step in and are like that's not how we did it and I don't based on what they're showing the fact they're going so drastically different with this the suits different even when Jeff Jones talks about the powers right he doesn't talk about him being fast he talks about him being able to manipulate like time and space mm-hmm and that's really cool and interesting and I want to see how they play with all that yeah no I'm interested I'm shocked that you think that they're gonna maybe drop them the Flash movie because I think Flash is definitely there after Wonder Woman they're they're next in line yeah but I think you gotta get Batman and I agree yeah and especially look at that timing it's like I feel like Batman I mean in my opinion they should just just just do Batman I mean Batman and if other people make cameos cool but just think that man hey who's yeah I mean who's the villain of the Flash fucking Lord if I know exactly because",
      "start": 3420.1
    },
    {
      "text": "should just just just do Batman I mean Batman and if other people make cameos cool but just think that man hey who's yeah I mean who's the villain of the Flash fucking Lord if I know exactly because there's no no they don't have an announced one but Deathstroke we know in Batman and he's been cast and here's this CG fucking thing of him from the Justice League set I'm like okay I wonder what's gonna your money into where we're going yeah it's because if they drop Flash like straight-up drop Flash everything after that's dropped all the other guys sure I mean that's what I'm saying I don't I don't hold that hope for the Flash happening there I don't hold off Aquaman I don't is is Shazam still on there yeah yeah yeah so okay so then moving on they would be dumb to not do Shazam because they have the rock in it do they though cuz that was something that got announced forever ago and then I rarely ever hear about it and once Flash wore the black Adam shirt and it's just like okay fine but",
      "start": 3454.24
    },
    {
      "text": "have the rock in it do they though cuz that was something that got announced forever ago and then I rarely ever hear about it and once Flash wore the black Adam shirt and it's just like okay fine but again everything is fucked right now yeah you have to fix everything we can't fix it is the rock yet here's the thing if Marvel somehow swoops it against the rock that's just like the vital you're done you're done buddies but but we'll see Avengers Infinity War on May 4th 2018 that's one of those ones that why it's gonna sneak up on us I think I think it's just like it's far out now they're doing infinity one and two right so naming it's now Avengers Infinity War and then the second one is currently untitled Avengers movie so it'll be Infinity War two yeah under different outlet whatever the fuck they call it yeah but they are did that that is a two-part story of the well it was originally pitched that way but it sounds like I mean it's yes okay but it's gonna be it's not titled that",
      "start": 3491.0
    },
    {
      "text": "the fuck they call it yeah but they are did that that is a two-part story of the well it was originally pitched that way but it sounds like I mean it's yes okay but it's gonna be it's not titled that though cuz there's no way they can do that justice in one movie oh yeah they have to do those that has to be split into two and it has to be I mean it's at least how things are going now from what we know about it I would imagine that phase one is the more getting the B tier guys together just Guardians of the Galaxy and Doctor Strange and whatever and all them kind of being there and then for the second part whatever the fuck it ends up being called bring Captain America and Iron Man and the war and all those guys huh you think that's all it goes yeah I think the thing up I think the first one is the core like B tier Avengers on these fucking assholes nobody cares about and then bringing in then you have to get Captain America and Iron Man to pair up and then they look out and they",
      "start": 3539.04
    },
    {
      "text": "one is the core like B tier Avengers on these fucking assholes nobody cares about and then bringing in then you have to get Captain America and Iron Man to pair up and then they look out and they realize they need or even if they somehow get it but I get Guardians in there and get everybody else Doctor Strange all the people that are like on the outskirts yeah to be together and then but then you cut it like right as they know shows up yeah let's see I don't know there's there's a couple ways they can can play it because there's multiple movies before then so I don't know where things are gonna kind of shit yeah we'll see how many of that because I could easily see them going that first one is him getting the the last Infinity Stone mm-hmm I'm like forming the gauntlet like halfway through and then the rest of it's just like like they get destroyed and then the first movie the next movie is like bringing that plan back yeah it's good gonna oh my god fuck yeah I can't believe we're",
      "start": 3579.6
    },
    {
      "text": "and then the rest of it's just like like they get destroyed and then the first movie the next movie is like bringing that plan back yeah it's good gonna oh my god fuck yeah I can't believe we're here I can't believe we're gonna see like but after this we're not gonna get that we're not gonna get them like some of those iconic shots like we're not gonna get the shot of Wolverine with the claws hanging in the fence and things like that cuz you just can't do it but yeah yeah I mean that's those are the ones that gets exciting because I think it's what's exciting now is seeing everybody meet because then it is again we get that Avengers moment that we all loved so much of these characters we knew from different things to come back together it's the first time we're getting that in a real grand way sense Avengers we've gotten Civil War to an extent but even that was still introducing new characters I think that infinity war is gonna be that like holy shit mom yeah they could have been they",
      "start": 3615.24
    },
    {
      "text": "way sense Avengers we've gotten Civil War to an extent but even that was still introducing new characters I think that infinity war is gonna be that like holy shit mom yeah they could have been they could have been a lot more with Civil War too that could have been two-parter if they wanted to but they did it justice yeah then very quickly after that July 6, 2018 Ant-Man and the Wasp that's fun yeah interesting that's cool that Wasp is an in the title so we'll see I think that could be fun with the two of them I liked them in Ant-Man I think that I think that this one has a potential to be better I hope she's not wearing the wig again I just I just hope she's not wearing the wig I don't understand why they make him wear wigs I'm like I just let her hair be whatever it is then untitled Fox movie July 13th, 2018 who knows that's at the point that maybe that's long enough for it to be something but at the same time it's like I'm really interested I just I'm just holding out that Marvel and",
      "start": 3648.92
    },
    {
      "text": "July 13th, 2018 who knows that's at the point that maybe that's long enough for it to be something but at the same time it's like I'm really interested I just I'm just holding out that Marvel and Fox figure it out and just go because otherwise there's rumors of like oh they're gonna read do another reboot of the Fox of X-Men so it's a total new start without Hugh Jackman being Wolverine it's the Dark Phoenix saga saga but Jean Grey still Sansa from Game of Thrones and it's just like don't do another fake-ass reboot like oh yeah start from scratch scratch go all the way down yeah with Marvel or just don't yeah for a while Aquaman July 27th, 2018 directed by James Wan a Furious 7 fan see I still think you're talking about like you know behind Wonder Woman flashes the guy right yeah right now I would agree with that I still think Jason Momoa could kill it in Justice League and be the awesome like holy shit now I said that there could be the thing with Batman Superman before we knew it",
      "start": 3689.92
    },
    {
      "text": "now I would agree with that I still think Jason Momoa could kill it in Justice League and be the awesome like holy shit now I said that there could be the thing with Batman Superman before we knew it right like I was thinking he might have a Hulk like moment or whatever you didn't like his moment in that moment oh yeah there's too much moment there's too much moment Batman again another one of those things like something this is the problem they have too many fucking voices in the room because you know someone was like got what why are we still on this shot yeah and then some execs like well we have to remind people there's an Aquaman we'll be coming up and then some of the other the first guy ones like they get it they know what it is that's right it's not the whole thing just do the eyes just do the flash eyes that's awesome guys like I think we should make sure I think we should make sure anyways I think he could be cool and because people love Jason Momoa and I feel like you guys",
      "start": 3740.92
    },
    {
      "text": "just do the flash eyes that's awesome guys like I think we should make sure I think we should make sure anyways I think he could be cool and because people love Jason Momoa and I feel like you guys are bigger than movies yeah they do shut up why do they love Jason Momoa Game of Thrones right Cal Drago what season when's the last time we saw him do anything that was fun and that's a question I have over like I was about to say before I was rudely interrupted of you guys know more about movies and stuff that you have you been in other stuff has he been doing stuff no that is weird really he did that is weird I think he did a bad Conan the Barbarian remake that takes I think that was I do think that's true and then the rock did a Hercules remake that was a lot like that and they both tanked it didn't matter um non-sequitur I just thought I'd call that out just exactly movie um Jason Momoa here we go he's in Baywatch with the rock that's fantastic oh wait no maybe no that's he's he was",
      "start": 3781.76
    },
    {
      "text": "it didn't matter um non-sequitur I just thought I'd call that out just exactly movie um Jason Momoa here we go he's in Baywatch with the rock that's fantastic oh wait no maybe no that's he's he was on the Baywatch TV show my apologies oh god who is he on the Baywatch TV show he's price there's a Baywatch TV show currently no no no I was about to lose my man I thought Jason Momoa was like on Baywatch like the fucking knockoff day was like 2 p.m. on CBS that we amazing that'd be probably greatly for his career at this point um no I mean the thing is I'm not knocking Jason Momoa I loved him as Cal Drogo but he got really big really fast as that character look at that lifeguard a young Jason Momoa that guy Jesus Christ I mean I would fuck that guy's when I'm all right open here moving on one that I'm fucking so excited for animated Spider-Man movie December 1st, 2018 that could be awesome who's voicing it do we know no we don't know we don't know much about it we know the producers and",
      "start": 3820.6
    },
    {
      "text": "that I'm fucking so excited for animated Spider-Man movie December 1st, 2018 that could be awesome who's voicing it do we know no we don't know we don't know much about it we know the producers and it's the the typical Marvel people so when you say animated you mean like wide release animated animated the on the level release theatrical Pixar movies yes that's really cool that's gonna be put on the back shelf you think yeah I Tom Holland's gonna come out and be awesome and they're gonna like let's keep yeah but he could be the voice then why would they make an anime movie make it number two I'm with Kevin on this one same reason why they would make a Lego Batman yeah but I mean animated you know it's Disney sure but I still think from when you say Spider-Man animated movie I think the DC animated movie I think direct to your console your DVD shelf I hope it's not I know no no no no no no no no no let me dial it back dial back what I'm you're I'm in your world you're correct it's",
      "start": 3873.12
    },
    {
      "text": "DC animated movie I think direct to your console your DVD shelf I hope it's not I know no no no no no no no no no let me dial it back dial back what I'm you're I'm in your world you're correct it's theatrical and I'm saying as a typical movie going person I'm like Oh Spider-Man movie they're putting theaters that's weird I'm not gonna go see that I'm not gonna see a cartoon in theaters a Spider-Man cartoon that I could see on TV or on my DVDs you hate an ass hater I am a hate an ass hater waiting to do by who's gonna get spectacular Spider-Man season 3 but in a movie right wise man is very busy he's working on young justice he doesn't need you getting in his ears anything I bless him for that no but at the same token you'd see Lego Batman I think it'll be the same but again that's totally different Lego Batman isn't like we're trying to tell you a real Batman story we're like we're in the Lego universe and it's fun this could be too right this could be a kid's version of like more",
      "start": 3911.32
    },
    {
      "text": "different Lego Batman isn't like we're trying to tell you a real Batman story we're like we're in the Lego universe and it's fun this could be too right this could be a kid's version of like more like a Pixar film it doesn't have to be like an intense but when's the last time I went saw a Pixar film in theaters you know I mean that's what I'm saying you're a monster I am you're right everybody I grew up I want to see pussies when I go to the theater big ol vaginas and that's important you're watching porn they don't show us in theaters we don't know what this is rated maybe if then maybe super well yeah it's like Mary Jane get over here then with me yeah captain that milf Captain Marvel March 8th, 2019 Brie Larson another one of those things I would have had no fucking faith in this but now Ant-Man and Doctor Strange I love Brie Larson so I'm like cool hundred percent fucking cool and that's what they're killing with it's like all right cool this is why Marvel's so great we nailed the",
      "start": 3951.28
    },
    {
      "text": "Ant-Man and Doctor Strange I love Brie Larson so I'm like cool hundred percent fucking cool and that's what they're killing with it's like all right cool this is why Marvel's so great we nailed the foundation now we're building on it and we've now proven with you look back at all Ant-Man and now Doctor Strange that we can do characters you in Guardians of the Galaxy that you don't know or don't necessarily care about and we're gonna put people you do care about into those roles and here we're have a fun movie and that I think is the question of going back to Colin's argument of when's the bottom fall out I think it's when is a character gonna be announced where his or her first movie is a failure and we're looking at Black Panther we're looking at Captain Marvel like there's gonna be opportunities for that to occur sure but we'll see then Shazam April 5th, 2019 with the rock I wish I wish but no I don't think that happens on that I don't again they fucked this up if they really like",
      "start": 3993.8
    },
    {
      "text": "for that to occur sure but we'll see then Shazam April 5th, 2019 with the rock I wish I wish but no I don't think that happens on that I don't again they fucked this up if they really like they could have solved all their problems if they would have understood what the problems are gonna be which everyone told them where they're gonna be hey we need humor we need color we need fun all right let's cast the rock as Shazam and he you know he goes from being a seven-year-old boy to being someone on par with Superman who is the rock and have the rock do the whole like oh gee I didn't know what I was doing like that fucking movie would be amazing and killing instead it's he's black Adam and it's gonna be like a super dark Captain Marvel but it boils down to economics right you can't if you want to lock him in you want to lock him in five movies you can't afford the rock for that much you got to have him in one movie as black Adam and then maybe come back again be amazing if he could be a",
      "start": 4035.64
    },
    {
      "text": "to lock him in you want to lock him in five movies you can't afford the rock for that much you got to have him in one movie as black Adam and then maybe come back again be amazing if he could be a main character and main staple I'm no you give me the the stiff bottom lip there but I just like the rock that's why I think we'll have to see how the rocks career goes but his his he's like the biggest entertain name entertainment right now yeah by far so you know and he's not slowing down like that guy has his shit together so I predict he runs for president no I know I know me too I'd prove I would vote for him I really think he's gonna that would be fucking amazing amazing but Kanye is gonna beat him to it first yeah the rock one was on you stays in the hospital Avengers sequel May 3rd, 2019 that'll be the end of phase three as we know it then Justice League sequel June 14th, 2019 we'll see I don't know like that's the thing I'll be there you think and what year is it 2019 is where we're",
      "start": 4078.0
    },
    {
      "text": "that'll be the end of phase three as we know it then Justice League sequel June 14th, 2019 we'll see I don't know like that's the thing I'll be there you think and what year is it 2019 is where we're at now I think that I think that I think that doesn't move I think you have to have just Wonder Woman obviously Justice League the next Justice League and I think it's where you move Flash and Aquaman and Shazam and you figure out where the Batman is and you figure out where Superman is and then you figure out where the bat who is because Batman kills jumping ahead and jumping around a little bit just to close out DC we got Justice League sequel June 14th then Cyborg April 3rd, 2020 then Green Lantern Corp Green Lantern has a shot I think July 4th, 2020 because there they there was a news article we did on Colin Greg live yesterday that there's a key scene or whatever where a Green Lantern member is gonna be somehow involved yeah in a Justice League the next just as a thing the Suicide",
      "start": 4113.36
    },
    {
      "text": "we did on calling Greg live yesterday that there's a key scene or whatever where a Green Lantern member is gonna be somehow involved yeah in a Justice League the next just as a thing the Suicide Squad to know TV a Dark Justice League TV a that's Constantine and all sure but that's they're putting on animated film now they dropped the fucking ball on that by taking away from Guillermo del Toro years ago like that would have been hey let's do something really cool and different and crazy all right go for it then Harley Quinn solo movie slash Birds of Prey movie see I think the Harley Quinn solo movie could happen will happen before Suicide Squad so that's that's the rest of DC that we know of so far but you put it's her and Jared I mean it's Harley Quinn whatever but it's got him yeah I don't know we'll see I just I think this is I mean we're still in the goodwill bad will topic and I think that's where it is it's just like there's bad will behind that DC you can't give him the benefit",
      "start": 4165.36
    },
    {
      "text": "know we'll see I just I think this is I mean we're still in the goodwill bad will topic and I think that's where it is it's just like there's bad will behind that DC you can't give him the benefit of the doubt so the thing it's all the benefit with with looking forward at all the DC shit we have what would it take for DC to stop in the same way that X-Men seems like they're about to stop I think it would have to be they stop making money that's the big thing is long and like it's that thing of um this is a very similar argument I would say to the video game industry of all right critics don't like this but there are fans that do when they're buying the games and they're buying season passes and so it doesn't matter how many times Colin will be like don't buy a season pass what are you doing wait until you see I buy the season pass when I like a game right and it's the same thing with like I know you're a comic book fan obviously and so I don't get wrong you know Batman v Superman is",
      "start": 4204.36
    },
    {
      "text": "wait until you see I buy the season pass when I like a game right and it's the same thing with like I know you're a comic book fan obviously and so I don't get wrong you know Batman v Superman is far from perfect but I enjoyed it for what it was it was a it was an issue I read and like I said when people wanted to fight me about it back in the day because now I'm just beaten into submission I'm like I don't want to talk about this ever again please I that Batman v Superman was better than dozens of comics I've read in the DC Universe in the past year let alone the hundreds of DC Comics I've read throughout my life you know what I mean like it wasn't like there was nothing in there to salvage and enjoy so I went enjoyed it and then I still enjoy Flash and I still enjoy the comics I still enjoy all these different works of it so it's like as long as they're not making them like I what would it take for them to stop like they'd have to they either go so bland that there's nothing to",
      "start": 4246.0
    },
    {
      "text": "enjoy all these different works of it so it's like as long as they're not making them like I what would it take for them to stop like they'd have to they either go so bland that there's nothing to enjoy or go so crazy that Superman is tearing out hearts and shit you know like what the fuck is this this is not at all what this character is because even as Man of Steel flawed in so many ways I always talk about you know the scene spoilers from an associate where he kills Zod and how some people were so bent out of shape about it and I left the theater bent out of shape about it too because it was an unearned moment I thought that scene was great in terms of like when he cracks it just not like the effects in the fight because there's many problems that but when he cracks his neck and then has that moment and screams and Lois comes in and hug like that part that what that part it's like fuck that was awesome and they didn't earn this they didn't know they didn't make me care about",
      "start": 4285.2
    },
    {
      "text": "then has that moment and screams and Lois comes in and hug like that part that what that part it's like fuck that was awesome and they didn't earn this they didn't know they didn't make me care about Superman in this film to this point like this they didn't make me care about Lois in this film to this point they didn't make me care about Zod and you know I mean but like outs in a vacuum of what it is and knowing and inferring all this stuff there's something there that I liked about it and I can take away from it mm-hmm yeah I I'm interested yeah what do you think I don't I don't know I don't know I mean cuz yeah these movies are gonna keep making money and I think that for me it's I don't think they'll straight-up stop but I do think that there is a chance that soon like sooner than later and I think it could be real soon they just go all-in on Batman and Harley Quinn and that's it you know like all the the post Justice League like Justice League is obviously happening but after that",
      "start": 4324.72
    },
    {
      "text": "and I think it could be real soon they just go all-in on Batman and Harley Quinn and that's it you know like all the the post Justice League like Justice League is obviously happening but after that I don't know I can see them just making well here's a Batman movie and here's a Joker movie like we'll call it Harley Quinn whatever but you're just gonna get those and all these other characters that are now in the universe they'll be here for this or this or whatever like here's a joke or here's a team-up for a second but like Wonder Woman has coffee with Batman it discuss what's happening exactly exactly but it's almost at a point of just like why why even try building all these things because they're not gonna do as well as a Batman movie would yeah so if it is about the money when when do they just be I find we lost in terms of building the universe not in terms of money they're making money I think a big tipping point for them will be Justice League like once that movie comes out",
      "start": 4366.56
    },
    {
      "text": "do they just be I find we lost in terms of building the universe not in terms of money they're making money I think a big tipping point for them will be Justice League like once that movie comes out that's that they have a lot riding on that because no matter what they cannot you're right I mean the problem is what they should do is focus on those one-off movies and make them as good as humanly possible what they're not what they're not doing is exactly that what they really need to do is do what Marvel is doing which is make every movie as good as humanly possible and have someone over you know really overseeing the entire process to make sure the overarching story is something is something of sheer art and beauty but yeah I just don't I think that it's gonna be just a slow crawl toward that bottom line that threshold over the next like two years to the point where they finally just go we got we got it two years I mean I I the problem I in this is called three years then see I would",
      "start": 4405.64
    },
    {
      "text": "that bottom line that threshold over the next like two years to the point where they finally just go we got we got it two years I mean I I the problem I in this is called three years then see I would think of five because of the way the movie industry works I feel like and again you know better than I do but I feel like in terms of what it is it's such a train lumbering down the tracks that even when it is like oh fuck pull they didn't like Batman v Superman suicide squad still fucked Wonder Woman possibly fucked Justice League they've got a retool everything they're working on but that's that's why I'm saying like I look at like Justice League when that they'll know by then how much of a success or not success you know Wonder Woman was they know that Suicide Squad was kind of a failure from the fans perspective you know it made money those movies were already in the works all this stuff has already been in the works so the question I have now is like where how is how much influence",
      "start": 4440.36
    },
    {
      "text": "from the fans perspective you know it made money those movies were already in the works all this stuff has already been in the works so the question I have now is like where how is how much influence does Geoff Johns have over everything going forward from here like when they brought him in was he like yo let me see that script from for Justice League right fucking now like I don't care if we're still shooting we have to nail this we need to take a step back and if they're giving him that luxury I think he can really do it but or notably in 2018 when Disney by CC and changes the entire game that could happen at any moment that could happen that would be insane yeah that would be awesome though it would be fucking crazy finishing out the topic just to go through the rest of ones we haven't named yet on the Marvel side we got untitled MCU movies on May 1st 2000 July 10th 2000 and November 6 2000 which is in line with what they've been doing where there's been two or three and about that",
      "start": 4479.08
    },
    {
      "text": "named yet on the Marvel side we got untitled MCU movies on May 1st 2000 July 10th 2000 and November 6 2000 which is in line with what they've been doing where there's been two or three and about that time of the year every year then Deadpool 3 is the last thing on the the list and there's it's TBA we'll see if we get there okay we'll check back in three years mm-hmm see how we all did your phone case man that the texture of it no it's something's wrong with you what you do what's the housing is it all bubbly that's the lecture it's leather why isn't well why is this this texture isn't there it used to be way nicer thank you Kevin's like one in the parts just because okay cool okay cool everybody be chill okay next topic my topic I want to talk about failing as a fan just failing as a fan ladies and gentlemen it comes in and feeling oh it's not on the fan is failing it's not Nick turn it up no no feeling is a fan of something obviously you want you know or that you like you know I mean",
      "start": 4524.04
    },
    {
      "text": "and gentlemen it comes in and feeling oh it's not on the fan is failing it's not Nick turn it up no no feeling is a fan of something obviously you want you know or that you like you know I mean not family isn't floor fan here but if you have stories about oscillating fans failing you please let me know um no I've seen about this the other day of like you know it's weird for us to have an audience and all these different things and how hard it is to communicate what happens on our side of the screen versus what's happening on theirs and it made me think back to everything I've been a fan of in all the things and there's there's there's a story I regret very very much now being an adult and now understanding things is it the one where you pooped in the bushes in front of the small Asian kid no that was with guy pooped in front of Colin and the yeah the little boy was there too he was like 15 but I don't regret that no that was great content for this this whole channels built on me",
      "start": 4573.64
    },
    {
      "text": "kid no that was with guy pooped in front of Colin and the yeah the little boy was there too he was like 15 but I don't regret that no that was great content for this this whole channels built on me pooping in that bush and the raccoons and the raccoons yes that's a big point no um this is funny too because I was I looked at my topic list on things I should talk about on the show eventually and this one's there and it's a Weezer story and I didn't I was wearing my Weezer shirt today boy just happens just happens um I was huge Weezer fan back in the day still at my obviously but since 94 along along for the ride with the blue album right and when I got the blue album on the back it had a thing about joining the Weezer fan club and I wrote in join the Weezer fan club right and you get a little laminated card which I got rid of years and years and years ago and I regret to this day that I did but then the best thing was you got this thing called the Weezer zine when zines were still a",
      "start": 4614.84
    },
    {
      "text": "laminated card which I got rid of years and years and years ago and I regret to this day that I did but then the best thing was you got this thing called the Weezer zine when zines were still a thing right yeah and it was a it came out I want to say quarterly or whatever and it had fan letters in there and art from the fans and then like you know photos of like Pat Wilson or whatever at a birthday party like little updates about what's happening with Weezer and stuff but it was mainly fan stuff and then of course like you know there was such a drought between like Weezer albums and stuff you know Pinkerton happens and then it's just off the rails of like is there ever gonna be anything else or in the long lines but even the lead-up to Pinkerton I remember being hard that there wasn't as much stuff as you wanted this before the internet was really all over the place it's hard to keep up they were you know the rentals had come along too they were getting I'm gonna out track I remember",
      "start": 4655.0
    },
    {
      "text": "much stuff as you wanted this before the internet was really all over the place it's hard to keep up they were you know the rentals had come along too they were getting I'm gonna out track I remember at one point and I forget how I'm it's 94 so right I'm 11 then in that we'll say I'm left between 11 to 13 when this happens or whatever but I'm getting the Weezer zines I like them all much and I remember drawing some I was drawing comics as you know we've talked about my stuff here all right my hustle yeah the froggy comics or whatever and I had a character in there and again and one of these things maybe it's just doodles but I you know Weezer man something totally lame but it like yeah exactly what a man and froggy we demand froggy out there having adventures yeah exactly but I drew an image of Weezer man and sent it in to the Weezer fan club and I left and I sent like a super passive-aggressive note of just like hey submitting this and this is like paraphrasing obviously would love",
      "start": 4691.4
    },
    {
      "text": "of Weezer man and sent it in to the Weezer fan club and I left and I sent like a super passive-aggressive note of just like hey submitting this and this is like paraphrasing obviously would love to see it in the magazine and I think I deserve it because I've been a Weezer fan for a long time now and it's been hard because there's no new music and what's happening and really like a whole like hey like I'm owed this you know what I mean I'm fucking owed this so stand them huh Stan you're yeah exactly I didn't threaten like murder people or whatever but I was like you know I'm I in my head I'm writing into Geffen Records some some you know whatever interns getting this seeing it putting together this Weezer magazine why wouldn't they just put this in there whatever maybe I had done it multiple times this was like my final straw thing I don't recall anymore but I remember this very specific one that sounds very possible exactly right and so cuz I'm a dumb kid obviously you don't know how",
      "start": 4727.92
    },
    {
      "text": "times this was like my final straw thing I don't recall anymore but I remember this very specific one that sounds very possible exactly right and so cuz I'm a dumb kid obviously you don't know how the world works and you send it in you think all this stuff like that and it wouldn't be till so then to bear not bury the lead here I think I'm writing into a corporation all these things somebody at the you know Weezer is this huge band right like clearly they have hundreds of people working on these staffs or whatever when in reality the Weezer fan club was run by two sisters Michael and Carly who like signed off all of their you know they had letters in the beginning of the zine like what's happening the zine they were nice Michael yeah Michael and Carly they spelled out M Y K E L yeah yeah never um but they sign off here you me or whatever and put it out and done this whole thing and it didn't dawn on me at the time that it wasn't a corporation running this it was these two women that",
      "start": 4779.6
    },
    {
      "text": "never um but they sign off here you me or whatever and put it out and done this whole thing and it didn't dawn on me at the time that it wasn't a corporation running this it was these two women that were fans of Weezer that had befriended them and it turned out out you know dozens of other local LA bands that they would help whenever they came through stuff like when they were little before not before they're huge things or whatever and that this was a passion project for them and that when I got my fan club that looked like it was written in Sharpie it was written in Sharpie by these people and when I got my you know packet that was written in Sharpie on it it was written by one of these two sisters who was stuffing envelopes and sending the shit out and doing all these different things right and like it was just two women who were doing all this and I don't find out about this until they die and they die trying driving to their the next Weezer show and like you know that's still",
      "start": 4816.72
    },
    {
      "text": "right and like it was just two women who were doing all this and I don't find out about this until they die and they die trying driving to their the next Weezer show and like you know that's still murky as to what exactly happened but the the theory commonly held is that they finished one of their Weezer shows we're driving to the next one and fell asleep at the wheel and crashed the car in that and so like when that happens it you know then I remember this is the first time I remember Weezer been quiet forever it felt like again I'm a kid so I don't have any sense of time or whatever but I remember when MTV News reported on it and showed like a clip from like the benefit concert or whatever and like Rivers have like really long hair and I was like that's I not it what I thought he looked like I haven't seen him in so long or whatever and then they explained like that how this all happened and so like it's this weird regret I have especially now knowing for us like there's five of us",
      "start": 4857.56
    },
    {
      "text": "like I haven't seen him in so long or whatever and then they explained like that how this all happened and so like it's this weird regret I have especially now knowing for us like there's five of us right it's like when people are like why doesn't this work and why doesn't that happen it's like we're trying yeah we're trying as hard as we can and we're on this is not trying to guilt anybody out there all your criticisms are well-oriented and we understand them in 2017 but like for me that's that weird thing of being on both sides of it now but even back then having said that and imagining them opening this thing with this fucking stupid-ass drawing and then this letter from this 11 year old this petulant child being like blah blah blah blah blah and I'm sure they weren't I'm sure like this kids dumb whatever move on to the hundreds of other letters and poems and art and things like praising this band and thanking us for the our work but I never thanked them and I never had the chance",
      "start": 4897.4
    },
    {
      "text": "kids dumb whatever move on to the hundreds of other letters and poems and art and things like praising this band and thanking us for the our work but I never thanked them and I never had the chance to because I didn't understand the situation or how the world works at the time and that sucks so like that's me failing as a fan that's a fan of regret I have you know what I mean on the fact of not taking the time to understand and thank them for what they did and instead coming off like this douche that again I'm sure they lost no sleepover that they did not worry about it wasn't like oh we're not gonna do it but I've had those days here right where it's been a motherfucker god this day's been bad I was you know I was talking about like it's like I've fallen out of a tree and I'm hitting my head on every branch everything that could go wrong and just bouncing around came answer these emails and you get to the bottom it's like all right fine I'm gonna go home open up Twitter and wow this",
      "start": 4943.32
    },
    {
      "text": "head on every branch everything that could go wrong and just bouncing around came answer these emails and you get to the bottom it's like all right fine I'm gonna go home open up Twitter and wow this is broken why are you guys so stupid why didn't you hire somebody all right you know I mean it's like well I want to fucking scream and cry all at once now yeah I've done that to somebody and have no way to be like I'm sorry for it right yeah I think what I mean in regards to that though I'm sure those those sisters probably had a lot of good stuff coming through as 100% no no they were beloved I know despite that I feel like there's there's no amount of good that can combat the bad at that moment right and it's the moment you get past that moment you realize all the good everything goes away but there's just something about you can get a hundred compliments but that one insult yeah is the one that you go what motherfucker you know I mean and that what motherfucker response is more",
      "start": 4981.52
    },
    {
      "text": "away but there's just something about you can get a hundred compliments but that one insult yeah is the one that you go what motherfucker you know I mean and that what motherfucker response is more visceral than anything else sure and I don't know it's harder to take compliments I guess is the I don't know see I don't think I've ever been in that position where I've cared enough to like to render that sort of a criticism against something and I think that's when you talk about failure as a fan I think that is my biggest failure is that I'm not that big of a fan of anything and it's so Rogan I do love Joe Rogan but I mean you know it's hard to knock Joe Rogan I mean well it's easy to knock Joe Rogan depending on depending on what what you like to listen to or not but you know he's unabashedly who he is and so if you don't like is what he puts out or that part you're not consuming it you're not you know you're not coming back for a second yeah I can listen but you know I don't I don't",
      "start": 5022.36
    },
    {
      "text": "who he is and so if you don't like is what he puts out or that part you're not consuming it you're not you know you're not coming back for a second yeah I can listen but you know I don't I don't you know I don't I look at all the support we get from the people that consume our content and and help us out over the years and I just feel like I don't I don't have something like that that I'm passionate about so I think that's my failure as both a creator and as a fan is that I'm not I'm not I'm not able to throw myself wholeheartedly into something like that like you say that's bad but I bet I I can pay I say what's that you say that the letter that you wrote oh yeah I can paint another picture of those two sisters reading it clearly it's a kid's letter and they're getting a huge kick out of how much this kid cares about Weezer right sure and like they look at like wow this kid's got some balls on him well I think it was when I get a letter like that on a bad day and I'm not like ha ha",
      "start": 5062.52
    },
    {
      "text": "how much this kid cares about Weezer right sure and like they look at like wow this kid's got some balls on him well I think it was when I get a letter like that on a bad day and I'm not like ha ha ha I'm like ah the feeling of like that you deserve something for being a fan of somebody and I think that that that's the hard thing to grapple with and like I I do have that like I obviously Q and 5 tone deaf all that stuff I've been such a fan of them from the beginning to an extent that I feel like it is partly mine it's not it's what I need to remember it's not like it's a part of me and I'm a huge part of it and it you know it's definitely like there's a relationship there but at the end of the day it's not my thing so it's like they can make their decisions and I can agree or disagree with them but I feel like there's like a level of respect you need to show and be it's fine to be critical but it's always it's the way that you kind of give that message to somebody because tell them",
      "start": 5103.28
    },
    {
      "text": "them but I feel like there's like a level of respect you need to show and be it's fine to be critical but it's always it's the way that you kind of give that message to somebody because tell them hey you're doing this wrong you should be doing this even though you clearly think that not the best way to handle it necessarily and I think that there's so much that goes on that you don't know you know you only get one side of it I think for me a perfect example of this is Eminem huge fan of Eminem and I think it gets hard because when you're a fan of something you are the most critical of it because you like it that much you're protective of it Eminem's one of my favorite rappers one of my favorite artists of all time I can tell you so many facts about details of songs and like lines and everything and when you get from his first album second album third album we can have a multi hour long discussion about why I like this aspect more than that aspect of these albums or whatever then you",
      "start": 5155.76
    },
    {
      "text": "and when you get from his first album, second album, third album, we can have a multi-hour long discussion about why I like this aspect more than that aspect of these albums or whatever, then you start going on past that and it starts to be like, oh well, it's not as good as the first three. And it's like then it just starts to become this like kind of negative conversation even if I enjoyed things about them. You just you're talking about the negatives or this isn't as good as that. And I've never spoke to Eminem, so I've never had to deal with that, but I have thought about this of if I were to talk to Eminem, what would I talk to him about? And I feel like the thing I want to talk about is, hey, what happened or why did you do Relapse? Why did you do that album? Like what what went through your head that was like, I'm gonna use an accent for the entire thing. And it's like instead of focusing on all the good, I immediately jump to like all the things I didn't like about somebody that I love and that's",
      "start": 5196.72
    },
    {
      "text": "was like, I'm gonna use an accent for the entire thing. And it's like instead of focusing on all the good, I immediately jump to like all the things I didn't like about somebody that I love and that's a problem. And I had that moment with Bernie Burns at Rooster Teeth, Red Versus Blue, such an important thing in my development in my my career, my life. And the first time I was hanging out with him or one of the first times I was hanging out with him, like we were really talking about stuff and I found myself like one of the first things I started doing was being like like man, like the CG stuff's really good once you started going there, why are you still like doing the the same like stupid dick jokes and stuff? Like we want the story. Like it feels like such a waste. And then it wasn't until I went home afterwards, I'm like, man, he took that really well, but I shouldn't have done that. Yeah, like I should have just and it's not just about focusing on the good, it's just don't focus on the bad. You can",
      "start": 5235.48
    },
    {
      "text": "home afterwards, I'm like, man, he took that really well, but I shouldn't have done that. Yeah, like I should have just and it's not just about focusing on the good, it's just don't focus on the bad. You can bring up the bad. You can say things like, oh man, I loved season nine because this isn't this didn't totally like this because of this reason, but whatever. But instead it inevitably turns into this thing of you almost are trying to prove to the person that you look up to that you know their work so well and it's like, well, obviously they know I like them so I'm gonna show point out all the things that I noticed that no one else noticed. You know, that's the big thing I think, you know, with you and me, I've told that you know the story about hate online and being trying to be better online in terms of giving out positive feedback rather than negative and how like when I was you know going to tweet at The Office how bad it was and like include actors and shit and it was like man, people do that to me",
      "start": 5280.16
    },
    {
      "text": "out positive feedback rather than negative and how like when I was you know going to tweet at The Office how bad it was and like include actors and shit and it was like man, people do that to me and I know they follow me. I know they're fans, but they're only there. It's the same thing with Yelp what I always talk about, right, where it's like I noticed one day all my Yelp reviews were negative because I'm not motivated when I have a good experience to go say man, what a great experience this was when somebody pisses me off that I want to go tell them and usually it's somewhere I you know if it's on Twitter or something it's I have 140 characters to tell this creator or this talk about this creation and I just want to get through my most salient thought and my most salient thought is this boss battle sucks, this episode is no good, why is this? And I'm not saying that I love it. I'm not I'm letting you try to read between the lines and most people would get that but when you don't have the full",
      "start": 5320.28
    },
    {
      "text": "sucks, this episode is no good, why is this? And I'm not saying that I love it. I'm not I'm letting you try to read between the lines and most people would get that but when you don't have the full context it just does come off as people being dicks to be dicks yeah and the being addicting it's hard to not do because you feel this sense of entitlement over things that you you enjoy especially if you pay for and especially like all that stuff I remember one of the very first Tone Deaf concerts I ever went to it was me and there was like a group of people that I didn't personally know but I knew from the internet because we were friends in this community and we were at the show and Tone was at the merch table selling shirts I went up and I saw him and he looked at me and he saw my face he's like oh you're the dude in the yellow shirt in the on your your profile picture and I was like oh shit yeah and it was like a great moment where I was like holy shit he knows who I am I hate yellow shirt",
      "start": 5357.12
    },
    {
      "text": "oh you're the dude in the yellow shirt in the on your your profile picture and I was like oh shit yeah and it was like a great moment where I was like holy shit he knows who I am I hate yellow shirt he's like this is great it was such a moment for me and then the guy the guy behind me went up to him he was like oh hey do you recognize me like I'm the guy in the and like he started talking about his profile picture and you could see Tone kind of like struggled with it and was just like he didn't he just didn't know who the guy was and the dude got kind of like upset I was like oh man like like damn you know and I forgot what he said it wasn't even bad it wasn't bad but it was enough that I was just like mmm like it's enough to take the wins out of the sales because as a creator and like as a personality like I feel bad when I'm like it happens to me all time at a meet-and-greet I'll shake your hand I'm usually really good with faces but I've seen so many faces now that I'll shake your",
      "start": 5392.88
    },
    {
      "text": "a personality like I feel bad when I'm like it happens to me all time at a meet-and-greet I'll shake your hand I'm usually really good with faces but I've seen so many faces now that I'll shake your hand like great to meet you like I'll actually met at a Comic-Con like four years ago yeah and I'll go oh my god I'm so sorry nine times out of ten it's oh don't worry about it no you meet too many people I get it but I still feel awful exactly I want to remember everyone I want to have a conversation with everybody I look over at the Kinda Funny game somebody made I want to remember who made that and I can yeah and that's one thing is like for me it's happened where I'm like oh I've seen you it was at a PAX East he's like mmm RTX I'm like sorry but I'm trying here yeah but but with the with his Tone of situation I remember it very vividly because I remember thinking I was like man that guy like really like didn't handle that well yeah you know I got why did he do that but I remember",
      "start": 5436.96
    },
    {
      "text": "his Tone of situation I remember it very vividly because I remember thinking I was like man that guy like really like didn't handle that well yeah you know I got why did he do that but I remember going home and thinking like well what if it was the other way around like what if this guy was in front of me and he had recognized him and not me like I definitely would have felt entitled like you should know who the fuck I am and I remember thinking how would I have handled that and it probably wouldn't have been too much different I totally could have been the guy being like well I'm also that guy and it's just like I think that is the part that's hard to struggle with this being a bad fan because when you are such a fan I think by default you need to then actively try to not be bad in terms of what we're talking about yeah well I mean I think there's a line that there's a distinction that needs to be made between critical feedback and negative feedback right and this is always something",
      "start": 5473.4
    },
    {
      "text": "of what we're talking about yeah well I mean I think there's a line that there's a distinction that needs to be made between critical feedback and negative feedback right and this is always something I say like when it whenever I jump in comments on things and people have critical feedback for me I thank them for that cuz I'm like I really do appreciate that you love this thing so much that we're doing that you want you know you have a couple pieces of feedback that you'd like to see happen that's for that to me is super positive and I think it really is just all how you frame it with people and how you frame it with creators that you love because you do love this stuff right and there is it there is an aspect of it that is very intimate especially when you're talking about a product a podcast where people spend hours like I spent hours and hours and hours listening to certain people that do podcasts like I know more about Joe Rogan than I probably do about my wife and that's and I",
      "start": 5507.2
    },
    {
      "text": "podcast where people spend hours like I spent hours and hours and hours listening to certain people that do podcasts like I know more about Joe Rogan than I probably do about my wife and that's and I you know I pry a lot into my wife like I kind of you know I kind of like stock her a little bit I'm getting off on a tangent but the the point is like you know so so when you like something that much and you want to give that feedback it then becomes how do you do it right how do you do without sounding like that kid that was in line right who's serious who's hurt and I think to to to the credit of a lot of people that support us again nine out of ten times it's hey I really like this like I see it all the time with the animated show we'll go hey I love this I don't you know whether or not you care if it's on time or whenever it dropped great I would love it if this were longer right and that's a good that's a that's a positive thing for me to hear because I'm like great you like this so",
      "start": 5546.0
    },
    {
      "text": "care if it's on time or whenever it dropped great I would love it if this were longer right and that's a good that's a that's a positive thing for me to hear because I'm like great you like this so much you want more of it that's cool I wish I could make it longer we can't economics can't get into that in the comments but so I like that and I always I always respect that because it is a two-way street right you don't want people to just love you unconditionally I'm right because then you can't grow as an artist can't grow as a creator you need that feedback we have to have each other this is how this relationship works and so to that degree like you know I and I and I kind of disagree with you a little bit and that I feel like people who do consume the content do have a level of ownership over it now granted you know they're not then I here working on it every day but it is because of them that that it is a two-way street in that regard right you one can't exist without the other so",
      "start": 5585.44
    },
    {
      "text": "over it now granted you know they're not then I here working on it every day but it is because of them that that it is a two-way street in that regard right you one can't exist without the other so there is an importance to be placed on that but you do have to stay positive all the time you have to you have to be able to render both criticisms and and praise in a positive light if you want to exist in that environment yourself that's all I'm saying that makes sense made sense to me yeah Nick yeah what's your topic super important topic what's the coldest you've ever been where does this stem from welcome this morning GameOverGreggy I walked into the office now yeah yeah I'm sorry let me back up when you jump right to the top I paint a little foreplay two days ago for some ungodly reason the weather decided to go real cold real fast and I don't like it now I like it because I like that it's wintery and I like that it's the holiday time but I don't like it because then I have to be cold",
      "start": 5619.72
    },
    {
      "text": "weather decided to go real cold real fast and I don't like it now I like it because I like that it's wintery and I like that it's the holiday time but I don't like it because then I have to be cold like every goddamn night until the Sun decides to pop back up then we walked into here today and you're noticeably agitated for a number of reasons but I think it's because you're cold and I ask you and you're like yes I am cold because it's fucking cold in here and I tell you Greg we've got a heater in this place and you're like no we don't I did not say no I think maybe I said I did not know that you were like something to the scent when you're like you're fucking ass we absolutely do not have a heat I didn't know what he said no oh that's what he said he was like yeah it's amazed that I could be agitated here you're you're a lying sack of shit is what he said to me not what I'm saying to him but I'm kind of referring that what was he saying to you that he said to you he was basically I",
      "start": 5666.32
    },
    {
      "text": "be agitated here you're you're a lying sack of shit is what he said to me not what I'm saying to him but I'm kind of referring that what was he saying to you that he said to you he was basically I think you're a bold-faced liar and we don't have a heater and you should stop doing drugs and I'm like well you know we'll take that apart piece by piece I'm not a liar but I should stop doing drugs I digress it got me thinking yeah fucking cold man and I'm uncomfortable and I'm cold so what's the coldest you guys have ever been Greg you come from a place where it snows Tim you grew up three hours from place where it snows I've been to that place few times Tahoe yeah yeah I guess you're right I mean there's multiple times that come to mind of those were the coldest I've ever times of everyone in my life one time I got dragged to a NFL all-star game there was in San Francisco why would you go to that Karen's mom sister worked for somebody that got free tickets and the Pro Bowl right Pro Bowl",
      "start": 5709.84
    },
    {
      "text": "my life one time I got dragged to a NFL all-star game there was in San Francisco why would you go to that Karen's mom sister worked for somebody that got free tickets and the Pro Bowl right Pro Bowl that's what it was yeah I don't fucking know so we went to we went to this thing and oh man my nips my nips were so hard hard as ice they fucking hurt they hurt so bad for days after that because I'm always out there and I'm just like why why is this so cool I didn't have a jacket I was just wearing like a t-shirt or whatever and I was just like I'm watching this thing that I don't fucking like I'm at a place surrounded by people I don't like and it's so cool I just I think that's why I hate football is that that's it was so damn well in the comfort of your own living room don't trust me and nothing about it is appealing but the cold was definitely the worst thing sure about that another time was with Kevin where we were in Santa Cruz and we decided to go into the water at the beach that",
      "start": 5746.92
    },
    {
      "text": "nothing about it is appealing but the cold was definitely the worst thing sure about that another time was with Kevin where we were in Santa Cruz and we decided to go into the water at the beach that it was like 530 so like the Sun was setting and we're like fuck it we're just gonna do it and we didn't have swim trunks or anything so we just went in with our shorts and we thought it was funny like let's just go in with our clothes so we did and it was not funny when our wet t-shirts we then had to walk like two and a half miles back to the hotel at night and it was just that was fucking horrible but the worst cold I've ever had ever bar none Philadelphia when I went there interesting single-handedly it was that freezing feeling on me of why I hate Philadelphia and think it's the it's the worst place I've ever been a lot of for sure fucking sucks in Tahoe and like it was springtime the water was like all the ice was melting and we were we were like swimming in the lake yeah we did a",
      "start": 5794.36
    },
    {
      "text": "worst place I've ever been a lot of for sure fucking sucks in Tahoe and like it was springtime the water was like all the ice was melting and we were we were like swimming in the lake yeah we did a lot of dumb things there was water we were in it but yeah like in Philadelphia it was like I didn't I felt like it was illegal for it to be that cold somebody should have done something somebody should have talked to somebody and been like you know what there's a curfew you're not allowed to leave your house here the government's giving everybody heaters yeah we're just gonna we'll get through this together guys but instead they let us run amok in these fucking streets and in Philadelphia it's designed like Boston like some fucking idiot kindergartener was just like hey draw a map of the city and he's like here's a bunch of fucking lines and I'm like none of this makes sense there's no grid system at all so then taxis are like if you want to get a taxi you have to cross the street but to",
      "start": 5841.84
    },
    {
      "text": "and he's like here's a bunch of fucking lines and I'm like none of this makes sense there's no grid system at all so then taxis are like if you want to get a taxi you have to cross the street but to cross the street you need to freaking freeze to death yeah I'm surprised I'm here right now the maze from Westworld Greg the cold okay you grew up in somewhere close to Chicago right the burbs yeah there's snow there we grew up oh my god you kidding me it's not all the time what so you understand that like so backyard wrestling yeah start taking notes cuz you leave this for the documentary the front yard is where we did all the regular shows yeah your Monday Night Raw's or whatever you is what you call them right and then every fourth when we did four shows that man it was time for a one of the monthly pay-per-views and so the monthly pay-per-views were in the backyard mm-hmm where we you know make things and have like entrance it like we'd make like actual stages or sets you know I need",
      "start": 5885.28
    },
    {
      "text": "monthly pay-per-views and so the monthly pay-per-views were in the backyard mm-hmm where we you know make things and have like entrance it like we'd make like actual stages or sets you know I need to come out of this can I ask go ahead how many people were would be there to watch this unfold was it just the other wrestlers it was never a crowd that you guys know our neighbors my neighbors would come out and watch from afar with a CD it's are doing when they were watching were they doing this oh yeah big time just shaking their hands shaking their heads they were not having they're not part of this got the front yard though because you know you usually you know when it started it started in the school year or whatever so we're wrestling outside in the fall into winter or whatever and we called it the be the arena the front yard was called the BYUBF tundra right because it would just be out there and it would just there's not it like the trees are just skeletons of course the grass if",
      "start": 5923.24
    },
    {
      "text": "it the be the arena the front yard was called the BYUBF tundra right because it would just be out there and it would just there's not it like the trees are just skeletons of course the grass if it's not if it's not covered in snow the grass is just that dead brown but the dead like light yellow brown where there's like no color to it and then the wind just whips you know it's sharp the whole reason it you we call it the tundra is because the first time you ever watch the footage back from one of these wrestling when it got really bad it was just and us yelling over like just talking or whatever and it's like okay we got to play this into the the cannon of this and we call it the god I hope to god you have all those videos still do yeah so we need to digitize them I will I will help you do that thank you very much we need to do that um so yeah I'm familiar with the cold it's one of the really like here's the thing about cold and you guys yeah you bothered you anyway thank you thank you",
      "start": 5966.68
    },
    {
      "text": "that thank you very much we need to do that um so yeah I'm familiar with the cold it's one of the really like here's the thing about cold and you guys yeah you bothered you anyway thank you thank you very much I like that one um the thing about the cold when you grow up in a cold place is that it's impossible to narrow it down what is the coldest moments of your life really because there's like it's just how it is you're used to it I it's the thought of going out into the cold it sucks but you immediately get used to it you immediately know what it is like when I was going up to Montreal Jen's like it's gonna be cold it's gonna be cold I got there I was like this ain't shit and she's like it's gonna get worse I'm like I know it's gonna get worse but don't be warning me at this this isn't bad at all did you just do this thing that Greg Miller does where no matter how cold it is you wear a sweatshirt yeah that's what you do cuz this is the thing",
      "start": 6002.8
    },
    {
      "text": "don't be warning me at this this isn't bad at all did you just do this thing that Greg Miller does where no matter how cold it is you wear a sweatshirt yeah that's what you do cuz this is the thing about it like first off people always freak out about the cold of like oh it's like what are you doing what are you doing that you're so worried about the cold you go from your car to the restaurant to the whatever now don't get me wrong as a kid that's when it gets you that's when you because you got to learn these lessons right but when I think of the coldest I've ever been I'm thinking of I'm 10 so we'll say 1993 maybe I'm 7 so 1990 somewhere in there right the checkout yeah sure big Greg Miller the crane operator wants to get a big old Jamie Kennedy this Christmas gift from downtown so I go I tag along with him and we go downtown we park and we come up on Michigan Avenue and I'll never forget this we come up and we round the corner and the wind hits me blowing through the streets and it",
      "start": 6041.92
    },
    {
      "text": "I tag along with him and we go downtown we park and we come up on Michigan Avenue and I'll never forget this we come up and we round the corner and the wind hits me blowing through the streets and it literally was like a ghost train drove through me and took everything away cuz like all the wind got sucked out of my body I grabbed my dad I'm just shaking his head like god damn it this is my son but like so there's that and then it's the yeah okay I like you bring up um sleeping when I you know in Missouri when we were in our the Antler house or whatever which was like a cheap shitty fucking house that probably is the reason I have cancer but like wasn't insulated at all no storm windows or anything like we would go Kyle Hayes would go out and buy that you know that pink lining you put in your ack you know I'm talking about here the the pad is yeah yeah and he was just lined the windows with it and then duct tape that around it but then like in my I remember going to bed in the Antler",
      "start": 6085.32
    },
    {
      "text": "your ack you know I'm talking about here the the pad is yeah yeah and he was just lined the windows with it and then duct tape that around it but then like in my I remember going to bed in the Antler house and I would put on two pairs of sweatpants and two hoodies and lay down and sleep in that because that's how bad it was sweaty well then that's the big thing about it well you could just so-called it whenever was but when you're a kid and you're like I'm thinking like I'm thinking about cold stories and I'm thinking about like the time me Eric and Mike got dropped off at a park and then wandered out or out of the snow and ended up pooping in the bushes then too and then we found we didn't know where we were and we didn't have cell phones so then we saw Ozzie's diner you know what I mean the county seat we went in there I knew those people we had a phone we were able to call family and friends but like when you go sledding when you go whatever you were like you're built for that",
      "start": 6126.44
    },
    {
      "text": "mean the county seat we went in there I knew those people we had a phone we were able to call family and friends but like when you go sledding when you go whatever you were like you're built for that you're putting on the snow pants and I always sweated in that crap because we're out there and it's not like I was ever out and then the blizzard caught me off guard I mean okay this whole thing reminded me of something I can't believe I didn't bring up our story Boston Boston yeah aka the great freeze oh god well I literally I called it was multiple long home I'm gonna die like we're gonna die so me and Nick decide to walk back to the hotel from PAX East well yeah we made a poor choice I think it was based on good information though because I think the cab stand was like fucking ridiculous cab was crazy because PAX East is a fucking nightmare that convention center is stupid now if it had been PAX East this last time we went which I believe was later in the year so there was no snow on the",
      "start": 6163.12
    },
    {
      "text": "was crazy because Pax East is a fucking nightmare that convention center is stupid now if it had been Pax East this last time we went which I believe was later in the year so there was no snow on the ground we would have been fine but it wasn't it was blizzard the freaking there's those walls of snow it's like Game of Thrones with just the walls everywhere yeah and again going back to what I was saying and kindergartener drew the map of this place so there's no streets that make sense so in order to navigate like you need to just walk in these narrow chasms of snow walls and we're doing this and we're just like we're totally fine and it was about two miles away yeah let's see my walk not that bad but I think we got maybe three blocks in and we're both just like we're gonna die so we should preface light jackets no gloves no no beanie no anything I'm cutting back that we've told the story so many times you're cutting back to Colin and I Colin's in a windbreaker I'm in a hoodie yeah we're",
      "start": 6205.8
    },
    {
      "text": "light jackets no gloves no no beanie no anything I'm cutting back that we've told the story so many times you're cutting back to Colin and I Colin's in a windbreaker I'm in a hoodie yeah we're fine this is life you guys totally fine you also taxied it didn't have to walk yeah two miles of no problem you you couldn't have you would have died you're weak-willed it's like me Greg I get it you're one of us and by us I mean me and you we all work who we are we do what we do but me and Nick went to a Walgreens places right yeah we bought beanies we bought gloves we got hot chocolate at Nick got a hot chocolate yeah that's how desperate he was like cuz there was no coffee cuz the guy was closing I was like what do you have and he's like all we have is hot chocolate and we stopped at multiple places and we got to a point that we went to like a bus station we're like like begging them to just let us stay inside for a while because they kept places were kicking us out because they're like you",
      "start": 6246.6
    },
    {
      "text": "and we got to a point that we went to like a bus station we're like like begging them to just let us stay inside for a while because they kept places were kicking us out because they're like you guys can't just stand it here now you would think you're like why in this technological age would you not just get a Uber or go get a taxi and the answer was because they're all over the fucking convention center Uber and they were walled off from the snow to them yeah because the snow walls and the taxis were just you can't find them so and then and then but then we did the bravado like man thing or we're like well we've come this far yeah at every point we're like we've come that it can't possibly be farther than this we're doing the walking directions on our phone yeah so we have our phones yeah it was terrible see that's the thing is yeah it's just you know you weren't ready for it you weren't you haven't you haven't been bread you weren't like Bane you you know Chicagoans New York people",
      "start": 6287.76
    },
    {
      "text": "it was terrible see that's the thing is yeah it's just you know you weren't ready for it you weren't you haven't you haven't been bread you weren't like Bane you you know Chicagoans New York people we were born into this yeah cuz I think of like when you said this topic I immediately jump to like for the longest time it was I didn't come home until Christmas and so when I came home to Christmas we'd go to like the second to last Bears game at the end of December so we're outside Soldier Field with the lake effect snow and the wind whipping through that parking lot sitting there trying to barbecue and do all this terrible stuff and get wasted but we're also wearing 15 layers we all bought the hand warmer things you break in you know I walk easy open the package you put them in your gloves I don't understand why people live in a lot of place now I agree with that I will agree as somebody who has left the Midwest and fled I go back there in the summer and the fucking signs",
      "start": 6321.76
    },
    {
      "text": "your gloves I don't understand why people live in a lot of place now I agree with that I will agree as somebody who has left the Midwest and fled I go back there in the summer and the fucking signs are melting you go back there in the winter everybody dying like well you don't have to be here yeah there's no reason for you to be here here's the thing people complain San Francisco it's so expensive whatever there's a lot of issues but guess what we don't have seasons there's rain every once in a while there's like three days it's hot it's a minor annoyance it's pretty annoying those days you were you are the most annoyed human being oh yeah but it's not LA I don't need to deal with this fucking scorching heat the small New York I don't need to deal with the heat like New York is probably the worst offender because you got to deal with all types of shit they're throwing the Sun at you they're throwing the fucking blizzard at you and I'm just like I'm just trying to get by guys yeah you",
      "start": 6356.8
    },
    {
      "text": "worst offender because you got to deal with all types of shit they're throwing the Sun at you they're throwing the fucking blizzard at you and I'm just like I'm just trying to get by guys yeah you go into the subway no matter what time of year it is it's hot as fuck down there stink it up a storm sure man like dead I'm happy I'm here we made a good choice Kev you guys didn't make any choice you just stay on here that was a choice choice we didn't leave we didn't go to freaking oh there's so good of stupid ass places yeah I think the only other time I've been that cold is in Tahoe on like skiing but I think the only there was one time specifically where we skied two days in a row and I'm not that great of a skier and I'm definitely not built to handle the second day in a row so I was kind of dreading the second day anyway but I went because we do it every you know we don't get to go up there that often and it was it started to snow and I'd never skied when it was snowing before because",
      "start": 6395.84
    },
    {
      "text": "dreading the second day anyway but I went because we do it every you know we don't get to go up there that often and it was it started to snow and I'd never skied when it was snowing before because normally I go when it's not snowing or if it's a snow it's a light snow we're on the lift the lift stops and it's like someone hit the button to make it snow more and it starts coming down and you start getting that weird uncomfortable feeling first off your ass goes numb because you're on the ski lift second off no matter what you do your nose starts running but you can't stop it from running because your gloves wet so as you're rubbing the glove on your nose to try to get it whatever and then it's like the sandpapery wet feeling on your nose then your nose goes numb then your eyes start to water right then you get the snowy vagina are you familiar with this no you look down into your crotch oh why and it looks like a snowy vagina right and you haven't realized are you like how long has",
      "start": 6437.48
    },
    {
      "text": "water right then you get the snowy vagina are you familiar with this no you look down into your crotch oh why and it looks like a snowy vagina right and you haven't realized are you like how long has that snow been there can I feel my dick anymore I can't feel my dick anymore when am I getting off this goddamn lift and then by then of course you're so zapped for energy that you then you have to ski down the fucking hill which takes energy that's when you go to the lodge and get yourself a bloody mary or three and you don't go back out but that was that was one of the coldest times I've ever been luckily I was with two other people on the left so it was it was fun but I'm like this is fucking miserable because you're high up and then it's that like dead quiet because it's snowing you know what I mean yeah when it starts to snow it gets so quiet and you can just hear you can't really see what's going on below you but you're so cold you're shivering and you hear like your your hands just",
      "start": 6473.56
    },
    {
      "text": "I mean yeah when it starts to snow it gets so quiet and you can just hear you can't really see what's going on below you but you're so cold you're shivering and you hear like your your hands just like clamoring against the the metal of the cage that that should be down but it's not because you're supposed to be fucking cool and not worry about the safety and then you'll see one kid you'll just hear a kid eat it and you're like I wonder if that kid's still alive maybe he froze to death down there this fucking frozen wilderness that were up here and then you get down that's all fine I do love snow but the good thing about being the cold is then after that that day actually turned out of course beautiful was fun but then we go back to where we were staying and it's super warm and there's dogs we cooked and it was like it was a blast always a blast but I will say coming from Southern California I vastly prefer the hot heat no God no to the cold every day of the week hot sucks any day hot",
      "start": 6509.12
    },
    {
      "text": "we cooked and it was like it was a blast always a blast but I will say coming from Southern California I vastly prefer the hot heat no God no to the cold every day of the week hot sucks any day hot sucks I'd rather take I don't like either of them but I don't I'd rather be cold and hot if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week three sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com/kindafunny where you can back us for some money you can get your topics read you can get phone calls with us you can get a bunch of cool stuff and most importantly get the show early each and every week but if you have no bucks to toss no big deal you can head over to youtube.com/kindafunny and get the show broken up topic by topic day by day until we post the big thing the following week now as always it's been a pleasure to serve you",
      "start": 6541.84
    },
    {
      "text": "can head over to youtube.com/kindafunny and get the show broken up topic by topic day by day until we post the big thing the following week now as always it's been a pleasure to serve you next week the return of Colin Moriarty and a very special guest",
      "start": 6583.84
    }
  ]
}
