{
    "id": 1575,
    "video_id": "97CTRx1YquA",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Kinda Funny Street Fighter V Tournament - Kinda Funny Plays",
    "description": "Kinda Funny has its first (and probably last) Street Fighter 5 tournament. We aren't very good. Except Colin. He is okay.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1456333201,
    "duration": 1546,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome to Kinda Funny Games My name is Colin this is Nick this is Tim this is Greg this is Portillo today we're playing a game that we're intimately familiar with and are all experts in Street Fighter V which recently came to PlayStation 4 and PC console exclusive to PS4 but you can also play on PC uh in reality none of us really play Street Fighter I I might have the most experience with the series you dabbled in it I've dabbled it I mean I enjoy it I think it's a great series he was threaten to take on a guy at underdogs y that's true did you really when the machine there like I'm going to go over there and get this guy and then the guy took a bagel out of his pocket and made it and we were like well he's too Pro I don't yeah he manver caring they but I've always had a great I've always had a great respect for the series uh I was pretty good at it when I was younger but I just don't play that much anymore Street Fighter Alpha 3 is actually my favorite one um",
            "start": 0.0
        },
        {
            "text": "had a great I've always had a great respect for the series uh I was pretty good at it when I was younger but I just don't play that much anymore Street Fighter Alpha 3 is actually my favorite one um and uh so I convinced the guys that maybe we should just do a little impromptu tournament and we broke out the Col. Greg Miller's live whiteboard to do it so we're all going to play each other once have a little standing just see what happen see where we all stand at the end we can use whatever characters we want I suggest we just use the question mark in the middle to randomly select our stage there's only seven options anyway and then uh we'll go from there so the first battle is going to be Nick versus Tim let's do it Nick how badly are you going to Pummel Tim I'm going to get I probably will get beaten this I'm not I've never actually been very good at Street Fighter but I love Street Fighter how can you not it's a classic got to go with my girl Chun-Li I'm going to go with my boy Ryu true",
            "start": 33.68
        },
        {
            "text": "this I'm not I've never actually been very good at Street Fighter but I love Street Fighter how can you not it's a classic got to go with my girl Chun Li I'm going to go with my boy Ryu true story named my cat Chun Li in 1992 true story the ashes are in his room right now yep god wow so Nick remember when you sang the Street Fighter 4 theme song yeah that was great inestable heavy kick my a medium kick yeah yeah it's fun sorry I apologize everyone four so Ryu versus Chun Li four no what part were you apologizing for so I like that they have likes so Ryu likes Japanese desserts martial arts and Mizu yoken which oh I guess that's the Japanese dessert and Chun Li likes other things he should like mochi mochi are much better uhoh now Tim do you use the d-pad or do you use the actual analog stick uh go back okay oh my God look at them the British the character that I'm using to all right so Ryu versus Trundley in the training station ooh now I heard there's an Easter egg in the",
            "start": 65.64
        },
        {
            "text": "analog stick uh go back okay oh my God look at them the British the character that I'm using to all right so Ryu versus Chun-Li in the training station ooh now I heard there's an Easter egg in the background you can see the platform from Harry Potter oh it's not true nice but Greg got Juiced when I said that wow okay get that ass beat so far Chulenge stepping in with their massive thighs just like your cat yep Chulenge my cat had massive thighs as well what did I do you hit did I do anything me that was me wasn't me me might have been you just just go back to it what the **** was it me it must have cuz you're it's on your just hit option I option we got we got it we got it ready not a good start well was a good start it's actually a really good start for oh there we go the old step on your head the step in the head that that was my my go-to in Street Fighter 2 so obnoxious now Colin you know a lot about British history right do the Mounties in the back there do they actually play",
            "start": 108.52
        },
        {
            "text": "your head the step in the head that that was my my go-to in Street Fighter V so obnoxious now Colin you know a lot about British history right do the Mounties in the back there do they actually play band stuff like this I thought they couldn't move talk they're not Mounties but um I think that's eye to the holder kind of thing Canadian uh but no they usually don't rock out like this this seems to be humorously British oh okay kind like Gary Wiow exactly God damn it I keep hitting it from the analog stick so it's weird that you hit it and then it's the player one that says it's a out of it well because he has pause too because gotta gotta got got me there that Tri me out for a second cuz I'm like I'm not hitting this I don't think I used to H it all the time when we were playing on Xbox 360 that was problem I'm no more Xbox 360 all right so Nick's up with Ryu one nothing you like using those soft those light dragon punches huh oh they're annoying they annoy more than anything",
            "start": 170.52
        },
        {
            "text": "Xbox 360 that was a problem, I'm no more Xbox 360. All right, so Nick's up with Ryu one nothing. You like using those soft, those light dragon punches, huh? Oh, they're annoying; they annoy more than anything else. They don't really do too much damage, but they're also easy to pry good. I can't use you; I can't, I can't really get the um so how do you guys think it feels? It's good; it's getting a lot of not the content so much, but the way the way plays people are really liking it. Oh, oh that was a nice timing on that fire damn it! I'm trying to do my special look. Those punk rockers back there, I know they're got axe; they're bothering this old man. This old man just wants to watch a fight in the train station and these guys are like hey man you ever hear of Jimmy Hris? Damn it right! Nick takes it that special. I don't know how do you use V-Trigger again? It's just both heav, I know it's supposed to be the Heavies which are L1 and R1 but it wasn't doing all right. Tim and Greg well here let's let's skip",
            "start": 218.68
        },
        {
            "text": "know how do you use V-Trigger again, it's just both Heavy I know it's supposed to be the Heavies which are L1 and R1 but it wasn't doing alright Tim and Greg well here let's let's skip over to me and Greg and we'll we'll mix it up a little bit okay this is the second win for player one Kevin can I trouble you to go and get my coffee it's on the table Daddy needs Daddy needs some caffeine it's how I compete you just won without the caffeine Nick's the caffeine seems like you should you should just embrace your caffeine-free life if possible Ken hey I was waiting for you I'm going to look for Ken looks demented as hell in this Ken does not look who's this guy new guy I don't know who that is Rashad Rashid Rashid now Ma a professional wrestler what's Laura's Story she's a Brazilian she's a dancing stuff that's fun Karen I knew a Karen was does it spell like that Nash like Kevin Nash why does Nash have half his face missing Wa birdie looks like my kind of man all right you like",
            "start": 293.32
        },
        {
            "text": "she's a dancing character that's fun Karen I knew a Karen, it spells like that Nash, like Kevin Nash, why does Nash have half his face missing? Waa birdie looks like my kind of man. All right, you like Birdie, yeah, why not look at him? You like that Alpha. Oh my God, look at that. God damn, that's a character from the Street Fighter series, he likes beef jerky, just food, food. That's my kind of man, yeah, you do like beef Jer. He likes beer, beef jerky, and food. Oh **** this guy's my bro, it's on now. Kevin Ber is one of the weird ones they brought back for sure. What is he from? Alpha, yeah, and then was in Was he in four maybe one of like Ultra super mega fight ever now Ken's your favorite guy but you hate how he looks now right I Love Ken but he looks I won't play Ken anymore because of how he looks refuse to I'm just saying people use Ryu and Ken come on bro what you think that there's a complete and total lack of uh creativity in those two characters they're Classics man that was from the ARA of pallet swapping oh cool that's a lot of",
            "start": 345.48
        },
        {
            "text": "Ken come on bro what you think that there's a complete and total lack of uh creativity in those two characters they're classics man that was from the era of pallet swapping oh cool that's a lot of damage oh God you should go as this guy for Halloween I know right I got to get out the corner I kind feel like I live my life one day at a time as Ryu at a time you got him in the cor you got tie him up in the corner again oh that was pretty that was pretty dragon punch you got closed with that nasty Dragon Punch got to get in right I'm trying to get it in all day Greg stop flexing your belly button and get in there there you go you got cover you got you got reach on him and about 300 pounds oh oh no oh that was close oh man damn you gave me a run there got corner I like how they gave Ryu like did he always had that mustache thing beard thing he likes to think he did he did in my backstory for him he always did came out of the womb looking like this before his mom left him on a fire uh department stairwell",
            "start": 398.28
        },
        {
            "text": "that mustache thing beard thing he likes to think he did he did in my backstory for him he always did came out of the womb looking like this before his mom left him on a fire uh Department stairwell a beautiful human it's like the beginning of Super Mario Bros. movie that was pretty he has sh girth Colin getting nasty he ain't trying to get hit once Jesus if only we understood what any of the letters at the bottom of the screen meant it means I'm from California it knows we're playing in California it's pretty cool it's pretty good are you kidding me all right so maybe me and Tim next so Greg Colin Colin Comes Out Boy you can eat where the heck are you pulling all that food from that's mean this is maybe one of his things in the game is like he pulls a hot dog out of his butt like a what a hot dog out hot you're player all right so now I assume you'll play as Chun-Li yeah I like to keep a classic I want to get that super at least once during this tournament can we take a second",
            "start": 449.52
        },
        {
            "text": "a hot dog out hot you're player all right so now I assume you'll play as Chun Li yeah I like to keep a classic I want to get that super at least once during this tournament can we take a second to realize that Portillo is wearing a Deadpool shirt and actually really likes it give me a rack zoom on him no can't afford the rack Zoom apparently hey I was waiting for you they've been fighting each other for like 25 years yeah she looks great for a 64 year-old so to see that matter this takes place in between Street Fighter 3 and 4 does it yeah really canonically yeah you want to see my Kung Fu no I'll show you okay be fair you didn't wait for me to answer I was give that question for a thought's turn up round one with my man bun does that count as man bun looks like it's got like more hair coming up the top of it kind like a high ponytail it's more of a Ste like a more of a ponytail damn I'm just going to call this I think that it might be fair to say at this point that Colin is a favored",
            "start": 514.4
        },
        {
            "text": "up the top of it kind like a high ponytail it's more of a Street Fighter V like a more of a ponytail damn I'm just going to call this I think that it might be fair to say at this point that Colin is a favored person win in this whole bracketed tournament sure not to discredit you and me, both I'm sure we'll give a rousing match toward one another AR is going to be the stuff with Legend RX they're going to call that Ali versus four and four wow yeah they didn't I don't think they fought I saw the 30 call getting lit up literally and figuratively look that guy in the back he is dead about it oh yeah what's that guy doing a little Dan if I saw two people what's that guy doing a little dance could you imagine sitting at a trade station and just seeing two people wreck each other like this they're making they're bringing out Cosmic fire out of nowhere yeah I wouldn't be playing music I'd be running no yeah why is the British marching band again those guys are going to be in trouble with the Queen",
            "start": 576.6
        },
        {
            "text": "they're bringing out the \"Cosmic Rush\" out of nowhere yeah I wouldn't be playing music I'd be running no yeah why is the British marching band again those guys are going to be in trouble with the Queen that was pretty that was oh no he's stunned Damn you better pull this out oh **** Tim Gettys stepped it up he stepped up to the streets oh no I oh my God he's right on the edge the \"V-Trigger\" thing I you got one hit you got to get just sweep the leg sweep the **** leg there you go punch the \"Hadouken\" dick dick the old \"Shoryuken\" blow dick punch for the W I'm missing all the dick blow I got my combo that's all I wanted py final round that was pretty Get Hype damn that recycling oh the janitor fell down all right Budd get back up you guys you have your reversal meter by the way I just want you to know that it's almost there holy **** yes yes just kicked my foot hell hard like that trying to go soft like me medium like me Tim Gettys made me sweep that one out all right so why don't Greg and Nick go next",
            "start": 629.44
        },
        {
            "text": "it's almost there holy **** yes yes just kicked my foot hell hard like that trying to go soft like me medium like me Tim made me swep that one out all right so why don't Greg and Nick go next hope you're ready buddy kids gloves are off I have to pee I don't like competition it makes you want to pee who who do you have your money on in this one I'm going Greg now Nick some way to go I'm going sheer Greg my as in every fighting game what I struggle most with is just moving forward at a normal me why so I'm on the left and you're on the right you did something controller you did something controller is that wrong am I wrong it's going to be easy for us now but then yeah the control it would flip for the audience that's how it's been the whole time all right whatever I've always been on left uh where's this my boy bir in your head Greg is there a left Advantage I there's definitely Advantage yeah cuz you're always constantly it's easier to do that then it is the other way 7' one",
            "start": 685.36
        },
        {
            "text": "on left uh where's this my boy Birdie in your head Greg is there a left Advantage? I there's definitely an advantage yeah cuz you're always constantly it's easier to do that then it is the other way around. One and 7'57 his job is family freeloader, lot of uh lot of parallels here between the two of you oh yeah Birdie and Greg Miller, the GameOverGreggy Twitter handle, GameOverBirdie the weird chains that you walk around with I do like looking at my chain you know imagine that Portillo is on the end of that chain you look at the bar the wait which one is my hard K my hard look happy as **** Hard Punch should be uh on the right and right and kick on no punches on their left and the triggers we're playing with controllers sticks I'm also not nearly good enough to play with sticks any doesn't matter this is a grudge match here oh man that bear is just hanging out there I'm more enamored by the bear **** everything seems to be somewhat of a stereotype all the backgrounds there's people there's Russian",
            "start": 760.24
        },
        {
            "text": "match here oh man that bear is just hanging out there I'm more enamored by the bear everything seems to be somewhat of a stereotype all the backgrounds there's people there's Russian people doing Russian dances on top of Russian dolls Giants it's awesome no there are two bears in the background one with a hammer one with wheat I looked away for one second next thing I know Greg's freaking out covers ground very quickly with this grab his face man swiping right through his hair nice Tim there's something about the modern Street Fighter and I just can't wrap my head around like for some reason they just feel different they do yeah they feel the game feels a little heavier to me but I don't know if that's really true you know like it's just weird I don't understand how people can be as good as they are like it's crazy to see like not even top level just like people that are proficient in this well it seems like you were doing some you know you were",
            "start": 820.48
        },
        {
            "text": "understand how people can be as good as they are like it's crazy to see like not even top level just like people that are proficient in this well it seems like you were doing some you know you were doing that's all I do with hold on can you give me one sec figure out what my Hard Punch is sure is it going to hit me is that it there it is sorry my bad here now let me hit you once all right now all right back oh nice took me a second I was walking around he needs to sh*t himself he probably does 500 pounds he must take massive shits definitely takes massive dumps oh oh no you can hear from the sound of Greg's controller that he has this under control I was going to say I've been sandbagging for a while so you know now it's nice to see All Star ping off I can do that again how can I do that again that would have been oh oh no I lose damn good job, Greg no problem and Birdie got a thing going I wear the pink damn all right look Donuts let's do Nick and I now and then Tim",
            "start": 901.08
        },
        {
            "text": "can I do that again that would have been oh oh no I lose damn good job Greg no problem and birdie got a thing going I wear the pink goddamn all right look Donuts let's do Nick and I now and then Tim and Greg can end it Nick on Colin we're calling on Nick depends on what your F prefer it's on you not be I like the kind of wear like Flashdance a little sexy oh sexy doggy oh yeah you need to hit start and go down the character select stage so right now Nick has one win Colin has two Greg has one I have none let's make that clear I think you got one over me I think you pick it up I don't know soex I'm getting worse as it goes apparently start off best game number one yeah going downhill classic match up what is uh what's left trigger then does anyone know the R2 and El R2 Fierce was all of them together them together it makes sense that's why I keep doing that Steven move cuz I just keep keep hitting that **** Whoa We got some dancing ladies and men and and a two on the back there",
            "start": 976.36
        },
        {
            "text": "together them together it makes sense that's why I keep doing that Steven move cuz I just keep keep hitting that **Street Fighter** Whoa We got some dancing ladies and men and and a two on the back there the classic match this is the paths R friend versus friend you think hair versus dop hair apparently he knew this was his path I is this like a knockoff Rio this is I think or did it makes me think a fast and furious yeah it looks like a then that makes me sad cuz I think of that Whiz Khalifa song oh you got you **Street Fighter** you you gave me that one little delay of getting back up that's cool that spinning animation is really cool I wish I had more time to dedicate to this I really love fighting it I just don't get him sense like I always like late night well I mean I haven't played this since Street Fighter I got a long time ago now 24 years ago I remember when my brother came home with **Street Fighter** was awesome oh son of a **** see Greg is a charge character means good her characters like charge up like",
            "start": 1046.84
        },
        {
            "text": "I got a long time ago now 24 years ago I remember when my brother came home with IT'S was awesome oh son of a **** see Greg is a charge character means good her characters like charge up like the quarter Circle punch thing I'm not good at it but I like CH know gotta rep it for that Scorpion Sub-Zero reptile are all related somehow they're they were similar clothing exactly they're all reskins of the same game and Sub-Zero are brothers I believe Reptile some kind of lizard guy who hung out he's their pet he got hit with the Ooze yeah he was the Iguana they all had and then he took what he learned you see the Ninja Turtles reference in a division no it's a super small e piz MOX with Nunu on it that cool cuz in New York yeah you assume the virus killed the turtles though nice I don't know about that I've been reading the all I know is that it's SE transmitted the Batman and Turtle comics big fan I'm enjoying them they're really cool I like when he's like this you",
            "start": 1103.92
        },
        {
            "text": "about that I've been reading the All I know is that it's DC Comics' Batman and Teenage Mutant Ninja Turtles comics, big fan I'm enjoying them they're really cool I like when he's dark yeah I like when he's like this you know this city is just an open field in our universe be the **** up Nick you almost had this this like when you put Goonies instead of Goonies too that was crazy that was close good that was a close one final match uh Tim versus Greg, Tim or Greg you take M, Tim you take Nicks keep you on the same side you do everything cuz your first player bro H I enjoyed fighting with you beats everyone do we all just tie for third or second two well I think Colin won already just by default yeah but Tim if you beat Greg then we're all have one win oh if you win you get second place no pressure God no pressure but you were the one before that started saying that you were like you pull me aside you threw up in the locker room you were like I don't want to go out there I can't do it I haven't played Street",
            "start": 1165.84
        },
        {
            "text": "but you were the one before that started saying that you were like, you pull me aside, you threw up in the locker room, you were like I don't want to go out there, I can't do it, I haven't played Street Fighter since the death of my parents, my parents were killed by M. Bison (not \"superus\") I could have gotten in a car with them but I chose to play Street Fighter instead, I could have saved their life; Shoryuken is the final fight and then we'll show you the records, the score sheet here it's going to take place on a bustling side street yeah just where we wanted it to end yeah Chle likes look at my thing go through by a thing I often do whoa look at your thing go my thing whoa you want to see my kung fu I'll show you I like, I was going to say I like the art why can't like yeah the Art's awesome the animations are awesome it's a lot of little things going on it's just all completely absurd all completely absurd like Chun-Li's quads there's no way human being should have quads that way",
            "start": 1221.68
        },
        {
            "text": "awesome the animations are awesome it's a lot of little things going on it's just all completely absurd all completely absurd like Chun-Li's quads there's no way human being should have quads that way putting it out there she's always had big quads because she's a kicker just like K. C. Cat, yeah how big were how big were the quads not very big she was a little she was a little cat she was a sweetheart I miss her very much she lived for 17 years oh **** how you get that out of there come on now come on back at the end of it what did what did it look like for you there what the cat yeah she was skinny and and sick you had her crated yeah she actually died charging like you were talking about you told you telegraphed it from the start and I didn't even think about it the charging she was just riding her hog down the road that was my trigger she went the way she lived how you do that I I hit all the shoulder buttons hard wait who won that one oh **** Tim looking for a win here just got on the",
            "start": 1272.28
        },
        {
            "text": "her hog down the road that was my trigger she went the way she lives how you do that I hit all the shoulder wheels hard wait who won that one oh **** Tim Gettys looking for a win here just got on the board just for some respect oh Tim actually gave me the hardest fight of all of you he did I rolled over Greg and I basically rolled over and showed you our now none of us are using it's going to piss off every Street Fighter purist cuz none of us are using whatever those things are at the bottom oh we're not playing the sh we're just having fun who cares I've said that I could go MLG if I want to **** **** **** oh that was hilarious I like when it degrades into a slapping match we go he does so much damage spinning Star Kick Tim I don't want to alarm you but you need to not let him hit you anymore no final match damn it damn it damn it all of it on the line Tim you're so close you can pull this out bro we can all tie for second in a true Kinda Funny way 38 tie for second but",
            "start": 1319.36
        },
        {
            "text": "hit you anymore no final match damn it damn it damn it all of it on the line Tim you're so close you can pull this out bro we can all tie for second in a true kind of funny way 38 tie for second but not with **** like that you got to get better immediately at the game whatever you're doing is not working maybe do some sort of counter or a combo break and PR hit so hard **** sorry how was that happening cuz I keep you trying to like do the damn thing all right I was hitting the play but that's you have to do no you have to get you got to do it what do I so hold on no don't you won hold on but VT trigger I'm hitting all the buttons what what the **** your shit's not full I have to what your shit's not full oh wait I thought it was close now it's full it's not it's not I'm dead I'm you're looking at the wrong screen oh Tim pulled it out three ways High got **** Nick you're saying it's full I know it's not full **** I'm not that character Nick it's on the right side of the",
            "start": 1377.8
        },
        {
            "text": "you're looking at the wrong screen oh Tim pulled it out three ways High got  Nick you're saying it's full I know it's not full  I'm not that character Nick it's on the right side of the screen the whole thing was full I'm not that character in the comments below tell Greg he's an a-hole everybody in the comments below please show Nick how to read the  bars here we go the board my guy Le was on the left third win for one very compelling as you can see here everyone one and two mhm your boy Colin Moriarty dinino mhm no don't Don't Clap cuz that wasn't very good Vincent janito  you beat you Mark Ryan  you Colin can beat you whoever plays is really good on Twitter  you damn you guys are being really man we're Hy man I'm G put it out there you know back in the day Greg when the Brazilians brought Jiu Jitsu to the world they had a standing invitation anyone could walk into their dojo in Brazil and challenge them and they would beat the  out of him right",
            "start": 1446.56
        },
        {
            "text": "Greg when the Brazilians brought Jiu-Jitsu to the world they had a standing invitation anyone could walk into their dojo in Brazil and challenge them and they would beat the **** out of him right now I'm throwing that out there to you you think you're good at Street Fighter someone we know preferably who already knows what this place is we don't have to go through that whole ring roll challenge Colin yeah he will fight you Benny White he'll kick the teeth out of your **** face don't challenge me please challenge him we want to show you Street Fighter 5 on PS4 and PC it's available now it's pretty fun I know it's a little content light according to a lot of people so I don't have much of an opinion on that but it's it seems like it's a lot of fun and people are going to enjoy it so check it out if you want you don't want to oh well sorry we didn't play it very well but we like to see it anyway we'll see you next time on Kinda Funny Games bye",
            "start": 1498.0
        },
        {
            "text": "It out if you want, you don't want to, oh well. Sorry we didn't play it very well, but we like to see it anyway. We'll see you next time on Kinda Funny Games. Bye. Intro will man leave all I'm saying Betty White sucks. Betty White does not suck. I like Betty a lot.",
            "start": 1529.08
        }
    ]
}