{
    "id": 1573,
    "video_id": "nxyzrz504yA",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Karaoke - The GameOverGreggy Show Ep. 116 (Pt. 2)",
    "description": "Tim Gettys wants to know everyone's go to karaoke songs.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1456214401,
    "duration": 1443,
    "transcript_chunks": [
        {
            "text": "Tim, yes, what's your topic? My topic is karaoke. Oh, yes, so there's a reason for this, and that reason is I just came from Philadelphia, which it's actually where the karaoke came from, that's what I heard, that's where it was invented. Well, every **thing** is the first thing in Philadelphia; it's like you could not walk a block, and I'm talking even in like the projects and the not really nice areas without some plaque that's like this is the first gutter that was ever made, this is the first bell, this is the first Dunkin' Donuts. And it's just like, goddamn, it's at least 100 years old, yeah, at least if not one. I enjoyed my time very much 'cause I was and I went to Pat's, yes, it was Pats; that's the name of it. Pats and Geno's, yes, they're two competing Philly cheesesteak places that are directly across the street from each other facing each other in the most like intense Mexican face-off I've ever seen, and stand-off, yeah, and it's amazing. Face, I just, I just love that they're just **like** like",
            "start": 2.85
        },
        {
            "text": "street from each other facing each other in the most intense Mexican face-off I've ever seen, and stand-off yeah, and it's amazing face. I just love that they're just talking so hard to each other, especially Goos, cuz like Sam's is the other place no Pats, Pats, it's like this sorry Kevin just looked at me when I said Mexican face-off he looked at me like he was expecting me to do a version of Face Off with a Mexican accent and I really wanted to but then he was like \"don't do that\" version of Face Off oh sure with the Mexican accent it'll come off super racist, I apologize to him, it's fine um yeah freaking Pats was just like they're chill they're just like Hey we're classic and we're the first like they had that vibe Goos is just there's like neon signs and stuff and they're just have middle fingers up did they still look like it was September 12th 2001 no remember I was telling you about that",
            "start": 58.84
        },
        {
            "text": "is just **** there's like neon signs and **** and they're just have middle fingers up did they still did it still look like it was September 12th 2001 no remember I was telling you about that before when I went there and I walked up and it's all like you don't speak English get out of America and there was like all this never forget stuff I'm like oh oh no what is happening know that but it was it was very American and just like in its exuberance um I thought they were both very okay and I didn't didn't love my adventure there now having said that I need it to be pointed out that it was freezing cold like now I'm not just like oh I'm this little boy from San Francisco I don't know what cold is that is true having said that I was there with East Coast people and they're all like it hasn't been like this this is too damn cold and it was too damn cold I thought it was going to die on multiple occasions so I think that did kind of ruin my experience because they don't have indoor",
            "start": 102.68
        },
        {
            "text": "hasn't been like this, this is too damn cold, and it was too damn cold I thought it was going to die on multiple occasions so I think that did kind of ruin my experience because they don't have indoor seating right which I'm going to be honest that all goes into the food experience like if you're in freaking Philadelphia and it's negative a thousand degrees how are you going to just have outside tables that doesn't even make sense like step your game up maybe you should be the first place to make some good decisions and beat the other guy you'll send him a plaque that's all they need have another building next to it then they'd be good yeah give them whatever plaque they want anyways we went to karaoke sure and immediately I was upset because I thought we were going to one of those places where there's like the separate rooms you go into and like you're just with your friends that's real karaoke that's not fun American karaoke so then there's the fun American",
            "start": 139.4
        },
        {
            "text": "one of those places where there's like the separate rooms you go into and like you're just with your friends that's real karaoke that's not fun American karaoke so then there's the the fun American karaoke which is like you go to a bar and then there's a stage people go on stage I don't like that I don't like that at all it's it's like it it just there's something about it that just a little too presentational for me intimidating uh it's not even that that's not why I don't like it but this place was in it was a weird in between where it was a bar but there was no stage there was just mics that would travel around the room I don't like anything about that and it was **** awesome because every time a new song would come on there was just screens all around the room and you didn't know who like was singing or where they were so every time a new song Started you're like try to look around to see who it is and there's like mini mosh pits starting in the room and as the night got drunker it",
            "start": 174.72
        },
        {
            "text": "was singing or where they were so every time a new song started you're like try to look around to see who it is and there's like mini mosh pits starting in the room and as the night got drunker it just got hell of fun like that is now my new preferred form of karaoke so shout out to Philadelphia cuz that was awesome W they're the first karaoke place to do that for you yeah they are also the first karaoke place to not have genuine Pony which was the most upsetting thing cuz that video would have been awesome but they did have Everybody by Backstreet Boys so I kind of rocked the **** out of that one that was good but anyways I wanted to know what you guys thoughts are on karaoke what are your go-to songs and what style do you prefer it's a good topic I Love karaoke and I'm getting out my karaoke song list for you do you have like a notepad ready I love you you're such an amazing you can read down that right there now these are not ranked in order of favorite song If",
            "start": 215.6
        },
        {
            "text": "out my karaoke song list for you, do you have like a notepad ready? I love you, you're such an amazing karaoke singer, you can read down that right there. Now these are not ranked in order of favorite song. If I'm going to karaoke joint, I go in, I crack the book, I go to Darryl Worley - have you forgotten the 9/11 song? M, let me tell you, it plays well everywhere but New York and I know that from experience. All right, you go there, you sing about it 'cause he talks about the Pentagon in a song; you kidding me, that's fun! And then if not that, then I'm doing Dynamite Hack - Boys in the Hood, that's a good one, that plays well. My Strength, yeah, yeah, yeah, yeah, that's very... you it is very, in a nutshell, all right. I don't know 90% of these songs; you're an idiot if if I could be like that, yeah. Three Doors Down - if I could be like that, I would get anything song. You suck so far, you guys, Daryl about this in a minute. Greg Miller is the karaoke God because he knows every word to every song ever and I think that's the key.",
            "start": 252.8
        },
        {
            "text": "that I would get have anything song You suck so far you guys darling about this in a minute Greg Miller is the karaoke God because he knows every word to every song ever and I think that is the key to karaoke you can't be reading off the screen you need to be freeling you need to be performing nothing is more impressive to a lady you're trying to court than if you are singing karaoke Taylor Swift and you turn your back to the monitor and sing it to her that's the only way to go see I will I will disagree with you respectfully in that I think you should know the words but toward the end of the song act like you don't really know the words like you are just so you're not a psychopath who practices their karaoke before you walk in well there is that guy and that guy was coming out strong that night it was this giant really big dude and oh he was just killing it he was just it was Valentine's Day so that that was love was in the air and he did the thing where it's like",
            "start": 295.48
        },
        {
            "text": "out strong that night it was this giant really big dude and oh he was just killing it he was just it was Valentine's Day so that that was love was in the air and he did the thing where it's like okay you're going a little too far on the freestyling where it's like the words were like oh baby and he's like oh oh oh oh baby baby baby baby and he's like look at random girls I'm like yeah right what you got to do is you got you got to get the fine art of by about the third verse by whatever the last verse is you break you laugh a little bit and everyone in the audience laughs with you like oh this guy is immortal like he's not he's not some superhero there he's not a God you know there he's one of us he went through the song book just like me exactly I could be him if I just tried hard and sang in my car on the 91 freeway for like 5 years in college yeah you know I mean good yeah now something I liked about the like weird you know bull pit area thing was that like you can kind",
            "start": 338.84
        },
        {
            "text": "sang in my car on the 91 freeway for like 5 years in college yeah you know I mean \"Gold Digger\" yeah now something I liked about the like weird you know bull pit area thing was that like you can kind of like if you saw someone was super into your performance you can like give them the mic and have them Finish Lines and **** and it was awesome it became like a community effort and I really appreciate that let's keep going down the list Greg now this list is deep so I don't understand what Colin's already hating on about it it's it's a car that's the problem it's a karaoke song for every mood maybe I'm depressed when I go there I'm awake maybe grandma died I'm going to get into the karaoke Mantra in a minute what and the inherent flaw of this list but social butterfly Colore Arti here how to be successful karaoke I want to give a shout out to the like 60-year-old Asian man that tried his best to Sing My Heart Will Go On And it's like I I'm assuming he never heard the song before he",
            "start": 379.2
        },
        {
            "text": "to be successful karaoke I want to give a shout out to the like 60-year-old Asian man that tried his best to Sing \"My Heart Will Go On\". And it's like I I'm assuming he never heard the song before, he did it because it was just a disaster in the most beautiful way. The thing about that song is it comes from a place of pure passion, yeah so you don't actually have to sing it to feel it if you know what I mean. Oh yeah nothing beats \"The King of Wishful Thinking\", come on now, that is that's a good song. \"The King of Wishful\" thank I'll get over you, pretty woman, I know that's good song. There's this great breakdown 80s is great during \"I'll Never Shed a Tear\". For you see I think things are changing that's good do that I would destroy I have destroyed with that song so we're now I think the you know the demographics are changing it's a '90s game now when you go to the karaoke bars it's like people there are C they go CRA 80 songs that will never go away there is during every karaoke night for",
            "start": 418.4
        },
        {
            "text": "the demographics are changing it's a '90s game now when you go to the karaoke bars it's like people there are C they go CRA 80 songs that will never go away there is during every karaoke night for instance someone always plays Journey and they either play it too early and just small town girl right yeah you can't play too early can't play too early that's got to be everyone's got no don't pick that song drink one no come on Journey it's the obvious choice drink 14 **** play some Journey right now I need to sing to that and you just see a you'll look back if you're singing or if you're you know you're facing people and just a sea of people exploding and the worst **** sound coming at you cuz no one can sing J no one can sing at all except my brother he can actually kill he can CR BR can do but Bren and can't last like longer than two vers I'll tell you just as a quick thing I will never forget Brennan singing any way you want it and I was like holy **** like that guy can sing",
            "start": 460.32
        },
        {
            "text": "can do but Brian and can't last like longer than two versions I'll tell you just as a quick thing I will never forget Brian singing \"Any Way You Want It\" and I was like holy **** like that guy can sing like really rock that song his \"Dirty Pop\" is my favorite by Green Day he does the \"American Idiot\" dance from the video and like oh if you've seen R.E.M. and I know that's a special site yeah it really is going all right we got you can move on everybody else's list I'm just letting you know how serious I am some of these are works in progress I wouldn't be I wouldn't go out and put out but you know like on a Tuesday night I'm some I'm in Nashville for some reason I'll go to open mic night Greg, I love you so much I got to get through this list because I love that you referred to karaoke's open mic night they're all open mic nights K crazier careers have been launched screaming \"Infidelity\" oh yeah Dashboard Confessional okay but as for now G I love all the emo stuff come on California Yeah by Green Day",
            "start": 504.96
        },
        {
            "text": "all open mic nights K crazier careers have been launched screaming infidelities oh yeah Dashboard Confessional okay but as for now G I love all the emo stuff come on California Yeah by Phantom Planet California I saw Phantom Planet in a play in a record store once it was really weird there people were it in California no it was in Boston uh probably 100 people it was interesting when they played the song California how did everyone get it did they know what California that's all I wanted to see I think I might that's what everybody wanted cuz I like they just put out a new record doesn't matter teenage dirtbag yeah Weezer the Blue Album come on that's a good one take me home tonight yeah I'll give you that so that's the second song on this list that I think is a karaoke song Al be by Edward Sharpe & The Magnetic Zeros yeah that one shirtless Wisconsin on a bachelor party that one I I destroyed a bar we were at come on feel the noise yeah I did not know it was spelled c it okay you like that I'm",
            "start": 548.52
        },
        {
            "text": "be by Edward McCain yeah that one shirtless Wisconsin on a bachelor party that one I I destroyed a bar we were at come on feel the noise yeah I did not know it was spelled c it okay you like that I'm I'm I'm that accurate I want to be able to find these songs that a here's the thing that got me most excited about this list there was two songs on this list yeah common people and home sweet home right okay don't know what those songs are you know home swe by Poison - Home Sweet Home, I love that song that's a hard song People Tonight I'm On My Way we gotta go let's go right now go carry yog who's com I have no idea that must have been I heard it somewhere I was like I'd like to learn that song now my favorite thing about these two songs is it says learn common people and learn home sweet home you the most serious **** I've ever met about this **** and I appreciate that let me let me get down Home Sweet Home, if you can rock Homee Home, I that's awesome we just did it's that's a hard song dude",
            "start": 589.92
        },
        {
            "text": "you the most serious **** I've ever met about this **** and I appreciate that let me let me get down home is if you can rock homee home I that's awesome we just did it's that's a hard song dude it changes register Midway and there's like there the problem is I can sing all these songs for 5 seconds but how many of us have been out there where you're like I got this and by the second verse you're like I got nothing left in the tank that's why I started writing right CU you get up there and because it's always oh I know that song I enjoy that song you get up there and then you learn oh I don't know God so my favorite thing was uh this group it was like a bachelorette party and one of them was like let's do um Always on Time by Ashanti and Jawsh 685 Always on Time, except you forget that it's the Jawsh 685 part where there's verses in between each course these people just pretended that wasn't a thing",
            "start": 641.32
        },
        {
            "text": "on time that song and it's like oh that yeah I know that song except you forget that it's the Jawbreaker part where there's verses in between each course these people just pretended that wasn't a thing and sang the chorus for three minutes straight nice just over and over and over you got to do so here's the Mansion so this is the thing about you know Greg's everyone can have their own list it's totally fine yeah there's a that's a self-indulgent list the art of karaoke is to make sure you're playing songs people around you actually give a **** about if you're playing Teenage Dirtbag which I appreciate because it is from a band from Long Island and we all like that very much we all love Long Island then like the mentality is wrong you know what I mean like you have to play songs that people know I agree you're under selling Weezer's potential here you understand Weezer has a hook in a lot of us of our age bracket where you get up there and it might be that Weezer's Dirtbag and people",
            "start": 683.72
        },
        {
            "text": "know I agree you're underselling Weezer's potential here, you understand Weedus has a hook in a lot of us of our age bracket where you get up there and it might be that we is \"Dirt\" back and people like they're like oh the American Pie song yeah is it an American Pie people relate it to that because of all its in another Jason Biggs movie one but so like my thing is like cuz I I did a lot of karaoke in college especially and then early on when I came here I I love KoRn I think it's fun but you like you learn that quickly like you have to do things that like people really know and like like if you want to have a lot of fun so like to me it's like uh like any Tears for Fears song is fun to do or like Maneater is always my **** you're gonna get you're going to bring down the house like if you want to get in 90s like Interstate Love Song or Jeremy or something it's really funny to do like songs that people like heard on the radio and know whatever because I would love to do",
            "start": 724.44
        },
        {
            "text": "like if you want to get in 90s like Interstate Love Song or Creed's \"Jeremy\" or something it's really funny to do like songs that people like heard on the radio and know whatever because I would love to do like really obscure **** because it's fun not that any of that's like super obscure because not I love Dashboard Confessional for instance um but that was just my I mean it's not serious it's it's karaoke really gives a **** but that was always my mentality was like what is the song what is the song about that like will make people like elicit like interest like because karaoke is a team sport you know I mean it's not it's you got to have people out there sing and and that's actually to Greg's earlier point I'm like I will give you that because when it hits that hook everyone will go oh I'm just a te and they'll go yeah yeah cuz they won't know the other part of the lyrics but that's when they shut up and listen but I I understand Colin's point and it's the same problem I have with",
            "start": 766.16
        },
        {
            "text": "I'm just a tea and they'll go, yeah, yeah, cuz they won't know the other part of the lyrics, but that's when they shut up and listen. But I, I understand Colin's point, and it's the same problem I have with Halloween costumes - people should know inherently what you're wearing; you shouldn't have to explain your Halloween costume to a group of people and have them fake like they know what the **** you're talking about, meanwhile they're like, \"He's gone off his meds,\" right? Like, with me, I'm with you on that one, Colin. I think you go obvious choice when maybe one step below the obvious choice is as far as you go, yeah. Like to me, cuz to me it's like karaoke isn't fun if people around you aren't having fun - like if you're up there singing and everyone's like, \"What the **** is this?\" That sucks; you can just do that in your bedroom, yeah. Like so, like that's so that's my whole mentality, that's why I think like \"The Police\" are really fun to sing or like you know, like you can are so.",
            "start": 800.04
        },
        {
            "text": "that sucks you can just do that in your bedroom yeah like so like that's so that's my whole mentality that's why I think like the Police are really fun to sing or like you know like you can't be so hard to sing how are you guys doing this or because it's not about like hitting all the registers or whatever it's about you know enjoying yourself true so karaoke like it makes everything sound good on the mic at least I don't know what magic it has but it's like well they usually put the actual vocals behind you too well that but also they do some weird mixing thing that's like man like I don't sound like that I no I don't sound like that you think you sound good to the audience everyone just sounds like no but I mean I'm singing with other people yeah like I'll be with them and like I hear it and I hear them in real life and I'm like damn there's a difference um I'm with you on this one Colin because one of the songs I liked I like to sing a few a handful of songs small smattering",
            "start": 841.84
        },
        {
            "text": "hear it and I hear them in real life and I'm like damn there's a difference um I'm with you on this one Colin because one of the songs I liked to sing, a few, a handful of songs, small smattering of songs, one of them is hit or miss and that's \"Creep\" by Radiohead, like I love that song but you have to pull it out right after there was a like what right after someone did \"Don't Stop Believin'\" like then you do R you cool it down a little bit with Radiohead right and then someone else brings something back up you can't start your set with Radiohead cuz people are gonna be like what this guy Jesus I don't want to talk to him and maybe get him a salser water or something instead of alcohol he shouldn't be self-medicating get the blades away from yeah exactly but I like to start the night off with the same song every single time and that's Stevie Wonder \"Superstition\" now not a lot of people know they know that song and not even if you don't know that song it's just a really good song",
            "start": 875.04
        },
        {
            "text": "off with the same song every single time and that's Stevie Wonder - Superstition now not a lot of people know they know that song and not even if you don't know that song it's just a really good song that kicks the night off at a good tempo so to speak um if I'm feeling my oats I will go to Marvin Gaye - Let's Get It On cuz women love that song and that's one of those where you can literally just molest people guys and girls and as long as you're singing Marvin Gay they're like it's Marvin Gay - Let's Get It On get let's get it on um and then when I'm really drunk and this is always a crowd pleaser because no matter every time I pull this out people go wild and you just look around and there's a crowd behind you have always wanted to do this Gin and Juice by Snoop Dogg - that rap you would not think goes over well in karaoke because it kind of defies the law of karaoke it's not really singing but it is performing and everyone knows the lyrics to Gin and Juice and that see that's the key is",
            "start": 914.92
        },
        {
            "text": "think goes over well in karaoke because it kind of defies the law of karaoke it's not really singing but it is performing and everyone knows the lyrics to Gin and Juice and that see that's the key is with rap you need to know every single lyric without looking at the screen and you need to be able to kill it and perform and like act out and just do dumb **** people **** love that **** if if you're messing it up you start we were when we were at The Brass Monkey one year after E3 or 43 cuz that used to be the trip um we were there watching karaoke and this guy got up and he I'm I think I got all this right but it's not the important part but this guy got up I want to say he was like typical white country guy right and he got up to do Not Gin and Juice but some other Snoop Dogg song and it went in and as soon as he started everybody was like oh **** and he knew everything and this guy got up from the bar walked over he was in a shirt with a collar you remember this the earpiece in his",
            "start": 959.68
        },
        {
            "text": "in and as soon as he started everybody was like oh **** and he knew everything and this guy got up from the bar walked over he was in a shirt a collar shirt you remember this the earpiece in his thing and he just took out a water bottle and made it rain on him and it was like the most **** crazy thing we'd ever seen yeah that's ballers **** see the thing the thing for me and I have this going for me is it's an easy win is do either I I baby or any Eminem song and I get that instant Street cred yeah okay magore doesn't have the same level of you know I this guy it's perfect because then people you're in on the joke if you start doing like like you're not going to see me be doing like Kanye songs and **** you know what I mean like then it's like H but if I'm obviously in on it they just love it gotcha it's the truth now let me ask you this question the all important question when you get to some of the more racy expletives in some of the rap never do them never do them right",
            "start": 1003.0
        },
        {
            "text": "just love it gotcha it's the truth now let me ask you this question the all important question when you get to some of the more racy expletives in some of the rap never do them never do them right I mean well see that's why I stick with the white people oh okay because I was looking and there was like certain songs like \"Paris\" by Kanye West and Jay-Z I'm like I'd love to do that I can't do that so I'm just not going to someone else did it and I appreciated that because then I could sing along and not say the parts that I I don't want to say right you know what I do in Boys N the Hood with Dynamite Hack of course the n-word pops up once and I say young Greggy see I don't like doing that I don't I I just I want to keep it pure I don't want to **** with **** I want to get in there and like but it's fun though CU you can actually like like with rap it's it is fun CU a lot of people will just kind of chime in on the parts they know and things like that you I would recommend picking something",
            "start": 1043.64
        },
        {
            "text": "it's fun though CU you can actually like, like, rap it's it is fun CU a lot of people will just kind of chime in on the parts they know and things like that. You I would recommend picking something of the classics that have been around for a long time don't do I wouldn't do anything that's like brand new cuz people like the song but they don't know the lyrics maybe yeah well I will say Hotline Bling **** killed it oh that's yeah but that's not the hardest that's pretty much entire lyric all he has to do is this yeah or whatever the **** that dance is that he does. Did you see that AT&T commercial he's on with Kevin Butler ridiculous Greg there's a decisive lack of T Swift on your list right yeah I don't need to I mean she I don't want to butcher her songs her lyrics I try to stay in something I know I can hit a Taylor Swift song Hard to perform I've done it once or twice obviously with my SingStar background pedigree if you will uh but like when I'm out there it's",
            "start": 1082.12
        },
        {
            "text": "in something I know I can hit a Taylor Swift song. Hard to perform, I've done it once or twice, of course, obviously with my SingStar background pedigree if you will uh but like when I'm out there it's also a lot of people are going to do that I don't need to go that way you know what I mean I don't need to get to that level. I Got King of Wishful Thinking in my back pocket they didn't have any new Taylor Swift at the one I was at either it was all the older stuff a random surprise hit that I was one of those things I'm like I didn't know I knew every word of this there was a Grease medley that had like all the key hits oh my God that the place blew the **** up for that oh everyone loves Grease if there's one thing people like more than drunk karaoke, karaoke goers love more than Journey it's Grease 100% yeah it was an experience for sure you find out some really fun **** about your friends when a Grease song comes on and like what what is that is that you're the one that I want is that the name of",
            "start": 1127.08
        },
        {
            "text": "100% yeah it was an experience for sure you find out some really fun facts about your friends when a song comes on and like what, what is that? Is that you're the one that I want? Is that the name of the song? Yeah, I don't know, I don't know the name of the song. When that song comes on you look over at even some of your hardest hitting friends and they're like \"honey\". Who would you describe as your hardest hitting friend? I don't have probably Kevin, probably Kevin. I don't have any I don't hang out with any thugs anymore, yeah anymore. So then I guess to round out this topic the other part you asked was what do you prefer more cuz I think again my song's built for or my song was built for maybe I'm in the private room maybe there's five of us maybe in the private room there's 10 of us maybe I'm in the giant Mosh Pit as you call it. What do you prefer to see now? I like this Mosh Pit thing, like the ability to like collaborate with people man it made it it made it a special thing and again",
            "start": 1160.36
        },
        {
            "text": "in the giant Mosh Pit as you call it what do you prefer to see now I like this Mosh Pit thing like the the ability to like collaborate with  man it made it it made it a special thing and again they didn't have Thong Song very upset about that come on yeah where's the love Francisco but I prefer that or the rooms I don't like the stage thing I just like stage thing stage is the best that's the point that's the whole point you're the best we ever did the best karaoke ever was Edness and Chiman Library where you remember this we always talk about this in South City about yeah Colin and I met there for the first time uh when we cuz we'd go there with like 19 IGN editors and take over this Filipino karaoke bar that was run by transvestites on the front that stood up there and then they hosted it and did comedy segments and made fun of their arm hair and all this other stuff and then when you came up to do your songs they would fall into the back and they would be backup",
            "start": 1200.76
        },
        {
            "text": "then they hosted it and did comedy segments and made fun of their arm hair and all this other stuff and then when you came up to do your songs they would fall into the back and they would be backup singers to you so you already came even if you didn't have a crew which everybody did of course but if you didn't have a crew for your song you had people in the background that were making better and I of course always hammed it up with them and stuff like that that's awesome so that sounds cool I mean I I love the stage um I don't like the small rooms although the small rooms are very fun but that's more of a party with karaoke That's not really karaoke me two car G to be is you get a little butterfly before you go up you're a little drunk you start singing and then you look out into a sea of people you don't know and they're singing back to you and you get that semi like concert vibe for a second where you're like hey this must be you get a flash of what it might feel like to actually",
            "start": 1239.08
        },
        {
            "text": "of people you don't know and they're singing back to you and you get that semi-like concert vibe for a second where you're like, \"Hey, this must be what it feels like to actually perform in front of real people for, like, in a real setting.\" Um, I'm gonna give a quick shout out though to Hall & Oates, uh, namely \"I Can't Go For That,\" which is another song that I want to learn how to do in karaoke. So kudos to you for reminding me of that. Yeah, Hall & Oates is great karaoke. That's quintessential karaoke, but I would say like, the song that is fun to sing if you have the balls to sing it is ABBA's \"Dancing Queen.\" Now that's a song that people can get down to, you know? That's a tough song, dude. Yeah, and like, you have to have some balls to sing that song, 'cause there's a high register on that. You gotta have actual balls to sing that song, true. That's actually a really good point, that's actually a really great point, style so like that's",
            "start": 1271.64
        },
        {
            "text": "Song a lot there a high register on that you got to have actually no balls to sing that song true that's that's actually a really good point that's actually a really great Point style so like that's that to me like yeah I agree it's like karaoke to me is like only karaoke if you're doing in front of people you don't know like like that's that's the idea you know like in my opinion like that's the singing in front of people there's different ways you can do it I mean SingStar is still karaoke or something like that but it's about like not being like there like that's what I always think about when I when I look at a song it's like yeah I'd love to do a 311 song something no one wants to hear that like you have to look at it be like what like what do people want to hear like what's going to like make like what are they going to sing along to you have to find you have to identify like those specific songs you know um in my opinion I mean that's the way I feel because you have to be\n\nI corrected the following:\n\n* \"sing star\" to \"SingStar\" (proper noun, a popular karaoke game series)\n* No other changes were made as the text was already clear and grammatically correct.",
            "start": 1314.48
        },
        {
            "text": "to like make like what are they going to sing along to you have to find you have to identify like those specific songs you know um in my opinion I mean that's the way I feel because you have to be cognizant of the people around you I because I've been to so many karaoke places where like I've even heard people being like what is this like why is this person even playing the song like you know like and that's true because you're wasting everyone's time you have to like so it's like a group it's a team effort it's like baseball like everyone's getting there like going up to the plate and you have to like rely on each other you don't want like someone to strike out and it affects the entire team you know like oh oh yeah so that's that's kind of my take on it I have friends that like I know can't sing and won't do it and they get too drunk and I'll just be like no no we're on a hot streak right now bro oh speaking of hitting streaks one of the people in my group did I Will",
            "start": 1348.24
        },
        {
            "text": "can't sing and won't do it and they get too drunk and I'll just be like no no we're on a hitting streak right now bro oh speaking of hitting streaks one of the people in my group did I Will Survive that's another one that's just like every song oh if you want to talk about the you want to pull a song out and have every single person in the bar be like oh I'll just hum you the first three like notes in this car every like you got to do that someone's got to do that I don't pick it though cuz it's it's on the list like 50 yeah that's a song that that song's kind of ruined for me because it's such a connotation to Boston Red Sox but um it's ruined for me because Damon always does it and he does it the best I've ever heard like Damon just destroys it you're like no one else do it I'm glad the right for that was great Damon has that range for Damon has that that Timber to his voice that is is like the diamond yeah the diamond it's the diamond bro",
            "start": 1379.8
        }
    ]
}