{
    "id": 1547,
    "video_id": "x-ukJa3fG2Y",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Chris Tornow",
        "Colin Moriarty",
        "Dagan Moriarty",
        "Kristine Steimer",
        "Matt Scarpino",
        "Travis Willingham"
    ],
    "title": "Kinda Funny: The Animated Series - Ep. 2 \"Haters Gonna Hate\"",
    "description": "Watch Kinda Funny: The Animated Series - Ep. 1 \"Politically Correct Dodgeball\": https://youtu.be/2yhISvYtugM\n\nSupport us at http://www.patreon.com/kindafunny\n \nSubscribe to Kinda Funny! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n \n \nWritten by Nick Scarpino\nAnimation by Dagan Moriarty\nMusic by Tonedeff - http://www.QN5.com\n \nTravis Willingham as Old Man Dunkelman http://www.twitter.com/Willingblam\nMatt Scarpino as Matt Scarpino http://www.twitter.com/ScarpinoMan\nAdditional voices: Chris Tornow\n \n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\nKevin - http://www.twitter.com/KindaFunnyKevin",
    "published_at": 1455210004,
    "duration": 247,
    "transcript_chunks": [
        {
            "text": "Get out! I'm late for band practice. I'll text you when to come pick us up. Whatever, penis. It was really nice of your brother to give us a ride tonight. Are you kidding me? I had to lend him my Vita for the next month. He didn't even want it. The sick son of a bitch is using it as a coaster for his graphics bong. Are we sure this is Wendy Spencer's house? It looks more like the Branch Davidian compound. It's definitely the right place. Kevin googled it twice on his dumb off-brand smartwatch that never works right. It works perfectly fine. Watch. Okay Google, text Tim Gettys. I secretly hate you and have been poisoning your Capri Sun since we were 10. Send. Searching. I couldn't find any results online for \"text Tim Gettys\". Would you like to search for furry porn again? No Google, that's our secret. I don't mean to rain on everybody's parade but what exactly are we doing here? Okay, so, yesterday in gym class, Cindy told Kimmy that Jenny overheard Wendy Spencer saying that she's hella",
            "start": 0.0
        },
        {
            "text": "I don't mean to rain on everybody's parade but what exactly are we doing here? Okay, so, yesterday in gym class, Cindy told Kimmy that Jenny overheard Wendy Spencer saying that she's hella into Taylor Swift. Okay. So for Valentine's Day, we're gonna rip some tea swizzle all night long until Wendy realizes how awesome I am. Or until someone calls the police on us, which I have a distinct feeling will come first. Wait, nobody told me to practice any Taylor Swift songs. Your boy Colin M. doesn't go on stage until he's 100 percent. Colin, we came all the way out here. Can't you just, I don't know, play the drum part from 311's Beautiful Disaster? What the hell did you just say to me? Okay, here we go. One, two, three. I stay out too late. Got nothing in my brain. That's what people say. That's what people say. Just what in the hot holy shit do you four and a half morons think you're doing? Um, we're serenading your daughter, sir? Not from where I'm sitting, Junior. From here",
            "start": 50.04
        },
        {
            "text": "Say. That's what people say. Just what in the hot holy shit do you four and a half morons think you're doing? Um, we're serenading your daughter, sir? Not from where I'm sitting, Junior. From here, sounds more like you're scraping the inside out of a dog's asshole. He must be talking to you guys. I absolutely crushed that fill leading into the second stanza. I'll tell you what. I'll give you the better part of five seconds to get the hell away from my property before I come out there with my shotgun and shoot your little peckers off. How's that sound? That sounds perfectly reasonable to me. Yeah, we should go. I'm not entirely sure what my pecker is, but it sounds important. Guys, haters gonna hate. Haters gonna hate. Damn it. He's right. What the hell do you mean he's right? Guys, I got this. You see, Colin, if we give in to the haters hating, then the terrorists win. Please refrain from ever referencing Taylor Swift and terrorism in the same sentence again. Okay, one, two, three.\n\nI made no changes as there were no obvious phonetic or spelling errors that needed correction based on the provided metadata and context.",
            "start": 98.4
        },
        {
            "text": "this. You see, Colin, if we give in to the haters hating, then the terrorists win. Please refrain from ever referencing Taylor Swift and terrorism in the same sentence again. Okay, one, two, three. Might go on too many dates, but I can't make them stay. Called it. I don't want to come off like a Kanye, but we sounded dope. Guys, look. Wait, is that nerdy Barb Dunkleman? Oh, for the love of God, we're not even at the right house? Okay, Google, you failed me for the last time. You are nothing without me, fat boy. Nothing. I'm sorry, Tim. I know how much this meant to you. Are you kidding me? Once Wendy finds out I got arrested for her, she's gonna think I'm the business. Best night ever. Your ability to stay positive absolutely fascinates me. Thanks for watching!",
            "start": 156.6
        }
    ]
}