{
    "id": 2784,
    "video_id": "8ig47TcVoyA",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Kevin Coello",
        "Andy Cortez"
    ],
    "title": "Spider-Man: Homecoming Spoiler-Free Impressions - Kinda Funny Morning Show 06.29.17",
    "description": "Don’t forget to sign up this month! Go to http://wrg.am/funnytank and grab your free tank, garage slot and 3 Days Premium game time while this lasts. The number of new player registration codes is limited.\n\nClick here to get 7 days free of the VRV Combo Pack: http://bit.ly/2se56Px\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1498768630,
    "duration": 3023,
    "transcript_chunks": [
        {
            "text": "What is up everybody? Welcome one, welcome all to the Kinda Funny Morning Show for Thursday, June 9th. Holy crap, it's almost July! I'm your host, Nick Scarpino. With me today, Greg, what's wrong with you? I can't hold. It was too good. Spider-Man: Homecoming was too good, Nick. It was too good. It was, it had no business being this good. The trailers we went back and forth on for a long time, were they hit or miss? Were they good? I thought they were good, but they were showing too much in the movie. We were worried about that. And then Tim's a bigger Spider-Man fan than me. He's like a Superman fan that I am, but he's for Spider-Man. But he was saying like he, he wasn't sold on, he didn't think he was sold on it. Then the posters, the posters were **** terrible. And then we went and saw this movie last night, ladies and gentlemen, and holy ****, ****, holy ****, ****, it was perfect. It was perfect. It was a perfect superhero. Before we go, for those of you watching at home, we are going to get into this right",
            "start": 1.63
        },
        {
            "text": "and gentlemen, and holy ****, ****, holy ****, ****, it was perfect. It was perfect. It was a perfect superhero. Before we go, for those of you watching at home, we are going to get into this right now, but it's going to be spoiler-free. We're going to get into it briefly. We are doing, we're doing a full Kinda Funny Reacts. We'll bring in Tim, Kevin will chime in more, I'm sure. No spoilers. This is just, this is just a, I can't hold it in any longer. I couldn't come home and I couldn't talk to Jen about it last night. There's no one else on the internet to talk to about it. There was no way to talk about it. So you just have to spoiler-free say this movie was too good. So you liked it a lot? I didn't. I mean, like that was the thing going into it. You and I drove over there and my thing driving in was like, I'm like, I need, I need this one to be good 'cause I've made the joke a lot on these show that we do and the fact that I'm a DC Fanboy. Yes, the only Marvel character I ever connected with was Spider-Man.",
            "start": 48.04
        },
        {
            "text": "I'm like, I need, I need this one to be good 'cause I've made the joke a lot on these show that we do and the fact that I'm a DC Fanboy. Yes, the only Marvel character I ever connected with was Spider-Man. And I kept saying that if Spider-Man: Homecoming turned out to be a bad movie, it would be indelible proof that God exists and hates me. And the fact that every DC movie's got to be like, man, and then Wonder Woman, the one I'm not like super, I'm like, I like Wonder Woman fine, that's the one that's got to be amazing, right? So it's like, I'm like, he's amazing in Civil War. Clearly they'll **** this up. Sony's going to **** this thing up left, right, and God damn it, did they not **** it up? And here's what I want to say, spoiler-free of course, and you might be, oh, he's overhyping. I did not overhype this movie. You're going to be great. You're going to love it. Don't worry about it. You're gonna be **** fine, right? Take the comic book out of it. Take, take this what should be an Academy Award-winning",
            "start": 86.28
        },
        {
            "text": "this movie. You're going to be great. You're going to love it. Don't worry about it. You're gonna be **** fine, right? Take the comic book out of it. Take, take this what should be an Academy Award-winning performance from Tom Holland out of it. Okay, take out this amazing **** Spider-Man Peter Parker we've been giving. Take that out of the equation. Take it out, throw it out, throw it out with a bath. What I, literally as soon as I woke up this morning, I started thinking about this movie again. And what I went back to was the fact that in a land of superhero movies that we leave like, that was fine. It was, it was good. It was another Marvel movie, whatever. I, there were legitimate surprises in this movie. There is a moment in this movie when the audience literally collectively went, and then it was like, I haven't been in a movie like that in forever where something happens on and you as total left turn and every talking about it. And then like the Easter eggs and Tim's elbowing me in the side telling me",
            "start": 128.12
        },
        {
            "text": "been in a movie like that in forever where something happens on and you as total left turn and every talking about it. And then like the Easter eggs and Tim's elbowing me in the side telling me who these people are like, like, oh, that's **** Red. I didn't even know that. I, Jesus Christ. What I liked about it a lot was that it felt like a Marvel movie. Yeah, right? You see the Sony, you see the Sony emblems at the beginning, right? This is still Sony Pictures joint Marvel Disney movie, right? Um, but what I liked is that it just, it really lived up to the title Homecoming. It really felt like Spider-Man was home. He's in this universe. And the only, and it wasn't little nods. It wasn't just Robert Downey Jr. It was like that movie from start to finish is embedded in the fabric of that universe. That's **** beautifully. And it really, I think it does a lot of justice to Spider-Man. And I really think it's for the, like again, I'm not one of those detractors or one of those haters who hated The Amazing Spider-Man",
            "start": 166.44
        },
        {
            "text": "and it really, I think it does a lot of justice to Spider-Man. And I really think it's for the like again, I'm not one of those detractors or one of those haters who hated The Amazing Spider-Man or even the Sam Raimi Spider-Man. I loved those movies. I thought they were great. But I feel like this is a great like next evolution of that that really helps tell what like do what Marvel's trying to do. Exactly. And for to bring up all those different movies, it was funny 'cause going into this one, I'm like, I need this to be good. I want this to be good. I always talk about the fact of leaving Amazing Spider-Man, I'm sorry, leaving Spider-Man, Sam Raimi Spider-Man, and calling my girlfriend at the time 'cause I went to a midnight showing when I was working out on the East Coast and calling her and I was just like, I can't stop smiling. That was so much fun. This movie was that times 100. I was smiling the entire time. There were, and this is the thing we're always talk about in movies, right? Of like, well, we know",
            "start": 210.28
        },
        {
            "text": "I can't stop smiling. That was so much fun. This movie was that times 100. I was smiling the entire time. There were, and this is the thing we're always talk about in movies, right? Of like, well, we know they're not going to kill Spider-Man. We know this isn't going to happen. We know, you know, your main hero for the most part, especially in the superhero movie, is going to be fine, right? There were times, and I'm going to **** up my mic, sorry Kevin, where I was watching like the, yeah, like, I mean, they had real, real tension. It's because they set him up. And what I want to talk about is like so many people, no spoilers, so many people talk about, you know, oh my God, the third reboot of this character. But what can they do? This Spider-Man is so endearing and so **** Spider-Man in the way of like that entire, I mean, like the, like he is a different Spider-Man and he is Spider-Man. Yeah, he is. He is not, he is not Tobey Maguire. He's not Andrew Garfield. He is the Spider-Man we all know and love in the of how do",
            "start": 247.04
        },
        {
            "text": "entire, I mean, like the, like he is a different Spider-Man and he is Spider-Man. Yeah, he is. He is not, he is not Tobey Maguire. He's not Andrew Garfield. He is the Spider-Man we all know and love in the of how do you fit Spider-Man into this universe that already has all these superheroes? They **** do it in such an amazing way. And they do it and I think they really embrace the youth. They embrace the fact that he's in high school. They embrace that he's, I think he's a sophomore in high school. And the next few Spider-Man movies, Spider-Man movies, Spider-Man movies are going to be, uh, you know, him still in high school, him very much still a kid figuring it out. And I like that. And I don't, yeah, I don't think they're going to get away from that for a long time. And he talked about that of like where we thought like relationships and stuff might go or what how they might play with other characters in the universe. And I was like, I don't think worry about that. I don't think that's the story they're trying",
            "start": 286.2
        },
        {
            "text": "like relationships and stuff might go or what how they might play with other characters in the universe. And I was like, I don't think worry about that. I don't think that's the story they're trying to tell you. No, and we'll get into this more when we start really dissecting in the Reacts. But I like, we should start stopping. Yeah, I don't, I don't want to go too far, too much farther in it. It's just like, you know what I mean, when you have that like throbbing erection and you just got to touch it. You don't want to, you're, you're in church, but you got to touch it. If I, if I touch it right now, it's either going to do one of two things. It's either going to explode or explode. You know what I mean? Greg, thank you for let me do this. I got to get ready for Kinda Funny Games Daily Andy show. But of course, Andy last night were like, Andy, do you want to go see Spider-Man: Homecoming? Your big Spider-Man fan. Andy's like, no, it's all right. I'm going to go play some PC games. And he like did his hair. Why are you",
            "start": 324.2
        },
        {
            "text": "Andy last night were like, Andy, do you want to go see Spider-Man: Homecoming? Your big Spider-Man fan. Andy's like, no, it's all right. I'm going to go play some PC games. And he like did his hair. Why are you coming in that way? He went to Watchy D. What? You're, there's so many cords over there. Spider-Man, bring a little closer to me. Radioactive blood. Wish it was in focus. It's not though. It will be if you bring it into the focal plane. Remember that there's a Spider-Man reference in Party Mode, the new Party Mode up for my your friends. Go watch that fantastic ****. Watch it for, it's muted. Oh, watch it for **** sake. There you are, ladies and gentlemen. That was our, uh, spoiler-free impressions of Spider-Man. We are going to have a full Reacts up probably later today. We're filming, I think, at 1:00 or 2:00 o'clock. So we'll have it up ASAP for you guys. I think we're filming at, no, I changed it. Oh, you did? I'm in a Jackman-off, man. I have to go work out at 5:00. I don't know if you know this or not, but I've",
            "start": 354.6
        },
        {
            "text": "2:00 o'clock. So we'll have it up ASAP for you guys. I think we're filming at, no, I changed it. Oh, you did? I'm in a Jackman-off, man. I have to go work out at 5:00. I don't know if you know this or not, but I've been sucked Fitness. Yeah, no, no, I'm going to the one in, uh, I'm meeting Youssef. He's my trainer now. Oh, you're right. You're right. So I got to go. You're going to get so big. I got to get jacked. I'm in, I got sucked into a Jackman-off. We're calling a Jackman-off 2017, 2018. Getting sucked off in a Jackman-off is sucked into a Jackman-off. Sucked off is something I do only on Friday nights when no one's looking. When you try to like, I'm, I'm working on my flexibility. Can I reach it? Can I? Did have the, the literal months of yoga have they paid off? Yeah, yeah, the months of yoga. It's, it's interesting to see the progress, you know. It is. It's really fun for me. Thanks for sending me those videos, by the way. It's really cool to see which, oh yeah, you progressing. Yeah, no, no, it's closer, closer, closer. Success. Um, so look",
            "start": 408.32
        },
        {
            "text": "you know. It is. It's really fun for me. Thanks for sending me those videos, by the way. It's really cool to see which, oh yeah, you progressing. Yeah, no, no, it's closer, closer, closer. Success. Um, so look for that spoiler for a right now. Uh, Andy saw Baby Driver last night. Now I was fortunate enough, me, Cool and Kevin were fortunate enough to see Baby Driver about a week and a half or two weeks ago, um, at the Alamo Drafthouse with Edgar Wright and Ansel. I for, I for in the room, not with us though. No, he was hanging out with me. I don't know if you saw him or not. But Edgar was like, was like going like, hey, check this pot out. He's not Australian. I like how you were like, he, check, check this pot out. No, again, you just did Australian again. I still did it. You just did the Australian again. Uh, so Andy, check this pot out. Let's go into it. What did you think of, uh, of Baby Driver? This, this, this will be spoiler-free as well. Keep it top level. So I wonder, we probably won't do a proper reaction for this, but give me",
            "start": 451.16
        },
        {
            "text": "pot out. Let's go into it. What did you think of, uh, of Baby Driver? This, this, this will be spoiler-free as well. Keep it top level. So I wonder, we probably won't do a proper reaction for this, but give me your impression. I'm wondering if I loved it as much as I did because I came in with, I mean, you said that it was a decent movie. I said it was the least edited film I've ever seen in my life. I do. I disagree with. Really? Okay. Whole, there's a case to be made for both. I just think everything about it was so **** masterfully done. Like it, it was a filmmaker's dream, dude. Like the pacing, the editing, uh, I think even, even some of the villains had really cool character arcs. Um, dude, I **** adored that goddamn movie, man. Like the, the music going along with all the cuts and it's like that, like the typical sort of Edgar Wright **** that we're used to seeing the way he prefers to cut out to cut his films like right zoom in on a doorbell **** like it's **** rules, dude. Lord, yeah, it did a lot. It",
            "start": 492.92
        },
        {
            "text": "sort of Edgar Wright **** that we're used to seeing the way he prefers to cut out to cut his films like right zoom in on a doorbell **** like it's **** rules, dude. Lord, yeah, it did a lot. It hit on a lot of levels for me. Um, I, I love Edgar Wright. I think this is an interesting, it's interesting to watch his evolution because this is not, uh, the Cornetto Trilogy, right? Right. This is not, uh, Simon Pegg. I was hoping to see Frost. Me too. I thought I was like, please let them be in this like just be a villain or something. This is the best way can describe Baby Driver as if Edgar Wright directed Heat. Yeah, if they gave Edgar Wright the Heat script or actually here's a better way to describe it. It's what I thought Drive was going to be before I saw Drive, which almost is one of the reasons why it actually made me want to go back and watch Drive again because Drive was so, Drive kind of had that for the first 10 minutes of the film and then went veered off all the way into the totally different lane and",
            "start": 539.2
        },
        {
            "text": "made me want to go back and watch Drive again because Drive was so, Drive kind of had that for the first 10 minutes of the film and then went veered off all the way into the totally different lane and I love both films, don't get me wrong. Like I thought they're both, you know, Drive is one of my favorite films. But this is what I thought it was going to be. It's a lot of awesome car action. Uh, it's very Edgar Wright-y. I think I felt so much tension through a lot of the action. Like there was so many parts where I was sitting there feeling like, oh my God, dude, like this is so **** good. And, uh, the way all the driving scenes were, were, uh, **** choreographed, it was just phenomenal. So good, man. So good. So much style, so much style, man. I love it. In the chat right now, CrownFive says Drive bored me right afterward. Uh, MasterExplorer says Drive is perfect. So you got to love that. You got to love Nicolas was amazing. Drive was great. But it is an arthouse film and it is very much very polarizing. I, it's Arthouse",
            "start": 582.16
        },
        {
            "text": "uh, MasterExplorer says Drive is perfect. So you got to love that. You got to love Nicolas was amazing. Drive was great. But it is an arthouse film and it is very much very polarizing. I, it's Arthouse light though. To me, this was ****, it's art, it's Arthouse **** dark. This reminded me of Grand Theft Auto, like Grand, playing Grand Theft Auto Online. One guy, a Wheelman. One guy, yeah, one guy, the people who enter the bank or whatever. And right, but with awesome editing and cool characters and really neat things about the different characters that I enjoyed. Like the main character, you know, why he listens to all the music is pretty cool. Uh, it was fun. And I think, I think it landed itself. I thought for at first I was like, this is going to be gimmicky and I don't like, like it, it was it because that's a thin line to skate for or to walk on when you're a filmmaker. You got a skate for, right? Uh, is this going to be gimmicky? Is it going to serve service the plot in the character development? And I think",
            "start": 622.52
        },
        {
            "text": "a thin line to skate for or to walk on when you're a filmmaker. You got a skate for, right? Uh, is this going to be gimmicky? Is it going to serve service the plot in the character development? And I think it did in a certain way. Uh, very much so. I don't want to spoil it why he, why he's like that. But, um, one of my favorite intro credit scenes of all time. Oh yeah, that was really cool. That was fun. Uh, just so well done. Like you have not seen Spider-Man: Homecoming yet though. So you should reserve that. Just oozes creativity, man. Like so well done. I love it. If you're a fan of Edgar Wright, of course, you're probably going to go see this movie. You should. It's really fun to see. You should see it anyway. Please, if you've never seen an Edgar Wright film, my favorite Edgar Wright film is probably Hot Fuzz. And then I would go Shaun of the Dead. And then, well, Shaun of the Dead and Scott Pilgrim are on like Scott Pilgrim for me. No, Shaun of the Dead, Shaun of the Dead and Hot Fuzz. Hot Fuzz is a genius movie because it is one long joke. Yeah.",
            "start": 663.2
        },
        {
            "text": "Shaun of the Dead. And then, well, Shaun of the Dead and Scott Pilgrim are on like Scott Pilgrim for me. No, Shaun of the Dead, Shaun of the Dead and Hot Fuzz. Hot Fuzz is a genius movie because it is one long joke. Yeah, yeah, at like, mother ****, this is genius to me. Uh, Hot Fuzz is sort of similar to how a lot of video games have like, they improve upon what they did in part one to make the sequel better. Not that this was a sequel, but you know, Shaun of the Dead was good and then it got, and then you could see sort of his, uh, I guess his process improve with Hot Fuzz. How fair? How was the third one of those? I didn't love it. The World's End. I mean, it's still, I still enjoy it, but it's definitely not, it's a lot darker. It's a lot more depressing. Like Shaun of the Dead has, Hot Fuzz is just like fun all the way through. It's farcical and silly. Uh, The World's End was, is that what it's called? Yeah, The World's End. Yeah. Um, was dark. It was very dark, but fun still. Uh, Andy, thank you for that spoiler-free impression. I guess Reacts of",
            "start": 704.2
        },
        {
            "text": "farcical and silly. Uh, The World's End was, is that what it's called? Yeah, The World's End. Yeah. Um, was dark. It was very dark, but fun still. Uh, Andy, thank you for that spoiler-free impression. I guess Reacts of Baby Driver. Everyone go see that. I think it's in theaters this now, right? You saw it last night in theaters. Yeah, out. Great. Saw it. If you didn't know, the Kinda Funny Morning Show is each and every day at 11:00 a.m. Pacific Time. Me or one of my fellow cohorts will join you and talk about pretty much whatever you want. Nerdy news, movies, what we're watching, um, comic books. Remember my saying, all right, so check it out. So I added, I added a little bit. What's the tagline for the show now, Andy? Where the pop culture news is popping and the cute boys are never stopping. Yeah, boy, cute boys. The Kinda Funny Morning Show. Uh, if you guys want, you can be a Twitch Prime subscriber here. You can join us live every day on Twitch. Uh, you can pay your money or if you're an Amazon Prime member, you can subscribe for",
            "start": 757.64
        },
        {
            "text": "Morning Show. Uh, if you guys want, you can be a Twitch Prime subscriber here. You can join us live every day on Twitch. Uh, you can pay your money or if you're an Amazon Prime member, you can subscribe for free. The World's End. The World's End. Thank you. World wasir the Caribbean. Yeah. Um, if you, uh, uh, what was I? Oh, Twitch Prime, right? If you're an Amazon Prime subscriber, you get one free Twitch Prime subscription. What do you get with that? You get fun Twitch emotes. You get to be sub subscriber only in chat mode with us the end of every show. It's super cool. Uh, we would like your Amazon Prime to go to us, but if not, please put it to someone. I recommend Alfredo or anyone else that's streaming because you got to take some of that money back from Amazon and stuff it into someone else. Do that for yourself. Uh, if you can't listen to this live, of course, you might be find this on YouTube. It posts every day and podcast services like iTunes, SoundCloud, um, MySpace, uh, Friendster, iHeartRadio, anywhere, um, Windows Media",
            "start": 802.48
        },
        {
            "text": "uh, if you can't listen to this live, of course, you might be find this on YouTube. It posts every day and podcast services like iTunes, SoundCloud, um, MySpace, uh, Friendster, iHeartRadio, anywhere, um, Windows Media Player. We're going to get you any which way we can. That's just the way it goes. Uh, Andy, let me, let me say this really quickly. Here's why I enjoyed the movie the most. Sure, give it to me. I go to the movie and Sean Pitz, our friend, bought me the ticket. And he was like, hey, to pay me back, just get me a meal, right? I was like, all right, cool. So he wanted a certain sandwich. So we all get our food. So I ordered wings and popcorn wings. Now the po, the wings were not very good, right? Did you go to Alamo? Wait, wait, what popcorn did you get? Did you get the Truffle Corn? No, I just got the standard. In my mind, I did not **** up 'cause I enjoy. You got to try that truffle. So, um, the popcorn was for everybody. Then nobody ate it. So I was just alone eating it. Greg had the same experience last night. He was",
            "start": 838.08
        },
        {
            "text": "my mind. I did not **** up 'cause I enjoy. You got to try that truffle. So, um, the popcorn was for everybody. Then nobody ate it. So I was just alone eating it. Greg had the same experience last night. He was like, hey, I got this big type of popcorn for you. And then he goes like this, did you wash your hands? And I'm like, I can't eat the popcorn anyway. Again, how many **** times do I have to Jackman-off 2017? So Sean gets his, his like sandwich thing that he gets or whatever the **** food arrives. There's a bite in the sandwich. You're kidding me. And he was like, someone took a bite out of this. If cool Greg got a bite in his sandwich, he would never eat that place again. He would even step in that **** place. Like someone's **** with me. The lady walks by and then, uh, Sean's like, hey, there's a bite out of my sandwich. She's like, oh my God, I'm so sorry. So then she comes back and she's like, you know what? I'm, I'm, I'm going to, I'm not even going to charge you for the sandwich. Don't worry about it. And she",
            "start": 884.96
        },
        {
            "text": "my sandwich. She's like, oh my God, I'm so sorry. So then she comes back and she's like, you know what? I'm, I'm, I'm going to, I'm not even going to charge you for the sandwich. Don't worry about it. And she was like, I'm going to comp you your wings too. And I was like, oh, cool. That's, thank you. I appreciate that. And she comes back, she's like, you know what? I'm comping everything. Don't even worry about it. That's nice. Yeah. So like, you know, I got a few sodas and I had the popcorn. So I paid zero last night. $6 Uber ride. Felt great though. Still Sean for the movie ticket. So yeah, great experience last night. Well, I'm glad. I'm glad I like the Alamo Drafthouse there. Uh, it's a fun different experience if you guys have never been to one before. It's cool. You get to serve food and stuff. I, I like it. It's more of a party. We were in the main theater. Awesome. Main theater's awesome. The one that we saw Ghost in the Shell, one that was a weird theater. I don't like that. The main theater is great. You get that real, real",
            "start": 929.08
        },
        {
            "text": "party. We were in the main theater. Awesome. Main theater's awesome. The one that we saw Ghost in the Shell, one that was a weird theater. I don't like that. The main theater is great. You get that real, real communal experience that you want. They need to up their wings game though. They need to set like an off, an off thing for the light. That light **** wants you hate that light. That doesn't bother me 'cause I get, yeah, I get claustrophobic in those theaters. So I like being able to see what the ****. It's so hard for me to like focus when there's a big glowing light near my crotch. I do like the fact though that everybody who was there, you know, are big fans of film and art, right? You walk in and it just oozes film nerd. And so like everyone there, you is just waiting to give you their opinion. And because they went to film school, I felt like we were watching a Star Wars movie type a Starbucks. As soon as there were certain sequences, they like, you know, woo, yeah, like people cheer and ****. It's like, all",
            "start": 972.8
        },
        {
            "text": "they went to film school. I felt like we were watching a Star Wars movie type a Starbucks. As soon as there were certain sequences, they like, you know, woo, yeah, like people cheer and ****. It's like, all right, this is cool, man. Well, it's definitely, there's a couple things from Baby Driver that I just want to note. One, it's definitely a movie that that makes you want to get up out of your seat and cheer. Two, Jon Hamm's hair is amazing. Everything about Jon Hamm. Jon Hamm in that movie. Yeah, if I, I thought we were going to get an opportunity to speak with the lead actor and Edgar Wright. If we had, the only question that I wanted to ask them was, would who had better hair, Jon Bernthal or Jon Hamm? They both had great hair because they both had great hair in it. Both great hair in it. Jon Bernthal might, might have the best hair in the industry right now. Am I saying his name right? Jon Bernthal. Yeah, yeah, the guy from The Walking Dead. Yeah. Oh yeah, both Punisher and The Walking Dead. Uh, he might have the best hair in the",
            "start": 1011.32
        },
        {
            "text": "have the best hair in the industry right now am I saying his name right Jon Bernthal yeah yeah the guy from Walking Dead yeah oh yeah both Punisher and Walking Dead uh he might have the best hair in the industry Jon Hamm though definitely the best penis put it on the we're going to put it on the poll who has better hair in the industry can we perfect can we get that uh yeah while we're doing that I'll just give you a couple other notes here let's get into the news a little bit of news real quick while we're here Spider-Man: Homecoming of course uh being reviewed right now very well it's got a 9 on Rotten Tomatoes as of the time that I copy and pasted that into this document in front of me um I'm sure everyone's excited about it but I can't wait to hear all your opinions on it uh when you actually get a chance to see the movie it's really cool um but something else dropped today okay H the Jumanji trailer dropped today Jumanji uh did you get a chance to watch this I did yes this morning",
            "start": 1053.92
        },
        {
            "text": "get a chance to see the movie it's really cool um but something else dropped today okay H the Jumanji trailer dropped today Jumanji uh did you get a chance to watch this I did yes this morning we're going to go through this but we're going to probably mute it because uh it's got Welcome to the Jungle so if you guys haven't seen this already please uh go back and watch it but this is the first first look at the Jumanji trailer right now Kevin let's watch it real quick uh so here we're seeing I don't I don't like they do this this 15-second quick cut yeah yeah what is that about it's because we as a society we all live in this place where we have no attention spans so they just want to get the messaging across so we're going to see like The Rock Jumanji there you go I see what you're saying uh so we're seeing the characters here which is I think this is like this is interesting they get detention or whatever they have to clean this room and they go in and they uh this I don't know who",
            "start": 1090.08
        },
        {
            "text": "uh so we're seeing the characters here which is I think this is like this is interesting they get detention or whatever they have to clean this room and they go in and they uh this I don't know who that person is I don't know who that person is I don't know who that person is I don't know who that person is um they have to go I don't know who that person is they have to go in and I guess they find this old video game system and they go in and they get sucked into this I think it's longer a board game no it's no longer a board game now it's a Super Nintendo or Famicom Famicom with solid looking Graphics look at that look at that menu I know like that's kind of Cris bro yeah they should have made it look a little shittier digitized also on a CRT so here's where this becomes uh what my what I want my life to be I would like to get sucked to do a video game and then look like this gentleman right here God I just want to run my fingers over those veins yeah so this is the this is the thrust",
            "start": 1132.76
        },
        {
            "text": "want my life to be I would like to get sucked to do a video game and then look like this gentleman right here God I just want to run my fingers over those veins yeah so this is the this is the thrust of the movie every the other veins down low you know saying oh my God I would take whatever python that man got in that pants beat it around a little bit Jesus just play like wrestle it you know wrestle like I don't stand a chance against you but maybe I do I'll take I'll take Mini Rock yeah or Big Rock um Pebble Pebble yeah that's what you call no no no it's it would be stick in pebble oh okay stick in Pebbles okay cool what what do you wrong I'm not going to get into that man whoever yeah she got the **** end of the stick on this no no offense to Jack Black but he doesn't look it's going to be character development guys she's the like H she going to grow to be she's going to be more accepting after yeah 100% exactly she's going to really understand the world after this so um he's",
            "start": 1173.16
        },
        {
            "text": "to be character development guys she's the like H she going to grow to be she's going to be more accepting after yeah 100% exactly she's going to really understand the world after this so um he's trying not to cry um what what's her name with the red hair from Doctor Who and she's also Nebula oh that's Nebula yeah oh yeah what's her name I forgot her name but she's gonna get a lot of mosquito bites with those short short he really is but I also like that The Rock gets another chance to **** with Kevin Hart did you see Central Intelligence I sure did not uh they have a great chemistry I love the trailer um but that's all I liked about it I'm also going to put on the poll Jon Bernthal Jon Hamm love it yeah please all the Johns all the most important Johns I don't like that your screen's black it makes me think you're using a cooler app than me I'm just using night mode man God **** get with it God oh **** you seeing this guys yeah he got he got eaten I mean I'm sure he",
            "start": 1212.36
        },
        {
            "text": "screen's black it makes me think you're using a cooler app than me I'm just using night mode man God **** get with it God oh **** you seeing this guys yeah he got he got eaten I mean I'm sure he has more lives small he's small oh he's still alive yeah it's a video game dude Jack Black doesn't he can't die in video games you can do whatever Kevin uh I'm excited yeah are you are you excited no okay but I will see this I like I liked the original Jumanji I really did um this is an interesting reimagining of it and of course it's got my boy The Rock in it I got to support him he's going to be president in 0 0 I mean I feel like this is a very it's going to be like this rock rock rock get the ice cream scops up there you go those R is this like we salute what's up K I'm no I was just saying this feels like it's like the reverse of the original like movie where it is 100% not Jumanji well no in Jumanji the kid likeu get sucked in the world he gets stuck there so like this is they're",
            "start": 1257.92
        },
        {
            "text": "this feels like it's like the reverse of the original like movie where it is 100% not Jumanji well no in Jumanji the kid likeu get sucked in the world he gets stuck there so like this is they're taking on avatars essentially instead of the coming to them they're going to the world I want one starring Larry David but Jumanji I don't I don't think you can make that joke really no why not I just think that uh he's actually Jewish though that's he's said Larry David Jewish yeah but no no I mean Andy's Jewish are you half Jewish I'm Jewish then you're fine uh you mind G Welcome to the Jungle when does it come out Kevin scroll to the end nobody knows actually nobody knows I'm sure it's at the end title card no no no this Christmas's this Christmas uh everyone it's it's going to be a very merry Rock Christmas look forward to that a maybe I'll see it but I watched this trailer this morning with my wife and she's like we're not seeing that at Christmas why not and I was like challenge accepted",
            "start": 1303.44
        },
        {
            "text": "Christmas look forward to that a maybe I'll see it but I watched this trailer this morning with my wife and she's like we're not seeing that at Christmas why not and I was like challenge accepted how else would you celebrate the birth of Jesus Christ Our Lord and Savior with The Rock with The Rock exactly the our other Lord and Savior no Andy you're Jewish now I'm Jewish oh Andy are you Jewish uh one of our prophets one of our prophets what else what else all right let's let's get out of this hole that we've all dug ourselves into for the first time I'm actually standing on the top of the hole watching you two dig yourselves into it it's liberating I love it dude we're getting really deep yeah no it's really weird it's like I'm not going to be the one that Tim pulls aside he's like you can't say **** like that you're super white stop it you're almost as white as cool Greg um like Nick you're two you're like twice her age you can't say that yeah no you can't if they're under 18 it's",
            "start": 1349.32
        },
        {
            "text": "say **** like that you're super white stop it you're almost as white as cool Greg um like Nick you're two you're like twice her age you can't say that yeah no you can't if they're under 18 it's yeah oh right I forgot it's state of California law I me it's just everywhere most places all states HC a eagle 3 says Andrew Cortez Stein oh yeah yeah cuz you are you're half you're half je cently isn't that great uh Andy before we get into the next story let's take a couple tips let's see if we have any tips here let's read some of them tips let's read those Hot Tips we have three tips right now we appreciate you very much remember if you'd like to give us a tip it's for the $5 or above we will read whatever you put into that description as long as it's not you know hate speech uh Gillis says I need a Joey Noelle butthole for the Kinda Funny song I'm making I also need a picture Kinda Funny Live 3 preferably of Bongos for the cover if the best friends have good picks please tweet at",
            "start": 1388.8
        },
        {
            "text": "I need a Joey Noelle butthole for the Kinda Funny song I'm making I also need a picture Kinda Funny Live 3 preferably of Bongos for the cover if the best friends have good picks please tweet at Gillis Lysol that's not easy l l i s l y s l l that is that if you have some awesome pictures of Kinda Funny Live 3 he's making an album please tweet them at him also you can go to dayswithbongo.com if you'd like how did you just find out about that didn't I just actually had it CED out for about 10 days and couldn't fit it in myot that was like months ago no no no but he reset it because you got Bongo to live 3 so now it's been 3 days I'm just letting you know I'm well aware I think it's been 5 but like who's car Bongos Bongos Bong and Kevin Sing Bong stop Bon stop was that a good joke was that a good joke put it up on a poll let's see if Andy deserves to be fired for that terrible terrible going way too hard on this we're not going way too hard on the poll people **** love poll",
            "start": 1441.84
        },
        {
            "text": "joke was that a good joke put it up on a poll let's see if Andy deserves to be fired for that terrible terrible going way too hard on this we're not going way too hard on the poll people **** love poll Kevin they like poles of all size like stripper poles they like poles that hold up those little awnings at Southern California schools we love those things okay so was it a good J. Bears was it a good joke yes or no yeah okay yeah put it up for approximately one minute what's the lowest amount of time you can put these BS one minute do do for you it's kind it's five minutes ISX up that's great here I'll put 8 minutes our next tip comes from unheard threat says minut how was Riker H how has Riker uh being the first one married in Taco Bell been not brought up love you guys I don't know has that happened yet uh no we brought it up when it happen did it happen did they actually do the the ceremony in Taco Bell they did yeah at at the really yeah they Vegas right yeah they already did everything",
            "start": 1487.36
        },
        {
            "text": "yet uh no we brought it up when it happen did it happen did they actually do the the ceremony in Taco Bell they did yeah at at the really yeah they Vegas right yeah they already did everything yeah oh **** I like one of the funniest tweets I saw was like wait so the **** guy who got married in Taco Bell personally knows the guy knows the white blinking guy in the GIF which is uh oh God from no from um from GameSpot what's his name the hell are you talking about the the the white blinking guy the guy that blinks from GameSpot yes you never that GIF is like Jeff Gerstmann no no no no no no look in chat look in chat look in the chat who who the hell is Andy talking about right you know who the **** I'm talking about um white guy blinks that's all you got to type in Giant Bomb Drew Drew yeah Drew Scanlon Drew Scanlon yeah that **** GIF of the white guy who blinks it was like super hot for a while that guy so that was from a from a Giant Bomb stream okay let me see he doesn't work for",
            "start": 1533.08
        },
        {
            "text": "Drew Scanlon Drew Scanlon yeah that **** GIF of the white guy who blinks it was like super hot for a while that guy so that was from a from a Giant Bomb stream okay let me see he doesn't work for GameSpot same different show show it to your camera they're all part of the CBSi family oh that guy CBSi really so that was from a Giant Bomb stream where they were playing they were doing a let's play and he made that face and that **** GIF blew up so some guy was like wait so the guy who got married in Taco Bell and the white blinking guy know each other like just like world colliding like Dan Ryckert's story about that like Dan Ryckert's stories by the way are **** amazing he is a fascinating human being fascinating human fascinating human being so much so that I almost want to read his book you should read his book this close what's his book called let's pimp his book out right now look at the cut title that",
            "start": 1581.8
        },
        {
            "text": "should read his book this close what's his book called let's pimp his book out right now look at the cut title that let's let's give him let give him point he has several books right does he I think he does everybody read his book also tweet at Dan Ryckert with some sweet nasty love tell him we're thinking about him I think he's on the East Coast now too cuz he's winning the poll tell me need's come back to the West Coast which is the best coast Central Time Central Time Spurs Scanlon first trying to get you up there get you sp West Coast West Coast time West Coast uh and our final tip for now uh comes from pistol sniper 65 says Hey guys turning 0 today so I decided to drop my birthday tax here keep up the great content thank you so much I thank hey happy birthday you're one year away from drinking alcohol he wrote this book called Air Force Gators I mean I hope so and Air Force Gator Too yeah the SC",
            "start": 1628.88
        },
        {
            "text": "great content thank you so much I thank hey happy birthday you're one year away from drinking alcohol he wrote this book called Air Force Gators I mean I hope so and Air Force Gator Too yeah the SC Justice I'm into it I mean I don't know why I haven't his books are The Dumbest Kid in the Gifted Class that's what it is Anxiety is an Ally is the one I knew yeah that's the one I've heard of but this one seemed a lot cooler for me for like what I was talking about about his life the D yeah The Dumbest Kid in the Gifted Class that's his like biography right yeah I'm going to throw that in the chat if anyone's interested please please do **** buy it and it's Z you have Kindle Unlimited go to Amazon you buy it you realize you have Amazon Prime you use that as one as your free Twitch Prime subscription with us to us you give it to us we take it we give it right to Cool Greg you like what you see you want to see us with our shirts off in six months cuz he's in the Jacked Man Off also am I no no I'm not",
            "start": 1668.68
        },
        {
            "text": "with us to us you give it to us we take it we give it right to Cool Greg you like what you see you want to see us with our shirts off in six months cuz he's in the Jacked Man Off also am I no no I'm not you can be if you'd like n you want to come get Jacked Man Off with me all right hold on let's update these polls really quick okay let's update the Jon winning by a lot okay natur I mean I think that's a lot of people are saying yes to the funny it's it's not even 5050 wasn't a and there's 6 minutes left so people we need you to go vote and hopefully remember what the joke was the was Bongos and then Kevin says Bon stop B that was really funny thank you Kevin that was great did you vote of course I you voted yes yes that was hilarious Andy I love who did we steal this from again uh Le Batard Show great okay cool just want to make sure they know we borrowed it we're going toly ripping them off directly we're going to give it back though weor oh are we we're just borrowing it for the day when",
            "start": 1712.48
        },
        {
            "text": "great okay cool just want to make sure they know we borrowed it we're going toly ripping them off directly we're going to give it back though weor oh are we we're just borrowing it for the day when are we going to give it back so I know I don't I you know I get anxiety I can't we're going to kill this joke in like no more than three days three days that's what you said about Bongos and it's been two years I I never said that of a Bongos I said Bongos I was like this is Tim thinks that here's the deal Tim uses reverse psychology on me and he goes like with the jacket off he's like I'll be surprised if that joke doesn't die by tomorrow three days in counting going to workout for my first time today did I start myself last night maybe maybe I just ate a hot dog like just aot hot dog it was really sad I ate a hot dog last night too because we were so hungry we couldn't get dinner before Spider-Man: Homecoming oh did you guys get dinner afterwards we got yeah we got Tommy's where were you I I",
            "start": 1757.8
        },
        {
            "text": "sad I ate a hot dog last night too because we were so hungry we couldn't get dinner before Spider-Man: Homecoming oh did you guys get dinner afterwards we got yeah we got Tommy's where were you I I wanted to go home so you guys were crossing the street to go to Tommy's right and then my car approaching you guys very quietly from behind and then I started flashing lights nobody noticed it's vaness was a I was 3 feet behind you guys were you really yeah in the Ranger Danger just 3 ft behind you guys you guys were right there I'm surprised that ever I'm surprised that Ranger Danger didn't explode on you um talk **** all you want but whose car has been in more trouble recently than the other person your car **** spent how much you spent on that **** Dam damn dog whoa I should have put my car down my car broke so badly last year that it was like it was it was like a dog that couldn't get like that couldn't use its hind legs anymore and it was just looking at me with his puppy eyes and",
            "start": 1798.36
        },
        {
            "text": "car down my car broke so badly last year that it was like it was it was like a dog that couldn't get like that couldn't use its hind legs anymore and it was just looking at me with his puppy eyes and it was like put a **** bullet in my head I was like no call chiropractor that burn what every other stupid ass dog owner does build you and spend thousands of dollars and make you like some sort of termin alive as long as possible it's it's member of the family you know member of the family I get that man member of the family you've seen you've seen Ranger Danger do we have any of the stories we have one more story I do we not have two we have two uh we have one more story we don't need to do the Game of Thrones story that's fine we'll take that it's a funny story but are we watch this or there is an official trailer for Death Note out now Andy you don't know Death Note right you haven't seen series Death seen I've seen it times like on Adult Swim while it's playing but it's always too spooky",
            "start": 1841.92
        },
        {
            "text": "is an official trailer for Death Note out now Andy you don't know Death Note right you haven't seen series Death seen I've seen it times like on Adult Swim while it's playing but it's always too spooky for me dude it's so good you got to watch it all the way through like I see the spooky face and I just I I'm scared that it's going to get me a night it I mean it might it might but it's worth it might get you it might get you uh I'm sure people in the chat are very very familiar with Death Note it is one of my favorite uh anime series ever I am very fascinated to see what they do with this movie because I like it I think Tim in his constant Tim way is always like I don't know man Oh I thought it was a series no it's just a oh so that's why Tim has that's why Tim has a problem with it and that's why I think it could be to its detri because I think six episodes would be amazing is it a series I'm pretty sure it's a movie no I I think he's excited that it's a movie is he I think I think I",
            "start": 1878.52
        },
        {
            "text": "why I think it could be to its detri because I think six episodes would be amazing is it a series I'm pretty sure it's a movie no I I think he's excited that it's a movie is he I think I think I thought we all agreed that it'd be better if it was a six episode series like hour piece say sh it does not look **** and stop being well we haven't seen the trailer can we watch this trailer let's watch it with the sound though let's let's take the chance on this one hey young Jesus all people that make life miserable make life dangerous that's a girl from The Leftovers and nice guys what we can change things he kind of looks like Max Landis a little bit yeah his name it's of the hair shall die no I don't my it shall we V in oh I like his voice oh I love that cover s yes what exactly can I do with this Death Note put your name down and see what happens it's not going to solve a few get like Spider-Man 1 Vibes it's going to solve all crimes well because it's homeboy you think that I'm crazy",
            "start": 1921.0
        },
        {
            "text": "this Death Note put your name down and see what happens it's not going to solve a few get like Spider-Man 1 Vibes it's going to solve all crimes well because it's homeboy you think that I'm crazy I know but it's like the exact same voice he used we could change the world the killer has taken credit for over 400 deaths I like that guy that's guy from although we do not know how he kills his victims we do know he's not some omnipotent Force oh **** is that L yeah a person like you or me you're the one who flew into the sun I'm just here to make sure you burn we're not the good guys anymore hope you know what you're doing I promise you you will not survive what they want I love that c so let's give it to them H here's what it reminds me of mhm if you told me right now didn't you just love this uh IGN and April Fool's joke I would have believe it it reminds me of a really really well done fan film really yeah no I mean again I don't know the series or the properties but like",
            "start": 1988.52
        },
        {
            "text": "just love this uh IGN and April Fool's joke I would have believe it it reminds me of a really really well done fan film really yeah no I mean again I don't know the series or the properties but like just the I guess the acting and the shots and it it's it gives me that weird vibe of whenever a cartoon is brought to life MH and it just looks kind of weird sometimes interesting cuz I've seen I mean I know I've seen the characters in in the anime right um but uh yeah it looks like a really really well done fan thing that you would see on YouTube and it would go viral for a few days man Barry Bumfrey really really hating on this so this looks awful honestly he's got to be British right is he British yeah bumo come on bumy yeah I don't know bar are you British put it up on the pool is very British it's very British you see what I'm talking about two days max no it's so good I love it I know but you're going to the Dan Le Batard Show he's not going to be pissed off that we stole it right Danny",
            "start": 2069.32
        },
        {
            "text": "it's very British you see what I'm talking about two days max no it's so good I love it I know but you're going to the Dan Le Batard Show he's not going to be pissed off that we stole it right Danny pH what's his name uh Dan Le Batard it's not going to be better all right guys that's it for the news right now I'm excited for this I'm sure it'll be very polarizing uh remember don't **** up like Andy and not watch the original series before you go see this movie do not do that to yourself go watch the original series first it's amazing Playgrounds Game says this is going to be like Dragon Ball Evolution no I hope not I really hope if anything this is going to get more people to watch the original anime I like that I I still I think it brings awareness to it I think it's a very good point like every time people think oh this is terrible it's ruining the original it's not it's just going to get people to watch that one and get more attention on it it's great More Death Note",
            "start": 2116.52
        },
        {
            "text": "good point like every time people think oh this is terrible it's ruining the original it's not it's just going to get people to watch that one and get more attention on it it's great More Death Note is always good oh people are talking about the Chucky trailer yeah uh you know what I haven't watched yet guys I'm out of the loop when it comes to Chucky movies I don't know how many of they've made at this point give a **** but there's a new Chucky movie what's up poll update it's not looking good guys final results final results results Andy the joke wasn't funny **** 49% said yes 50 it was very close though Andy but in on Twitter polls that % margin it might as be the **** world it might 459 people man I mean doing the math quickly I mean that's like f nine people I mean I just got to come back stronger tomorrow because I'll be on the show tomorrow as well you are you're going to be on the show tomorrow I believe in you look it if I if I've learned one thing from doing jokes in",
            "start": 2166.2
        },
        {
            "text": "to come back stronger tomorrow because I'll be on the show tomorrow as well you are you're going to be on the show tomorrow I believe in you look it if I if I've learned one thing from doing jokes in front of people it's that sometimes they don't hit but you just got to keep you got to retool you got to come back you got take your shirt off and just to be clear take your shirt off yeah Jon Hamm has the best hair okay I mean that's wow by far but it's not even close wow Jon Lovitz and Jon Bernthal All Tied tied though I mean I don't know if that says more about Jon Lovitz or less about Jon Bernthal I think it say a lot less about Jon Bernthal God bless Jon Lovitz alumni of UC Irvine if I'm not mistaken could be mistaken I might have just made that up I I did go there oh you did go there okay Andy now is the time on Sprockets FV Dance uh we are entering into the segment I like to call PS I Love This Best Friend XOXO with all my heart uh remember if you exactly what it's called there I don't",
            "start": 2205.44
        },
        {
            "text": "now is the time on Sprockets FV Dance uh we are entering into the segment I like to call PS I Love This Best Friend XOXO with all my heart uh remember if you exactly what it's called there I don't know who I don't know what everyone else calls it but I call it PS I Love This Best Friend XOXO this segment is designed to call out one member of our community that is doing awesome remember if you want to nominate someone uh who is awesome or who's doing a great job or just a **** stand-up human being you can go to KindaFunny.com/bestfriend and and do it there and we'll give that person a shout out on the Morning Show we give one shout out every day today his nominator is Adam Daniels he is nominated Stanley Yang is that how you say that young young young probably yeah young says I couldn't make it to Kinda Funny Live 3 but I really wanted Andy's Mech shirt so he bought and mailed it to me because I was unable to make it he is awesome **** good for you guys uh maybe next time you go to",
            "start": 2242.52
        },
        {
            "text": "it to Kinda Funny Live 3 but I really wanted Andy's Mech shirt so he bought and mailed it to me because I was unable to make it he is awesome **** good for you guys uh maybe next time you go to Kinda Funny Live 3 you can buy me one cuz I have yet to **** get one of those shirts really I have never I always forget and I never get the the exclusive shirt at Kinda Funny Live 3 and then I see people wearing it I'm like I'm so **** jelly but maybe we're getting a version like it soon nobody knows though nobody knows everybody maybe you should also just buy it to like to test the machines cuz that's what I've done every year so I own one of the Kinda Funny Live you just you stole one Kevin no when they came you grabbed it and you were like Nick I'm stealing this you literally said Nick I'm stealing this and I said no don't we have to pay the bills the light will go off and you went like this sucker no don't and then the lights went off he's like late I'm joking around I'm **** with you but",
            "start": 2287.08
        },
        {
            "text": "this and I said no don't we have to pay the bills the light will go off and you went like this sucker no don't and then the lights went off he's like late I'm joking around I'm **** with you but yeah no I stole a whole bunch of shirts good you should Kevin do you know what time it is right now it's giveaway time oh run the graphic roll the graphic have a Graphic roll the graphic giveway giveway how you're asking yourself do you get entered into the giveaway so that you can get a cool game in the giveway every day do you know how yeah cuz there's four ways four ways one you can just be in the Twitch chat right now if you're watching this live you are entered to win one of the two giveaways we're going to do today we're going to do two games today two oh two two you can be a Twitch Prime subscriber how do you get that of course I beat this into your **** head 80 times and you still haven't gotten it you can uh you can give your harder money to us or if you're an Amazon Prime",
            "start": 2327.2
        },
        {
            "text": "Prime subscriber how do you get that of course I beat this into your **** head 80 times and you still haven't gotten it you can uh you can give your harder money to us or if you're an Amazon Prime subscriber you get one free Twitch Prime subscription you got to renew it every month it's super stupid if you haven't done it this month I'm sorry but you got to do it again we'll pull from that or you can be a supporter on either our Patreon or Patreon uh Kinda Funny Games Patreon at the $ above level the $1 um I don't know go to those sites you can tell us and you are also entered to win today's first winner is going to win Severed on the something called the Vita is that how you say that yeah it's short for Vita the Vita artist from the 90s the randomizer has picked from a Twitch sub in the chat or no Twitch sub excuse me uh who is G Kim 86 G Kim 86 g e k i m 86 congrat you have won Severed now of course this giveaway is brought to you by World of Tanks World of Tanks is an epic team",
            "start": 2372.96
        },
        {
            "text": "chat or no Twitch sub excuse me uh who is G Kim 86 G Kim 86 g e k i m 86 congrat you have won Severed now of course this giveaway is brought to you by World of Tanks World of Tanks is an epic team based massive we playing this first we have to play this thing this what's going on there it is right there there it is World of Tanks is an epic uh Team based massively multiplayer online console game dedicated to tank combat it's available on PlayStation 4 PlayStation 4 Pro Xbox 360 Xbox One Xbox One S and coming soon to Microsoft's new system system the Xbox One X X going to give it to you uh command history's most powerful tanks and experience tactical combat like never before in the World of Tanks Console you can battle up to 30 other players in over 450 historically accurate World War II armored vehicles from the 1930s to 1950s can I read this next lineer like DMX Go For It World of Tanks Console AAA game that's free to play that's right World of Tanks Console is a AAA game",
            "start": 2417.48
        },
        {
            "text": "II armored vehicles from the 1930s to 1950s can I read this next lineer like DMX Go For It World of Tanks Console AAA game that's free to play that's right World of Tanks Console is a AAA game that's free to play World of Tanks Console was built from the ground up for consoles taking full advantage of both the PlayStation and the Xbox unique capabilities regular updates features featuring exclusive new content special events sneak sorry special events and sneak surprises you'll never want to leave your console again never leave it supports HDR and 4K Graphics you know Tim likes those 4K Graphics he has a 4K TV that's bigger than his freaking house he had to like we had to remove a wall to get it in like that um for the Kinda Funny Morning Show listeners World of Tanks Console has a special offer for the new players who sign up this month go to wg.am/funnytank that's wg.am/funnytank and grab your free tank G garage slot in 3 days of Premium game time while this lasts the",
            "start": 2466.64
        },
        {
            "text": "has a special offer for the new players who sign up this month go to wg.am/funnytank that's wg.am/funnytank and grab your free tank G garage slot in 3 days of Premium game time while this lasts the number of registration codes is limited so if you are at all interested in World of Tanks if you want to get some tank on tank action go to that URL right there get yourself some and tank on tank action we got two ad reads so guess what you get two games two games today two games I'm not going to give the Spiel the Glock and Spiel on how you can be entered to win you guys heard that or already today's next game that we're giving away is Friday the 13th on PS4 oh okay before we get to that winner this segment is brought to you by VRV what if I read this you want to read this yeah I would love you want to do an ad read for once love pull your weight at this company VRV (VRV) is pronounced Verve made by the team over at Crunchyroll is home to your favorite channels",
            "start": 2507.16
        },
        {
            "text": "this yeah I would love you want to do an ad read for once love pull your weight at this company VRV (VRV) is pronounced Verve made by the team over at Crunchyroll is home to your favorite channels that gives us all a chance to discover more content from creators we all know love and support their newest Creations you can check out Crunchyroll and they have Attack on Titan Season My Hero Academia Season which is subbed on Funimation we have Attack on Titan Season uh and My Hero Academia Season which is dubbed both see that's where the English people talk over the original Japanese but and the mouths are almost perfect almost perfect almost perfect um Rooster Teeth uh check out RWBY, ScrewAttack, Game Attack uh RT Shorts always open used to work there I know a lot of people there Nicholas you do I still know they're now to you so so check out uh they're dead to me yeah oh okay no you're dead to them oh I'm dead to",
            "start": 2560.84
        },
        {
            "text": "always open used to work there I know a lot of people there Nicholas you do I still know they're now to you so so check out uh they're dead to me yeah oh okay no you're dead to them oh I'm dead to them okay so check out VRV on desktop mobile Roku PlayStation or Xbox where you can watch all your favorite anime subbed or dubbed with Crunchyroll and Funimation in addition to Cartoon Hangover's Bravest Warriors Rooster Teeth's RWBY, Seeso's My Brother, My Brother and Me which I love by the way uh just go to www.vrv.co/kindafunny that's vrv.co/kindafunny and click the link in the description to get seven free days of VRV Combo Pack to watch the best channels in VRV ad-free in HD which is 1080p Nicholas right that's when it's 1920 across 1080 down and there's a p in there somewhere there's a p for Progressive a p in there somewhere it just says VRV Watch Along afterward I'm not sure why that I'm not sure what that is I think you all are doing a VRV Watch Along soon maybe I think next",
            "start": 2603.68
        },
        {
            "text": "a p for Progressive a p in there somewhere it just says VRV Watch Along afterward I'm not sure why that I'm not sure what that is I think you all are doing a VRV Watch Along soon maybe I think next week maybe next week look out for no we're no we're gone next week the week afterward I mean you guys you guys we have a couple watch songs already online right now you can watch them Attack on Titan uh Season I think we did episodes 1 through three you can check those out right now we'll be doing more a lot more in the future cuz we love doing that and it gives me an excuse to literally at work Watch Attack on Titan so that's not bad that's not bad today's next giveaway winner is we're going to figure it out now C++ Patrick Mitchell who comes from our Kinda Funny Patreon Games supporter thank you so much Patrick you have won the PS4 code thank you Patrick Friday the 13th which is Greg's newest Obsession we appreciate that because he's in his element he's a **** psychopath and he",
            "start": 2650.84
        },
        {
            "text": "thank you so much Patrick you have won the PS4 code thank you Patrick Friday the 13th which is Greg's newest Obsession we appreciate that because he's in his element he's a **** psychopath and he gets to play as a psychopath we Shannon 'Double D' Doherty oh Jesus **** his name is Shannon Shannon Double D what's up how you doing it's it's it's Mike Doherty I know I just for whatever reason I just thought his name was Shawn so I I called him Shawn for the first three hours of Kinda Funny Live and he's like Nick my name's Mike did you know that and I'm like no you're Shawn to me forever now look at you you beautiful son of **** actually no I'm sorry don't come over here we're we're running really long we're super late I apologize Greg I'm sorry I'm sorry Greg everybody we're going to do the column where we already three and three right now queue up your questions comments concerns or just praise for Andy's hair and we will answer those we'll go into sub only mode and then I'll read the",
            "start": 2692.36
        },
        {
            "text": "the column where we already three and three right now queue up your questions comments concerns or just praise for Andy's hair and we will answer those we'll go into sub only mode and then I'll read the subscriptions into your **** ear Nick it's K Mama says Richard W3 man we ran really late I feel bad we did um Cowboy Bebop uh right is owned by Funimation I love Cowboy Bebop my favorite anime that's one of the first animes I watched and and nothing has uh Cowboy Bebop is **** awesome and one day they're going to make I think they're is that movie in development yet sure it is it's been development for like 10 years Halo movie will Kinda Funny Live 3 be put up on YouTube says I ruins food hopefully we'll see we will have no plans as of yet for right now but uh it was a great show we'd love to get that out in front Andy's hair is unkempt today no praise needed what you're right get out of here Andy Andy look at the camera look at the camera really quick Bros Aid you're out of focus why you so don't",
            "start": 2732.36
        },
        {
            "text": "out in front Andy's hair is unkempt today no praise needed what you're right get out of here Andy Andy look at the camera look at the camera really quick Bros Aid you're out of focus why you so don't sit so far there it is there it is your hair looks great I love it kid those cheeks uh uh uh uh uh uh respect Cowboy Bebop yep Cowboy Bebop is getting a TV show made Nick well I mean they always say that and can I get a Metal Gear volumetric fog hey guys what I miss and we think you're really that's a lot of stuff you're requesting **** what are we your **** just give it to Monkey sit back a little bit what **** thing Metal Gear no wait all right guys all right there you Nick Scarpino never heard of him huh it's always like they they name something that you never heard of like oh the Patriots like the Patriots huh no say volumetric fog volumetric fog never heard of what's that about that's no what was the next one what was the next one I don't know he asked for other stuff it's gone all",
            "start": 2778.04
        },
        {
            "text": "like the Patriots huh no say volumetric fog volumetric fog never heard of what's that about that's no what was the next one what was the next one I don't know he asked for other stuff it's gone all right we're going into sub only mode right now I'll put us in there Nick can I get a Morph Morph Why did you have to do that that's what he does in the show oh gotta buddy now Jon Risinger said he was op in the cartoon I don't remember that was was Morph indeed like very overpowered when he comes back after Sinister it's **** up yeah when Sinister **** him but he was I mean he can morph into whatever he wants Nick do you think The Rock should Bongo Kevin oh uh I would allow that yes 100% Barry Buoy says Nick at Altano Diet Special so yes we have a bunch of one-off exclusive episodes recorded that I believe we're going to put out next week Altano's should be one of them Kevin I mean need to talk to you about this we need to put those out next week I think Greg did a bump for I already talked I",
            "start": 2828.36
        },
        {
            "text": "that I believe we're going to put out next week Altano's should be one of them Kevin I mean need to talk to you about this we need to put those out next week I think Greg did a bump for I already talked to a bunch of people this is all planned out don't about it next week those are going to be hitting remember we kind of rolled Patreon a little bit so those kind of got lost in the fog but the Altano Diet Special that I did with them is coming out next week it's going to be **** awesome I believe Greg also did an a great interview with Anna Sale from the podcast uh Death, Sex & Money that's it Death, Sex & Money she was an awesome human being so that's going to be equally good if not just the sco better sco podcast oh last question by until he has Andy thoughts on the Chris Paul trade wanted Chris Paul to come to Spurs he's going to the Rockets uh the Rockets they they trade a lot of people for Chris Paul they traded uh a really important defender in Patrick Beverley not a smart",
            "start": 2871.84
        },
        {
            "text": "wanted Chris Paul to come to Spurs he's going to the Rockets uh the Rockets they they trade a lot of people for Chris Paul they traded uh a really important defender in Patrick Beverley not a smart move but they're getting a really really good point guard they already had a really good point guard there's only one ball in the game you can't share it all around so that's what I think about it mystery uh no that's not right the Filipino Mamba has our last question says Nick are you going to give details on your next standup show I'm down to come through and support uh Yes actually I've I just got booked another one this Friday so if people would like to come I'll put that out on my social media it's going to be at Milk Bar starting at 7:30 that's Milk Bar which I believe is on Haight Street starting at 7:30 it's not up did you it's a great I haven't been there it's my first time before we in that venue so we'll see what happens uh it's a good lineup of open micers again this is an SF",
            "start": 2908.08
        },
        {
            "text": "starting at 7:30 it's not up did you it's a great I haven't been there it's my first time before we in that venue so we'll see what happens uh it's a good lineup of open micers again this is an SF showcase for people who are just starting out so uh if you guys would like to come by and support 7:30 Milk Bar again I'll put it out on social media so you guys can see um if you get to the front door tell them Nick sent you and I don't know I'm supposed to get something from that or whatever wait really yeah yeah they like to know who's bringing in who yeah so they can uh you know play favorites next time I get booked on something so SP wants to know how I can say Taco Deli is better than Torchy's because I only speak in facts Taco Deli is better than Torchy's **** got him ladies and gentlemen we love you so much thank you very much for being with us today uh on this fine fine Thursday with all these trailers all this great news all the Spider-Man action Andy thank you for joining me thank you",
            "start": 2944.44
        },
        {
            "text": "you so much thank you very much for being with us today uh on this fine fine Thursday with all these trailers all this great news all the Spider-Man action Andy thank you for joining me thank you Nick you will be back tomorrow I can't remember if I'm on the show or not I'll probably stop by is it me and you again the **** Power Hour the Power Hour hour Andy's coming to the 1st anyway we'll be back tomorrow morning 11:00 a.m. Pacific Standard Time West Coast Best Coast we'll see you guys stick around though I'm going to be reading subscribers right now into your ear while we set up for the Kinda Funny Games Daily Show which is happening eminently love you all thanks for tuning in",
            "start": 2980.4
        }
    ]
}