{
    "id": 2680,
    "video_id": "8T9QGyQJjUQ",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How Do You Pee? - The GameOverGreggy Show Ep. 182 (Pt. 4)",
    "description": "It's Greg's question. We're sorry.\n\nThanks to Pro Flowers for sponsoring this episode. Go to http://www.proflowers.com and use promo code greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1496300401,
    "duration": 1001,
    "transcript_chunks": [
        {
            "text": "What's up, Patreon supporter Patrick Higgins, and everyone else watching this? This episode of The GameOverGreggy Show is brought to you by ProFlowers. I've kept it pretty quiet, but did you know that I recently got married? And you know what my wife loves? Flowers. Now, will your significant other like flowers? I don't know. I don't believe in gender stereotypes, but I do know the old saying, it's the thought that counts. So count on ProFlowers. You can get $10 off your purchase of $29 or more over at ProFlowers, ProFlowers is what I keep trying to say. And that includes the 100 Blooms Bouquet, a dozen red roses, and their plant gifts. And plants make me think of Poison Ivy from Batman, and that's pretty cool. Not the Poison Ivy from Batman & Robin, that one sucks. So show someone you're thinking of them and Save a buck doing it. Go to ProFlowers.com and enter the code Greggy at checkout. That's ProFlowers.com with the code Greggy. ProFlowers, what else are you going to send them, a shoe? I can use that tagline for",
            "start": 0.24
        },
        {
            "text": "Save a buck doing it. Go to ProFlowers.com and enter the code Greggy at checkout. That's ProFlowers.com with the code Greggy. ProFlowers, what else are you going to send them, a shoe? I can use that tagline for everything, right? Thank you, Andy. What's your topic? Oh, I thought you had a topic. No, we're skipping as to go to yours. Oh, okay. Um, I guess, okay, do you not want to do your topic? I mean, if you have a better one now, I really want to know what your topic is. So Danny, you get to pick. I get to pick. So what we have, I'm going to tell you what they are. Oh, Andy wanted to talk about bubble gum. Okay, I had the topic of strong start bubblegum for Andy, or mine's in either or one. Okay, so, so you have three pick. I mean, you got two chances to pee bubble gum. I'm not sure. Do it. All right, how do you pee or terrorism? Wow, one of these things is not like, yeah, one of these is not like the normal GameOverGreggy Show. Any, be honest, I got bubblegum here. Yeah, I got, hey, need, hey, pee, hey, pee is, yeah, I don't know, maybe",
            "start": 41.4
        },
        {
            "text": "terrorism. Wow, one of these things is not like, yeah, one of these is not like the normal GameOverGreggy Show. Any, be honest, I got bubblegum here. Yeah, I got, hey, need, hey, pee, hey, pee is, yeah, I don't know, maybe, maybe two serious topics is a bit. We've, we had a pretty serious topic. Want to end on a lighthearted note? Like you want Bubble Gum is one of the most underrated bubble gums of all time. How you pee? How you pee? All right, this is my topic. Thank you for siding with me on this. What I'd like to talk about today, gentlemen, is how do you pee? Now, with my penis, exactly. Right, here's the thing I've noticed. How do you pee on, on this show that I do once in a while, Super Knock and Boots? Yes, we get into interesting territory all the time because we have a bunch of weirdos on that show. Yeah, you do. Damon and Ty are part of the Dicks Up Club. Yeah, which means that in their underwear, they like their penis to be up. That's weird, right? Or are you a Dicks Up person? No, okay, no Dicks Up. Kevin, are you Dicks Up? That's not a",
            "start": 112.32
        },
        {
            "text": "of the Dicks Up Club. Yeah, which means that in their underwear, they like their penis to be up. That's weird, right? Or are you a Dicks Up person? No, okay, no Dicks Up. Kevin, are you Dicks Up? That's not a thing. It is a, they say it's a thing. You'd be surprised the amount of people who write in saying it is a thing and they do. I do that if I have like a surprise boner, of course, tuck in the waist, tuck in the waistband. But are they wearing like boxer briefs? How would you even, yeah, you put it up there and then over time it comes down. But no, you can do it with briefs. It could be done. Oh, yeah, briefs, I imagine. I think loose boxers is where it would get, yeah, it's just, I don't play that game. Okay, no, no, okay, I don't **** around. So now that, of course, I'm with you, I'm with the majority of normal human being, like that's a weird thing, Ty, why would anyone do that? Uh, but then it's come up before of peeing, and this is just something that recently has come to my attention because they called me out for how I",
            "start": 164.96
        },
        {
            "text": "like that's a weird thing, Ty, why would anyone do that? Uh, but then it's come up before of peeing, and this is just something that recently has come to my attention because they called me out for how I peed being weird. So then I started doing it, maybe I think their way, but I don't even know if I'm doing it right. I know it was more than one way. So I wear boxer briefs for MeUndies. Okay, the softest **** underwear, and they don't, they've never sponsored us. The softest underwear in the world. I love these **** things so much. I pay a premium, of course, you can. Now, I'm very hot. Hold on. Okay, so they are going to be even wet. Oh, do you need to do that? Okay, all right, I'm switching over here. I'm very good. Those are soft, right? Those are really soft. Oh, Lord, wow, interesting. It's like Under Armour. I've touched it before. Those are really soft. Stretchiness to, but they're not silky like they don't have like, they feel, I'm not trying to impress anybody, but this is, you know, super soft. What are you",
            "start": 204.12
        },
        {
            "text": "I've touched it before. Those are really soft. Stretchiness to, but they're not silky like they don't have like, they feel, I'm not trying to impress anybody, but this is, you know, super soft. What are you wearing over there? Like, like they're soft, but they're not that soft. Too much cotton. B. Oh, no, this Andy, Andy's wearing like the flannel pajama boxers. American Eagle. No, can't do that. Can't download that. Now, the thing about these underwear is that there is no dick hole. There's no dick hole there. So what I, and this was a new one, 'cause I've worn other boxer briefs that have the dick hole, you know what I mean? Like that's there. And actually, I guess I was wearing MeUndies to pee when you, I was wearing MeUndies before this. No dick hole, no hole for the dick. I suddenly understand the question. Right. And so I think it was Damon one time, we're talking and telling the story about peeing for some way or another, and he, I mentioned that there was no dick hole on these, and he's like, well, how do you pee? How do you pee out of",
            "start": 241.72
        },
        {
            "text": "Damon one time, we're talking and telling the story about peeing for some way or another, and he, I mentioned that there was no dick hole on these, and he's like, well, how do you pee? How do you pee out of them then? And I said what I thought was the reasonable answer. I grabbed the leg hole. I grabbed the leg hole and pull it up. You monster. I thought it made sense. I thought it made sense. You saying the end of your dick is closer to the end of your shorts? No, it's not. I'm not trying to, this isn't like some Big Johnson T-shirt. No, I, I went, I went through a stage around the second grade where I did that, and then I stopped for the rest of my life. Well, we went to school with a kid, I remember like in second grade or whatever, and like he went in there and he just dropped this. There's always the Drop Kid. Actually, I was the Drop Kid for a little while in the big trough. Huh? The big, yeah, I was the Dr Elementary. We all peed in the big trough, wall-based. We didn't, we didn't have the big trough. We didn't have the",
            "start": 286.32
        },
        {
            "text": "I was the Drop Kid for a little while in the big trough. Huh? The big, yeah, I was the Dr Elementary. We all peed in the big trough, wall-based. We didn't, we didn't have the big trough. We didn't have the big trough. My school had had dedicated urinals, but I was the Drop Kid for a little while. In Europe, that's like most still most public to. Okay, then, then time passed and it was okay. Uh, then I was like, that's a bad idea. But then I tried the leg thing for a while, uh, because I thought it was novel. Were you wearing, it is novel. Are you, what are you wearing? Briefs? Oh, yeah, yeah, I was wearing briefs. I'm a, I, I was boxers for a long, long time, and then I went boxers. No, I'm a, I'm a briefs man. And, uh, so I definitely experimented with that early in life, but I came back around. Well, see, briefs always had the dick hole, so it was fine to get in and out of. I thought. See, and then so, is that still your solution? Is that what you do? Well, now, now that it's been called into question lately, I've been doing, all right, fine.",
            "start": 333.48
        },
        {
            "text": "hole, so it was fine to get in and out of. I thought. See, and then so, is that still your solution? Is that what you do? Well, now, now that it's been called into question lately, I've been doing, all right, fine. I'll pull the waistband down. I'll go over him like this. But then I'm getting the thing where I'm guillotine-ing the balls and the dick, and like it's done a few things where I'm on the phone. I'm doing it. It's, I'm not peeing on myself. Well, I'm on the phone. I'm doing it. Of course, I'm a busy man. I'm making business deals left and right. You think I'm hiring kids from Austin without being on the phone? Never, ever, ever. Okay, for so many reasons. It really looks like you're taking a picture of your **** when you do that. Yeah, and you might be. I mean, that's, that's, that's the, that's the undisclosed. Now, here's the thing. The thumbnail for this video in a public restroom, when I've had a few at a bar, and I'm in there peeing through whatever hole, doesn't matter the situation, but, but I'm on the phone and",
            "start": 370.96
        },
        {
            "text": "here's the thing, the thumbnail for this video in a public restroom, when I've had a few at a bar, and I'm in there peeing through whatever hole, doesn't matter the situation, but, but I'm on the phone and someone walks in and sidles up to the urinal next to me. I'll let you know. I ask them if they mind. You ask them if you mind? No. And then, and then you hear nothing coming from. I've done it so many times in strangers where I'll be on my phone peeing and somebody walk in. I'm like, so where do you come down? And using a phone at a urinal and a lot, slip back in my pocket. What? Have you ever had your phone tossed in the urinal by? Oh, no, no, I dropped it in the urinal once. All right, if I want to, why you keep doing it then? That was your, that was, I mean, like, why do people fall? Why when your, when your parachute fails in skydiving, why do you keep skydiving? You're talking about the lights going off when you're walking home at night. That's God telling you to stop using your phone on the goddamn urinal. Yeah, it's not okay.",
            "start": 411.44
        },
        {
            "text": "in skydiving, why do you keep skydiving? You're talking about the lights going off when you're walking home at night. That's God telling you to stop using your phone on the goddamn urinal. Yeah, it's not okay. No, if I was walking into a bathroom and a stranger said to me, do you mind if I use my phone? I would take their phone and drop it in the urinal and just walk away. That's, that's what's going to happen. I was way too drunk after the Dice Awards. That's what happened. I once drunk placed my phone into a pint glass while drunk and then went, wait, no, that's not my pocket. Rice bag. The phone worked. Oh, rice. So I always used to do the waistband down thing, right? Which feels a bit weird too. It, yeah, well, I like that's just how I was my whole life, right? And then for some reason, I was listen, I don't know what podcast I was listening to, and they're like, no, Kevin's gonna, oh, Kevin's just going to leave her smoke. No, no, no, no one tweet Paula. Uh, and then I was like, oh, the hole in, yeah, the dick hole. Yeah, the dick",
            "start": 455.44
        },
        {
            "text": "I was listening to, and they're like, no, Kevin's gonna, oh, Kevin's just going to leave her smoke. No, no, no, no one tweet Paula. Uh, and then I was like, oh, the hole in, yeah, the dick hole. Yeah, the dick hole. Like, no dick hole there. You can't do anything about it. Should I use the dick hole? Yeah, and, and I use the dick hole, and I've never turned back. Once you go dick hole, you never go back. Hole back hole, bro hole. I like dick hole where it's like flap over flap like this. Yeah, Kevin, speaking into the microphone, they can't hear you. They can't hear you. Kevin's talking, Kevin's talking about when you have the dick. Yeah, it's like a cigar cutter when you use that. But it's the same way of like, I feel like it's, there's more tension in the waistband move of the pop. I've had, I've had the cigar cutter accident though, man. The other hand's holding your junk, but my other hand is using my phone. Stop. Your problem is your phone. Yeah, I think the phone is the problem in the, but ever since then, I've been using the dick hole.",
            "start": 497.44
        },
        {
            "text": "the other hand's holding your junk, but my other hand is using my phone. Stop. Your problem is your phone. Yeah, I think the phone is the problem in the, but ever since then, I've been using the dick hole. I've been exclusive dick hole. Naughty Dog, PlayStation, like exclusive, you know, first party. Sure. Yeah, dick hole. That's a great game. Follow up to Knob Switch: Dick Hole. Now, I've, I've gone back and forth, uh, between, yeah, between the flap and, and the tuck. Uh, and it's really a mood thing. It's kind of like it, it's actually kind of tactile. It's just like, hey, you know, right now this feels good. And switch. Poo. Here's my next question. Everybody stands when they pee? Oh, yeah, totally. Yeah, watch. It was one of those, I, and I, I think it might still, I'll call Nick right now. Hold on. All right, Nick and Tim at the old studio, which was colonized house, would sit to pee 'cause they felt like it was poo. Oh, I sit to pee a lot. Really? I sit to pee a lot. Oh, do you to exclusively pee? Yes, to, to with zero poo poo. Wow, really? I",
            "start": 542.64
        },
        {
            "text": "studio, which was colonized house, would sit to pee 'cause they felt like it was poo. Oh, I sit to pee a lot. Really? I sit to pee a lot. Oh, do you to exclusively pee? Yes, to, to with zero poo poo. Wow, really? I don't, I don't, I don't. Wow. Yeah, I have a spraying issue. So, so I got a little bit. Do you ever stand? I stand if I'm in a public urinal. Sure. 'Cause I ain't in my house. I don't give a ****. Nick, you're on The GameOverGreggy Show. How are you? Good. How are you? Good. Hey, I was just wondering, when here at the new studio, do you still sit to pee or was that just because you were out visiting my house before? I usually sit to pee still. Yeah, I like it. It's relaxing. Sometimes it makes it, it just cuts out that a little bit of time that you need between number one and number two sometimes. But sometimes I don't know what, you know what I mean? I want to be prepared for everything. Sure, I understand. Okay, thank you. Love you. Love you. Bye bye. See, when alternating between urination and defecation, I still stand to pee even",
            "start": 585.16
        },
        {
            "text": "you know what I mean? I want to be prepared for everything. Sure, I understand. Okay, thank you. Love you. Love you. Bye bye. See, when alternating between urination and defecation, I still stand to pee even in those situation. Here's the story. Urination, defecation is my new album. Here's the story about Greg Miller's urination and defecation is that they are two distinctly different things for me to where I sit down to poop and **** you not, nine out of 10 times, stand up and we'll start to leave and I'm like, no, I still got to pee and walk back and pee. Oh, really? Yeah, you don't. I'm there for one bus. I, there's a little bit, but your mind is just like, I'm not focused on the urination. I'm worried about the defecation. Here's what's happened to me a lot. Now I'm getting like inside baseball. This is the content people want if they've stayed this long. Don't worry, this is very, very, very private. So sometimes I'm sitting down and I'm, sometimes I'm sitting down and I'm, I'm pooping, right? Or whatever, and I'm",
            "start": 626.12
        },
        {
            "text": "people want if they've stayed this long. Don't worry, this is very, very, very private. So sometimes I'm sitting down and I'm, sometimes I'm sitting down and I'm, I'm pooping, right? Or whatever, and I'm peeing as well. Sure. And I, um, with my body shape, I have large thighs. Okay. Sometimes the large thighs constrict the pee. They, my pee-pee, as my, yeah, my pee-pee is, yeah. So there, so there are times where like I stand up and like, nah, still got some pee there. You almost got me. I almost got me. Yeah, 'cause there's been times where like I stand up and I **** just like I leave. Oh, it's like a kink in the hose. It's not done. Yeah, yeah. So I've had to, I like, I've been mentally conscious of that **** of like, all right, I'm peeing right out. I think I'm done. But am I done? Let me kind of a little, no, open up your thigh a little bit. Is there a worst, is there a worse sound than when you get up to pee in the middle of the night? You're like, I don't need the light. And you hear it hit the ground. You're like, ****. See, I'm a disciplined",
            "start": 668.76
        },
        {
            "text": "there a worst, is there a worse sound than when you get up to pee in the middle of the night? You're like, I don't need the light. And you hear it hit the ground. You're like, ****. See, I'm a disciplined peer. I, I, I, I turn the light on, bring the glasses along. Got to. I mean, because those accidents, do you honestly think Jared Petty is irresponsible enough to do that? Well, no, no, I've missed. There, there have been, there have been mishaps, but it hasn't been caused by the light out. It has been caused by the lack of glasses. It's, it's simply caused by, yeah, just like, oh, man, something like that. Like I masturbated too much and this is just going everywhere. Let me tell you another shout out to Me, Myself & Irene. And when I say another, I mean probably the first shout out that movie's ever got. 'Cause as a young boy maturing and masturbating, you have no idea if this weird crazy urine spray is normal. Is this something everybody has? Talk about in that movie was like, Irene, why am I peeing like I've been having sex",
            "start": 722.8
        },
        {
            "text": "maturing and masturbating, you have no idea if this weird crazy urine spray is normal. Is this something everybody has? Talk about in that movie was like, Irene, why am I peeing like I've been having sex all night? I'm like, oh, it's normal. Yeah, just like spray. I had that same realization when I saw that scene. I was like, yeah, thank you, Jim Carrey, Renée Zellweger. I was prepared by literature like the, no, no, that's in there too. That's literally in there. Absolutely. There, there's at least one story about that happening. But no, um, and after Abel came and slept for four days, there, there's a lot of sex in the Bible. Um, um, well, I mean, people had a kind of a more pragmatic attitude. You know, you live, there wasn't a lot to do in the world, so people were a little more pragmatic about it. Um, but no, I, I, when it, when it comes to like being informed about stuff, my parents were ridiculously progressive. Oh, yeah. So, well before I hit puberty, they're like, hello, son, here's a giant pile of literature. We know you'll have",
            "start": 757.92
        },
        {
            "text": "it comes to like being informed about stuff. My parents were ridiculously progressive. Oh, yeah. So, well before I hit puberty, they're like, hello, son, here's a giant pile of literature. We know you'll have questions. Let's sit down and talk about them. Don't be afraid. Everything's good. Like, and so a lot of it wasn't that surprising. I was still terrifying and horrible, but my mom and dad were really great about it. And it did help. There was an awesome moment of watching TV with my parents and they made, there was some reference to sex or whatever, and like it went to commercial. And I remember they could, my mom could read that I was thinking that over. She's like, just so you know, little boner. She's like, always use the pee hole. Got to go bathroom. She was like, just so you know, Greg, if you have any questions about sex ever, you're allowed to ask them or whatever. And I'm like looking at my mom doing this, and I could see my father in the other chair getting uncomfortable. So it was the most mixed signal thing",
            "start": 803.28
        },
        {
            "text": "sex ever, you're allowed to ask them or whatever. And I'm like looking at my mom doing this, and I could see my father in the other chair getting uncomfortable. So it was the most mixed signal thing of all time. I'm like, huh. I forget what I asked about. Maybe condoms. 'Cause I remember once we saw a condom in a park, like on the ground, and my friend Mike was like, that's what people rub on their dick when they're ready to have sex. And I was like, oh. He's like, there's a jelly in it that you rub on your dick. And I was like, huh, makes sense. Makes sense. Why I remember seeing one in our like high school yard and asking one of my buddies, what's that? And he went, it's a rubber Johnny. And I was like, oh, yeah, cool. Oh, of course. Yeah, I didn't know what it did for like a year. Rubber Johnny. Well, I also remember like, you know, watching TV shows that were way too above my reading level or whatever, where it would be like, like it wasn't, but it's like the Seinfeld episode where George can't get the erection. And I thought",
            "start": 848.88
        },
        {
            "text": "know watching TV shows that were way too above my reading level or whatever, where it would be like, like it wasn't, but it's like the Seinfeld episode where George can't get the erection. And I thought it was the reverse, that he was hard and that's why he couldn't have sex. And it was like, like who the **** knows how sex works? I see, I used to think that a vagina was like a, a thing you could grab. Like 'cause of Donald Trump, I thought there was like a bulbous, like meaty thing to it. It was like a, like an external organ. Yeah, yeah, yeah, yeah. I thought it was like a, you know, like you could flap it and ****. Sure, just grab that ****. That vulva. What Bulbasaur was based on. Grab that vulva. Yeah, yeah. Get real. Get a good handful of vulva going in there. And there go my ministerial credentials. If you didn't know, ladies and gentlemen, this has been The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table. Each bring a random topic discussion for your amusement. If",
            "start": 886.12
        },
        {
            "text": "know, ladies and gentlemen, this has been The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, head over to Kinda Funny's Patreon page, Patreon.com/KindaFunny, where you can toss us a few bucks, get every episode early along with a bunch of bonuses, perks, and goodies. If you have no bucks to toss our way, no big deal. Head over to YouTube.com/KindaFunny. You can subscribe and see the show broken up topic by topic, day by day, until it goes up as one big MP3 and video around the world. Gentlemen, this was fantastic. I really had a good time. Thank you for having us. Thank you for much. Thank you. Thank you. Thank you guys. Good. Now get back to work on Kinda Funny Live stuff talking about bubblegum now. Or until next time, it's been our pleasure to serve you. So, Tread at Layers, guys, that was a great episode of The GameOverGreggy Show. If you agree, subscribe here, like the video.",
            "start": 936.0
        },
        {
            "text": "about bubblegum now. Or until next time, it's been our pleasure to serve you. So, Tread at Layers, guys, that was a great episode of The GameOverGreggy Show. If you agree, subscribe here, like the video. There's nothing really to click on. Go support us on Patreon. Go watch other videos over here. Go check out Kinda Funny Games over there. We're doing a bunch of cool Let's Plays and stuff. Come to Kinda Funny Live 3. Buy a shirt. Why don't you support us on all the Patreons? Did you know that we have a Twitch thing? Maybe you should go there. Do you know that if you have Amazon Prime, you have Twitch Prime as well, and you get a free subscription every 30 days, and you should give that to us? Did you know?",
            "start": 972.52
        }
    ]
}