{
    "id": 2788,
    "video_id": "B0h-ZiBr4mA",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Nick Scarpino",
        "Kevin Coello",
        "Andy Cortez"
    ],
    "title": "Wonder Woman Beats BvS in America - Kinda Funny Morning Show 06.30.17",
    "description": "Don’t forget to sign up this month! Go to http://wrg.am/funnytank and grab your free tank, garage slot and 3 Days Premium game time while this lasts. The number of new player registration codes is limited.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1498855552,
    "duration": 2914,
    "transcript_chunks": [
        {
            "text": "greetings and salutations humans welcome to Kinda Funny Morning Show. Don't copy him. What? Don't do the humans thing. It was not cool, humans. It was not cool. I love it. It gets stuck in your brain. I love it so much. It's the best thing anymore. Uh, my name is Nick Scarpino. I'm your host for this show this morning. With me as always is my Fai as who's calling me from on. I'm not going to answer. Why do you have your phone? Why? I have to. No, you don't. People text me things. No one's ever. I'm an important human being. No, you're not. And that's not it. There's one more thing. Oh, you're doing the Steve Jobs thing of the sweat. Andy, how you doing? You said uh, as always, I'm we're not always here. That's you and I usually are hosting together though. Every once in a while I host it with Tim and Greg, but you and I are the Power Hour. Are we? Are that dynamic duo? We are the the the Latin bloodline. Latin. Yeah, that's not how the word always works though. Mhm. Always is a it's a flexible thing. It's like",
            "start": 1.16
        },
        {
            "text": "but you and I are the Power Hour. Are we? Are that dynamic duo? We are the the the Latin bloodline. Latin. Yeah, that's not how the word always works though. Mhm. Always is a it's a flexible thing. It's like literally. I mean, it doesn't actually have to mean literally anymore. It can mean whatever you want it to mean. It why you fronting? We have the news bringing power, the Power Hour. We're bringing it to the people, bringing it to the community out there, right? And frankly, nobody's gonna stop us. No, no one can stop us. And the best part is this, when I say Morning Show, you say the tagline of the Morning Show, which is where the pop culture news is popping and the cute boys are never stopping. That's right, boys. Get after. Oh man, happy Friday. It's been a long week. Happy dude. Holy shit, it's been a long. We have done a lot of shit. I'm exhausted. Oh my God. Uh, quick housekeeping things. Of course, next week uh, is a modified schedule. We will not be uh, doing the Morning Show all week. We've got the X-Men: The New",
            "start": 54.48
        },
        {
            "text": "done a lot of shit. I'm exhausted. Oh my God. Uh, quick housekeeping things. Of course, next week uh, is a modified schedule. We will not be uh, doing the Morning Show all week. We've got the X-Men: The New Class are coming in. We're going to stream on Monday and Wednesday. Tuesday we're taking off because it's America's birthday. Is that correct? That's right, right? Jesus's birthday. It's not Jesus's birthday. We taking it? Yeah, I guess so. No, Jesus like Jesus Valdez. I went to elementary school with him. We will be streaming, I'm sorry, on the calendar. We will be streaming from 11:00 to 1:00 uh, games. It's going to be super fun. So you guys can join us for that. But there will be no Morning Show, no no Kinda Funny Games Daily as well. Um, and then of course, uh, from Thursday to Sunday we will be at RTX. So look for lots of sweaty hot tweets from us 'cause that's going to happen. Lots of Instagram stories putting that shit on the gram. Um, we're going to gram this shit. We're going to gram it. We're going to do a lot of",
            "start": 102.44
        },
        {
            "text": "of sweaty hot tweets from us 'cause that's going to happen. Lots of Instagram stories putting that shit on the gram. Um, we're going to gram this shit. We're going to gram it. We're going to do a lot of probably Instagram live video to be honest with you. Maybe even some Periscoping. Oh, we're going to Periscope the shit out of that. Uh, now Andy, you know today is National Social Media Day. Yeah, also known as Tim Gettys' birthday. Yay! Big happy birthday to Tim Gettys. Tim will be on the Games Daily Show later today with Andrea Rene. Greg is out of town, of course, as you probably seen. He's probably tweeted about 400 times. But the airport, getting to the airport, being on the airplane. What's the coffee? Where's Portillo's? Where's my wife? I'm just jelly. I'm jealous of him because he's got that stamina to keep tweeting. He does. But that's just the way it goes. Or he has the memory to remember to tweet, right? I have to set a reminder on my phone. Yeah, you sure do. What is the Kinda Funny Morning Show, you might",
            "start": 142.88
        },
        {
            "text": "tweeting. He does. But that's just the way it goes. Or he has the memory to remember to tweet, right? I have to set a reminder on my phone. Yeah, you sure do. What is the Kinda Funny Morning Show, you might ask yourself? Well, where we get together each and every day uh, to talk about news, what's going on in our life, what we're watching, what we're reading, all that fun stuff. Uh, it's everyday at 11:00 a.m. on Twitch. If you want to be here live in the chat, we love you for that. We interact with you. We give you shout outs. You can tell Andy and I how bad our hair looks these days. Um, if not, of course, it posts to YouTube and we post it as a podcast. So if you're listening to this, hey, guess what? There's video components to it. You should come over to YouTube and check it out. And if you have the time in the morning at 11:00 a.m. Pacific Time, you can check it out on Twitch. You can be a subscriber. It's awesome. You can give us money or you can give us some Amazon money. It doesn't really fucking matter or don't",
            "start": 185.12
        },
        {
            "text": "at 11:00 a.m. Pacific Time, you can check it out on Twitch. You can be a subscriber. It's awesome. You can give us money or you can give us some Amazon money. It doesn't really fucking matter or don't give us any money. Just come hang out. Either way, I can buy food at the end of the night and live in my apartment alone. Yeah, you know, room chomping on some Chef Boyardee. Yeah, Chef Boyardee. Chef Boyardee. That's his name now. Andy, we got exciting news, do we, to announce? Yes, first news story. Not this new story. I didn't put it in. Kevin, don't bother, Kev. Uh, I've been invited to another comedy showcase. Oh yeah, I have. So I'll be at Milk Bar tonight. I believe the showcase starts at 7:30. I'll tweet that out in a little bit so everyone can take a look if you want to come. Uh, there's a great a lineup of local Bay Area comedians that'll be there. I'm one of them. I don't know when the fuck I'm going on, uh, 'cause you know, comedians, not the greatest organizers. Sure. But yeah, they're just I'm like, hey, so",
            "start": 221.36
        },
        {
            "text": "of local Bay Area comedians that'll be there. I'm one of them. I don't know when the fuck I'm going on, uh, 'cause you know, comedians, not the greatest organizers. Sure. But yeah, they're just I'm like, hey, so what time am I going on radio? And they like, uh, knock knock. Just like, I don't want to hear a joke. I need information. Yeah, I actually don't want to laugh right now. I want to figure that out. But anyway, if you guys, if anyone's around, uh, come see a great lineup of local comedians. I will be there as well polishing up my comedy skills. Now, milk mean uh, is leche in Spanish. It is leche in Spanish. It is leche there. You leche, as they say. So as soon as I said that, yeah, I went the same way. My brain went the exact same way. Nick and I want to make a Mexican wrestler named El Leche-dor, where he's like a Luchador, but he's all about milk. He is. He just comes in. He pours milk all over his big sexy body. Yeah, and he's just like similar to the Milk Money video. Yeah, no, I like that video. That video uh, is is shockingly",
            "start": 264.12
        },
        {
            "text": "but he's all about milk. He is. He just comes in. He pours milk all over his big sexy body. Yeah, and he's just like similar to the Milk Money video. Yeah, no, I like that video. That video uh, is is shockingly good. But shocking. Shocking. Yeah, shocking is a word of put. Shocking is definitely a word. And I had to go to the restroom immediately after after we watched it on our GameOverGreggy live stream. No, I had to. I had to go pee. But it was not the best. Yeah, it was pretty bad timing that as soon as we ended, as soon as we stopped watching a very sexual video, right, with very very pretty women pouring milk all the all over their bodies, I had to go to the restroom immediately after. I it was bad timing. No, it was fine. It was totally fine. We didn't think you were doing anything inappropriate in there. I mean, I always assume you're doing something inappropriate in there 'cause every time I see you, you're just like, you're looking at the mirror, talking to yourself, and like just spraying your hair a little",
            "start": 308.48
        },
        {
            "text": "mean I always assume you're doing something inappropriate in there 'cause every time I see you, you're just like, you're looking at the mirror, talking to yourself, and like just spraying your hair a little, spritzing your hair, or you're wiping your face down, which is always kind of strange to me. But not in like a bad way, just a little bit like a weird a weird way. What are you doing this weekend? What's your plan for this weekend? You you got any cool plans? Well, we're going out for Tim's tonight. We're gonna have some drinks for Tim's birthday. He might stop by uh, Milk Bar potentially, depending on where Gia takes him for dinner. So we'll see what happens there. Um, other than that, I started finally playing uh, Ghost Recon Wildlands last night, shit. Uh, started playing with my buddy Caesar back home. And and so yeah, we we played for like an hour and I was like, holy shit, this is a lot of fun. Like just going around this open world and finding guys to shoot, shooting guys that were not supposed to shoot.",
            "start": 352.64
        },
        {
            "text": "so yeah, we we played for like an hour and I was like, holy shit, this is a lot of fun. Like just going around this open world and finding guys to shoot, shooting guys that were not supposed to shoot. Yeah, exactly. Just like, hey, that's the guy. Oh, he's dead over. I told you, man, these guys talk out shit. Super fun. But it's super fun. It's super fun. So we're probably going to do that more tonight. Andy, you want to play next week? Yeah, hell yeah, you do. Yeah, I do. Yeah, hell yeah, I'm down. Why not? I don't see why not. I think it makes sense to me. It makes sense to me. I think that's all the housekeeping we have for today. Looks like it. I don't think that's anything. There's more left on that. Kevin, what's going? You have anything to announce today? Are you pregnant? What's going on? No. How you feeling? Pretty good. How's the low carb diet working out for you? Oh yeah, all right, great. All right, so I've come to the conclusion that I don't like um, I don't like sorry. I heard Andrea Rene talking. It kind of distracted me.",
            "start": 388.04
        },
        {
            "text": "the low carb diet working out for you? Oh yeah, all right, great. All right, so I've come to the conclusion that I don't like um, I don't like sorry. I heard Andrea Rene talking. It kind of distracted me, threw off um, the wall here. I do not like Outback Steakhouse. Really? That's shocking news to me because we've taken you to Outback Steakhouse 45 times now. That's strike number two, buddy. I will go eat. I will eat the appetizers, but the steak is rarely ever good. Yep. Well, your steak was was it your steak that was like completely charred? No, they like, I asked, I get my medium. Yeah, I got my medium as well. And uh, it was way more than medium. Let's say that. I got my medium. Now, the last time I got it medium though, it was still not good. You know, last time they cooked it correctly and it still wasn't very good. Um, the shrimp is always like just it looks like it's been like they microwaved it sort of thing. I want Gordon Ramsay to go in there and fucking kick him into shape. Nicholas, the thing is about Outback is it is",
            "start": 429.88
        },
        {
            "text": "is always like just it looks like it's been like they microwaved it sort of thing. I want Gordon Ramsay to go in there and fucking kick him into shape. Nicholas, the thing is about Outback is it is a chain restaurant. It's raw. It is a chain restaurant. The same as Applebee's or Fridays or any of these other restaurants that we have on the West Coast. They're just mailing it in. They're not it's not you're not going to an Outback Steakhouse for qual a quality steak going experience, right? Two of my favorite steakhouses, real steakhouses in the city are Epic and Alexander's Steakhouses. And they are insanely expensive. I can only go there maybe once a year if I'm on someone's PR budget or if I'm going with like someone who's like, hey, let's go on the company dime. I'm like, great. I'm in. I'm totally in. Um, Outback, I don't think of as a steakhouse, even though it has steakhouse in the title. Sure. Outback is just a fun outing to see which one of us gets the squirts afterward. You know, it's like, who's going to",
            "start": 479.96
        },
        {
            "text": "Outback, I don't think of as a steakhouse, even though it has steakhouse in the title. Sure. Outback is just a fun outing to see which one of us gets the squirts afterward. You know, it's like, who's going to get the squirts today? I kind of got it yesterday. You got it yesterday. Mine was good yesterday. But two times ago, I I've been into a piece of broccoli and I'm like, I think this broccoli was display broccoli and they just ran out and grabbed it off the display at the front and put it onto my plate because it tasted very rubbery. Now, Cool Greg, yeah, got the shit out on the stick once again and his macaroni. So the best quote of the day. So last time we went to Outback Steakhouse for Kevin's birthday, I believe it was Kevin's birthday. Yeah, yeah. Um, Cool Greg got the coldest mac and cheese. Like to where it was not even it didn't like they just it was it was ice. It was just fucking freezing, right? And so he was like, I'm not going to eat it. Like it's gross or whatever. And they brought him a newer one.",
            "start": 523.36
        },
        {
            "text": "it was not even it didn't like they just it was it was ice. It was just fucking freezing, right? And so he was like, I'm not going to eat it. Like it's gross or whatever. And they brought him a newer one. But he was like, I still don't want to eat it 'cause I feel like they spit in it. And he was very paranoid about that. But yesterday, paranoid about that, he gets another order of mac and cheese and it looks cold to me. Like it doesn't it doesn't look like there's no steam coming off of this. And I know that this is going to be an issue for him. But he's not going to say anything. So I was like, Cool Greg, is is it does it look is that cold? And he was like, yeah, I mean, it's not it's he was like, I mean, it's a little cold. I mean, it's fine. It's there's a little bit of warmth there. And and I was like, oh, that sucks. And then Kevin goes, are you going to eat that? And he goes, oh no, it's hella cold. Yeah, it's cold. No, he's like, oh, that's cold as fuck. So yeah, he's been fucked over twice by them. He will not. I and the",
            "start": 566.92
        },
        {
            "text": "and then Kevin goes, are you going to eat that? And he goes, oh no, it's hella cold. Yeah, it's cold. No, he's like, oh, that's cold as fuck. So yeah, he's been fucked over twice by them. He will not. I and the thing about Cool Greg is he doesn't want to put people out. He doesn't want to be a bother at people. I love complaining. If something's wrong and I'm paying for this food, I'm paying for this food. It needs to be good. If it's not good, I'm sending it back. You're going to you're going to keep bringing me food until it's right. But what he thinks is he doesn't want to be a pain in the ass for two reasons. One, he doesn't he just doesn't like putting people out. Two, he has a very very solid paranoia of what will happen to that food if it goes back into that kitchen and it comes back out. So he just doesn't want to take the chance. I don't care if someone spits in my food as long as it's good and I don't know about it. So I don't give a fuck paying for the food. Just get it right. Just get it right. I mean,",
            "start": 608.04
        },
        {
            "text": "want to take the chance. I don't care if someone spits in my food as long as it's good and I don't know about it. So I don't give a fuck paying for the food. Just get it right. Just get it right. I mean, don't spit in my food. But if you do, don't tell me. Yeah, unless you feel that membranous sort of gooiness. Yeah, don't describe. That's not spit though. That's someone adding a little extra protein to the dip. Uh, Ho Poof and one says, my dad calls the squirts an Outback Attack. That's pretty good. That's uh, that's not bad. It's coming Outback. Oh, it is coming Outback. It's it's squirting from your Outback. Mhm. Uh, Keep Me Here says, Nick loves yelling at the working class. I don't like yelling at anyone. What I appreciate to be a part of is that I used to serve. I served food for a very very long time all throughout college and then sometime after college until I kept getting fired from restaurants because I fucking hated it. The thing about it is this, anything worth doing is worth doing right. Even if you're",
            "start": 645.52
        },
        {
            "text": "college and then sometime after college until I kept getting fired from restaurants because I fucking hated it. The thing about it is this, anything worth doing is worth doing right. Even if you're doing a job you don't like, you're still supposed to be doing that job. And so when food comes out cold or it doesn't taste right, it's you're not giving the your clients the experience that they need or deserve or deserve. And so my feedback is is essentially, yes, it's brutally honest. Does it hurt when it happens? Sure. Have have I made people cry before? Maybe. But does that make the restaurant stronger? Yes. And in doing so, it it gives the restaurant a better chance of succeeding, right? If I just keep saying, oh yeah, it's totally fine that you're going to bring fucking cold mac and cheese out and steak that tastes like it's 15 days old out, great. Guess what? Outback's not going to exist. And I love me I love me some Outback. The wings are fucking great there though. Oh my God, the wings are delicious. But they",
            "start": 693.12
        },
        {
            "text": "tastes like it's 15 days old out, great. Guess what? Outback's not going to exist. And I love me I love me some Outback. The wings are fucking great there though. Oh my God, the wings are delicious. But they are fried. They're fried within an inch of their life. The cheese fries are fantastic. To the cheese fries on Amazon. Do you think Cool Greg will ever get no, a warm mac? I'm going to put it on the poll. We're put on the poll. We're going to put on the Kinda Funny Vids poll. Will Cool Greg ever get a warm mac and cheese from Outback? Should I call them out? And should I? 100%. 100%. Okay. Because they need to know. They need to know. Nothing can be gained by just allowing shitty things to happen to you. Nothing. You either speak up about it or forever hold your peace. And I I I got tired of I don't like paying good money for bad service or bad food. It's shitty. It's horrible. You know, if you bought if you went uh, to a car dealership and bought a car and you got in the car, drove off the lot and the thing didn't",
            "start": 731.92
        },
        {
            "text": "money for bad service or bad food. It's shitty. It's horrible. You know, if you bought if you went uh, to a car dealership and bought a car and you got in the car, drove off the lot and the thing didn't start, would you be like, I guess this is just my lot in life? No, you'd be like, give me another fucking car, right? So why is that any different than the steak? Yeah, I'm putting that in my body. Go in my muscles. Hey, there's a fly in my car, right? You know what the fuck, guy? Take out pay. Yeah, take it out. Give me a new car. Give me a new car. It's a terrible an. Forget it. Warm/hot mac and cheese. Now, how do you spell mac and cheese? Is it Mac and then the letter N and then cheese? Uh, that is that is a Greg Miller question. He is not here. Should we should we call him? Should we call Greg? Mac 'n' Cheese. I think it's an. Kevin, I I'm pretty sure it's an. I just wanted to like you. I wanted to make you want to throw a little wrench in there. I appreciate. Are you calling him, Nick? Uh, let me call Greg and see. Is he on a",
            "start": 775.6
        },
        {
            "text": "an. Kevin, I I'm pretty sure it's an. I just wanted to like you. I wanted to make you want to throw a little wrench in there. I appreciate. Are you calling him, Nick? Uh, let me call Greg and see. Is he on a plane right now? Do we know where he is? Everywhere I'm looking, he was at a hotel. It seemed like this morning. Okay, let's call. He may be asleep. Everywhere I'm looking, there's just a letter up at like 1:00 in the morning every day. Let's give him. Greg's on a flight. What are you talking about? Is he on a flight right now? I believe so. 'Cause didn't he post an Instagram video where he was trying to make pancakes from the airport? He's on a plane. Oh, that sucks. Will Cool Greg will Cool Greg ever get a warm/hot mac and cheese there go from Outback? Also, Cool Greg in the near future, very like sick right now. His stomach is not doing well. Yeah, Outback fucked him up probably. Or what did you guys do last night? Did you go back to Outback? I just asked him what he ate for uh, like what he ate last night.",
            "start": 816.64
        },
        {
            "text": "now his stomach is not doing well. Yeah, Outback fucked him up probably. Or what did you guys do last night? Did you go back to Outback? I just asked him what he ate for uh, like what he ate last night. He said Outback. I think that's it. That's not good. That's not good. Should we start our first story 18 minutes into the show? Yeah, let's do it. Hold on. Come on. Okay, not Kevin has to walk away. Dell, we're we got some packages being delivered. Uh, she going to put yes or no? Yeah, yes or no. Yes or no. So how does that look? Will Cool Greg ever get a warm mac and cheese from Outback? I'm putting it on. And I have to go run for this package. Okay, fantastic. Put hot mac and cheese because a warm mac and cheese is shitty too. It's got to be hot. Sure. Okay, a hot mac and cheese. I want it piping hot. I want it to the point where you go like this. I'm so excited cooked mac and cheese. You know what I mean? We got like you put in your mouth like 'cause it's so hot. The story. Okay, we're let's get into the news. First story. First story.",
            "start": 861.8
        },
        {
            "text": "you go like this. I'm so excited cooked mac and cheese. You know what I mean? We got like you put in your mouth like 'cause it's so hot. The story. Okay, we're let's get into the news. First story. First story. 18 minutes in. Doesn't matter. Doesn't matter. Comes from our good friends over at GameSpot. Uh, the title says, Wonder Woman is now the now DC's biggest movie in the US. There's no author on this. Oh no, from Dan Auty. Uh, Wonder Woman's record-breaking box office run continues. Earlier this week, it was confirmed that the movie is now the most successful film ever made by a female director. And now the most the uh, now the movie W has become the biggest film so far in DC Extended Universe at the North American box office. As reported by Mashable, Wonder Woman has now overtaken Batman v Superman: Dawn of Justice to become the Studio's top earner in the US. With Thursday's estimated take, it will it will have crossed 331 million line, beating Dawn of Justice's 330 million. As the S as the site notes, what's",
            "start": 903.76
        },
        {
            "text": "to become the Studio's top earner in the US. With Thursday's estimated take, it will it will have crossed 331 million line, beating Dawn of Justice's 330 million. As the S as the site notes, what's most impressive about Wonder Woman's success is how quickly it became DC's biggest domestic earner. Dawn of Justice took 1 weeks to make 330 million, whereas Wonder Woman has done it in just four. The big difference is the critical and audience reaction to the two films. Also, Batman v Superman was stupid. I just put that part. I know if you guys are still paying attention. Okay, no, I was I was while Dawn of Justice open. Well, the savage reviews uh, it received have hurt its performance overall. While Wonder Woman has been highly praised by critics. I don't think it's I don't think we have to be wishy-washy on this one. I'm pretty sure the fact that everyone paying that movie actually did hurt its performance. Also, the fact that Wonder Woman was just a better film. It's just a better put together movie. So kudos",
            "start": 951.44
        },
        {
            "text": "one. I'm pretty sure the fact that everyone paying that movie actually did hurt its performance. Also, the fact that Wonder Woman was just a better film. It's just a better put together movie. So kudos to Patty Jenkins' team over there. DC, you guys are here's what you're doing. Hopefully this where they turn the new leaf. You're stirring the ship, stirring the ship, steering the ship in the right direction, stirring the ship, getting it all mixed in there, getting it all. There's a fly in my ship now. I wonder if Batman v Superman still has a possibility of overtaking Wonder Woman. Do you think it does? Should we put that on a poll? You think it's going to come back somehow? You guys are gonna break the poll joke. No one cares about the poll joke. People like Kevin. Kevin, there is no later today. Uh, Tim Gettys and Andrea Rene are going to sit in these very two chairs. The shot's going to be wider so you can see these cool walls right here. Okay, and they're going to talk right here. Don't stop touching them. You're",
            "start": 995.48
        },
        {
            "text": "Andrea Rene are going to sit in these very two chairs. The shot's going to be wider so you can see these cool walls right here. Okay, and they're going to talk right here. Don't stop touching them. You're going to hear look how much they sh they're shaking. It's fine. It's 'cause I have powerful thunder in my down under because you work. They're going talk about really serious shit. Can you just let us have fun? People log into this show to get warmed up for their day. You know what I mean? You're we're going we're getting you going. It's Friday. I'm in a bad mood. I had to go to three Starbucks today. That's not a lie. And I just want someone to make me laugh. Three? You went to three Starbs? I drove by two because there was no parking there. Finally went to I finally went into the Target to go to Starbucks. I was like, okay, they yeah, no, no, over over off of G. I drove by one, tried to find parking, couldn't find it. Drove by another one, went into the parking lot, couldn't find parking. I was assuming you like",
            "start": 1036.16
        },
        {
            "text": "I was like okay they yeah no no over over off of G I drove by one tried to find parking couldn't find it drove by another one went into the parking lot couldn't find parking I was assuming you like walked in and they **** up your order you said **** this I'm trying number two no no no no no I have to be able to park so I went to the the the Target knowing that they have the the little protein pack that I usually want and then also the uh uh the coffee that I want they didn't have the protein pack but I just said **** I got a protein pack for you got **** you got a little Vienna sausage for me that's what I'm talking about uh congratulations to one one not much of a story there but it's good to hear that that news is doing well always good to see DC doing well because guess what the better they do the harder Marvel has to Works to give us more Spider-Man movies and that's good will DC ever catch up no really thought Spider-Man was going to suck you did yeah here's why I thought",
            "start": 1074.4
        },
        {
            "text": "better they do the harder Marvel has to Works to give us more Spider-Man movies and that's good will DC ever catch up no really thought Spider-Man was going to suck you did yeah here's why I thought Spider-Man was going to suck no I haven't seen it maybe I will think it sucks right no you won't doubtful um I thought it was going to suck because of how hard they were pushing it like trailer every you know 4 days or whatever and I was like this isn't a good sign like they really really want us to go see this movie and I feel like it's because maybe it's lackluster a little bit underwhelming you never know though sometimes they go okay we have to make our money back let's bombard people with marketing and then sometimes they go we got to hit on our hands let's let let's let's double down it's like when you have a really good hand in poker and you're like I've got I know I can beat everyone and you're just throwing money into it cuz you want to get that money back you're like gosh that's",
            "start": 1113.72
        },
        {
            "text": "like when you have a really good hand in poker and you're like I've got I know I can beat everyone and you're just throwing money into it cuz you want to get that money back you're like gosh that's not how poker Works no that's just racist what I don't know why you're saying why is that racist Uno I miss playing Uno Uno was fun right Uno was a good game I I remember it from elementary mostly Uno um what you y yeah and it was like the person with the last card right I like there's a mic down here that's like it's like a dog it's like kind of rubbing against your hear don't it are they live no Uno was very underrated Uno was very under actually no Uno was pretty much just where it to be yeah it was just rated I don't think anyone no one's ever played Uno like how have I never heard of this **** amazing no they're just like it's got colored cards great it's great for a four-year-old of the most underrated games of all time I'd say I I I don't I don't think so I'll back that up we can",
            "start": 1152.0
        },
        {
            "text": "**** amazing no they're just like it's got colored cards great it's great for a four-year-old of the most underrated games of all time I'd say I I I don't I don't think so I'll back that up we can always ask I disagree is so underrated we're going to put it on the poll yeah you guys they got to be more vague is it underrated question mark yes or no we don't want to steal the joke that badly yeah we do they nailed it Joe Scaro who do we steal from John Linger John Lardo John Ringer John Risinger we stole John Ris John Risinger from R. John I'm so sorry we stole this joke from you but we're kind of doing better so no who's no that's the thing you guys are doing Dan Le Batard Show sorry Dan Le Batard I'm sure your show is super popular and I'm gu maybe we're taking audience members away from you with our stupid ass polls but no we're not we're just gonna no we're not no they're super popular they're better than us and every way oh yeah all right well whatever whatever Kevin a poll update guys",
            "start": 1193.92
        },
        {
            "text": "our stupid ass polls but no we're not we're just gonna no we're not no they're super popular they're better than us and every way oh yeah all right well whatever whatever Kevin a poll update guys Poll update no no this is not looking good this not looking good for Outback for or Greg um I feel bad for Cool Greg I feel like the writing's on the wall I'm really sad about it will we yeah that's a good question ask to okay put it up on the poll putting it up on the poll will we will we keep doing these stupid polls on the morning show yes or no yes no next story maybe should I add a maybe to this one no we'll just do yes just yes or no we'll just do yes or no there it is how do I how oh how do you delete one once it's on there let's just tweet it and see let's just see see what happens Back stories man next story Kevin why are you hating I don't know fun right now boom I just wish you would stop hating fun massive Amazon Prime oh this is why Kevin's excited he loves Amazon Prime massive",
            "start": 1237.6
        },
        {
            "text": "stories man next story Kevin why are you hating I don't know fun right now boom I just wish you would stop hating fun massive Amazon Prime oh this is why Kevin's excited he loves Amazon Prime massive Amazon Prime summer sale takes place on July 11th hopefully there'll be some great deals as well I'm sure there will says Alex Newhouse on over a GameSpot for the last couple years Amazon has held a massive one-day sale for its Prime subscribers uh Amazon has announced that this year's sale will take place primarily on July 11th right although details began deals begin the evening of July 10th uh Prime Day is essentially Amazon's version of Black Friday and it features a bunch of limited time discounts on various items in past years Prime Day had a big sales on video games so it's worth keeping an eye out for that if you want to take advantage of these deals you need to be an Amazon Prime member uh what do you get if you're an Amazon Prime member of course you get one free Twitch Prime",
            "start": 1291.12
        },
        {
            "text": "an eye out for that if you want to take advantage of these deals you need to be an Amazon Prime member uh what do you get if you're an Amazon Prime member of course you get one free Twitch Prime subscription oh right and guess what you can put that to us or you can put it to somewh it doesn't matter but make sure it goes somewhere cuz Amazon's giving you free money don't you want me to eat someone for do you look at him he's wasting away he's a beautiful Latin boy beautiful Latin boy just let me eat the story goes on to read um if you want to think you need a Prime memberships usually go for about $100 a year although students can get six months free and then a discount rate of $50 per year Prime comes with free two-day shipping and you know I'm not going to read the rest this is just like one big like advertisement for pretty much Prime's having a Prime Day on July 11th I'm sure everyone will go out there and buy some cool deals I'm sure Tim Gettys will get another 4K TV for his",
            "start": 1339.44
        },
        {
            "text": "like one big like advertisement for pretty much Prime's having a Prime Day on July 11th I'm sure everyone will go out there and buy some cool deals I'm sure Tim Gettys will get another 4K TV for his bathroom or some **** they normally have like pretty decent like deals of the day or whatever but uh I don't remember there being any crazy good deals last year um I remember being really excited for it because it kind of felt like a Cyber Monday sort of thing right and then you hopped on and you know it just it was whatever whatever it was very whatever like I don't want to buy Disney Infinity toys sorry the thing is this and I this this is the thing I don't like about these sales and granted I know you can get good deals but I don't like when they tell you there's going to be like what it's just so marketing you know they're just they're just so manipulating yeah you know it's like come on dude like I don't know it's it's just one of those like here's an announcement for when we're going",
            "start": 1376.96
        },
        {
            "text": "so marketing you know they're just they're just so manipulating yeah you know it's like come on dude like I don't know it's it's just one of those like here's an announcement for when we're going to announce Kinda Funny Live 3 well we do that so I can't really criticize for that but I don't know I I actually let me back up I don't like the the concept of these Cyber Monday sales I never have I really think like incentivizes people to just go out there and get a bunch of stuff that they don't need now Tim has argued with me to the day his day he's like no they give you great deals and people want TVs but I just don't understand like I come from a time before Cyber Monday when it was Black Friday and you have to go to a place and people get trampled just so you can get a **** small inner tube to put in your pool in the back right but it's like oh those inner tubes $ now as opposed to $5 I got to get 50 inner tubes and it's like you don't need 50 inner tubes dude I worked six Black",
            "start": 1416.68
        },
        {
            "text": "tube to put in your pool in the back right but it's like oh those inner tubes $ now as opposed to $5 I got to get 50 inner tubes and it's like you don't need 50 inner tubes dude I worked six Black Fridays at Best Buy I can't even **** imagine how horrible that was for you **** nightmare did you now did you get a sense that people were just getting a bunch of **** they didn't need no people were actually getting good deals no yeah people wait to like make purchases for that I I mean it's smart Sal shopping is smart don't get me wrong so when I first worked at the Best Buy in South Austin the demographic I'd say skewed a lot less Rich right so there were good deals on laptops and people were getting laptops for their kids or you know for their nephews and nieces or whatever that's when I was in computers but then when I moved to the cell phone Department I moved to North North North Austin like past Austin where it's like there's a lot more rich people and it's like a retirement",
            "start": 1454.52
        },
        {
            "text": "I was in computers but then when I moved to the cell phone Department I moved to North North North Austin like past Austin where it's like there's a lot more rich people and it's like a retirement community so there's a lot of rich white people working up there and doing their thing or whatever um that's where I was selling phones and I remember having like 14-hour shifts and just wanting to **** blow my brains out D yourself it was a nightmare dude CU a bunch of rich people are like so tired of talking holy **** just the whole day doing the cell like imagine selling a cell phone and doing that for 14 hours well it's got to be hard too because you're you're actively trying to sell the inferior model which is the Android phone right no no we sold whatever the **** we wanted to so whatever they wanted to got it okay yeah yeah they'd come in and be like oh I want this like you'd have your set deals or whatever hey remember how you can use Airdrop on your iPhone cuz your phone",
            "start": 1494.64
        },
        {
            "text": "whatever they wanted to got it okay yeah yeah they'd come in and be like oh I want this like you'd have your set deals or whatever hey remember how you can use Airdrop on your iPhone cuz your phone doesn't know how to do it hey remember **** you so yeah Black Friday sucks it sucks being old too I'll tell you that right now we had we had **** Mikey Double D Dor in here what with Cheeks LaRue whatever the **** his new name is and he Tred to help me yesterday he's like no no you got to do this this and I'm like I feel like your **** grandfather right now and I can't get this to work and he was just like he was very nice but then I heard him walk into the other room and start whispering to you and you guys **** laughed at me I don't appreciate that it's not funny to make fun of your elders **** he's a **** you're both **** as far as I'm concerned you're both beautiful but you're **** Kevin next story Thomas uh no Tom Nent yes it was the Best Buy on Mopac and Ben White it",
            "start": 1535.8
        },
        {
            "text": "elders **** he's a **** you're both **** as far as I'm concerned you're both beautiful but you're **** Kevin next story Thomas uh no Tom Nent yes it was the Best Buy on Mopac and Ben White it was that one uh store 04 best damn store and then I moved to 691 nothing but fun Georgetown you know what I like Kevin don't interrupt me nothing next story don't tell me next story then guys it's fine Kevin we're fine Kevin you know what I like or and you know I like about you you're always positive you can take a negative and see the silver that cloud every time and iing on Cloud9 yeah buddy right see look you just did it right there I did a I did a wrong analogy you took it around you **** made it better you made it better sure do you know about the Inhumans what you know about the Inhumans let's talk about that not a goddamn thing full trailer for Marvel's Inhumans release uh I don't know too many people that are super excited about this but I have not seen really any I only seen a",
            "start": 1573.44
        },
        {
            "text": "let's talk about that not a goddamn thing full trailer for Marvel's Inhumans release uh I don't know too many people that are super excited about this but I have not seen really any I only seen a poster for this I really don't know much about the Inhumans other than it I guess it's going to be a new television show that will wow us Evan Campbell over at IGN WR wow us is following a full trailer from Marvel's Inhumans highlighting how a family fracture will serve as one of the focuses for the series The roughly two-minute video show oh Jesus Christ shows that there's not uh much brotherly love between Black Bolt played by Anson Mount it's an awesome name and Maximus portrayed by Game of Thrones uh Iwan Rheon you can watch the trailer below let's watch this would you want audio yeah why not okay are we going to get copywritten I don't think so for this one you know what I mean why am I not get sooner or later that's Luna find us up here our moon you should have known this day was coming are",
            "start": 1614.36
        },
        {
            "text": "are we supposed to follow our King and remain as silent as he is we need to go to Earth now we've been hiding here too long let's go to our rightful home Ramsay Snow her red hair we were on Earth we would have a glorious planet to live on Thal you're talking about betraying your brother you're talking about about treason you're blind to his intentions right or wrong he's dangerous what I'm talking about is freedom freedom for all Inhumans are you going to use your voice to kill your only brother Ah that's a really cool dog what the **** we will not let anyone or anything stop us we will create our destiny nothing can keep us from being free God that looks like poooo I don't know it's cool that they're doing an IMAX I'll tell you that right now um not much more there for me though jeez um it",
            "start": 1655.68
        },
        {
            "text": "destiny nothing can keep us from being free God that looks like poooo I don't know it's cool that they're doing an IMAX I'll tell you that right now um not much more there for me though jeez um it looks like they built one set like one modular set and they just filmed in different spots around it I mean that's that's that's a lot the problem with a lot of these shows is that they don't they can't compete on the same level as like Spider-Man right you can't you can't put $30 million into each episode of these shows to make whatever the $330 million budget of Spider-Man was Go Down Kevin go down a little bit this is the next story what don't I really want the one on the left the Spider-Man and Venom can you just let me say a bunch of nonsense before we get into the next Story please like I don't understand where your head's at right now my friend that's a good point and I and I you're being disrespectful to me okay sorry I I apologize yeah it was no point let's go to the next story",
            "start": 1756.8
        },
        {
            "text": "I don't understand where your head's at right now my friend that's a good point and I and I you're being disrespectful to me okay sorry I I apologize yeah it was no point let's go to the next story Kevin yeah cool here it is the Aliens Paul Reiser figure you waiting for and the rest of the awesome toys we saw this week this is from IGN I love going to IGN they always give you like a good little compilation of all the nerd stuff you need um here's three new toys you can get now on the right I believe is that Miles Morales Moth man that's Black Panther um do uh Island Dr. Moreau nope neither of those are correct Paul Reiser looks like the weird guy Kevin from the the ugly looking dude from the Friday the 13th game it's **** Paul Reiser right no the ugly looking dude from the Friday the 13th game looks like Paul Reiser oh it's not the opposite way that's disrespectful that's totally disrespectful first off uh this is just a compilation welcome back to another week of Toy Aisle and is IGN's",
            "start": 1813.28
        },
        {
            "text": "game looks like Paul Reiser oh it's not the opposite way that's disrespectful that's totally disrespectful first off uh this is just a compilation welcome back to another week of Toy Aisle and is IGN's collection of the most amazing Paul Reiser merchandise maybe other things we've seen on the internet this week you've got Black Panther and Ultimate Spider-Man himself swinging into action even more SDCC exclusives and very fancy Transformers uh I want that Spider-Man and Venom right there so bad I know I actually love cool the Lego BrickHeadz I love that they're doing that it's like a little cute new model of things but the ones that they've done previously I have not been into there's just been other toys that they've made but I I've been waiting for a Spider-Man one who the **** designs these Transformers you know what I mean like what are they smoking that **** rewires their brain to think this is something that like this looks dangerous for a kid to play with yeah like it's all sharp",
            "start": 1859.92
        },
        {
            "text": "Transformers you know what I mean like what are they smoking that **** rewires their brain to think this is something that like this looks dangerous for a kid to play with yeah like it's all sharp edges for **** uh I don't know what this is Lego Creator Bus uh what is this one Miles Morales toy the Miles Morales toy what is mesga 11 well that must be like the the the line the line of it Miles Morales fantastic Hasbro Monopoly Gamer Edition that's pretty awesome actually uh Play Arts Black Panther great keep going down let's just keep going all the way till we get to all the I love all the Square Enix variants of their toys they're really really cool looking very anime and sci-fi looking which one are you talking about the the the Black Panther one so what that is it's one of the dudes from Square Enix who like designs a lot of stuff on the Final Fantasy games uh that's **** sick like does variance for like there's Batman one and there's a whatever he does a bunch of different uh",
            "start": 1898.08
        },
        {
            "text": "from Square Enix who like designs a lot of stuff on the Final Fantasy games uh that's **** sick like does variance for like there's Batman one and there's a whatever he does a bunch of different uh properties but they all look **** insane and like I don't know very gun to me that's awesome that looks dope and of course the Peace Day resistance down to the bottom here Aliens Hadley's Hope Set what Aliens fans have been waiting for is finally here NECA I guess has officially announced its first ever action figure of Weyland-Yutani, Stoat, Carter Burke AKA Paul Goddamn Reiser included as part of a special Hadley's Hope Box Set that also includes a Xenomorph based on James Cameron's original concept art for the Alien design not much CH I just thought this **** cool I love that anything that that that gets me back to my childhood I love and this definitely does this is Titan Matrix in chat says Hadley what did I say Hadley, Hadley excuse me I mean we all make mistakes Nicholas I'm old I",
            "start": 1939.84
        },
        {
            "text": "that that gets me back to my childhood I love and this definitely does this is Titan Matrix in chat says Hadley what did I say Hadley, Hadley excuse me I mean we all make mistakes Nicholas I'm old I got feeble old eyes we already established this yesterday Titan Matrix Kevin can you really quickly Google um the like Square Enix Kai Arts toys and just see other ones so Nicholas can see them uh oh my God I left it for 4 hours my P still not a lot of Hope for uh for Cool Greg um not looking good play hell yeah look at you Kevin look at you you're doing it right Kevin just checking out my poll while Kevin does that poll of course on my personal Twitter was will we keep doing these stupid polls in the morning show uh resoundingly 85% of people said yes oh good okay um uh Reverend Cameron Abbott says don't you dare stop Nick I need this I need it uh more candy Andy's polls a lot of people are liking this that's **** that's really cool that got hard to fight that armor they did some",
            "start": 1985.44
        },
        {
            "text": "Abbott says don't you dare stop Nick I need this I need it uh more candy Andy's polls a lot of people are liking this that's **** that's really cool that got hard to fight that armor they did some Star Wars ones too Kevin that those are the ones that I remember cuz I remember seeing uh oh the the Superman one's dope I remember seeing Vader in one of them and a few Stormtroopers is that right huh oh that's sick that is sick oh Boba look at the Boba one yeah they just like oh look at that **** radical dude that's ill that dude is talented people are talented look at how cool Boba looks I know luckily he's still alive never he's kicking around there somewhere Andy that's it for the news that's it for the news you're going to enter into the new segment that we just introduced when we revent the show cuz it's completely different now called PS I Love This Best Friend XOXO touch me if you want to touch me I like to put something out there what is PS I Love You, I Love This Best Friend XOXO it's",
            "start": 2040.76
        },
        {
            "text": "show cuz it's completely different now called PS I Love This Best Friend XOXO touch me if you want to touch me I like to put something out there what is PS I Love You, I Love This Best Friend XOXO it's our uh giving you guys a voice in the community to shout out someone that you think is doing great that's all it is really it's just a nice thing to do every day so if you guys want to if you if you've pinpointed someone that you think is doing a great job or someone you really appreciate or someone that did a solid for you back at Kinda Funny Live 3 or whatever uh go to KindaFunny.com/bestfriends to nominate that person and we will shout them out on this show just like Pistol ForPlay did for Justin Ryan Bear he says watching was watching the Friday the 13th stream last Friday the 3rd when Grisell D in the chat said he she would be going back to school so they would unfortunately have to cut down on expenses by canceling their Twitch sub they were a gold member and Patreon subscriptions for",
            "start": 2088.96
        },
        {
            "text": "D in the chat said he she would be going back to school so they would unfortunately have to cut down on expenses by canceling their Twitch sub they were a gold member and Patreon subscriptions for a while this person was rightfully a little bummed they would have their gold sub badge um gold sub badge for the time being but they would still be watching they wouldn't have their gold sub badge for the time being but they would still be watching and participating it was then that Justin Ryan Bear another gold member in the chat replied Grisell D by say replied to Grisell D by saying I can help with your Twitch sub I think you can use I can use my PayPal to help go well humbly declined but I was shocked about at Giant Ry Justin Ryan Bear's generosity and decided to shoot him a sh Justin Ryan Bear. Bear it is beer would be spelled with be two maybe you know where I heads out Justin Ryan Bear congratulations you've been shattered out by Pistol ForPlay thank you for being awesome the L. Sander says",
            "start": 2128.24
        },
        {
            "text": "Nick reading lol you know what it is come on guys come on reading's hard it is reading's hard come on guys hard man yeah man H.E.A.R.D. it's hard that's it for PS I Love You XOXO Best Friends um thank you guys for the shout outs Andy and remember you can also submit your friends for PS I Love You XOXO yeah whoever what you think cool human we like to send sweet and nasty love let's send some actually everyone while you're out there send some sweet and nasty love to Tim send him an inappropriate picture too not like xrated super inappropriate no no no actually **** go really inappropriate um like some fun **** something with plan don't go dirty don't get anything that's going to be offensive to people but do give them something that you think you think might make him smart offend him a",
            "start": 2169.36
        },
        {
            "text": "like some fun **** something with plan don't go dirty don't get anything that's going to be offensive to people but do give them something that you think you think might make him smart offend him a little bit and then nominate your friends at KindaFunny.com bestfriend there you go and we can read that **** on the air for you all Kevin it's giveaway time roll the graphic this what you mean yeah close enough uh this this week's giveaway of course is sponsored by World of Tanks uh World of Tanks is an epic team based massive multiplayer online action console game dedicated to tank combat thank you it is available on PlayStation 4 PlayStation 4 Pro Xbox 360 Xbox One Xbox One S and coming soon to Microsoft's newest system the Xbox One X command history's most powerful tanks and experience tactical combat like never before in World of Tanks Console you can battle up to 30 other players in over 450 historically accurate WWII armored vehicles World War II uh from the 1930s to the 1950s World",
            "start": 2216.76
        },
        {
            "text": "combat like never before in World of Tanks Console you can battle up to 30 other players in over 450 historically accurate WWII armored vehicles World War II uh from the 1930s to the 1950s World of Tanks Console is a AAA game that's free to play it was built from the ground up for consoles taking full advantage of both PlayStation and Xbox's unique capabilities regular updates featuring exciting new content special events and sneak surprises you'll never want to leave your console again World of Tanks it's fully the best part is it fully supports HDR 4K Graphics best great and Tim loves 4K graphics and HDR that's why we have an 84 inch TV in front of us instead of a 50 inch Kinda Funny Morning Show listeners World of Tanks Console has a special offer for players who sign up this month go to wg.am/funnytank that's wg.am/ sorry wg.am/funnytank and grab your free tank all right stop it's hard to **** read this thing while you're doing that wg.am/funnytank and grab your free tank garage slot in",
            "start": 2262.12
        },
        {
            "text": "tank that's wg.am/ sorry wg.am/funnytank and grab your free tank all right stop it's hard to **** read this thing while you're doing that wg.am/funnytank and grab your free tank garage slot in three days of Premium game time while this lasts the number of registration codes is limited everyone today's giveaway winner comes from the Twitch chat this person will be winning Odin Sphere for something called a Vita don't know what that is and the randomizer has picked Titan Matrix again Titan he just keeps coming up Titan Matrix why I say Tyson Titan Matrix has Titan Matrix won no he just keeps coming up in the chat we quoted we we shouted him out a couple times today cuz he was talking **** about hey congratulations well congrats I guess Titan Matrix you got noticed and now you're winning uh a game called Odin Sphere on a Vita I mean I don't know if the talking **** was connected I want to make that clear Fair talking **** wasn't connected but we'll see about that we're rewarding bad",
            "start": 2310.8
        },
        {
            "text": "a game called Odin Sphere on a Vita I mean I don't know if the talking **** was connected I want to make that clear Fair talking **** wasn't connected but we'll see about that we're rewarding bad behavior I'm just letting you know that Kevin so no I don't think he ever talked **** actually Andy it's time for the three and three Stephen Cool says Andy and Nick what's the most interesting book you've ever read and why um books I guess my favorite book of recent memory well I've read a lot of good books one of the most interesting recently was a book called Powerhouse the story behind CAA which is one of the biggest at one time the most powerful creative agency on the planet uh as far as like like representing artists things like that it is a fascinating read they like they revolutionized the whole entertainment industry in the 80s it's **** awesome also huge fan of Roger Moore's biography and Andrew Dice Clay's biography okay big shout out to Dune as well and book The Most Interesting",
            "start": 2369.8
        },
        {
            "text": "the whole entertainment industry in the 80s it's **** awesome also huge fan of Roger Moore's biography and Andrew Dice Clay's biography okay big shout out to Dune as well and book The Most Interesting book I've ever read is none other than uh The Encounter uh which is I believe book four in the Animorphs series starring uh a guy named Tobias who turns into a red tailed hawk now here's the thing about me Nick yeah I grew up loving Animorphs right sure and he he turned into a hawk so the red tailed hawk immediately became my favorite animal but also I thought the name Tobias was so **** cool cuz you know I grew up in Hispanic Town sure there's no names like that there's just like you know Mike's and John's or whatever did it ruin the name for you what Arrested Development came around yes 100% 100% wow any poor son of a **** named Tobias like living in that that era the early 2000s must have just **** hated his life yeah you're **** you're yeah absolutely so yeah that's what I was",
            "start": 2413.08
        },
        {
            "text": "100% wow any poor son of a **** named Tobias like living in that that era the early 2000s must have just **** hated his life yeah you're **** you're yeah absolutely so yeah that's what I was going to get to yeah got it um yeah uh The Encounter Animorphs Animorphs great very underrated Dork Cool that looks is that Batman Beyond awesome uh Dork New York says shout out to **** Animorphs man love it yeah you're damn right there you go mhm um so we have two more questions in the non-sub portion uh K Monkey says Nick you may have gotten my shout out on Twitter Blade Runner's $5 on Amazon great time the kids to pick it up that is a good deal which cut though we'll see I don't know Google it and see okay take a look hold not look how sick Robin looks in this that's awesome SAS Power says bet Andy hasn't read a book in a long time I've read a few but I mean you know I read like Fellowship of the Ring in Middle School put on the poll has Andy read a book in a long time that's a good poll actually we can",
            "start": 2456.96
        },
        {
            "text": "Andy hasn't read a book in a long time I've read a few but I mean you know I read like Fellowship of the Ring in Middle School put on the poll has Andy read a book in a long time that's a good poll actually we can we can answer that poll too on Monday uh Dr. Co says shout out to Kill la Kill first time watching it because of you Nick and I guess because of Tim right lot of great anime out there why are you guessing because of Tim what because you know I'm inspiring Tim is intimidating I mean I think Tim's got the height the baby blues the better hair the we've already established that he has the most uh niche I think Tim picked it right Kill la Kill yeah yeah uh it doesn't matter so completely doesn't matter it doesn't matter Tim's got the most uh what was it pretentious beard of all of us that's why people are intimidated by him and he's got the most pretentious hair that's not true it's we put you have the most pretentious hair we put on put on another poll does Andy still have the most pretentious",
            "start": 2507.2
        },
        {
            "text": "are intimidated by him and he's got the most pretentious hair that's not true it's we put you have the most pretentious hair we put on put on another poll does Andy still have the most pretentious hair no no no a lot of people looked up pretentious don't put it on the poll it'll **** change the numbers has has Maximum Court has read a book since Animorphs yes I'm not seeing this **** Blade Runner for $5 **** what he's talking about so someone's lying to you Kevin hold on hold on Tim says Nick is the Jackman-off interfering with the boy orgy schedule I'd imagine there would be some freaking some friction between the two uh as many of you know last week this week a couple days ago I was sucked into a Jackman-off by one Darren Brazil he is uh Darren BRZ on Twitter he's talking a lot of **** and he's going to get crushed is it interfering with my schedule 100% it is but I'm dedicated to winning this now I've got a team that I'm putting together we are going to win we going to go",
            "start": 2551.64
        },
        {
            "text": "**** and he's going to get crushed is it interfering with my schedule 100% it is but I'm dedicated to winning this now I've got a team that I'm putting together we are going to win we going to go so hard on this Jackman-off that it's going to shake the fabric of this country Hugh Jackman the American dream Hugh Jackman probably America's the greatest thing to ever come out of America himself he's Australian the great the the greatest thing to ever come out of America Hugh Jackman is going to be a part of this at some point I don't know how or why but if we can get him that would be amazing if not can we get The Rock I mean I don't know why you're asking me I don't I'm just asking people let's go Australia yeah I question I've heard I've heard it both ways Andrea Australian American potato potato it's it's pretty much the same country say a lot of people say that I hear a lot of people in Australia consider themselves uh members of the United States these good old USA they love it they love it",
            "start": 2592.52
        },
        {
            "text": "it's it's pretty much the same country say a lot of people say that I hear a lot of people in Australia consider themselves uh members of the United States these good old USA they love it they love it it's how you can be South American you can also be West American but yeah in South America you're still American so they're really far west or Far East America make the rules my hands Shenanigans I didn't make the rules say a US USA am I right guys **** around can we do our show now okay I got to read the we're doing Subs right now and then we'll go no we have two more questions to read and then we will go to sub mode and then we'll get ready for the um I kind of feel like someone's talking **** over there do you guys realize how late it was it's it's fine guys I'm going into Uncle Nick how was your first workout with the Jackman-off sorry for suggesting that on Twitter and Darren running with it Drew Baka 1313 I worked out last night with a hulking of a man my good friend Yousef and I'm in pain",
            "start": 2646.56
        },
        {
            "text": "your first workout with the Jackman-off sorry for suggesting that on Twitter and Darren running with it Drew Baka 1313 I worked out last night with a hulking of a man my good friend Yousef and I'm in pain but I will be I'm going to start vlogging about it shortly I just needed to prove to myself that I had what it took to actually step into a gym with that Hulk and he broke me but it's fun it's going to be good it's gonna be good last what do we got what do you got I was going to say I went to the gym last night I was like I'm going to go play some hoops at the 24-Hour Fitness yeah the hoops courts were occupied the whole time they had games running the whole time so I just ran on the treadmill for like 30 minutes and then I peaced out good for you sorry about that that was very sad uh Mr. Mandrew says Australia the 51st state a lot of people don't know that it is it is Puerto Rico and Australia they're this they are the same uh region uh last we'll take the last this last comment right here",
            "start": 2688.28
        },
        {
            "text": "says Australia the 51st state a lot of people don't know that it is it is Puerto Rico and Australia they're this they are the same uh region uh last we'll take the last this last comment right here Pistol Play says Nick you guys ever considered having PhillyD, Boogie2988, or Markiplier on the podcast I don't know your relation to these guys uh we've had PhillyD on the podcast a couple times actually I think we did one with him uh two years ago at SDCC um we're friends with Boogie2988 I don't I don't think we know Markiplier but yeah we'd have anyone on they're they're great guys that's it Andy I'm done I'm freaking done we're done freaking done oh we got to read tips **** I apologize everyone if you've left a tip I will read it right now the show's going crazy Andy's talking **** everyone's talking **** Australia turns out as part of America if you love his tip we appreciate that like Noah Briscop says happy birthday Tim excited to jump into Crash after work hope",
            "start": 2724.76
        },
        {
            "text": "**** everyone's talking **** Australia turns out as part of America if you love his tip we appreciate that like Noah Briscop says happy birthday Tim excited to jump into Crash after work hope you have a fantastic day hello to Nick and Andy also best of luck on the Jackman-off Nick I love party mode Andy thanks guys awesome thank you for watching uh that's right new party mode went live this week right is it which one is Wednesday uh Mount Your Friends Mount Your Friends it's **** hilarious Glog Anon says Kevin thanks for letting Dudes in Space film a shout out video for me last week also I play Wildlands with you anytime just hit me up you're my spirit animal that's nice uh Pure Seduction 50 says Nick I heard a rumor that you'd like that you didn't like Baby Driver now my question is my question to you is how the **** do you not like this goddamn masterpiece of a movie Edgar Wright shuns you uh Edgar Wright does not know who I am I didn't dislike Baby Driver I just said it",
            "start": 2766.0
        },
        {
            "text": "is my question to you is how the **** do you not like this goddamn masterpiece of a movie Edgar Wright shuns you uh Edgar Wright does not know who I am I didn't dislike Baby Driver I just said it wasn't my favorite Edgar Wright film I just well I I liked it I like the film wrong with disliking something I like the film uh it's just again not my Edgar yeah uh Not The Why Way says Hey guys first time tipping but I wanted to ask Andy if he found any good breakfast tacos since he moved and I don't need breakfast tacos is there anything there that compares to the awesomeness of Barbacoa and Big Red Barbacoa and Big Red go a long way and I'm glad you pointed that out you got to try in Austin I think you're don't like a lot no you're not Moderately Comedic says day after my birthday tax happy birthday Tim been here since the beginning but name changes and forgotten to sub via Amazon is tough uh love the new stuff thank you very much guys and thank you for all those who remember to resub by Amazon I",
            "start": 2802.92
        },
        {
            "text": "been here since the beginning but name changes and forgotten to sub via Amazon is tough uh love the new stuff thank you very much guys and thank you for all those who remember to resub by Amazon I know it's a pain in the **** ass but it really does help thank you for your tips we appreciate that's it for tips that's it for the show makes me feel good next up we're going to take a little break go to standby we're going to reset for Kinda Funny Games Daily with Andrea and Tim we will be back not next week but the week after with all the popping off boys that you need to pop off where the pop culture news is popping and the cute boys are never stopping woo until then enjoy your weekend what what's going on next week next week we'll be streaming the new class we'll be streaming Kevin are you taking part in that yeah I think you and I will be in to stream right whatever the **** you want every day and Andy Monday and Monday and Wednesday it'll be me Kevin and probably Cool Greg and Joey Tuesday",
            "start": 2846.08
        },
        {
            "text": "taking part in that yeah I think you and I will be in to stream right whatever the **** you want every day and Andy Monday and Monday and Wednesday it'll be me Kevin and probably Cool Greg and Joey Tuesday I won't be there because I I I'm also on holiday that day great well everyone's on holiday it's American day that's why Hugh Jackman takes the day off cuz he's super American everyone I love you we see you soon thank you",
            "start": 2884.24
        }
    ]
}