{
    "id": 2715,
    "video_id": "DzQGyqUSdg4",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez"
    ],
    "title": "Kinda Funny Talks Over The Ubisoft E3 2017 Press Conference (Live Reactions!)",
    "description": "Kinda Funny give their live reactions to the Ubisoft E3 2017 press conference!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497304631,
    "duration": 4342,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to our watch-along for Ubisoft E3 2017 press conference. I thought Greg was getting intro this, but he didn't. No, not for the watch-along. So I'm pointing at you now to do it, but then you didn't do it. We're going to have a good time. Let's get hyped. Here we go. Andy Cortez is here too. Hey, I'm here. Have I really done them all? I thought you did them all the watch-along. I think you done all. I, I think Tim did them all. Tim has definitely done watch-along. Nobody find this on. I was going to say, if only you go to YouTube right now, look at the new logo. Everyone remember like when you, when you like didn't fall in love with Evelyn? Yeah, remember when you **** that one up for us? That sucked. Here we go. **** starting off with a bang. God damn it, you're right. Get it out of the way. Greg did it. I did do it. I did it for Xbox. I did it for the, the post. You do it for post. All right, now I got it. Kevin, ask you to rewind and I'll start. You missed, um, one of the Rabbids got his head. Look at this.",
            "start": 3.12
        },
        {
            "text": "It, I did do it. I did it for Xbox. I did it for the, the post. You do it for post. All right, now I got it. Kevin, ask you to rewind and I'll start. You missed, um, one of the Rabbids got his head. Look at this little goofy dude, little Goofer. Oh, **** man, I won't lie to you guys, I **** hate the Rabbids. Look how cute they are though. They are not cute. They are appalling actually. I wanted him to take the mushroom and if they were rabbits, I'd be fine with it. Hello everyone and thank you. We've always wondered what could happen if our crazy Rabbids were unlift upon the world of Mario. Did you really wonder that? Today you were alone in that. The dream is reality. And to talk about this unexpected encounter, it is my great honor to welcome a very special gu, someone I truly admire. Please, yeah, yeah, the homie. Oh yeah, always with the weapon this guy. What if he just stopped and like **** point playing blasted some in the face? We love him. We, we do love Miyamoto. Hip Hop, Get Up Stand Up, you piece of",
            "start": 47.16
        },
        {
            "text": "the homie. Oh yeah, always with the weapon this guy. What if he just stopped and like **** point playing blasted some in the face? We love him. We, we do love Miyamoto. Hip Hop, Get Up Stand Up, you piece of ****. Some, many of you aren't standing up. Andrea Rene, get up. You ain't standing up. And come on, Andrea Rene, show some respect. It's a **** legend on stage, guys, with a unique shirt. You like that ****? Yeah, you got us pimp the brand. Mhm. Thank you for coming. You're so happy to have you today. What a **** cool guy. What have you brought with you? What did you bring? Oh, the language barrier here is going to be great. Life-size replica. My Boy Bill, one of the weapon from this game. Life-size replica from one of the weapons in this game. I show you love it. I brought one for you. Okay. Oh, thank you. Bu training. Look atom a W. So don't do it. This is going to be some good Twitter ****. Let's go. Yeah, we thought they were going to be enemies, but by the end they were friends. Squad up, never roll alone. We go.",
            "start": 126.0
        },
        {
            "text": "look atom a W. So don't do it. This is going to be some good Twitter ****. Let's go. Yeah, loves it. He can have our conversation. Don't let me down, Nick Robinson. Give me some good Twitter content. These are a little bit different from the weapons you see in Ghost Recon. Yeah, very different weapons for very different worlds. Uh, this one is, I think, very effective in the the world of myON rabbit. So should do well. Let's **** see some gameplay, y'all. No, this is the gameplay. Hip Hop loves it. They got Hip Hop. I'm, I'm so proud of Ubisoft long-standing collaboration with Nintendo. You know, from the DS to the Wii and, uh, more recently for the impressive launch of the Switch. Always been and by all the great work you have been able to do. Yes, thank you very much for all the work that we've been able to do together over the years with Ubisoft. It's already been 5 years since you and I first met.",
            "start": 178.6
        },
        {
            "text": "the great work you have been able to do. Yes, thank you very much for all the work that we've been able to do together over the years with Ubisoft. It's already been 5 years since you and I first met. Offal title cre no Bill's King bit of pictures and videos and I've even messages. Apparently we're way too loud. So over the years, I've always felt the deep heartfelt passion that Ubisoft developers have for Nintendo and its characters. Crashes the stage. That would be awesome. N music hits that come in. But on the other hand, uh, because we're both software developers, we've also looked at each others as kind of rivals and and tried to see who could make the best software. Uh, but of course, I've known the Rabbids characters for many years and I have many Rabbids figures, uh, decorating my desk. Wow. So I've always been a fan of the characters and their humor. Uh, so since this project first started, I've been very excited to see what kind of humor the Rabbids could bring to the Mario World. There's literally",
            "start": 244.08
        },
        {
            "text": "been a fan of the characters and their humor. Uh, so since this project first started, I've been very excited to see what kind of humor the Rabbids could bring to the Mario World. There's literally nothing to show. Show the ****. So when I met Davide, who is the, uh, creative director of this game. Nice. Yeah, that's awesome. This he looking at Miyamoto right now. He's like, holy ****. When I met, I had just just one condition for this project sitting next. I said, whatever you do, don't try to make a a jump game or a Mario platformer. Try to make a Mario game that has never been made before. And it's great. And I, I can tell you, it was an exciting, very exciting challenge for all our teams. And I think we have done something you will love. So thank you very much for giving us the chance to to perform on this game. In the chat, Elliot9, we don't care. Show the **** Rabbids. And so, so of course, because the the game is being made in Europe, it has a very unique flavor to it. Um, and of course, Ubisoft is",
            "start": 328.52
        },
        {
            "text": "on this game. In the chat, Elliot9, we don't care. Show the **** Rabbids. And so, so of course, because the the game is being made in Europe, it has a very unique flavor to it. Um, and of course, Ubisoft is very good at making action games. Uh, but this game in particular has a great layer of strategy and tactics to it. Yeah, no, it's, it's going to be fresh actually. And so now let's welcome Xavier, you know, the the producer of the game and he will show us the game. So thanks again. Let's go. Thanks again. Thank Trav can get it. All right, stop it with the thick comments. Finally, finally, we can talk about this project for the first time. Nobody's talked about it. So we've been working on this game for more than three years now. And, uh, to be at E3 today on this stage is just, uh, super exciting. So what is this game exactly? So Mario + Rabbids Kingdom Battle is a tactical Adventure exclusive for the Nintendo Switch. And let's check right away some gameplay. Yeah, all right, here we go. Got a",
            "start": 399.64
        },
        {
            "text": "this game exactly. So Mario + Rabbids Kingdom Battle is a tactical Adventure exclusive for the Nintendo Switch. And let's check right away some gameplay. Yeah, all right, here we go. Got a Roomba. They're following the Roomba. So the Rabbids have been teleported into the, uh, the Mushroom Kingdom and it made the world completely unstable and chaotic. So Mario as a true hero wants to save the day, but this time with some new friends. And at first they don't really know each others, but in the end they will form this, uh, dream team that will potentially save the Mushroom Kingdom. There's a lot going on in this gameplay. Running around a lot, you know, exploring, making friendships. Maybe it was all about the friends we made along the way. Exactly. It's not, it's not, it's not about getting the game is a turn-based tactical Adventure game. Uh, combat is a really big part of the concept. Um, so you will fight wave after wave of Rabbid that somehow turn bad. And, uh, what we",
            "start": 480.2
        },
        {
            "text": "not about getting the game is a turn-based tactical Adventure game. Uh, combat is a really big part of the concept. Um, so you will fight wave after wave of Rabbid that somehow turn bad. And, uh, what we see here is just, uh, the very beginning of the game. So it'll be perfect to talk about the combat basics. Uh, so the two flags you see on the screen here is to tell you this is a battlefield zone. So you switch from exploration mode to battle mode. The blue zone is your zone of movement. So you move anywhere you want that Z. You know what I'm saying? You can also use battlefield ingredients such as, uh, covers for protection. So Rabbid Luigi here using half cover or full cover. And, uh, we also have what we call team jump. So by jumping on your teammate, you can expand your zone of movement. So here Rabbid Peach using Mario, she's able to flank the enemy. Get ****. So you can also attack the enemy behind that cover and expose them by destroying that cover. Um, you the WR neighbor really interesting in terms of",
            "start": 573.92
        },
        {
            "text": "using Mario, she's able to flank the enemy. Get ****. So you can also attack the enemy behind that cover and expose them by destroying that cover. Um, you the WR neighbor really interesting in terms of strategy because for next turns, you'll be open for attacks. And last but not least, techniques. So from defensive ones like, uh, Rabbid Peach's Shield Boost or offensive ones like Mario's Hero Sight, he's able to attack the enemy even if it's not his turn as soon as the enemy moves. So this is a very core aspect of the game itself. So you mix and match attack options, movement abilities, techniques. But we also have, um, other ingredients such as, uh, pipes, Rabbid Pipes. So those give you, uh, a good move to flank the enemy. So here, for example, Rabbid Luigi goes into the pipe, out of the pipe, dash the enemy, goes for Mario team jump, land behind the enemy in one single movement sequence, and then finish off the enemy. And what do we see, uh, here is actually an explosive cover. So those have many",
            "start": 623.52
        },
        {
            "text": "goes for Mario team jump, land behind the enemy in one single movement sequence, and then finish off the enemy. And what do we see, uh, here is actually an explosive cover. So those have many type of super effects. And this one was a push effect. So you can push heroes or enemies out of the, uh, out-of-bounds. So again, this is just a glimpse into the basics of the game. And as you progress into the game, uh, you have more tactic tools. You'll be able to do more combo setups. You'll be able to use different type of heroes, different type of weapons in order to battle your way through, uh, the kingdom. Boy, damn. Damn. **** combos. If I'm being honest, it looked really dumb walking around, but then the combat just XCOM. Still hate the Rabbids. My prediction was wrong so far. Okay, I predicted people would be pleasantly surprised. Speaking for myself, I was not. And that's just a a glimpse into the game itself. But, um, first and foremost, this is a project done with passion. The chat",
            "start": 690.0
        },
        {
            "text": "I predicted people would be pleasantly surprised. Speaking for myself, I was not. And that's just a a glimpse into the game itself. But, um, first and foremost, this is a project done with passion. The chat turned around when they started doing that. It would not exist otherwise. So we just can't wait for you guys to try the game at E3 this week. Uh, for those are not at E3, see online coverage and surprises. So have a great conference. Have a great E3. Thank you. I think that them just wanted to show off the environment and how like, how legit Nintendo they looked. You know, here we go. I'm calling it now. Bowser, he's going to turn his back on his people, side with the evil Rabbids. Oh God, horrifying. She didn't get uppercut her. HS Bear Thought says, thought it wouldn't be. Yeah, I know, right? Like locks on, bites into their bone, grasps their hand. Hly, I feel like starting with this might have been a bit wiser. She's an idiot. I kind of like her a lot. Look at Yoshi. Great.",
            "start": 779.28
        },
        {
            "text": "on, bites into their bone, grasps their hand. Hly, I feel like starting with this might have been a bit wiser. She's an idiot. I kind of like her a lot. Look at Yoshi. Great. If she did it though, just like blood splash back on. She has bloodthirst. They should have absolutely showed this first. You know, Chat, he lives. No dead. Here we go. Hero shot. Damn. Dog. Jesus **** Christ. Oh man. Ubisoft presents Assassin's Creed. What? What do you want? Prince. Hi, I'm Ashraf Ismail, game director for Assassin's Creed Origins. I've waited a long time to say that. Love. I want to see Yves Guillemot on stage. Almost 10 years ago, he come out with the, I, as many of you fell in love with a game. That game took us to the Third Crusade. And we fell in love again when it took us to the Italian Renaissance. Yep. Over the years, this amazing series has taken us to the American Revolution, the French Revolution, Victorian London, and of course, to the Republic of Pirates for",
            "start": 851.68
        },
        {
            "text": "took us to the Italian Renaissance. Yep. Over the years, this amazing series has taken us to the American Revolution, the French Revolution, Victorian London, and of course, to the Republic of Pirates for the 10-year anniversary of Assassin's Creed. **** was that for our fans, for ourselves, and for all newcomers, we wanted to go back very far back to show how it all began. Stoked with Mario + Rabbids. Really, the chat. I mean, it went from being really negative to being like, all right. We poured our energy, our talent, our passion into bringing the land of pyramids, pharaohs, and mummies to life. To bring ancient Egypt to life. I've always been a fan of Egypt character design. It fundamentally challenged just to reinvent what it means to be Assassin's Creed. And over the next few days, you will see, play, and feel this reinvented experience. It, I am in the chat. Zigger keeps saying, I was surprised him. Zigger, I could have told you you that **** game. Shen, the amazing Twitter po of a phenomenal team put it on the pole and",
            "start": 981.36
        },
        {
            "text": "experience it. I am in the chat. Zigger keeps saying, I was surprised him. Zigger, I could have told you you that **** game. Shen, the amazing Twitter po of a phenomenal team put it on the pole and thrilled to finally be able to show you this Beast we have been building. Without further ado, here is a taste of Egypt. S was that you? It sounded just like you. That really? Yeah, just like you. Woo! That's it. That wasn't me. It was I spell Rabbid right? Yes. Oh ****. All damn hippos. H. Yeah, think you can ride L. Still. So still your chain. All my blood is in pain. Feel like crocodiles are fre fighting crocodiles. Cause Sea of Thieves. Well, there Sea of Thieves. There was this and there was, um, wait, wasn't it shark and Sea of Thieves or was there a crocodile too? I mean, they're the same genus. Yeah, well, no, not the same genus, same kingdom. That a behind the back skill points. Oh man, that's a dope mask. Yeah, an Anubis mask. Thank you, thank you, thank you, thank you. Uh, as an extra treat, let's check in with",
            "start": 1037.48
        },
        {
            "text": "genus, same kingdom. That a behind the back skill points. Oh man, that's a dope mask. Yeah, an Anubis mask. Thank you, thank you, thank you, thank you. Uh, as an extra treat, let's check in with home base where we're going to get a glimpse of what you'll see right after the Ubisoft conference. Hey there folks, Chris Waters here at the home base with Annie Dwang and Karl Lu, producer on Assassin's Creed Origins at Ubisoft Singapore. Uh, Karl's here to give us a look at the gameplay of the game. We're going to be entering the open world. We've got a ton more to show you. But Karl, kick it off. Give us a little taste here. Yes, so here we are in the open world of of Egypt. This is the demo that we will be showing on the the show floor here at E3. Bayek is riding into the Fayum, one of the the regions in Egypt. This most southernmost region. It's a a beautiful area. See, we've come in from the desert moving towards this Lake Moeris. Let's have a little exploration around here using our Eagle Sense. Kevin is coolg",
            "start": 1137.32
        },
        {
            "text": "this most southernmost region. It's a a beautiful area. See, we've come in from the desert moving towards this Lake Moeris. Let's have a little exploration around here using our Eagle Sense. Kevin is coolg folling for. It's sunny on the lake and it's sunny on the monitor here. But folks, this looks really good. It's running on an Xbox One X. It will be giving you the gameplay feed after the show. We've got 30 minutes of that coming up. But, uh, let's see if we can see from bird's eye what any time you want to go to full screen on this looking into this military camp and tagging a few enemies. After after the show, we will infiltrate this camp and take it out either through stealth or combat or perhaps range weaponry. All right, if you guys want to see more of this, be sure to tune in right after the conference. Chris and I and Karl here will be right here. Ash will be joining us as well. You won't want to miss it. That 30 minutes live gameplay feed is coming up after the show. But for now, it's back to the",
            "start": 1202.64
        },
        {
            "text": "Chris and I and Karl here will be right here. Ash will be joining us as well. You won't want to miss it. That 30 minutes live gameplay feed is coming up after the show. But for now, it's back to the stage and on with the excitement. That's it for now. Thank you. A poet that just sit and wait for the camera. Don't, don't, don't break eye contact. Don't forget that you can watch this demo in its entirety after the conference, uh, live stream from our home base. And for those of you here at E3, please come to the Ubisoft booth where you can live this new experience of Assassin's Creed. Thank you very much. Look how complicated that all looks down there. October 7th on PlayStation 4, PlayStation 4 Pro, Xbox One, Xbox One X, PC 7th. Oh yeah, the corner. I'm really stoked for. You missed the whole. You miss Chris Waters. You know him. He's pet. You The Crew 2. Squad up. Hey, piece of chance. You never had your car. You never had your cat. Why did I make him like a Russian? You never have",
            "start": 1245.56
        },
        {
            "text": "the whole. You miss Chris Waters. You know him. He's pet. You The Crew 2. Squad up. Hey, piece of chance. You never had your car. You never had your cat. Why did I make him like a Russian? You never have your car. Wa. Oh ****. The Crew 1, a game that demoed really well that I was super stoked for. And then when it came out, I just was like, I never played. I always wanted to. I always wanted the idea. Me and Crew Racing around the world. Domin. That was real life. That wasent. That was from the demo. Someone so hyped about The Crew. Yeah, was is that a big? Yeah, it was a great idea. Oh my God, you can race on horses. Danger. Very dangerous. That looks like an actual real shot. Dusted him. Champion around it brilliantly. Now that's the skill wins. No matter what the engine, no matter what to track. Oh man, I got a good. I got to pee. He is this season's undisputed Motorsports Champion coming out of nowhere to rise to the top. King of all Motorsports. He does all of this. It's all",
            "start": 1297.16
        },
        {
            "text": "to track. Oh man, I got a good. I got to pee. He is this season's undisputed Motorsports Champion coming out of nowhere to rise to the top. King of all Motorsports. He does all of this. It's all one man, man. No one man. Dale Earnhardt Jr. This is a cool trailer. Yeah. Pull up, pull up, pull up. Thank you, thank you, thank you. Two years back, The Crew took the driving genre out there to the big wide open world of the USA. Thanks to our players, we have taken this iconic vision to the next level. They showed us what they liked and what they wanted to see in the futures. Now it's time to take it way beyond driving. I am Stéphane Beley, director. This is The Crew 2. Yeah, hold for applause. No applause. ****. Thank you. Yeah, in the US, Motorsports are louder, bigger, aggier than anywhere else in the world. Drivers and fans meet across the country. I get it. And cele. I just don't get how 2017 there's still press conferences like this. Now your chance to. Great trailers, ladies and",
            "start": 1401.8
        },
        {
            "text": "anywhere else in the world. Drivers and fans meet across the country. I get it. And cele. I just don't get how 2017 there's still press conferences like this. Now your chance to. Great trailers, ladies and gentlemen, this welcome to MotorNation. All he want to do is say a little bit to him. Just give him his moment. It's not nearly as bad as last year with the interview. **** had anything there. Uh, add nothing that we didn't see in that. True. Actually, no, he did not add anything. That's a good point. Add some Lorde now. And Lorde's new album, Melodrama, in stores now. All right, she's not paying you for anything. Don't say that. Now it's funny. Andy came back as soon as that guy came off the stage. I've never seen him and that guy in the same room. What I miss? You miss a dude on stage being a dude on stage in a press conference. You become the king of all Motorsports in this game. Oh, I mean, jack of all trades. Always been a fan of the the white letter boxing. He's a little bit more style hype.",
            "start": 1517.08
        },
        {
            "text": "on stage in a press conference. You become the king of all Motorsports in this game. Oh, I mean, jack of all trades. Always been a fan of the the white letter boxing. He's a little bit more style hype. William Street Racers prove their skills skidding on rooftops, burning asphalt, and tuning their right. This is now I've seen you both in the same place. Not the same guy. Here's my thing, guys. Racing and driving game and driving cars and games is fun, right? But like, I **** love doing it in GTA V and and I could do so much more in those games too. You know, solid the striking beauty of N. Yeah, I mean, but that's me coming from like someone who doesn't love racing games, right? But now you can be the king of all Motorsports. Yeah, all Motorsports. First, Motorsports: Speedboating. Those weird little planes. Biplanes. Is that what they are? I know. No, biplanes indicates two wings, right? Yeah, little planes. Then little planes. I think that's our official name. Little plane, sport plane. What not. This isn't a good trailer either.",
            "start": 1576.44
        },
        {
            "text": "what they are. I know. No, biplanes indicates two wings, right? Yeah, little planes. Then little planes. I think that's our official name. Little plane, sport plane. What not. This isn't a good trailer either. Unpredictable waves on the open ocean. G make waves or narrow rivers. I think you're talking about the literal N.W. Look super cool. People say this game isn't great. I will say water. You talking about water. Go, go back to the bathroom. I get it. Thanks, thanks. The shot though. Still going. Fearless Pilots rules the skies. Spin between buildings, through the clouds. Bring back the Rabbids. Turning perspectives. 838 votes right now. Uh, Mario + Rabbids. Yay. Is winning 55 to 45%. Wow. This is just plain cool. Oh my God, that was good. That was good. Thanks. Oh, I think these are stunt planes. What what they call? Art Alex says, but can you walk? This is a good question. Yeah, I do like the wide letter boxing. T. No, thank you. All across the country. High octane contest await you. Take the lead on MotorNation. I don't",
            "start": 1653.2
        },
        {
            "text": "Art Alex says, but can you walk? This is a good question. Yeah, I do like the wide letter boxing. T. No, thank you. All across the country. High octane contest await you. Take the lead on MotorNation. I don't know. You've had a glimpse of The Crew 2. Register now for beta access or play the demo at the booth. Experience for yourself. It's come on. Culture yourself. It's not that hard to understand, right? It was hard for me there. I'm sorry. You're just like pill. You're a racist too. No, I'm not a racist. I know. Everybody calm down. Jeez. And we're making fun of Andy. Hear me for the comments. Here we go. All right, Undertaker. I use that same effect for Kinda Funny Live 3. Undertaker game. Your entrance, right? My entrance. Video Blocks. Not Video Blocks. Video. Here we go. Started one team. We all wanted to be superheroes for the same reason. You're a traitor, Tweek. And now you're with a group of super traitors. This was started by you. We aren't the ones who walked out of the **** franchise. Mion. Why would the Freedom",
            "start": 1737.09
        },
        {
            "text": "for the same reason. You're a traitor, Tweek. And now you're with a group of super traitors. This was started by you. We aren't the ones who walked out of the **** franchise. Mion. Why would the Freedom Pals help us? We send a spy. Someone in our group who pretends to want to switch sides and join Freedom Pals. Somebody who they don't know very well. All is fair in Love and War. Freedom. **** you, **** animal. You've got problems. New kid. Whatever you did last night got a lot of people's attention. Bad people. If you need information, just know you can rely on Call Girl. Who the **** is that? So I guess now any **** **** thinks they can be a superhero. We're going to rip you apart, dude. Mysterion is pissed at you, new kid. Hello, Toolshed. Toolshed is a Gadgeteer class, Visionary archetype, and a butt **** traitor. Eric, you must listen to me. Get out of my head, Timmy. Your franchise is going nowhere. Face the truth, Eric. You guys are kind of douchebags. He just caught his douchebags in my mind.",
            "start": 1829.08
        },
        {
            "text": "**** traitor Eric, you must listen to me. Get out of my head, Timmy! Your franchise is going nowhere. Face the truth, Eric, you guys are kind of douchebags. He just caught his douchebags in my mind. He did. South Park: The Fractured But Whole, available October 17th. Can't wait. Don't show anymore. Or sold. Now that is a turn-based game I will be playing. I see one phone in the lower. Okay, you know I like their new logo now. It's grown on me. Yeah, I'm in. I want their old logo. There was a sort of synergy of, well, we're looking to do something interesting in VR and we've got this vision and you're looking to sort of bring, you know, what sense you have storytelling within and put that into the context if you are. You can for the first time as a player feel like you are in a movie. That's a really good word for it. We want you to take off the gear and still feel unsettled. He's a big fan of horror stuff. Oh boy. Whilst working with Ubisoft, we stumbled across Ross, some fascinating research that had",
            "start": 1887.6
        },
        {
            "text": "for it. We want you to take off the gear and still feel unsettled. He's a big fan of horror stuff. Oh boy. Whilst working with Ubisoft, we stumbled across Ross, some fascinating research that had begun in the late 90s. Essentially, neuroscientists had figured out a way to upload brain data, trauma, emotions, memories to the digital space. Now we've gone and taken the next logical step and with Ubisoft, we've recreated in virtual reality one such test subject. So we'd like you to come and join us and experience the Walter test case for yourself. Black Mirror the game. Yeah, right. Call Mom. Mom. Mom. Mom. What you're experiencing is a recorded consciousness. It's not unlike watching a movie. So no matter how real it may seem, it can't hurt you. You are completely safe. We're completely safe. Don't think we're completely safe. That's cool. Available now. Spring 2018. That's not now. That looks **** cool. Like I don't know what it is exactly, which is a problem. Yeah, I love VR games that don't",
            "start": 1960.44
        },
        {
            "text": "don't think we're completely safe. That's cool. Available now. Spring 2018. That's not now. That looks **** cool. Like I don't know what it is exactly, which is a problem. Yeah, I love VR games that don't show me what they are at all. But it did look. Sounds cool. Yeah. And now I'm happy to share a new surprise with you. Building on the legacy of one of our most popular worlds, the super talented teams of Ubisoft Singapore came up with something really, really unique. So I want you to see that and enjoy. Thank you. Men from all over the world sail the treacherous trade routes of the Indian Ocean. The riches in their holds fuel their dreams of power and fortune while wetting the appetites of those they fear most. Pirates. Not George Washington. Not Marie Antoinette. One by one, our hero, Small Mar, is a hero for you. Six knots, sir. Six knots. Go them slow. Aim at the mark. Fire! Ship just got real. I'm **** killing it, guys. Straight up. Oh my God, it's Baby",
            "start": 2043.68
        },
        {
            "text": "by one, our hero, Small Mar, is a hero for you. Six knots, sir. Six knots. Go them slow. Aim at the mark. Fire! Ship just got real. I'm **** killing it, guys. Straight up. Oh my God, it's Baby Jones. We don't want to **** with them. Uh-oh. Man, he doesn't give a ****. He's not even wearing clothes. It's pretty cool. Oh **** the enemy and the enemy. Do you think this is for all the people who are like, man, Black Flag was **** cool? Yes, 1,000%. Crazy. Skull and Bones. It's a pretty cool name. Heaving on the Ocean is what they should have called it. 100 days. That's how long the average pirate survived a lawless life on the seas during the Golden Age of Piracy. I'm Justin Farren, the creative director for Skull and Bones, and this is your chance to not just survive, but to climb the food chain and surpass the legend of every pirate who ever sailed the high seas. Since bringing innovative naval combat to Assassin's Creed, we at Ubisoft Singapore have",
            "start": 2148.88
        },
        {
            "text": "just survive, but to climb the food chain and surpass the legend of every pirate who ever sailed the high seas. Since bringing innovative naval combat to Assassin's Creed, we at Ubisoft Singapore have set out to bring you the ultimate pirate experience. A tactical action game where we take that naval combat to the next level, mastering the ocean and its winds at the helm of ships armed to the teeth. Skull and Bones takes place in a shared systemic world where you can sail solo or form a gang of pirates with your friends and together terrorize the trade routes of the Indian Ocean. Season after season, you'll collaborate and compete with other bloodthirsty players, ruthless betrayals in order to become... I just want to be a pirate single player world, you know what I mean? Now I'm proud to share with you the one of Skull and Bones' five versus five team-based PvP modes. Right on. Right. We've just received intel that merchant convoys rich with treasure are sailing just off the coast of Madagascar, but beware,",
            "start": 2298.36
        },
        {
            "text": "the one of Skull and Bones' five versus five team-based PvP modes. Right on. Right. We've just received intel that merchant convoys rich with treasure are sailing just off the coast of Madagascar, but beware, there are other pirates also looking to plunder the PvP disputed waters of the Indian Ocean. The Prelis Shallows of Madagascar, located on the cusp of a bustling trade route, it is the perfect place for an ambush. Here is our gang of pirates, The Raiders, going head-to-head with a gang of rival players, The Cutthroats. Victory goes to the team with the most loot at the end of the hunt. Are we ready for a hunt? Knowing how to sail with the wind is a pirate's most precious skill. Use the winds to increase your speed or to position yourself for tactical advantage in battle. To reap the most rewards, it is best to split up. God, this looked cool up until all this. God, this looked cool up until all this. Each warship has unique strengths. The frigate's hull is reinforced. Its arsenal",
            "start": 2353.32
        },
        {
            "text": "to reap the most rewards, it is best to split up. God, this looked cool up until all this. God, this looked cool up until all this. Each warship has unique strengths. The frigate's hull is reinforced. Its arsenal equipped with numerous culverin cannons. The Brigantine is devastating up close with a battering ram designed to break any resistance. What aren't you digging about it? The Sloop of War from afar with its crippling long-ranged mortars, cannons. Complex, in-depth multiplayer experience. Here I was, I was totally with Tim when I watched her. Oh man, they're just doing Black Flag again. Single player. New. Okay, that. Get to team up and all my own pirate ship. It looks like it's everybody has a role. Open fire! Nothing will save you now. I guess I am controlling their ship. That looks like... wait, maybe not. Think you're controlling several ships and switching. Don't let bloodlust names are on the ships, right? So it looks like for the loot and so your... we're ganging up. So I'm a ship, you're a ship. The team that",
            "start": 2424.88
        },
        {
            "text": "you're controlling several ships and switching. Don't let bloodlust. Names are on the ships, right? So it looks like for the loot and so your... we're ganging up. So I'm a ship, you're a ship. The team that escapes with the most loot claims victory. Searching for more targets on the horizon, our Sloop of War spots a rival pirate ship further inland. Fire! With its heavily reinforced hull, our frigate swoops in to save the day, bearing the brunt of the damage. Fire! Me another day, another victim. Our gang of pirates is four in chat. For Honor with both equals. No, to take her down. Hold tight! That ship's badly damaged. They're killing. We can take your ship with the enemy ship's broadside now vulnerable. Our frigate rushes in to board. No, taste of black and silver. Fancy snotting some fish? His back looked very dirty. Okay, good. Good call. We've got Pirate Hunters. It's the Le M. Rock is away. Pirate Hunters have been sent in, signaling the end of the hunt. They target the pirates with the most stolen loot. Time to",
            "start": 2489.72
        },
        {
            "text": "okay, good. Good call. We've got Pirate Hunters. It's the Le M. Rock is away. Pirate Hunters have been sent in, signaling the end of the hunt. They target the pirates with the most stolen loot. Time to make our escape, Captain. Or we have good for the news. Sail ho! Full Tilt! The Pirate Hunter defenses are so strong that the only option is escape. The Brigantine is sacrificing herself to buy time for the frigate who carries the most loot. Incoming fire! The frigate now needs to make its escape through the reefs. The water looks great though. Successful pirates know when to run with their holds full and the wind at their backs. Jason, very much. I'd like to invite you to play the loot hunt at E3 and please register for our live phases online. Oh, and one thing I forgot to mention, the world of Skull and Bones is one that evolves. When you act, it reacts. That if I did not kiss the girls, my lips would grow a moldy where",
            "start": 2602.6
        },
        {
            "text": "oh, and one thing I forgot to mention, the world of Skull and Bones is one that evolves. When you act, it reacts. That if I did not kiss the girls, my lips would grow a moldy where away. Oh my God, ghost ships. Whoa, did you see that? I did. Hard to believe. It's like a big squid. That looks **** cool. It used to be everywhere. That's the most exciting thing about this game. The big squid. Fall 2018. Oh my God, it's a good ways off. Yeah, they showed a thing of like a crash boat and then like an aerial view of like a giant. Guys, I think it's Just Dance time. I like their video. All assets. Yeah, pretty cool. Every game has a different. No, I'm just talking. No, don't just talk now. While Sub-Zero on stage. What? While this pops off, Andy, are you hungry? Yeah. Kevin, you want to get us order some pizza pies? You're ready? Okay, good. Some Wing Wings. Not Wing Wings, but Wings. Here we go. Favor. Are you kidding me? **** Bubble Pop. Let's Get Hype, boys. This one",
            "start": 2704.92
        },
        {
            "text": "get us order some pizza pies. You're ready? Okay, good. Some Wing Wings. Not Wing Wings, but Wings. Here we go. Favor. Are you kidding me? **** Bubble Pop. Let's Get Hype, boys. This one of the greatest music videos of all time. Yeah. Do yourselves a favor. Stop watching this ****. Go on Twitter. I just tweeted at me from Rob Barry. I want to play a game, a pirate game like Black Flag. You be okay. Here's a multiplayer game where you play as a boat. Who's in the panda? The Orioto doing a dab. I'm not the most pretty. I'll live. Never sing like, 'But I wanna dance with somebody. I just want to dance with somebody. I just want to dance with somebody. I just want to dance with somebody.' Good for her for not lip syncing. Kind of like us. Was a good question. Never heard. Heard song. 'I just want to dance with somebody. I just want to dance with. I just want to dance with somebody.' Maybe she's one of them newfangled artists that everybody's into. All right, but where's the P? Hey,",
            "start": 2796.08
        },
        {
            "text": "just want to dance with somebody. I just want to dance with. I just want to dance with somebody. Maybe she's one of them newfangled artists that everybody's into. All right, but where's the P? Hey everyone, I'm Bebe Rexha and Just Dance 2018 this October on all consoles. She's a... she's a girl that's saying 'Me, Myself & I' with G-Eazy and Bebe Rexha. You use it as a telephone. You use it as a camera. It's your music player, your flashlight, calculator, and GPS navigation device. But now, finally, the most company in the world has unlocked the mobile phone's true potential so that it can do what it was truly meant to do. We are playing Cowboys and Indians. Whoa, hey new kid, we need you to come play with us. Put on some cowboy **** and meet us outside and bring your phone. They make 'waa waa'. We're playing Indians. Dick hole. Inuits are technically Native Americans. This new kid puts me to shame. Woo woo woo. These guys, a new ****. New kid Phone Destroyer. I don't care about mobile games, but that, I mean, yeah,",
            "start": 2902.52
        },
        {
            "text": "hole. Inuits are technically Native Americans. This new kid puts me to shame. Woo woo woo. These guys, a new ****. New kid Phone Destroyer. I don't care about mobile games, but that, I mean, yeah, I'll play that. I love South Park. We're going to space. Finally, Assassin's Creed in space. No. Atlas, Jewel of the Pleiades. Avatar. No. No. Atlas Nova took us to the stars. Each new world more incredible than the last. We had no idea what was waiting for us. The Legion. It consumes everything in its path. Some Destiny **** right here. Like Horizon, Destiny ****. They never used Starlink before. Go show them what it can do. Whoa, what the ****? Okay, let's do this. Come on. Come on. I got it. Chase, how's it going? Breaking atmosphere. They're like, all right, the Skylanders kids, they're growing up. I was saying like, you can see it at a conference room. All right, guys, Vandy's coming, breathing down our neck. We need some big hits. Toys to life has some legs left in it. Judge, we need to buy time for me to jump start the",
            "start": 2986.88
        },
        {
            "text": "you can see it at a conference room. All right, guys, Vandy's coming, breathing down our neck. We need some big hits. Toys to life has some legs left in it. Judge, we need to buy time for me to jump start the engine. They are resisting. Ice barrage. Linking fire. Load out. Oh, that was on a 360 controller too. All right. All right. We're up against impossible odds, but together we will adapt and overcome. 2018. It's on everything. I mean, okay, like, cool. That looks **** like, wow, that looks **** cool. I don't know. I'm not about it. I just love sci-fi ****. D. Hi, I'm Matt Rose, producer at Ubisoft Toronto. Like many of you, I grew up in the 80s, obsessed with sci-fi animation, comics, talking to you, D, and of course, all the really cool toys. Born in '88, we're Ubisoft Toronto. We built a team with a dream of bringing those amazing childhood memories back to life for a new generation. Starlink: Battle for Atlas allows you to take control of a team of star pilots in a massive open living star system, fighting to save",
            "start": 3103.56
        },
        {
            "text": "those amazing childhood memories back to life for a new generation. Starlink: Battle for Atlas allows you to take control of a team of star pilots in a massive open living star system, fighting to save Atlas from the Forgotten Legion. Build your custom Starship and then adapt to new challenges on the fly. Link extra armor and heavy weapons to take on a huge Legion Prime. Search for ancient secrets lost on the worlds of Atlas or outrun Outlaws through an asteroid field. Freedom is at the core of Starlink: Battle for Atlas. Collect your way with both physical Starship Collectibles and digital versions available and even take your game on the go using the power of Nintendo Switch. Visit starlinkgame.com for more information and stay tuned for many more surprises over the coming months. Thank you. That's 100% a game I'll play on Switch. You won't play that game. Yeah, well, prediction, you won't touch that **** thing. Be awesome if they came out and just act like Steve",
            "start": 3178.08
        },
        {
            "text": "thank you. That's 100% a game I'll play on Switch. You won't play that game. Yeah, well, prediction, you won't touch that **** thing. Be awesome if they came out and just act like Steve hadn't come out yet. Yves, it's a pleasure for me to be back on stage after our announcement at E3 last year. And we have had since then a full year of support and continuous development of Steep. Since the very beginning of this project, we have been working with athletes and we have always been impressed by their passion and dedication. We learned how one champion spent 300 days a year on a trampoline to practice for that perfect landing. We learned how others make more than 6 million turns to practice for the 15 they have to race in competition. These athletes, they travel to the world to train with the best, to compete with the strongest, and to challenge themselves with the most experienced and skilled coaches. 8 million half-pipes. A level of passion and dedication that goes well beyond our everyday",
            "start": 3242.48
        },
        {
            "text": "best to compete with the strongest and to challenge themselves with the most experienced and skilled coaches. 8 million half-pipes. A level of passion and dedication that goes well beyond our everyday lives. And when you talk to the very best of these men and women, you realize that there is something they always have in back of their mind to at all times. It's a dream that takes years of preparation for just one go at that unforgettable moment. That's weird. This December, with our first Steep expansion, this is a journey you will take. Enjoy. 48 million tailspins. The most overused song in video games. Even know 'Warriors' by Imagine Dragons, the League of Legends theme song. Gotcha. My good friend, my good friend Christian was trying to think of the name of Imagine Dragons. He was like, what's the name of that band? Unicorns Forever. Oh my goodness. No, we are losing our mind. This is the B.O. right now. Very true. A lot of volumetric snow. There you go, Andy. I'm",
            "start": 3309.96
        },
        {
            "text": "name of that band. Unicorns Forever. Oh my goodness. No, we are losing our mind. This is the B.O. right now. Very true. A lot of volumetric snow. There you go, Andy. I'm loving these graphics packages. They're so good. Yep. I walk through the valley. My name is K. Dune Buggy Guy, drinking Mountain Dew. Come shoot the boss. He's the final boss, man. All right, let's go. 'I once was lost, but now am found; was blind, but now I see.' The starlight. They're all matching. Hi, my name is Dan Hay, and I'm the executive producer of Far Cry the brand, as well as the creative director of Far Cry 5. I'd like to introduce you to Hope County, Montana. Vast, beautiful, rugged. A place where people don't even lock their front door anymore. But that's how it used to be. Today, Hope County's been overrun by a fanatical cult. You find yourself trapped deep in cult territory, cut off from the rest of the world. They've closed the roads. There's no cell",
            "start": 3385.48
        },
        {
            "text": "how it used to be. Today, Hope County's been overrun by a fanatical cult. You find yourself trapped deep in cult territory, cut off from the rest of the world. They've closed the roads. There's no cell phone signal. No 911. People are **** scared. I had to say it. And just up ahead, the small town of Fall's End has been completely overrun. If you're going to survive, you and your Guns for Hire are going to need to save it. But to do that, well, you're going to need to raise some hell. All right, here we go. P.O.D. It's like you... he said 'raise some hell'. And if this game has any devil vibes, I'm not in. I'm free from sin. You've been saved. Mhm. Shut up, Willie. Shh. We got Piggies. The ease of this. Jesus. The church town looks like a war zone. Oh, didn't get that in time. Did not get there in time. What he want me? Water tower. Got it. Cool. Come down here. Here's my Magnum. Put a scope on my Magnum. It is he who will lead us to eat. And souls do not harvest themselves. So weighing me, you will be. I'm in position. You will",
            "start": 3541.0
        },
        {
            "text": "me water tower. Got it. Cool. Come down here. Here's my Magnum. Put a scope on my Magnum. It is he who will lead us to eat. And souls do not harvest themselves. So weighing me, you will be. I'm in position. You will be led. You will confess your sins. You will be told. For only then will you walk in the light of our father and be delivered. Boom boom. **** boom boom. Behind you. Bang bang bang bang. Going to need more help. I love the way you walk and I love the way you knock me off my feet. Looks like you can use some help. Target a ****. Optimus Prime. Transformer for Hire. Co-op friends for hire. Very cool. Oh my God. God. Some Twisted Metal ****. Oh, get ****. Yo, the All-American softball bat. Man, always that one iPhone. That one too. Jesus, get off your phone. I love when they do this **** up playing their videos. No, they're building the anticipation 'cause it's a new game. M.O. This Beyond Good and Evil. What the **** is your master? I don't deal with domesticated. Hey, the ****, I ain't got no",
            "start": 3639.56
        },
        {
            "text": "their videos. No, they're building the anticipation 'cause it's a new game. M.O. This Beyond Good and Evil. What the **** is your master? I don't deal with domesticated. Hey, the ****, I ain't got no master. But I do have your little toy. Show me the Idol. Show me the Redeemer. Here you go, mate. Hey, hand it over. I got a hot date who don't do late. Monkey's got a date. What? What? What? What? That's Swiss **** chocolate pig, bet you know, baby. I want every **** cop in this **** city after that **** bastard. Grab my chassis. Now, easy peasy, bro. **** **** **** me. Damn. Do it. Woo! It's like a gorilla's music video. Says 'Holy flare, holy flare'. It's true. I can't believe they're showing this. This is ridiculous. It's about bloody time. Let's see what we've got. Exclusively on PlayStation 5. Exclusively on Nintendo. Described it. True freedom lies beyond. Beyond Good. Say it. Beyond Evil. They did it, huh? They **** did it. But",
            "start": 3786.04
        },
        {
            "text": "time. Let's see what we've got. Exclusively on PlayStation 5. Exclusively on Nintendo. Described it. True freedom lies beyond. Beyond Good. Say it. Beyond Evil. They did it, huh? They **** did it. But give us more. They've done this before. Yeah, they've showed us the CG trailer before. They're like, ****, finally. ****, finally. Thank you. Thank you very much. 10 minutes ago, Marty tweeted, 'If the Ubisoft conference closes with Beyond Good and Evil, I'll eat my goddamn coffee mug live on air.' And now everyone is freaking out. Thank you. First of all, I want to say a big thank you to all the teams who worked very, very, very hard on creating all this, all this world. Uh, again, thank you to all these, these teams behind us. I want also to say thank you to Yves with all my heart. Now finish the **** game. Thanks, Yves, for making this happen. This is, this is just amazing. Uh, and also a special thanks to the fans of Beyond Good and Evil for sticking with us for so long. It's about",
            "start": 3967.84
        },
        {
            "text": "the **** game. Thanks, Yves, for making this happen. This is, this is just amazing. Uh, and also a special thanks to the fans of Beyond Good and Evil for sticking with us for so long. It's about bloody time. 15 years almost. So welcome to System 3. Our story takes place before the birth of Jade in a multiethnic, multicultural human society in a distant solar system. It is a time when corporations create hybrids in their labs and enslave them to colonize the stars in order to compete for power and cosmic resources. With our crew of crazy and unforgettable characters, we fight in the name of freedom and the right to determine our own fate among the stars. And we will helm massive starfaring vessels through territories as spectacular as they are dangerous. We've been working very hard, um, just on the technology during three years. And today we have a seamless online playground where we can travel across space at the speed of light. We can explore mysterious cities and discover unknown",
            "start": 4064.2
        },
        {
            "text": "just on the technology during three years. And today we have a seamless online playground where we can travel across space at the speed of light. We can explore mysterious cities and discover unknown lands by ourselves or with friends. And we want you to participate in the making of this great adventure. Join our Space Monkey Program today and help us make Beyond Good and Evil a world that will challenge us and bring us together for a thousand adventure thrills and fun. And please, if just join us. This is thank you. Get on up there, big old Yves. They can't end like this. Congratulations. You, yes, you know, Gabrielle and Michel, you've done a fantastic job. It's amazing what, uh, I've been... you have been able to achieve. And you and I, um, and all the teams, um, have the power of creating games that will amaze all the gamers. And I think video games can help us to grow and to get better. So thank you very much. You're never going to see congratulations. Thank you. Thank you. Oh man. So now I would like to thank",
            "start": 4140.2
        },
        {
            "text": "gamers. And I think video games can help us to grow and to get better. So thank you very much. You're never going to see congratulations. Thank you. Thank you. Oh man. So now I would like to thank everyone here in the room and those who are watching us from home. Thank you for listening today and thank you for playing our games. So to all the teams at Ubisoft, thank you for your incredible imagination and enthusiasm. All of us here, you all a lot of fun playing games this year. So thank you very much and have a great E3. That's totally like a Final Fantasy VII thing. Here's this thing. No, man, it's not going to be here for a while. It's different. Final Fantasy. No one ever actually thought they were going to see. Sure, this we've seen before. Like, you can't bring this back. And this is like Lost Guardian. Wait, look. Most importantly, holy, it's not over. The show is not over, folks. We're going to send you back to the home base behind the theater. We have 30 minutes of an exclusive. What is it? I lost it.",
            "start": 4211.76
        },
        {
            "text": "wait look most importantly Holy it's not over the show is not over folks we're going to send you back to the home base behind the theater we have 30 minutes of an exclusive what is it I lost it Assassin's Creed Origins exclusive gameplay 30 minutes right now let's go back to home base outside the theater thank you for watching It's Not Over stay tuned holy **** Oh my God hey there folks all right that's the end of our live stream get out thank you for watching uh youtube.com/KindaFunnyGames later this uh live stream we our reactions and things now we're going to do the post show which of course we do on twitch.tv/KindaFunnyGames you should come over there to check out all the conferences 30 minutes before pre-show we watch along with you like you just watched here and then we do a post show post show gets posted to youtube.com/KindaFunnyGames too so you can catch it there it's a Gamescast it goes up on MP3 services and YouTube but until next time thanks for watching this live",
            "start": 4284.4
        },
        {
            "text": "do a post show post show gets posted to youtube.com/KindaFunnyGames too so you can catch it there it's a Gamescast it goes up on MP3 services and YouTube but until next time thanks for watching this live reactions to the Ubisoft 2017 conference",
            "start": 4327.88
        }
    ]
}