{
    "id": 2696,
    "video_id": "edsdNV2U2WY",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "E3 Xbox Predictions 2017 - Kinda Funny Gamescast Ep. 123 (Pt. 3)",
    "description": "We predict what will be shown at Microsoft's E3 2017 conference.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1496838601,
    "duration": 1738,
    "transcript_chunks": [
        {
            "text": "All right, topic three, Microsoft. All right, this is going to be a fun one. Kick it off, Greg. I mean, are you ready? Cause I'm bringing the thunder. This this is the one where I'm going to I'm going to turn heads and I'm going to be right on a lot of this. Okay. Uh, guess what's going to happen. The developers from Supermassive will come out on stage and announce their next game and it will have a window of Xbox exclusivity. These are the Until Dawn guys. Yeah. Is it a sequel to Until Dawn though? No, new IP, new game. We're coming out. We want. Oh, no, Sony owns Until Dawn. Oh, Dawn, go to the PlayStation conference. That's a great game that I want to see. I'm on too. How about this though? Supermassive, they said earlier that, you know, like a year ago, they want they wanted to go multiplatform. They wanted to reach more people. I think this is their chance to do it. I think Xbox has the money to throw behind it. Be like, hey, guys, we're the ones who brought you on Until Dawn or the horror game so many people like",
            "start": 0.13
        },
        {
            "text": "more people. I think this is their chance to do it. I think Xbox has the money to throw behind it. Be like, hey, guys, we're the ones who brought you on Until Dawn or the horror game so many people like, we're this is our new thing where it's going to come here and it runs best on Scorpio. Yeah, we're going to hear that a lot. Oh, yeah. Okay. Should we get into the hardware already? No, I'm not. I feel like I've poached too much of that stuff already. See if these release they yeah, that's a good point. Better they they have to get that game out. What do you what do you think it is going to be earlier like August? I could say August. Yeah, August or September. That sounds good. That sounds good. I think they just need to get that game out there. Like they they need exclusive games. They need to pave the way for more more excited exclusive games. I think that's probably going to come up in the next little bit. Uh, and that that's like part of the old thing that they just need to get it done, get it out. Yeah. Um, well, I'm",
            "start": 56.2
        },
        {
            "text": "excited exclusive games. I think that's probably going to come up in the next little bit. Uh, and that that's like part of the old thing that they just need to get it done, get it out. Yeah. Um, well, I'm not waiting to poach. I'm I'm poaching. Uh, so I think they're going to obviously give a price point for Scorpio. I think I think the base model is $449. Premium model up to $5.99. Ooh, it'll depend on a hard drive size. Okay. The bigger the hard drive, the bigger the price, the bigger the price tag. What they say? I think that $449 feels like a good price. They can't come in at 500 as their base model. It's too high. 400 is too low for them to make money on this. $449 feels right. Yeah, that makes sense. But they will have a premium version for more expensive. That's interesting. The idea of them have because the messaging on on Scorpio's already is a little bit tough for them because it's like an iteration. So having an iteration on an iteration would be a tough one for them to do. But that does sound yeah",
            "start": 91.44
        },
        {
            "text": "the messaging on on Scorpio's already is a little bit tough for them because it's like an iteration. So having an iteration on an iteration would be a tough one for them to do. But that does sound yeah. Teraflops though. Dem Teraflops. Oh, man, it's it's all about flopping like to Howard. Super excited about it. Fling like a be their slogan goes in opposition to yours. Oh, okay. 400 November. It is called the Xbox One Elite. Oh, okay. What do you guys think it's going to be called? I think that's a that's a nice guess. I think they're already using Elite for their um, oh, yeah, the controllers, right? Right. Which is why I think it makes sense. And especially the 360 Elite. There's legacy with it. Um, I think you're wrong about that $400 price point because it makes makes it like that. I mean, I I just think you're wrong. Uh, but I think um, yeah, it's we're going to get a name. It's not going to be called Scorpio. We're going to get an official all right name. Yeah, to be fair, I think that your 450 makes a lot more sense",
            "start": 144.32
        },
        {
            "text": "uh, but I think um, yeah, it's we're going to get a name. It's not going to be called Scorpio. We're going to get an official all right name. Yeah, to be fair, I think that your 450 makes a lot more sense, cause I think 500 is just too high, uh, for what this is and for Xbox's uh, place in the market space right now. But I I wouldn't have thought of 450 and I didn't want to change mine. So I'm sticking to what the prediction says, cause I'm a fair player. But I 450, it sounds like such a weird number to put out there. But I think that 449. Yeah, okay. Okay, you're right. I do think that it's going to be like the my real safe predictions that, but it's under 500 because or else I think they're shooting themselves in the foot in a way that they can't. All right, so are you copying my prediction? No, I'm sticking to the 400 for the that was real price. Right. Right. It's like, do I want to get in on this train or do I want because I have Scorpio prediction, right? But I had six here. I think a lot of them are really good.",
            "start": 200.32
        },
        {
            "text": "400 for the that was real price. Right. Right. It's like, do I want to get in on this train or do I want because I have Scorpio prediction, right? But I had six here. I think a lot of them are really good. I'm going to skip it. Maybe if I need to, I'll come back to it. Lights go out or well, you know, whoever's up there, Phil Spencer, whoever it is, like, we have another exciting partnership to and Lights Go Out. Screen's black. Screen comes up. It is the FromSoftware logo. Some great nerdy ass song none of us recognize plays, but back home, Moreon bursts into tears, cause it's Armored Core and it's coming exclusively to Xbox. The next Armored Core is exclusive to Xbox. He can't believe it. None of us care. A whole bunch of dork gamers do though. And holy crap, are they excited? That's awesome. That is like exactly the type of exclusive they don't need now. Get the hardcore gamers. Get all the little audience niche audience is in there. Okay, so Oculus is not going to be at the show, right? I don't know. It's not",
            "start": 247.08
        },
        {
            "text": "exactly the type of exclusive they don't need now. Get the hardcore gamers. Get all the little audience niche audience is in there. Okay, so Oculus is not going to be at the show, right? I don't know. It's not going to be at they're not going to do E3. They have a booth. No. Okay. I mean, that's that's good. They should not, right? You need to lay low for a little while. It's been a weird year for them. Yes. But Microsoft's VR stuff has been like like hooked onto Oculus since, you know, how do we think PSVR is done for Sony? I mean, it's better than what they thought. It's done incredibly well. Yeah. So I can I kind of swing both ways on this one. I can kind of see them not mentioning Oculus at all, which is dangerous because is their last time talk to their consumers. PSX is obviously, you know, it's only have two bites to the cherry with this stuff. But it's such a disastrous time for Oculus. I feel like Oculus would not want to talk about anything. So what's your prediction? My prediction is that they will mention it in like",
            "start": 300.4
        },
        {
            "text": "to the cherry with this stuff. But it's such a disastrous time for Oculus. I feel like Oculus would not want to talk about anything. So what's your prediction? My prediction is that they will mention it in like passing like as part of the Scorpio reveal stuff points. They will say yes, they will make mention that VR support is going to be part and we'll talk about it at a future time. That there won't be like a montage of here's all the VR stuff we're going to be doing. Yeah, they'll they'll mention that like in the same way you were saying, you know, PlayStation 4 Pro works really good for VR and whatnot. That they'll allude to it, but they'll be very light on the details with with VR. I disagree. My prediction is that Xbox VR will be announced at E3. What better way to debut Xbox VR than with Project Scorpio? You got this new fancy console that runs really well. You got VR. VR has done really well for PlayStation. A lot of money is going into VR right now. It's like the new hot VC thing, right? Everyone's talking about",
            "start": 352.32
        },
        {
            "text": "this new fancy console that runs really well. You got VR. VR has done really well for PlayStation. A lot of money is going into VR right now. It's like the new hot VC thing, right? Everyone's talking about VR and investing in VR much like Esports. But Xbox is already in Esports. So they need to get into VR. And HoloLens is not it. HoloLens is not going to be a gaming thing. It's going to go to business. HoloLens is going to be strictly for the Microsoft side of things. So Xbox needs its headset. And its headset is Xbox VR. I don't know if that's the name of it. Yeah, but I really feel like how about Xbox One Elite VR? Now is the time for them to get into VR because if they don't do it now, then they're going to miss the boat. And they're launching this brand new powerful console. It makes sense. I mean, it's too late. Loved the I mean, that's a cool announcement. But I feel like it would just be muddy the water. I think they want to focus so much on Scorpio that launching another piece of hardware in",
            "start": 399.8
        },
        {
            "text": "it's too late. Loved the I mean, that's a cool announcement. But I feel like it would just be muddy the water. I think they want to focus so much on Scorpio that launching another piece of hardware in quotes would be so tough. Okay, you don't have to agree with me. It's a tough one to balance though, right? Because I'm discussing it with you. If they don't if they don't do it now, when do they do it? So it's all it's like it's both the right time to do it and also the wrong time to do it as well. It's like I'm just I'm not sold on the whole VR being a success thing. I feel like in in terms of making money for Sony, like I'm sure that it did and it worked for them. But like when you look at their lineup and we'll see what they announce at the conference. But like there's nothing coming for it. Like it had its launch games. Did I just tell you about Special Delivery and uh, okay, there's a little things like that. But like there's not this like schedule of lineup of games coming out over the this year even",
            "start": 447.36
        },
        {
            "text": "its launch games. Did I just tell you about Special Delivery and uh, okay, there's a little things like that. But like there's not this like schedule of lineup of games coming out over the this year even like even going to announce them all at E3. Maybe that's what I'm saying. But like I don't think that they're going to. So I I don't know. I think that the VR thing was more of a PlayStation Move style. Like it's going to be here for a second and then it it's gone. Obviously, VR is here to stay in the grand scheme of things. But I think in terms of dedicated video game supports and it being like another pillar to the big guys, I think that that it's more on the like smaller niche gimmicky side than it is like full bore into it. All right, fine. That's fine. New try. All right, let's see. My gosh, please trying to jump around here. I have some good ones. You know, screw it. Cuphead. Oh, God, no. Damn it. That was my next one. Canceled. No. Yeah, cause Cuphead release date. Um, I literally wrote in my notes, screw it. Get off",
            "start": 483.28
        },
        {
            "text": "to jump around here. I have some good ones. You know, screw it. Cuphead. Oh, God, no. Damn it. That was my next one. Canceled. No. Yeah, cause Cuphead release date. Um, I literally wrote in my notes, screw it. Get off the pot. The Get Hype moment available tonight. Yes. I could totally I could totally see that. Yeah. And like that they I see I so good. I would caution you to take the Get Hype tag off it. Just put that in your real prediction because that's actually a really good one. Screw it. Sure. There you go. Good. I'd be hyped about. Just cost them some points. No, I'm kidding. I hope they really do. That'd be awesome. That's a really good one. Where do I want to go next? Where do I want to go next? Where do I want to you? I should have kept my VR one. You say you'll get them all. Don't worry about it. There's a lot of empty space in that page. It's there's none. It's it's jam-packed with information. Didn't think it'd show the page. Crackdown is just a trailer. It looks incredibly different and everyone panics. I totally agree. I",
            "start": 528.4
        },
        {
            "text": "in that page. It's there's none. It's it's jam-packed with information. Didn't think it'd show the page. Crackdown is just a trailer. It looks incredibly different and everyone panics. I totally agree. I think it's going to be very different than the last time we saw it. And do you think there's any release window? Really think it would honestly be a I mean, cause like I think it'd be a hat in hand moment for them of like, hey, a lot of you asked about Crackdown. We're ready excited to show it. It's not it did. We got off track and we had to restart it. And the team back and wherever has been working really hard and they're excited to show you what it is now. I think it's going to be a Scorpio like launch title. Feel like it has to be. It kind of has to be. And I'll double down on oh, sorry. Is it me now or yeah, that was it. I'm done. I'll just double down on that. And I think that they'll also announce Forza Motorsport 7 as a launch title. Is that your prediction? Yeah, so you're saying Crackdown. Your prediction is",
            "start": 575.52
        },
        {
            "text": "that was it. I'm done. I'll just double down on that. And I think that they'll also announce Forza Motorsport 7 as a launch title. Is that your prediction? Yeah, so you're saying Crackdown. Your prediction is two Scorpio launch titles. Am I taking two though? I know I'm asking you. Oh, no, that's one prediction is what I was saying there. Yes. Okay. Yeah, yeah. So your prediction is both of the games will be launch titles. The both them will be launch titles. They'll show, you know, they need like Scorpio. If it's all about the graphics and running well, like it's a no-brainer that the car game is the thing that they push it out there with. There's a long and storied history of Microsoft consoles getting shipped with sexy looking car games. Um, they they totally need that. And you know, it's it's a bit of an no-brainer. Turn 10 will trot it out. Okay, so this one that I have, um, I don't think it's going to be exclusive, but we will see maybe a teaser trailer for Shadow of the Tomb Raider. Oh, thinking about that's a really good",
            "start": 622.84
        },
        {
            "text": "will trot it out. Okay, so this one that I have, um, I don't think it's going to be exclusive, but we will see maybe a teaser trailer for Shadow of the Tomb Raider. Oh, thinking about that's a really good one. Yeah, so there was uh, I I use leak in quotes because somebody had their PowerPoint presentation open on a train like an idiot. Somebody snapped a shot over his shoulder. He had a deck that said Shadow of the Tomb Raider. Obviously, you know, we know that something else is coming. Um, so I think now is a good time to maybe do a teaser. I don't think we get that sounds about right, cause it was last year the fall is when we got the definitive edition, whatever, 10 year celebration, right? And so that a year before that. So yeah, yeah, that makes sense. Good. That's good. I like that one. Oh, man, exciting. Trying to figure out the order of these guys. I'm just going to drop it here. Borderlands 3 announced. Obviously not exclusive. Well, it's already been announced, but like more like detail, maybe like a trailer or",
            "start": 663.76
        },
        {
            "text": "to figure out the order of these guys. I'm just going to drop it here. Borderlands 3 announced. Obviously not exclusive. Well, it's already been announced, but like more like detail, maybe like a trailer or something like that. Okay, okay, okay. Interesting stage. Xbox on stage of Xbox. Cause yeah, that's I don't think it would be anywhere else. I feel like when they announced it and like, hey, we're casting for Borderlands 3 or whatever they said they were looking for teammate. It seems so not not that long ago, if that makes sense. It seems like it was so recent that that said I would be interested to see how far along they are with that. But they're ready to do that. But that's a good one. I'm just thinking I feel like Xbox not only needs its exclusives, but it also needs a a presence during the event. Like of Gearbox has has been quiet for a while for a long time. So I don't know. It feels right to me. Let me see when that announcement was. I'm looking because now I want to know. Sure. Yeah, it feels like it was",
            "start": 720.48
        },
        {
            "text": "Gearbox has has been quiet for a while for a long time. So I don't know. It feels right to me. Let me see when that announcement was. I'm looking because now I want to know. Sure. Yeah, it feels like it was recent, but it can't be that recent. I don't know. I have to find it now. But I'm talking about a proper announcement. Like so many times games are announced, but they're like, I'm not saying announced. I'm just now I'm trying to think about how far along the game would be in production where it would be. But I guess it's been so long since Borderlands 2. Yeah, to as well. It's next one. Great. All right, this is sound. Stick with me because it's going to obviously this is going to happen. But I mean, like, it's going to happen. State of Decay 2 is going to get a huge push. Like suddenly this is a AAA Halo push. Like that. Like State of Decay one beloved by fans like me, but super small team. Undead Labs. Great folks up in Seattle. But I mean, now they're going to come out and they're it's going to be State of Decay 2 is happening.",
            "start": 762.44
        },
        {
            "text": "State of Decay one beloved by fans like me, but super small team. Undead Labs. Great folks up in Seattle. But I mean, now they're going to come out and they're it's going to be State of Decay 2 is happening. It's awesome. Here's this giant thing. Like make a huge deal about this game of the show in a way that State of Decay nobody ever did. State of Decay number one was like, oh, it's a cool zombie game. We got anyways. Let's talk about Halo and Gears and all this stuff. It's because Phil wore that T-shirt. Now it's a big deal. Exactly. Well, it's all they got. They're reaching back into the quiver and they got like three arrows clanking around. See, I okay, I'll buy it. It's it's a pretty big outside bet. But I feel like if it's going to if it was to pop up in any of the console manufacturers stages, it might be too early to be doing this. But I think I think we could see a trailer or at least some sort of information about PlayerUnknown's Battlegrounds coming to consoles. Oh, that's I think that's a good bet. And they need",
            "start": 809.88
        },
        {
            "text": "be doing this. But I think I think we could see a trailer or at least some sort of information about PlayerUnknown's Battlegrounds coming to consoles. Oh, that's I think that's a good bet. And they need that would be a nice get for Microsoft, cause they need to build that community around us. And it's like, you know, they don't have that. A lot of their online games, the Forzas, the Gears of War fours and stuff haven't like latched on to people. And I think that's a really good like that's a really smart one. But it might be a bit too early. I don't know for an announcement. That's the thing is I don't it's too early to talk about it and like to kind of claim ownership over the brands that people think Xbox when they think about this is a game everybody's been excited about on PC. And we're happy to announce that we are working right now to bring it to Xbox. And it'll look better on Scorpio. Yeah. How many we should take bets on how many times they're going to mention that or just make it a drinking",
            "start": 853.68
        },
        {
            "text": "that we are working right now to bring it to Xbox. And it'll look better on Scorpio. Yeah. How many we should take bets on how many times they're going to mention that or just make it a drinking game. Yeah. Good Lord. How many times do they say Scorpio? They don't because they announced the name of the new console, which is Xbox One. Okay. Um, Xbox One. I think we will hear about Minecraft on stage. Very safe. Yeah. All right. All right. You get that point. I respect the game. I respect the I get I get press releases from Minecraft like every other week. Um, that say TLDR at the top of them, which I think is hysterical. Um, but obviously this is a giant franchise for them. They spent a lot of money. It makes them a lot of money still. Um, clearly it's going to be coming to Scorpio. Um, if it's going to be a new iteration, if there's going to be something different that they're doing with it, I think they're going to announce something new for Minecraft on stage at E3. They kind of have to, right? Like they",
            "start": 893.6
        },
        {
            "text": "a new iteration. If there's going to be something different that they're doing with it, I think they're going to announce something new for Minecraft on stage at E3. They kind of have to, right? Like they spend all that money. Yeah, like a billion. So they yeah, it's funny. I was when we were preparing for this, I was like, oh, Switch. I get I'll do Minecraft. And it's already come out. I don't even know it came out like two weeks ago or something. Uh, yeah, that's a good point. What do you think it'll be like Minecraft 2 or we isn't it that Realms thing that they the guy I don't know Minecraft. So I I'm not sure about this. But I remember last year they like really went into. Yeah, so that was kind of like the the worlds that they were they added. I don't actively play Minecraft. Um, I don't think that it's going to be Minecraft 2. Um, I think that would be really cool. But I think that goes against the entire community in the world that they've created. I don't think that they would want to ask these millions and",
            "start": 951.32
        },
        {
            "text": "be Minecraft 2. Um, I think that would be really cool. But I think that goes against the entire community in the world that they've created. I don't think that they would want to ask these millions and millions of players around the world to like move to a new thing. I think that's a living breathing ecosystem and that they're just going to add to it. I don't think they're going to make a new Minecraft. Do they still have like really high concurrence on them? Like I have no vis on. Yeah. Wow. All right. If you ever want to get off those Minecraft emails, what happened to me is I got hit up like, hey, I'm the Minecraft PR person. I was like, awesome. Like, hey, can we do a death side visit? I'm like, I'll be honest, I only play on PlayStation VR. Never want to email again. Never got one email about Minecraft again. Um, this is our fourth correct. Yes. Yeah, yeah. Okay, okay. See, this is one that I I don't have too much faith in. But I feel like it's time to be announced somewhere. And I think that Microsoft would do",
            "start": 995.08
        },
        {
            "text": "very well off having this. Rocksteady announces a new DC game. Oh, doctor. Get Hype moment being Batman Beyond. Jesus Christ. They said that they're done working on Batman. I know. But Batman Beyond is different. That's that's the thing. They're done with their Arkham Universe. There's that. I I think more likely would be a Justice League. Um, or something of that that nature. Just something DC. And like that would really I think Microsoft having that uh, sets up the um, Sony having Marvel. Yeah. Microsoft having DC thing, which is why the Avengers thing that you brought up was interesting earlier about it being at um, Microsoft's because that would be huge for them. And based off the Crystal stuff that makes a lot of sense. But I can see them kind of trying to divide. That makes a lot of sense. Yeah. Superiors are so",
            "start": 1036.88
        },
        {
            "text": "Microsoft's because that would be huge for them. And based off the Crystal stuff that makes a lot of sense. But I can see them kind of trying to divide. That makes a lot of sense. Yeah. Superiors are so hot. And that would be I mean, a reason for I think a lot of gamers get excited about Xbox One/Scorpio. Yeah, that's a good one too. I like that. Hey, Greg, what are you thinking about? You think about your next one real hard. Well, Greg, question for you about the Rocksteady thing. If Rocksteady announces its game at E3, yeah, do you think it'll be at Microsoft or where would that be? A great question. You know what I mean? Like I they do have a relationship with Sony that I mean, the PlayStation VR deal, you know what I mean? That was that was Rocksteady proper. That was the guys. That was the all the normal dudes in Seattle and whatnot. Arkham Knight was at PlayStation. Correct. I want to say yes. That sounds right. That sounds right as well. But thing Microsoft needs it. Microsoft got to try. Go really hard at it. Yeah, especially if you",
            "start": 1093.92
        },
        {
            "text": "do have Spider-Man there. My final prediction for Xbox's conference. Phil Spencer shocks the world and stays in one T-shirt under his blazer the whole time. Just one. Not going to do this whole thing. Not going to give the internet memes. Not going to be changing it up. All right. Just here's what I'm wearing. And that's it. That's kind of a lame prediction. Like Andrea Renee. There are no lame predictions. Just lame listeners. Oh, okay. If you're not if you're a listener at home, I'm pointing at her. I mean, she's being she's being he's calling me a lame listener. I'm glad you went for a lame prediction, cause I'm in the world of lame predictions right now. Um, okay, so Microsoft's biggest problem is that last year's like all the exclusive games they were pushing for the past couple of years either ended up being",
            "start": 1129.72
        },
        {
            "text": "in the world of lame predictions right now um okay so Microsoft's biggest problem is that last year's like all the exclusive games they were pushing for the past couple of years either ended up being wet blankets or didn't come out you know between Scalebound and ReCore and like even even stuff like like Gears 4 was good right and Quantum Break like I mean Gears 4 was a good game but it didn't like the world on fire Quantum Break was a good game but it was too attach that TV game **** it was had to suffer from the same problem ended what it was made for a different machine and got pulled in a different way so I think they are going to have to announce a bunch of new games I'm not sure if I'm not sure if like the IP back catalog they have is good enough for like more sequels like I I would I kind of worry about a Gears War Trilogy like I do about the new Halo the second Halo Trilogy Where like I don't know if they have that really rich stuff so I think they're going to announce in some",
            "start": 1171.68
        },
        {
            "text": "I kind of worry about a Gears War Trilogy like I do about the new Halo the second Halo Trilogy Where like I don't know if they have that really rich stuff so I think they're going to announce in some form three new IPs wow coming from yeah and in some sort of they have a lot of Studios still working on stuff like new franchises or games within an existing franchise I don't want to rule out the idea that they might reimagine a franchise that came out 15 years ago in some way but like I think oh they will right but I think they'll but I think there will be you know non-sequel exclusive games announced for the Xbox One but like a lot of them like three at least three at least yeah okay yeah interesting I was also gonna sayag as well I was also gonna say I wasna say a new AAA IP is announced um because I need one but um instead so I'm I'm toying with the idea I have two I have two I like this so I'm just going to say then if it's taking one of yours let me know okay it won't the first one",
            "start": 1212.68
        },
        {
            "text": "because I need one but um instead so I'm I'm toying with the idea I have two I have two I like this so I'm just going to say then if it's taking one of yours let me know okay it won't the first one is like a simple one that I think is like a no-brainer for them which is um you can bring your custom controller to the Scorpio oh yeah a big push about making these customized controllers it would not make sense if you could not use it on Scorpio so I think that'll be like an easy I think all yeah any Xbox One controller will work over on Scorpio sure the real prediction is we get a teaser of the next Halo game all right cuz we have to see Master Chief or something from 343 it's Xbox they they are synonymous they go hand in hand it's E3 I don't think it's going to be a a big trailer I don't think it's going to be gameplay I don't it's going to be similar to the the one where Chief was in the desert and had the poncho on right when they announced five so Halo is an interesting thing uh last",
            "start": 1264.76
        },
        {
            "text": "it's going to be gameplay I don't it's going to be similar to the the one where Chief was in the desert and had the poncho on right when they announced five so Halo is an interesting thing uh last week we had or two weeks ago we had Sean Finnegan and Halo sorry Alfredo here to talk about Halo and we were talking about what we think is going to be shown there's been a lot going on with 343 where they're talking about Halo 6 will not be at E3 they confirmed that um they also confirmed they're not doing the Halo 3 10-year anniversary uh which would go against what they've done with the 10 year anniversary of two and one 10 years that's so up yeah um but they have Master Chief Collection so like they don't necessarily need to do that cuz that already kind of gave a lot of the upgrades that uh a new version would Halo Wars 3 um but well I Halo Wars but they said that they are going to do something at E3 so my thing is do we believe them like I I'm kind of with you where it's like I can see",
            "start": 1317.64
        },
        {
            "text": "a new version would Halo Wars 3 um but well I Halo Wars but they said that they are going to do something at E3 so my thing is do we believe them like I I'm kind of with you where it's like I can see them just announcing Halo 6 like putting out some type of teaser they said it's not they're not going to but people **** lie all the time you have to cuz I but you caught us yeah we're going to be there yeah there's going to be some in in some form and it that could be some HoloLens **** it could be if there is VR some VR experience or whatever Halo VR you guys so I don't know just saying it could be a thing it could it definitely could but I don't think we're going to see Halo 6 and I I think that that's um sad because they should but whatever my prediction Microsoft need some big **** and without Halo or Gears they're they're lacking in that like exclusive huge uh shooter and I almost feel like Halo or Gears isn't enough anymore like I think Halo still is Halo might be yeah yeah",
            "start": 1355.52
        },
        {
            "text": "and without Halo or Gears they're they're lacking in that like exclusive huge uh shooter and I almost feel like Halo or Gears isn't enough anymore like I think Halo still is Halo might be yeah yeah like like the Halo is not what it used to be but it's still leagues above in terms of sales losing the partnership with Call of Duty I think really hurt them absolutely and also PlayStation 4 is just kind of meteoric Rise um over the Xbox One in terms of sales so it's just like that all a l lot of the third parties and stuff that makes sense um but with Scorpio they need to have some huge deal of this is an exciting thing to get PlayStation 4 Gamers to buy an Xbox One so I think that it is the Hail Mary because there's not much that they have Perfect Dark yeah do Perfect Dark carry the same I think that it could I think I think I think this new generation does not even know what Perfect Dark is but I think it's a perfect time to it's a it's a cool ass um like franchise and I think that like",
            "start": 1403.68
        },
        {
            "text": "that it could I think I think I think this new generation does not even know what Perfect Dark is but I think it's a perfect time to it's a it's a cool ass um like franchise and I think that like the while the last one was not good I think that it's been long enough that they don't need to listen to any pre-exist things and I think that they can Tomb Raider it in a lot of ways and and bring it back and make a huge deal out of it and make people care and I think that it could set itself apart from a lot of the other shooters that we have going on TimeSplitters gets an answer to son oh my God I would that would be Crash Bandicoot levels for me of just a new **** TimeSplitters are you kidding me you should put new show idea put Tim in like when you know they have those shows where you're like you live in the 70s again and open 70s just put him in a room in like in like yeah 1999 2000 yeah perfect I'm totally into it I'm sure you would yeah but I I I think that they need to come back",
            "start": 1451.88
        },
        {
            "text": "like you live in the 70s again and open 70s just put him in a room in like in like yeah 1999 2000 yeah perfect I'm totally into it I'm sure you would yeah but I I I think that they need to come back with some stuff and like they just don't have too many like big surprise things that they can come back with cuz yeah the new IPs we they definitely need new IPs but I don't think that it's going to be a new IP that uh really converts a lot of people to the Scorpio so I think you think Perfect Dark is going to be the IP that converts people I I think that it is way more when they don't have a Halo they have nothing like when they don't have a Halo I think you're crazy I think I think there's so many gamers who have no idea what that game is like Tomb Raider is different because Tomb Raider is a gigantic IP that everybody knows even if you don't play video games you know Tomb Raider yeah but Perfect Dark even if you didn't play it growing up you've heard about it you've heard like the",
            "start": 1493.28
        },
        {
            "text": "is a gigantic IP that everybody knows even if you don't play video games you know Tomb Raider yeah but Perfect Dark even if you didn't play it growing up you've heard about it you've heard like the there's a historic Legacy to it that even if you don't know that we should do a Twitter right now and see how many people have heard of Perfect Dark the argument that I would make is that there's so many people that even if they didn't hear about it the moment that they heard about it and everyone else is making a big deal they're going to be like oh **** and they're going to fake and act like they burned by that cuz what the 360 Perfect Dark and then the other Perfect Dark that was it that was so you were burned by both of them is what you're saying Perfect Dark one was awesome to to me Perfect Dark was one of those games that like people who didn't own a PC thought was good like crazy that's like oh my God it was like Perfect Dark the problem was it was just trying I'm talking N64",
            "start": 1532.36
        },
        {
            "text": "Perfect Dark was one of those games that like people who didn't own a PC thought was good like crazy that's like oh my God it was like Perfect Dark the problem was it was just trying I'm talking N64 Perfect Dark was just trying to chase what GoldenEye was and by the time it got there oh my God it just wasn't as good as GoldenEye PC Gamers the same thing about gold there was no Oddjob you were so there was Elvis the alien I I remember him I remember him sorry to break your heart I mean you're crazy but I also think that like with the the political climate we're now Joanna Dark being a female protagonist games these days like that it's on Trend I think this makes a lot of sense and I think that it could compete not with the Halos but it could be more on the like Horizon level of properties for Xbox and I think that that is an exciting announcement when they don't really have much they I mean with this argument they should just bring Wet they should buy Wet Wet too Wet no no you don't",
            "start": 1569.04
        },
        {
            "text": "for Xbox and I think that that is an exciting announcement when they don't really have much they I mean with this argument they should just bring Wet they should buy Wet Wet too Wet no no you don't call yeah Wet that's a better one I just yeah I feel like they don't know what they're doing with their old licenses like even Dead Rising like in a time where they didn't have that many exclusive like things to really cherish they kind of dropped the ball on Dead Rising like it was a fine game but they're beyond the point of having needing fine you can't have fine games and that's all it's coming out exactly all right now that we're done with the predictions on Xbox is there any last statements on Xbox yes I think we'll hear about more about the Xbox Game Pass oh that's a cool thing yeah I think we're going to hear a lot about it actually I think that they I think they'll spend as much time time about it as they did about backwards compatibility a couple years ago and I think that",
            "start": 1611.84
        },
        {
            "text": "I think we're going to hear a lot about it actually I think that they I think they'll spend as much time time about it as they did about backwards compatibility a couple years ago and I think that they're going to knock it out of the park they're going to bring some really big titles to Game Pass because as much as I think you know the Games with Gold and the PlayStation Plus free games every month are a fantastic added value to your subscription I think a lot of the games they bring to those programs are so old that it doesn't even matter that you get them for free cuz really wants to play them anyway I think they're going to bring some really good recent games they're exclusives to the Game Pass that are people that will incentivize people to buy you mean really big games like the Master Chief Collection with Scorpio support cuz that would **** kill yeah it absolutely that's their Halo game then yeah I mean honestly that that I could totally see that happen all right they're going",
            "start": 1648.0
        },
        {
            "text": "Chief Collection with Scorpio support cuz that would **** kill yeah it absolutely that's their Halo game then yeah I mean honestly that that I could totally see that happen all right they're going to come as they're going to talk Hardware straight away they're just going to it's going to be 15 minutes of this is the score and I mean that's what they need to do and then they need to talk about games like if that's not the way this goes down then they're in big trouble this is kind of like a last swing for them for this generation yeah like they need to pull pull momentum in the opposite direction absolutely what's up guys that was fun if you want more Kinda Funny Games click there to subscribe if you want other stuff you can click there to subscribe to youtube.com/KindaFunny you can support us on Patreon right there and over here if you click on this you'll have to find out what happens is it Kevin's little B button it's not I was going to say butal oh my God",
            "start": 1689.08
        }
    ]
}