{
    "id": 2738,
    "video_id": "EtmVpFeP3K8",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Dan (Nintendo)"
    ],
    "title": "Mario Odyssey Gameplay and Impressions - Kinda Funny E3 2017 Live Show",
    "description": "Mario's back, and Kinda Funny can't believe its eyes on the GameSpot Co-Op Stage.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497555000,
    "duration": 886,
    "transcript_chunks": [
        {
            "text": "Tim, you brought somebody. I did. This is my friend Dan. Hi Dan. You brought out the ego. Well, I gosh, oh yeah, let's play some more. Let's go right into it, everybody. Oh my God, yep, this. Oh, here, yeah, we're actually in a live gameplay demo with our friend Sarah B on the side. You can't see her on camera, but she's playing for us here. Thank you. She's playing games for us all day. But yeah, we're just showing off one of the two stages you've been playing on, New Donk City in the Metro Kingdom. Kind of joke gameplay there, all that good stuff. I heard you guys, you guys got a chance to play the game also, right? Did get a chance to play. There's a Let's Play going up later on YouTube.com/KindaFunnyGames. Subscribe, like, share. Ah, buddy, I had a lot of fun with it. We played for about 15-20 minutes, and I'd say about seven and a half minutes-ish per level. Yeah, so it was fun. My thing is, Mario games are probably my favorite games of all time. Yeah, if it was a single franchise, I would definitely say that.",
            "start": 0.0
        },
        {
            "text": "say about seven and a half minutes-ish per level. Yeah, so it was fun. My thing is, Mario games are probably my favorite games of all time. Yeah, if it was a single franchise, I would definitely say that. It's not, it's my favorite franchise. Now, we haven't gotten a 3D sandbox Mario game in a long time. Yes, for Super Mario 64 or Mario Sunshine. Yeah, and then the Galaxy games were fantastic, but they were kind of a weird in-between where there were a lot more linear than, yes, they had that. Yeah, the devs actually described it as a miniature, miniature garden, which is a good answer. Incorrectly, but haha, Konya. Okay, therefore, a miniature garden, which is what they do, and they very interesting design, very particularly how they design it so you can just go and explore, discover everything in this condensed space. Yeah, can I try to create? So what's the philosophy then for going back to the other style? They just want it. Why do something different that using the hat, the whole thing, Cappy, a different exploration aspect?",
            "start": 41.64
        },
        {
            "text": "I try to create. So what's the philosophy then for going back to the other style? They just want it. Why do something different that using the hat, the whole thing, Cappy, a different exploration aspect? That's what they wanted, something different with this one. They've already done Super Mario Galaxy. They wanted something different when they created it. They want to create something that people could just really have fun with and be completely lost at the same time, just be surprised as we're going through the whole game. Like jumping up, pack people. So look at as a trailer, it was absolutely bonkers. Yeah, starting off with that T-Rex and all of that. Like that, what, where did that type of inspiration come from? The devs actually, from what I got from my understanding, like they really decided one person to pitch it. It was the idea of capturing that whole capture mechanic, and then they basically just asked that anyone comes with any idea that you come up with, and they had a bunch, and they basically chose their favorites, the",
            "start": 85.2
        },
        {
            "text": "idea of capturing that whole capture mechanic, and then they basically just asked that anyone comes with any idea that you come up with, and they had a bunch, and they basically chose their favorites. The game, so hence the T-Rex being taken over with Cappy. I love something like that. And even the different, now they have different outfits too, right? Now you can see that, well, I just had fit by the suit too. So something that I noticed when we're playing the demo is that there's checkpoints all over the levels, right? Every time you get the checkpoints, you can go to your map and fast travel to those. Yeah, fast travel points on the map. Yes. How big are the maps compared to the Super Mario 64 maps? That, that's not a good pair of shoes. The idea of collecting all those moons, like similar to Super Mario 64, respecting all those different stars, but this one, we collect pieces, a little suit. Oh, oh, let's go. He does look good. I love it. It's a tie on everything. Yeah, yes, but no, that's why they decided they",
            "start": 122.13
        },
        {
            "text": "64, respecting all those different stars, but this one, we collect pieces, a little suit. Oh, oh, let's go. He does look good. I love it. It's a tie on everything. Yeah, yes, but no, that's why they decided they really want for that Mario 64 style, just, just have more fun with it. How they design everything, the Cappy mechanic we're talking about, they basically really had fun with it. So in Mario 64, every level had about six stars. The kingdom, how many moons are in each kingdom? Oh geez, I've seen some so far, they have a 30, 40, 50 plus. Yeah, there's a lot of moons in them. And the moons power the, the Odyssey, that's Mario's ship to get around kingdom to kingdom. But yet, those differences between Mario 64, that every time you got a star, you had to do, start level over again. Yeah, this time you get moons, you just keep going. Okay, so it really does try to get you into that idea that you keep playing over and over, so you can play like five, ten minutes to find some moons, or you can sit down for a marathon",
            "start": 161.08
        },
        {
            "text": "just keep going. Okay, so it really does try to get you into that idea that you keep playing over and over, so you can play like five, ten minutes to find some moons, or you can sit down for a marathon session and play forever. I mean, it's really, this is a very lofty comment to make, but seeing this, I see in the trailer, and then playing it today, it kind of is giving me Breath of the Wild vibe. Yeah, for reinventing what Mario is and making it so open and not getting in your way and want you to keep exploring and trying different things. And like, I had such a great time going around the corners and getting moons to be like, oh man, here's another one, here's another one. And it kind of felt like you just kept ramping up in the same way to try and fit, you see, well, off in the distance, you see a moon, even though you're going for another one, you're like, wait, how do I go with it? How do I go and do this? Okay, that's actually a big difference between Breath of the Wild and Super Mario Odyssey.",
            "start": 205.81
        },
        {
            "text": "you're going for another one, you're like, wait, how do I go with it? How do I go and do this? Okay, that's actually a big difference between Breath of the Wild and Super Mario Odyssey is that it's more about that thing you find right in front of you versus Zelda was like, how do I get to that point all the way off of the distance? Oh, that's what they really did differently in this game. Well, totally real. I did a good job up in the demo. I did early and I kept failing at is one of my favorite things about Mario 64 was that beginning level, like outside the castle. Yes, just going in with the trees and climbing them and flipping off and just trying to figure out what I couldn't, couldn't do. And immediately within five minutes of playing this, I was like, wait, can I climb that? I was like, oh, I can climb that. Oh, I can't find that. Trying to figure out what the rules are. And especially in New Donk City, like seeing the skyscrapers, it's like, oh, there's ways to get up there. Yes, and",
            "start": 245.26
        },
        {
            "text": "was like, oh, I can climb that. Oh, I can't find that. Trying to figure out what the rules are. And especially in New Donk City, like seeing the skyscrapers, it's like, oh, there's ways to get up there. Yes, and there are ways to get up a lot like Zelda in a lot of ways. It's really, there's a lot more verticality to the levels than there wasn't, say, Mario 64. Hmm. That's when they really built in this one. Only had said that whole density, that really that open-ended exploration that's inside that area. They had a lot of fun with that for sure. So the human people, yes, in New Donk City, with calling, you feel, mmm, how does it make you feel? You happy about sight? I think it's pretty cool. Like, I like seeing Mario do something new and different, universe in him before. So this is only, and it's only one of the kingdoms. It's the Metro Kingdom. So all these, everything you see, there's Pauline hanging on the auditorium, Mayor Pauline. Yeah, we saw it. I do notice, I love via the art director, obviously Pauline from the original",
            "start": 283.6
        },
        {
            "text": "it's the Metro Kingdom. So all these, everything you see, there's Pauline hanging on the auditorium, Mayor Pauline. Yeah, we saw it. I do notice, I love via the art director, obviously Pauline from the original Donkey Kong game. Another thing we ran into with our friend, Captain Toad. Yes, go to this level, guys. Yeah, you gotta go, the Captain Toad. I can play this when you find him. Does he confirm that Captain Toad: Treasure Tracker is coming to a Nintendo Switch? He doesn't tell you anything. He didn't tell me anything, anything yet. Yeah, I know. I'm so excited to play this game. It's like one of the, the best things for me at E3 is playing a game and being like, all right, I don't want to play this more right now because I can't wait to just play the entire thing. I just, maybe even though I work at, we even working at Nintendo, there's often times where I will avoid, I will only play when I have to play to talk about the game. I don't want anything else 'cause I don't want to ruin my stuff. Like, it's late at home. I do.",
            "start": 321.94
        },
        {
            "text": "at Nintendo, there's often times where I will avoid, I will only play when I have to play to talk about the game. I don't want anything else 'cause I don't want to ruin my stuff. Like, it's late at home. I do feel like it's an additive experience. I'm just kind of going through and finding every moon, seeing every place you want to go and then getting that. And also, I love that there's a lot more mechanics going on, yeah, than in previous Mario games, especially with the hat, with Cappy. That Cappy changes everything of how this game works, to be able to use the hat in new ways, to capturing all those things going on. So yeah, yeah, that's that. And see what you'd be like when you capture the T-Rex, the Goombas, the, the Moai, which, which you have, not sure we have a chance to get that for you. No, Sand Kingdom with the sunglasses. We didn't get that. If you get far enough in the, I gave sunglasses that you drop and then you can see hidden pathways and yeah, wise, that's interesting. So what I am excited about is",
            "start": 364.84
        },
        {
            "text": "with the sunglasses. We didn't get that. If you get far enough in the, I gave sunglasses that you drop and then you can see hidden pathways and yeah, wise, that's interesting. So what I am excited about is the gameplay opportunities that the different Cappy abilities give you. When the level we played, I got to play as Bullet Bill in the Sand Kingdom. You can move around on one plane, you can't go up or down. Yeah, so it's like that's one like gameplay element they got. But then when you take control of something else, for example, it allows you to like fly a bit or like swim a bit. And I'm interested to see what the dinosaur does and what all these different things do. And it's kind of like a bunch of minigames within the obvious like tried-and-true tight platforming that Mario's know exactly. And that's, that's part of the fun issue is discovering what can Cappy control or not control or captured for that matter. There's one having some cool things that he can, well, we've seen some of that, some ways that's the",
            "start": 398.79
        },
        {
            "text": "of the fun issue is discovering what can Cappy control or not control or captured for that matter. There's one having some cool things that he can, well, we've seen some of that, some ways that's the treasure like the T-Rex, the Goomba, the, the Koopa Troopa. We get to start throwing the frying pan back and forth. Um, and there's the map actually as well. She just off a second ago, Max. I'm not sure where Sarah's on us. We'll find out things. So forward of the favorite part, back to the beginning, that's what we get. So is there a hub world? Like, is there Peach's Castle or something equivalent? We really haven't talked too much of what the hub is going to be. I know a lot of people been asking that question. We're not sure yet. We haven't really talked a lot. People are assuming it's going to be New Donk City, but we haven't really got into that detail yet. Just wait till October 27th. Okay, every. It may be like mini games inside like here. Yes, all right. Yeah, right here. Mario takes, we're Cappy's, you took over a",
            "start": 441.36
        },
        {
            "text": "but we haven't really got into that detail yet. Just wait till October 27th. Okay, every. It may be like mini games inside like here. Yes, all right. Yeah, right here. Mario takes, we're Cappy's, you took over a person. You capture one of the people. Now it's a total remote-controlled car to try to get some of that, that moon that's hidden over there. And Sarah can make it. She can do it. I believe in her. Do it. I believe. Yeah, I believe. Here we go. That's it. Now, almost there. There we go. He's pretty stoked about. I like those. I like the mini games that are hidden. They're not hidden, but like littered around the, or you were doing the jump rope one earlier. Yeah, I totally see that being like, we only had five minutes of attempts. We didn't record. It's like, I want to see. I would love to have just done that for a while. I'm like, how many Mario jumps can you do in this jump? I've seen people do actually. Sarah herself has actually done it before using the motorcycle. Oh wow. She got even gotten a couple of jumps",
            "start": 477.69
        },
        {
            "text": "a while. I'm like, how many Mario jumps can you do in this jump? I've seen people do actually. Sarah herself has actually done it before using the motorcycle. Oh wow. She got even gotten a couple of jumps action on the motorcycle, just jumping up and down. And that's something that definitely want to discover as well is that they have certain solutions and they want to see what other solutions people come up with and they start trying to solve a problem. So what's going on here? Because this, this gives Galaxy vibes. She actually went into the manhole. She moved one of the manholes with the capture and then actually now she went down into this secret area you discovered to try to climb more moon shards on the moon. Okay, using, using Cappy, you're able to then throw Cappy to actually move the four pieces. And it's cool for you can throw Cappy that to actually stun the Piranha Plants. Yeah. So what's Cappy's deal? What's the backstory? We haven't revealed Cappy yet. Basically, a lot of these",
            "start": 519.49
        },
        {
            "text": "pieces. And it's cool for you can throw Cappy that to actually stun the Piranha Plants. Yeah. So what's Cappy's deal? What's the backstory? We haven't revealed Cappy yet. Basically, a lot of these things. I actually don't know the full story, but have you haven't discovered yet? It's easy to play and uncover all these things yet. So, but no, Cappy is great because it's like if someone who Mario adventure with on this great Odyssey. It's so well. So speed of that, like jokes aside, Mario not necessarily known for story and all that. Um, but I appreciate in this game, there seems to be a lot of non-playable characters just kind of like adding like what they had to say. Yeah, but unlike Super Mario 64, Sunshine, where like the Toad or the Delfino Island people, rather name, would be talking to you, you have to keep hitting A button to get through it. These are just kind of prompts to pop up and don't get in your way. And then it's like, it's, I felt like there was a lot of momentum in this game. And also the new roll ability. I",
            "start": 557.05
        },
        {
            "text": "A button to get through it. These are just kind of prompts to pop up and don't get in your way. And then it's like, it's, I felt like there was a lot of momentum in this game. And also the new roll ability. I got really love the speed detective roll ability. Even the hat storing, the Cappy. There's always everything you can do and explore with Cappy, which is awesome. They have a chance to do. But the story is interesting with the fact that now it's Bowser trying to marry Princess Peach. Was finding that the whole wedding outfit by some exams about Cappy's got the outfit too. But even beyond results to do enemies, the Broodals, which is that crew that you see on the airship, those kind of bunny thing. Yeah, those are called the Broodals. What's their deal? They're basically helping Bowser plan his wedding. Oh yeah, planners. Yeah, I can't hate on that. Like Jennifer Lopez, I do it for love. I get it. Yeah, yeah. See what they can. So what's something cool that we can see here? I'm not sure Sarah, where Sarah can take us.",
            "start": 602.05
        },
        {
            "text": "planners. Yeah, I can't hate on that. Like Jennifer Lopez, I do it for love. I get it. Yeah, yeah. See what they can. So what's something cool that we can see here? I'm not sure Sarah, where Sarah can take us. Anywhere you want, anywhere you guys want her to take you guys. I don't know. Go climb something really high. Okay, good. I can tell it looks good. I look at this top, tippy top, it looks so good, Tim. Oh, it does. And the coolest thing, so we get to play this anywhere if we want. Like, that's the, I know my mind, like we're going to be full games being of this quality, but on a home console. But now, whoa, there we go. I'm really excited to see both later levels in this game because I loved it. It's good. All the knots. Like, yeah, the level, this New Donk City's all this Donkey Kong-esque things going on, like the construction and stuff. That's super cool. And all those outfits of you where throwbacks to random old Mario things, whether it's Game Boy games, like golf or boxing and all that. She can hike, she can do all about.",
            "start": 637.27
        },
        {
            "text": "and stuff that's super cool. And all those outfits of you where throwbacks to random old Mario things, whether it's Game Boy games, like golf or boxing and all that. She can hike, she can do all about with the climbing situation. You can climb up there. You climb up. Yeah, those little steps right there. Kind of climb up there hard, but I did it earlier. I, this is easier. Can, man, have you jump rope with a motorcycle? No. So, but I feel sure. Well, we try to fit it up very well. I'm being honest. He's trying. We'll see. But yeah, no, that's awesome, really, as far as always hijack an exploring scheme. You can discover up there. She goes. Oh no. Comes off lining up. Oh, it's okay. It's okay. Yeah, hey, you got a tie to get. It's fine in that regard. But yeah, no, that's part of the fun is really just exploring this whole area. There's the Odyssey you can see off in the distance. Oh, cool. Right. If did you guys get a chance to go inside the Odyssey? No, we did for a second. I would say it's a scary, which a lot of Reggie was thinking",
            "start": 695.27
        },
        {
            "text": "the Odyssey you can see off in the distance. Oh, cool. Right. If did you guys get a chance to go inside the Odyssey? No, we did for a second. I would say it's a scary, which a lot of Reggie was thinking out loud. Arms, I got distraction. Yeah, we left out to go buy a Sombrero. Yes, as I really wanted to. So, bro, that's what you do in this game. Yeah, exactly. Yes, it is Sombrero. The ponchos, all the effects, even like the Explorer outfit he had on as well. Is it all aesthetics done so far? More showings about the aesthetic. What you had with it depends where you're right. Because like to get specific Cantina Poncho and the Sombrero, you have to get the purple coins. Okay, they're called regional coins. That's the name of the officially. So yeah, you can use to buy certain items when you're over there. So what are the differences between the coins, Dan? Because I'm seeing you have two hundred and five coins, normally a hundred. And I see what's going on. So right now, Sarah used the coins actually to buy the bike to",
            "start": 741.95
        },
        {
            "text": "the differences between the coins, Dan? Because I'm seeing you have two hundred and five coins, normally a hundred. And I see what's going on. So right now, Sarah used the coins actually to buy the bike, to buy this costume right here that suit that Mario is wearing. So it depends. The coins are used for different things that you discover. And right now, what you're doing now is the actual mission that are all right now to help that drummer. You just have a band. Yeah, so you're helping find the band member. I got it. I'll tell you all that we've come to an end, cuts over. Yes. So why our, see, all right, even have perfect music. There you go. Get out of move. That's how we end it. Thank you so much for coming by, Greg. Uh, we wanted to tell you, of course, that of course, I'm sure you knew your game's awesome. You're Kinda Funny improved E3 of work. Oh yeah, I get honesty very well today, everybody. Oh, thanks everybody else. You all come, guys. When's it coming out? October 27th. All right, great. Not too far off. Yeah. Oh, wait.",
            "start": 782.97
        },
        {
            "text": "Kinda Funny improved E3 of work. Oh yeah, I get honesty very well today, everybody. Oh, thanks everybody else. You all come, guys. When's it coming out? October 27th. All right, great. Not too far off. Yeah. Oh, wait. Anywhere you can play it on the Switch, anywhere you're going, or play it lazily like I do. I play games pretty lazy now with this. Yeah, instant sprawl. Now, I do drive exactly what you want, Tim. Thanks for joining me. Thank you for having me. It's been a pleasure to hang out. It's been a pleasure to hang out with all of you. Quick plug, ladies and gentlemen, remember, even though this is the end of Kinda Funny on the GameSpot Co-Op Stage, they will be back tomorrow to go just twitch.tv/GameSpot, GameSpot.com, all that jazz. You catch us on YouTube.com/KindaFunnyGames. There's also YouTube.com/KindaFunny. We just put up a video of us going through our sex dungeon Airbnb. You heard that right. Go check that out often. Thank you all for hanging out today. Thank you in person for",
            "start": 824.46
        },
        {
            "text": "slash Kinda Funny. We just put up a video of us going through our sex dungeon Airbnb. You heard that right. Go check that out often. Thank you all for hanging out today. Thank you in person for hanging out today, ladies and gentlemen. This is E3 2017. And until next time, it's been our pleasure to serve you.",
            "start": 868.38
        }
    ]
}