{
    "id": 2740,
    "video_id": "GLdONqBH6aw",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Bill Rosemann",
        "Mike Jones"
    ],
    "title": "Why Marvel Games Is Dominating - Kinda Funny E3 2017 Live Show",
    "description": "Marvel's Mike Jones and Bill Rosemann stop by the GameSpot Co-Op Stage to talk with Kinda Funny about Marvel's plan when it comes to games.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497560401,
    "duration": 998,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to E3 2017 Kinda Funny Games on The GameSpot Co-Op Stage. I'm one of your hosts for the day, Greg Miller, alongside the pure one, Tim Gettys. Let Tim host the Bros from Marvel Games. Hello friends, creative Mike Jones, who and and my better half, Bill Rosemann. Bill Rosemann, Creative Director, Marvel Games, and a giant audience of people who I said to go crazy and I'm not super stoked yet. So again, all all right, stop it. I feel like you need to like, we need to focus your craziness on something. So ladies and gentlemen, give a round of applause for Tera Bruno right there in the audience. There we go, Tera Bruno. Yeah, now we're talking. What an E3 it's been, Tim. Oh my God, I think at the top of everyone's list of amazing they've seen, amazing, spectacular, would you say? I would say Ultimate Spider-Man. Oh my God, so many descriptors. Yeah, uh, what do we think of Spider-Man so far from what you guys are seeing? Like it? Like it? Good footage, good footage. It is unbelievable. There it is. What",
            "start": 0.2
        },
        {
            "text": "Spider-Man. Oh my God, so many descriptors. Yeah, uh, what do we think of Spider-Man so far from what you guys are seeing? Like it? Like it? Good footage, good footage. It is unbelievable. There it is. What do you guys, what do you guys think of the white Spider? Good, good. Now Greg Miller over here has a lot of thoughts on the white Spider. I get, I since you've debuted it, I understood when Insomniac debuted, I totally got it. And today when we were getting our behind closed doors demo from Brian, right? He drove it home of like, we want you to look at it and say, oh, it's Spider-Man, but see it and say, oh, that's not a Spider-Man. I immediately know I need to understand it, who it is. And now it's Insomniac's. Exactly. For, I mean, for all of our games, when we work with our partners, we want them to bring their vision to the game. Yeah, uh, uh, and we want when when they approach the Marvel characters, we want them to be very familiar and identifiable, but also unique and ownable for each game. So when you see Spider-Man",
            "start": 64.92
        },
        {
            "text": "to the game. Yeah, uh, uh, and we want when when they approach the Marvel characters, we want them to be very familiar and identifiable, but also unique and ownable for each game. So when you see Spider-Man, it's not just any Spider-Man, like that's Spider-Man from Marvel's Spider-Man on PS4. Yeah, we're building a new universe with Insomniac, a new Spider-Man, telling a new story, right? So we want to make sure that it still feels right, but it's new and different. You don't know what's going to happen. I mean, we did a huge study of the costume because, you know, we we think Spider-Man is one of the, if not the best designed superhero costumes of all time. Damn. So if we change anything, we want to understand what the original suit did. What does the red mean? What the blue means? The white? All the elements, even the spokes on the mask, how many should there be? So really, we studied it and before we changed anything, we just said, how can we analyze it? How can we add something to it, but still respect Stan Lee, Steve Ditko,",
            "start": 103.4
        },
        {
            "text": "spokes on the mask, how many should there be? So really, we studied it and before we changed anything, we just said, how can we analyze it? How can we add something to it, but still respect Stan Lee, Steve Ditko, John Romita Sr. and all the great creators who made that suit what it is. Well, what I loved about them, Brian talking about it today, because he's doing the developer thing, we're not talking about this, hey, who else are there any, you're not going to get any secrets from us. I don't want, not looking for the secrets. I'm complimenting you. We protect the secrets. I'm saying what he was saying though, that kind of started bringing me around on the suit, on the white Spider, was like, somebody asked in the crowd, how much liberty has Marvel given you to play with it? And he's like, well, as long as we can justify anything we're doing, that's how we do it. And he's like, there's a reason the suit looks like the suit. And so I understand, of course, I'm I'm saying, stick with me. I'm sticking with Uncle Ben had some",
            "start": 148.64
        },
        {
            "text": "anything we're doing, that's how we do it. And he's like, there's a reason the suit looks like the suit. And so I understand, of course, I'm I'm saying, stick with me. I'm sticking with Uncle Ben had some kind of white Spider business. It was his logo and now he's keeping on, right? Not canon, not canon. I actually have a side white Spider business if you guys want to buy some white, oh, you're selling white Spider. White Spider sounds awesome. So my favorite thing is, uh, so Brian, the creative director on the game, his passion was so obvious, not just from him talking about the game, but showing it in just every little detail, how stoked and hyped he was for how Spider-Man it looked and felt. Like you can just see looking at this, you're like, oh man, they nailed it. Like within 5 seconds, you're like, they got it right. Yeah, Brian and the team at Insomniac are incredible. They're all like super passionate about and then from day one, just immerse themselves in Spider-Man. And we're lucky because we're just right down",
            "start": 185.76
        },
        {
            "text": "Yeah, Brian and the team at Insomniac are incredible. They're all like super passionate about and then from day one, just immerse themselves in Spider-Man. And we're lucky because we're just right down the road from Insomniac Games. Our office is like 10 minutes away from their office and I get to visit them. We get to see stuff in progress. We get to talk about the story. We get to talk about the gameplay. We get to talk about the suit design. And it's not just for the show, it's palpable every day. Yeah, in there, how much they love Spider-Man and how much they care. We all care so deeply about. I mean, everybody remembers when they first met Spider-Man, their first experience with Spider-Man. I had a cardboard standing of Spider-Man in my bedroom growing up. I was an artist in a former life, which still hangs by the way in my mom's seventh grade classroom. Um, and so Spider-Man is a very important character to everybody. And like, none of that is lost on on anybody in Insomniac and it shows. Yeah, I mean, the",
            "start": 226.0
        },
        {
            "text": "by the way, in my mom's seventh grade classroom. Um, and so Spider-Man is a very important character to everybody. And like, none of that is lost on on anybody in Insomniac and it shows. Yeah, I mean, the the the first lunch we we got together, we were sitting around talking about, hey, when's the first time you experienced Spider-Man? And we all realized that when we were all six years old, we all had the same Spider-Man Underoos. Yeah, so we we have loved this character all our lives and we really live and breathe that idea of power and responsibility. And and and Bill's son's name is Peter, just in case you had any question there. Go dedication. We're talking about na na. So now we jumped right into this. It's E3. We're excited. Spider-Man. What I don't didn't do a good job for everybody watching at home is to explain who you guys are. Oh yeah, let's rewind it. You're Marvel Games. Yeah, so we're Marvel Games. We're out here, uh, in Glendale. We out here, uh, about two and a half years ago. Yeah, uh, they kind of",
            "start": 266.12
        },
        {
            "text": "is to explain who you guys are. Oh yeah, let's rewind it. You're Marvel Games. Yeah, so we're Marvel Games. We're out here, uh, in Glendale. We out here, uh, about two and a half years ago. Yeah, uh, they kind of reassembled the Marvel Games team. Uh, I came from the East Coast. I've been lucky enough to be working with Marvel in publishing since the early 90s. I started writing for Marvel Age Magazine and then I joined the staff and became a copywriter, then started writing comics, then started editing comics. Had that long run. And uh, Bill's being modest. He edited all the Guardians of the Galaxy comics that became the inspiration for the films. Yeah, put that team. Yeah, he did. Bill, right? So I remembered Rocket Raccoon when I was 14 and there was that Rocket Raccoon miniseries and I said, I want to bring him back. Everyone made fun of me. Yeah, I said, come on, he's short, he's furry, he'll be our Wolverine. He's a rocket with a big gun in a jetpack. What's not to like? Attitude. Yeah, you made it happen. And then the",
            "start": 309.4
        },
        {
            "text": "everyone made fun of me. Yeah, I said, come on, he's short, he's furry, he'll be our Wolverine. He's a rocket with a big gun in a jetpack. What's not to like? Attitude. Yeah, you made it happen. And then the call came, uh, to reassemble the games team and I wanted to work with this guy. So I jetted out here and Mike Jones came from two decades of of building games, traveling the world. Yeah, so I, you know, I'm lifelong Marvel fan and uh, worked in game development, game publishing my whole career and never thought I would ever get a chance to work on Marvel properties or games. And and uh, you know, I worked at Capcom for a while, which was a brush with Marvel. Yeah, uh, but then yeah, two and a half years ago, this opportunity came up and Marvel was getting really serious about like, hey, our games should be awesome, as awesome as all of our other entertainment properties: movies, TV, publishing. So we're like, all right, let's do it. Let's partner with the best in the business. And here we are. Here we are. And for years,",
            "start": 356.28
        },
        {
            "text": "as awesome as all of our other entertainment properties: movies, TV, publishing. So we're like, all right, let's do it. Let's partner with the best in the business. And here we are. Here we are. And for years, people like, where you when we join, they're like, where are your big games? Where are the console games? Where? And it's like, it takes time. It takes time. You have to get there. That's the thing is it's like that time and energy, it's going to pay off and it's already starting to pay off. I remember when Greg and I got to go see uh, Avengers, uh, back in the day and it was uh, because the Marvel Games got us in and there was this whole presentation before and they're like, we are Marvel Games. This is our future. We are building towards this. We're partnering with Telltale for this. We're doing like all these different partnerships. And now to see Spider-Man with Insomniac, to see Avengers with uh, Square Enix, it's like we're building this this Games Marvel Games universe that is so exciting and I feel that the",
            "start": 399.84
        },
        {
            "text": "different partnerships. And now to see Spider-Man with Insomniac, to see Avengers with uh, Square Enix, it's like we're building this this Games Marvel Games universe that is so exciting and I feel that the quality control is the most important thing and that's obviously you guys get and that's what takes the time. You know, we don't want to rush anything out. We don't want to do Spider-Man the game that's a game based on the movie and rush it out for a movie window. That's not what we're about. We're like, let's just make the best Spider-Man game and release it when it's ready. And yeah, and think of gaming as it's not a derivative business. It's another pillar of the brand. You know, people, you know, the movies come out twice a year, starting three times a year this year. Um, we have our Netflix shows, TV shows that people love to binge and watch. Comics, people reading the comics weekly, monthly, but people are playing our games every day and experience our characters stories every day. It's an opportunity to",
            "start": 437.52
        },
        {
            "text": "that people love to binge and watch comics. People reading the comics weekly, monthly, but people are playing our games every day and experience our characters stories every day. It's an opportunity to tell new stories, engage with fans in different ways, introduce them to new characters they may not know about. As you've seen, Mr. Negative, Martin Li, Miles Morales, Yuri Watanabe, right? We're going to keep mixing it up. Um, but games is a very, very important destination now for Marvel storytelling, Marvel fans and the quality you've come to know and love from that Marvel brick. Right, right. We want you to see that Marvel logo on a game package and be like, oh, it's going to be awesome. Yeah, seeing Mr. Negative in this game, I think is such a huge selling point because that shows that it is not just the Green Goblin story we've seen a million times. This is really for fans and I think even for people that aren't necessarily the hardcore Spider-Man fans, it's a good introduction to the wider world. You mean",
            "start": 482.44
        },
        {
            "text": "Goblin story we've seen a million times. This is really for fans and I think even for people that aren't necessarily the hardcore Spider-Man fans, it's a good introduction to the wider world. You mean not know who he is, but you're going to learn. We wanted to mix it up and we're we're really inspired by like looking at our Netflix shows and you see Jessica Jones and most people did not know like, what's a Kilgrave? What's a Purple Man? And we knew what a Purple Man was and they really put the spotlight on him and elevated him, made it so cool. And so we thought this is our opportunity to, you know, we're going to have a lot of familiar faces in this game, but why not pick a character that we believe in? It's only been in comics for the past five to six years, but we believe has a great potential. Let's put the spotlight on him. Let's elevate him. And then the world will be like, I love Mr. Negative. He's awesome. Which to be clear was not, it's not like we for, we're like, oh, this game has to have Mr. Negative.",
            "start": 522.16
        },
        {
            "text": "let's put the spotlight on him. Let's elevate him. And then the world will be like, I love Mr. Negative. He's awesome. Which to be clear was not, it's not like we for, we're like, oh, this game has to have Mr. Negative. That was Brian and the team to us being like, we want to, we want to take this character and put our spin on it and like introduce them to the world. And we're like, hell yeah, let's do it. So that's an for me, how does, how did these partnerships start? You guys two and a half years ago, we're bringing Marvel Games together. We're only going to put out good stuff. Is it you then going to Insomniac? Is an Insomniac coming to? It's music and lyrics, man. Like, so sometimes, sometimes you write the music first. Sometimes partners come to us and they're like, hey, we have an awesome pitch for a game. We have a really cool idea. We'll talk about it. We'll high five. We'll rock and roll. Sometimes we're like, we really respect this develop. We really respect, you know, uh, what these developers do, these creatives do in",
            "start": 557.6
        },
        {
            "text": "cool idea. We'll talk about it. We'll high five. We'll rock and roll. Sometimes we're like, we really respect this develop. We really respect, you know, uh, what these developers do, these creatives do in this space, this genre, whatever it is. We think this would be a good fit and we go proactively talk to them. So we're we're actively planning what our portfolio looks like, what types of games we're making, what platforms they're on. We're looking at mobile, console, PC, VR, all kinds of stuff, right? And we want to put the best characters and franchises and experience on the best platforms with the developers that are best at doing that stuff. And that's the that's the fun that we get to have is we're not just one developer or one publisher. We get to go out and work with the best of the best, right? And I think you mentioned it earlier about some of the announcements we made towards the end of last year and this year, our partnership with Insomniac and PlayStation, right? Our Telltale's Guardians of the Galaxy",
            "start": 595.32
        },
        {
            "text": "series, bringing back Marvel vs. Capcom and now our Square Enix partnership with Crystal Dynamics and Avengers game. And people without us saying anything immediately like four corners made a square and they're like, oh, we see what they're doing. They're serious, right? And this is a very historic E3 for, I feel like I'm rambling now, but this is a very historic E3 for us because we've been, you know, with our with our partners, Insomniac, Capcom, LEGO, Telltale, we've been working really, really hard to bring some awesome content to the fore and to have three big games at this conference, have our Telltale Series going on, have two games in Sony's press conference and have Spider-Man close out the show. What an honored spot. Like, it's incredible, right? And and and but it's just the beginning. Oh, that's so",
            "start": 635.96
        },
        {
            "text": "excited being in that room today when we did saw the demo. There was an energy where it's just like, as it was happening, we just kept looking at each other being like, this is so cool. Well, it's just you're nailing it. And the like, you see the demo, whether it's, you know, in behind closed doors or what we saw at the conference and it's like, right, that's what a Spider-Man game should look and feel like. Yeah, when you come in that first time and she's like, you got this. He's like, yeah, I got this. And it's right into just pop, pop, pop and using new gadgets and doing all the stuff that we haven't done in a Spider-Man game before. Like, that's awesome. This Spider-Man, he's uh, he's been uh, fighting crime for about eight years. He's experienced. He's like an athlete at the top of his game. And like, you're right, he",
            "start": 679.6
        },
        {
            "text": "game before. Like, that's awesome. This Spider-Man, he's uh, he's been uh, fighting crime for about eight years. He's experienced. He's like an athlete at the top of his game. And like, you're right, he he'll have Yuri say, do you have this? And he may say, yeah, I got this. I got this. But then in true Spider-Man fashion, a few, yeah, right before he went the helicopter, like, don't screw this up, right? You know, yeah, so a really, yes, he's going to be experienced, but we're we're never forgetting the humor of Spider-Man. And that's part of the huge reason why we partner with Insomniac on it, because they really bring the humor. They bring the personality and the the humor that Spider-Man has. It's it's, I'd say it's almost part of his powers. You know, he could stick to walls. He has the spider-sense. He has the agility. He has the strength. And he uses webbing. He builds webs. Don't forgot his mind. And he also uses humor as a weapon when he's fighting a foe that may be more powerful than him, that's older than",
            "start": 722.08
        },
        {
            "text": "has the strength and he uses webbing. He builds webs. Don't forgot his mind. And he also uses humor as a weapon when he's fighting a foe that may be more powerful than him, that's older than him to get them off their game. He may use humor, but he always uses it with himself too, as we do as we go through our daily lives and we kind of have that voice in our head as we talk to ourselves. So hopefully you'll see that that fun of fun and humor throughout it all. You guys get it. That's the thing is like when I was watching the demo, like, yeah, the the parts we had seen of, you know, don't screw this up and all that. But there was in the behind closed doors demo a sec, a part where there was a a steel beam that was on a chain and they you could have fought all the guys and not done it. Instead, you went that and did that and and hit them all and everyone in the room laughed. Like, oh, that's humor combat. I mean, if you look closely, hopefully everybody will get a chance to to go in the theater",
            "start": 760.8
        },
        {
            "text": "you went that and did that and and hit them all and everyone in the room laughed. Like, oh, that's humor combat. I mean, if you look closely, hopefully everybody will get a chance to to go in the theater because they're playing it differently and they they're trying different things. Like that little uh, web uh, trap that he uses, you can actually use it between two guys and they'll they'll pop together. Uh, when you web them up with the impact webs, you when you in the demo that we showed at the uh, press conference, he knocks them up and sticks them to a wall. You can swing them around, stick them. I stuck a guy to a parking meter one time or to a car that was driving by. And so it gets really, really sort of dynamic and organic when you start getting in there messing with all your spider powers and your tech and your web abilities. But something that we haven't really shown much of, but we get asked a lot about is that human side, that Peter Parker side. This game is very much going to show. I mean, Bill",
            "start": 802.04
        },
        {
            "text": "tech and your web abilities. But something that we haven't really shown much of, but we get asked a lot about is that human side, that Peter Parker side. This game is very much going to show. I mean, Bill loves to talk about how the best Spider-Man stories are the ones where Peter's and Spider-Man's worlds collide, right? And that's actually one of the reasons why Mr. Negative is such a great villain because his philanthropist persona, Martin Li, where Aunt May works at his F.E.A.S.T. shelters. Yeah, and Mr. Negative as a super villain foil to Spider-Man is just a perfect nexus of we're going to bring Peter and Spider-Man's worlds together in a way you've never seen in a game. Right? The original Spider-Man creators were so smart. You know, before they made superhero comics, you know, Stan Lee, Steve Ditko, John Romita Sr., they were working on like teen romance comics, right? So when they created the first Spider-Man comics, they didn't leave that behind. It was revolutionary that it was a superhero story and they",
            "start": 837.04
        },
        {
            "text": "Sr. they were working on like teen romance comics, right? So when they created the first Spider-Man comics, they didn't leave that behind. It was revolutionary that it was a superhero story and they brought that soap opera element it and you had that awesome supporting cast. And as Mike said, the best stories are where Peter's civilian lives that he's trying to protect are in danger because of his costume lives and they're smashing together. So here, you know, Peter and and every Spider-Man story is a Peter Parker story. He's always Peter and he's always Spider-Man. And it's when these worlds collide, you have to make decisions like, wait, if if Martin Li is Mr. Negative, do I take him down? That's going to ruin Aunt May's life because she's finding meaning her life. She her life will be all right. Or or or what if at the soup shelter isn't like everything? It gives her meaning. It gives her purpose. Go to the library. But more importantly, what if Martin Li finds out who he is? Then is she going to be in",
            "start": 882.84
        },
        {
            "text": "what if at the soup shelter isn't like everything? It gives her meaning. It gives her purpose. Go to the library. But more importantly, what if Martin Li finds out who he is? Then is she going to be in danger? She this great escalation of drama that and and worlds colliding that only I think come in a in a in a true Spider-Man story. That story I think is one of the main reasons we're so excited about it. Uh, thank you for bringing it by. 2018, correct? 2018. Don't you better hit 2018. I'm sick of waiting already. Uh, Spider-Man saying, don't mess this up. Don't mess this up. Don't screw this up. Don't screw up. Unanimously, right? Absolutely. One of our Kinda Funny Approved Games show. You need to go give this to Insomniac and take a photo with them. All right, we'll do it. Oh, we'll do it. One of our, can can we get a round of applause? One of our Kinda Funny Approved. There you go, guys. Awesome. Thank you. Congratulations, guys. Now you, thank you so much. We've been we've been waiting a long time to do this. We've",
            "start": 928.16
        },
        {
            "text": "a round of applause. One of our Kinda Funny Approved. There you go, guys. Awesome. Thank you. Congratulations, guys. Now you, thank you so much. We've been we've been waiting a long time to do this. We've talked about getting on the show and we've been hard at work on Spidey and Capcom and everything else. But thank you so much for thank you guys. You got to make it happen. You guys on the Gamescast on the big stage here. All right, be done. Thank you.",
            "start": 971.52
        }
    ]
}