{
    "id": 2710,
    "video_id": "HCtzFNrDWeg",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Amazing Looking E3 2017 Xbox Games - Kinda Funny Games Reacts",
    "description": "Greg and Tim breakdown some amazing upcoming Xbox One games.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1497233660,
    "duration": 469,
    "transcript_chunks": [
        {
            "text": "What's up guys? I'm Tim Gettys, this is Greg Miller. Now, Greg, the Xbox conference just ended. Sure did. Four games shown, sure. Some of them I was really, really excited for. Not not that many though. Yeah, well, enough enough to make a video with multiple games in it. This one, one of the games I'm most excited for of all of E3 that I've seen so far, The Last Night. The Last Night. Oh my God, this looks cool. It looks awesome. Uh, what do they call it? They call it a steampunk or cyberpunk platforming. So it the it's a 2D cyberpunk open world with four unique districts to explore. Gameplay described as a quote cinematic platformer. H, yeah, rock hard. This is one of those things where I I, you know, people hit us up all the time to come see games at shows, PAX, E3s, whatever. And these guys hit us up and they gave me one screenshot and the screenshot was I think it might have been him and bed or whatever and I was like this looks oh no, it wasn't even him and bed, it was him getting out to get into",
            "start": 0.08
        },
        {
            "text": "and they gave me one screenshot and the screenshot was I think it might have been him and bed or whatever and I was like this looks awesome and I they kept coming back 'cause I wasn't getting back to him and I was finally like, can you share me a trailer? And they sent me this trailer early and I was like, we are all **** in on this. And I gave him Nick and Andy to go see it. They have an appointment so I didn't even see it when you guys were first watching. I just heard the music playing and I was like, oh, that sounds cool. But now actually seeing it in motion, it is just it's breathtaking. It's funny, you know, we were talking about it after the fact and you know, going through and looking at some of the stuff, you know, was it was created out of a six-day game jam or whatever. They did the prototype and then now it's coming out from this like fully fledged Raw Fury",
            "start": 44.6
        },
        {
            "text": "through and looking at some of the stuff, you know, was it was created out of a six-day game jam or whatever. They did the prototype and then now it's coming out from this like fully fledged Raw Fury game 2018. They're saying on Xbox One, PC, and Mac, right? Console. This is one of the console debut exclusives or whatever. Very, very exciting. I cannot believe it looks this good. We've seen a lot of artsy games recently, especially with that kind of retro flare, but this is what I've been wanting to see, something that really kind of pushes it to the next level with the the lighting where it's 2D and 3D but it doesn't look cheap and corny. Sure, yeah, I understand. I mean, this looks genuine. It looks so good. For me, the the moment that sells in that trailer is when he pulls his gun and the guy in the hot tub pulls his gun up too. I'm like, that is just that looks beautiful. So moving on to the next thing, something that wasn't necessarily a huge surprise, but I I'm happy it was there for to put in your E3. I",
            "start": 78.88
        },
        {
            "text": "pulls his gun up too. I'm like, that is just that looks beautiful. So moving on to the next thing, something that wasn't necessarily a huge surprise, but I I'm happy it was there for to put in your E3. I did it. Definitely couldn't have been uh Ori and the Blind Forest, which is now officially called Ori and the Will of the Wisps. Nice. It's that's a hard one to say if you have a list. Will of the Wisps. Um, no gameplay seen here. It's all just kind of art and uh, you know, just kind of cinematic get you back in that Ori world. Yeah, and which is very somber, very sad. A lot of the characters here. It ends with that that owl looking at what seems to be his parents, his whole it looks like his whole people, like all people turned to stone. One little he's one little owl feather there. Very heartbreaking. Makes me think of Port. No release date uh given. I expect this maybe a March 2018 type of title. Okay, um, they're excited about it. It looks great. More Ori is super good. I think it's further out than then you think. I",
            "start": 115.36
        },
        {
            "text": "of Port. No release date uh given. I expect this maybe a March 2018 type of title. Okay, um, they're excited about it. It looks great. More Ori is super good. I think it's further out than then you think. I think so. I think you would have shown more gameplay. You would have done gameplay here if you were that close to it. This trailer and the reason one of the reasons I say is because I remember us playing Ori at GDC that one year when Microsoft did that big event down there, the Showcase. Yeah, I see them doing that again. Hey, here's here, let's play a GDC. Let's do something. Yeah, I think it came out not too far after that if I remember correctly though. It's still maybe it's Definitive Edition playing with my perspective of time too. I feel like Ori's been so recently that you would need more time with this too. No, that's definitely a Definitive Edition. Ori 1 was a while back. Really? So I guess it was was launched or was it launched? Do you recall? It it was not launched but it it was after that was um but yeah.",
            "start": 156.72
        },
        {
            "text": "that's definitely a Definitive Edition. Ori 1 was a while back. Really? So I guess it was was launched or was it launched? Do you recall? It it was not launched but it it was after that was um but yeah. Very, very exciting stuff. My alom, I hope things work out well for him. I don't like how Sandy looks like can't always there for him. It's okay. It's okay. But anyway, very excited for this game. Ori 1, one of my favorite um Xbox One games so far. Moving forward, we got this game which is which is interesting. It's called The Artful Escape, right? Didn't get to see much of it. This trailer is more proof of concept of art style than anything and I love it already. That's a great art style. I love this idea of when he busts out the guitar and he's in his little space suit. Sure. Okay, I want to know more about this game. What is this game? It's a game that has my interest piqued as they say. I enjoy that it ended saying when it's damn ready the release. Welcome to Indie Games in 2017. Uh, but I did a little digging.",
            "start": 191.04
        },
        {
            "text": "game. What is this game? It's a game that has my interest piqued as they say. I enjoy that it ended saying when it's damn ready the release. Welcome to Indie Games in 2017. Uh, but I did a little digging into this. I wanted I wanted to see what was up with it on his detective glasses. This game began life as a Kickstarter project called The Artful Escape of Francis Vendetti back in 2016. It did not get funded. Oh, and it found a publisher in Annapurna Interactive who seemed to be just killing it. ****, you kidding me? These guys are cleaning up over there. What up, Devolver, coming off right up. Uh, Edith Finch, which you enjoyed very, very much. So what I did actually was I went back to see if there was anything else from this game and there was back at uh PAX. What? Which PAX was it here? I'm not even sure. But we got we can see a little bit more actual gameplay. Oh, a PAX from last year. Look at you again, the detective vision he's got. He only sees threats. So there you go. It's a bit more than we saw on the",
            "start": 230.68
        },
        {
            "text": "we got we can see a little bit more actual gameplay. Oh, a PAX from last year. Look at you again, the detective vision he's got. He only sees threats. So there you go. It's a bit more than we saw on the trailer and this kind of gives a better idea. But this is a better idea of what game the actual game looks. It looks like a platformer but you're playing as me and it's in the Broken Age art style, which I dig. I dig all those things. A multi-dimensional adventure. Now all this is old so who knows what makes it into the final game. But I mean here you can see it's a 2D platformer with a bit more of the the kind of choices for for storyline and all that. Okay, he has his guitar. It looks like a fun time. Yeah, it looks like a good one. Looks it looks like if uh Wes Anderson made a video game, you know what I mean? Cartoon. Okay, FL too. I'm in that. Okay, then uh moving on forward. Finally, Jesus, God, finally Cuphead get in a release date. Yeah, September 29th. Will it be good? Will it be good, Tim? Everyone learn the",
            "start": 273.56
        },
        {
            "text": "mean cartoon. Okay, FL too. I'm in that. Okay, then uh moving on forward. Finally, Jesus, God, finally Cuphead get in a release date. Yeah, September 29th. Will it be good? Will it be good, Tim? Everyone learn the boss battles. When the boss battles first come and then they said they were too hard and then also people were like, hey, why don't you make some platforming levels? Seems like that delayed the game forever. You get the platforming levels first time people are like, I don't like these platforming levels. They're not as good as the boss battles. From having played the platforming levels, I do not think they're going to be good. Having played the boss fights, they're really hard, which I think is going to be really good when we have it's not just an E3 demo and I'm not just playing for 5 minutes at a time. I do think it's going to be the trial and error gameplay that we we love from back in the day. Obviously the art style is amazing. The music sounds great. Uh, will this game be good? Yes, I think the game",
            "start": 317.52
        },
        {
            "text": "I do think it's going to be the trial and error gameplay that we we love from back in the day. Obviously the art style is amazing. The music sounds great. Uh, will this game be good? Yes, I think the game will be good. Will it be a 10 out of 10 masterpiece? No. Could it have been? I think it could have. The hope would be that again that they came out. They're like, here are the levels we made for you, ****. And every all the **** were like, we don't like them. They went away. Maybe they came back and they actually made good levels. You know what I mean? Doubt it. Okay, I doubt it. But we'll see. Still very excited for Cuphead. Okay, um, and then here you go. Tacoma got the release date, August 2nd. Steve Gaynor, how does this make you feel? Real good. Glad it's finally coming up. I'm I'm excited to play. It's it's one of those it's a Steve Gaynor game. It's a Fullbright game. So it's all about narrative. It's all about adventure. It's all about exploring these environments. So every time I Steve comes by with the demo, I'm like, I",
            "start": 355.84
        },
        {
            "text": "a Steve Gaynor game. It's a Fullbright game. So it's all about narrative. It's all about adventure. It's all about exploring these environments. So every time I Steve comes by with the demo, I'm like, I don't want to see anymore. Even this, I'm like, I don't want to see much more. Let me just get in there. Let me play it. Let me explore the space station. Figure out what went wrong and be a complete creeper. Let me go through your emails. Let me listen to your conversations. Let me go into the bathroom. Is this sooner or later than you thought it would come? Um, or just about right? I think it's just about right. Tacoma hasn't been one of those games that I'm like, where is it? Why am I not playing it? Blah, blah. I don't think it's worn out its welcome. Last year it was like they had those behind closed doors to go see it. I feel like this has been a good time period in terms of getting it out and not wearing out their welcome. Not doing a Cuphead, not doing a Crackdown 3. I think this is the right time for",
            "start": 391.72
        },
        {
            "text": "go see it. I feel like this has been a good time period in terms of getting it out and not wearing out their welcome. Not doing a Cuphead, not doing a Crackdown 3. I think this is the right time for it. Okay, okay. Well, out of all of these, The Last Night's definitely the highest of my list. I think it's going to be hard to beat for me. I think it's up there. But for me, it's like, I think I know more about Tacoma. I know the pedigree of Tacoma. I want to play that one. Okay, yeah, they all look fantastic. Very excited about them all. Let us know in the comments. Uh, let us know in the comments below which of these games you're most excited for and if there's any games of this caliber that we should have been talking about that we're not. Till next time, you can find us here on youtube.com/kindafunnygames for all of your E3 2017 needs. Keep it locked. Subscribe or we'll come after your family. No, we won't. Trust me, we will.",
            "start": 423.96
        }
    ]
}