{
  "id": 2776,
  "video_id": "hkMAme5Pqmg",
  "show_name": "Kinda Funny Games Daily",
  "hosts": ["Greg Miller", "Tim Gettys"],
  "title": "PlayStation Trophies Are Getting Worse - Kinda Funny Games Daily 06.27.17",
  "description": "Greg's been a Trophy Whore forever, but have things finally gone too far? Tim tries to bring order to the argument.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1498595813,
  "duration": 3549,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome Kinda Funny Games Daily for June 27, 2017. That's the year. Yeah, it's a Tuesday. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys. Love Tim. Host, how are you hanging in there? Hell yeah, coming right off that Kinda Funny Morning Show, ready to do this thing. I hope you're ready because we got a banger of a show. We do. Look how many pages there are. It's a big show. There's a lot, a dozen of pages. No, you, you put it too early. You did it too. Just kidding, you can do whatever you want to. I love you very much. A huge show for you, ladies and gentlemen, so we'll get right into it. If you didn't know, this is Kinda Funny Games Daily. It is your daily source for video game news and nonsense. We jump into the news, give you a deep dive, run you through it, do your questions, do everything. Remember, you need to be part of the show at KindaFunny.com/kfgd. That's where you can put in segments, you can put in your PSN names, your Steam names, your Xbox names if you need friends, but",
      "start": 1.49
    },
    {
      "text": "Remember, you need to be part of the show at KindaFunny.com/kfgd. That's where you can put in segments, you can put in your PSN names, your Steam names, your Xbox names if you need friends, but most importantly, put in questions. They become part of the show. I love it when you craft them around the news of the day so I get to put you in there and do all these different things. Um, remember as well, we do the show live on Twitch.tv/KindaFunnyGames, but it's not a live product there. If we get something wrong, we need you to keep us honest. Go to kindafunny.com/yourewrong. You can post just the facts. We're screwing up. I don't need your editorialization, Trevor Starkey. Uh, as well, we're trying something new today for the Twitch folks. At the end of the live recording, I will stick around and read uh, subs and tips because we've been missing some and we're trying to figure out a better way to do that. However, thank you to everybody who's listening later on a podcast service or watching on YouTube.com/KindaFunny.",
      "start": 42.88
    },
    {
      "text": "We've been missing some and we're trying to figure out a better way to do that. However, thank you to everybody who's listening later on a podcast service or watching on YouTube.com/KindaFunnyGames. Remember, this is a new show. We need your subs over on YouTube. We need your reviews over on podcast services. Even if you don't use either of those platforms, please go do it. It helps us out a lot. Let's begin with what is and forever will be the Roper Report. Wow, the biggest whiff of Kevin's career on this. Wow, yeah, seventh time. You that the seventh time and there was, you weren't even there for us. Wow, Kevin. I, you guys, you need to think. Let Here Comes Andy Cortez to save of the day. Let's begin the show with what is and forever will be the Roper Report. You ****. He hit me in the nuts. God damn it. Hit in the nuts today. There are three items on the Roper Report, a Baker's Dozen. What I want to do is we're going to call him out by numbers this time for Vector. Vector wrote in to KindaFunny.com/kfgd and",
      "start": 81.76
    },
    {
      "text": "in the nuts today. There are three items on the Roper Report, a Baker's Dozen. What I want to do is we're going to call him out by numbers this time for Vector. Vector wrote in to KindaFunny.com/kfgd and asked if we could number the stories because sometimes when he's doing stuff, he gets lost in which one we're talking about. Where bullsh. Good call, Vector. Number one, Vivendi's plan to get Ubisoft is still happening and it's getting crazier. There's more wrinkles to it. I'm going to read the GameSpot story here about your update on what's going on with this possibly hostile takeover of Vivendi taking over Ubisoft, but it's important to know that it all comes from Reuters. I'm reading the GameSpot story because they gave precious context to it because I'm not a businessman. Some of the stuff they were saying, the Reuters thing, I wasn't picking up weird words. So the Guillemot have increased their stake and now collectively owned 13.6% of Ubisoft's shares and control to 0. % of its voting rights, according to",
      "start": 127.52
    },
    {
      "text": "the Reuters thing, I wasn't picking up weird words. So the Guillemot have increased their stake and now collectively owned 13.6% of Ubisoft's shares and control to 0. % of its voting rights, according to a filing by France's AMF. However, it will reportedly not seek any additional seats on the board of directors. Five of the of the 10 directors are members of the Guillemot family, including Yves, who we talk about all the time, the board's chairman. Last week, Ubisoft expanded it board, huh? Last year, last year, Ubisoft expanded its board with two new independent directors, bringing independent representation to the 50% mark. This is the point Ubisoft hoped to achieve as a means for helping to stave off Vivendi. Vivendi has steadily increased its control of shares in Ubisoft since 2015. Its ownership ownership is now up to 27% of its shares and 24.5% of voting rights. At 30%, that's the important part. So basically six, not even five and a half percent away, French law would mandate that it pursue a controlling stake in",
      "start": 170.2
    },
    {
      "text": "to 27% of its shares and 24.5% of voting rights. At 30%, that's the important part. So basically six, not even five and a half percent away, French law would mandate that it pursue a controlling stake in the company. Ubisoft and Guillemot have repeatedly spoken out against Vivendi's move, saying it would hamper the public P's ability to innovate and be agile, among other things. Vivendi said in early 2016 that it has no plans for a Ubisoft takeover, but his actions have suggested otherwise. In April, Reuters reported that Vivendi would pursue a takeover attempt this year. Last year, Vivendi took over a French developer, Gameloft, which was also founded and led by the Guillemot. Amidst all this, Ubisoft has continued to focus on live service games, VR, and support for Nintendo Switch, parentheses, most notably making the upcoming Mario + Rabbids Kingdom Battle. The company stock price reached an all-time high on Monday, though it has fallen slightly since. What do you take away from all this? So 3% away, we're getting serious.",
      "start": 219.76
    },
    {
      "text": "Mario + Rabbids Kingdom Battle. The company stock price reached an all-time high on Monday, though it has fallen slightly since. What do you take away from all this? So 3% away, we're getting serious. We're getting super, super serious here. Yeah, exactly, exactly. I mean, I feel like this is one of those inevitable stories. We've been hearing about it for so long and typically with this type of stuff, it ends with it happening. It's going to happen. Yeah, like I, I don't think that there's any way that they can get away from it. I think that they can just try to delay it as well. That's been the most, like, the heartbreaking thing about this is I think when we talk about the big publishers, right? Obviously, there's the big three who make hardware. We don't even think about them. EA, oh, the most evil company in the world. Activision, I just want to annualize ****. Ubisoft, they want to annualize ****. They want to make money, don't get me wrong, but they're also the people of like, let's make an arthouse game.",
      "start": 267.76
    },
    {
      "text": "the world. Activision, I just want to annualize ****. Ubisoft, they want to annualize ****. They want to make money, don't get me wrong, but they're also the people of like, let's make an arthouse game. Let's do something for our fans. Let's keep making Rabbids even though they're popular. Let's make a Rayman game. Let's make Valiant Hearts. Let's make something on the UbiArt engine. Well, also too, I think that Ubisoft has something special going for them in that they, they are a franchise house. It's not just like EA has its sports games and it's kind of just different sport, same game, you know? Whereas with Ubisoft, it, they have this whole range of different IP that they, they can go back to and it's similar to Bethesda in the sense that like, not every year needs to have every franchise. So they can kind of not annualize things, but every other year or every three years or every once in a while and change things up. Now, to toss something out there, you're saying because I agree with what you're saying,",
      "start": 307.44
    },
    {
      "text": "of not annualize things, but every other year or every three years or every once in a while and change things up. Now, to toss something out there, you're saying because I agree with what you're saying, but I know there is something when you say something Ubisoft game and you're using it as a pejorative, you know what that means. True. Here's an open world game, a million things to collect, a million things to do. I'm not against that. I love that. But it also runs to the fact of like, okay, cool, I'll play The Division and be super invested in that. But For Honor, which isn't exactly, you know, not apples apples exactly, but you know what I mean, isn't for me. Yeah, but for that argument, it's the same thing where it's like Madden and an NBA 2K are not the same thing either. So no, I know. I'm just saying just for the argument's sake here of what it is. But again, I, I come down on the fact that I really **** dig Ubisoft and I'm not saying I dig every one of their games. Don't give a **** about Rainbow Six. Didn't care",
      "start": 347.68
    },
    {
      "text": "sake here of what it is. But again, I, I come down on the fact that I really **** dig Ubisoft and I'm not saying I dig every one of their games. Don't give a **** about Rainbow Six. Didn't care about For Honor, you know what I mean? Like I thought Wildlands was a miss, but I appreciate that first off, they make those kind of games. They make sure they find an audience with those kind of games. For the most part, they support them. I know people right now as a, and this is me speaking from my very limited scope of what games I care about from Ubisoft. I see other Division fans on The Division Reddit upset that they're not getting more updates, that this isn't happening, what's going on with the game. Um, but I appreciate that Ubisoft doesn't ****. I appreciate that they come out and they're like, with Assassin's Creed, we're going to make an ass. Somebody asked them years ago, hey, are you going to make an Assassin's Creed every year? And they're like, we'll make an Assassin's Creed every year as long as you",
      "start": 384.72
    },
    {
      "text": "Creed. We're going to make an ass. Somebody asked them years ago, hey, are you going to make an Assassin's Creed every year? And they're like, we'll make an Assassin's Creed every year as long as you buy them. And then when you stopped buying them or it seemed like it tapered, they were like, we're take a year off. And they didn't **** you. They came back a year later with Origins and it's like, it looks better, it looks different. We'll see what, how great it actually turns out to be. Yeah, it's interesting because my gut tells me that when I think of Ubisoft, I think of quality gaming experiences. And I feel like the last couple years that's become less and less true just in the sense that there's been a lot more uh, misses in terms of all the Assassin's Creed bugs and all that. When that becomes the story, but I feel like that just goes back to there's just more in general. There's more good, there is more bad, there is just more reporting on bugs and there are more players playing these games and",
      "start": 419.84
    },
    {
      "text": "story. But I feel like that just goes back to there's just more in general. There's more good, there is more bad, there is just more reporting on bugs and there are more players playing these games and there's betas and Early Access and all this stuff where it's like, it's just a different landscape, right? Uh, but thinking about even what they've done with with the Rayman franchise of bringing back 2D Platformers and like these, the Rayman games they've been putting out, Legends and Origins, those are the best Rayman games that exist. Sure. I mean, Rayman 3 is awesome. That's a 3D platformer. Uh, but the original Rayman platformer, like 2D platformer, it was, it was good and it's solid. But these new ones are up there with Mario games. And I'm saying that as a huge Mario fan. But they did something different with 2D Platformers. And I think that that is an example of Ubisoft really being committed to quality in a, in a lot of ways. And I think that when you compare them to the Activision and EAs, that's what",
      "start": 452.8
    },
    {
      "text": "uh, 2D Platformers. And I think that that is an example of Ubisoft really being committed to quality in a, in a lot of ways. And I think that when you compare them to the Activision and EAs, that's what sets them apart is that there's quantity and quality. And of course there are misses and of course there are a lot of uh, fully buggy games. But it sounds like the last couple misses they've had in terms of The Division and Rainbow Six Siege coming out and being a little content light, they do over the year grow and add to it. For Honor is a great example of it coming out and like, hey, this is a game that every was super stoked about and then, oh, it seemed like the mainstream walked away from, but the core stayed and they continue to add to that to where now, now it is a game that you see on Twitch all the time. And I, I guess that is what to me makes Ubisoft stand apart is that it does have all the Ubisoft games, but they really cater to the audience of each one of those games in a way that the other publishers",
      "start": 494.12
    },
    {
      "text": "I, I guess that is what to me makes Ubisoft stand apart is that it does have all the Ubisoft games, but they really cater to the audience of each one of those games in a way that the other publishers don't necessarily have that kind of microcosms within its library. Yeah, I mean, what scares me about it is I think that Vivendi is, or I'm sorry, that Ubisoft is good to the gamers for the most part. You know what I mean? First off, you play stupid, who the **** cares? I get it, you know what I mean? But they have franchises people want. They have audiences that want us. They want to take care of. They make games for them. They stick around. They somehow walk the line better than most in terms of, yeah, we're a business, yes, we're making art, yeah, there's a, a middle area where we can all be happy. The problem with me in Vivendi is that I feel like Vivendi comes in with a lot of baggage in terms of their history, right? Because I'm, I was looking up to make sure I had it all right. You know, August 2006, Vivendi signed a",
      "start": 541.44
    },
    {
      "text": "me in Vivendi is that I feel like Vivendi comes in with a lot of baggage in terms of their history, right? Because I'm, I was looking up to make sure I had it all right. You know, August 2006, Vivendi signed a deal with Spiral Frog to distribute Vivendi songs online, blah, blah, blah. On September 8th, uh, the company announced that Sierra Entertainment, a division of Vivendi Games Group, would be publishing the new. When you start throwing out that like Vivendi was with Sierra, it's like, oh, all right, these are the people who are populating that THQ space. I always talk about, we're not AAA, we're not, we're not independent. We're these mid-tier weird ass games that don't really make money, but we're trying to make money. Like we're putting these things out there that aren't a quality product, but we're trying to make money off of them. And I feel like those companies have gobbled up over the last 15 years to get it to the point that there are just a cup, there is the big three and then there are the big three third",
      "start": 581.44
    },
    {
      "text": "money off of them. And I feel like those companies have gobbled up over the last 15 years to get it to the point that there are just a cup, there is the big three and then there are the big three third parties. And then from there, there's the like the Bethesda and like 2K Games of the world, I think, are the uh, outliers more than anything. And so that's the thing. On December 2nd, 2007, Vivendi announced that it would be merging its Vivendi Games unit with Activision in a $8.8 billion deal. This will allow the merged company, Activision Blizzard, to rival Electronic Arts, da, da, da, da, da. And it's so, it's one of those things of, it reminds me a lot in, in terms of my knowledge based about it is very limited. Obviously, my pool is very shallow. But it reminds me of when Ziff Davis bought IGN, right? And we were all like, oh my God, Ziff Davis, these are the guys that ran EGM into the ground and sold off. And it was like, they were like, no, no, no, we aren't those guys. We're just that name. I don't know how much of the Vivendi",
      "start": 621.96
    },
    {
      "text": "oh my God, Ziff Davis, these are the guys that ran EGM into the ground and sold off. And it was like, they were like, no, no, no, we aren't those guys. We're just that name. I don't know how much of the Vivendi from 2007 that was like, hey, we're going to, we're out to make money and make mid-tier, mid-tier games that are just making a profit is the Vivendi now. But that's the fear, right? That is in, in a world where is that Activision drops this because it can't be FR, it can't be annualized. That's not what I want to hear. Granted, Ubisoft makes annual franchises, but they usually are making good games on those. I mean, the thing that bothers me the most about this is the fact that there's obviously a fight between the Guillemot family and Vivendi. Yeah, obviously there's disagreements and their visions do not align. If their visions aligned, this would be a very different conversation and they, the takeover could be a mutually beneficial thing. And we've seen that before. And we are on a different side of this. But even with",
      "start": 669.2
    },
    {
      "text": "visions aligned, this would be a very different conversation and they, the takeover could be a mutually beneficial thing. And we've seen that before. And we are on a different side of this. But even with like Rooster Teeth and Fullscreen, I think that I've seen Rooster Teeth go from what it was to what it is now via the help of Fullscreen and having partners that believe in the same vision. And that wasn't an issue at all. Ziff Davis and IGN, I would say, is the same thing to an extent where Ziff Davis came in and made IGN better. I watched a movie last night that was in association with IGN Entertainment. I was like, what the ****? The things IGN are doing now on a giant scale are because Ziff Davis allowed them the resources to grow in the ways that they're, they're growing. And I feel like isn't what this is, what this is, is Vivendi coming in and being like, all right, cool, it's cutting numbers. We really like your portfolio. We love to come in and own all these franchises. It's about monetizing a",
      "start": 711.52
    },
    {
      "text": "this is what this is, is Vivendi coming in and being like, all right, cool, it's cutting numbers. We really like your portfolio. We love to come in and own all these franchises. It's about monetizing a portfolio more than it is about actually believing and curating the content. And you can tell that the Guillemot family are all about that with with Ubisoft. They need to make money at the same time. Yeah, Beyond Good and Evil is a perfect example. Them coming out and crying and stuff. You can tell how much they, they care about the games that the gamers care about. And that's what's important. Never going to see uh, someone come out and cry about Madden, you know, or any, any of those games. And I don't want to single out Madden, but like uh, even any, well, I guess Yarny is a, what it wasn't called Yarny Unraveled, Unraveled. Yeah, Unravel. Yeah. Uh, that's an exception to what I'm saying. But that is EA copying the Ubisoft uh, playbook that we were talking about. And why we praise uh, Ubisoft every year at E3, the Ubisoft press",
      "start": 749.4
    },
    {
      "text": "yeah, Unravel. Yeah. Uh, that's an exception to what I'm saying. But that is EA copying the Ubisoft uh, playbook that we were talking about. And why we praise uh, Ubisoft every year at E3, the Ubisoft press conference is my favorite and the one that I look forward to the most of the third parties. And I think that's because their library is so vast and varied and they do have a commitment to at least trying different things and committing to visions on a game by- game basis. And I don't think Vivendi is going to have that same outlook. And I think that's obvious with the conflict that is already arising here. 100%. And that's what's scary about it. And that's why it's, you know, I mean, we don't know Vivendi. We don't know the people behind it, blah, blah, blah. But the fact that a guy that I think is doing it right is clearly going to Canada to get investors to try to spend off. And granted, it's like, part of it's probably pride of like, somebody was buying up Kinda Funny shares. I'd try to buy against probably",
      "start": 792.24
    },
    {
      "text": "is clearly going to Canada to get investors to try to spend off. And granted, it's like, part of it's probably pride of like, somebody was buying up Kinda Funny shares. I'd try to buy against probably unless, unless we had the same vision. Don't **** think about it, Burnie Burn. But what's interesting there too is the fact that they're, they're talking about how uh, Vivendi is even in the last couple years, because you're bringing up the fact of, oh, maybe it's a different Vivendi. Yeah, even if it's a different Vivendi, they're still being kind of coy, saying, oh, we're not trying to do this. We're trying, try hostile takeover. We're secretly buying shares. And like, what? And now the business side of me says, well, obviously you're not going to come out and say your plans because then all of a sudden it's like, oh, they're buying them. You know, then the story is twisted in a different way. So they're, they're kind of putting between a rock and a hard place there where when you're asked for a statement, you need to make",
      "start": 834.52
    },
    {
      "text": "buying them. You know, then the story is twisted in a different way. So they're, they're kind of putting between a rock and a hard place there where when you're asked for a statement, you need to make a statement. Um, and even no comment is saying something. So, well, it's interesting. The next story, number two for you, Vector, on the Roper Report is more Ubisoft. This is Yves himself over on the Ubisoft blog talking about Splinter Cell. Quote, Splinter Cell is a, I'm sorry, this is on AMA, uh, or Reddit. Splinter Cell is a, the brand we talk about a lot. It's also personally one of my favorite series. We don't have anything specific to share at the moment, but teams are working on different things. So stay tuned for more. Then this was followed up with, I think, a response on the blog. We are receiving lots of sketches and proposals around the brand. That's that being Splinter Cell. And we're going to pick, we're going to pick one up. I think you, I think you will be able to see something, but you will have to wait for that.",
      "start": 872.52
    },
    {
      "text": "proposals around the brand. That's that being Splinter Cell. And we're going to pick, we're going to pick one up. I think you, I think you will be able to see something, but you will have to wait for that. Sketches. Yeah, I think it's just concept art. I no, I think it's, I think it's a, I think it's a pitch. I think it's just him talking about pitches and proposals. But I think it's uh, language barrier. He said the wrong word. Um, what is interesting about this and then I want to tie it back to Beyond Good and Evil where, hey, help us make the game. We're not really. I think it's been happening for a while because this isn't new where they're, oh yeah, we're making another Assassin's Creed. Ubisoft's not doing the usual cloak and dagger stuff. They're talking about their big franchises coming. And I think this is interesting to tie it back to number one of, we're doing this to get our stock prices up to make sure everyone understands that we have awesome **** coming so that you're buying the stock and not Vivendi. That",
      "start": 912.0
    },
    {
      "text": "to tie it back to number one of, we're doing this to get our stock prices up to make sure everyone understands that we have awesome **** coming so that you're buying the stock and not Vivendi. That we can sit here and make a case to our board that look at how well everything's going. And they've been doing it for a while. I, I should have brought in more of my examples, but those are the two most recent of like, hey, yeah, no, this is happening. Same thing where like, things are leaking in quotes, not like the, you know, GameStop leaks or whatever, stop leaks. But like Kotaku with Ubisoft, they're saying stuff. You rather than having it dribble out or have a big reveal about it. That's, that's very interesting perspective. And I, I totally think that that makes a lot of sense, especially when it is all about the, the positive press that you get. And I feel like Beyond Good and Evil, uh, with especially a couple days ago, there was that tech demo thing they show. Yeah. And it's like, that, that is what they need to do",
      "start": 953.28
    },
    {
      "text": "the positive press that you get. And I feel like Beyond Good and Evil, uh, with especially a couple days ago, there was that tech demo thing they show. Yeah. And it's like, that, that is what they need to do to really get uh, investors behind you, not from a, a sales and numbers point of view, but from a, a passion and, oh, we believe in this product. And the gamers obviously believe. And there is a positive um, like conversation happening around all of the, the social media spheres, whatever, about Ubisoft. It's like, all right, cool. Well, this Ubisoft is working. Let's not change things up too much. And that's the thing too, is I don't know. I think it's, I think it's, you know, hey, invest your confidence. That's what we're doing, blah, blah, blah, blah. It has the tangential relationship of people. I mean, I read all this stuff. Oh, good, you're doing what I want. You're talking about the things I want. So I start to get more not angry, but more like bristly around this Vivendi idea of a Vivendi coming in **** everything up. No.",
      "start": 992.56
    },
    {
      "text": "oh good you're doing what I want you're talking about the things I want so I start to get more not angry but more like bristly around this Vendi idea of a Vendi coming in **** everything up no stay away you know what I mean yeah I remember wet get out of here and I mean going back to it too with Ubisoft it's like they're doing such a great job of you brought up THQ but like saving the games the people wanted like South Park and now doubling down to making another one from it their own new Ubisoft SF Studio like this they're making a lot of gamer friendly moves and I think that yeah this uh Splinter Cell news is even just more of that where it's just like people want another Splinter Cell so cool let's get that conversation started Valiant Hearts man make another Valiant Hearts third and final story on the Roper Report number three former Playdead CEO's new project this is from Gatu I'm going to read it over there of course Playdead the folks behind Limbo Inside uh Dino Patti the for or",
      "start": 1037.2
    },
    {
      "text": "story on the Roper Report number three former Playdead CEO's new project this is from Gatu I'm going to read it over there of course Playdead the folks behind Limbo Inside uh Dino Patti the for or maybe Dino but I'm gonna say Dino Patti the former CEO and co-founder of Limbo and Inside developer Playdead and Chris Olsson an animator and previs visualization artist based in the UK have founded a Jump Ship an independent game Studio Bas great name Guildford and announced Somerville the Studio's first game uh Jump Ship is currently building a team of experienced developers to work on Somerville its job listings include a gameplay designer generalist programmer character controller programmer and character animator Somerville began work as a personal side project for Olsson in 2014 and by 2016 he had built a proof of concept trailer playable prototype a small online presence from documenting the development process that's a weird way to end that sentence further details about the game",
      "start": 1078.24
    },
    {
      "text": "2016 he had built a proof of concept trailer playable prototype a small online presence from documenting the development process that's a weird way to end that sentence further details about the game were not shared but a short teaser was you can find online I watched It's not that interesting but you don't know what the hell's going on cuz it's just like a house some weird giant monument in the background lightning like all right cool yeah I mean was the art style interesting cuz I feel like interesting yeah but I mean it was like it's so just a teaser just an image it's it you know you're not taking much away from anything in it but it's more exciting of like that's cool I mean I love Playdead I loved I you know I loved Limbo I **** really dug Inside didn't like the endos you talked about but then reflecting on how great the game was it didn't matter yeah Limbo and Inside are two of my favorite games of all time like if I were to make my top 50 list I think that they're both",
      "start": 1123.24
    },
    {
      "text": "about but then reflecting on how great the game was it didn't matter yeah Limbo and Inside are two of my favorite games of all time like if I were to make my top 50 list I think that they're both pretty high up there um this is very exciting to me it's always a bit of a worry when Studios that I love that make games drain starts going somewhere kind of just like Go in different places and start new teams because it's never quite the same um and sometimes we've seen a lot of success with it and other times it's like all right well it's an almost type situation I feel like the like Journey and then Abzû is an example of this where it's just like oh yes a lot of people that worked on it also worked on this and it's like well it's not quite the same sure sure sure the argument I would always feel though is like I feel like it's similar at IGN where it's like okay well you hit a glass ceiling your Co the founders aren't going to leave these directors aren't going to leave and you can only",
      "start": 1163.88
    },
    {
      "text": "feel though is like I feel like it's similar at IGN where it's like okay well you hit a glass ceiling your Co the founders aren't going to leave these directors aren't going to leave and you can only make so many games so why not Branch out and do something different and then have new Talent lead you know rise up and get those chances and I think you're seeing it I mean my example is always Naughty Dog right where I think the people who made Crash aren't the people who made Uncharted and then even now with like how much changes happened there to see Kurt step up who I remember Kurt being just a level designer right when I talked to him and now he's making Uncharted: The Lost Legacy a really cool option for them yeah definitely and also I think that just looking at the roles that they're looking for here gameplay designer generalist programmer character controller programmer and character animator I mean that tells me all right cool we're getting another Limbo and Inside Style game the",
      "start": 1199.84
    },
    {
      "text": "for here gameplay designer generalist programmer character controller programmer and character animator I mean that tells me all right cool we're getting another Limbo and Inside Style game the focus on the the animation like that's really I think important and the fact that one of like the two dudes are very like a previs artist and animator it's like cool great I do have faith in this I'm going to be interested to to keep my eyes on it yeah see what they come up in other so congratulations to them let's see what's coming out today though this is the official list of upcoming software across each and every platform is listed by the Kinda Funny Games Daily show hosts each and every day uh it's a big day it's Tuesday that's big release day uh of course I'm going to Pepper in some questions here remember I need you to be part of the show KindaFunny.com/kfgd here we go out today Danganronpa Another Episode: Ultra Despair Girls PS4 PC RPG Maker Fes 3DS timeout I wanted to give a",
      "start": 1232.72
    },
    {
      "text": "here remember I need you to be part of the show KindaFunny.com/kfgd here we go out today Danganronpa Another Episode: Ultra Despair Girls PS4 PC RPG Maker Fes 3DS timeout I wanted to give a shout out of course to Kotaku okay Kotaku has this great Roundup for the week and like coming out of doing Games Daily last week was everything went well you guys are a fantastic audience but learning where to go for this new stuff that I haven't had gathered before was kind of **** because it was right after E3 so people were off or whatever Kotaku is this amazing rundown that they're updating on the fly so shout out to Kotaku uh The Golf Club 2 on Xbox One PS4 PC Valkyria Revolution Xbox One PS4 Vita **** **** **** give it to me you know how much I love Valkyria Chronicles and the Vita yeah and the Vita of course so then when they announced this I'm like cool and they're like well you know different storyline different G I'm like I don't care it's how bad could it be not bad apparent",
      "start": 1270.64
    },
    {
      "text": "and the Vita of course so then when they announced this I'm like cool and they're like well you know different storyline different G I'm like I don't care it's how bad could it be not bad apparent well depending on who you talk to a gave it a six I was like and then you looked around like USgamer got like two out of five I was it's like it's like not doing well uh which sucks and then of course I tweeted out the IGN score and I was like God damn it and a bunch of people hit me up and they're not bun they were many people patting me on the back it's okay sorry this happened to you but one guy was like it's just review score play for yourself and then another guy who said this after defending so many 50s I can't and I'm like well I didn't say I'm not going to play it I'm just like like anything after defending so many 50s after yeah I know right cuz I'm really Greg Miller defending the five out of 10 game no no don't worry again Peter Brown sold Friday the 13th up the river over a GameSpot with that four out of 10 and I told him at E3 the first **** chance I got but uh uh no it's when anything comes out in a franchise you love you want it to be well received you want people to love it so like to wake up and see six Fu damn it and way lower than that however that last year with Star Fox of course my dog Nick 96 wrote in KindaFunny.com/kfgd just like you can it says hi guys I'm a fan of Valkyria Chronicles I bought the first two and even imported the third game because of how much I like the series I picked up Valkyria Revolution knowing full well it is a different kind of game I'm definitely disappointed with it overall despite enjoying similar games like Dynasty Warriors this is a spin-off however and and a with a completely different backstory when Valkyria Chronicles",
      "start": 1320.48
    },
    {
      "text": "after defending so many 50s after yeah I know right cuz I'm really Greg Miller defending the five out of 10 game no no don't worry again Peter Brown sold Friday the 13th up the river over a GameSpot with that four out of 10 and I told him at E3 the first **** chance I got but uh uh no it's when anything comes out in a franchise you love you want it to be well received you want people to love it so like to wake up and see six Fu damn it and way lower than that however that last year with Star Fox of course my dog Nick 96 wrote in KindaFunny.com/kfgd just like you can it says hi guys I'm a fan of Valkyria Chronicles I bought the first two and even imported the third game because of how much I like the series I picked up Valkyria Revolution knowing full well it is a different kind of game I'm definitely disappointed with it overall despite enjoying similar games like Dynasty Warriors this is a spin-off however and and a with a completely different backstory when Valkyria Chronicles",
      "start": 1355.52
    },
    {
      "text": "I'm definitely disappointed with it overall despite enjoying similar games like Dynasty Warriors this is a spin-off however and and a with a completely different backstory when Valkyria Chronicles Remastered was was released there was a survey you could take asking what players wanted from the series I'm curious if the feedback from that and the response to the spin-off will tell developers to return to the original strategic gameplay of the first three games do you see this possibly happening thanks for all the hard work and the great content you guys provide every week my dog Nick 96 you hope I mean I feel like the answer is yes all the reviews I glanced at and read like I read you know IGN summary and the verdict and I read some USgamer and it was like people being like hey man these other games were great this isn't that it doesn't touch that the new action e combat isn't that it's not strategic enough to be interesting and it's like you hope that they look into that but Sega is",
      "start": 1397.56
    },
    {
      "text": "other games were great this isn't that it doesn't touch that the new action e combat isn't that it's not strategic enough to be interesting and it's like you hope that they look into that but Sega is so weird Sega is weird but I feel like they they're not stupid they're just weird and I I think when they they look at a lot of this stuff it's like they they clearly look at this as a spin-off title right they don't look at it as a core uh Valkyria experience and I think that them kind of marketing it that way and do the surveys and stuff they are listening like this is the same Sega that is giving us Sonic Mania so it's like okay cool they they UND they understand I never my phone they understand what it is that uh that people want from their franchises and a lot of the times they give it like with Atlus and and all of that stuff but even uh the Shin Megami Tensei there's so many spin-offs and it's like that never stops them from getting back to the proper core franchise line eventually as a",
      "start": 1439.88
    },
    {
      "text": "with Atlus and and all of that stuff but even uh the Shin Megami Tensei there's so many spin-offs and it's like that never stops them from getting back to the proper core franchise line eventually as a fan of Valkyria what **** it was the marsh to PSP and I Lov don't get me wrong I mean the pro the the saddest part about all this is the fact that as great as Valkyria Chronicles 1 was on PS3 Valkyria Chronicles 2 on PSP is Far and Away a better game than Valkyria Chronicles 1 but criminally underplayed because it was put on PSP then they made three but never imported or never you know brought it over from Japan so I think the most interesting thing would be your survey results and then the sales of the remaster of Valkyria Chronicles that is on PlayStation 4 now and I think a bunch of other stuff I know it's on PC but whatever like that is the one that I think is going to speak loudest but even then I don't know if Sega cares this goes this goes back to what I was saying them being weird yeah I",
      "start": 1482.16
    },
    {
      "text": "know it's on PC but whatever like that the one that I think is going to speak loudest but even then I don't know if Sega cares this goes this goes back to what I was saying them being weird yeah I might take back the stupid thing because I almost believe that Sega doesn't worry about sales numbers as much as anyone else does and that's a problem as a business but like looking at some of the decisions they've made in the last decade uh in terms of what franchises to bring back when it really just kind of seems like it is what they want to do on their own schedule whether or not there's an audience ready for it um and I again going back to Sonic I think seeing the Sonic games we've had in the last 10 years there so many of them are like all right cool they are trying to win people back and then there's some weird things like the **** Werehog and **** and Unleashed but then you get to stuff like Sonic Boom and it's like all right you're doing this because you have a plan with",
      "start": 1523.4
    },
    {
      "text": "and then there's some weird things like the **** Werehog and **** and Unleashed but then you get to stuff like Sonic Boom and it's like all right you're doing this because you have a plan with cartoons and uh a whole structured deal to make this a multimedia thing you're not worrying about the people you know and I feel like and then at the same time they're always releasing small indie games or smaller titles like this yeah that it's just cuz they just want to do it yeah I don't know I mean my thought my fear about this would have been hey Valkyria Chronicles as people knew it was critically acclaimed but underplay didn't make us money blah blah blah let's take the brand and reinvent it for a new age what do people like to play now and it's this weird less strategy more action it's like but I see that more as like the Metroid Prime Federation Force of the the series I hope so but it seems like it takes them so long to turn around games know what I mean especially for Valkyria yeah yeah",
      "start": 1569.24
    },
    {
      "text": "but I see that more as like the Metroid Prime Federation Force of the the series I hope so but it seems like it takes them so long to turn around games know what I mean especially for Valkyria yeah yeah up next on the list Summon Night 6: Lost Borders is coming to PlayStation 4 and Vita Minecraft: Story Mode - The Complete Adventure is coming to Switch America's Army: Proving Grounds is on PlayStation 4 Ancient Amuletor is on PlayStation VR Tower Defense enjoy uh Cavernous Wastes is on PlayStation 4 and PSVR and I urge you all not right now during this show but when you have time cuz many of you driving listening go to the PlayStation Blog look at the drop and then look at the art they put up it is literally just a cavernous Cave of some kind and it's like explore **** I'm like if this thing isn't a **** easy Platinum which we are about to talk about in a little bit it **** is missing a huge boat oh man um Arizona Sunshine comes to PlayStation VR this is a worth another call out",
      "start": 1610.12
    },
    {
      "text": "isn't a **** easy Platinum which we are about to talk about in a little bit it **** is missing a huge boat oh man um Arizona Sunshine comes to PlayStation VR this is a worth another call out we have a question of course from Jamie who wrote into KindaFunny.com/kfgd but first there is a let's play of this game up on YouTube.com/KindaFunnyGames please go watch it Andy and I ran through it of course if you haven't been following we started this new thing called Party Mode which is us all **** around then there's the Kinda Funny Plays which is us like Hey we're playing a game for the first time in exploring or I want to show you the game that's kind of what this is but the game's weird and shooting zombies and it's not that great sadly which is really upsetting because everyone's comments on the let's play are like man I urge you to go play this on Vive or whatever it's better there it doesn't have the jittery controls it looks better runs better on PlayStation VR is very",
      "start": 1657.76
    },
    {
      "text": "comments on the let's play are like man I urge you to go play this on Vive or whatever it's better there it doesn't have the jittery controls it looks better runs better on PlayStation VR is very much lame Arizona Sunshine's a cool name it weird that it's a zombie game my thing about it is it's a cool name but it's a cool game or it's a cool name at the expense of ever selling that game yeah like okay if you're I mean if you see this on a list you're in your car and I I was like I just ran through a bunch of games and named them right like I was like Ancient Amuletor you know what I mean that doesn't sound like Tower Defense and then if I just said Arizona Sunshine on PlayStation VR moved on you have no idea that that's a zombie game granted the Z in Arizona is red in the key so that's where it is that's uh we have a fun so it's a let's play of us being shooting zombies and making fun of the game a little bit so go check that out uh Jamie wrote in though and said with Arizona Sunshine",
      "start": 1694.68
    },
    {
      "text": "it is that's uh we have a fun so it's a let's play of us being shooting zombies and making fun of the game a little bit so go check that out uh Jamie wrote in though and said with Arizona Sunshine coming out today and still being unable to purchase the Aim controller on its own is Sony shooting itself in the foot here well they don't have Aim so of course they are nice I like I don't think so no this is back to the whole thing of like the Aim controller I thought was interesting that it came out of nowhere I mean granted it came for Farpoint and I I didn't like but for the record too on the let's play comments a lot of people like man **** this why are you guys playing Farpoint we played the first 20 minutes of Farpoint on a Twitch stream we debuted that game that was an exclusive y all suck um yeah it's the normal thing of just like with VRs and such short supply still the Aim the the Aim controller is in short supply it's this weird thing of they're still not treating VR with the respected",
      "start": 1734.36
    },
    {
      "text": "yeah it's the normal thing of just like with VRs and such short supply still the Aim the the Aim controller is in short supply it's this weird thing of they're still not treating VR with the respected deserves or possibly needs even though they now know that that's what it is right I don't think they're shooting themselves in the foot I don't think it was going to move a million units I'm more impressed that more games are using it I didn't really expect that when I got got uh for Farpoint you got this peripheral like here's something no one else will ever used but it's like no the Paperboy: Special Delivery game does this game uses it there's other ones on the docket that are going to come out and do it like oh okay not too shabby I can put up with that up next Cryptark on PlayStation 4 Dark Arcana: The Carnival on PlayStation 4 Diablo III: Eternal Collection PlayStation 4 many people have asking me if I'm going to jump back into it because I love Diablo III so much no I've played enough Diablo III I'm",
      "start": 1770.04
    },
    {
      "text": "the Carnival on PlayStation 4 Diablo III: Eternal Collection PlayStation 4 many people have asking me if I'm going to jump back into it because I love Diablo III so much no I've played enough Diablo III I'm not in the mood to jump back in there uh Elite Dangerous on PlayStation 4 Medieval Defenders on PlayStation 4 Plague Road on PlayStation 4 which correct me if I'm wrong is already out on Vita uh po Xbox One PS4 The World of Nubla on PlayStation 4 I'm going to say it again because you're all going to need to make a mental note for this one all right because we're going to come back to this The World of Nubla on PlayStation 4 remember that title it will be very important soon uh The 10th Line on PlayStation 4 and Final Fantasy XV: Episode Prompto our boy Xbox One PS4 you going to play that I'm not I'm I'm kind over the XV World by now yeah yeah I just feel like it's been a little the little bits they've been putting out the DLC stuff I I played a bit of the first one I think it",
      "start": 1809.88
    },
    {
      "text": "that I'm not I'm I'm kind over the XV World by now yeah yeah I just feel like it's been a little the little bits they've been putting out the DLC stuff I I played a bit of the first one I think it was the Gladiolus one and I was just like all right cool I'm have you seen the trailer for this one though no I haven't it I mean me I think it was it must have been Andy and I watched it maybe oh no Andrea and I watched it before Kinda Funny Games Daily last week and it like looks like Metal Gear really it looks way different I'm not I'm not against it I just like I wasn't planning on on picking it up no it looked cool and then I want to toss this in here a correction not a you're wrong a correction written in by the developer thank you for watching the show and then also I saw on the PlayStation Blog but they didn't have the whole thing so yesterday I said Brawlhalla is finally coming out on PlayStation 4 that's weird especially for a Monday release on a PlayStation 4 this is the release",
      "start": 1856.16
    },
    {
      "text": "Blog but they didn't have the whole thing so yesterday I said Brawlhalla is finally coming out on PlayStation 4 that's weird especially for a Monday release on a PlayStation 4 this is the release I got while the PlayStation Blog stated the Epic free-to-play platform fighter was coming out yesterday and it was briefly available on the PlayStation Store Brawlhalla was listed early and has now been Tak off the store PlayStation Gamers will have to wait a little longer before entering Valhalla and joining the Eternal tournament enjoyed by millions of PC Gamers the PS4 closed beta of Brawlhalla is currently running with signups still open Blue Mammoth Games doesn't want to disappoint any of the lucky individuals who downloaded the game when it was briefly available so they are now in the closed beta more news on both the PlayStation 4 closed beta and Brawlhalla's launch will be announced in the coming weeks and you'll be one of the first ones to know when we do so first off good on them for",
      "start": 1896.24
    },
    {
      "text": "beta more news on both the PlayStation 4 closed beta and Brawlhalla's launch will be announced in the coming weeks and you'll be one of the first ones to know when we do so first off good on them for getting out there with the messaging crazy story of your game went up on the PlayStation Store and was super weird advertised fun game too I played back at PAX two years ago I was going to say that's the problem is that I Andrea and I was making fun of this yesterday we talked about it I feel like Brawlhalla has been at every PAX in RTX for the last 5 years but awesome good to get it up I I think I don't put that against the game though I think that it's one of those those Ultimate Chicken Horse type games where it's just like the people that are playing it on Steam **** love it and that's where it audience I'm not knocking it I'm just saying it's it feels like it's been around forever yeah uh interesting to see it though that it accidentally published to the PlayStation Store in",
      "start": 1934.92
    },
    {
      "text": "where it audience I'm not knocking it I'm just saying it's it feels like it's been around forever yeah uh interesting to see it though that it accidentally published to the PlayStation Store in this I it's one of those I don't hear about it rarely but I think you have to be in the communities or have an an example like this happen I know recently too with uh Friday the 13th this happened where the Savini skin which is exclusive to Kickstarter backers got published on the PlayStation 4 for like half a day it was like this huge rigmarole that happened uh before I get out of this segment new dates to tell you Robocraft Infinity is coming to Xbox One and PC in the first quarter of 2018 now Tim yes Games with Gold got announced for July okay I didn't know where to put it I didn't I felt like it wasn't worth the Roper Report it's not like news we need to discuss yeah it's not a new date so I put it in Deals of the Day Deal of the Day that's that's where from here henceforth Deals of",
      "start": 1974.4
    },
    {
      "text": "the Day will include Xbox Games with Gold and the PlayStation Plus games of the month so right now Xbox Games with Gold for July you're going to get on Xbox One Grow Up from July 1st to July 30th and Runbow July 16th through August 15th meanwhile on the Xbox 360 and Xbox One you're getting Kane & Lynch 2 July 1st through July 15th and then Lego Pirates of the Caribbean: The Video Game July 16th through the 30th for some reason I didn't know that was a thing which one Lego Pirates oh really yeah there's Lego for any M man want to go what do you want to do now Tim I'm going to it's time for Reader Mail okay but instead of doing that okay I want to jump into a meaty segment that kind of got away from me oh all right so what happened is I wanted to go to I wanted to introduce a new segmenty kind",
      "start": 2018.4
    },
    {
      "text": "mail okay but instead of doing that okay I want to jump into a mey segment that kind of got away from me oh all right so what happened is I wanted to go to I wanted to introduce a new segmenty kind of thing but now it's just going to become a trophy talk cuz it is Tuesday it's the day to talk about PlayStation the day it's the holy day it is the day that Shoi made let us rejoice and be glad in it um so I was going to do a new seg called My Name is Greg and I'm a trophy whore okay and walk you through falling off the wagon got it cuz yesterday our good friend Brian over at youtube.com/PS4Trophies put up a video the top 50 easiest and quickest Platinums oh no and let me tell this is going well because let me let's start small cuz it starts with me just being a trophy whore sucking that Platinum dick wherever I can you know what I mean wherever I can get it that's what I'm going to do it I I'm and you know how it is I go through periods where I just don't care it just doesn't matter",
      "start": 2072.12
    },
    {
      "text": "Platinum dick wherever I can you know what I mean wherever I can get it that's what I'm going to do it I I'm and you know how it is I go through periods where I just don't care it just doesn't matter oh there's easy things but then like a video like this drops I'm like well how easy can they be and I'm like **** less than 30 minutes you goddamn right I'm going to go home and download Mr. Massagy downloaded Mr. Massagy last night now I'm offended frankly ladies and gentlemen that not more of you told me about Mr. Massagy Mr. Massagy from the people who made My Name is Mayo all right now here's the thing I know we automatically want to throw stone at him right away we want to throw a stone My Name is Mayo what the **** was the point of this game Mr. Massagy easy Platinum yes can you just walk it's just a you know you're it's an easy Platinum it's a cheap Platinum however I am recommending a party mode with you and Nick playing it because what it is is a Tinder simulator okay where you",
      "start": 2121.36
    },
    {
      "text": "it's just a you know you're it's an easy Platinum it's a cheap Platinum however I am recommending a party mode with you and Nick playing it because what it is is a Tinder simulator okay where you CH you pick your response and talk to these girls you're picking up you have to change your profile pick and try to pick them up you have you'll fail and like not one star two stars three stars most you can get then if you succeed your reward is a massage where the controller vibrates and you can put it on your neck or your body wherever you want to put fun stuff all right that's a Platinum unlike My Name is Mayo which was just tap tap tap this is really dumb there is story funny funny lines here funny interactions again if you do what I do and you went to you know uh Trophies.org and you got the walk through you just read you I'm just circling through everything not reading most of it deleting and I'm like okay you're a broken person yeah 100% yeah it gets worse issue here no I know I know",
      "start": 2170.6
    },
    {
      "text": "walk through you just read you I'm just circling through everything not reading most of it deleting and I'm like okay you're a broken person yeah 100% yeah it gets worse issue here no I know I know it gets worse though stick with me and then I'm I'm like okay cool and while I look I looked at the uh the the response Brian put up like are people down with this like I am of course people are super excited about **** easy plat of course they are then one guy's like have you heard of Energy Cycle yet it just came out and Brian's like no it wasn't out by the time I published this Energy Cycle a game on the PlayStation 4 apparently they say glitch in the YouTube video I watch but I haven't done it yet but in 15 minutes you can get the Platinum Trophy out of this 15 minutes okay so you're goddamn right I bought Energy Cycle yeah then in the video Brian's number one and correct me if I'm wrong chat uh or correct me if I'm wrong on KindaFunny.com you wrong is number one is Nubla Nubla so",
      "start": 2217.84
    },
    {
      "text": "right I bought Energy Cycle yeah then in the video Brian's number one and correct me if I'm wrong chat uh or correct me if I'm wrong on KindaFunny.com you wrong is number one is Nubla Nubla so you're bringing this back stick with me oh my God there's new and I'm like okay cool I I look at it again and it's the same thing 30 minutes or less to go through and get this trophy right yeah awesome I go to PlayStation Trophies. as I do I look I look at the trophy list there and it's Nubla and then there's The World of Nubla and I'm like oh okay and I click on Nubla all right see it blah blah blah I I put it in my head I'll get this one later I put a little bookmark there then I do the rundown of the drop and see The World of Nubla's coming out today and I'm like oh that's the other one that shares the same name and I go wait a second Tim these are the same games Nubla and The World of Nubla are literally the exact same game with different names different trophy lists I mean same",
      "start": 2255.36
    },
    {
      "text": "that shares the same name and I go wait a second Tim these are the same games Nubla and The World of Nubla are literally the exact same game with different names different trophy lists I mean same trophy list but separate ones so that you they're just putting the same game up with a different name is this game made just for trophy whores I I don't know I won't go that far cuz it gets worse gxy here's where we start here's where where we start teetering where am I down with Mr. Massagy of **** course I am am I down with Energy Cycle sure cheap ass games to give me a Platinum like Taco Master whatever Taco Master a fun game fun enough to play you know what I mean I'm building some tacos there's something there unlike My Name is Mayo which was just let's click right My Name is Mayo I think is what spurred on on February 14th we did an episode of PS I Love You called PSN Trophies are broken Nubla is the first time where I'm looking at it and going like huh maybe like yeah this is really",
      "start": 2306.76
    },
    {
      "text": "is what spurred on on February 14th we did an episode of PS I Love You called PSN Trophies are broken Nubla is the first time where I'm looking at it and going like huh maybe like yeah this is really broken now like before it was like the haha this is dumb why can't Ground Zeroes have a Platinum but **** My Name is Mayo has a Platinum right and that's why I always tell people if you're making a game have a Platinum don't accept no as an answer you can do it blah blah blah and then you just said is Nubla made just for trophy people and I say no it looks like there's an actual game there I haven't played it yet I don't know you know what I'm going to play both of them I'll get back and I'll give you some extensive research then Wario64 this morning as if knowing I am building the show and maybe things are really **** up with the PlayStation Network trophies puts out this one for less than a dollar in less than an hour you can get a Platinum and he puts out this game which is Five",
      "start": 2354.36
    },
    {
      "text": "maybe things are really **** up with the PlayStation Network trophies puts out this one for less than a dollar in less than an hour you can get a Platinum and he puts out this game which is Five Stars in a Row 1000 Top Rated 98 cents I will now read you the actual description on the PlayStation Network and you want to give me the one for Five Stars in a Row and this is just star star star star 1000 Top Rated how would you like to win a Platinum Trophy in just 1 hour that's the idea of 1 4k I'm sorry how is the idea of 1 4k images grab you art thou ready to Platinum up Five Stars 1000 Top Rated the world's fastest Platinum Trophy game so they're not even accurate no shame in this game they are just like **** you we're here to give you a Platinum for 98 cents they obviously don't even know about Energy Cycle or Nubla or The World of Nubla consult with me they consult with Brian but I've never seen someone come out of the blue and be like hey we're mentioning trophies our game's a",
      "start": 2396.48
    },
    {
      "text": "know about Energy Cycle or Nubla or The World of Nubla consult with me they consult with Brian but I've never seen someone come out of the blue and be like hey we're mentioning trophies our game's a **** joke do you want a Platinum Trophy and so then now feeling that something is really wrong in the force not that it's going to stop me cuz I did immediately buy this game you're goddamn right I bought it I got to move the the things around to make images I think is what this game is whatever I bought the damn thing of course because I want the Platinum Trophy but then I I quote tweeted Wario64 and I said what does everybody think about this I want your input for this show about trophies like the fact of these cheap so many of you did before you get in there I I have a question for you yeah I remember back in the day I'd play Final Fantasy X sure and I would grind and grind and grind to get the ultimate weapons and I didn't need him I already beat the game I already beat a lot of the",
      "start": 2453.68
    },
    {
      "text": "I remember back in the day I'd play Final Fantasy X sure and I would grind and grind and grind to get the ultimate weapons and I didn't need him I already beat the game I already beat a lot of the bosses why was I doing this why was I dodging the thunder in the Thunder Plains it was annoying it wasn't fun why was I battling over and over and over just to get my stats up just to know that my numbers were good of course right there was something about it that was just satisfying okay I often thought okay if I had a button that I could just press that it would just level me up would I just level up would I just get there yeah what's the difference between just using a GameShark getting where I need to go for you you're willing to pay 98 cents sure for this trophy you're willing to pay $5 $10 $15 as you go up no $15 seems too much no as you adding sure as my total sure yeah to get these trophies would you have shame hiring a Trophy Hunter sure someone just like hey you know what I'm",
      "start": 2493.4
    },
    {
      "text": "$10 $15 as you go up no $15 seems too much no as you adding sure as my total sure yeah to get these trophies would you have shame hiring a Trophy Hunter sure someone just like hey you know what I'm going to pay you $10 a day to just **** grind get me them trophies get me that that number right is that different to you that is different than me as you as you may remember back in the day after the Podcast Beyond Trophy Horror War we signed a Trophy Armistice it was me it was Colin it was Jack DeVries it was all these different people who weighed in on this thing and one of the rules was no you cannot have someone else earn you the trophies you have to earn them yourself now did this include this also barred using debug menus I once walked into the Dead Rising debug menu and I was like oh **** I could actually just give myself all the you not all the uh trophies but all the kills which would then unlock all the trophies Colin got real mad at that we said no that was part we we S no there",
      "start": 2532.96
    },
    {
      "text": "I could actually just give myself all the you not all the uh trophies but all the kills which would then unlock all the trophies Colin got real mad at that we said no that was part we we S no there has to be rules there does and that's the thing is technically everyone's playing within the rules right now the problem is the rules are still so **** murky and here's what I want to jump to all right I want to go here AP I think says it best AP's response was the existence of this game and he's talking about the 98 cents 1000 images whatever doesn't bother me at all the fact that other devs haven't fought for Plats for their games is what bothers me and this is what I always come back to when we talk about trophies when I talk to an indie developer when I'm on the phone with the Moss guys and I ask them do they have a Platinum like oh we don't know I'm like have a Platinum and I'm not saying it cuz I'm I am saying it because selfishly I want there to be a Platinum in the game but I'm",
      "start": 2582.32
    },
    {
      "text": "and I ask them do they have a Platinum like oh we don't know I'm like have a Platinum and I'm not saying it cuz I'm I am saying it because selfishly I want there to be a Platinum in the game but I'm also saying it because what's broken about the PSN is that there's not a rule book and that developers are out there in the wilderness making their game making as awesome as they can and I'm talking about a spectrum here making Moss as awesome as it can be and not thinking about when they get to this one challenge when they get to this one gatekeeper they're like all right cool and then they oh you have to put trophies in the game oh how does that work well you're a downloadable whatever you seem short so do this don't put a Platinum in this is how much you have to work with and they go okay they don't sit there and think wait no I want a Platinum all these **** shitty games have a Platinum why can't I and it's that's the whole thing as what I've been told is if you push if you just say",
      "start": 2620.52
    },
    {
      "text": "don't sit there and think wait no I want a Platinum all these **** shitty games have a Platinum why can't I and it's that's the whole thing as what I've been told is if you push if you just say no no we want a Platinum and they go no no no we want a Platinum they eventually all right fine whatever you know what I mean get out of my hair and I assume that's what's happening here and that's why the real shame of this is the the great games that don't get a Platinum. Plat games with Platinum sell better the only reason anyone is buying Mr. Massagy is for this from the I assume My Name is Mayo was the same thing yeah I feel like the there's an argument on the other end though that if every game had Platinum then games of Platinums wouldn't sell better because they all have Platinums so it's like the I feel like the it is on the devs to know that that is a selling point sure to the game but it's like that's also not really a selling point unless that is is your only selling point like Five",
      "start": 2653.16
    },
    {
      "text": "the I feel like the it is on the devs to know that that is a selling point sure to the game but it's like that's also not really a selling point unless that is is your only selling point like Five Stars 1000 Top Rated yeah well I mean the easy Platinum in an hour which isn't even true yeah you know over there you know Scott mof says uh this just cheapens the whole system but will it stop me from buying it I don't know Jeff ratam maker no I do do you care that there's cheap ass Platinums like this no I care when they are when the Platinum is insane hashtag looking at you Friday the 13th which is another great example and see this is where I think it comes back to with me where I'm like well I put in 15 minutes to get one of these **** Platinums you're goddamn right I will cuz enough have **** me over in the end where it's like no Friday the 13th I'm not maybe in 5 years I've played enough Friday the 13th to actually have that Platinum but I hear even though some of them are glitched right",
      "start": 2688.16
    },
    {
      "text": "**** me over in the end where it's like no Friday the 13th I'm not maybe in 5 years I've played enough Friday the 13th to actually have that Platinum but I hear even though some of them are glitched right now it's like there's such pains in the ass about everything I I feel as someone that is not an Achievement Hunter Trophy guy like I I don't care too much I appreciate uh when trophies are are thought out not in the sense of like from top to bottom of oh I got to get this Platinum but more like oh you know what like that sounds like a fun challenge to to give myself to kind of go about you know I'm going to play game a little more because I do want to see if I can find all of these things that are fun to find not a thousand kills like that's not fun Alicia Baker is right on the same page is you all I want is for Plat to be reasonable Horizon and Wolfenstein are perfect examples can't speak to Wolfenstein because I'm going to restart playing that after Fourth of July uh vacation but uh yeah",
      "start": 2727.24
    },
    {
      "text": "all I want is for Plat to be reasonable Horizon and Wolfenstein are perfect examples can't speak to Wolfenstein because I'm going to restart playing that after Fourth of July uh vacation but uh yeah Horizon's such a fun Platinum to go through and it's not insane and it's not here's this like **** I think back to South Park where when I was playing through South Park the first time uh before a release so there were no guides or anything I was like man this seems like a Platinum you could arguably get in one playthrough but of course there was a Chinpokomon on the UFO that I didn't see and so I couldn't get back there and it's like am I going to replay the **** game for that thing come on you know what I mean like and there was it turned out a harder trophy list than that but but like I'm thinking about like the Crash Bandicoot N. Sane Trilogy right a franchise I care about obviously a lot the game's coming out and the trophy list leaked a couple weeks ago and I'm looking at him and I'm",
      "start": 2764.32
    },
    {
      "text": "about like the Crash Bandicoot N. Sane Trilogy right a franchise I care about obviously a lot the game's coming out and the trophy list leaked a couple weeks ago and I'm looking at him and I'm like you know what like this does kind of motivate me to want to put even more thees whereas orig I was planning on just beating them now I'm like am I'm not on Platinuming them but there is a chance that maybe at least one of them I'm like you know what I will try to do all of the things because I do care about these games and I do love them so it's like I appreciate an extra reason to go back no see that's how it works for me with Platinums is that if I'm going to get a Platinum in a game it's because I love the game and I feel it's the highest compliment I can give it or there's some **** joke game that you can get in two seconds I think is funny in the increase it that way and **** it that way uh final comment from Twitter over here is Ryan Nicholas I don't play/ bu games to go for easy",
      "start": 2803.04
    },
    {
      "text": "game that you can get in two seconds I think is funny in the increase it that way and **** it that way uh final comment from Twitter over here is Ryan Nicholas I don't play/ bu games to go for easy ones there is no sense of accomplish from them if I want a Platinum I want to work for that's why I go for Platinum in games I really enjoy or are a challenge like I'm really proud to have a Persona 4 Golden and Ni no Kuni Platinums that's those are both great examples obviously lots and lots of time be put into that to make that happen so yeah there you go everything's **** up right now but is it bad cuz I don't know I don't know I mean as long as people changing is the thing um there's that that one guy and I'm blanking on his names right now but the dude that who didn't put a Plat in Gone Home the dude that we do the Google Hangouts with all the time from Easy Allies oh not Xavier no Josh Graff yes Josh Graff like every time we talk to him and he's talk about how many games he's Platinumed and",
      "start": 2844.08
    },
    {
      "text": "the dude that we do the Google Hangouts with all the time from Easy Allies oh not Xavier no Josh Graff yes Josh Graff like every time we talk to him and he's talk about how many games he's Platinumed and like he's freaking hardcore and dedicated and I love that and it's for guys like him that I do wish that there was a bit more uh of a rule book for people to follow to actually put the trophies in cuz he does really care about see is this where it's like as somebody who cares about them but loves a dumb garbage Platinum every so often is there's a world of difference when somebody jumps in to look at my profile and oh man Greg's played a lot and know his Platinums are **** the joke games Greg's joking around with us do you understand that whereas if you jump into Josh's profile you're like oh **** he's this is impressive he's Platinuming real games right and that's the thing is like with the exception of when Colin and I would **** around I would never be like well I am level 30",
      "start": 2883.08
    },
    {
      "text": "like oh **** he's this is impressive he's Platinuming real games right and that's the thing is like with the exception of when Colin and I would **** around I would never be like well I am level 30 with this many Plat you know what I mean like I know it's all **** nothing yeah I can't even do more than two pull-ups on the bar that's that's where the self-confidence problems are you know what I mean I'm not walking around my digital e penis hanging around out here mhm let's jump into reader mail now of course you need to be part of the show KindaFunny.com/kfgd looking around we we're running along already I want to find some good stuff in here oh this is what I found interesting some of that good stuff Robert Kubacki wrote in and said Days Gone Theory here and a lot of zombie fiction zombies are created by a virus what if the freakers in Days Gone were created by a mutated version of the Syphon Filter virus my God this could be a fun Easter egg for longtime fans of the studio it",
      "start": 2922.2
    },
    {
      "text": "zombies are created by a virus what if the freakers in Days Gone were created by a mutated version of the Syphon Filter virus my God this could be a fun Easter egg for longtime fans of the studio it wouldn't have to be part of the larger story and could easily be included as an Intel document or something what do you think the chances of this being true are thanks and have a great day can't wait for Days Gone I am all about that great **** idea my thing is I do believe that things like this overall can cheapen games when everything when everything needs to be shoehorned into whatever but I don't care because I love that type of stuff I love the the weird crossover Easter egg things that only the really hardcore people give a **** about but I appreciate the nod you know it like he said it doesn't need to be part of the larger story it doesn't need to be something that really matters it doesn't need to be like a huge moment in the game where it's like a reveal yeah but yeah if it's",
      "start": 2965.32
    },
    {
      "text": "it doesn't need to be part of the larger story it doesn't need to be something that really matters it doesn't need to be like a huge moment in the game where it's like a reveal yeah but yeah if it's just something where it's like oh there's enough evidence to be like that's what it was I love that that's the thing is I think if if it is an Intel document if you're not even if it isn't something you're collecting cuz I don't that doesn't sound like something you do in this game but if you're infiltrate you know infiltrating a hideout where all these people are and you're shooting them and like you're just you're oh this was like where the military was H up or this is where some Outpost was and it was like on a whiteboard Syphon Filter virus question mark you know what I mean like that'd be **** rad like I think that's a great idea even if it's Ming's the doctor or something I'm um uh I want to say Lian Xing I sound right though **** that's gonna drive me crazy H kindafunny.com/yourewrong",
      "start": 3007.12
    },
    {
      "text": "rad like I think that's a great idea even if it's Ming's the doctor or something I'm um uh I want to say Lian Xing I sound right though **** that's gonna drive me crazy H kindafunny.com/yourewrong Gabe Logan's partner who's very important last I played really was Syphon Filter. I think it was Lian Xing. Lian Xing. R. How Do I Live With Allan E. McAdams wrote in to KindaFunny.com/kfgd just like you can to be part of the show it says Greg and Tim here we go I was right Lian Xing I'm not saying that's how say it though Xing X.I.N.G. how would you pronounce that Lian Xing no whatever Allan Roden said Greg while E3 saw some great announcements Nintendo was silent on one game Super Mario Maker I felt like it was one of the best things they put out on Wii U so where's the Switch port or at least a hint of the sequel loving the new show keep up the excellent work Allan E. McAdams Tim yeah what the **** oh it's too early the Mario Maker just came out in 3DS last year they're not trying why",
      "start": 3039.36
    },
    {
      "text": "a hint of the sequel loving the new show keep up the excellent work Allan E. McAdams Tim yeah what the **** oh it's too early the Mario Maker just came out in 3DS last year they're not trying why I would think you'd get it out right away and just ride this whole wave if it's everywhere you want to play it there it is I I think that uh it's clear looking at Mario Maker and Super Smash Bros. that the titles of those games Super Smash Bros. for Wii U Super Smash Bros. for 3DS Mario Maker for Wii U Mario Maker for 3DS yeah there will be a Mario Maker for Switch the thing is I think that at that point they're like we it should be a sequel we can't just do it again the same game again Mario Maker on Switch is going to be awesome I loved playing Mario Maker on the 3DS just because being on a plane and having portable Mario is awesome the 3DS version was very gimped however and I think that going forward the Switch version is just going to be be even better than the Wii U one that's",
      "start": 3098.56
    },
    {
      "text": "on a plane and having portable Mario is awesome the 3DS version was very gimped however and I think that going forward the Switch version is just going to be be even better than the Wii U one that's going to be a huge system thing but I also think Nintendo's being smart right now looking at the franchises it's putting out they can't bust their load too much because they just don't have too much more to give eventually sure and I think that they need to get way more Switches out in the open for a game like Mario Maker to really be a success I liked it on the Wii U didn't play it on 3DS but like on Switch I feel like again as I feel like with every game I play on the Switch it would be perfect for it in the way of yeah to get on have all the everything I want there have the touch screen let's do it it's hard to think about what a sequel like what a Mario Maker would add yeah uh because there's I mean I guess it could just add another art style but even then I don't I don't know what",
      "start": 3137.92
    },
    {
      "text": "do it it's hard to think about what a sequel like what a Mario Maker would add yeah uh because there's I mean I guess it could just add another art style but even then I don't I don't know what game it would be taking from uh but there's certain things like the slopes and and all of that but those are little incremental things like I people are talking about like oh a 3D Mario that's a little crazy a Zelda Maker I don't know there's like a lot that they can do Nintendo has a lot of weird franchises uh that are like spin-off things like the NES Remix yeah will we see more of that cuz that was a fun idea where it's like let's take the class of games and not just put them out again but to add to them and make it a fun experience that teaches new kids that these old games exist but gives veteran players something new and fun to do and uh Mario Maker to me is the type of game that I can play for the rest of my life because it's just infinite Mario platform and as long as there's people",
      "start": 3175.68
    },
    {
      "text": "players something new and fun to do and uh Mario Maker to me is the type of game that I can play for the rest of my life because it's just infinite Mario platform and as long as there's people making levels and people thinking and trying to be creative and it has that Community which Mario Maker still does uh and I think it would only get bigger on the Switch I I think Nintendo knows I I think that we'll see it mid 2018 you assume every level that's been made before report's over with it right yeah oh yeah yeah definitely cool Tim mhm are you ready to squat up I am ready to squat up this ladies and gentlemen is a segment of the show where one of you has written in to KindaFunny.com/kfgd and you have given your Steam name your PSN name your Star Wars: The Old Republic name whatever name you need to get some support from the Best Friends I read it a lot here the Best Friends come and find you you play games together he's very very happy today Rain Go Away wrote in from the PSN that's Rain",
      "start": 3216.52
    },
    {
      "text": "to get some support from the Best Friends I read it a lot here the Best Friends come and find you you play games together he's very very happy today Rain Go Away wrote in from the PSN that's Rain R. A. I. N. E. Go Away all one word and says I'm from Asia and so the usual people who talk on mics are Japanese or Korean and I speak neither of those languages I'm sick of playing alone and having to deal with teammates that just don't get the objective I play Overwatch and Battlefield 1 so if you guys have those game squat up with me love the podcast guys keep doing what you're doing heart emoji again that PSN Rain Go Away he is stuck in Asia and he does not speak any of the languages of that continent can you save him English speakers in Overwatch and Battlefield 1 if so friend him on the PSN Rain Go Away. Plague Road was released for Vita on June 6, 2017. I am now doing the Kinda Funny Games Daily You're Wrong segment. Remember if you're watching live you can go to KindaFunny.com/Wrong tell us",
      "start": 3259.6
    },
    {
      "text": "Away. Plague Road was released for Vita on June 6, 2017. I am now doing the Kinda Funny Games Daily You're Wrong segment. Remember if you're watching live you can go to KindaFunny.com/Wrong tell us what we screwed up be our stat boy before we close out the show Tim still checking there's there's a lot of a lot of iffy ones here stop editorializing there's some editorializing things some of them interesting editorialization though I mean like this right here Tom Clancy's Ghost Recon Wildlands was a miss. No, it's currently the top selling game in 2017 followed by For Honor. Also, I meant for me. No, we did that. We did NPDs on the show uh this week. No, last what days it. And then here here's an interesting thing uh that's correcting something from yesterday and it's not even correcting it is more of an interesting question that I even want to bring up so hey Greg and Tim just talk about to correct one of yesterday's corrections. Days Gone must have been playable or hands-on in some form as is up",
      "start": 3311.52
    },
    {
      "text": "an interesting question that I even want to bring up so hey Greg and Tim just talk about to correct one of yesterday's corrections. Days Gone must have been playable or hands-on in some form as is up for Best Action Adventure Game, the Game Critics Awards. It does not appear in the list of ineligible non-playable games and as Greg and Andrea said yesterday, hands-on time is requirement for awards eligibility. Alternatively, it's possible that it was nominated erroneously but every other nominated game was playable so that seems unlikely. This is from Sam N. W. I can confirm that Days Gone was not playable at E3. My that's what I thought too. Andrea said one of her friends did. I was a judge but I didn't make a big stink about it so maybe if I would have I would have been able to go hands-on with Days Gone behind closed doors. Interesting. I doubt it based on the I mean if it got nominated that's the point though. Oh wait, hold on. Best Action Game, he said Action Adventure. Oh no, that would have made that",
      "start": 3358.12
    },
    {
      "text": "behind closed doors. Interesting. I doubt it based on the I mean if it got nominated that's the point though. Oh wait, hold on. Best Action Game, he said Action Adventure. Oh no, that would have made that would have made sense. Let me do this. I'm gonna throw this open. I'm going to open this thing. I'm going to do this. I'm going to keep talking to you through it though. You know what I mean cuz I don't want you not know what I'm doing here. We go. Geoff Keighley, one Jeff, say here nominees. Anyway, that's it. All the other stuff are wrong. Uh-huh. Uh-huh. Okay. Okay. Note an EA Play orations. It's fun word to say. **** here we go. You know what I mean, Greg? Yeah, I totally. I mean, we're doing great. We're doing great. We're doing great. We're we're doing great. This is good content. It is good. You know what? I'm just going to read something other start. No, start signing off and I I'll have it by the time. Ladies and gentlemen, this has been Kinda Funny Games Daily for June 27th, 2017. We got to make that a thing. Um hopefully you had",
      "start": 3395.52
    },
    {
      "text": "other start no start signing off and I I'll have it by the time. Ladies and gentlemen, this has been Kinda Funny Games Daily for June 27th, 2017. We got to make that a thing. Um hopefully you had a good time joining us today on this Kinda Funny Games Daily. I know I had a great time. I love this show. I love this PR. Everybody's been very supportive of it. I like that a lot and it's been great. Again, you can watch us on YouTube. You can watch us on Twitch. You can listen on iTunes or any of the podcast people around the world and all of that stuff. No, I just **** up. Apparently, Days Gone was somewhere I could have played this **** thing. What if I would have begged somebody somewhere if I would have said please sh a please Eric Jensen? But no, they all spat on me and that's why you got nominated for nothing. Congratulations, Eric Jensen did not let me play. I looked him in the eye and I said I really think this game looks cool and he didn't offer. It does look really cool. This has been Kinda Funny",
      "start": 3434.52
    },
    {
      "text": "nothing. Congratulations, Eric Jensen did not let me play. I looked him in the eye and I said I really think this game looks cool and he didn't offer. It does look really cool. This has been Kinda Funny Games Daily, ladies and gentlemen. Thank you so much for watching. Remember, we're a new podcast. We need your support. Please go subscribe on YouTube.com/KindaFunnyGames or the pod actually and the podcast service of your choice. Rate us there. Give us the subscription and then watch it or wherever you want to watch it. Just check out afterwards. Remember if you're one of the people watching right now live on Twitch, thanks for the corrections on kindafunny.com/yourewrong. We're going to sign off, end the show and I'll pop back up here live to read your tips and Subs that you have been leaving throughout the day. Thank you and until next time, it's been our pleasure to serve you for",
      "start": 3475.28
    }
  ]
}
