{
  "id": 2781,
  "video_id": "svknnq3uDiA",
  "show_name": "Kinda Funny Morning Show",
  "hosts": ["Greg Miller", "Tim Gettys", "Kevin Coello"],
  "title": "Comics You Should Read This Week - Kinda Funny Morning Show 06.28.17",
  "description": "Don’t forget to sign up this month! Go to http://wrg.am/funnytank and grab your free tank, garage slot and 3 Days Premium game time while this lasts. The number of new player registration codes is limited.\n\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1498683764,
  "duration": 3174,
  "transcript_chunks": [
    {
      "text": "What's up guys? Welcome to the Kinda Funny Morning Show for June 28th 2017. I'm Tim Gettys joined by Gameover Greggy himself Greg Miller. Bonjour. It's the comic episode. You excited about that? I can't wait. I love the comics episode. Yeah. Yeah. Look at you getting ahead of the game on this. I like that. I'm so ahead of the game. I feel left behind by other morning shows on Twitch. That's what happens. What's that? Oh there aren't others. Yeah there aren't others. That's true. We're the only one. Uh don't know that to be true but if I say it you know what I mean? Yeah. I've also never lost a predictions episode ever. You lost this most recent one. We've never gone over those those results to that. There's no M. Dog approved the Reddit thread that had them all laid out from the Games Cast and I was victorious once again. Yeah. Clowning everyone out. Some say that. Some say that. I say that. I've seen it both ways as Nick would say. I love when Nick does that though",
      "start": 1.93
    },
    {
      "text": "the Games Cast and I was victorious once again. Yeah. Clowning everyone out. Some say that. Some say that. I say that. I've seen it both ways as Nick would say. I love when Nick does that though because I've seen it both ways. Nick wants to be devil's advocate for no reason and just start **** No not it's not so much that. It's just when he doesn't know what he's talking about at all. He'll just say, \"I've seen it both ways.\" And it's like, \"You haven't seen it both ways. That doesn't make sense. That doesn't make any sense.\" How are you Greg? I'm excellent Tim. How are you? I am pretty damn good myself. Yeah. Last night uh didn't sleep well. Really? Why? That was the the one bad thing. Well one Gia was a a little a little drunk last night. Had a few drinks. Yeah. And uh cuz we went out to Nick's comedy standup special. Yeah. In a laundry room. Nick was on a comedy showcase last night. We're going to talk about it on the GameOverGreggy Show. We record today that you can",
      "start": 52.88
    },
    {
      "text": "we went out to Nick's comedy standup special. Yeah. In a laundry room. Nick was on a comedy showcase last night. We're going to talk about it on the GameOverGreggy Show. We record today that you can watch live your supporter over on patreon.com/kindafunny. But the episode that won't go live until a week from Friday of this week on Patreon and then the week after Fourth of July on YouTube because of next week me not being here because I'm going on vacation. Exactly. Yeah. Yeah. Yeah. So, we got to see his stand up and that was great. But they had these canned wine. Canned wine and you think no big deal. Sounds a little scary to be honest, but looking at them I'm like those look really trendy and I tr this place I was like I actually kind of trust this. This isn't some weird nasty **** I was like I'm down with that. She was down with it too as Jen. So was Jen. Yeah. And uh it was when they had their second canned wine that she was like, \"You know what? I should probably look at how",
      "start": 88.24
    },
    {
      "text": "I was like I'm down with that. She was down with it too as Jen. So was Jen. Yeah. And uh it was when they had their second canned wine that she was like, \"You know what? I should probably look at how much is in this compared to a bottle, realizing the two cans equals one whole bottle.\" Yeah. the they were tall boys. They weren't just straight up, you know, a little 1 fluid ounce can of wine. They were **** tall boy wine things that should not have been consumed. Should not have been consumed last night, but they were. They were. And then can of wine. And then we went to dinner afterwards, all of us, to celebrate Nick's accomplishments. We were quickly left alone. Nick Scarp didn't want to sit with us. And that's not how it went. We went to this restaurant at all. I was really upset you would sit with us. They had to separate us all. And it was really I felt like secondass citizens. Sure. cuz they were like, \"All right, we had a group of 11, which I understand walking into a small",
      "start": 127.76
    },
    {
      "text": "would sit with us. They had to separate us all. And it was really I felt like secondass citizens. Sure. cuz they were like, \"All right, we had a group of 11, which I understand walking into a small Italian place and being like 11 people. It's going to be an issue.\" But they separated us seven and four. I mean, with all due respect, I've been to I go to this one small Italian place called the Olive Garden quite a bit and they said 11, no problem. They sit 11. No problem. You're family. It's you know, it's just how it's part of the part of the logo. And then we got there and had more wine. And at which Gia said, \"Just pour me a splash.\" And then the guy filled them to the brim right away. And I was like, \"Here we go. Off to the race. Here we go.\" Yeah. So, yeah, I had to deal with that. Uh, but what I really had to deal with was, and I've been, you know, there's been the the ongoing saga of me and my upstairs neighbors, which I'm totally down. I thought we solved it. I thought we liked",
      "start": 165.92
    },
    {
      "text": "but what I really had to deal with was, and I've been, you know, there's been the the ongoing saga of me and my upstairs neighbors, which I'm totally down. I thought we solved it. I thought we liked the upstairs neighbors. Yeah. Okay. They're great. They're awesome. There's been a lot of communication. Everything's super good. But last night was the first time that I was like, \"This seems like you're pushing the boundaries.\" You had to go. Come home. I didn't. I was like, \"Whatever.\" The old uh 3 a.m. 3:00 a.m. Group of dudes come home on Tuesday. on a Tuesday night. Not Wednesday morning. Okay. Yeah. Okay. Come home. I just start freestyle rap battling. Oh, no. I don't like that. I But they were so drunk and I was just like I hate this so much cuz I just want to sleep. But there's nothing funnier than this to me, right? You wanted to go up there and wreck them, too. Oh, well, not so much that. Just watch. But then I could hear so that's kind of all I needed cuz I feel like if I saw",
      "start": 200.96
    },
    {
      "text": "funnier than this to me, right? You wanted to go up there and wreck them, too. Oh, well, not so much that. Just watch. But then I could hear so that's kind of all I needed cuz I feel like if I saw it, it would be a little too cringeworthy. Sure. Now, was Gia out cold this entire time? She knocked the **** out. Yeah. Yeah. Cuz to Jen's credit, all the alcohol did for her was make her more aggressive to kick people's asses in Arms. Oh, okay. So, she came home and tweeted out again, \"I'm here to play Arms.\" Then tweeted off, \"All right, my pants are off. It's time to play Arms.\" And then she just **** wrecked Best Friends the while I read Lock and Key. Yeah. Yeah. That's That's quite the life. I didn't I didn't get to play Arms last night, unfortunately. No, but I did read Lock and Key. We'll get to that that later. That was your required reading, remember, from last week. So, that's exciting. Anything else? Any other fun stories from last night? Kevin sat behind me. I grabbed his",
      "start": 242.48
    },
    {
      "text": "We'll get to that that later. That was your required reading, remember, from last week. So, that's exciting. Anything else? Any other fun stories from last night? Kevin sat behind me. I grabbed his leg at one point. How was your guys' table? I guess that's a big question I had. Oh, no. You were with me. **** Kevin, how was your table at the Italian joint? How was your table there? I mean, I'm going to be honest, guys. It was kind of boring. Sean Pitts drag it down. Yeah. And random Nick Friend. No, actually Nick's friend who Scott Big Dick Scott. Yeah that is what they call him. You might know him from the game of regret. I actually heard a story where his mother-in-law was talking about how big his dick is. Yeah. His mother-in-law. His mother-in-law. A very very petite Japanese woman. Okay. Really, dude? Those videos, I swear to God, they're the the trend right now on the porn websites. The whole stepson, stepdaughter, step brother, step whatever. Like if you go to any porn site",
      "start": 277.04
    },
    {
      "text": "Okay. Really, dude? Those videos, I swear to God, they're the the trend right now on the porn websites. The whole stepson, stepdaughter, step brother, step whatever. Like if you go to any porn site right now, YouTube porn, Red Tube, the freaking UJ's. Hold on. Hold on. Andy, what was that one you just told me about? Yes porn Please. Yes, porn please.com. That's too many words. If you go to any of these, at some point on the front page, there's going to be some type. Okay. At some point on the front page, there's gonna be everything. No, that's not true. Step stepad. That's what I'm saying. But I'm talking step brother and step sister. That's what's really popping off right now. They're not related. It's legal. It is legal. Yeah. So, anyways, it's all perfectly legal. Some would say perfectly legal. GG List says, \"I know, Tim. It's great.\" I agree. You know, not because of the thrill of **** your sibling, but because of the thrill of these girls are really hot. They're like for",
      "start": 317.44
    },
    {
      "text": "legal. GG List says, \"I know, Tim. It's great.\" I agree. You know, not because of the thrill of **** your sibling, but because of the thrill of these girls are really hot. They're like for some reason, it's the cream of the crop. They know what they're doing and they're they're doing it right. Okay. But there's also the thrill of **** your sibling. So, yeah, we heard a lot of cool stories about Yeah. Yeah. Yeah. Nick's childhood. What did you eat? What did you get from the place? I got uh the Joe's special. Okay. You hear Did they tell you the special? The Joe special. It was like a giant ball of um ground beef. Oh. With like onions and mushrooms like shoved in there and all grilled together. How was that? It was really good. Now, did that did that that played into your diet that you're on, right? You're on Cuz you're trying to do the Nick thing, right? No carbs. How's that going? Smoothly. Yeah. I Tim's mom **** sent donuts. Is she trying to sabotage anything? Is she trying to",
      "start": 360.08
    },
    {
      "text": "on, right? You're on Cuz you're trying to do the Nick thing, right? No carbs. How's that going? Smoothly. Yeah. I Tim's mom **** sent donuts. Is she trying to sabotage anything? Is she trying to ruin the I don't think I don't like I think if she knew she'd still send the donuts, but um man, I tell you, there's some apple fritters in there. It's It's really hard not to just **** devour them. I'm a big fan of apple fritters. Oh, they're so good. How do you feel? What do you come down? I don't think I have an opinion on apple fritters. Apple fritters to me. You don't have an opinion? I want to give them a shout out because most donuts, they're too small. Yeah. The apple fritter, that **** will fill you up. Oh, that's the guy in there that looks like all crazy. Yeah. Like a like he looks like like a frozen **** Like the nemesis from Resident Evil. Yeah. Or when you go to the fa the elephant's ear. That's not it either. No, like if you were to freeze a **** like like a diarrhea",
      "start": 406.0
    },
    {
      "text": "like like a frozen **** Like the nemesis from Resident Evil. Yeah. Or when you go to the fa the elephant's ear. That's not it either. No, like if you were to freeze a **** like like a diarrhea **** Okay. You know what I mean? I guess. Yeah. That would be really liquidy and that's wrong all over the place. You have you have it you have it in a bag. If you have it in a bag, that's it in a bag. If you didn't know, ladies and gentlemen, this is the Kinda Funny Morning Show. Each and every weekday here on twitch.tv/kindfunnygames. We run you through the nerdy news we want to talk about. Then we jump into the chat to answer your questions, comments, and concerns in between those two segments. Give away a video game. You can win it by supporting us here on Twitch. Doing the Twitch Prime thing by supporting us on Patreon. There's a million different ways and things are going up. It's crazy. Then we jump into the chat for the three and three. The old three and three. We go through your",
      "start": 443.28
    },
    {
      "text": "by supporting us on Patreon. There's a million different ways and things are going up. It's crazy. Then we jump into the chat for the three and three. The old three and three. We go through your tips. We go through your subs. Then we go to Kinda Funny Games Daily. But first off, we have the housekeeping segment. Uhhuh. Today the new party mode is live for everybody. You can watch it right now on youtube.com/kindafunnygames. It's fantastic and you did a great job. It's Mount Your Friends. Um I went through and made sure that I photoshopped our faces out so that when we play it's our faces with those big swinging dicks. Let's see some of them dicks. Greg, wait. Hold on. I love this part. Yeah, this is the best part. This this is this is one of the best parts. The other best part is when I do the Spider-Man song and Andy edits in the Spider-Man footage. That's good, too. Andy's edits are insanely awesome. He's great. He's fantastic. But anyway, yeah, you can see",
      "start": 480.48
    },
    {
      "text": "best part is when I do the Spider-Man song and Andy edits in the Spider-Man footage. That's good, too. Andy's edits are insanely awesome. He's great. He's fantastic. But anyway, yeah, you can see here um there's a lot a lot to take in, a lot to enjoy. I hope you do. Party mode. Go check it out. Best show of all time. We enjoy this show quite a bit. It's a show you requested. It needs your love. Share it with your friends. You might say, \"I don't have that many friends.\" I don't **** care. Share it with them. Titan Matrix says, \"I assume it's not safe for work.\" Depends where you work. I mean, is any if any of our content is safe for where you work, like right now, because I can just yell out anything I want. Yeah. Like, what are you going to yell? What are you going to yell? Nothing. Nothing. Hey, Titan Matrix. Titan Matrix got weed over here boss. Too much. Titan Matrix got weed in his cubicle. Come over here boss. Titan Matrix. Boss, that's what you do. You guys just like I",
      "start": 520.88
    },
    {
      "text": "Nothing. Hey, Titan Matrix. Titan Matrix got weed over here boss. Too much. Titan Matrix got weed in his cubicle. Come over here boss. Titan Matrix. Boss, that's what you do. You guys just like I know Titan Matrix. He works with me. He's got the little thing the Titan Matrix like sign on his cubicle. What area code is 301? 301? Nobody knows. I just got a phone call from a 301. It's LA. Is it LA? That's Maryland. Maryland. Maryland. That's weird. Oh, Bethesda's calling. Oh my god. Pete Hines wants to talk to you. Uh, let's see. And then the other thing is, like Greg said earlier, we have another GOG that we were recording today. You can watch it live at 3 p.m. if you are a supporter on patreon.com/kindafunny. That's the one that'll have the comedy show in there. It'll be a a a time capsule and Andy Cortez will be there. You're the most requested. Everybody on Reddit has a hard on for Andy Cortez. Well, now we're taking your hardons and we're shoving in Andy's hole. A lot of people are",
      "start": 558.16
    },
    {
      "text": "and Andy Cortez will be there. You're the most requested. Everybody on Reddit has a hard on for Andy Cortez. Well, now we're taking your hardons and we're shoving in Andy's hole. A lot of people are just shouting out a whole bunch of random ass area codes now. Sure. It's just like, all right, 619. I understand Rey Mysterio, he's he is from there, but why is why is people throwing out the 313? Like that that ain't what we're doing here. 313 315 Chicago. Anyway, let's get in the news. Greg That's how you do it, Kevin. Mimic that in like an hour. Am I doing it? Some garbage. Can you try again? Are you gearing up to do it? Yeah. Yeah. He's like a little kid that go He's like a little kid who goes up to the edge of the diving board and he's like and he comes back. He's like I can't do Give it to me one more time. Time for some news. I don't know. No. No. The like the noise. See, now when you do it, it sounds like Star Wars. Yeah that's I'm hearing all I sound here. And he's got a ball",
      "start": 604.08
    },
    {
      "text": "it to me one more time. Time for some news. I don't know. No. No. The like the noise. See, now when you do it, it sounds like Star Wars. Yeah that's I'm hearing all I sound here. And he's got a ball Star Wars. That's actually Morris code. Someone figure that out. Andy has the best dude. Andy, give it to me. No, you better not punch my nuts you piece of **** See, that's like, you know, some news is coming. This is the **** This is breaking news. I'm glad we're taking the practice swings here. Yeah cuz yesterday people not happy with YouTube clowns over there. You clowning around. One person said that in the YouTube one person in the YouTube comments said that. I certainly did. Punched He punched me in the nuts in quotes. He's like, \"Wait, I have a serious show, guys. **** you guys. You guys ruin it. You guys ruin Games in the Nuts. You ruined Kinda Funny Games. I'm on team Andy with this. You're trying to ruin this. Don't **** point at me. Don't hit that. I haven't been on",
      "start": 657.2
    },
    {
      "text": "You guys ruin it. You guys ruin Games in the Nuts. You ruined Kinda Funny Games. I'm on team Andy with this. You're trying to ruin this. Don't **** point at me. Don't hit that. I haven't been on this show in a while. I'll do whatever I want. I'll touch the wall. No. Stop it. Don't pee on the wall. Cherry on. Yeah. Hell yeah. Hold on. Hold on, guys. Yeah. I got it. When you do it, it's nasty. Last night, I figured out how to do it at dinner. When he puts When my brother puts his tongue out, like it it looks more like gangster for some reason, but when you do it, it's like oddly sexual. Oh my. Yesterday at the burger place, uh, Nick noticed Greg doing it. Cool Greg doing it from like a distance. And so Cool Greg and I were just standing there and then all of a sudden Cool Greg turns and we see Nick across the restaurant at the soda fountains doing the thing. Cool Greg was like, \"Damn, he caught me.\" Oh my god, I love it so much. All right, cool. Here we go. Back to the news. We",
      "start": 707.2
    },
    {
      "text": "and we see Nick across the restaurant at the soda fountains doing the thing. Cool Greg was like, \"Damn, he caught me.\" Oh my god, I love it so much. All right, cool. Here we go. Back to the news. We haven't even gotten into it. Well, I I did the intro to it. We never got to it. This comes from IGN. The Batman director Matt Reeves promises noir driven detective movie. Hell yeah. This comes from Jim Vida. Snacks. Filmmaker Matt Reeves dropped some juicy morsels about his next project, Warner Brothers next solo Batman movie while promoting his new release, War for the Planet of the Apes that I got to say, Greg. Yeah here he I'm feeling kind of inspired to go back. I haven't seen any of this trilogy. Oo, really? I feel like I might have to. They're good. Here's my thing. I thought the first one, you know, the James Franco one because again, let's be very clear, we got yelled at a long time ago with this that Marky Mark not involved in this one. That's not in this universe. Even though I",
      "start": 756.24
    },
    {
      "text": "one, you know, the James Franco one because again, let's be very clear, we got yelled at a long time ago with this that Marky Mark not involved in this one. That's not in this universe. Even though I thought they said they was. No, we got in a big argument. Remember on I think it was a Colony Guy live. I have no idea what you're talking about. I'm pretty sure. Anyways, the James Franco one was really good. The next one I remember thinking was fine. And I really have trouble remembering really. I remember we were down in the like it was downtown San Francisco and then we went across the bridge and fought them and they were smart and then but it's the same and like this trailer looks a lot like that but it is getting good reviews and they're saying that like as a trilogy it's fantastic. Yeah. So West Bray 6 says they're really good sort your life out Tim. I think I might have to. We have known for a while is not sorted. It's definitely not sorted. In a chat with new trailer buzz via",
      "start": 805.12
    },
    {
      "text": "So West Bray 6 says they're really good sort your life out Tim. I think I might have to. We have known for a while is not sorted. It's definitely not sorted. In a chat with new trailer buzz via Batman News, Reeves explained that he was as much a fan of the DC superhero as a child as he was of the Planet of the Apes film series. Reeves also drew comparisons between the Dark Knight and the protagonist in the new Apes trilogy, Caesar. I see a parallel emotionally between Caesar and Batman in that they're both characters who are tortured and trying to sort of grapple within themselves to find a way to do the right thing in a very imperfect and to some degree corrupt world. And so that's really that emotionality that I'm interested in. He added, I want to do a very point of view driven. You know, this film and with all the films, what I try to do in an almost hitchh cockian sense is to use the camera and use the storytelling so that you become the character and you empathize with that",
      "start": 838.0
    },
    {
      "text": "know, this film and with all the films, what I try to do in an almost hitchh cockian sense is to use the camera and use the storytelling so that you become the character and you empathize with that point of view. And I think there's a chance to do an almost noir driven detective version of Batman that is point of view driven in a very very powerful way that hopefully is going to connect you with what's going on inside of his head and inside of his heart. Oh, he's going to have a heart. He also recently confirmed Ben Affleck, who had previously been attached to direct the Batman solo films, is still on board to play the Caped Crusader. He added that he's only just getting started on working on the Batman movie now that he's done with War for the Planet of the Apes. Good. Stop making other movies and just make Batman. Just make Batman. That's all. We've talked about this before. Once you get attached to these projects, just stop it with your other **** movie nobody cares about. Sounds",
      "start": 876.72
    },
    {
      "text": "and just make Batman. Just make Batman. That's all. We've talked about this before. Once you get attached to these projects, just stop it with your other **** movie nobody cares about. Sounds like people. Don't go out there and make LA Noir, whatever the **** you were making, Ben Affleck. **** sit there, put on the bat suit, film three Batman movies back to back while you're in awesome shape and be done with it. Yeah. You understand? Understand? This isn't hard. Think about how many videos we we did a podcast yesterday. We do a podcast today. You tell me you can't make a Batman movie yesterday, make a Batman movie today. That's not you, DC. Step it up. Super simple. It seems like, yeah, super simple. Thank you, Zack Snyder. People, all these comic book people, Scott Snyder, all these other comic book people, they're putting out comics. Scott Snider's left and right. They're making comics. Make Batman movies left and right. Exactly. You're making comics every month. If you tell",
      "start": 912.4
    },
    {
      "text": "other comic book people, they're putting out comics. Scott Snider's left and right. They're making comics. Make Batman movies left and right. Exactly. You're making comics every month. If you tell me you can't just knuckle down there, write a **** script. Come on, guys. Ain't that hard? I know people that can shoot things. Kevin can shoot things. You know how to use a camera. Not well. No. But hey, doesn't matter. You can do it. You can do it. I'm proud of you guys. Next story. I want to get into comics. Next story. This is uh we we covered this yesterday, but I wanted to actually show it cuz it was just read in a tip. There's a back and forth going on on Twitter where Ruke from Death Note um has his own Twitter. It's Ry and he is verified and my brother is really excited about to follow him right now and I love him so much. Ry and Adam Wingard the director the guy that also directed uh the Blair Witch reboot or re whatever the movie that just came out that was fantastic. Yeah.",
      "start": 949.6
    },
    {
      "text": "him right now and I love him so much. Ry and Adam Wingard the director the guy that also directed uh the Blair Witch reboot or re whatever the movie that just came out that was fantastic. Yeah. Sequel whatever. And uh he's directing this movie and they're having a back and forth on Twitter and Ryuk's like, \"Come on, let's show some shit.\" And it's very in character to Ryuk and I like that. Is it cool or cheesy? It's I mean it's both. Okay. But like I love it. Like it's definitely true to the character. Okay. So it's like awesome. But the character is kind of cheesy overall but that's whatever. It's great. Is this a w to foe? Yes. Gotcha. Yeah. Yeah. Yeah. And so it's like given that the style of all of this I'm feeling it, man. This poster isn't so too much, but August 5th, we're getting closer and closer. Yeah. So I again I wish it was a series and not a movie. Don't think they're really going to do a great job in two hours, but I want to. I want them to. Me, too. Me, too. I",
      "start": 985.28
    },
    {
      "text": "getting closer and closer. Yeah. So I again I wish it was a series and not a movie. Don't think they're really going to do a great job in two hours but I want to. I want them to. Me too. Me too. I still cuz Adam Wingard the **** and a half. Andrea Rene is bringing in some kind of food. Is these are these little smokies? These are chocolate croissants. Chocolate croissants. Oh yeah. **** yeah. Okay. Well I have to do this. Thank you sugar. Thank you. Oh covered in sugar. Thank you Andrea. I'll see you soon. Kind of Funny Games Daily. Um anyways. Yeah I'm excited. We got to do I need to figure out what we're doing for this but I want it to be a watch along. We're in a stalemate. They're uh they're eating the chocolate crisp. I put it in my mouth first so I thought you let me finish it. And then My thing is I didn't cuz I was waiting for you to talk to put it in my mouth but then I realized you just put it in yours. They're trying to explain something but if you didn't",
      "start": 1029.04
    },
    {
      "text": "finish it. And then My thing is I didn't cuz I was waiting for you to talk to put it in my mouth but then I realized you just put it in yours. They're trying to explain something but if you didn't know the context it sounds very Kevin's job. You want me to stop? Oh Kevin's got it. Okay. Yeah they're still going the eating. Uh it looks like Tim It was a dense little chocolate croissant. I wasn't I wasn't trying to say I was going to try to figure out which one finishes first but by the way you were talking I was going to put my money on Tim but it looks like Greg already done Tim getting everything. Like I'm used to having dense balls in my mouth. You know you certainly are. You certainly are. Well that Whole Foods man. First the sandwiches the other day on the stream. Cool egg somehow a truck turned over and he got all these coupons for Whole Foods. We use those delicious sandwiches. Now it turns out they got little chocolate croissants. Good job Amazon. Good purchase. Next",
      "start": 1073.04
    },
    {
      "text": "a truck turned over and he got all these coupons for Whole Foods. We use those delicious sandwiches. Now it turns out they got little chocolate croissants. Good job Amazon. Good purchase. Next story. This isn't so much a story as much as it's a public service announcement. Okay everybody ready? Public service announcement. Baby Driver is out now worldwide. Yeah you can watch it. You should watch it. I haven't seen it yet. Nick saw it. You saw it? No. Okay. Couldn't go. We didn't go. We had to do some **** Kevin saw it. Edgar Wright one of my favorite directors and I just wanted to support it. The reviews are good. Yes. The reviews are fantastic. But I heard our guys didn't like it. No. No. Nick didn't like it. Greg also was not a huge fan. Cool Greg. Cool Greg. Cool Greg shake his head. Now here's what I'm upset about the most guys. So it was you Nick and Cool Greg that went and saw this movie. Yes. Correct. Yes. Gorilla Nostril says \"This is a Tim movie.\" Why is it?",
      "start": 1110.96
    },
    {
      "text": "his head. Now here's what I'm upset about the most guys. So it was you Nick and Cool Greg that went and saw this movie. Yes. Correct. Yes. Gorilla Nostril says \"This is a Tim movie.\" Why is it? Well I don't hear it from my boys. I don't hear it from the crew. I got to hear it from people on the internet tweeting at me that the Vita plays a starring role in this movie. The Vita I hear gets two minutes of screen time. the PlayStation VA. We could have been beating the drum. I don't even remember. Could have been beating the drum. Putting up the relocation program. We had some things going here. I don't even remember that. You guys suck. You're part of the problem. Are you sure you saw the same movie? Did you just go see Ray again with Jamie Fox? I've never seen You never saw Ray. Is it good? Oh my god. Ray is awesome. So good. Ray is really good. Ray is great. You got to watch it. I put it on the list. Please do. They don't do anything with Diet Pepsi. That's the one thing I",
      "start": 1152.24
    },
    {
      "text": "Is it good? Oh my god. Ray is awesome. So good. Ray is really good. Ray is great. You got to watch it. I put it on the list. Please do. They don't do anything with Diet Pepsi. That's the one thing I wanted. So you're selling people on watching it just because goddamn right. It's got a Vita. Let's get out there and support everybody. I'm super excited about it though. I really want to watch it. Nick's kind of bringing me down on it but then I remembered that me and Nick mostly don't agree on Remember that Nick likes Daddy's Home so **** off. Yeah. So anyways that is what it is. All right good. It is what it is. Now it's time for comics. Now it's time for comics. Greg's doing the comic dance. C O M I Cs. Comic time. That's a great jingle. Thank you. Good chunk. Yeah it was. It was something for sure. If you didn't remember ladies and gentlemen each and every Wednesday here on the Kind of Funny Morning Show we talk comics because it's comics day. New comics are out. We",
      "start": 1193.84
    },
    {
      "text": "was something for sure. If you didn't remember ladies and gentlemen each and every Wednesday here on the Kind of Funny Morning Show we talk comics because it's comics day. New comics are out. We tell you what you should be reading. We talk about the required reading from last week and assign you something new. I'm very excited. Where are we starting today Tim? Today we are starting with the required reading. Okay. Last week we were recommended by many best friends out there that we read Lock and Key volume 1. We did. I did. So we did. I did last night. Me too. While Gio was next to me in bed. Sure. That was fun. She passed the **** out. She was knocked the **** out. And we had to switch sides because I I knew I had to read. Okay. And I was like \"Oh I'm going to read the other.\" She's like \"No I want you to lay next to me.\" I'm like \"God well you have a light on your bedstand.\" And I don't. Then we had to switch and it was super awkward. Then I couldn't sleep cuz I'm",
      "start": 1232.72
    },
    {
      "text": "She's like \"No I want you to lay next to me.\" I'm like \"God well you have a light on your bedstand.\" And I don't. Then we had to switch and it was super awkward. Then I couldn't sleep cuz I'm used to one. It's always a whole **** thing. But I loved it though. I loved the You loved Lock and Key. Here's my thing. Love is a strong word. I don't love it. I enjoyed it a lot. It did the perfect thing where it introduced the world introduced the characters. I was very I was in I was totally there was no point reading it that I was like ah I'll stop now and I'm going to come back tomorrow and finish it which is good because there's a lot of times these volumes I really enjoy how comics are set up where it's in what sixish arcs give or take most of the time. Yeah. And I enjoy that especially in the early goings of the the series because it just kind of like gets you into it. And I feel like there is a a nice intro middle conclusion right? Where it's like you take that and then when",
      "start": 1270.56
    },
    {
      "text": "in the early goings of the the series because it just kind of like gets you into it. And I feel like there is a a nice intro middle conclusion right? Where it's like you take that and then when you start looking at the volumes on volumes and volumes then they those start having other plots within it and that gets really confusing. But when it's just early on you really kind of get in there and I feel like there's been a lot of volume ones where they lose me somewhere in the middle and I'm like this is cool but like whatever and then they usually get me back at the end. This I was pretty steady the entire time and I like that at the end I was like huh I am interested to read more. What happens next? Yeah. Yeah. Yeah. Exactly. Yeah. No I enjoyed it. I'm with you. I think you you you nailed it in terms of how I feel about it. Where Yeah I was along for the ride and I enjoyed it the whole way. For me though when we got to the end here I was like \"All right cool.\" I don't I'm not",
      "start": 1306.88
    },
    {
      "text": "it in terms of how I feel about it. Where Yeah I was along for the ride and I enjoyed it the whole way. For me though when we got to the end here I was like \"All right cool.\" I don't I'm not motivated enough to pick up volume two or pick back up with what's going on. I thought it was cool. I liked the story. I like the They did a really good job I thought of suspense in terms of opening with the really creepy scene. You know shit's about to go down. Then the flashbacks every so often. So we're getting a little bit more a little bit more of what happened how did it happen what did he say about his dad? Oh that's what he You know what I mean? Like there was all this really cool **** Yeah. The continuity was fun. Yeah. But for me I think one of the reasons I cuz like the way Lock and Key goes right is that this is my autographed copy from one Joshua Joshua Yale over at IGN Comics. All right. He gave this to me when we still worked at IGN and it sat on my shelf forever.",
      "start": 1343.28
    },
    {
      "text": "lock and key goes right is that this is my autographed copy from one Joshua Joshua Yale over at IGN Comics. All right. He gave this to me when we still worked at IGN and it sat on my shelf forever. And then we got another one from the best friend whose name I always call the ice cream sandwich kid. Jay Fitz. Jay Fitz. Thank you. He gave another one. I'm like \"All right well that's enough.\" enough. And then not to mention when we started the show a lot of you have been out there saying \"No no you need to read this. You need to read this. You got to do this. Got to do this.\" So jumping into it my thing about it is that like as much as I love horror movies horror comics never really get me right? I never really feel connected. So for me in this one I dug the whole \"Hey I we're spoilers right? That's how required reading. You got a week to read this. Hey I loved the whole We should do what we normally do which is we'll talk about it spoilerfree and then enter the",
      "start": 1378.0
    },
    {
      "text": "I we're spoilers right? That's how required reading. You got a week to read this. Hey I loved the whole We should do what we normally do which is we'll talk about it spoilerfree and then enter the spoiler zone.\" Yeah we're entering the spoiler zone. Cool. Cool. We're in the spoiler zone everybody. Don't worry. Hold on Kevin. You're going to be okay. And this isn't even that much. I mean it's literally the first few pages. I like the whole thing of hey I'm a classmate and I killed your dad and **** up your life and now I'm coming for the you know coming across the country to do it again. I didn't I know this is like the whole **** part of the book. I didn't need the supernatural stuff. Yeah. Like the kid becoming a ghost going through the door and then the the ghost in the well. And I was like I really don't care about any of this. Can I get more of that? which is a reason that I love Nailbiter I think or loved Nailbiter which has now completed its run as well. No I",
      "start": 1413.52
    },
    {
      "text": "And I was like I really don't care about any of this. Can I get more of that? which is a reason that I love Nailbiter I think or loved Nailbiter which has now completed its run as well. No I see what you're saying. I mean I I'm with you where it's like some of the the supernatural stuff isn't really my jam but what I liked about this book is that it kind of felt like a grownup super dark reboot of Casper. Okay. And I was into that. Sure. No I liked I liked the the kid. It's really dark. Yeah. Like the kid the art the way it's drawn of the kid when he's dead is like holy **** Like that **** isn't dead. He dead you know? And like killing kids is frowned upon. Yeah. Normally of course. Um but I I enjoyed the how the the liberties that they took with that. And I I liked the I liked how much I enjoyed the plot even though I didn't love most of the characters. Like there's not too many characters in this. Um I really like the bad guy was the probably the most interesting one",
      "start": 1448.4
    },
    {
      "text": "how much I enjoyed the plot even though I didn't love most of the characters. Like there's not too many characters in this. Um I really like the bad guy was the probably the most interesting one to me. Yeah. With the **** up face. Like I really enjoyed all the scenes he was in because I wanted more I wanted more backstory of like what got him to be where he's at. Yeah. And I feel like they did a good job with it. I didn't like the character of the the well ghost or whatever. Her coming back is like a dude. She went through one of the doors that changes you from a boy to a girl or girl. I know. I know. But I Kevin you read this right? Yeah. What' you think? I I enjoyed the **** out of it. I I'm also really like excited the fact that like there's seven volumes and that's it. Oh is that true? I I believe so. As far as I can tell it ended in like 01. It ended. That's what it looked like online. This changes everything. You're more interested in reading it. This changes",
      "start": 1487.84
    },
    {
      "text": "Oh is that true? I I believe so. As far as I can tell it ended in like 01. It ended. That's what it looked like online. This changes everything. You're more interested in reading it. This changes everything. So that's the thing. I started reading this and I got really upset cuz I was like \"Fuck I really enjoy this. I want to go deeper but I don't want to do another ongoing series.\" And then I looked it up and I was like \"Oh that is cool.\" All right. If it's seven volumes I can get down with that. I feel like they did a good enough job selling me on a world for seven volumes. Okay. Yeah. I do recommend it though. I think it's a it's a fun read. I think there's other things I'd recommend over it if you haven't read but I I There's nothing about this that I'm like eh. Okay. Oh it's great. Titan Matrix who boss Titan Matrix is watching the Twitch. Titan Matrix says uh Lock and Key is six volumes. There was a one shot last year that was just just explains a key. I love",
      "start": 1530.64
    },
    {
      "text": "it's great. Titan Matrix who boss Titan Matrix is watching the Twitch. Titan Matrix says uh Lock and Key is six volumes. There was a one shot last year that was just just explains a key. I love that. Yeah that's cool. There you go. Yeah. No that's not Yeah having an endo is helpful. Yeah I might let you go a little bit further and tell me if it's something invested because the one tease right in it in the in volume one is when we're looking at the old photo of the dad with his arm around the woman. I don't think that wasn't the mom but he had the bracelet on. And then as soon as I saw that I was like \"Oh that's the ghost the well person over there looking at the thing.\" And then the well person went through the door became a boy and I'm like \"Now are they going to go through a door to time travel back there and **** That's what I was thinking too.\" That's interesting. That's That's interesting to Yeah. I I feel like the concept of like introducing magic through",
      "start": 1569.84
    },
    {
      "text": "a door to time travel back there and **** That's what I was thinking too.\" That's interesting. That's That's interesting to Yeah. I I feel like the concept of like introducing magic through these doors that only certain people sounds like because like adults can't go through the doors. I thought that was really interesting and something I Yeah. As you get older you forget about all this and you don't believe it and so you don't have to worry about it. Yeah. No very cool. And it comes from IDW which is a I say very underrated publisher. Well they've been coming up lately have they? Yeah they've been coming on their own I think with all the stuff they do with the Ghostbusters and Ninja Turtles. I mean my thing is I've been reading them for a decade now with the Transformers and Ninja Turtles. So I love them. I'm a big fan of them. I feel like there is a a high level of quality that they stick to when it comes to combining artist with writers and sticking to it for a while.",
      "start": 1611.36
    },
    {
      "text": "Ninja Turtles. So I love them. I'm a big fan of them. I feel like there is a a high level of quality that they stick to when it comes to combining artist with writers and sticking to it for a while. And they they usually stay committed for long enough. Never the whole series but like long enough. And so yeah cuz you never really hear about them. You hear about like even Image at this point is like in the big three. It's a big three. Yeah. 100% 100%. Yeah. Yeah. Okay. Uh it seems like everybody in the chat enjoyed it as well. Yeah we've been all over the place here. They're saying it's worth it for reading through the entire way too. Yeah. Uh Citizen Sandman says \"You have to read past the second volume to see why people rave about Locking Key.\" Can I buy that? Huh? I I just It's crazy cuz I already am super excited. Yeah that's good though. I like that. It gets better. Okay maybe I will keep going then. Mhm. I'm trying to load up for this trip. You know what I mean? Cage",
      "start": 1646.32
    },
    {
      "text": "crazy cuz I already am super excited. Yeah that's good though. I like that. It gets better. Okay maybe I will keep going then. Mhm. I'm trying to load up for this trip. You know what I mean? Cage Kami 85 says \"New saga out today.\" Oh yeah. You want to get into our playlist? Let's get into the playlist. Let's go. All right. So what what are you what are you stoked for this week? I am stoked for the Batman/ Elmer Fud special. Agreed. I when I It's chief top of the list in my poll list. Have you read it yet? I have not read it yet. It's on the list. I got to get to it. Well I this morning I woke up got the sleep out of my eyes built Kind of Funny Games Daily and then jumped into the pull list started pulling stuff pulled Batman Elmer Fud and like it was not at all what I expected. So that's the thing. They announced in March that they were going to do a Looney Tunes DC crossover series where there's like a couple one-offs. Uh there's one I think it was Wonder Woman",
      "start": 1684.16
    },
    {
      "text": "So that's the thing. They announced in March that they were going to do a Looney Tunes DC crossover series where there's like a couple one-offs. Uh there's one I think it was Wonder Woman Tasmanian Devil one is Bugs Bunny and Justice League. Uh but Batman Elmer Fud is the one that I'm like that sounds just crazy enough to work. Yeah. And the reviews are out. People are **** raving about it. It's **** awesome. And did you read it yet? Yeah. Oh okay. Give me the pitch. I mean like for me like I I saw the cover and saw it on the and I'm like \"All right cool. That's why I pulled this. I want to see what this is all about.\" And it I was expecting it to be a normal crossover of cartoony Elmer Fud meeting Batman or whatever. And that's not at all what it is. It's a human Elmer Fud and human versions of all the other Looney Tunes in Gotham City. And like not they didn't get like transported there. They're living in Gotham City. They have their own bar. That's",
      "start": 1725.68
    },
    {
      "text": "a human Elmer Fud and human versions of all the other Looney Tunes in Gotham City. And like not they didn't get like transported there. They're living in Gotham City. They have their own bar. That's Porky's Bar. You go in Porky's behind the thing but he he kind of has a piggy nose but he's not like a pig. And they all have like their speech impediments or whatever. So like yeah you know like even they do like one of those like panarounds. You see what all the different people are doing. You're like \"Oh that's the **** guy with the guns.\" You just send me Sam right? Yeah. Right. And that's the giant chicken guy. I'm not the biggest fan of the chicken there. No no Lola the Bunny. Sorry. But Bugs Bunny is there and you know he's like Elmer Fud's a hitman. He's got a shotgun in. He comes into the bar to kill Bugs Bunny and then they have a conversation and Bug Bugs talks his way out of it and that leads to him encountering Batman and then B like them there's a Batman Elmer",
      "start": 1762.48
    },
    {
      "text": "He comes into the bar to kill Bugs Bunny and then they have a conversation and Bug Bugs talks his way out of it and that leads to him encountering Batman and then B like them there's a Batman Elmer Fud fight that's **** awesome and it's not like comedic like you know like oh like he trips over his gun and stuff like there's like awesome like hitman moments in that of like where Elmer's in the room or whatever and Batman's creeping up behind him and Elmer does like the whole like huh and like puts the gun over his shoulder like like he's an idiot but it's because he sees the shadow and so fires and Batman dodges and then they **** roll around like the guns going off and it's like this sounds awesome. If you would have told me this morning before I looked at the pool list that I'd be enjoying a Batman Elmer Fud fight I'd be like you **** idiot. I looked at the comics come out that I saw this and I'm like number one like from reading the the bio because people were saying that it",
      "start": 1801.76
    },
    {
      "text": "a Batman Elmer Fud fight I'd be like you **** idiot. I looked at the comics come out that I saw this and I'm like number one like from reading the the bio because people were saying that it isn't **** cuz the other crossovers not that they're **** but they are what you expected. a cartoony like more comedic thing. Whereas I from what I'm hearing is that this is comedic but in an adult way. It's a standalone thing where like the the comedy elements of it I think are you bringing in your knowledge base of Looney Tunes already right? Cuz for me it was they write all of Elmer's it's from his perspective. So it's all of his dialogue and then his like you know thought boxes or whatever are all written with the lisp. So it's like some of them work really well and others I'm like what the **** is he trying to say? You know what I mean? which is kind of cute kind of funny or whatever. And then to have him get in involved with Batman and have these crossovers with Alfred and Bruce",
      "start": 1840.88
    },
    {
      "text": "**** is he trying to say? You know what I mean? which is kind of cute kind of funny or whatever. And then to have him get in involved with Batman and have these crossovers with Alfred and Bruce Wayne and **** I was like this is really cool. And it's like a it's a longer issue cuz they have some stuff at the back like you know like more of what you'd think of like Bugs and uh Elmer going back and forth about rabbit season and then Batman coming in and being bat season. He plays the role of Daffy but it's like very cartoony so he's like getting shot in the face. Oh so like a a postredit postredit story. Got it. Got it. Got it. Um in the chat I saw something that I enjoyed. Mr. Yasman 300 in the chat says \"Does he say I'm hunting Batman?\" No he I don't want to ruin what he says in there. He says other things that and it's actually again it's funny because you know what? It's rabbits. I'm hunting rabbit or whatever. But the way they use it in callback dialogue is actually",
      "start": 1883.2
    },
    {
      "text": "in there. He says other things that and it's actually again it's funny because you know what? It's rabbits. I'm hunting rabbit or whatever. But the way they use it in callback dialogue is actually really really good in terms of like I don't I don't say it's really good. It's really I was really really impressed with it cuz I I had such low expectations. Taki the penguin says \"I say I say how does he not know fogghorn horn?\" Thank you. I know him. I just don't know his **** name. You got that guy. You got Tweety Bird. You got the rapist skunk. Oh my god. I Am I wrong? Is he in this? No. No. Pepe Li Pu did not pop up in this one. Damn it. Sorry. Sorry to do that to you. I'm I'm excited though. That's cool. Uh also on my poll list this week. Yeah. Saga 44 is out. Uh Supergirl being super. Has anybody been following this? It's been this like it's wrapping up. It's been this four issue arc. They're super long issues though that are told out of continuity just this thing there. I",
      "start": 1920.24
    },
    {
      "text": "super. Has anybody been following this? It's been this like it's wrapping up. It's been this four issue arc. They're super long issues though that are told out of continuity just this thing there. I don't think there is a Superman in their world. It's just Cara doing the stuff. It's really good. It's finally wrapping up there. Um obviously I'm pulling action. I'm still behind though on what's going on there. Looks like the Superman Revenge Squad is still up to no good. Uh SpiderGwen Injustice there. I last week picked up uh Peter Parker the Spectacular Spider-Man and Miss Marvel. I didn't give a shout out last time. I haven't read them yet though but they're on here. Whatever. There you go. What are you doing? The last thing I want to do for the comic section is I want to **** for a second. Oh you want to **** Okay. Yeah. Kev can you pull this up? So IDW after just praising them I need to totally take a **** all over it. So they just announced their the new thing First",
      "start": 1957.6
    },
    {
      "text": "second. Oh you want to **** Okay. Yeah. Kev can you pull this up? So, IDW after just praising them, I need to totally take a **** all over it. So, they just announced their the new thing, First Strike, which is their event because guess what? They did get big enough that now it needs to be freaking events every Oh, right. an event. Last year they had Revolution where they introduced the Transformers been going on for over a decade now in various ongoings, various one-offs, various miniseries. And now they have a point where they have G.I. Joe and ROM and Micronauts and Mask and Mask Action Man and all this stuff. And it's like, guess what? I don't care about any of that, okay? At all. And now every year there needs to be this giant crossover event where they're all reminds exist. I don't want these other I don't at all. I gave it a shot with Revolution. And so here's the thing, Greg. I need to make this clear. Make it clear, Tim. I have read every single Transformers comic in",
      "start": 1996.16
    },
    {
      "text": "I don't want these other I don't at all. I gave it a shot with Revolution. And so here's the thing, Greg. I need to make this clear. Make it clear, Tim. I have read every single Transformers comic in existence ever. up to this point, every single Marvel comics, the generation 1 stuff, back when Dreamwave was a thing, RIP, that 13 issue run was one of the best things ever. The War Within, all this stuff so damn good. Then IDW starts had a really, really rocky start and then it just kept getting better and better and better and this world became awesome and there's just more and more series and some were duds, but most of them I'd say were fantastic. I was so sold and then they did uh essentially restart where it was just like, \"All right, cool. We understand too many humans. You don't like Earth. We're going to **** space. Multiple ongoing series where there's not a single human. It's just Transformers. The series that's been going on More Than Meets the Eye. It's fantastic. Then",
      "start": 2039.44
    },
    {
      "text": "Earth. We're going to **** space. Multiple ongoing series where there's not a single human. It's just Transformers. The series that's been going on More Than Meets the Eye. It's fantastic. Then this **** starts and all of a sudden they're back on Earth and all of a sudden there's humans everywhere and all of a sudden there's a bunch of **** that no one cares about because you need to read it across six different series. And it's not six part bi-weekly series. will feature the talents of writers for Transformers, Skylander, a whole bunch of other stuff. Earth have united after the explosive events of last year's Revolution, bringing together G.I. Joe, Rom, the Micronauts, Mask, Mobile Armor Strike Command, Action Man, and Transformers. Earth has never been more secure now that it has become a member of the Council of Worlds due to Optimus Prime's leadership. So, anyway, I'm done. I'm done. You're done with IDW and Transformers? I'm done with IDW's Transformers until they stop",
      "start": 2087.6
    },
    {
      "text": "has become a member of the Council of Worlds due to Optimus Prime's leadership. So, anyway, I'm done. I'm done. You're done with IDW and Transformers? I'm done with IDW's Transformers until they stop this **** The exception being I will read Lost Light because Lost Light is awesome and it's a continuation of More Than Meets the Eye. But the rest of this stuff, it feels like it's way too continuity heavy in if it was IDW's Transformers has always been continuity heavy, but that's why I'm in it. I'm invested and they **** stick to it. This is just they're treating us bad. I don't like it. They're doing all the mistakes. Ninja Turtle still fantastic. Yeah. Fan fuckingastic. Okay. Yeah. Uh what's required reading this week? Do you have something? We go to the audience. Uh, well, the one audience member I want to call out who's been shouting out books recently was one Kevin A. Coello. Kevin, you shouted out that you wanted to do Green Valley, right? No, I did not. Who shouted that out",
      "start": 2130.96
    },
    {
      "text": "member I want to call out who's been shouting out books recently was one Kevin A. Coello. Kevin, you shouted out that you wanted to do Green Valley, right? No, I did not. Who shouted that out then? That was a fan. Oh, do you remember the fan's name? I do not. Okay. Well, here's my question about Green Valley. Green Valley, Max Lannis' image book completely done. Nine issues all wrapped up. However, not a collected trade anywhere yet. And not till October do we get a collected trade. Oh dear. So, do we do it and just say you can buy the singles from your local comic shop or Comicsology takes two seconds. They're two bucks a piece. Sure. But, you know, I mean, come on. It's not 18 bucks there. That's I think that's too much. Too much. That sounds like you know what? You know what I I I think we should do and again we can go with anything else that you want. I'm just throwing this out there cuz I feel like it deserves more love is Paper Girls volume one. Cuz have you read Paper Girls",
      "start": 2172.16
    },
    {
      "text": "we should do and again we can go with anything else that you want. I'm just throwing this out there cuz I feel like it deserves more love is Paper Girls volume one. Cuz have you read Paper Girls, Kevin? No, I haven't. There you go. I want I want to read Paper Girls. Girls, I want to read Paper Girls. Now, here's and I want everyone to read it and then I want to have a discussion about it. Here's what I want to do then. I want to I want to up the ante cuz you know I'm a big Paper Girls fan. You know this about me. I've been very vocal about Paper Girls. We can say yeah volume one is the required reading of Paper Girls. Extra credit. Okay. Catch all the way up on Paper Girls. Cuz here's the thing. Remember remember everybody, no live shows next week. So your required reading carries you for two weeks into July. Why no shows next week? There's a holiday called Fourth of July next week. I'm on vacation in Missouri. Andrey's on vacation. Danny's on vacation. That means no Games Daily. You",
      "start": 2211.04
    },
    {
      "text": "two weeks into July. Why no shows next week? There's a holiday called Fourth of July next week. I'm on vacation in Missouri. Andrey's on vacation. Danny's on vacation. That means no Games Daily. You have things to do. Nick's got things to do. The kids are going to be streaming every day. Kevin, Andy, Cool Greg, Joey are gonna stream every day at 11. Just play games and hang out. We're also going to RTX. Play. My favorite thing that uh Andy Cortez brought up to me cuz his friend tweet texted him about is that my brother yesterday tweeted out, \"Hey, we're going to be playing PlayStation 1 games next week. What should I play?\" And every time someone responds, he's like, \"Oh, I don't I don't got that.\" That is great. It's just I love that you have 13 games that you could play. You should probably just be like, \"Which one of these do you want me to play?\" Yeah. Cool Greg. All right. So, Paper Girls is your required reading, volume one. However, extra credit is a cash up all the way on",
      "start": 2250.8
    },
    {
      "text": "just be like, \"Which one of these do you want me to play?\" Yeah. Cool Greg. All right. So, Paper Girls is your required reading, volume one. However, extra credit is a cash up all the way on Paper Girls cuz I'll reread it on my plane rides, which to be clear is not much more. Right. That's what I'm trying to figure out. But catching up, I mean, is volume two even out yet? Yeah, it is. Paper volume two is volume two is out and then I think there's like two more issues after that. Let me throw up in Comicsology cuz I do that thing I have so many comics on the iPad I started deleting stuff. You know what I mean? Like if I read it I deleted it. How big is your iPad? It's the biggest. No, I don't know if that's true. Mr. Yasman saying, \"Can Kevin play Friday the 13th? I want to see him play Jason with his maniac laugh.\" I don't think I'm going to be good at it. I mean, I'm down I'm down to play it. I'm down to play. I don't think I'm going to be good at I have it. Jump. You want to jump",
      "start": 2290.56
    },
    {
      "text": "Jason with his maniac laugh.\" I don't think I'm going to be good at it. I mean, I'm down I'm down to play it. I'm down to play. I don't think I'm going to be good at I have it. Jump. You want to jump in the chat? We're jumping into the Yeah, hold on. We got tips to do. We got subs to do. We're way **** up. Sorry. We got just get too excited. I think on comic day we might not do anything about comics. Yeah, that's what **** us up. I like that. Um, let's jump into the giveaway section. Today we are giving away Nex Machina on the PlayStation 4. Hell yeah. It is good. Kevin, I'm gonna need your help. Currently 15 issues in the paper. You have two volumes currently out, volume three coming. You have to pick up singles after that. Worth pointing out that right now on Comicsology, uh, Paper Girls volume one is marked down from $7.99 to 3.99. That's a **** steal. This book's awesome. Yeah. And they're short, too. I'm pretty sure that the volume is only five issues for Paper Girls, not",
      "start": 2330.96
    },
    {
      "text": "Girls volume one is marked down from $7.99 to 3.99. That's a **** steal. This book's awesome. Yeah. And they're short, too. I'm pretty sure that the volume is only five issues for Paper Girls, not six. Uh, but you see this, Kev? Gotcha. Gotcha. Cool. Uh, we're giving it away to a Twitch sub today. Remember, there's four different ways that you can win during these giveaways. One, be there in the Twitch chat. Two, be a Twitch subscriber. And if you're an Amazon Prime subscriber, you get a free Twitch subscription every month that you could use on us if you do so choose. Number three, support us on patreon.com/kindafunny. And number four, support us on patreon.com/kindafunnygames at the $ or above level. Today's giveaway is brought to you by World of Tanks. World of Tanks is an epic team-based, massively multiplayer online action console game. It's a lot of words. Dedicated to tank combat. It's available on the PlayStation 4, which obviously PlayStation 4 Pro as well, Xbox 360, Xbox",
      "start": 2378.0
    },
    {
      "text": "massively multiplayer online action console game. It's a lot of words. Dedicated to tank combat. It's available on the PlayStation 4, which obviously PlayStation 4 Pro as well, Xbox 360, Xbox One, Xbox One S, and coming soon to Microsoft's Xbox One X when that comes out. All the flops. So many flops. Command history's most powerful tanks and experience tactical combat like never before. In World of Tanks console, you can battle up to 30 other players in over 450 historically accurate World War II armored vehicles from the 1930s to 1950s. While the Tanks console is a AAA game that's free to play, the console version was built from the ground up, taking full advantage of both PlayStation and Xbox's unique capabilities. Regular updates are always happening, including exciting new content, special events, and sneak surprises. World of Tanks consoles fully supports HDR and 4K graphics for us fancy people with them fancy TVs. For Kinda Funny show listeners, World of Tanks console has a",
      "start": 2421.04
    },
    {
      "text": "special events, and sneak surprises. World of Tanks consoles fully supports HDR and 4K graphics for us fancy people with them fancy TVs. For Kinda Funny show listeners, World of Tanks console has a special offer for new players who sign up this month. Go to wg.am/ am/funnank and grab your free tank garage slot and 3 days of premium game time while this lasts. It's a limited thing, so it will run out eventually, so get on that if you want that. Go get your tanks. Funny tanks. This is one of those games that's so huge. Mhm. But like it's just like it's it's what we're talking about with Paragon with Andre on the show and stuff. Like it's like you have these communities of people who just play World of Tanks all the time. I've heard about this game for 100 years. 100 years. 100 years. 100 years. The winner of Nex Machina on the PlayStation 4 is Gillis L. Kevin will be emailing you a code right now. I will send him a Twitch message. A Twitch message is what he's going to send you. I'm",
      "start": 2468.56
    },
    {
      "text": "years. The winner of Nex Machina on the PlayStation 4 is Gillis L. Kevin will be emailing you a code right now. I will send him a Twitch message. A Twitch message is what he's going to send you. I'm going to jump into the tips. Timmy Tam. First tip comes from Arville Cernin. He says, \"I have to pay up my birthday tax as I'm getting 35 years old today. Thanks for the awesome content.\" No, thank you for watching. Tacky the Penguin gave us a tip and said, \"In my dream last night, I was running a 5K with Greg, Jen, and Mr. Penguin von Penguin in NYC where I live. Mr. Penguin Von Penguin kept falling in the subway tracks.\" Jesus, he does that a lot, though. Jen tried to side me up for a 5K the other day. Didn't go well. Uh, Annie Kins gave a tip and said, \"Bay area.\" Question for Tim and Cool Greg. Have you guys ever heard about I am Sue? If so, what do you think of his music? I am Sue. I am Sue. I was cool. Greg's coming in to give you the slapping report. Does I am Sue slap? Yeah, he slaps.",
      "start": 2509.44
    },
    {
      "text": "Greg. Have you guys ever heard about I am Sue? If so, what do you think of his music? I am Sue. I am Sue. I was cool. Greg's coming in to give you the slapping report. Does I am Sue slap? Yeah, he slaps. I was at the Embaradero one time, my friends, and uh RMU started shooting a music video. We we offered him to hit the bottle and he was like, \"Nah, no, on the job.\" He kept going to it. I was like, \"That's respectable man right there.\" Yeah. All right. All right. Cool. Kitchen sink guy gave a tip and said, \"Hey, Greg. I heard you're coming to Columbia, Missouri soon. I am a server at Stadium Grill, a sports bar near campus. It would be an honor to serve you if you stop by. We have wings. I'll see what I can do. It's a short trip. Thank you very much. I will try. We have wings. Dudes in Space are not dead, it turns out, after VidCon. They say, \"Dudes in Space successfully drove from LA to SF to LA without dying in a fiery auto accident. Our Wing Wings collab video will be dropping",
      "start": 2561.28
    },
    {
      "text": "space are not dead, it turns out, after VidCon. They say, \"Dudes in Space successfully drove from LA to SF to LA without dying in a fiery auto accident. Our Wing Wings collab video will be dropping tomorrow. Thanks for hanging out last week. It was my pleasure. Very excited to see this video. Everyone, go subscribe right now to Dudes in Space on YouTube so you don't miss it tomorrow.\" Uh, Dofpool gave a tip and said, \"Before Pride month ends, I wanted to ask your thoughts on the newer Midnighter runs and if you think Storm Watch has a future in DC or if they won't even pick up that ball enough to drop it. I don't know. I have no information on those things. Sorry. We're we I we've always when we were getting ready to do the comic book show, when we when we were talking about doing comic book show, I wanted the messaging to be very clear that we are people who enjoy comics. We are not invest like we are not like embedded in the world like I am with video games. So I'm unfamiliar with",
      "start": 2603.28
    },
    {
      "text": "book show, I wanted the messaging to be very clear that we are people who enjoy comics. We are not invest like we are not like embedded in the world like I am with video games. So I'm unfamiliar with Midnighter or Stormwatch stuff. It's DC stuff, but it sounds like it's not happening in Super Sons, so I wouldn't know about it too much. Dave 55 Dave 5005. Could I get a clip of you guys wishing happy birthday to my good buddy Nick? He loves you guys, especially Nick, unsurprisingly. Hey Nick, it's Greg and Tim from Kinda Funny. We wanted to wish you a happy birthday. Happy birthday. Hopefully, you're watching this live cuz I hear you're a big fan. So, if you're not watching this live right now, you're probably not that big of a fan. And then it makes me really angry. So, if your friend if your friend Dave breaks this out and gives you this video before you see it on Twitch, before you see it on YouTube, before you see it on a podcast, you're not that much of a fan, are you? You're a",
      "start": 2646.96
    },
    {
      "text": "your friend Dave breaks this out and gives you this video before you see it on Twitch, before you see it on YouTube, before you see it on a podcast, you're not that much of a fan, are you? You're a huge fan. You're a piece of **** huh? You're kind of a liar. Hope to see you soon. Hope to see you. Nice firm handshake. You want This is going to be you in the chair, and this is going to be me. God damn it. from behind that time. You won't even see it coming. Are you going to slightly kick over him? I'm going to kick him in the head. The back of his head. He's in the chair. Oh, he's in the chair. See, come sit in the chair and then get a back of the head. You won't be feeling too hot. That's true. You be laying there puking. I know. I got a really strong head. I might be able to. Alex, Alia, Alia, your comic discussion last week got me so interested that I went and bought an iPad to read comics. So far, I love it. I look forward to the book club. You guys rock. Thank you for being a",
      "start": 2687.84
    },
    {
      "text": "Alia, your comic discussion last week got me so interested that I went and bought an iPad to read comics. So far, I love it. I look forward to the book club. You guys rock. Thank you for being a part of this. We love talking. iPads are just comic readers and they are totally **** worth it just for that. I love it so damn much. This reading this yesterday first time I read a comic like an actual physical comic in probably seven years and it was weird. Didn't like it really. Yeah, I again nightlight. Good point. Good point. Yeah, it's a very good point. Uh NPC mate says, \"This one's for you, Tim. I just platinumed Amplitude.\" **** I had to cut the stream short due to the sheer joy. also the raging hard on. But anyway, I wonder what's your skill level? My skill level is extremely high, but I cannot platinum that game. Good lord, I tried. God damn. There's the the problem was so I I am so damn good at this game and I will destroy Andrea Renee. Whoa. She knows and she knows it a lot",
      "start": 2726.6
    },
    {
      "text": "but I cannot platinum that game. Good lord, I tried. God damn. There's the the problem was so I I am so damn good at this game and I will destroy Andrea Renee. Whoa. She knows and she knows it a lot of times. Um but my problem was that in order to unlock the hardest difficulty of songs, Yeah. you need to beat the campaign on the the difficulty less than that and like not **** up and have a certain score. And once I get to there's like a certain group of songs like three or four songs that I just can't get the **** right score to do it. And you have to do it in one run. And so that's like if you **** that up that's an hour and a half of your time every single time. Can't **** that up. Can't do that. Good job NPC mates. That is not an easy task. Final tip for right now because remember I now read tips and subs at the end of Kinda Funny Games Daily. Justin Ryan Bear says, \"Tim, it was a pleasure talking to you at 83. Never forget days without bongos.com.\" Hell yeah, man. Thank",
      "start": 2769.92
    },
    {
      "text": "I now read tips and subs at the end of Kinda Funny Games Daily. Justin Ryan Bear says, \"Tim, it was a pleasure talking to you at 83. Never forget days without bongos.com.\" Hell yeah, man. Thank you. There you go. Uh Tim, you want to jump in? Do the patented three and three. Let's do the patented three and three. The Morardi three and three. The first one comes once again from Titan Matrix. Hey boss, Titan Matrix is over here and he ain't doing his work. He is uh the man of the day it seems like. Uh, he says, \"Tim, where do we start with Transformers on IDW?\" I mean, there's a lot of good places to jump in. But if you just wanted to to get a real nice recommendation from me, I would say, uh, for just a nice six issue run, Megatron Origins is great. U, but if you're a bit more committed, I would say start with Transformers: More Than Meets the Eye and just read through that whole series. It'll it'll last about 50 issues and it's **** awesome. Um, I'm going to actually jump back",
      "start": 2819.04
    },
    {
      "text": "I would say start with Transformers: More Than Meets the Eye and just read through that whole series. It'll it'll last about 50 issues and it's **** awesome. Um, I'm going to actually jump back because we didn't do PS I Love This Best. Oh, right. Sorry. That's a new one for That's a new one for me. About to shut that out, guys. You what? No. Kevin was going to call it out, but you figured you got there before. You can go to kindafunny.com/bestfriend to nominate a best friend for doing something cool just like Robert did. Robert nominated Lyanna M. Breezy. Thank you, Lyanna, for bringing sex positive thoughts and opinions to the Kinda Funny Kind of Naughty page and being open to discuss sex and sexuality with anyone in the group. You're doing God's work. Thank you. Thank you very much. Remember, you can nominate your people kindafunny.com/bfriends and do it. Don't not do it. Yeah, do it. Yeah. Let's see. Um, abstract AB says, \"Having a dilemma. Have a bit of credit on my",
      "start": 2859.04
    },
    {
      "text": "much. Remember, you can nominate your people kindafunny.com/bfriends and do it. Don't not do it. Yeah, do it. Yeah. Let's see. Um, abstract AB says, \"Having a dilemma. Have a bit of credit on my phone account, but only enough to buy one comic series volume. I want to read Saga, but also want to get into Spider-Man due to the upcoming movie and game. Want to ask which Spider-Man stories are worth reading, but more importantly, which series should I go for?\" If I'm being honest, Saga is really good. Here's what I'll I'll Here's my counter argu. You're right. You're right. Here's how I'll play it because this is how I saw it today. I thought about playing it this way for the graphic novel required reading. Remember, required reading this month is or for next show, Paper Girls. I would say Saga is excellent, but Saga never ends. It's still going. You want to read it all the time. It's amazing. Here's what I'm going to propose. And I don't even Saga might actually be part of this. I say",
      "start": 2900.48
    },
    {
      "text": "Saga is excellent, but Saga never ends. It's still going. You want to read it all the time. It's amazing. Here's what I'm going to propose. And I don't even Saga might actually be part of this. I say get Comicsology Unlimited because I saw on the front page today I'm advertising Spider-Man Blue. Spider-Man Blue, one of my favorite Spider-Man stories. I love it. I loved it. You didn't think it was great? It's I mean I think it's a little overhyped because it's always on the best Spider-Man stories ever list and I'm like that just shows you how bad Spider-Man It's pretty It's pretty good. Oh, I know. I'm **** around, Kev. I love Spidey. I'm going to So, I would say do that. Let me jump in and look into seeing if the 999 Comicsology Unlimited would cover that there. Saga volume one because I'm pretty sure it does. I I think it goes up to volume three. I think I looked into it very recently. Buff arm says saga. He's the saga is so overrated. Tried the first volumes available on",
      "start": 2949.28
    },
    {
      "text": "because I'm pretty sure it does. I I think it goes up to volume three. I think I looked into it very recently. Buff arm says saga. He's the saga is so overrated. Tried the first volumes available on Comicsology Unlimited. So it is available. You're wrong about it being over. Actually, you know what? You're not wrong about it being overrated. I do I do I mean people talk about as if it's a 10 out of 10 masterpiece and I'd say it's a nine out of 10. Okay. Okay. It's really damn good, but it's not perfect. Deadly Class is the comic that I was hoping for. Uh, too bad you got **** on that one. Paper Girls won. **** you. I'm actually really excited to read a Paper Girl. Okay. All right. We're now in sub only chat. Sharon Betheia says, \"Sup boys. It's my 18th birthday and my dad won't let me tip. I just want to thank you all for getting me through high school. And can I get a birthday butthole?\" Happy birthday, butthole. Butthole. Sorry, Kev. You kept on your toes in that one. No. Yeah",
      "start": 2989.92
    },
    {
      "text": "tip. I just want to thank you all for getting me through high school. And can I get a birthday butthole?\" Happy birthday, butthole. Butthole. Sorry, Kev. You kept on your toes in that one. No. Yeah no worries. I think we recovered really well. We did something right. Uh, Cuthberg Cuthberg all good says, \"Comicsology is free the first month unlimited.\" Yeah. So, there you go. Do it. Great way to get get into comics and check out history as continues to spam this question. So, let's just get it out of the way. **** Jesus. Guys, what are your thoughts on American Airlines? It's one of the airlines if I were to go to PSX this year. It's fine. It's fine. It's better to use better than United. Yeah. I was saying Virgin is better. Oh, Virgin is the best, but I assume he can't do that. He already knows our stance on Virgin. JetBlue is okay. Okay. Yeah. Yeah. Yeah. One more. I'm trying to see. You're trying to find a good one. Yeah. The final final is unlimited $6 a month. That's a steal if",
      "start": 3031.28
    },
    {
      "text": "knows our stance on Virgin. JetBlue is okay. Okay. Yeah. Yeah. Yeah. One more. I'm trying to see. You're trying to find a good one. Yeah. The final final is unlimited $6 a month. That's a steal if it is. I thought it was 10. Flynn lives 899 says it'd be really nice if you guys picked required reading that is included in Comixology Unlimited. Just saying. Also unlimited is $6 not $9. We to be fair I will look into that and see if there's things that I recommend that that are on it. But like I don't want to be limited. I don't want to be limited by unlimited. Yeah. Also, support creators, support things. It's three bucks. Didn't I just say, right? $6.4. What is the Yeah. $4 for the first volume? You got $4. Don't **** buy a coffee today. $4 for the first volume of Paper Girls. Yes. $4. Remember I said $7.99 marked down to, I believe, $3.99. I never heard anything. Okay. All right. I thought that's what I said. I was looking for somebody to clarify. That sounds like new information",
      "start": 3072.56
    },
    {
      "text": "Remember I said $7.99 marked down to, I believe, $3.99. I never heard anything. Okay. All right. I thought that's what I said. I was looking for somebody to clarify. That sounds like new information to me. You know, it's not new for sure. Ladies and gentlemen, this has been the Kinda Funny Morning Show. Thank you very much for joining us on this beautiful day. We're about to read subs and tips. Nope, just the subs. Well, the subs and their messages. Subs and their messages. Yeah. Okay. You're going to you're going to read them. And then then Greg is going to do Kinda Funny Games Daily with Andrew Renee. It's going to be fun. And then after Kinda Funny Games Daily, they're going to continue reading subs and tips that were left during the show Daily. Hope you have a great time. See you soon.",
      "start": 3117.44
    }
  ]
}
