{
    "id": 2300,
    "video_id": "KmywLPnIrVc",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Super Mario Run Review and Too Many Open World Games - Kinda Funny Gamescast Ep. 102",
    "description": "We review Super Mario Run, questions if there are too many open world games, the quality of PlayStation Plus, and gaming in 2017.(Released to Patreon Supporters 01.06.16)\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1484316001,
    "duration": 4746,
    "transcript_chunks": [
        {
            "text": "Music What's up guys welcome to the first ever episode 102 of the kind of funny games cast and the first ever episode recorded in 2017 Wow as always I'm team Getty's joined by the coolest dudes in video games Colin Moriarty and Greg Miller How you guys doing good this real thank you this feels weird what doesn't being back to the table Yeah, talking to this level. You know, did you know that water will boil at 102 degrees? Oh shit This episode is about to get spicy They're hot I mean spicy got it. Well, I mean just water it's just hot water. I know I'd like to spice up your life That water will boil at that temperature because it's true. You know, it's true everybody I'm not saying it's the first point. It would boil at, but I'm seeing one or two that shit is popping Celsius just talking about Fahrenheit hundred two degrees, but it's up there. It's going no it's bubbling Have you ever find it funny that your blood is so close to boiling? That's what happens when you get a fever call",
            "start": 0.0
        },
        {
            "text": "about Fahrenheit hundred two degrees, but it's up there. It's going no it's bubbling Have you ever find it funny that your blood is so close to boiling? That's what happens when you get a fever call Normally you're at ninety eight degrees to school exactly got to send you back. How are you calling Madison? I'm fine. Thank you. I feel like we haven't spoken a long time. No, I'm good. I'm I'm rested and I'm ready to rare and ago. Can't you tell? Oh, I can tell Tell to because as the time this episode goes live Colin was right is now a show that exists publicly for the masses everybody Thank you. Very proud of our boy Call me doing God's work. It's been an adventure. You know when I was editing the first episode which is about switch I and how and why I'm positive about it and but three things that I think they need to Tackle including its lack of power, which I don't think is a problem and other things It's funny how I'm becoming more comfortable in Premiere and and yesterday I edited",
            "start": 60.56
        },
        {
            "text": "that I think they need to Tackle including its lack of power, which I don't think is a problem and other things It's funny how I'm becoming more comfortable in Premiere and and yesterday I edited the entire video yesterday from like right before dinner to like midnight because I was just bored and It's kind of nice to like find these problems and then I kind of just sit and stare at the screen for like half an Hour, then I actually fix them. Yeah, and they're not even and they're not even like major problems so for some reason everything was importing from old projects at 67% size and usually you can Hit like set the frame whatever and it were, you know scale the frame whatever and it works fine But it wasn't working and then I realized you just had to manually go in and fix the the ratio like the number your effect control and I was like Well, I don't understand that because that never happened to me before but it's it's like a it's a maddening kind of program But but it's nice to",
            "start": 110.08
        },
        {
            "text": "like the number your effect control and I was like Well, I don't understand that because that never happened to me before but it's it's like a it's a maddening kind of program But but it's nice to overcome those problems I'm actually quite proud of myself that I've learned it because it is a little daunting But I hope everyone likes the show and keep your feedback coming and we will we will tailor the show to you Yeah, so far so good people on patreon seem to have loved it Let us know what you think of this first episode There are many more to come as a weekly show every Thursday 9 a.m But this show is available early on patreon and patreon.com slash kind of funny games You can get it early every Friday or you can get it the next week late on youtube.com Slash kind of funny games people in the comments have been asking if you can get it early or late When do we get it on time? You can't that's the thing about this show This is weird. Well, no the day by day pop out topics. That would",
            "start": 151.84
        },
        {
            "text": "the comments have been asking if you can get it early or late When do we get it on time? You can't that's the thing about this show This is weird. Well, no the day by day pop out topics. That would be on time I guess that's true. And then because that's how it is. Yeah, we're like a fully functioning service here Yeah, you know it's like you want it and whatever you want. Here's my question for what? What is it? Have you ever had a fever so bad they put you in a tub of ice? Yeah, I've been in cold cold baths before the fever just like you got to work it out during the feet during the okay Okay, yeah never happened I always thought it would happen to me one day because I remember a girl in school this happened She was she had a fever so bad. She was hot as well, but she had a fever so bad They'd put her in a tub ice. Uh-huh. I was like, ah, this is a pretty rare normal occurrence I figured she came back she was ugly Weird things like that like the whole baking soda and like, you know",
            "start": 189.58
        },
        {
            "text": "They'd put her in a tub ice. Uh-huh. I was like, ah, this is a pretty rare normal occurrence I figured she came back she was ugly Weird things like that like the whole baking soda and like, you know tomato juice baths and all that shit like people baking So tomato juice, I don't know that one I mean, I know tomato juice if you got sprayed by a scum did weird shit with baking soda or parents did weird shit with Oatmeal after you have like poison oak what poison I have you have in all those things take boy You take oatmeal that's all the time. Did you get poison ivy? Okay, I was just like that was a weird column thing Games cast each and every week. We talk about video games all things you love about them and all that stuff It's been a while since we've been able to talk about video games together. What if we've been playing over the break? man Over the break did telltale The Walking Dead episodes one and two for season three spoiler free thoughts. I'm positive on it I talked a little",
            "start": 232.68
        },
        {
            "text": "together. What if we've been playing over the break? man Over the break did telltale The Walking Dead episodes one and two for season three spoiler free thoughts. I'm positive on it I talked a little bit on PSL of you so I won't go too much into it I'm excited to get to a point where we can't have spoiler talk about it I really I thought it was kind of lame when they announced that I didn't want to play as this new character I wanted to be Clem I actually really do like being this person because now the the you know The baggage of Clem is off me where I'm like, alright cool. No, this guy seems like a dick I'm making all these choices like based on what I actually I'm doing in that moment rather than well How does this affect this and wait? I've been doing this a long time and I don't want I'm just a little girl, too And how do I just play that game? It's interesting It's like a role-playing thing now where I'm playing a little bit differently because I am this guy and I'm like well",
            "start": 268.6
        },
        {
            "text": "I'm just a little girl, too And how do I just play that game? It's interesting It's like a role-playing thing now where I'm playing a little bit differently because I am this guy and I'm like well fuck you I don't care. I don't care that your family your dick, whatever In a really good cliffhanger for episode two. I did a lot of hue on the Vita It's a puzzle game we had over and you know what I mean? The one with the color base stuff really interesting really fun put a lot of time into it But I'm at the end now and now the puzzles are getting kind of like slam my head in the wall Maybe I was just tired on my flight, but I was like I might walk away from it now But I really enjoyed I do recommend it The other one I did was a shanti half genie hero. Oh really yeah Yeah, it came through and I was like all right cool anything we get Vita wise I put on my Vita and pop it in and this one I played for a while I was like oh man. This is actually good. I actually really enjoy this I'm excited",
            "start": 307.16
        },
        {
            "text": "I was like all right cool anything we get Vita wise I put on my Vita and pop it in and this one I played for a while I was like oh man. This is actually good. I actually really enjoy this I'm excited to play more of it when we go to Australia on my Vita Oh, we go there because I knew that I'll still have it around by then And then as a teaser for next week's games cast I think Playing Yakuza 0 right now in playing gravity rush 2 right now. I'll talk about you. They're awesome. What about you call I Towards the beginning of the vacation. I finally platinumed hitman go which is a fantastic game on Vita Really enjoyed that then platinum Lara Croft go on Vita, which is an abomination of a port but an amazing game I actually I actually didn't even think the game was nearly as good as hitman go But the Vita port sucks just absolute trash The load times are terrible the controls are terrible the frame rates terrible So I have a problem with what the control controls I mean I tweet about a",
            "start": 342.6
        },
        {
            "text": "go But the Vita port sucks just absolute trash The load times are terrible the controls are terrible the frame rates terrible So I have a problem with what the control controls I mean I tweet about a lot of people are having some more problems that the game is angled in such a way and the Nubs are so small that you know, the analog knobs are so small that things are like moving in weird ways I died a bunch of times Accidentally because of that and then you have to wait, you know, 30 fucking seconds for the game to load this very graphically intensive game Back onto the Vita. So that was really obnoxious, but I saw it through and platinum did for some reason anyway And then I spent the lion's share of my time Over vacation with Tomb Raider rise of the Tomb Raider. I spent about 30 hours probably a little bit more than that With it. I was really really really intensely into it when I got back from Mexico right before Christmas for about a week and So I'm beating yet. I'm kind of right",
            "start": 379.02
        },
        {
            "text": "a little bit more than that With it. I was really really really intensely into it when I got back from Mexico right before Christmas for about a week and So I'm beating yet. I'm kind of right at the very end and I've kind of backed off and I'm trying to collect everything I'd like the 100% the game. I think it's really fantastic last week we did our Or last episode I guess we we recorded for this We did the top ten games or individual games and I rise the two mayor would supplant something on that list for me I think it's really really really great And as I said on Twitter and on PS I love you It's best when it's not trying to be uncharted and I think that it does a lot of cool things that are not uncharted like even Though the game is very similar to uncharted very inspired by uncharted just like uncharted was very inspired by old Tomb Raider games So it's kind of like an endless cycle between those two franchises, but the one will they fuck already? Oh, I would like for them to have",
            "start": 419.74
        },
        {
            "text": "like uncharted was very inspired by old Tomb Raider games So it's kind of like an endless cycle between those two franchises, but the one will they fuck already? Oh, I would like for them to have sex But sure there's a porn parody out there but for me I think it's just I think it's the perfect size For a game. I think the maps are just big enough there's just enough to do in them the secret tombs are really cool and and To go through and and and I'm not very good at puzzles in games So I feel very rewarded when I figure one of these things out and it takes me some time because I'm a little stupid so So yeah, that's what I've been spending my most time with and then I booted up a couple other games But I did I booted up this game decks on Vita, but it wasn't really for me It's a side scrolling very Blade Runner like role-playing game ran like trash on Vita So I just deleted it and then I started playing Call of Duty Modern Warfare remastered and then just didn't feel like I was in the",
            "start": 459.3
        },
        {
            "text": "very Blade Runner like role-playing game ran like trash on Vita So I just deleted it and then I started playing Call of Duty Modern Warfare remastered and then just didn't feel like I was in the mood for a shooter because I between you know, I literally played Battlefield 1 Titanfall 2 and Call of Duty Infant warfare back to back to back. So I was I started playing and I was going through like the the intro sequence I hadn't played it in a long time and I was like, yeah, I just I'll come back to it. I'm sure it's very good. I heard Raven did a great job on it So that will go back to it the next game on the list is gonna be far cry primal I think I have Which I played for about 10 hours, maybe a little less when it came out, but that's the next game on the on the dock so what does that mean I don't care about and and Yakuza and Yakuza, I don't care about what does it mean that it's on the list? You know platinum it you're gonna beat it Well, I like to get through it. I was actually",
            "start": 497.76
        },
        {
            "text": "mean I don't care about and and Yakuza and Yakuza, I don't care about what does it mean that it's on the list? You know platinum it you're gonna beat it Well, I like to get through it. I was actually talking to Brian Altano not too long ago and he platinumed private cry primal and and He's not really one to platinum game So that's that showed me that he really enjoyed it and also that the platinum can't be that demanding because I don't think he wouldn't Necessarily go out of his way to do something like that. That's not the kind of gamer he is So that's how I spent my time a lot of gaming also a lot of TV show watching and reading so Tim what are you playing and shout out to man in the high game the game that I want to talk about is Super Mario Run. Oh See I was on a plane so I couldn't play it. Mmm. It's a sad thing. But you got you were playing it We're in a wait for zero one. Yeah. Yeah in there playing it I did that I did all the time ever in the theater playing it because it was",
            "start": 533.88
        },
        {
            "text": "it. Mmm. It's a sad thing. But you got you were playing it We're in a wait for zero one. Yeah. Yeah in there playing it I did that I did all the time ever in the theater playing it because it was like that was the weekend that it came out It was like the day wasn't it? That's why we're all playing. Oh Came out on a Thursday. That's what happened came out worldwide iOS devices and People seem to be really liking it the people that weren't gonna like in the first place don't and it does have issues But what are your kind of impressions of it as a game? I mean, I'm surprised as a game. It's fun It's not for me. Really. I played the the first, you know worlds. I bought I bought it right was like alright cool with like What we talked about and somebody who's doing and making a quality game deserves your money and I'll jump in and try it and spend my money and I did and I think I'm Halfway through the second world or whatever and it's just it does it's one of those were number one It just",
            "start": 570.16
        },
        {
            "text": "your money and I'll jump in and try it and spend my money and I did and I think I'm Halfway through the second world or whatever and it's just it does it's one of those were number one It just doesn't I'm like, okay cool Like this isn't the Mario I want and not nothing this isn't me knocking the game or setting up why I'm not into it Not the more I want and then just the fact of like, you know the pink coins This is in there going back and trying to collect that stuff just not for me though I think it does really cool stuff in terms of I like the I every time you know My only friend on there I fit you know I don't know if you ever accepted my friend requested Okay, then Jen's just way better than you at it because every time I go to a level Jen scores there was I think it's Really cool Like oh man, like there it is you chasing people and I see people tweeting back and forth about it And then going to get all the coins and doing all these different things. I like that It's got its",
            "start": 609.28
        },
        {
            "text": "Like oh man, like there it is you chasing people and I see people tweeting back and forth about it And then going to get all the coins and doing all these different things. I like that It's got its hooks in people But yeah, it's just like one of those things like alright cool Like this is fun and alright, you know, I as you get later it gets harder and there's more and more stuff going on there But it's just like alright cool. I'll wait for switch. Mm-hmm switches right around the corner. Oh, yeah, and I'll have my portal more Yeah, there you go Colin you played at all No, I haven't I can't even update my phone so yeah, I'm not able to tell on it the caveman iPhone 5s I've been updated in 18 months. So tell me enough room to update it. So tell me all about it. You've beaten it You're all in here. I haven't done all of the the different coin stuff yet I think I got all the pink coins, but I haven't got all the the black ones and there's another color But I didn't get those yet, but I",
            "start": 643.18
        },
        {
            "text": "in here. I haven't done all of the the different coin stuff yet I think I got all the pink coins, but I haven't got all the the black ones and there's another color But I didn't get those yet, but I did beat all the levels and it's well it to me It's like that. This is what a Mario game should be on on the Phone yeah, because I do think that when you start talking about like a classic Mario game It's like nobody wants that nobody that you need the tactile right? There's no real buttons. Yeah I've been saying this for a long time that this game Since it was announced looks like the Rayman jungle fever and jungle beat and Fiesta run or whatever games that came out years ago And those are amazing games. Those are some of my favorite mobile games of all time And I think it's because they didn't think about alright. How do we make a Rayman game on? The phone they were like, how do we make a fun? Mobile game that has Rayman as a character because the UB art engine is beautiful So it's like",
            "start": 674.76
        },
        {
            "text": "think about alright. How do we make a Rayman game on? The phone they were like, how do we make a fun? Mobile game that has Rayman as a character because the UB art engine is beautiful So it's like it didn't seeing it on screen this small. It really it's it's a sight to see really so That really impressed me and seeing Mario. I'm like, alright, it's flipping it from horizontal to vertical which means that you're not getting as much Landscape landscape and like seeing what's coming up which is totally different for Mario Okay, because you're used to seeing being able to see you know What what's the measure and dramatically changes it right before this I jumped into play a little bit more and it was that thing of like alright cool I'm dead Because I didn't know was coming and I get a little bit further and I died again and I get a little bit like on My last life I got there and then it was like the final almost I didn't realize it almost the final jump and I just Missed it and I could",
            "start": 714.9
        },
        {
            "text": "bit further and I died again and I get a little bit like on My last life I got there and then it was like the final almost I didn't realize it almost the final jump and I just Missed it and I could see the flagpole, but I was dead. And so yeah, so for me I When I first played it it felt weird because I was like this doesn't like Mario's so much more acrobatic than he Usually is just vaulting and though the way he's jumping some of the animations are like, holy shit Like in a lot of ways this is more advanced than 2d Mario games that we get but it's like it doesn't play more advanced But then as you keep going the after the first world, it really opens up in terms more complicated in terms of the level design and the the gimmicks that they they throw into Stop you like the pause and if you jump then you go the other way and all that type of stuff I think it's really good and it's classic Nintendo Mario design where it's like we're gonna introduce this thing You're gonna learn how to do",
            "start": 755.7
        },
        {
            "text": "jump then you go the other way and all that type of stuff I think it's really good and it's classic Nintendo Mario design where it's like we're gonna introduce this thing You're gonna learn how to do it and then we're gonna throw that with another challenge on top of it that's really gonna feel like there's a nice sense of Of a correction when it comes to the difficulty and the the sense of accomplishment that you have playing it And that's that was the thing with me and Super Mario run is that I played it You know when we were sitting there getting ready for row one or whatever and I enjoyed it enough But I was like, all right cool It's kind of basic and then playing even today playing through a little bit more to be just refreshed on this It's like all right. Yeah. Okay, the world's who's getting more difficult They're tossing different stuff in and I'm not trying to be the dead horse It's just like me I want a dumb decision to make it online only because I would play this on the",
            "start": 797.08
        },
        {
            "text": "getting more difficult They're tossing different stuff in and I'm not trying to be the dead horse It's just like me I want a dumb decision to make it online only because I would play this on the plane and that's the whole reason I didn't Play it is because I was in Canada for a week where I didn't you know, I was just hotspot to hotspot I didn't I couldn't connect all the time and screw around and so then to be on these planes like I was going New Orleans Going to Canada. I would have tried and done more and actually committed a bit more to it But then it didn't work so I went with you. Yeah, I mean I was kind of Being a little bit of an apologist for that About a month ago and when it was first announced and someone was like well a lot of you know Well games do that and so whatever just it is what it is when it comes to the triple-a space of mobile But now that I'm playing it as like I'm totally flippant on that. I agree with you where it's like it I don't understand why they made",
            "start": 832.42
        },
        {
            "text": "it is what it is when it comes to the triple-a space of mobile But now that I'm playing it as like I'm totally flippant on that. I agree with you where it's like it I don't understand why they made the decision Because it seems like it's entirely for all the the weird social. Yeah side of it in the mind that tendo stuff Seems like it'd be so easy to store. All right, cool I and next time I get online when I do land from a plane all my scores get uploaded and I can go back and I can see you or James. Yeah, they've done these levels like why make it so obtuse I just can't do it at all. And to me like it's that stuff is what I'm like Why does Nintendo insist on having this second part of the game all the time where it's like There's all this shit that nobody cares about like nobody cares about the building the kingdom because there's nothing that it does It doesn't add anything to anything just have some like sticker system where it's like trophies were like you did do different things",
            "start": 865.4
        },
        {
            "text": "the building the kingdom because there's nothing that it does It doesn't add anything to anything just have some like sticker system where it's like trophies were like you did do different things You get achievements. Is this the other pipe? I've only done the two or one. I don't know anything about building Yes, there's the tour which is the game and then there's like the toad rally thing Which is just like a stupid version of the game Where you like racing against a ghost essentially and then the Mushroom Kingdom builder I don't know what it's called where you gotcha kind of build your own Kingdom and it's like it's just so well We have a touchscreen. So what are we gonna put it? I remember it's like when a mario 64 Came out on the DS and then had all the minigames and it was just like why this is so unnecessary It's like make the damn game and I feel like it does a disservice to the game here because That is the reason that the stuff needs to be online and it's like well This is a",
            "start": 903.3
        },
        {
            "text": "why this is so unnecessary It's like make the damn game and I feel like it does a disservice to the game here because That is the reason that the stuff needs to be online and it's like well This is a game that's designed like many of the great mobile games whether it's things like jetpack joyride or pagal or The one with the water and the crocodile You know I'm talking about The down the drain out of water something like that. You guys don't talk about where it's mobile games have a system where it's like It's a challenge. You got to get through it, but you can three-star it. I mean the hitman goes similar It's like that sense of progression right and Mario has the two but instead of the the stars and level There's the different coins you can get the different routes you can get and I feel like that is awesome They did a great job with all that but then adding all this other stuff pulls that back from being perfect So it's like it's a good step in the right direction Does it need to",
            "start": 938.86
        },
        {
            "text": "like that is awesome They did a great job with all that but then adding all this other stuff pulls that back from being perfect So it's like it's a good step in the right direction Does it need to cost $10 compared to $3 absolutely not I think it's good that they charge that much. I think that It's not gonna hurt them in the long run I think that it's gonna Get more people to start thinking mobile games as real experiences Even if this game isn't worth more than Rayman Fiesta run sure and also for them to start building this Nintendo mobile portfolio Right so their next Nintendo game they can charge for they understand and people are like well There's quality and they're learning and they're doing this not to mention that I do feel like Super Mario run and I you would probably know better than me in terms of what they've talked about I feel like when we complain about this and talk about that. There's going to be updates to this I don't I don't think it's beyond the realm of",
            "start": 984.2
        },
        {
            "text": "better than me in terms of what they've talked about I feel like when we complain about this and talk about that. There's going to be updates to this I don't I don't think it's beyond the realm of possibility and probability that they're going to come on be like All right It's not online anymore We figure out a way for this not to happen and store your stats locally and then go and put it all up Crocodile game. Where's my water? This is just a crocodile now. He's just in a bathtub. He's doing some stuff What's he he should be concerned about the water. He needs that water Or angry birds any any of those those type of games because then there's those are the ones the mobile games that I see Standby and I think are great games Then there's the other side that are the cash cow ones that are the the free-to-play microtransaction bullshit ones that like give mobile games such a bad nature and Luckily Mario doesn't do that stuff But then it's funny because like so much of the criticism now",
            "start": 1023.58
        },
        {
            "text": "the the free-to-play microtransaction bullshit ones that like give mobile games such a bad nature and Luckily Mario doesn't do that stuff But then it's funny because like so much of the criticism now is that Mario run is not a major success Financially on so it's like well, it's because they didn't nickel and dime on this dumb bullshit, but it is a huge success Compared to the quality game so it's definitely success right at getting us hardcore people to actually care about a mobile game and pick it up and be at all interested in it you like this is one Of those ones where I can't remember the last Like I mean everyone was talking about this right and I guess Pokemon go would be the last time I saw our Influence our echo chamber our Twitter list be everybody talking about these coins and doing all these different things Brian I'll turn out so tweeting about like all around IGN that in the office that day all you heard was coin sound yeah I mean that's awesome And I think the other",
            "start": 1054.84
        },
        {
            "text": "doing all these different things Brian I'll turn out so tweeting about like all around IGN that in the office that day all you heard was coin sound yeah I mean that's awesome And I think the other side of that is that this is the type of game that's getting a lot of people That are familiar with Nintendo to actually play a Nintendo game. Mmm Gia played this shit She is still playing this shit, and it's weird. I'll just see her like sitting there playing I'm like this is super random, and I would have never expected it, but there's something about Mario That's like okay even though. It's the same game that we've already gotten a million times on mobile It's like now all of a sudden it makes sense because Mario That's one-handed so she can hold the glass of wine the other exactly exactly she's really good at it She's I mean actually it isn't a lie, but you could just laugh too. Why'd you do that? It's keeps it like she just like and I'm trying to tell her how to wall jump No, that's not",
            "start": 1097.94
        },
        {
            "text": "really good at it She's I mean actually it isn't a lie, but you could just laugh too. Why'd you do that? It's keeps it like she just like and I'm trying to tell her how to wall jump No, that's not going over a while. Lord fucking help me the girl cannot wall jump. I can just see that because she But so a big compliment I want to give the game is it reminds me a lot of Sonic 3 and Knuckles in the sense that it is very tier based because that there's so much verticality to it It really is kind of like Sonic 3 Knuckles or Star Fox 64 in the sense that there's the tiers of if you go high it's harder if you go mid it's Medium and if you go low it's easy and I think that there's a it's brilliant level design when you add the coins to kind of guide that and that path and to Be able to see like each level has three different levels in it Gotcha, you know in addition to the kind of challenges on top of it And would you say that this is them taking some moba influences because they have the",
            "start": 1130.18
        },
        {
            "text": "each level has three different levels in it Gotcha, you know in addition to the kind of challenges on top of it And would you say that this is them taking some moba influences because they have the lanes no versus Colin No, it's as an under an undefeated eSports champion. You got the three lanes there You got your three lanes at those lanes. There's no difficulty difference between between the lane really It's not the way it was explained to me when of course we were playing the best one ever Infinite crisis. I don't you know, I mean, I don't know Anyway, I like it a lot and another thing that I've been saying a lot is that my favorite games are platformers and rhythm games So there's something about this that kind of melds those two together Rhythm to it in a really cool way that I'm like, I'm totally down with and I feel like Rayman does a way better job Of it. Did you play ribbon origins and legends the one yeah the ones that came out consoles and Vida Vida we you yeah Yeah, yeah",
            "start": 1177.04
        },
        {
            "text": "I'm totally down with and I feel like Rayman does a way better job Of it. Did you play ribbon origins and legends the one yeah the ones that came out consoles and Vida Vida we you yeah Yeah, yeah Those are great games. Yes, so, you know the levels where there's the music playing you're kind of like yeah, whatever The Rayman mobile games were kind of inspired by that So it is just like very simple button presses, but it's like they add on to it and there's like this really nice growth of They eventually add a punch button so you can jump and punch and it just becomes this like rhythm platform thing And I feel like Mario kind of did a good job of taking that rhythm, but then also adding gameplay to it and having the The pause blocks and the going to different directions and stuff and really trying to think about stuff and adding a bunch of like nice fun like Throwbacks and stuff like when you go there's certain levels where if you cross the right side of the screen you work back to the",
            "start": 1217.02
        },
        {
            "text": "trying to think about stuff and adding a bunch of like nice fun like Throwbacks and stuff like when you go there's certain levels where if you cross the right side of the screen you work back to the left and reminds me of Super Mario 2 Like and or even the original Mario Bros and just older pac-man things like that So it's like there's a really good game design in this and it is really fun I just think that there's too much bloat and bullshit around it to like make it something that is Super incredible must have yeah, yeah, but it's is it worth $10. I Can't say yeah Once they add updates and stuff. Maybe I think that is this would have been an amazing $3 game It's a good $10 game gotcha. Yeah in terms of sales and shit, so We're gonna last journal Mario run had grossed 30 million in revenue since the 15th of December Evidently was downloaded 90 million times. They're only 3 million of those purchased the full game at $9.99 That's conversion rate of 3.4% a notable decrease is the",
            "start": 1260.78
        },
        {
            "text": "revenue since the 15th of December Evidently was downloaded 90 million times. They're only 3 million of those purchased the full game at $9.99 That's conversion rate of 3.4% a notable decrease is the game's launch day when roughly 10% of users were buying the full title These figures all pretty good are Nowhere close to breaking Pokemon goes record of earning 200 million in 32 days, but again different type of games catch up front Yeah, cast up front versus micro transaction shit So we'll see I'm interested in what they do next But I think that it's it was a very important and good move for them going into the switch to get Nintendo back in a positive light in people's minds like the mainstream people's minds and also now everyone has Nintendo accounts whether or not I'm complaining about it like millions of people have accounts that did trip for so Pretty cool once they see how easy it is that their Nintendo accounts link between all their systems and all their all their eShop games",
            "start": 1305.16
        },
        {
            "text": "it like millions of people have accounts that did trip for so Pretty cool once they see how easy it is that their Nintendo accounts link between all their systems and all their all their eShop games I hope I hope Don't fuck a switch. We got the switch announcement in eight days Which means I don't know when this goes live this goes live Monday, and you'll fly out when it's Thursday. Yeah, I'm fucking excited Yeah, are you fucking excited? Yeah? I'm very excited. It's gonna be super interested. Yeah, see ya. Can't wait. See if they fuck it up I don't think I don't think they're going to I don't think so either. I think I feel good I feel super good about it. Actually. They're making all the right moves Touch me in all the right place Do you think they come on the same day as Mass Effect are they gonna try to swerve around it? Does that matter anything? Where's that? Where's that off element? Yeah, if Mass Effect comes out the same day as switch that's bad for Mass Effect not switch The",
            "start": 1349.04
        },
        {
            "text": "they gonna try to swerve around it? Does that matter anything? Where's that? Where's that off element? Yeah, if Mass Effect comes out the same day as switch that's bad for Mass Effect not switch The the what if it's on switch though, huh? Yeah, I think Nintendo is making a lot of smart moves I was I was very heartened to see that 3% conversion rate simply because You know conventional wisdom on mobile says that Nintendo would have made more money as as we saw with Niantic and the Pokemon company With Pokemon go had they made it free to play And people were saying that it wasn't nearly this this meteoric success in the time given but I would argue that Pokemon go requires much More maintenance and upkeep. It's not I'm not saying Mario This new Mario game is is necessarily a static product, but it is not this Geolocated constantly adding new shit to it constantly having to deal with Server problems and people kind of coming on and all these kinds of things I would say that Nintendo is",
            "start": 1387.4
        },
        {
            "text": "but it is not this Geolocated constantly adding new shit to it constantly having to deal with Server problems and people kind of coming on and all these kinds of things I would say that Nintendo is probably very pleased with the amount of money They made the net profit that they made on the game and that everyone also forgets me Tomo and between these three games They're just experimenting with different things the mobile market as I've argued many times has really destroyed Expectations for what video games should cost and there are certain companies that are trying to buck that trend. I think We saw that a little bit with our friends at chair, but we saw that more notably I think with with Square Enix and now we're seeing with Nintendo where people are saying like well a premium game should be worth a Premium amount of money and my biggest takeaway was all the kind of gathered twit tweets and Facebook messages that people were circulating when the game came out about how people",
            "start": 1426.72
        },
        {
            "text": "should be worth a Premium amount of money and my biggest takeaway was all the kind of gathered twit tweets and Facebook messages that people were circulating when the game came out about how people couldn't believe that the game was $10 whatever and so you have to just Shake these people up and make them understand that the race to the bottom has been very destructive and that you cannot have games Of quality on a mobile platform for no money And so I think Nintendo is doing good work that is stewarding a new way to look at games on mobile platforms that will be at the to the benefit and help of other publishers and developers moving forward the more of them get they Get involved in the more of them that that dare charge more money and maybe eat a little bit of shit at the beginning in Order to set the new precedent for the ecosystem I think it's very positive and it's really cool that Nintendo is doing that and I wouldn't have expected a couple years ago The Nintendo would be the one",
            "start": 1464.0
        },
        {
            "text": "to set the new precedent for the ecosystem I think it's very positive and it's really cool that Nintendo is doing that and I wouldn't have expected a couple years ago The Nintendo would be the one like that the phalanx basically, you know, so Remember phalanx on Super Nintendo the game. Yeah had it was the it was the real person on the box, right? Yeah, the old guy yeah, yeah. Yeah. Yes. How can I forget that was that a Natsume game? Look that up for me won't you Kevin? Ph al an X on SNES. I want to say that was a Natsume game or maybe even an NX game Anx phalanx We're just gonna wait for Kevin to figure that out Kevin time don't worry Big Kev dog big Kev dog at sumer annex Because that's what made it even weirder yeah, oh no, it's not it's Kemco Yeah, this is a I I knew I knew that this was always one of these weird fucking companies Do you remember this Greg? Yeah. Yeah. I mean, I know the box are never played the game obviously to him and into Super Nintendo Remember the box are",
            "start": 1503.76
        },
        {
            "text": "was always one of these weird fucking companies Do you remember this Greg? Yeah. Yeah. I mean, I know the box are never played the game obviously to him and into Super Nintendo Remember the box are for sure. This is like one of those classic boxes As soon as you said they got the banjo, I knew you're talking. Yeah. All right second topic of the day Topic two comes from best friend out there mark Tremblay Hey mark, my says when will developers stop trying to mirror Grand Theft Auto now This topics piggybacking off of a Jim Sterling video the latest episode of the Jimquisition that went up big empty Sandboxes Colin watched it thought it was an interesting thing to discuss. I watched as well. Did you watch it? We all watch it at home. You should watch it very very informative video I thought he did a really good job with it. He's like what seven minutes long something like that. 13 minutes 13 minutes Well, wait, we'll wait 13 minutes for him Never been a Jimquisition. That's seven",
            "start": 1550.28
        },
        {
            "text": "he did a really good job with it. He's like what seven minutes long something like that. 13 minutes 13 minutes Well, wait, we'll wait 13 minutes for him Never been a Jimquisition. That's seven minutes long. I'm thinking of the way the column is, right His point was that there is a trend and this trends been going on a very long time of every game needing to be Open world and it's this race to have bigger and bigger and bigger maps But they have less and less and less things to do Really went in on Ubisoft because every Ubisoft game is Assassin's Creed in a different location at this point And I just kind of want to see what you guys think about this I Mean, it's a it's not it's a problem. It is a thing It's you know He brings up a lot of great examples when he talks about it in terms of What is going on with open worlds and what's going on in there? I think it's painted with a broad brush a little bit I think watch talks because the one that really strikes me that he brings up is side",
            "start": 1595.24
        },
        {
            "text": "is going on with open worlds and what's going on in there? I think it's painted with a broad brush a little bit I think watch talks because the one that really strikes me that he brings up is side quests He talks about the fact that I remember when side quests were side quests, but they sold storylines. Look at the Witcher He's like look at the Witcher. That's a real game with real side quests And I think there's plenty of them He you know He brings up infamous and how the original infamous was Alright climb up this building blow this shit off the side of it and then get to the top and you do that like 20 times and it's one of the knocks I had against even second son or whatever by the time you get the mashup of this awesome living breathing open world and then Having to go to where there's a giant camera and an arrow pointed down I think watch dogs to use a good example though their side quests were really good and their side quests were hey There's characters and there's things here",
            "start": 1639.34
        },
        {
            "text": "a giant camera and an arrow pointed down I think watch dogs to use a good example though their side quests were really good and their side quests were hey There's characters and there's things here It isn't just something to go do but it is a problem and it is an interesting thing but the fact of the matter is it's almost to an extent I think of It's where when Colin gets really riled up about telltale games and I start talking about well the problem You know that they're always the same there are just the same thing over and over again I'm like I understand that but it's like a network of television where I don't think most people watch every show on that network they are in picking and choosing so it's not as Obvious it isn't beating them over the head It isn't driving them crazy like it might drive someone in our industry crazy crazy of seeing Game of Thrones and fate Wolf among us and Walking Dead and Batman and Borderlands all these different things if you're just doing some of",
            "start": 1672.68
        },
        {
            "text": "it might drive someone in our industry crazy crazy of seeing Game of Thrones and fate Wolf among us and Walking Dead and Batman and Borderlands all these different things if you're just doing some of them I think it's similar here where I I play a lot of these open-world games. I love open-world games I don't I've never wanted to be like how big is the map tell me about like people flipped out when watch dogs 2 was Like oh, this is supposed to be San Francisco. I'm like who the fuck cares. It's fun It's it's a good representation boiled down video game version I think it is part of that though of the problem of stepping back and looking at the entire games industry But now thinking as a consumer who is only investing in a few of those worlds and I do I mean there is a huge point to it. I'm just like he brings up like one, but when was the last time? You had a side quest or a side story that really resonated with you And you were a member and he's talking about like Elder Scrolls and",
            "start": 1709.72
        },
        {
            "text": "just like he brings up like one, but when was the last time? You had a side quest or a side story that really resonated with you And you were a member and he's talking about like Elder Scrolls and infamous and just doing these same things over and over like that's a really Great point of I do remember there being games that I played where I did something on the side I was like man that was powerful I mean which is the example of it right that all the fucking which are side quests are super fleshed out and super amazing But it is interesting and where does that fall in that but if the consumer you know? He especially for giving Ubisoft so much in of the business in it talking about the fact of like they've openly said that that's what they're doing and this is where they're going they're doing that because Ubisoft is great at reading the tea leaves and saying we're gonna keep making Assassin's Creed until you stop buying Assassin's Creed Oh, you guys are stopped you've stopped buying",
            "start": 1746.38
        },
        {
            "text": "doing that because Ubisoft is great at reading the tea leaves and saying we're gonna keep making Assassin's Creed until you stop buying Assassin's Creed Oh, you guys are stopped you've stopped buying Assassin's Creed We're gonna give it a little bit of time and we'll come back But right now it is that thing of they're able to put out these games that satisfy Audiences for the most part watch dogs critically well-received not you know selling like hotcakes or anything And it's an interesting model for them to figure out But I think they're that's part of it is that I think you can look at Ubisoft as open-world churn They're putting out so many different things But I think they're putting out so many different things and not necessarily speaking to the same gamer every time I played Far Cry primal For a bit like all right cool. I'm done I'm not mad that Far Cry primal is open world Has a million different things going on and they're speaking another language And it is just go clear out",
            "start": 1777.62
        },
        {
            "text": "primal For a bit like all right cool. I'm done I'm not mad that Far Cry primal is open world Has a million different things going on and they're speaking another language And it is just go clear out this camp and take over this thing and do that thing I'm like all right It's not for me So I'm not mad that that's what that game is but I'm super stoked that Wildlands is similar to that of going and take this guy and do that thing yeah You know it for me goes way way back I mean Grand Theft Auto 3 is kind of the the originator of this in terms of That's what people would give credit for creating the whole sandbox genre right and that was such an amazing experience And then immediately everyone started copying that and I remember need for speed underground one I loved it the need for speed underground two came out It's like open world and it's like oh you can go explode city You have to go get your missions places, and I was like I don't like this like I don't want to do It's just like I",
            "start": 1807.42
        },
        {
            "text": "two came out It's like open world and it's like oh you can go explode city You have to go get your missions places, and I was like I don't like this like I don't want to do It's just like I just want to get to the race I don't want to have to drive to get to a race and you know that's great points super boring and not Not interesting at all, and I think things just kept going that direction I was just like I remember it was a point where I'm like man games Just going in a way that I don't like and I think things have just kept doing that I don't like open world games at all It's because they're way too big the only one recently that I've really fell in love with was Metal Gear Solid 5 Yeah, and I feel like that did a good job of rewarding me and even though I was doing the same thing over and over It was a good loop of adding different challenges and what I was doing was fun You know it's not just go to a tower and blow it up It's like there was always something about that I'm really",
            "start": 1847.98
        },
        {
            "text": "and over It was a good loop of adding different challenges and what I was doing was fun You know it's not just go to a tower and blow it up It's like there was always something about that I'm really invested in this even if it wasn't for story reasons But I think that is my biggest problem is like so many people gave Final Fantasy 13 shit for being too linear I'd liked the linearity of it. I didn't like the story of it if it was linear story. That was awesome Then I would have been totally in like I don't like just having this world like Final Fantasy 15 Does have a lot of side quests that are awesome, and I'm like man You did a great job, and that has so much that I'm like feed the cat This is weird and distracting from the what's supposed to be a story yeah No, yeah, I think you I mean you bring up a great point there And I think it is you know that we have only ourselves to blame where we were all complacent as I think the word Linear became a negative you said you say in a review",
            "start": 1880.06
        },
        {
            "text": "you bring up a great point there And I think it is you know that we have only ourselves to blame where we were all complacent as I think the word Linear became a negative you said you say in a review this game is linear I remember how many times in my closing comments or the breakdown box at old-school IGN of being like stories alright But it's soup the game super linear, and it became that that was the trigger word for being uncharted is a super linear game But it's awesome because the story is awesome, and you're you're going and Jim brings that up in his video right and the fact of like Linearity is fine if you're telling an awesome story, and I think he breaks up a great example of where he's like You know I've shit on the Elder Scrolls, but how many times? I'm sorry. I praise all the scrolls, but to get bring it down like it's always weird that it's the end of the world Everything's about to end But I'll go do this weird side quest and find these chickens or do whatever the hell",
            "start": 1927.48
        },
        {
            "text": "scrolls, but to get bring it down like it's always weird that it's the end of the world Everything's about to end But I'll go do this weird side quest and find these chickens or do whatever the hell it is and like there is that point to it of like Where do you draw the line between? Suspension of disbelief or wanting just to be linear wanted to be I mean the rate the driving games are a great example of that Of where it was like you know the original drivers or whatever where it was just go you're doing your mission I cool Here's a cutscene or just a text on a screen to get you to your next thing of this is what you're doing here And it wasn't the bullshit of like all right. I'll drive over there. See what's happening Yeah, it's weird like filler, and I think that Grand Theft Auto actually did a really good job I forgot which one they added this in but when they added the the taxi cab so that you can kind of like fast travel Fast travel it's like this is genius. You're cutting out the",
            "start": 1963.08
        },
        {
            "text": "did a really good job I forgot which one they added this in but when they added the the taxi cab so that you can kind of like fast travel Fast travel it's like this is genius. You're cutting out the bullshit. You're letting me play this open-world game in a linear fashion That's awesome I feel like it's the when people do the opposite things like taking the linear game and spreading it out so much where I'm like Ah man like I don't I don't want to play a game for 20 hours that I could have played for three hours and had a Better experience sure and that's in this is walking a fine line, but I know the best friends follow me on everything Not talking about you kuzu zero talking about the Yakuza's I reviewed for IGN You know three and four and that zombie one or whatever it was that was always my the thing about it Where you'd watch a trailer for Yakuza? And it would make such a big deal out of baseball and hostess clubs and all this different stuff And then when I'd review them the",
            "start": 1993.36
        },
        {
            "text": "always my the thing about it Where you'd watch a trailer for Yakuza? And it would make such a big deal out of baseball and hostess clubs and all this different stuff And then when I'd review them the story would be over so quick And I'd be like what the fuck that stuff was all just Tacked on rooms to go into in the in your you know your red light district of running over and going to that But there was you never got Motivated to go do it it wasn't like here's why you should be doing this unless you're trying to be a completionist and get all The trophies or do whatever and so you could just run through those games and never even know that existed Which I always found was super weird of like well why even bother putting it in there? Why have me wander around why not just jump me to the next thing? I think a lot of that goes back to the the early Grand Theft Auto 3 world games because the they had that sense of like It wasn't what can I do? It's what can't I do? Yeah, you know you can't",
            "start": 2033.54
        },
        {
            "text": "thing? I think a lot of that goes back to the the early Grand Theft Auto 3 world games because the they had that sense of like It wasn't what can I do? It's what can't I do? Yeah, you know you can't push the limits of like wait a minute I could be a taxi driver or wait a minute. I can deliver pizzas, and it's like it was kind of just Like fun and novel that you could like not go out and shoot the hook. Oh sure yeah You could be the cop you could be the cop you could just go do Sweet jumps and like however you wanted to play the game that was the fun of it But then as we kind of like the novelty of that wore off. It was like all right well You know now we're just gonna have a million collectibles even brings up in his video about the hidden packages in Grand Theft Auto Those are great. We don't need and he showed the map of like some use off the screen yeah Yeah, so much shit. I'm like holy crap like it looked. I thought it was a joke I thought that I was like a fake image. He made him",
            "start": 2067.98
        },
        {
            "text": "need and he showed the map of like some use off the screen yeah Yeah, so much shit. I'm like holy crap like it looked. I thought it was a joke I thought that I was like a fake image. He made him like oh damn. This is real Yeah, but then let's see that's the thing where I I don't waver on it. It's a great point look at all this nonsense in there right, but there's Something to it in the fact that you know I I got the platinum in Assassin's Creed 2 and I loved it or whatever and Then as he further Assassin's Creed went on I didn't need to go get every feather And I didn't you know I didn't need to chase down the pirate shanties or whatever in Assassin's Creed Black Flag But then wash dogs came around and I was like I enjoy this gameplay in this world so much that yeah I want to do all that I think it is that Argument of you can ignore all that if you want and not have to exist in that longer and not have to do it and get Like you know the first open world as a game like watch dogs is if",
            "start": 2110.18
        },
        {
            "text": "think it is that Argument of you can ignore all that if you want and not have to exist in that longer and not have to do it and get Like you know the first open world as a game like watch dogs is if I want to just do story mission after story mission And keep that narrative going of Marcus's journey I can do that and not worry about going off on this side quest or doing the driver missions But when I go do the driver missions I Like because they have like you know the uber app in there that you can drive for Every one of those uber apps has a little story I'm trying to get this guy to his delivery this woman needs to get the beach for whatever the fucker reason was I forget a Barbecue or something but they've gone far enough to record dialogue and give you a little blurb and explain What's this guy? You know as a movie star? You're trying to like okay cool You're not just telling me to go take guy X. It's not like a shitty crazy taxi You're going far enough to say here's something",
            "start": 2146.54
        },
        {
            "text": "this guy? You know as a movie star? You're trying to like okay cool You're not just telling me to go take guy X. It's not like a shitty crazy taxi You're going far enough to say here's something happened. Don't hate on crazy tax. They fucking I love crazy taxi I would die for another great crazy taxi. Mm-hmm. So I think that what you're saying has a lot to do with just the world itself and how interesting it is to you and I think that Back when with Grand Theft Auto that was like, oh, this is New York and it was still like a Disneyland version of New York Yeah, I feel like as games got bigger and bigger It's like if you're not invested in the world that you're in then you just you don't care I think motor solid 5 is an example of that where my I call I'm just in the desert I can't tell this from that like it is just a desert. Yeah But then playing watchdogs, it's like there is that sense of familiar familiarity to where I'm like, oh man I'm interested in this and I like it because",
            "start": 2183.32
        },
        {
            "text": "this from that like it is just a desert. Yeah But then playing watchdogs, it's like there is that sense of familiar familiarity to where I'm like, oh man I'm interested in this and I like it because they did a good job Making a micro version of what San Francisco is but on a huge level, you know It's like the Tony Hawk's Pro Skater games did a good job of making a super Disneyland version where it's just like here's the highlights San Francisco or Chicago or you know, wherever the hell that they are but It's when you're playing the these games that are in like fake worlds or whatever. They need to really be Flushed out worlds that matter to you or else. Why would you care? You know, and I think that like GTA 5 playing Through but going through San Andreas. It's like On spine just like how detailed everything is how much is going on and it's a little daunting to where it's like I don't want to do all this stuff. I don't got time But you didn't have to I know and that's the beauty of",
            "start": 2222.16
        },
        {
            "text": "detailed everything is how much is going on and it's a little daunting to where it's like I don't want to do all this stuff. I don't got time But you didn't have to I know and that's the beauty of video games. What do you think all I have a lot of thoughts on this because Open worlds are old In gaming and I felt like even I mean Zelda's open world game Metroid is a partitioned open world game You know Zelda 2 Castlevania 2 I mean these are open world games Just from another era and what I wonder about like Grand Theft Auto 3 being and I agree with you was really the one 2001 when everyone was like this is what we want to do, but I still felt like there was a restraint shown there I don't feel like I don't there were a lot of open world games on ps2 But they were not to the extent where I feel like maybe because the middle ground has eroded or whatever But that I didn't seem like everywhere you look there was an open world game like everywhere I mean, maybe I'm just miss miss",
            "start": 2264.7
        },
        {
            "text": "where I feel like maybe because the middle ground has eroded or whatever But that I didn't seem like everywhere you look there was an open world game like everywhere I mean, maybe I'm just miss miss understand, you know or miss remembering that the ps2 era but I don't think so Like there were open world games and there were a lot of copies of what Grand Theft Auto did like very literally I mean the Godfather and that Scarface game and all this random ass shit, but I Feel like we've gotten it's like through the looking-glass now where the the amount of open worlds in gaming today really does remind you that video the video game industry is a business and that these people the bean counters and the and the heads of these publishers and the heads of the developers are looking at these games and seeing That are doing really well and are saying like well we can do something like this, too And I actually think it really started with Grand Theft Auto 4 and I really could start with Fallout 3",
            "start": 2309.2
        },
        {
            "text": "seeing That are doing really well and are saying like well we can do something like this, too And I actually think it really started with Grand Theft Auto 4 and I really could start with Fallout 3 I think those were the two games where and maybe even oblivion you might even say oblivion and and Grand Theft Auto 4 in that order and At that point when you when you make an open world game when you make a big game It takes time to take three years the minimum four years five years And so yeah fought for three comes out in 2008 your game enters production 2009. You're looking at 2013 Maybe when your game comes out 2014 It's a reaction to a to a trend in gaming that then has kind of just fed itself and I have no problem with open worlds I think open worlds are interesting and they can be fun and they can be dynamic, but I do have a problem with Open worlds for the sake of being open world and I have a problem with we also talk about the order 1886 is a game we criticize a game very linear",
            "start": 2344.46
        },
        {
            "text": "they can be dynamic, but I do have a problem with Open worlds for the sake of being open world and I have a problem with we also talk about the order 1886 is a game we criticize a game very linear game But we criticize it rightfully so in the fact that I think ready at dawn focused too much on the engine So that when it was time to make the game, they really didn't make a game They had a very beautiful high fidelity engine with a five-hour campaign That was like really a throwaway kind of thing and I'm starting to feel that way with the open worlds I'm encountering to a great example of that is mafia 3 mafia 3 is a massive Interesting world that is empty and devoid of any reason for you to explore because they spent so much time Clearly making the world that they did not spend any time Populating it and I saw was Patrick Kleppich or Jason Schreier one of those guys saying like this was a game that needed a year More time because they just if there's nothing here to do and so I played",
            "start": 2388.34
        },
        {
            "text": "it and I saw was Patrick Kleppich or Jason Schreier one of those guys saying like this was a game that needed a year More time because they just if there's nothing here to do and so I played mafia 3 Extensively for like almost 30 hours and I I couldn't play it anymore. So I'm like, this is so redundant and fucking boring You know, it's just boring if there's one if there's one word for that and that that game It's boring what I've really become interested in in years past really since ps4 launched Is the idea of partitioned open worlds and what I mean by that is The one that comes to mind originally and I know this game isn't popular with a lot of people But I really liked it a lot was Killzone Shadowfall Which is a ps4 launch game a shooter Killzone used to be a very gray and drab Quarter type round shooter and I thought Killzone was wildly overrated on ps3 and and and on ps2 I think the fucking one ps2 is terrible But the Killzone Shadowfall and mercenary 2 in its own way on Vita",
            "start": 2428.74
        },
        {
            "text": "type round shooter and I thought Killzone was wildly overrated on ps3 and and and on ps2 I think the fucking one ps2 is terrible But the Killzone Shadowfall and mercenary 2 in its own way on Vita They explored different ideas not only different color palettes They made the game more visually appealing but the idea that this game takes place in a certain order and spring when a story The map isn't as wide open as something in Fallout But you can do things in different ways and there's a little bit of a way to explore I'm brought to that forest level in the beginning of Killzone Shadowfall where it's like There's like four or five different things on this map. You can do whatever you want. You have a little bit of space It's probably a couple miles maybe in the game It's not this massive thing They're not trying to get you lost and trying to tell you like you have a little bit of choice here It reminds me a little bit about Far Cry 3 and Far Cry 4 and Far Cry primals Fortresses where",
            "start": 2469.72
        },
        {
            "text": "thing They're not trying to get you lost and trying to tell you like you have a little bit of choice here It reminds me a little bit about Far Cry 3 and Far Cry 4 and Far Cry primals Fortresses where you're trying to like kind of get in them you can kind of approach them in different ways that the end result is The same but it's like how you did it That's what's fun And then you see that kind of stuff in Mass Effect and you see that kind of stuff Call of Duty Infinite Warfare that was really cool because what I called it was a pseudo open world with a with a Solar system map where you're doing things in different order and you can kind of go about maps in kind of certain ways But it's basically bringing one a story is very linear and so I think marrying the two ideas is actually gonna be the salvation of it because For every Witcher 3 and I agree Witcher 3 and I think dying lights another example of these beautiful Vast open worlds that are not only full of interesting things to do",
            "start": 2507.66
        },
        {
            "text": "the salvation of it because For every Witcher 3 and I agree Witcher 3 and I think dying lights another example of these beautiful Vast open worlds that are not only full of interesting things to do and interesting people interesting side quests and some sort of purpose But there's a lot of environmental storytelling. There's a lot of Witcher 3 is really a great example in My mind of You know, I walked through that world and I'm like wow like a battle happened here. There's nothing even happening here But there's bodies of horse Corpses and staffs in the ground weapons shroom everywhere and you just kind of walk through like they don't they're not even trying to make a quest here they were literally you're literally just walking through this portion of the map and it tells you a story itself because CD Projekt had the unique Aspect that's lost in gaming right now and publishing and developing which is time And if you're gonna make an open world you need time you need to massage things",
            "start": 2536.68
        },
        {
            "text": "because CD Projekt had the unique Aspect that's lost in gaming right now and publishing and developing which is time And if you're gonna make an open world you need time you need to massage things which was why I'm so confident that cyberpunk Is gonna be such a great game when they finally get around to releasing it but for every one of those games for every one of those dying lights for every unique open world like Mad Max, which I think was beautiful and haunting in its Vacantness, which I think was intentional you have games like mafia and you have these other open worlds that are just not interesting and not intriguing and so I think I'm with Jim where I get a little bit I get a little bit of a Drop in my stomach when I see Ubisoft basically making an open world out of everything We were even kidding around about how like steep in its own ways a strange kind of like open world open map kind of game and I'm like not everything needs to be this way and Unfortunately, there's a",
            "start": 2572.38
        },
        {
            "text": "We were even kidding around about how like steep in its own ways a strange kind of like open world open map kind of game and I'm like not everything needs to be this way and Unfortunately, there's a rubber band effect with everything in any market and the gaming industry Especially this is gonna blow up on itself spectacularly people are starting to finally realize that they miss Linearity and that like there's a place for it that some of the great games of all time like Super Mario World It's nonlinear in that like sometimes you can go to this stage or this stage Sometimes you go to the star world to find a secret exit, but it's like point a to point B And that's fun. And that's what we like, too So I guess what I'm saying is there's a place for the the witchers and there's a place for the dying lights But we have too many of them and there's a stark comparison between the ones that are done Right and the ones that are done wrong. Yeah, the one that are done, right? I think and from",
            "start": 2610.82
        },
        {
            "text": "dying lights But we have too many of them and there's a stark comparison between the ones that are done Right and the ones that are done wrong. Yeah, the one that are done, right? I think and from based jumping off of what you're talking about exists in two different planes if they do it, right? It's the storytelling aspect of it. All right, great. There's this there's I'm into this thing I like it, but then that's what you're talking about because Jim, you know Brings up the far cry of taking over another village doing all the stuff as a negative But it is and I can't find it. I can't remember maybe one of you do I remember talking about the story on calling Greg live within the last three months of I think it was Ubisoft talking about how basically the water cooler moments of the fact That yeah, you're taking on another fucking village or whatever but like Metal Gear like, you know When I hack something in Watch Dogs, right going to fight somebody else It's about how I did it and me",
            "start": 2644.46
        },
        {
            "text": "yeah, you're taking on another fucking village or whatever but like Metal Gear like, you know When I hack something in Watch Dogs, right going to fight somebody else It's about how I did it and me making my own narrative out of that and the narrative there not being how great the story Is or like because you brought a fall three I fucking remember going underneath the fucking White House right and finding the president who thought or the robot I thought he was Jefferson and I'm like what a fucking amazing side quest that was suddenly then that's the narrative there whereas over here the narrative is how the gameplay melds with the world and I make my own thing Of alright that I'm gonna knock all these guys out when he gets distracted. I go do that Exactly, right, but I'd argue that the I'd argue that what you're talking about the more like water cooler moments that they would call I don't think anyone's like gathering around a water cooler office talking about how they beat a far cry",
            "start": 2679.26
        },
        {
            "text": "argue that what you're talking about the more like water cooler moments that they would call I don't think anyone's like gathering around a water cooler office talking about how they beat a far cry That's why it's not what they called it. I'm just trying to break it down what we can all understand like to me. It's like That's a femoral like that's not meaningful. Like I like that kind of time. I fucking love far cry and Because that's a certain itch that's being scratched. And I also think far cry has a powerful narrative I think that there's an interesting story there to be had as well and the world's are the right size and the gun plays so Good, and so that's a unique kind of game but to me I feel as if there's gonna be There's something more special when there's something more deliberate done and and and the deliberate nature of storytelling is just more powerful than the well the just cause kind of like fucking wreak havoc and I'm like I know and fucking cares about just cause",
            "start": 2713.3
        },
        {
            "text": "done and and and the deliberate nature of storytelling is just more powerful than the well the just cause kind of like fucking wreak havoc and I'm like I know and fucking cares about just cause three and that's why and that's why people talk about you know, the Witcher You know, I'm not I'm not I'm not arguing at all But I think that they're both fun at the end of the day Which is the issue where it is like what we're talking about a just cause I played and I stopped effort like not even an Hour, I know Kevin put a gajillion hours into it because click for him didn't click for me Didn't do any story missions. You just did crazy crap I think that's the thing is I'm with you that there's going to be fun that resonates and we talked about and I talked about This Jefferson thing but then there are gonna be the thing where in the moment like there is that far cry Let's play I did for three or four with Brian Altano back at IGN Where we do went in in like that fucking tiger raced out at us,",
            "start": 2748.52
        },
        {
            "text": "are gonna be the thing where in the moment like there is that far cry Let's play I did for three or four with Brian Altano back at IGN Where we do went in in like that fucking tiger raced out at us, but I already thrown a grenade I'm like, oh fuck and I tried to blow but it blows up and he tumbles back and like that's a moment I was like, holy shit, that's awesome in those games. Those games are littered with those moments And yeah, I don't bring them up as much as I bring up gone home or as much as I bring up You know infamous historian Trish and all this different stuff like there's a difference there But I do think that they're both fun and that's the interesting what kind of fun you want to have I just think there's a danger in Uniformity and I think that's what we're seeing we were seeing we were just talking about with mobile gaming There was a danger in the uniform nature of the race to the bottom the uniformity of the way you extract money from a consumer The uniform nature of",
            "start": 2784.4
        },
        {
            "text": "we were just talking about with mobile gaming There was a danger in the uniform nature of the race to the bottom the uniformity of the way you extract money from a consumer The uniform nature of of the micro transaction it goes beyond the way games made it goes to the way we interact with the game and I think uniformity in genres and uniformity in in in Presentation is super destructive and fucking boring, you know, and that's and I think so I think that my hope is that people are seeing The benefits of open worlds the fact that there could be vast Massive nonlinear open worlds and there's a place for those but that's not all we need You're not wrong and unlike the ps2 era when I felt like that Well, there was just way too there was actually just way more games on ps2 than there are now But but so there's that as well But unlike that moment where I felt like even the open worlds that word somehow good or the nonlinear games that were somehow interesting they were kind of few and far",
            "start": 2816.44
        },
        {
            "text": "But but so there's that as well But unlike that moment where I felt like even the open worlds that word somehow good or the nonlinear games that were somehow interesting they were kind of few and far between I Hope that the glut of games and and the fact that these games aren't performing very well a lot of them will make Publishers open their eyes to the fact that yes, there's something special about your open world game But give it to us every few years. We don't need it every year, you know, you're right You're right on the money there and and and I think that that's exciting like we're talking about Final Fantasy 13 might be a place in time kind of thing because 13 came out at a time when the Zeitgeist was all about open worlds to a degree that I think is even Outpaced right now because now we have the indie revolution and more mobile gaming and stuff like that where people had a visceral including me a visceral reaction Final Fantasy 13 not only because Final Fantasy had a",
            "start": 2856.06
        },
        {
            "text": "because now we have the indie revolution and more mobile gaming and stuff like that where people had a visceral including me a visceral reaction Final Fantasy 13 not only because Final Fantasy had a heritage of being nonlinear and open world as most role-playing games are in their own way, but because We of the other games were playing that that that that often paint the way you look at everything else that's going on around you You know, I think an interesting thing with that is back in maybe decade and a half ago RPGs Size in hours was all they ever talked about like you'd read through GM and it's like this game is a hundred hours long This game is 150 hours long. This game is endless Like that was kind of the selling point now it in the last five ten years has been how big is the map? How big is Red Dead's map compared to the last run dead? How big is it compared to San Andreas how big whatever and it just keeps going like that? and I think it's interesting to think about how We",
            "start": 2889.76
        },
        {
            "text": "How big is Red Dead's map compared to the last run dead? How big is it compared to San Andreas how big whatever and it just keeps going like that? and I think it's interesting to think about how We went from RPGs being the how long is it to now every game having RPG elements? I think it kind of the size exploded and then just RPG Isn't really I mean it's a thing but like it's kind of hard to name an RPG now. That's just an RPG It's easier to name games with RPG elements. I think that with open-world games. It's getting harder and harder to name Oh, this is an open-world game. It's more Oh this every game has elements of open-world and I think that in the next three years We're gonna get to a point where it's much more so that I can current I hope so I mean that we've talked about rise of the Tomb Raider before which I think is a great example of what I'm looking for It felt manageable because of its partition nature and there are deep systems and meta games in the in the in the game",
            "start": 2930.16
        },
        {
            "text": "the Tomb Raider before which I think is a great example of what I'm looking for It felt manageable because of its partition nature and there are deep systems and meta games in the in the in the game Which I think are awesome. You're learning languages and you're and you're discovering relics and reading documents and and you know going through tombs and And what I think it's really interesting but it all felt manageable Like I think rise of the Tomb Raider Represents to me the perfect presentation of a game in the perfect size of a game and maybe it's a reaction But I'm 32 years old like and we're all getting older I don't fucking time to spend 50 hours with the game anywhere I have no desire to do that like like there might be a game or two a year at most where I'm gonna be like I'm really gonna sink like an infinite amount of time and it's to see it all the way through into the Right and to the great. It's like there's other things people want to do and and I agree with you the the",
            "start": 2968.8
        },
        {
            "text": "gonna sink like an infinite amount of time and it's to see it all the way through into the Right and to the great. It's like there's other things people want to do and and I agree with you the the it has segued from hours to to size even though they're kind of Indistinct with each other and I and I used to fall victim to that often as a camera I'm falling victim. That's what I liked as a kid I felt like I was you know, when I picked up xeno gears when I picked up You know, whatever it is Threads of fate or whatever the fuck it is on ps1 It's like well you want to know how big these games are because they're expensive when you're a child and you want to spend time With them and then you get that overwhelming sadness when the game's over because you spend so much time with it as well but as I've gotten older and I think a lot of our reader or our viewers can and listeners can agree is I Would rather a tight eight or ten hour campaign any day of the week now like a game that I can really",
            "start": 3003.84
        },
        {
            "text": "I've gotten older and I think a lot of our reader or our viewers can and listeners can agree is I Would rather a tight eight or ten hour campaign any day of the week now like a game that I can really experience and see all of as opposed to having to wade through all the bullshit like I tried to do with mafia 3 just to see what the game had to Offer because there's it's just fucking boring. That's why That's why Virginia resonated with me much more than Than mafia 3 they both told compelling stories. It's just that Virginia cut the shit, you know, and There's something to be said about that and I wish that there was a rubber band effect in that way, too We see it a lot still this visceral three fourths home is only 45 minutes, but three fourths home is fucking awesome you know and and That's that doesn't mean that the 50-hour epic can't exist alongside it I just don't want us to have a very whitewashed kind of like Single-minded kind of industry that we're seeing or seeing that in a",
            "start": 3035.92
        },
        {
            "text": "that doesn't mean that the 50-hour epic can't exist alongside it I just don't want us to have a very whitewashed kind of like Single-minded kind of industry that we're seeing or seeing that in a lot of different ways and and And it distresses me which is why I'm so I'm still continue to be excited about more independent games because they're well That's the point right and that's what you're talking about I mean when you talk about the video games as a business you do talk about triple-a game development in the fact of they Have to be thinking four years out. So they have to make decisions based on the fact It's why everything for a while is going with the MOBA It's got MOBA tendencies MOBA influences and then as we all soured on that so quickly people battle-borne starts dialing it back No, that's not a mobile. It's not a mobile but free to play You know I mean lawbreakers isn't free to play anymore. Jaffe's game isn't free to play. They see what's happening with it and you'll",
            "start": 3075.6
        },
        {
            "text": "back No, that's not a mobile. It's not a mobile but free to play You know I mean lawbreakers isn't free to play anymore. Jaffe's game isn't free to play. They see what's happening with it and you'll continue to see that, but it will be the independent games that are the ones that I think that are continuing to deliver that all right cool. We are a linear experience. This is that we are three-fourths home and you play through it this way and maybe make a couple different choices, but you get there in the end and that's the point and that's why the ecosystem is good, but I do think it's something that what you're talking about before where with the middle ground middling seven point, oh games falling away and they're not being that you know double a single a Game development anymore. That's why it's so much more obvious. I think the culture and see them and start getting tired of them It's just like imagine walking into a bookstore and all you saw was George Martin books. It's like",
            "start": 3102.42
        },
        {
            "text": "why it's so much more obvious. I think the culture and see them and start getting tired of them It's just like imagine walking into a bookstore and all you saw was George Martin books. It's like fuck, you know Like there's a place for you George Martin. There's a place for your epics and your fucking rambling nonsense Are you talking about George railroad Martin George railroad? But there's also a place for our L style. There's a place for our L side. Give me some goosebumps There's a place for poetry and there's a place for novellas and there's a place so like we should embrace that kind of diversity and gamers shouldn't necessarily tether themselves to just one or two genres that that elongate their experiences in order to have this arbitrary thing of like bang for your buck or whatever when like the bang for your Buck might have been in that novella that you could have read overnight or that short Ray Bradbury story that it might have been more Rewarding than the fucking hours and",
            "start": 3139.9
        },
        {
            "text": "when like the bang for your Buck might have been in that novella that you could have read overnight or that short Ray Bradbury story that it might have been more Rewarding than the fucking hours and hours and hours you poured into this other thing You might have enjoyed the techno dance techno thriller Dan Brown book more than you enjoyed Tolkien, you know, and that's and that's okay so Maybe enjoy that Batman book about taking out a child monsters, huh? Up, I read you always bring that reading All right next topic I want to talk about PlayStation Plus and Xbox Games with gold the free games the free game that you pay for So I To prepare for this topic I went to Google and I typed in Xbox games with gold just to see what they're officially saying about it And it literally says free games and there's an asterisk next to it. I'm like, that's fucking hilarious So yeah You pay for the the online service either a ps4 or Xbox gold and then Xbox Live gold and you get free games every month",
            "start": 3174.66
        },
        {
            "text": "and there's an asterisk next to it. I'm like, that's fucking hilarious So yeah You pay for the the online service either a ps4 or Xbox gold and then Xbox Live gold and you get free games every month two games on Xbox Random amount of games on PlayStation 2 purple platform 2 platform. Yeah less random than I thought but you get the crossplay sometimes It gets keep you participate in this at all. I have PlayStation Plus. I never like really get those games you guys Active users sure. Well, I mean the problem with colonized that we're so embedded in the community Usually when these games come around we've played them. We already have them We already, you know have them through hooker crook So it's never been as big a deal PlayStation Plus as I think it would have been to us as consumers for a long time when it first started Colin I did an Article at IGN we'd update every month with is it worth it? And this is what we paid for the year subscription and then add up all the different",
            "start": 3222.2
        },
        {
            "text": "for a long time when it first started Colin I did an Article at IGN we'd update every month with is it worth it? And this is what we paid for the year subscription and then add up all the different Avatars or backgrounds or games we'd get and take down with it or discounts we'd spend and stuff and it was like what in? the first Four months it it easily outpaced it Yeah You know I mean I was I was somewhat proud of the fact that back in the day in 2010 or whatever It was like we were really the first people that were like PlayStation Plus is like a good idea fucking People I don't remember people hated PlayStation. They fucking hated and I remember us being like, but why like why do you hate? I was putting a gun to you It's totally optional and it has all these like interesting things you can this was before it was mandatory for our MPS for hey Hey Keep going. So I I you know, I've always been of the mind that it's been quite the value Even though they upped at $10 over to $60 like I I",
            "start": 3261.6
        },
        {
            "text": "this was before it was mandatory for our MPS for hey Hey Keep going. So I I you know, I've always been of the mind that it's been quite the value Even though they upped at $10 over to $60 like I I think this is to me the whole PlayStation Plus and Xbox Live gold kind of argument honestly is like and I feel this Deep inside me and I think that it's it's true is is it's just something for people to bitch about and like and like I I I just don't get how you could look at a list of games where even when you're getting six games seven games eight games Whatever it is a month and you can't find two or three a year That you thought was worth it that would just pay for that subscription like it that's insane Not including the discounts on games that you were gonna buy anyway, you know, whether it's a they don't do summer of arcade anymore Right, but when then they got the PlayStation deals where you buy them and you get the discounts of it like spring fever There's an I think that the what",
            "start": 3295.64
        },
        {
            "text": "it's a they don't do summer of arcade anymore Right, but when then they got the PlayStation deals where you buy them and you get the discounts of it like spring fever There's an I think that the what people get so hung up on what because this we're going we're driving at the fact that people Have been outraged lately right there. It's getting worse and all this different stuff There's so many little things that I don't think people remember that they saved $7 on this game that they bought or this during the sale They were able to finagle this or get early access to something or that they sent their saves to the cloud and their ps4 died Or you know like like there's all these interesting things where I'm like the games Yeah, I mean I look at the games every month I'm like some of the some of the times bomb both Xbox on ps4 like these games suck, you know but you can't win them all and There are plenty of great games that have been downloadable on there, too I mean think about rocket",
            "start": 3335.04
        },
        {
            "text": "of the times bomb both Xbox on ps4 like these games suck, you know but you can't win them all and There are plenty of great games that have been downloadable on there, too I mean think about rocket League as an example of that rocket League was big specifically because of its PlayStation Plus and it was a huge it was a huge gambit that That you know, they at Sion X that they did I know because I had conversations with them before they did it you know and and it was it was the thing that they were thinking deeply about if it was worth doing or not, I really feel like the stigma around PlayStation Plus has reached a new height because of PlayStation 4 is inclusion of having to have it to play online and that games online connectivity is somewhat ubiquitous now with whether it's leaderboards or whether you're actively playing online and in an Active multiplayer or you're ghosting or whatever it happens to be that like this is hard to do without PlayStation Plus But it really is just a",
            "start": 3371.36
        },
        {
            "text": "or whether you're actively playing online and in an Active multiplayer or you're ghosting or whatever it happens to be that like this is hard to do without PlayStation Plus But it really is just a $60 investment and and I've said it before and it's not to be snarky or snide but if a $60 investment to get free games cloud saves automatic updates and Play online is too much for you. Probably shouldn't be playing video games Like you probably should save your money and spend it elsewhere It's really one game one triple-a game bought at Release that you don't get or something like that in exchange for a litany of games across all these platforms That you could just bank forever and as long as you keep paying You're gonna have access to them on ps3 on ps4 on Vita on Xbox 360 on Xbox one and so I never really quite understood the argument for it And so I'm told I totally think it's ridiculous that people that people are so upset about it But I understand the ups and downs of it and I'm sure",
            "start": 3410.44
        },
        {
            "text": "I never really quite understood the argument for it And so I'm told I totally think it's ridiculous that people that people are so upset about it But I understand the ups and downs of it and I'm sure it's not easy for Sony to acquire these games We don't really understand the nature by which they I've heard stories and totally off the record that I'm not gonna talk about here about how it goes but but the the the fact of the matter is that I Really feel like it's been a net benefit that it's been an interesting program that it's as Proliferated interesting games that people otherwise wouldn't like that's the big money in the in the developers pockets that otherwise aren't gonna be selling their games Because no one's gonna care about them And I think that there's a there's a lot of positive there that people overlook because they want to be negative about this I understand people's and especially within the history where there has been a big triple-a game on there or something You're",
            "start": 3453.56
        },
        {
            "text": "there that people overlook because they want to be negative about this I understand people's and especially within the history where there has been a big triple-a game on there or something You're like, oh man, this is what this is what it should be. This is what it should be The problem is I think you look past it so much that It's a way to get people to play games They wouldn't have played before that are cool, right? I look at that like flame over jumped off the list and I remember how much you were playing flame over and you were enjoying Flame over and then to see like gone home on there or something where I it's a game We all talk about but maybe you didn't want to invest it in that time and grand trust on PlayStation 4 exactly I've ever played that exactly as it was free and there's so there's these things that get tossed in there where it's like I Understand that you want it to be that Mass Effect is a PlayStation your mess like Andromeda is the PlayStation Plus game of you",
            "start": 3487.04
        },
        {
            "text": "so there's these things that get tossed in there where it's like I Understand that you want it to be that Mass Effect is a PlayStation your mess like Andromeda is the PlayStation Plus game of you know for March that's not gonna happen sadly Maybe wait on line promoting Mass Effect Andromeda to or whatever the hell I'm gonna call it There's games in here that are setting things up and doing these different marketing things But also getting you something you wouldn't play before and getting you something that is out there And so I think it's when you talk about a PlayStation Plus lineup or an Xbox. It's the same thing It's what I go back to when Adam Boyce was talking to us after PSX last year Well, I guess now what 2015 PSX 2015 and he was saying like They build these things and they the conference is and they try to have They understand they're talking to millions of people They're trying to have one or two or three announcements in there that ever for every person So you're excited",
            "start": 3519.28
        },
        {
            "text": "conference is and they try to have They understand they're talking to millions of people They're trying to have one or two or three announcements in there that ever for every person So you're excited about crash and I'm excited about now I'm talking about this one Pat upon you know I mean like there's these things where we're all finding our touchstones and I think that's what this is where there's yeah There are times where I come through and I look at the PlayStation Plus I'm like no no I remember that game doing really poorly and this isn't cool and I don't want any this night bounce But there are times where I run into something. I'm like, oh, yeah first off I want that game or like last guys in there. Yes. I want you to fucking play last guy years later Yes play last guy. Mm-hmm Yeah, I think that you know I was just reading the Tim had printed out the list of PlayStation Plus free games across all the platforms for 2016 And I'm looking at and I'm like, okay like even if 20% of",
            "start": 3555.24
        },
        {
            "text": "I think that you know I was just reading the Tim had printed out the list of PlayStation Plus free games across all the platforms for 2016 And I'm looking at and I'm like, okay like even if 20% of these games are up your alley like Isn't that a nice win for $60? I mean, it's like there are a lot of games on here that are great Yeah, there are great games on totally or games that you know, Grim Fandango is on here Hell divers is on here nom nom galaxy persona for arena Ultimax the last guy You said super star does HD which is one of ps3s best game costume question costume quest to NBA 2k 16s on there color is on here which I actually downloaded last month because everybody keeps telling me I should play color guardians like there's things on there that You get to miss and I you know, I when I went through and compiled this I put the Metacritic scores Yeah, Metacritic sucks I'm not saying it's the end-all be-all but to put all the Metacritic on there and it averages out to about 73 73",
            "start": 3587.48
        },
        {
            "text": "I went through and compiled this I put the Metacritic scores Yeah, Metacritic sucks I'm not saying it's the end-all be-all but to put all the Metacritic on there and it averages out to about 73 73 average and like looking at it like the question of is PlayStation Plus getting worse like Doesn't look like it at least from the Metacritic point of view of like these numbers like there a lot of the more recent ones Are in 80s every once a while. There's a 60 something The thing I think when people think it's getting worse is when they look further back, right? Well, because when you go back and you look at like the original run of PlayStation Plus you're seeing immediately Why about HD siphon filter more siphon filter? You're seeing the games that I think people have a soft spot for Where they were okay with getting older shit because it was a big name or that made it seem like that was justifying it where It is now you're getting flame over and last guy and people like well those aren't",
            "start": 3624.72
        },
        {
            "text": "were okay with getting older shit because it was a big name or that made it seem like that was justifying it where It is now you're getting flame over and last guy and people like well those aren't the games I want it's like, okay But like you can't always get a little big planet sack boys priest it historic moves How can you forget so yeah, I think it's you know, could it could it be better sure but this is an additive kind of feature of PlayStation Plus and It's not you know with people with the ps4 I know it's it's it's people need to pay this this fee to get online with ps4 and I understand people don't want to just Throw their money away But it's it's a little it's a little Intentionally ignorant to walk around acting like you don't get anything for the $60 and that you don't get plenty of bang for your buck For that you're $60 because you do if you're if your argument is like the networks fidelity isn't very good or if you are That's it. That's a fine argument but just based",
            "start": 3663.26
        },
        {
            "text": "plenty of bang for your buck For that you're $60 because you do if you're if your argument is like the networks fidelity isn't very good or if you are That's it. That's a fine argument but just based only on the Freebies like I just and and then you add in the automatic updates and you add in the cloud saving which I think is fucking awesome And maybe we just like it more because we have multiple consoles and some of that Maybe that's not something a lot of people use and it just kind of gives you peace of mind as well I was gonna say when their systems died only but to me I just don't understand $60 Like it's it's literally $60 and this is not a cheap hobby. We all are used to spending money. So $60 is really You're you're you're inhibited by a $60 purchase that's getting you all this free shit Basically or shit that you're technically paying for that's not free then video game might not be for you, you know Yeah, it's interesting cuz on the kind of funny Facebook group Like this is",
            "start": 3695.38
        },
        {
            "text": "shit Basically or shit that you're technically paying for that's not free then video game might not be for you, you know Yeah, it's interesting cuz on the kind of funny Facebook group Like this is all every time every month is sure there's a huge discussion on what people think and it's so funny to go back To what Adam boys are saying a little something for everybody anytime someone's complaining. Somebody's like I love it. Yeah I feel like I'm usually middle of the road on every one of them because I own a few of them or whatever I'm just like oh that seems like a good month and then it is that there are the people who fucking Like it and really like it and maybe even love it and the people who hate it Mm-hmm and like you're never you can't make everyone happy because it's so broad. There's no way I mean even if it was all right, we're giving everyone persona they'd be like I don't care about JRPGs. Yep. Why didn't they get why didn't they give me Mass Effect? This isn't so much",
            "start": 3731.86
        },
        {
            "text": "There's no way I mean even if it was all right, we're giving everyone persona they'd be like I don't care about JRPGs. Yep. Why didn't they get why didn't they give me Mass Effect? This isn't so much about the free games But I think I want to give a shout out to Sony for doing a really good job with digital sales And I think PlayStation Plus has a lot to do with that. There's so many times I'm on PSN There's like sale. There's always flash sales going on There's always like event sales happening and I'm like, why don't other people do it this way? You know, I mean like steam does steam does it obviously really well steam seems the best but Like Xbox doesn't do that like Nintendo doesn't have like Nintendo focus sales and stuff every once in a while they will but it's usually as an apology because they fuck something up Yeah but on PlayStation it's like I Really think they're doing a good job of getting me interested in things that I wouldn't necessarily be interested in Like there's",
            "start": 3764.78
        },
        {
            "text": "because they fuck something up Yeah but on PlayStation it's like I Really think they're doing a good job of getting me interested in things that I wouldn't necessarily be interested in Like there's been multiple times where the PlayStation Plus sale price Like there's a sale going on on PSN and then the PlayStation products discount you get on top of that sale I'm like, oh fuck Worth it right over break somebody hit me up of like they got like three of the games We've been talking about this year for like seven dollars and sixty cents because it's like that what you're talking about where you compile All that together and the but those are those are the hidden benefits, right? The benefits people think of are the instant game collection and why the fuck is there an odd world on here? I don't care about odd world. I want to play something. Well next week next year. They'll be or next month They'll be something different. But yeah Yeah, any closing words? No my argument would be that",
            "start": 3803.12
        },
        {
            "text": "don't care about odd world. I want to play something. Well next week next year. They'll be or next month They'll be something different. But yeah Yeah, any closing words? No my argument would be that it's you know You the old adage is you spend money to make money and we know that from owning a business but I would also put forth that you you spend money early to save money later and that I think that It's like a gamble because you don't know what you're gonna buy if you're gonna buy ten games a year Something like that Maybe none of your games are discounted But if you're if you're a chronic purchaser of games and if you also wait and you don't care about being you know Quoting the conversation which is a term I hate About a game and you're willing to wait or whatever then PlayStation Plus is almost certainly gonna pay dividends for you if you're patient and you buy a lot of games because if you're gonna spend If you're gonna be in these flash sales often and buy a game or two in",
            "start": 3843.08
        },
        {
            "text": "Plus is almost certainly gonna pay dividends for you if you're patient and you buy a lot of games because if you're gonna spend If you're gonna be in these flash sales often and buy a game or two in every flash sale that is usually discounted and then discounted even more significantly and severely for PlayStation Plus and certainly you're gonna make your money back and if you count the cloud saving as Worth ten dollars and you count the automatic updates is worth five dollars in the online play is worth ten dollars or ever than that removes twenty five dollars from the sixty dollars and suddenly You're not really even spending that much money to grab a few freebies if there's one game every other month that you like Then you're making your money back like it. It's just it's just basic math And so I never really quite understood the very You know negative nature of some commentators around this like you said it's not everyone but some people around this I think the negativity is a",
            "start": 3876.0
        },
        {
            "text": "math And so I never really quite understood the very You know negative nature of some commentators around this like you said it's not everyone but some people around this I think the negativity is a little over over the top The final topic of the day as always brought to you by you You can go to kind of funny comm slash games cast topic to leave your topic just like Brian artist Jackson did Brian artist Jackson. How would you like gaming to improve in 2017? You Ponder that Well, I think what I think what EA just did today as we're recording this with with a release date for Mass Effect being announced Literally two and a half months or so before the game comes out I think it's a great example what we've been talking about about keeping your cards closer to your vest until you're ready to say something about giving people something really Be really excited about in a finite amount of time with something that's imminent. I think is a really cool cool thing We've seen that, you know and",
            "start": 3905.8
        },
        {
            "text": "say something about giving people something really Be really excited about in a finite amount of time with something that's imminent. I think is a really cool cool thing We've seen that, you know and sporadically we've also seen the opposite with what rock started with Red Dead Redemption 2 so That's one way. I'd like to see gaming improve is to publishers Take your time developers take your time and when there's something to say say it Say it definitively and say it close to when you're ready to actually show something I don't like these long lead times and I hope we continue to learn from that Give up on the and this isn't just Mario give up on us always online bullshit like you even watch talks to you where I? Got to connect to the server and log in all that stuff in the beginning and then you're gonna put trophies in there Right, you're forcing me to play with the people and do all this shit. Like let's focus on single-player Let's just let me have the experience I want and keep",
            "start": 3954.34
        },
        {
            "text": "then you're gonna put trophies in there Right, you're forcing me to play with the people and do all this shit. Like let's focus on single-player Let's just let me have the experience I want and keep going that way. Mm-hmm for me I just I hope there's less delays. I think that 2016 Might have been the end of that era of all of these games getting delayed constantly constantly constantly There will always be delays for the rest of time share But I I hope and I expect when 17 will not have as you think people are gonna keep their mouths shut a bit better Yeah, and it's like going back to what Colin was saying I think that like those are things that go hand in hand and I think that in 2017, hopefully a lot of games like I I Was wrong thinking that horizon was gonna get delayed by the end of 2016. So I hope that that stays true. Yeah, I Hope the switch is awesome. George Barrett says do you guys have any gaming New Year's resolutions? I Want to play more games I feel like that's such an",
            "start": 3986.42
        },
        {
            "text": "2016. So I hope that that stays true. Yeah, I Hope the switch is awesome. George Barrett says do you guys have any gaming New Year's resolutions? I Want to play more games I feel like that's such an easy thing to say sure I'm probably not gonna be able to stick to it as much as I'd like to but I have fun playing games you know, I think that's a easy thing to say, but it's like, you know, it it's easy to get caught up in work and Especially when you're with what we're doing I'm like to not remember that I like just playing the games to play the games not just to talk about the games And the few times I've been able to play things recently. I'm like fuck man Like why don't I do this more I think the one for game over Greg you sure I did the topic of where I went Through all the movies I watched I want to keep a better track of everything I play this year because I feel like you know, we were doing when we're doing Game of the Year stuff and rounding up and like I look at my trophies,",
            "start": 4025.3
        },
        {
            "text": "I want to keep a better track of everything I play this year because I feel like you know, we were doing when we're doing Game of the Year stuff and rounding up and like I look at my trophies, which is pretty great But then I almost forget not that it got in mention But I forgot that I played quantum break or whatever and not that I was gonna put that on my list But I had fun with it and it's a game that I'm like, alright I played that and like that speaks to I guess the narrative of it that I don't remember I was like, oh shit I don't even remember playing that this year, but we play so much in a year that it by the end you get to You're like, what did I play that wasn't on here? I know I've played seam games. What if I played earlier? But also a year Used to mean something different in games because of how things were released where it's like you only needed to pay attention to August to December Yeah, and it was like what happened in the last couple ones you can remember that but",
            "start": 4078.62
        },
        {
            "text": "games because of how things were released where it's like you only needed to pay attention to August to December Yeah, and it was like what happened in the last couple ones you can remember that but like super hot That was the rest like yeah, what the hell like there's so many of these games that I'm like, man I would have sworn that was way longer ago, but that's just how time works I mean last year 2016 I played an absurd amount of games I couldn't believe how many games I played and what I like to do is The volume isn't so important as time spent and so I'd like to continue to just play the games that spoke to me I think that this 2016 was a very good year for games. I think some people were pretty critical about it I thought it was a really great year and so I want to continue to to pay heed to the games that speak to me and spend continue to find time to spend with those games because I really didn't think I did a nice job with that in 2016 of balancing all that kind of stuff",
            "start": 4109.14
        },
        {
            "text": "pay heed to the games that speak to me and spend continue to find time to spend with those games because I really didn't think I did a nice job with that in 2016 of balancing all that kind of stuff because games are Certainly a bouncing act and when I am playing them Especially as an adult and when I went back and looked at my trophies for our game of the year list I was shocked by how much I played and and I want to continue to find the time to do that and and also because I think it's also important to balance out the other Things you're interested in and not be overwhelmed with that kind of stuff So it's a scheduling issue, but there's a lot of great games coming out this year or games that I'm excited about I mean, we're gonna get Resident Evil 7 and I'm gonna get Tales of Berseria, which I'm super excited about We're gonna move right into the horizon and then we're gonna move right into Mass Effect I mean, there's a lot of stuff in the first quarter. I Wasn't evil man. I always",
            "start": 4146.14
        },
        {
            "text": "which I'm super excited about We're gonna move right into the horizon and then we're gonna move right into Mass Effect I mean, there's a lot of stuff in the first quarter. I Wasn't evil man. I always forget. It's super close Really excited about that we might get at any moment I should reach out and say oh man Justin Pruitt says Pruitt and His Twitter name is LP fanatic for Ev. I love that when we can Park. Yeah What do you think will be the biggest takeaway from the year? What will 2017 be remembered for I? Hope more than anything it will be remembered as the year that Nintendo comes back. That's a great point I hope that it is just Nintendo just fucking takes it by the horns breaks that motherfuckers neck It was just like I'm fucking back and Reggie just comes out and he's just like It's like a doggy. I'm fucking Reggie. My body's goddamn ready Was the horns did you break the year's neck wouldn't what oh my god, that's visceral Man, I wouldn't expect that from Reggie seems like such",
            "start": 4176.88
        },
        {
            "text": "like a doggy. I'm fucking Reggie. My body's goddamn ready Was the horns did you break the year's neck wouldn't what oh my god, that's visceral Man, I wouldn't expect that from Reggie seems like such a nice guy. Yeah, I agree I think this is you're gonna remember what whatever Nintendo did You know as I said as I said in as I said in Colin was right Not that I'm swimming that you guys probably already seen if you're gonna watch it but about the switch is that Expectations are what's really important switch dictations as I call them in the video and I feel like I feel like the expectation We just need to narrow the expectation down if we if if switch tells sells twice as much as we you three times as much As we you that's a massive success and I'm not saying in the year I'm saying lifetime like switch is still going to be a niche device, which is not going to outsell ps4 you know like so just keep your your Expectations in check focus on the positive in terms of the games and the",
            "start": 4226.58
        },
        {
            "text": "like switch is still going to be a niche device, which is not going to outsell ps4 you know like so just keep your your Expectations in check focus on the positive in terms of the games and the quality so what it's 720 or whatever Apparently I'm gonna be on the handheld or the games go to the games fun They can nail the price if they can nail the price if they can nail The messaging if they can get all the bad news out of the way the battery life's good, etc And so on then I think Nintendo's gonna be very successful time with this thing But again context is everything even 3ds which seems like a runaway success is sold a small fraction of what of what the s sold Because things are changing And I also think that one of the interesting Underlying things that we're gonna find out with the switches of the switch does well I think Sony in particular is paying attention to this and I do not think we have seen the last of a Sony handheld if switch does well and I stand by that like Sony is",
            "start": 4264.86
        },
        {
            "text": "of the switch does well I think Sony in particular is paying attention to this and I do not think we have seen the last of a Sony handheld if switch does well and I stand by that like Sony is not gonna let Nintendo have this uncontested market share if this thing is big and There always are in Dean there always I'm sure testing and thinking and trying new things And so I think that that's gonna be an underlying story that might be told in years to come If the switch is successful, and I'm really pulling for Nintendo I really I think a healthy Nintendo is gonna be good and an independent Nintendo is gonna be good for the game industry Sony So you can they should watch what Reggie does to 2017 which this whole thing they should be careful That's all you know what you don't want. Okay, don't have the horns come near say Sony horns come in there that Vita It's about to get fucking got I see I don't think it's gonna get get as much as this is the evolution This is the Nintendo they saw the",
            "start": 4301.62
        },
        {
            "text": "have the horns come near say Sony horns come in there that Vita It's about to get fucking got I see I don't think it's gonna get get as much as this is the evolution This is the Nintendo they saw the Nintendo saw the Vita and they said you're close Sony we can perfect this I really I said it in my Game stop video that I made when I was talking about what I am hoping for and expecting for the switch And I think that there's a great opportunity for a Nintendo to do what the Vita should have been Which is have great indie games have a lot of games just coming out But also have solid first-party games and that's where the be the lacked and I think putting the Nintendo games on there when it is Nintendo just focusing on one library instead of the Wii U and 3ds like man it's very exciting times to be a Nintendo fan, which is Awesome to say because it's been like 10 years But this time like you're why see even that you guys always get excited for your directs Even back in the day you get",
            "start": 4339.5
        },
        {
            "text": "to be a Nintendo fan, which is Awesome to say because it's been like 10 years But this time like you're why see even that you guys always get excited for your directs Even back in the day you get excited for the e3 press conferences and we were always sitting on the sidelines like don't do it They're gonna hurt you again. They're gonna break your heart and they did over and over again This is the first time in a while you have legitimate reason to be excited. Well, they ain't gonna fuck you dirty. I Only halfway agree with that because there was a lot of times where it's like when I you are expecting They're gonna do this crazy thing Absolutely perfectly then you're gonna get disappointed But I do think that intimidated a really good job of when it came to games Smash doing we're on there smash things are amazing their directs when it was like press conference directs where the Tom had a whole bunch Of stuff that's when you're gonna get disappointed But when it was like we're doing a",
            "start": 4380.24
        },
        {
            "text": "smash things are amazing their directs when it was like press conference directs where the Tom had a whole bunch Of stuff that's when you're gonna get disappointed But when it was like we're doing a direct just about Mario Kart or we're doing a direct just about Mario 3d world or just About Bayonetta or just about Smash Bros. That's when it's like you're gonna get excited and I feel like they did a great job of giving me reasons to be excited because that's the thing that they no matter what and they've done wrong the last ten years they did the games right and I think that they also did a really good job hyping those games and Keeping me excited for those games. I wasn't excited for their business plan but now for the first time I am and it's like they have not fucked up and you keep saying about the the bad news coming and like we're getting closer and closer to they're not being bad news and like everyone of course is gonna find something to be upset about but personally, I Think",
            "start": 4417.6
        },
        {
            "text": "about the the bad news coming and like we're getting closer and closer to they're not being bad news and like everyone of course is gonna find something to be upset about but personally, I Think we're in the clear Let's get it Joey Noel says obviously the most important gaming news of the day Pokemon snap finally on the Wii U virtual console Pokemon snap is this I'm gonna get a lot of shit for this kind of sucks It kind of really sucks it. I love it as it was what it is. I have fun nostalgic memories of it, but like Man it's you don't like taking photos. It's always got to be about shooting and fucking with you, huh? Yeah, she can't even selfie No one knew what a selfie was back then they shouldn't do that shit with your wind-up camera You didn't know what you're getting. Mm-hmm. I didn't I did selfies But again close you I mean what they're still not at the Pokemon snap time Think about that. I was in high school Michael Brian's basement. You must have been fucking what fifth grade",
            "start": 4458.04
        },
        {
            "text": "I did selfies But again close you I mean what they're still not at the Pokemon snap time Think about that. I was in high school Michael Brian's basement. You must have been fucking what fifth grade third I was in third grade And the Pokemon snap they had these little kiosks where you could take your Pokemon stadium cartridge and plug it into the blockbuster kiosk and there was a photo mode in Pokemon Stadium and you can upload your Photos from either Pokemon snap or Pokemon Stadium and then print them off on little actual pictures very smart It's like officer was a weird place Agreed. Yeah, but I miss it once I wanted to pick I forgot what shit I wanted to pick up some rated our movie there and it was me my friends and we were under 17 But like we were able to use their phone to call my mom who then got and she's like, yeah They can have it. He's like, alright, I'm like that could've been any adult. Yeah, could call the pizza shop Begged him just say yes to whatever this man's about",
            "start": 4508.8
        },
        {
            "text": "mom who then got and she's like, yeah They can have it. He's like, alright, I'm like that could've been any adult. Yeah, could call the pizza shop Begged him just say yes to whatever this man's about to say Nathan Evan says Greg Collins said they wouldn't be shocked if Mass Effect came out spring 2018. What are their thoughts now? I I didn't know none of you were here, but I was working this morning from the office and when it popped up I was like, whoa, like whoa. All right, cool. Look at the balls on you. Yeah, I was wrong I totally I did not think you had a shot at this spring I kept saying that I thought for sure it wasn't gonna come out this ring But here we are with a March real release day and I'm like damn good for you I say so much shit that I remember half of it I don't remember ever saying that so I'm just I that could have been something I said But I don't remember saying that Mass Effect come out next year I think I don't know not that it would I think I think the",
            "start": 4552.16
        },
        {
            "text": "ever saying that so I'm just I that could have been something I said But I don't remember saying that Mass Effect come out next year I think I don't know not that it would I think I think the conversation was me saying Something's wrong with that game you seeing I guess saying I can see that and I think it was the conversation That was you saying you could see it coming this soon or you could see it coming out as far as it wouldn't be shocked So it's not saying yeah, I don't know this wasn't a common prediction I certainly when I went on Twitter this morning I certainly didn't expect to see a release day and I'm super hard about that now people are saying that the game's gonna get delayed And I'm like, I don't know about that because I know that I know that I know that Inquisition got a six-week delay But why would you announce the date two months before then? I really feel like this was them like making sure that they were ready to go and I think that they're ready to go I think that",
            "start": 4588.88
        },
        {
            "text": "delay But why would you announce the date two months before then? I really feel like this was them like making sure that they were ready to go and I think that they're ready to go I think that that is the date and I feel like that that was the date that was leaked by Dark Horse like months ago But I'm looking at that. Mmm final question comes from Kind of soup Steven I Want a review of altered beast aka the best game ever made How many tweets have you guys gotten about all should be because I've gotten a fucking some guy to some girl or guy was just Like I can't I busted out laughing and then started crying when you guys said that my favorite my first game Alter beast was the word was horrible altered beast is the worst go fucking play it right now in any of the Sega Genesis collections It's terrible. You're spitting fur balls at people. It's awful It's a garbage game. I remember when it came out the ps3 We got codes or something and I downloaded and I use the guide to get as many",
            "start": 4616.96
        },
        {
            "text": "It's terrible. You're spitting fur balls at people. It's awful It's a garbage game. I remember when it came out the ps3 We got codes or something and I downloaded and I use the guide to get as many trophies as possible like the game the Game is fucking atrocious. It is an atrocious bad terrible terrible visuals controls like garbage There's nothing redeeming about altered beast. I don't know what else to say about it I I encourage everyone to play altered beast specifically just so you know what a bad game is and then you can judge everything based on altered beast because the only other game I Can think of off the top my head that's even remotely that bad is that game Amy on ps3 Like there are games that are not fun There are games that are well, we they're bad games and then there's like fucking trash and they're that Fucking trash isn't isn't that common really in the console space? It's not an altered beast man is fucking garbage Garbage, I couldn't believe when I was a kid play",
            "start": 4657.8
        },
        {
            "text": "fucking trash and they're that Fucking trash isn't isn't that common really in the console space? It's not an altered beast man is fucking garbage Garbage, I couldn't believe when I was a kid play that was their original pack in right? That was their big ticket thing and then they're like that's it started fucking tanking They got get Sonic out Sonic came save the day. Yes, Sonic came out It took two years for Sonic to like my post Genesis feel free at Genesis came out in 89 You know, so it's it's not like and then Jen I did not know that I was also I came out in 89 but I didn't realize that that Genesis came out until like the revival period yeah Genesis had like it wasn't even a soft launch they tried and they failed and then they tried again and it and it worked It's that's really unprecedented. Yeah, I was gonna say just had to go fast. Ladies and gentlemen This has been the kind of fun games guys. Thank you very much for joining us until next time. I love you",
            "start": 4691.54
        }
    ]
}