{
    "id": 32,
    "video_id": "82Ep0f0GPgs",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Golden Oreo Cookie Review: Oreo Oration",
    "description": "Nabisco went bonkers and made a Golden Oreo. Here's the review.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nCheck out the Oreo Oration playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&feature=plcp\n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1352296857,
    "duration": 233,
    "transcript_chunks": [
        {
            "text": "[ Music] what's up everybody? Welcome to Oreo Oration. I'm Greg Miller, and while you were out living your life and buying a car or whatever the hell it is you do, the fine people at Oreo were making endless variations to Milk's Favorite Cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like the video, then subscribe to my channel here. Today we're reviewing Golden Oreo. Now here's the thing, you, you know, you out there, you think you know everything about Oreos. You probably seen the Golden Oreo, right? This was the big deal. This is when the people at Oreo said we are bonkers and we're going to change everything you know about Oreo and put them out there. So we begin this Oreo Oration like we do every Oreo Oration with the first look, peeling back Nabisco patented seal technology. There we go. Oh, look at them. They see I'm not getting shorted any cookies. I'm not getting any broken cookies. Let's get the bouquet in here. Oh, a",
            "start": 0.55
        },
        {
            "text": "first look, peeling back Nabisco patented seal technology. There we go. Oh, look at them. They see I'm not getting shorted any cookies. I'm not getting any broken cookies. Let's get the bouquet in here. Oh, a very interesting smell. It's not the cream speaking to me this time. When I put my nose right in there, this time I'm getting the smell of the actual shortbread cookie, of course, the the white cookie if you will. So let's see here. Up next, of course, in oration, uh, the taste. How are these little, how are these little yellow guys going to taste? Let's see. Okay, dynamite taste. Put it up, dynamite. They've got this light sugary kind of vibe to them. They're not sugar cookies, but that's kind of the taste you get with it. It mixes really well with the cream, of course. That's a huge part, a big part of Oreos though, is pairing it with milk. Let's see how these boys play with the milk today. Look at that. So, so beautiful. Uhoh, everybody, it's white on white crime. Just kidding, don't worry. All right, so we're dunking. How",
            "start": 42.68
        },
        {
            "text": "is pairing it with milk. Let's see how these boys play with the milk today. Look at that. So, so beautiful. Uhoh, everybody, it's white on white crime. Just kidding, don't worry. All right, so we're dunking. How the cookie, you know, the white cookie , how is it going to take? We always talk about how important it is that the black cookie takes on that milk, sucks it in nice and tight, gives us a good taste. Let's see what we get here. M, now we're into interesting City. Here's my thing, thing right away with how it pairs with milk taste wise, an excellent taste. They're mixing really well together, the shortbread sugar cookie taste, the white cream. However, I dunk that the, you know, traditional three or four times that we do here on Oreo Oration, the cookie itself did not get softer. You know, you, you dunk the traditional chocolate cookie takes on a lot of that milk. It's kind of soggy. You like that. It's a little bit different here. It just tasted like an Oreo with a little bit of milk on it. You can get probably the",
            "start": 89.36
        },
        {
            "text": "chocolate cookie takes on a lot of that milk. It's kind of soggy. You like that. It's a little bit different here. It just tasted like an Oreo with a little bit of milk on it. You can get probably the same sensation by eating an Oreo, drinking some milk. Can't give them a lot of good points for that . That's, that's no good. Let's see how they twist. Of course, making double stuff's a big deal. Ah, no golden cookie, you were doing so well. You can't twist. I'll give you another shot. I do, I do this. If we got to do best two out of three, we'll give you the chance here on Oreo Oration. Another one splits off again. Of course, if you have a butter knife or your teeth, you can fix it yourself, but who wants to do that when you could just perfectly split them, put them back together. So reviewing the golden, I was saying you were doing very well. You were charting to be a solid 9.0, 9.0, 9.0. What's that? That's nothing. I blame the golden cookie. I'm going to have to give him an 85 here. Again, dynamite choice, really good",
            "start": 137.4
        },
        {
            "text": "you were doing very well. You were charting to be a solid 9.0, 9.0, 9.0. What's that? That's nothing. I blame the Golden Oreo. I'm going to have to give him an 85 here. Again, dynamite choice, really good tasting. Obviously, we've looked at some problems, doesn't pair that well with milk, doesn't twist that well. So that's the way the cookie crumbles for the Golden Oreo. What do you think? You probably had this one. Leave a video response below on this video letting me know you're a review for the Oreo. Then subscribe to my channel, then like the video. Now most importantly, ladies and gentlemen, are there Oreos out there that I'm missing? I'm sure there are. Name them in the comments below so I can go to stores and buy them with my own money because I get none of this for free. Then share this video with your friends so I continue to make videos. I'll be back every Wednesday and Friday until I run out of cookies to review, but until then, keep on dunking .",
            "start": 175.4
        }
    ]
}