{
    "id": 37,
    "video_id": "hUNfIoxrgdg",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "The Top 10 Presidents: A Conversation with Colin",
    "description": "Who are the Top 10 Presidents? Well, let Colin tell you...\n\nToday's topic was submitted by Chis Derby. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Sean for filming. \n\nSpecial thanks to Patxi's Pizza for feeding us while filming. Next time you're in San Francisco, eat at Patxi's -- http://patxispizza.com/.",
    "published_at": 1352988047,
    "duration": 1313,
    "transcript_chunks": [
        {
            "text": "Andrew Jackson's just **** crazy. Also, there's another great story about Andrew Jackson about he used to let people into the White House as a lot of presidents used to for parties and stuff like that and a dude walked up to him, an assassin walked up to him and tried to kill him and had two pistols and both the pistols jammed and Andrew Jackson beat the **** out of him. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate, Colin. Now sometimes Colin says crazy stuff so every Tuesday and Thursday I reach into my random topic pile pulling out show it to Colin for the first time ever and we have a conversation about it. If you like that, like the video, subscribe to us here on YouTube and then please share it with your friends so more people find out how crazy my roommate is. Colin, are you ready? Yes. Today's topic of conversation is rank the top 10 presidents. This is courtesy of Chris Derby. Thank you, Chris. I'm going to get up real quick and get a pen but you're",
            "start": 0.2
        },
        {
            "text": "roommate is Colin, are you ready? Yes. Today's topic of conversation is rank the top 10 presidents. This is courtesy of Chris Derby. Thank you, Chris . I'm going to get up real quick and get a pen but you're welcome to start. Okay, um I need I need to write too. Okay, I'm coming over. Yeah, hold on. This is going to be a tough one here. We go. I got some no cards in in a marker here. This is an Oreo oration card. Don't write on that but watch Oreo oration uh every Wednesday and Friday on youtube.com/ game. Sorry, this is going to take a minute. No, you're fine. I'll talk over it. My top President, Abraham Lincoln. I like the hat, the hat, like the beard. I like that he haunts the White House. Okay, it's pretty cool. It's interesting. Yeah, yeah. Number two, Barack Obama just to make you mad. That's fine. Teddy, no explain to me what are you writing down right now? Your favorites in general and then you're going to rank them or are you trying to go in order right now? Yeah, I'm going in order in my mind in which they were ser",
            "start": 35.64
        },
        {
            "text": "what are you writing down right now? Your favorites in general and then you're going to rank them or are you trying to go in order right now? Yeah, I'm going in order in my mind in which they were ser in which they served. Okay, okay. In which they served as long as it's chronological. I guess we're all happy with this one. Is it doesn't really matter who's the last great president you think we had? Reagan, Clinton. Clinton brought I'd probably say Clinton was the last great. Sorry, I'm doing this. This is all real time here. Don't worry, we can fast forward all right once I figure out how to do that effect. Oh yeah, what the **** am I thinking? What the **** are you thinking? Get your **** together, God. Yeah, got have a case for each one of these now. I like just the inclusion here. You got a greater than symbol all set to go. Actually, it was just cuz he fits in here. Yeah, yeah. Uh one more, Carter. Uh let's see. Good job, Chris Derby. I'm just running through them all again. Yeah, I know. I sorry, no, I'm I'm this",
            "start": 82.16
        },
        {
            "text": "all set to go actually, it was just cuz he fits in here. Yeah, yeah. Uh one more, Carter. Uh let's see. Good job, Chris Derby. I'm just running through them all again. Yeah, I know. I sorry, no, I'm I'm this is your conversation. I want to make sure I just want to make sure I'm not missing anyone. That's fine. While you do that, I'll regil people with the story on Fourth of July. Colin to drink to the Presidents him him and his goofy friends get together and they do shots to the Presidents and they say their little thing while they do it. You you and sin over there talking about who your favorite is. You once puked on a porch after doing it. Yeah, and then passed out. That was like a one in the afternoon too. Fourth of July, Colin's holiday. Um I'm tempted to do it. Do it. Okay, okay. So I have 10 names here. Yeah, and I got to rank them. Yeah, so starting at 10. Let's start at 10. Starting at 10, ladies and gentlemen, Colin Moriarty's top 10 presidents starting at 10. Number 10, Bill Clinton. Bill Clinton . Now I like Bill Clinton",
            "start": 125.8
        },
        {
            "text": "got to rank them. Yeah, so starting at 10. Let's start at 10. Starting at 10, ladies and gentlemen, Colin Moriarty's top 10 presidents starting at 10. Number 10, Bill Clinton. Bill Clinton. Now I like Bill Clinton because um first of all, Bill Clinton was elected in somewhat of a dubious way. I think because this is something I talk about a lot with people that like to vote for third parties and what could possibly happen when you vote for third parties. You you typically folks out there, you typically vote in your you don't vote in your own self-interest when you vote third party because you end up hurting yourself and let me give you an example. Okay, please do, please do. In 1912, right long before Bill Clinton was born, long before yes, there was a presidential election in 1912 and Taft was the Republican incumbent. He was running against a guy named Woodrow Wilson who was a Democrat. Teddy Roosevelt could have run again in 1908, right? Yes, but he didn't and he Taft was kind of like his Protege and Taft came in",
            "start": 195.12
        },
        {
            "text": "he was running against a guy named Woodrow Wilson who was a Democrat. Teddy Roosevelt could have run again in 1908, right? Yes, but he didn't and he Taft was kind of like his Protege and Taft came in but in 1912 he wasn't too pleased with how Taft was doing so he decided to run third party. The party was called The Bull Moose Party. Mhm. And Teddy Roosevelt took something like 10 or 11% of the vote mostly Republican that would have voted for Taft and Woodrow Wilson won. So a third party gave us a president that that probably shouldn't have we probably shouldn't have been given. Yeah, in 1992 something very similar I think happened. Bill Clinton was running a totally competent governor of Arkansas, three terms I think and he was running against the incumbent George H.W. Bush who had lied about raising taxes so he was very unpopular at that point and then Ross Perot ran and Ross Perot is the most successful of all third party candidates in in American history at a time in the summer of 1992 was actually",
            "start": 243.64
        },
        {
            "text": "so he was very unpopular at that point and then Ross Perot ran and Ross Perot is the most successful of all third party candidates in in American history at a time in the summer of 1992 was actually winning. Now Ross Perot dropped out of the race briefly and then came back in and people suggest that that that actually really injured him and it did. He might have actually won the election. We might might be having a different conversation at that point but mostly because he was a conservative leaning person. He was against things like NAFTA for instance people uh that voted for him were mostly conservatives and that took away from George H.W. Bush and then we got Clinton. Now it's not quite as clearcut there was other factors mean how many percents did he get? Yeah, I don't remember. He got almost 20% of the vote. Wow, okay. So Ross Perot was like a tour to force as a third party candidate even compared to Teddy Roosevelt and the same thing happened and I hate you know I know we have a lot of liberal",
            "start": 291.52
        },
        {
            "text": "of the vote. Wow , okay. So Ross Perot was like a tour to force as a third party candidate even compared to Teddy Roosevelt and the same thing happened and I hate you know I know we have a lot of liberal viewers out there. The reason George W. Bush was elected of course was because of a third party candidacy namely Ralph Nader. So Bill Clinton was elected regardless of how he was elected, he was a man of the center. I think that he proved that he can work with both sides and that the'90s were actually a really great time in American history um indisputably and I really like Bill Clinton. I think Bill Clinton's like a good dude. I think he kind of got thrown under the bus by some overzealous politicians who wanted to get involved with his sex life. He shouldn't have lied about it but he didn't really do anything illegal. He the perjury was actually what was illegal but he worked with both sides of the aisle. He worked famously with a Republican house which was the first Republican house in decades um",
            "start": 328.08
        },
        {
            "text": "anything illegal. He the perjury was actually what was illegal but he worked with both sides of the aisle. He worked famously with a Republican house which was the first Republican house in decades um and they came in um and uh didn't seem like they were going to work with with Clinton but Clinton kind of got what he wanted and what we got were a combination of you know a lot of tax revenue along with some tax cuts, record low on employment um and general prosperity in the'90s. So that's the reason I like Bill Clinton. I think he's just I think he's a good dude and I think he's playing ball with Barack Obama now for obviously because his wife's going to run in 2016 um but I don't think that the Clinton family is nearly as liberal as most of the Democratic party and I think that's why they're very popular in the Midwest and South. Interesting. Number nine on Colin Moriarty's top 10 President List. Let's see, we got Clinton here. Yeah, Clinton at 10 so nine hm tough stuff here. Let's go with let's go with",
            "start": 367.76
        },
        {
            "text": "popular in the Midwest and South. Interesting. Number nine on Colin Moriarty's top 10 President List. Let's see, we got Clinton here. Yeah, Clinton at 10 so nine hm tough stuff here. Let's go with let's go with Dwight D. Eisenhower. Oh, Ike. I like Ike. Um so Eisenhower of course became famous in World War II. Um he was um Allied Commander and um quite an astute uh military man obviously and we have a history in American you know we have a history in America of electing military men starting of course with George Washington. We had guys like uh William Henry Harrison, Andrew Jackson, uh Zachary Taylor and so Ulysses Grant, Teddy Roosevelt, a lot of guys that fought um and what I really respected about Eisenhower amongst other things was that he was a reasonable Republican. We talked about Republicans and and rational Republicans and Eisenhower certainly a rational thinking Republican um that did things that were that were hard but that were right um including creation of the interstate system that we rely on so much",
            "start": 405.08
        },
        {
            "text": "Republicans and Eisenhower certainly a rational thinking Republican um that did things that were that were hard but that were right um including creation of the interstate system that we rely on so much today. Love the interstate. One of the most interesting things about Eisenhower though is that as a man of the military, a man who you think would be in the corner of the military, he um and he was, he warned us about something called the military industrial complex which is um something that we deal with today, something where uh uh a self-fulfilling prophecy almost of be the military uh becoming bigger and bigger and bigger and controlling a sector of the economy in which it kind of extracts what it wants and to just be careful of of a a burgeoning military that really doesn't serve a purpose except for you know lining in the pockets of people stuff like that and maybe even becoming dangerous to the people that support it. Um so Eisenhower is an interesting man, an interesting Republican, a",
            "start": 465.8
        },
        {
            "text": "except for you know lining in the pockets of people stuff like that and maybe even becoming dangerous to the people that support it. Um so Eisenhower is an interesting man, an interesting Republican, a well-respected Republican, probably one of the most well-respected presidents I think of all time um on both sides of the aisle um and if you know obviously coming after FDR um he wasn't able to run again but I'm sure he actually probably would have won a third term if he if he was able to. JFK ran in 1960 of course and one. Yeah, um so Eisenhower number nine. Of course, Eisenhower if you remember ladies gentlemen the serial piece that little Pete got caught in his nose in The Adventures of Pete and Pete on Nickelodeon. Number eight on Colin Moriarty's top 10 presidents of Alon. Let's do FDR. FDR. Now FDR gets a lot of **** including from people like me. FDR all that FDR is is I I I would say one of the most divisive presidents even though when you look at like the Schlesinger pole and other uh historical",
            "start": 508.0
        },
        {
            "text": "a lot of **** including from people like me. FDR all that FDR is is I I I would say one of the most divisive presidents even though when you look at like the Schlesinger pole and other uh historical scarly polls that rank the presidents um and he's usually very high up. He's very very divisive because FDR did a lot of unsavory things um but he sat down a lot. He did he sat down a lot because he had to because he had Polio. What I'm sorry. Um but FDR was a four-term president, the only president in American history who actually served more than two terms. So there is no three when he was the king he was he was the King. How did that happen? How did he get away with three terms? Um I think it's a sign of the times. I mean he was elected well there's isn't there an there's an amendment now, right? Yeah, that was that was a direct response to FDR. Gotcha. Um FDR was elected in 1932 and and um that was you know the Great Depression started with a crash in 1929 in which um you know Hoover was president",
            "start": 550.32
        },
        {
            "text": "was that was a direct response to FDR. Gotcha. Um FDR was elected in 1932 and and um that was you know the Great Depression started with a crash in 1929 in which um you know Hoover was president or whatever and that Hoover was voted out. FDR came in and so it's a sign of the times that he was elected. Things started to get a little bit better then they started to get a little bit worse but FDR was the man of the people who tried to fix things by creating governmental programs that I think kind of saddle us and and stuff like that and aren't necessarily um good for us long term such as Social Security but um at the time those programs made sense and made him very popular. Um and then of course the war broke out uh with the Nazis and the Japanese, the Japanese first and the Nazis. Yeah, um starting in 1941 involving us um and we launched ourselves into that war in 42 and so there was just a bunch of situations where you don't want to switch horses Midstream but I think FDR deserves a lot of",
            "start": 593.64
        },
        {
            "text": "in 1941 involving us um and we launched ourselves into that war in 42 and so there was just a bunch of situations where you don't want to switch horses Midstream but I think FDR deserves a lot of respect, a lot of credit because he brought us through those trying times even if some of the things he did I think were detrimental to getting better. Um I think a lot of governmental programs like the New Deal and stuff were good um in premise but actually extended the depression by making people government instead of letting the market kind of crack itself. U but FDR also vanquished for the Japanese uh almost Truman is obviously the one that dropped the bombs um and he vanquished uh the Nazis too. So I mean he he he deserves a lot of credit. FDR is a wartime president and and frankly he should be a hero to both sides. Okay , there you go. Both sides get it together. Um number seven, this going to be a long conversation. Yeah, if you want to start shortening them up, I won't stop you but I don't mind",
            "start": 633.4
        },
        {
            "text": "a hero to both sides. Okay, there you go. Both sides get it together . Um number seven, this going to be a long conversation. Yeah, if you want to start shortening them up, I won't stop you but I don't mind either way. Sorry, I'm going to I'm going to write you going to write the other numbers too to get numb down here . Let's see. Let's do um well like this you've already picked number one. Number one set you have your number one. Oh, you have your number two too. There's a lot going on over here ladies and gentlemen you in for some treats coming up. This is very unofficial . I mean I I need to Colin Moriarty's unofficial top 10 president. I need I need to think more about these if I was really going to do what do you mean this is great you're doing fine don't like this I'm sure you're in the shower shampooing up your hair thinking about this. I am I'm always in the shower shampoo. All right, so we're at number seven number I would say number seven is Reagan. Um I really love Ronald Reagan. I think he he exerted a",
            "start": 673.92
        },
        {
            "text": "your hair thinking about this. I am I'm always in the shower shampoo. All right, so we're at number seven number I would say number seven is Reagan. Um I really love Ronald Reagan. I think he he exerted a lot of strength um but also knew how to play his cards well and I think that even though he was you know he was president during some you know again unsav ory things happening especially in Central America um the Iran Contra Scandal for um there was some things that he did that were good too. I mean we were we were suffering from a general economic Malay in the late'70s during Carter and early'80s. The'80s were a boom time in the United States. He was the president for most of that until'88 when his Vice President Bush was elected. I think Reagan um exerted powerful foreign policy and and should be credited with bringing the Soviet Union down even though the Soviet Union was kind of crumbling under its own weight. I mean he was the one who told him to tear down this wall and Berlin for",
            "start": 715.96
        },
        {
            "text": "should be credited with bringing the Soviet Union down even though the Soviet Union was kind of crumbling under its own weight. I mean he was the one who told him to tear down this wall and Berlin for instance infamously told him to te on that not infamously famously . Infamously it was a it was it wasn't Infamous it was if you're one of those people yeah you like the wall INF oh yeah there was a lot of people that liked the wall when they were in they East Germany that was that was very popular amongst Germans. All right, uh number number six is Thomas Jefferson. Thomas Jefferson. Uh Thomas Jefferson um is an interesting man because he's an interesting man for a lot of reasons much like Ulysses Grant. I think when he became president much of what Jefferson did um happened before he was president that I think was interesting and even though Jefferson had an interesting presidency I think to ignore um his his influence on American politics generally and and the course of American history in the",
            "start": 758.04
        },
        {
            "text": "I think was interesting and even though Jefferson had an interesting presidency I think to ignore um his his influence on American politics generally and and the course of American history in the 18th and early 19th century is is a fallacy and even though John Adams isn't on this list one of the fascinating things that one of the fascinating things that people should look into is the feud between John Adams and Thomas Jefferson that really kind of started During the Revolution and then um really got heated during the presidential election when Jefferson was elected um over Adams and how they had this Feud going forever but once they were old men they um started to talk to each other again um and and exchanged a lot of letters and a lot of affections with each other or whatever and then they died on the same day July 4th, 1826 I believe creepy uh number five number five on Colin's top 10 list of President he used to be my favorite President but I I I've soured on him a little bit he",
            "start": 797.92
        },
        {
            "text": "they died on the same day July 4th, 1826 I believe creepy uh number five number five on Colin's top 10 list of President he used to be my favorite President but I I I've soured on him a little bit he used to be your favorite president dropped to five that's a big fall um when I was a young kid Teddy Roosevelt number five um creator of the teddy bear yes not really the creator of the teddy bear but named after Teddy Roosevelt. Um I like Mick first Teddy Teddy Roosevelt's interesting because he you know he's a Republican but Teddy Roosevelt is really one of the first environmentalists and one of the first people that kind of crossed over conservatism and liberalism generally I think and so you know he believed in a strong foreign policy he even fought in the Spanish American war um in 1898 to kind of get his own uh military credentials as it were and uh the Rough Riders come from this um but but but Teddy Roosevelt strikes a cord with me because like we talked about Republicans that kind of",
            "start": 842.52
        },
        {
            "text": "kind of get his own uh military credentials as it were and uh the Rough Riders come from this um but but but Teddy Roosevelt strikes a cord with me because like we talked about Republicans that kind of hold their party line very strictly and I don't in the sense that I believe that we should care for our environment not necessarily go overboard with like we can't drill oil and we can't **** with the shell here and all this stuff I I don't get I don't get crazy let's not build this pipeline because this species of fish might be kill like all right enough but you know he was a guy that was like we should preserve land we should care about the environment do all those things I think it was very bold movie the term Progressive is associated with liberals today but really the term Progressive was also ass associated with a republican to Roosevelt um and I think that that's really interesting it is worth noting of course though that the first national park was uh Ulysses Grant actually was the",
            "start": 893.2
        },
        {
            "text": "was also ass associated with a republican to Roosevelt um and I think that that's really interesting it is worth noting of course though that the first national park was uh Ulysses Grant actually was the first person that Den noted to the National Park not Teddy Roosevelt. Gotcha. Uh number four would be Abraham Lincoln. I know I know you brought up he's a son of your state of Illinois and and uh Lincoln is great for obvious reasons now Lincoln you know should not get all the credit in the world he did bend and break a lot of rules um during the Civil War but the Civil War was a trying time and um people ignored that the states had already start started to leave when he was elected but before he was sworn in so he really can't be blamed for the situation in which he was brought brought in under kind of like Obama. Yeah, it's kind of like Obama sure. Um but yeah Lincoln I mean preserved the union um and he did what he had to do. Yeah, and I'm always interested in the course of American history as we",
            "start": 935.0
        },
        {
            "text": "of like Obama. Yeah, it's kind of like Obama sure. Um but yeah Lincoln I mean preserved the union um and he did what he had to do. Yeah, and I'm always interested in the course of American history as we kind of go through this Firestorm of presidents here we're not really spending any time on them so move on but I will say uh Lincoln's interesting in the sense that if if John Wilkes Booth didn't kill him in 1865 right after the war what kind of President would he have been in the Reconstruction Era and the postwar era how many terms would have he even gotten elected I I often think about that with Lincoln because he was just reelected then we got Andrew Johnson which was a whole disaster in its own right. Gotcha. Number three, James Madison. James Madison. Now James Madison is interesting because he's the father of the Constitution of course but also um one of my favorite stories about Madison is um about the War of 1812. The War of 1812 was fought during Madison's presidency and he was kind of um",
            "start": 971.84
        },
        {
            "text": "the father of the Constitution of course but also um one of my favorite stories about Madison is um about the War of 1812. The War of 1812 was fought during Madison's presidency and he was kind of um brought under the control of the Hawks in the in the house and the Senate that wanted to fight this war with Britain um and they invaded Canada and all this crazy **** and and as a result in 1814 our Capital got burned down um and a lot of people don't know that you can still see the burn marks on the White House today um when they stripped the pain in certain places um from the burn marks when the British burn the house down and my favorite story about James Madison um and of course he did a lot of great things when he was president but the great story about him is that he refused to leave the White House when the British were storming um Washington and and The Story Goes that as the red coat were coming in the front door he left out the back door um so they were like really close to the",
            "start": 1013.04
        },
        {
            "text": "White House when the British were storming um Washington and and The Story Goes that as the red coat were coming in the front door he left out the back door um so they were like really close to the British were really close to capturing the American president um which is really wild when you think about that's never even come close to happening ever except for that really that one time um and I think that's pretty fascinating stuff and of course that's also when his wife Dolly Madison cut out with a knife the picture the famous portrait sort of washed him that's why the corner gone right yeah and then she rolled it up and left so a lot of interesting stuff about the Madison. Number two is Andrew Jackson. Oh, Mr. $20 bill, the saw book. Andrew Jackson's interesting. Andrew Jackson's a **** nut job and that's and that's like why I mean what does he what did he do? First of all, I suggest everyone read a book called American Lion that's all about Andrew Jackson's absolutely fasing uh reading",
            "start": 1052.72
        },
        {
            "text": "job and that's and that's like why I mean what does he what did he do? First of all, I suggest everyone read a book called American Lion that's all about Andrew Jackson's absolutely fasing uh reading about Andrew Jackson but there are so many awesome stories about Andrew Jackson it's hard to even know where to begin and where to end. Okay, when Andrew Jackson was 13 years old um during the beginning of the Revolution uh he was captured by a British officer and the British officer um asked him to clean his boots and you know it's like a sign of disrespect whatever and Andrew Jackson refused um and the officers cut him with a like a cutless in his face and that's why he had a scar on his face um but as he got older he became a hero obviously in 18 of 1812 and specifically in the Battle of New Orleans. The interesting thing about the Battle of New Orleans which happened in 1815 was that the war was already over but the word hadn't gotten to them yet so they still fought each other in this",
            "start": 1092.56
        },
        {
            "text": "Orleans. The interesting thing about the Battle of New Orleans which happened in 1815 was that the war was already over but the word hadn't gotten to them yet so they still fought each other in this battle that really ended up meaning nothing at all but Jackson helped hold New Orleans from uh British attack and there's just a lot of great stories about him in the frontier and dealing with people he Mur like Andrew Jackson murdered people like in duels like he murdered people like we we know that about Andrew Jackson you know and and he just got away with it like Andrew Jackson just got away with whatever he wanted to get away with and in a there's also a famous story about him getting shot in a duel in the chest and then blowing the dude's head off after he got shot and then he had this bullet in his chest for years and he got it removed when he was an old man so Andrew Jackson's just **** crazy also there's another great story about Andrew Jackson about he used to let people into",
            "start": 1140.28
        },
        {
            "text": "bullet in his chest for years and he got it removed when he was an old man so Andrew Jackson's just **** crazy also there's another great story about Andrew Jackson about he used to let people into the White House a lot of presidents used to for parties and stuff like that and a dude walked up to him an assassin walked up to him and tried to kill him and had two pistols and both the pistols jammed and Andrew Jackson beat the **** out of him with his own hands that's awesome until like people had to pull as the President of United States he was doing this to this this guy I like this Andrew Jackson's **** awesome I me Andrew Jackson is also responsible for the Trail of Tears so we have to kind of sure that's why he's not number one but number one on K's top 10 list of presidents George Washington number one Mr one what's Mr one it is that's what they call them I think right what's interesting about George Washington is is there's so I mean there's **** million things interesting",
            "start": 1178.24
        },
        {
            "text": "Washington number one Mr one what's Mr one it is that's what they call them I think right what's interesting about George Washington is is there's so I mean there's **** million things interesting about George Washington but one of the best stories about Washington I'll leave you with and people can read about Washington himself about how he wanted to Rish power he never wanted power he was a man that we should really respect in that you know in that way he could have had anything he wanted and he didn't want to be president they elected him president and then he didn't want to be reelected and they re elected him and he served and then he wanted to go back to his house but if you read about the Whiskey Rebellion which happened in 1795 that was basically the first that was it was an internal Rebellion uh right after Washington became president and George Washington not being an armchair General rode at the front of the column that would go and fight and put down the Rebellion so if",
            "start": 1210.92
        },
        {
            "text": "Rebellion uh right after Washington became president and George Washington not being an armchair General rode at the front of the column that would go and fight and put down the Rebellion so if you could imagine a sitting president fighting in a battle that is what George Washington did . Interesting. Um so he's just an interesting dude and obviously he's our first president he sent he set the two-term president for instance and stuff like that so um for many other reasons George Washington would be number one. All right, that's it. All right, well there you go. Uh thank you so much that was a great one though. Thank you very much Chris Derby for subing your topic of course ladies and gentlemen if you want to be part of the conversation with Colin leave your suggestion Below in the comments we will pull from those put them in the random topic pile Colin won't know them until they get them right now um we had some fun today Colin yes if you had fun make sure you like the video subscribe to us",
            "start": 1249.12
        },
        {
            "text": "pull from those put them in the random topic pile Colin won't know them until they get them right now um we had some fun today Colin yes if you had fun make sure you like the video subscribe to us here on YouTube share it with your friends so they can see how crazy calor already is until then we will be back every Tuesday and Thursday I hope you have a conversational day but like if someone took a shot at Wing grety Mar maor would punch you in your face",
            "start": 1287.16
        }
    ]
}