{
    "id": 2488,
    "video_id": "gB0b4aSbnq4",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Jeff Cannata"
    ],
    "title": "Jeff Cannata (Special Guest) - The GameOverGreggy Show Ep. 171",
    "description": "Special guest Jeff Cannata joins us to discuss being a dad, Anthony Carboni, people we want to be friends with, and hidden talents. (Released first to Patreon Supporters on 03.10.17)\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1489734004,
    "duration": 5821,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to the GameOverGreggy Show I'm one of your hosts Greg Miller alongside the producer Nick Scarpino I'm sorry it's not my name anymore Greg they call me the champion now sweet subtle lean there it was right in Arm's Reach right where you want it uh if you're listening to the audio version Nick is holding up the Kinda Funny Nintendo World Championship which he beat me for yesterday in a game of 1-2-Switch uh Zen which is basically yoga he beat you in Zen I should have I I made that's the Pure One Tim Gettys hello let him most uh this is our special guest Jeff Cannata hey hey Jeff how are you thanks for thanks for inviting me here this is lovely oh thank you because you're a special guest you may touch the belt get away from this is this is an amazing piece of Hardware what this is for je I've always been the Nintendo World Champion here now Tim had the title for an embarrassingly short like 15sec Title reign at Sydney I give myself",
            "start": 2.85
        },
        {
            "text": "Is an amazing piece of hardware, what this is for. I've always been the Nintendo World Champion here now Tim had the title for an embarrassingly short like 15-second title reign at Sydney. I give myself at least 25 seconds on that and then I made the mistake of saying I needed challengers on The Morning Show so I challenged Nick to see if he wanted to challenge me, and then I said you could pick the one-two Switch game, and I thought we'd do the Milking Game, I thought we'd do something, and he immediately stopped on the Yoga One, and I forgot that he does yoga. Am I allowed to point out that you're judging all of Nintendo World Championship based on one Switch? Is that well, we it's rotating, it's gone up in Mario Kart; there was multiple back-and-forth with some Mario Kart 8. No, there's never there's no back and forth, I always had it through that. I guess you're well, let's play live, I don't remember exactly what happened, you were going to win but then I spit peppers.",
            "start": 54.92
        },
        {
            "text": "no there's never there's no back and forth I always had it through that I guess you're well let's play live I don't remember exactly what happened there you were going to win but then I spit peppers on Kevin and stuff and like got win how like strategy I'm doing good doing good guys Jeff if people don't know you what's the what's the elevator pitch for Jeff Cannata oh elevator pitch um well I started out as a child um this is a long elevator ride right we're going up 400 floor uh no um totally rad show maybe from the from the old days uh I do a few shows now including uh DLC on the 5x5 Network I do the SL Filmcast Filmcast Docomo uh we have concerns with Anthony Carboni don't like that guy never heard of yeah no I don't either and also wish I hadn't yeah well we're happy to have you you're it's one of those you've been one of the most requested guests I think is that so yeah people are always trying to get us together delighted to hear that yeah no and it's funny like I I I we'd been",
            "start": 99.48
        },
        {
            "text": "It's one of those you've been one of the most requested guests, I think that's so yeah people are always trying to get us together. Delighted to hear that, yeah no and it's funny like I I I we'd been obviously in the same ecosystem forever but I felt like I never really hung out with you. We met in passing this that and the other until I went down to do we have concerns with you and Anthony which was an awesome episode if people haven't heard that you did actually two episodes with us, a regular episode and then we did a a fun sort of looking into you and your life and you got really you were really honest about some really cool stuff and it was an amazing episode. I was really touched by that, thank you so much yeah I was I was blown away by when I went down there how good you guys were if that makes sense like it does surprise people well it's just the way of like when we do this I mean like I think for us we're together and we do so many shows together you don't think about how",
            "start": 146.92
        },
        {
            "text": "if that makes sense like it does surprise people well it's just the way of like when we do this I mean like I think for us we're together and we do so many shows together you don't think about how all right it's we're going live and you turn it on and do that thing and even when we turn it on that means Nick is going to say butthole he's going to be gross he's going to reference Colin's Mom I'm sorry again you need to refer to me as either champ I have to call you every time the champion so I can't say just Nick anymore the champion if you were in a formal circumstance you have it's it's like the uses you know what I mean sure it's the I hate you but it's just us cranked up whereas you guys got like really professional in like terms of like your Rhythm and everything else you guys were Dynamite you're awesome thanks yeah no I appreciate it I I think that's the weird thing is I think you guys probably have experienced this that you you can like find people where you just that just",
            "start": 180.0
        },
        {
            "text": "Dynamite, you're awesome, thanks, yeah, no, I appreciate it. I think that's the weird thing is I think you guys probably have experienced this that you you can like find people where you just that just happens, you know what I mean? There's people you have the right same rhythms with and Anthony and I found that like the first time we did a show together and it's cool when you find those people in the world. You definitely yeah, I think they call that chemistry. Ah, that's what they call... they got chemistry one now, champ. Before before we go any further into this episode, I feel like we need to address the other elephant in the room, Kevin. No, no, Kevin's more... what wait, what was he? Wasn't that his spirit animal on Hunter Penn's wedding? They yeah, the less formal version of that is... SE. Yeah, what's uh uh, we talked about this earlier just the fact that it we're wearing the exact same shirt and we're sitting next to each other. They say if you can't be it, you God damn it, if you didn't",
            "start": 222.08
        },
        {
            "text": "yeah what's uh uh we talked about this earlier just the fact that it we're wearing the exact same shirt and we're sitting next to each other they say if you can't be it you God damn it if you didn't know this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bringing a random topic discussion for your amusement if you like that head over to patreon.com kindof funny where you can get every episode early along with a bunch of exclusive forgot about that I thought you were laughing about Kevin like **** shredding a box over there in the intro that box that's just white noise at this point I don't see that anymore no yeah hear they can hear it we can hear it yeah you guys got it though I had it yeah but then me and Nick just started busting up I'm sorry me and the champion start busting up thank you for Christ's sake I didn't work this hard to get it's going to take a while for you get get the early episodes get a bunch of perks",
            "start": 265.76
        },
        {
            "text": "busting up I'm sorry me and the champion start busting up thank you for Christ's sake I didn't work this hard to get it's going to take a while for you get get the early episodes get a bunch of perks and goodies and awesome things just like our Patreon producer Salem Elgam did thank you for your support over there once again coming through yeah the homie as Tim would say the homie how how close to your name do you think you're his name do you think you're getting we're not cuz there was a show where I played him off of DM saying his name and it wasn't how we say it but now that's his name okay how much how much money does he have to donate to get his name right don't worry about it don't if you got no money to donate no big deal you can go to youtube.com/ kindafunny where we put the show up topic by topic day by day until it goes up as one big MP3 and video the following Friday Jeff Cannata yes as the special guest we start with you oh boy boy what would you like to talk about",
            "start": 309.08
        },
        {
            "text": "show up topic by topic day by day until it goes up as one big MP3 and video the following Friday Jeff Cannata yes as the special guest we start with you oh boy boy what would you like to talk about pressure uh you know I don't know you guys kind of stumped me and I and then I was thinking I could talk about being a dad cuz that's new in my life new is it well that we know of Nick why you all right Fair does he have to he he can call you Nick he I have to Call's on my training team like he's in my corner he's my cut man that's my that's my he's actually my my cut we're in stable together we're like Tag Team champ so you're able to use the two yeah I got the two gotus the two how how how recent is this fatherhood uh in four days my son will be six months old oh wow so it's pretty recent super Super Fresh Super Fresh that's what we call him we call them little Super Fresh oh you're still hot out of the oven um yeah no it's amazing um and and the weird thing is I was never one",
            "start": 348.44
        },
        {
            "text": "recent super Super Fresh, that's what we call him, we call them little Super Fresh. Oh, you're still hot out of the oven. Um, yeah, no, it's amazing. And and the weird thing is I was never one of those guys that was like \"I'm gonna be a dad someday.\" I'm definitely going to be a dad someday. I was never sure that's what my life was going to hold so you weren't were you against it ever or was it just... I mean, my mom literally thought I was never going to be a dad only because I would always say \"I'm never gonna be a dad.\" That that's well, that's but you gotta like let expectations be low, you know? Set them low and then and then you know Mom will be kind of funny. We know all about setting them right. Oh yeah no but I've I've had that conversation by the way because we don't have kids either. I've been married for 5 years now and so it there's that weird point where you're like, \"You know, we're not thinking about kids\" and your mom's like, \"It gets more intense at every time you have that.\"",
            "start": 396.24
        },
        {
            "text": "either I've been married for 5 years now and so it's that weird point where you're like, you know, we're not thinking about kids and your mom's like \"it gets more intense at every time you have that conversation\". You have siblings. I have a brother; does he have any kids? No. See, I had the sister who took the pressure off a little bit - my niece, which was nice. Um, but my mom has these friends, like seven of them, that she's had since she was in high school. It's amazing; they meet every year. They've been meeting together for 60 years; it's like it's insane! That's awesome, yeah. All they're amazing; they're like best friends. And um, they all had obviously all had kids many, many kids. And uh, there were only two that hadn't gotten married and had kids: one was me, and the other was gay. So it was like I was...I was questioned, yeah. Probably a lot of them really liked Henley, yeah, yeah. So um, so when I finally got married, that was like a big deal. But anyway, I was never that guy.",
            "start": 437.52
        },
        {
            "text": "Gay so it was like I was I was questioning yeah probably a lot of them really good in Henley yeah yeah so um so when I finally happened that was like big big deal but anyway I was never that guy right I was never like I'm it's definitely going to happen I it was never a life goal it was always like well maybe but this is fascinating for me because I'm I'm I'm in that boat right now where I just like I have friends that have been like it's a foregone conclusion I'm going to be a dad I'm always going to be a dad right I I don't think about it and it's not that I dislike children that much it's just that I just every day wake up and think that's something that you should think is sorely lacking in your life right and I just don't have that I don't have that right um and because I feel like I've seen my friends who kind of like no one will ever say or or admit that they feel obligated to do it right like you're getting married and the woman wants it you're like and then you have the kid",
            "start": 482.84
        },
        {
            "text": "I've seen my friends who kind of like no one will ever say or admit that they feel obligated to do it right, like you're getting married and the woman wants it, you're like, \"And then you have the kid,\" you're like, \"I love this kid; this kid is the most amazing thing.\" They're never going to admit to you that, like, part of them wishes they could just go back to playing video games and eating Taco Bell instead of having real responsibilities. Well, there's part of me that does, you know? I mean, times I... I love my son; I wouldn't trade him for the world, but there are times when it's like, \"My life has changed so much in such a short period of time.\" And yeah, do I want to just sit around and eat Taco Bell and play video games all day? Yeah, I do very much. You know? But um, you know, it's amazing how much the responsibility doesn't feel like responsibility; it's weird. It's a weird thing where I should say step back and just say for a second this conversation is probably going to be...",
            "start": 529.08
        },
        {
            "text": "amazing how much the responsibility doesn't feel like responsibility it's weird it's a weird thing where I should say step back and just say for a second this conversation is probably going to be a lot of cliches because the one thing I found out is all the cliches are true yeah and it's stupid it's stupid because if I was listening to me I would be like H if I hear that heard that a million times the responsibility doesn't feel like responsibility because you're so but it's like no it's true man it's like the the stuff that everybody says it which is you fall in love with this kid and everything is different you looking through the whole world in a completely different prism and I'm crying at Google ads on TV all that stuff that you hear that is a cliche to be fair Greg cries about dropping a dime so I'm a crier I'm a CRI yeah yeah make fun of us now tough guy tough guy tough champ I got to say that apologies can't call you a guy either all right fine um yeah anyway no I",
            "start": 566.72
        },
        {
            "text": "the drop a **** dime so I'm a crier I'm a CRI yeah yeah make fun of us now tough guy tough guy tough champ I got to say that apologies can't call you a guy either all right fine um yeah anyway no I mean it's it it changes when did you know when did you know when you when you were with your wife or when you met your wife or where was that I mean it it was uh I finally did meet someone that I could see having kids with that was like a big change and I knew it was important to her um and that you know was not insignificant but also I had had a lot of long-term relationships that I could not see having a kid in that relationship you know and I always thought like it's that's that's kind of fine right if if that's where I end up and I'm with someone forever and neither of us want to have kids or it just doesn't feel right that's fine that it was never like I said it was never a yearning that you I need a child I need a son yeah how long have you been with your wife before the baby then",
            "start": 618.72
        },
        {
            "text": "Or it just doesn't feel right that's fine that it was never like I said it was never a yearning that you I need a child I need a son yeah how long have you been with your wife before the baby then uh we were married a year and we were dating 3 years or yeah three years before the kid was born so yeah it wasn't we we got it happened pretty quickly um different the time that it happened did you know the time that it happened well we were trying explain to us all the times you've had sex with your wife you know what if easier just to show you um uh no it you know I this is weird I didn't expect to say this but I saw this um Charlie Rose interview years ago like when I was in high school or early college and it was with Norman Mailer and Norman Mailer had this philosophy that like the sexual energy that you H you H you put into the making of a child gets like transferred into the kid and I always thought it was always in the back of my head like if I ever have kids I want it to be \n\nI corrected the following errors:\n\n- \"Norman maor\" → \"Norman Mailer\"\n- Capitalized proper nouns: \"Charlie Rose\", \"Norman Mailer\"",
            "start": 669.68
        },
        {
            "text": "\"Energy that you put into the making of a child gets like transferred into the kid, and I always thought it was always in the back of my head like if I ever have kids, I want it to be awesome, I want it to be like that time - it's we're making a, I'm putting it all in there, like I imagine Tim would be a Disney firework show, electric light comes in. I was always confident, you know, and but then you get you get to the point where you're like you're trying and your wife's like well now is the time where you know it's it when I was a kid I thought if I brushed up against a girl the wrong way without a condom on baby happens. Which is like it's really hard to get a baby to come in there to arrive in there, it's not easy, there's only a very short window. How long were you trying? Uh, we weren't trying super, I mean, I just say no, it was um, we weren't trying very long but it was like you know she was aware of like here's our\"",
            "start": 717.84
        },
        {
            "text": "you trying uh we were we weren't trying super hard I mean it was you know these can't achieve just say no it was um we weren't trying very long but it was like you know she was aware of like here's our window and and she goes you know like okay Now's the Time I'm like I'm not going to just like do it to do we got to the energy has to be right man let let me get these candles lit let me get the candles lit firstly yeah let me get the music started she's like it's click time is going no but I've had friends like that and obviously like guys are guys like we're all macho and stuff but some of my friends are like it's it's to a point where I do at some point like feel a little bit like I'm just like they called an Uber and I showed up and you're over yeah longer than a few months yeah and if yes because uh that's the thing you don't realize when you're young and you're terrified of you know babies yeah and legitimately so like I'm glad I was cuz I you know was very safe but what you",
            "start": 765.6
        },
        {
            "text": "yes because uh that's the thing you don't realize when you're young and you're terrified of you know babies yeah and legitimately so like I'm glad I was cuz I you know was very safe but what you the the big lie is like it can happen anytime you know because it can't happen anytime but having said that I'm really glad I you know I wouldn't so you're saying everybody can just use condoms right now but it's like there's a very small window when it actually can make a baby you know but yeah but for kids obviously they're dumb right as am I yeah well the the irony is that that small window is the exact time when the girl is like most ready to go cuz like science and nature is telling her do this yeah so so that's why it happens tends to happen but you know it's not it's not a foregone conclusion was going to happen anyway so we were trying and uh um I still you know this it's it's really scary you know and your wife is pregnant and and you're like I'm constantly wondering about how",
            "start": 816.24
        },
        {
            "text": "was going to happen anyway so we were trying and uh um I still you know this it's it's really scary you know and your wife is pregnant and and you're like I'm constantly wondering about how the world is going to change how my world is going to change and you know we're guys that play video games for a living right it's it's not um exactly dad material traditionally and it's not exactly a lifestyle that's conducive to raising a kid um I mean maybe it is I don't know I'm going to find out but thanks for testing the waters first I like it is though cuz I feel I mean I don't know how you guys' parents were but like my parents generation was like my mom basically took care of us and my dad worked 24/7 right and like when he'd come home from work he would eat like change eat dinner with us and then go up to the office the office and work more right and so I feel like it can't possibly be a bad thing that your dad's really into video games and like loves that it loves nerd culture and like",
            "start": 868.12
        },
        {
            "text": "then go up to the office, The Office, and work more right and so I feel like it can't possibly be a bad thing that your dad's really into video games and likes loves nerd culture and likes loves movies and loves all these things that like you're probably going to be addicted to when well here's what I've been thinking about that it's funny I've had this conversation a couple times with my friends my Dad loved cars, loved working on cars he was a child of the 50s go out to the workshop build a car look in the magazine at the sweet ass cars that I couldn't give less of a **** about cars I do not like cars I'm not into cars my dad so often when I was growing up come out to the garage we'll work on the car every Saturday my dad's like I want to go cut the grass you want to come out there you want to Tinker with this no I don't do anything that I here play this nothing sounds less fun to me yeah so My worry is that like it's all going to come around and I'm going to be",
            "start": 912.32
        },
        {
            "text": "come out there you want to tinker with this no I don't do anything that I hear play this nothing sounds less fun to me yeah so my worry is that like it's all going to come around and I'm going to be like kid going to be like can I get a can I yeah and he's going to be like no dad no I'm fixing my brakes right now yeah exactly I don't know see for me I had the same experience my dad was one of those guys that like never like it broke his heart if he had to take the car and just get serviced cuz he felt like he could do it himself right mine too and so he would always but the the the draw for me was always or like the the the line I had to draw on the S was always like if it involved physical exertion I didn't want to do it and so the car was always like I have to listen to my dad talk I have to get under a car there has to be some jacking that's happening I'm going to get dirty I don't want any of this I feel like it's us love jacking I mean every day it gets dirty it gets dirty",
            "start": 954.44
        },
        {
            "text": "I have to get under a car, there has to be some jacking that's happening. I'm going to get dirty; I don't want any of this. I feel like it's us loving jacking. I mean every day it gets dirty, it gets dirty, but I... I feel like it's an easier sell to kids these days: you're like, \"You get to stay indoors, it's air-conditioned, you can drink and eat at the same time.\" The laziness, yeah, I mean it's relaxing. What I tell myself is to try to be cuz that is my nightmare: that I'm gonna have a kid and... yeah, they're going to be a lawyer; let's go play soccer; let's do all this stuff. A **** man, God damn it. Where am I going wrong? I... and I... can't speak for you, but I can speak for my own father, who was like that. But like my dad was like he was a great dad still is a great dad. Uh, but I mean like he wasn't like, \"Let's talk about our feelings\" or any of that stuff, and blah blah blah. And I feel like I'm going to be so much more of a friendly father than like my father who was the father... you know what I mean? And my mom was my mom is the",
            "start": 988.68
        },
        {
            "text": "or any of that stuff and blah BL blah and I feel like I'm going to be so much more of a friendly father than like my father who was the father, you know what I mean. My mom was my mom is the one who we did hang out and we would go, you know, bless her heart, she'd drive me all over goddamn DuPage County looking for Justice League action figures, you know what I mean? Like, I was like, and that was like, she didn't care but she was interested in hanging out with me and doing that. Play my mom would stand in line at comic conventions and like flirt with uh, you know, Todd McFarlane and Rob Liefeld, and get you know, get an autograph on a thing, and they're like, \"She's like, it's for my kid,\" and they're like, oh. That was the thing where Comic-Con, like that one thing where me and my father I think really came together in terms of interest was he was a collector still is collects all these antique bottles and Coke memorabilia, and so when I fell in love with comics, you know, he would take me to",
            "start": 1025.6
        },
        {
            "text": "really came together in terms of interest was he was a collector still is collects all these antique bottles and Coca-Cola memorabilia and so when I fell in love with comics, you know he would take me to the comic shop and then every year when Comic-Con, which became Wizard World, would come around, which became C2E2, we would go to it and he would just for hours walk with me and like he's got no interest in any of these comics but he was excited to see me collecting and trying to find different things yeah where my dad and I finally connected was was with computers cuz it he was an engineer as well and a and a big nerd but I think his my version of under the hood was under the hood on a computer you know like I and we bonded there like I wanted to put together a PC and I wanted to I taught myself basic and I wanted you know that was where I nerded out and he he and I would go to um you know Bay Area uh swap meets with you know the old the old computer fairs you know yeah and I would you know",
            "start": 1066.12
        },
        {
            "text": "basic and I wanted you to know that was where I nerded out and he he and I would go to um you know Bay Area uh swap meets with you know the old the old computer fairs you know yeah and I would you know thumb through all the shareware titles and get all excited and we'd look at you know all the new know I'd save up for a a CGA video card I mean I'm a little older than you guys but uh yeah that's that's where we bonded it was like my version of working on a car was was computers you know now here's something I I've been kicking around and I want to know where you come down on this and I guess for your background I'm very similar to you in the way of like I was with Nick forever of like I'm not having kids I'm never having kids like this is I you ever see the movie Family Man with Nicolas Cage sure yeah I remember that I remember watching that in high school and like when he like if you don't remember it he's like Super Rich has a great car this girl shows up in like later",
            "start": 1106.8
        },
        {
            "text": "Cage sure, yeah, I remember that. I remember watching that in high school, and like when he... if you don't remember it, he's like \"Super Rich\" has a great car, this girl shows up in like \"The Leopard\" to **** him, but then he gets like knocked on the head and he you know dreams the whole life he would have had with Sergio Leone if he never left, and then he wakes up and that woman's back of the door. I'm like, don't leave, like what are you doing? Like you can't, and I was like, I'm never having kids based on that movie. That was the story that was what I took away: I'm like, I don't want to do that at all, never. Based your life on anything like any movie that Sergio Leone was in - that's awesome. I thought you were going to go with Nick Cage, cuz that's the champ over here, bases his life on The Rock, you don't have to worry about that. But then it was that... you know, I met my current girlfriend Jen or whatever, and like on that first date she said \"I believe in love\" and he's like yeah, you know, maybe I want to have",
            "start": 1149.12
        },
        {
            "text": "about that but then it was that you know I met my current girlfriend Jen or whatever and like on that first date she said you know BL and he like yeah you know I think you know maybe I want to have two kids or whatever and I remember my head going okay and then I was and then in my own head I'm like wait what like wait amazing when you meet the right person right right exactly and that's what I've I came you know the next a few days came to grips with thinking about it was the fact that I guess I not you know no not no offense to my other long-term relationship so just like that wasn't where I should have a kid and this woman is who I should have a kid with and that's what this relationship is and so now it is that thing though where and I granted we live in small San Francisco apartments but now to the point where I and I don't know how far out kids are or whatever but like when I'm in Target or something and I see really cool like Legos and stuff I'm like should I buy this and start",
            "start": 1181.96
        },
        {
            "text": "but now to the point where I and I don't know how far out kids are or whatever but like when I'm in Target or something and I see really cool like Legos and stuff I'm like should I buy this and start storing like the cool Superman stuff cuz I tell you what I I was back in I was in back in Missouri years ago it will be there when kid I was there back in Missouri years ago and with my one of my best friends from college who's you know family and she has now three children but at the time too they are these kids let's go play sports let's get who wants to go in the back and throw baseballs at me I'm like I brought a Vita don't you want would you like to see would you like to would you like to see freedom in their defense you brought a Vita hey  but we went to this we went to the Walmart like you know it's a spring Walmart that we don't get to see here anymore and like we're walking down they wanted to go look at baseball bats my friend and we're walking and then we cut down one",
            "start": 1214.84
        },
        {
            "text": "Walmart, like you know it's a spring Walmart that we don't get to see here anymore, and like we're walking down they wanted to go look at baseball bats my friend and we're walking and then we cut down one of the toy aisles and it was I stopped and looked at it and it was my dream when I was a child - it was like not Fisher-Price but like those like smaller kid toys, you know what I mean, those middle ranges. And it was every DC character, and I'm talking like super, like Anti-Monitor and stuff. I'm like this is like... I remember I will never forget Tim, yeah, in this issue of Superman when he still had long hair after the death right, he was fighting somebody and they broke through the wall and there was all these Superman toys on the wall. I was like that's the world I want to live in; I don't care that I might get crushed by a monster smashing into the toy store but I want that. And then to see that... I was like, and I haven't seen that display since. I'm like, I should have bought",
            "start": 1256.52
        },
        {
            "text": "that I might get crushed by a monster smashing into the toy store but I want that and then to see that I was like **** and I haven't seen that display since I'm like **** I should have bought them all I should have bought them all right there and just had them oh my God have we mentioned how Kevin's hair kind of looks like Superman yeah when he came back yeah yeah well I mean it there was that death of like when when Superman came back I want to see Kevin do a **** jacked up cosplay of yeah he does have but I mean I mean if we're talking about people who look like things MH yeah oh here we go sorry about this Jeff like I mean sweet Jesus I mean it's even wearing the same **** I did not do that on this it's the wedding ring it's the 5:00 shadow I swear to God I know Shir for that reason that is really lening at home he's holding up a statue of Nathan I'm holding on my the Uncharted 4 Nathan Drake awesome weird I forget you've done did you do cosplay or Halloween I costume",
            "start": 1291.52
        },
        {
            "text": "\"Reason that is really leaning at home he's holding up a statue of Nathan Drake. I'm holding on my Uncharted 4 Nathan Drake, awesome weird. I forget, you've done did you do cosplay or Halloween costume a while back? Yeah, yeah, no, awesome. Thank you, no problem. You get that away from my belt, thank you. Sorry, CH don't let it happen again. So then what's been? I know Kevin's yelling so I'm yelling cuz Kevin will yell and I'm not by the microphone so what? So I mean six months in like yeah um it's been awesome. I mean it is it is a complete life change right? I I I tell people that I realize where the term babysitting comes from because that's all you're doing with a baby, you're sitting. That's all I spend hours just I'm sitting right now what am I doing I can't do anything else I'm just sitting and making sure it's not dead you know but um he's awesome dude and I've become that guy that I hate uh I'm sure you guys have all been with with people that have kids where like you're in a conversation with them\"",
            "start": 1337.92
        },
        {
            "text": "it's not dead you know but um he's awesome dude and I've become that guy that I hate uh I'm sure you guys have all been with with people that have kids where like you're in a conversation with them and they're like yeah stop it I'll go over there in a second and I'll get you know they're like half in the conversation with you and half not and I always bug the **** out of me I do that I'm the guy where where I'm like oh I got pictures do you want to see pictures of my kid I got how Instagram changed oh it I'm sure I've lost many many Instagram followers cuz it's like all my kid now but in my defense he's adorable I mean he's adorable uh and and it's it's it's awesome the thing the biggest thing that surprised me is that I thought okay but when he he when he can talk and we can have conversations and I can show him video games and comic books and stuff it's going to be great like I'm looking forward to that it's going to be awesome but until then probably going to be bored probably going to",
            "start": 1387.76
        },
        {
            "text": "and I can show him video games and comic books and stuff it's going to be great like I'm really looking forward to that, it's going to be awesome but until then probably going to be bored, probably going to be like not the case at all, like the thing that surprised me is how much fun he is before he can communicate you know before we can have a conversation because he's still got personality I can still make him giggle and laugh and he's still doing stuff and figuring out his hands and figuring out the world and I mean I know you guys have heard all these cliches before, you know watching a kid like discover the world in front of you but it it it is really incredible, it is really an incredible thing and I've become that guy I never thought I would be that just like wants to hang out with my kid like I'm here at GDC this week I miss my kid yeah you know I truly miss him I like I want to go and hang out with him um what's his name Jack oo yeah Jeff and Jack I like that that' be great what's",
            "start": 1440.6
        },
        {
            "text": "like I'm here at GDC this week, I miss my kid, yeah, you know, I truly miss him. I like, I want to go and hang out with him, um, what's his name, Jack? Oh, yeah, Jeff and Jack, that'd be great. What's his name; he's like, can't remember, I'm not clear on the anyway... So are you still on the stage where, like, you talk to new parents and they all eventually turn that corner where it goes from everything that's happening, they're on pins and needles, they're terrified, oh, they're checking if he's in the breathing in the crib, and all stuff is it well, it's the moment when you buy a new phone and you don't want to rip off the thing yet 'cause it's like it's so new exactly that's exactly like raising a kid. Definitely like super I actually installed a new app on him, and he is so much cooler now, update pretty dope, yeah, um, yeah, no definitely it has it has there were I can't even tell you how many times I checked to see if he was breathing like first month, you know well your nightmare is is",
            "start": 1484.76
        },
        {
            "text": "pretty dope yeah um yeah no definitely it has it has there were I cant even tell you how many times I checked to see if he was breathing like first month you know well you your nightmare is is that you did something and or you werent looking at the right moment but yeah I mean Ive chilled a little bit theres he still sleeps in the same bed in the same room with us not in the same bed but in the same room with us um so you know were not completely ready to yeah you know but give him his own apartment or anything I mean if if he could afford it and this is economy but uh you know you got to get that job get that jobby job um yeah but you know got figure out his hands work first and then he get that job yeah well you know come on buddy tick Tok tick Tok thats what I said time is money um yeah no its its changed a little bit I definitely theres another thing too which I maybe you guys can relate to is um my sister had kids and Ive had friends that have kids and theres always",
            "start": 1531.48
        },
        {
            "text": "\"um yeah no it's it's changed a little bit I definitely there's another thing too which I maybe you guys can relate to is um my sister had kids and I've had friends that have kids and there's always been that moment of like you want to hold the baby and I want like no I'm going to break it I'm not I don't know how to do that as soon as I had a kid I was just like scooping him up and um feeling comfortable holding him and are you doing can you do wrestling moves to him yet like you a little bit I can like hold him upside down and he has you know he has the neck strength now to be able to like handle that stuff uh and I'm really excited about you know throwing have you done The Lion King yet have you held him up shut up oh I do dude Superman all over the house man it's super baby and fly he the thing that's crazy babies can like hold their bodies horizontal like very easily they have so small real people what we talk about earlier the proportions are the proportions are all wrong Greg\"",
            "start": 1572.2
        },
        {
            "text": "the thing that's crazy babies can like hold their bodies horizontal like very easily they have so small real people what we talk about earlier the proportions are the proportions are all wrong Greg earlier was talking about fighting babies so just be careful but oh but baby would kick the **** out of me that I believe clearly this Jean Pool well that's awesome man yeah congratulations it's great I recommend it it's a weird thing I it's you know it's not something you'll ever feel ready for as I didn't I didn't even you know as we were like getting close to the day I I was really scared you know I was like oh man I don't know what this is going to be like but it's cool and and the priorities change you know I did I put 45 hours into Horizon Zero Dawn you're damn right I did but I also you know hung out with my kid every night and like you know so sleep is gone gave sleep is gone sleep is pretty much gone but you know I've I was also a guy who loved sleep and now I uh can survive without",
            "start": 1616.44
        },
        {
            "text": "know hung out with my kid every night and like you know so sleep is gone gave sleep is gone sleep is pretty much gone but you know I've I was also a guy who loved sleep and now I uh can survive with less somehow so you love sleep more than anybody I know I love sleep so much I don't loves babies Greg does love babies it's scary it's really scary I'm just pretending that's not a thing until got forced upon me awesome I mean aren we all these these like uh manchild right that like don't want to we don't want to grow up I was I'm right there man right I think all of us are in some way just based on what we do where it's like all we want to do is the things we like to do I hate the responsibility you want to do no that's stupid yeah but we have that luxury now right like we don't have we don't need to like uh repopulate the species we don't need to worry about like our tribe continuing we we can we can just **** do the exact same thing you're doing right now in perpetuity and there's",
            "start": 1663.12
        },
        {
            "text": "need to like uh repopulate the species we don't need to worry about like our tribe continuing we we can we can just **** do the exact same thing you're doing right now in perpetuity and there's zero consequences for it so it's like it is fascinating and I see this a lot too where like especially myself where I'm like if I wasn't like cuz my wife has never wanted kids and I'm okay with that it's kind of the opposite of what you're talking about right where I see myself just living with her and traveling with her for the rest of our lives being totally happy that's a pretty amazing life but like I don't know I do question that some I'm like I'm like what would it be like am I on that line if I met someone that was like I'm super into kids would I be like okay let's do that or would I be like oh no no this is making me totally uncomfortable and and I'd have to like look insidee myself I just don't know do you ever think that there you like wake up and you're 65 and you're like I wish I",
            "start": 1706.52
        },
        {
            "text": "oh no no this is making me totally uncomfortable and and I'd have to like look inside myself I just don't know do you ever think that there you like wake up and you're 65 and you're like I wish I had a kid I wish there was someone there's some part of me that thinks that I will at some point yeah so I the pressure is not here for me cuz I guess you know as guys we don't really ever feel that that pressure of like we need to do this now yeah um but I just always when I look down the road I always assume that I would like and I'm not joking when I say this like adopt or have some other relationship like that in my life I just I don't I just don't think about it there's a part of me that thinks that um you know adults who who don't have kids can live like superhumans cuz you have like all of this disposable income you have complete Freedom you can go anywhere on the drop drop of a hat there's something magical about that you would think though but here's the problem all of your",
            "start": 1741.76
        },
        {
            "text": "all of this disposable income you have complete freedom you can go anywhere on the drop of a hat there's something magical about that you'd think though but here's the problem all of your friends have kids yeah so all the only people you can hang out with is each other and this is what my wife and I are now discovering is that like thank God I have these guys but as soon as these guys start growing up and he doesn't call us in the weekends we don't hang out with him I want he guys hang out a lot but the the uh the that's the thing I wonder is like at 65 and you're having like this Christmas where you're like did you open your present yeah did you open mine yeah and now let's now here's the thing here's the as this here's the here's the flip to it though is the fact that I hear you on that and I understand how that would be a thing and you know when I thought I didn't want kids that was something I would think about but it's also the flip of I feel like I'm a bad",
            "start": 1786.32
        },
        {
            "text": "I hear you on that and I understand how that would be a thing and you know when I thought I didn't want kids that was something I would think about but it's also the flip of I feel like I'm a bad son like I don't go home enough and I wonder if the the life I lead of traveling the world and doing this and being super busy out here and like literally being that song you know what I mean Cats in the Cradle is like is that more painful for on my parents you know what I mean that I'm not there do you want to know how you'll be a way better son sure have kids yeah you will become the best son because a you want the help and be like good visit for a year yeah you become you know there's that there's that thing where you're around your parents where it's like it's awesome for a little while but then at a certain point you're like okay well I've run out of things to do and say and I just I kind of want to just back to my life we're just killing time between meals you know what fills all that",
            "start": 1825.36
        },
        {
            "text": "then at a certain point you're like okay well I've run out of things to do and say and I just I kind of want to just go back to my life we're just killing time between meals you know what fills all that time is being a dad yeah cuz it's just amazing every they're excited to be there you know your parents are excited to have it in in your life you're excited to sort of see them with your kid it's just and there is this wonderful familial thing that happens and you just become a better like I talk to my parents way more now than I ever did interesting interesting now I know we're getting long on this topic but I have one more question for Jeff is was any part of it like at any part did your career or your or like did that play into your mental state of saying like well I haven't like I want to accomplish these things first before I do this because I feel like I get stuck in that rut too where I'm like I have these Grand Ambitions for myself these big goals one day I'm leaving all these losers",
            "start": 1869.0
        },
        {
            "text": "these things first before I do this because I feel like I get stuck in that rut too where I'm like I have these Grand Ambitions for myself these big goals one day I'm going to leave all these losers behind I'm going to take everyone's Nintendo championship belt yeah I was going to throw it but I'm not going no but I always but I do feel that where I'm like I can't even imagine doing the things that we do right now and having a kid like I can barely take care of myself I can barely motivate myself to go do the things that I think I should be doing in life and then I look at my friends that have kids and I'm like I don't know how you do anything I don't know how you even go to work with this kid like I go to my friend's house that has two kids and when one's bouncing up and down trying to launch itself out of the Little Baby Bjorn thing the other one's over there eating wood chips and they're just letting him try to kill himself",
            "start": 1909.56
        },
        {
            "text": "like bouncing up and down trying to like shot catapult itself out of the Little Baby Bouncer thing the other one's over there eating wood chips like and they're just letting him try to kill them, they're literally trying to see what will get a rise out of mom and dad which is weird and I'm like how at the end of the day do you sit down and try to do anything other than just fall asleep, you know yeah I mean I'm just at the very beginning of that and it's really scary like there's so many Netflix shows I'm not watching you know and that's kind of a weird thing and it is true the career I mean I thought by this time in my life I'd be on TV and I studied to be an actor, I am an actor I've acted in things but I always thought my career would be farther along now by this point than it is um and I often wonder what I'm doing with my life and whether it's now in the",
            "start": 1948.0
        },
        {
            "text": "acted in things but I always thought my career would be farther along now by this point than it is um and I you know I I often wonder uh what I'm doing with my life and whether it it's now in the context of like is this going to be good for my kid you know is this is you know so like I mean not to say that your career isn't great but but your priorities now are I just sound like they're kind of they've just shifted 100% And and like I said that's one of those cliches that you hear but it's super true and it it it it's really real like my wife she's not uh she's she has a very stable regular person job you know it's awesome that she gets to work from home too which is cool cuz she's around the kid but um I find that I'm doing a lot more child care stuff than I ever thought I would because I'm also my my hours are flexible I can do whatever I want and so we we we sharing that and then I'm thinking like you know there's there's a much more much more pressure on like having money and and",
            "start": 1993.68
        },
        {
            "text": "I'm also my my hours are flexible I can do whatever I want and so we we we sharing that and then I'm thinking like you know there's there's a much more much more pressure on like having money and and having security and knowing what I'm going to be doing you know I've lived this life where I don't know what I'm going to be doing in a month you know yeah uh and you know I'm sure you guys have a lot of this too you know I make living in part through Patreon it's like what if people just decide that I'm not worth giving money to for a while what if the recession what if there's another recession I mean like you have to cut off those you the your no no no no the the things you're doing with your disposable income like supporting a bunch of chuckleheads talking about games exactly and uh you know that that puts a lot of pressure on the whole sure the whole thing and it it makes you recontextualize what you know what you how you think about it yeah all right that's heavy stuff I didn't mean",
            "start": 2040.8
        },
        {
            "text": "that that puts a lot of pressure on the whole sure the whole thing and it it makes you recontextualize what you know what you how you think about it yeah all right that's heavy stuff I didn't mean to make it so heavy this is a good topic it was really good you guys can really see my kid he's cute you can send digital photos to Kevin he'll put him up throughout the topic and if you don't he'll just put up Gerber babies champ yes what's your topic uh shifting gears uh since we have Jeff here I want to talk about Anthony Carboni okay I just want to know here's the deal with Anthony he comes up here deals this my topic this is hilarious nothing makes him happier right now by the way wait till he hears I'm sure he's got that giant camera car he's like look at me I'm I'm watching myself everything about me he comes up here the first time I met Anthony he came up to the old space where we were at Greg's apartment and he walks in and he's better looking than me B he's funnier and",
            "start": 2083.8
        },
        {
            "text": "everything about me he comes up here the first time I met Anthony Carboni he came up to the old space where we at Greg's apartment and he walks in a he's better looking than me B he's funnier and quicker on the uptick right and C he has this like this drink that I've never heard of that I've then everyone has been drinking it because or lroy what the **** is lroy lroy is lroy this oh my God see once you are aware of lroy you will see lroy everywhere PR aware wait is that the stuff you buy it like it's like a can of generic canned soda oh yeah I've seen that before let's take one soda and water it down 400 times and make 400 sodas yeah that's like that's like Pabst Blue Ribbon for people who don't drink um but so then he leaves the show with us so that every time he comes up like there's a stunt where he'd come up like three times and every time he leave a new canister did you ever watch Seinfeld of course yeah you remember the one where George thinks he has that great way of meeting",
            "start": 2127.92
        },
        {
            "text": "a stint where he'd come up like three times and every time he leaves a new canister did you ever watch Seinfeld, of course, yeah, you remember the one where George thinks he has that great way of meeting women where he leaves the hat behind? Carbon does that every time he comes here. Soilent headphones I think he left his wife here once there's always something for him to come back for uh no but on a real note what tell me all about Anthony how did you guys meet how I love this so much because first off Anthony is the best but second off like I love he's the only person that dresses more Tim Gettys than Tim gets his every outfit he wears I'm just like you're a god like you're so cool he has like every shirt that Will Smith wore in like the first three seasons of Fresh Prince of Bel-Air it's fantastic his jacket game his shoe game all of it's it's great his clear glasses now oh yeah two pairs of Snapchat Spades spectacles I like that he has like a his glass the clear",
            "start": 2171.56
        },
        {
            "text": "\"Pens ofel air, it's fantastic his jacket game, his shoe game, all of it's great. His clear glasses now, oh yeah, two pairs of Snapchat Spades spectacles. I like that he has like a his glass, the clear glasses, that's a thing you know, that's an Anthony Carboni thing. If anyone else did it, like 'oh Anthony Carboni did it at first,' so good for you. The thing about you though is, I wouldn't say that he's funnier than you, I wouldn't say you're funnier than him. I think that you guys are pretty tied on how funny you are, but he is way quicker than you and it makes you... like if you guys watch any podcast, I'm like 'watch anytime' that you see Nick and Anthony Carboni together, whether it's a loving sex stuff or a podcast, Nick is like trying his best to out- Anthony Carboni and he just can't handle it and you're just like... **** you're funnier than me, you're better than me. I see you. You know what? It's funny, I I um most of the things that I've been a part of in my life, I've been sort of like the funny guy and I realized...\"",
            "start": 2211.08
        },
        {
            "text": "you're funnier than me you're better than me I see you you know what it's funny I I um most of the things that I've been a part of in in my life I've been sort of like the funny guy and I realized very early on and we when we doing we have concerns I'm the straight man yeah you're the straight guy yeah and I think honestly I think that was the best decision I could have made right cuz there's because you can't you can't compete with that and also you can't have two of that right so trust me I know so I mean that's that's what I that I have grown to relish that and be be the straight man to to Greg and on the show and it's a blast I love I love doing it how did you guys meet like I I because that's the thing of both of you I know now but I don't I feel like I don't have a great grasp of either of you before I met you well we're both uh we both started at at Revision 3 really I mean Greg was doing By the Way before Revision 3 but then it became a Revision 3 show and um I was doing The Totally",
            "start": 2255.4
        },
        {
            "text": "of you before I met you well we're both uh we both started at at Revision 3 really I mean he was doing Bungie before Revision 3 but then it became a Revision 3 show and um I was doing the Totally Rad Show and I don't know if I don't know how familiar you guys are with any of that ecosystem I remember it's all we knew it was happening we were at IGN where I was at the time you mean the Bungie Jacker show I'm pretty sure it was that show there was like there was a video wall in the background and it might have been green screen for a lot of it but they used the same art we used for GamesCast like literally the exact same art on Bungie Checker yeah oh that's funny uh yeah I mean I I um I often think that I I hope that you guys take this as a compliment but I often think that the Totally Rad Show was was this before this that we were doing what you guys were doing before you were doing **** you this is an original idea no one no one's ever podcasted and talked about random things but we're all white",
            "start": 2303.08
        },
        {
            "text": "before this that we were doing what you guys were doing before you were doing **** you this is an original idea no one no one's ever podcasted and talked about random things but we're all white remember that's that's the one that's what we've gotc white god um yeah no I mean I I don't I don't mean it to I don't mean that to be but it's um that was that we did the show on Revision 3 and Anthony Carboni was doing a show on Revision 3 but we were the only Revision 3 show that was based in LA so we were sort of uh disconnected in a lot of ways to the ecosystem that was happening here in in San Francisco um but we would meet up at parties or go to you know we would go to Comic-Con and and see them and I Anthony and I were sort of mutual admiration society we both thought what the other guy was doing on their own show was cool and we would see each other at parties and be like dude awesome wouldn't it be awesome to work together yes cool cool but that's never going to happen because we live",
            "start": 2342.44
        },
        {
            "text": "doing on their own show was cool and we would see each other at parties and be like dude awesome wouldn't it be awesome to work together yes cool cool but that's never going to happen because we live different places stayed apart yeah right well I remember one particular Comic-Con um there we were at like Felicia Day's party and Anthony Carboni was wasted and he's like I'm moving to LA I'm moving and I was like if you move to LA we should work together we should do something he's like yes moving to LA and uh and then like four months passed and he hadn't moved to LA and then eventually he did and we um she saying he's a liar he's a **** liar and he's not funny add that um he uh yeah and then and then we just like met up in LA and and had drinks and um we're saying you know we we should what should we do we should we do video game stuff we we both already do video game stuff it's it's kind of we could do that yes let's let's just meet up at a and record something and see what what it is",
            "start": 2387.28
        },
        {
            "text": "we do we should we do video game stuff we we both already do video game stuff it's it's kind of we could do that yes let's let's just meet up at a and record something and see what what it is and weirdly and we didn't know each other very well at all like I said we lived in two separate places we saw other parties but we met up um and we turned on uh one of those um HDTVs or yeah yeah and I had like that day read this article uh about the Fermi Paradox and I was like it blew my mind because I had never heard of the Fermi Paradox before that I was like Anthony Carboni's a smart guy I'd love to hear what he thinks about the Fermi Paradox and let's just talk about that and we talked about it for about 20 minutes weirdly without planning on it we started like doing characters in the middle of it and like jumping in and out of a weird improv and none of that was planned it was just like just how the conversation went and we turned it off and we're like that was really fun wasn't it wasn't that",
            "start": 2430.44
        },
        {
            "text": "like jumping in and out of a weird improv and none of that was planned it was just like just how the conversation went and we turned it off and we're like that was really fun wasn't it wasn't that really cool like that that could be a thing and then we looked up a couple of other weird things to talk about we talked about those and that literally was the show and then through the course of the last 400 episodes that we've done we've kind of gotten to know each other yeah and I think that's been kind of the fun too is discovering things about each other on the fly as we record uh so we really didn't know each other well before we started but it as we said said at the very beginning of this um it was just one of those things where we like had chemistry right away yeah and it was fun and I think you know as I said learning to sort of be his straight man was was a very different kind of experience for me and one that I've really enjoyed too yeah that's awesome and that's I think one of",
            "start": 2481.72
        },
        {
            "text": "think you know as I said learning to sort of be his straight man was very a different kind of experience for me and one that I've really enjoyed too yeah that's awesome and that's I think one of the things I I was when I was talking earlier about how great you guys are together and how awesome was to be on your show was the fact that yeah I wasn't prepared for the bits and the characters and like when you guys started like improv I like oh this is what you do okay yeah I'm here I just talk about beating up our fans I don't know that's C to take off his shirt to like you know still distract from my lack of talent I don't know if you remember the first time we met but the first time we met was at E3 on The GameSpot uh on the stage no no on their like in their like weird after hours stream thing oh and you were your shirt was already off but the first time I met you and you were like covered in something oh the Giant Bomb thing the giant bom not knock and I remember",
            "start": 2522.52
        },
        {
            "text": "Greg Miller, Tim Gettys, Nick Scarpino, and Jeff Cannata talk about being a dad, Anthony Caron(i) (not Carboni), people we want to be friends with, and hidden talents. I remember the first time I met you at Giant Bomb, not knock and I remember the next time I met you, it was like yeah I'm the guy next to the other guy, I was like oh right all those gifts my left arm is in them, you know it's like it's all the gifts of Greg but like my arm is it Garnett next to me or something. Anyway, small world that goes WR, anyway back to Caron(i), like sorry guys, a quota uh another I want to pay him is there's two men I can't wait till when he comes on next and you guys do a whole episode about meil this is all I have uh there's only two people I've ever met that I I I feel this way about where it's it's Caron(i) and Freddy Wong where they know way too much about everything and it's like you start to say something they finish your sentence and had three more sentences.",
            "start": 2567.68
        },
        {
            "text": "this way about where it's Anthony Carboni and Freddy Wong where they know way too much about everything and it's like you start to say something they finish your sentence and had three more sentences that you didn't know and you're like **** you know more about this than me and it's never annoying and that's the superpower they have it's it's not this **** knowitall thing it's a little Annoying I I think you're too close to it I I get the small doses and it's just **** impressive because it I'm just like there's something about the way that they they trim all the **** like they don't tell me like it's not the full Wikipedia page they just give me the highlights wow like you gave me the the the the Twitter version of Wikipedia I feel that way about you guys though because you guys are always so well informed like I will wake up in the morning now and I find myself just checking all my news on my iPhone just to just to like know that there's a headline of something that Greg Miller Tim Gettys Nick Scarpino Jeff Cannata",
            "start": 2618.96
        },
        {
            "text": "always so well informed like I will wake up in the morning now and I find myself just checking all my news on my iPhone just to just to like know that there's a headline of something that you guys might want to talk about especially with Colin like when it anything politics I'm like he's so well-informed when it comes to that stuff but I feel always constantly behind the curve with you guys because I'll walk in and be like I just just seen someone post something on Instagram like I swear to God it was like a minute ago and it like great he's like yeah I totally saw it 20 seconds ago bro where are you old champ I wouldn't talk to you I wouldn't call you I want to call anything old like that jam I want to do that to you I want to play you that way appreciate that that is that is something that uh that I know about Anthony Carboni is that if there's a meme he he's already seen it if there's a weird like Japanese toy thing that I just found out about but he five years ago he bought the shoes",
            "start": 2660.84
        },
        {
            "text": "that uh that I know about Anthony is that if there's a meme he he's already seen it if there's a weird like Japanese toy thing that I just found out about but he five years ago he bought the shoes that he invested in the company um brought in public yeah I'm definitely not anywhere near as cool sort of like that like subversive cool you know hipstery thing that that's the problem none of us are as cool as Anthony Carboni and that's the problem because you want to hate him and I remember watching him from the outside for the longest time and I'm like oh well this guy's probably a dick he's one of those host people and you meet him like oh **** he's super genuine and nice God damn it I hate that so much yeah no I mean that it's funny because like yeah when you're in the industry and stuff like I I am like a student of internet video so I like to watch all St see what everyone else is doing and I always remember seeing his stuff at Revision3 and being like where does this dude fit",
            "start": 2694.64
        },
        {
            "text": "like I'm a student of internet video so I like to watch all stuff and see what everyone else is doing and I always remember seeing his stuff at Revision3 and being like \"where does this dude fit in?\" because it'd be like Scoble and CNET and then him, and I was just like he seems out of place somehow, and then it was once I saw him doing his own thing in a random way, I was like \"huh, I get that this guy is talented but I still don't know at what\", you know, and it wasn't until VidCon when I met him a couple years ago, uh we were talking to Trisha Hershberger and then came up another new parent shot out the TR oh yeah yeah yeah and uh and then he came and he just turned into like he was just talking there was so much and I was like \"you're like Nick but better\", like I had a moment where I realized it's undeniable how many times has Anthony Carboni been the Kinda Funny Nintendo World Champion, that's true",
            "start": 2737.84
        },
        {
            "text": "where I realized it's the funny I want to fight it but it's it's it's undefensible how many times has Anthony Carboni been the Kinda Funny Nintendo World Champion champ that's true Greg give me the one oh Greg's abandoned his post what a surprise then I'll do it on the why he'll just punch in later Anthony he's uh come at me bro it's weird uh Greg left to go watch Anthony videos it was blow my mind if Anthony just showed up something we're just doing we said his name too many times but yeah this new thing where he's vlogging everything or and I shouldn't say where he's vlogging everything where he's recording everything I don't see a lot about he's a hard worker man that guy's a hard worker yeah I admire that I wish I was better about it and he has a dope ass dog not only does he have a dope dog he they do amazing Halloween costumes together did you see the last one like didn't he dress his dog up we were at his house on Halloween last year or two years ago and yeah it was",
            "start": 2785.84
        },
        {
            "text": "he have a dope dog he they do amazing Halloween costumes together did you see the last one like didn't he dress his dog up we were at his house on Halloween last year or two years ago and yeah it was Beetlejuice and and him and his wife were the the couple for genius it was good he's a good guy I imagine that's why you have kids too so you can dress them up as Halloween like cool Halloween you already oh yeah can I show you what we did last year uh real quick you guys can keep talking Kevin do me a favor annotate right here and let the dad topic know that they could jump here from where Dad sorry Kevin's gone Kevin's still not back K weird he just abandoned his post he must have smelled the sandwich outside that's the best you got it I like how as you I know how long it's been but I love that like as you say it you start to laugh cuz you're like this is yeah this is the joke it was gold it was gold look they always say jokes are meant to make you laugh now yeah I don't care about you",
            "start": 2835.16
        },
        {
            "text": "that like as you say it you start to laugh cuz you're like this is yeah this is the joke it was gold it was gold look they always say jokes are meant to make you laugh now yeah I don't care about you guys watching if you're not enjoy going back to oh no way you all right you have to email me that one now so I'll get it to Kevin so we put it up right here that's why you have Kevin mark down 5120 all right right mark down 5120 because I'm going to send you an image to put in 5120 yeah yes you can just send me now and I can put it in well it's on his phone Kev and just don't you're the one who abandoned your post you AB your post you abandoned your post how was the sandwich how was the sandwich was it what did it look like what did it smell like you gave we just gave you so much **** and you have no idea we just tore we gave you a lot of not probably roughly at the 47 or 48 second or 48 minute Mark you need to punch in on the belt since there wasn't a camera there that's what Champ",
            "start": 2881.56
        },
        {
            "text": "you have no idea we just tore through that 47 or 48 second mark, or 48 minute mark, you need to punch in on the belt since there wasn't a camera there, that's what Champ passed for and he's the champ so we got to get with I don't think I can punch in on stuff anymore I guess I can do it digitally yeah you got Premiere right you just blow up the image size no I meant I meant with the cameras because of the new lenses that we're using sure well I mean you know it's fine so just I mean you could have just gone you know the one though he asked for that you weren't here to switch it to cuz you smell the sandwich outside I oh oh so she like fat shaming thing huh even though I was going to do doesn't matter I hate you guys I know you're working hard don't give him what he wants don't give the monster his food I'm the monster I think we're all the monster you're being demanded to be called Champ today and I'm the monster it is my Birthright",
            "start": 2922.96
        },
        {
            "text": "he wants don't give the monster his food I'm the monster I think we're all the monster you're being demanded to be called champ today and I'm the monster I'm not it is my Birthright because I am the champion when you when you put as much time and effort into winning this beautiful son of a  as I did Tim then you can call yourself champ I did but until yeah you had it for 15 seconds exactly you're not even on his Anthony Carboni once gave me a jacket that was so cool that when I wore it outside the group of people I was with was like Tim you need to be stopped oh like this jacket is to Tim Gettys and I was like Anthony Carboni cool wear what is that old Saturday Night Live sketch uh Bill Brasky Bill once gave me a jack but I mean that was I that was during the Power Rangers Voltron shoot and that was I think a great example of how genuine Anthony is that he just knew you were G to be there and he's hey hey you like clothes like I here you go Andy Carboni's like if the",
            "start": 2964.92
        },
        {
            "text": "Voltron shoot and that was I think a great example of how genuine Anthony Carboni is, that he just knew you were G to be there and he's hey hey you like clothes like I here you go Andy Carboni's like if the Joker was a good guy, that's really good, he didn't go the evil way, I loved it though cuz he was like oh man so I got this super dope jacket but it's too big for me so I thought of you and I'm like **** yeah you need to do this more often **** up and get bigger Size **** cuz then I benefit from it we all get to benefit from this how do we how do we not tell him that this that we did this topic but then record his reaction when he watches this, I feel like it'll be a roller coaster of like really highs and then we're kind of making fun of him a little bit how we're making fun of him I don't know I I I was well okay but because I'm intimidated by him because I'm intimidated by him honestly because I feel inferior and I am the inferior Italian in this group but you're the champ, my topic is what I'm",
            "start": 3011.0
        },
        {
            "text": "okay but because I'm intimidated by him because I'm intimidated by him honestly because I feel inferior and I am the inferior Italian in this group but you're the champ, champ my topic is what I'm stealing from Nick we're out there discussing what topics Nick wanted to do and he had the Anthony Carboni topic which I was like gold so I'll do it and it's like I also got this other one and then my interpretation of it is different than Nick's interpretation of it so we're all going to interpret and talk about it what Nick said was people I want to be friends with but I'm not to which my first action was we've already done the show of like we'd like to have the Rock on the show and like Kevin Smith's a big deal and like stuff like that but then you had you had something else and this and I I have a third interpretation but you said you read it as right well my question was was that so like what defines friendship if you look at a person and you're like I want to be friends with that person",
            "start": 3054.84
        },
        {
            "text": "a third interpretation but you said you read it as right well my question was was that so like what defines friendship if you look at a person and you're like I want to be friends with that person are you networking or are you legitimately going to be friends with it like how do you where does especially in our trade where like networking is just kind of comes with the business if I look out and say I'm really I'm an admirer of this person's work I'd like to be friends with them does that make me a bad person or something so heavy as the crown you know what I mean yeah I know what you mean chief um this came from I'm reading a book by Tim Ferriss right now called Tools of Titans and it came from one of his interviews that he did on his podcast where one of the people was talking about how they would write down 10 people they want to be friends with and then 10 10 10 ways to be friends with those people like things that steps they can take to be friends with those people",
            "start": 3095.64
        },
        {
            "text": "about how they would write down 10 people they want to be friends with and then 10, 10, 10 ways to be friends with those people like things that steps they can take to be friends with those people and I'm like but is that friendship or is that networking is that like cuz I always look at friendship as something that happens organically right and I'm also a terrible networker so like obviously we were just talking about Anthony Carboni I would count him amongst my friends but I didn't reach out to him he had no idea who I was really before he came on the show and we just bonded because we're both awesome human beings, him again 10% more awesome than I am I'm being honest 20% more awesome than I am um but so that's that's just a question for you guys because you guys are all awesome about it and you have these genuinely great relationships with people but I just like there's just this weird barrier for me in between those I I'm sorry no I'm going to say um I think you can you can set out to be",
            "start": 3131.92
        },
        {
            "text": "have these genuinely great relationships with people but I just like there's just this weird barrier for me in between those I I'm sorry no I'm going to say um I think you can you can set out to be intentionally to intentionally get to know someone but friendship is something that you can't make happen interesting okay um I I once my the very first E3 I ever went to years ago years ago before I was ever involved in the industry in anyway I you a janitor at this point youing you were working at the convention I was a humble janitor where yeah uh no I finagled my way in I was working retail and we were like we we thinking about selling video games um I once uh followed Adam Sessler around the the convention center just like want I just wanted to see where he was going what he was doing I was also fascinated with Adam Sessler Adam Sessler and I regularly hug now you know like he's a buddy he's my one of my one of my good buddies um and I didn't make that happen I wanted to have him in my",
            "start": 3165.0
        },
        {
            "text": "also fascinated with Adam Sessler and Adam Sessler, and I regularly hug now you know like he's a buddy he's my one of my one of my good buddies um and I didn't make that happen I wanted to have him in my sphere like but you don't know the people that you're going to click with or not click with you know that was that thing of uh never meet your hero you know because often times once devastated me oh no was he a dick he was on a press line and he would totally like tore some guy an **** the guy from CNN he just tore him my new **** for taking a picture of him while he was being interviewed by someone else and I was like that's sad that sucks but you know what they say Heroes Die Hard damn I like you so much don't don't don't we're going do a topic next week about Jeff all right um anyway I so my my point is that I think that you can sort of create circumstances in which your sphere intersects with a sphere of a person that you are hoping well I mean me following Adam Sessler didn't do",
            "start": 3215.2
        },
        {
            "text": "I think that you can sort of create circumstances in which your sphere intersects with a sphere of a person that you are hoping well I mean me following Adam Carolla didn't do anything it just was made me go like make Adam Carolla be really scared exactly uh but uh but sometimes those serendipitous things happen and and you it turns out that actually you do click and you are cool people are cool and you're cool and everything's cool yeah I think what was interesting about it is when you uh well when you went through your thing of the reading the book and the guys like the 10 ways to become friends or 10 steps to become friends with somebody that sounded really creepy and weird I thought you know what I mean that did come off as like that's a that feel like positioning yourself in a way to intersect with them in that level well so what's interesting about that is so Tim Ferriss is one of the most interesting people in in the world his dad invented the",
            "start": 3264.92
        },
        {
            "text": "yourself in a way to intersect with them on that level well so what's interesting about that is so Tim Ferriss is one of the most interesting people in the world his dad invented the Ferris wheel and also wrote Ferris Bueller off the whole thing his mom is Carol Ferris from Green Lantern uh how far are we going to go with this it's too much for me now I'm crumbling I don't know the press would get it he's one of the few people that I've seen speak at panels and stuff it was at VidCon a couple years ago uh and I just randomly happened to be in a panel he was speaking on and it was about like brand development and selling video games and all this stuff and networking and whatever and it was so different than everything else every other panel because everything else is just like here's how you be famous here's how you make money and here's this dude just saying forget that you're making YouTube videos this applies no matter what industry you're in no",
            "start": 3308.88
        },
        {
            "text": "else is just like here's how you be famous here's how you make and here's this dude just like, forget that you're making YouTube videos, this is that applies no matter what industry you're in, no matter what you're doing, it's networking, it's getting to know people, it's about figuring out what your goals are and accomplishing them. And he talked about that the who are the people that you should know to help you do the things you need to do? How can you meet them? Make a list, go through it. I love lists so much, and I think a lot of that has to do with that. Like I very good work, he's super again, that obvious me, I'm always late to the party on all this but uh, he's a friend of my friend, oh really? Yeah, Kevin Rose is good friends with Tim Ferriss, oh **** anyway, very cool dude. But that is different than friendship though and I think that no matter what, that that is still networking but it is opening the door to get you into a scenario where it's like well if he likes the same thing as I like maybe",
            "start": 3353.76
        },
        {
            "text": "friendship though and I think that no matter what, that that is still networking but it is opening the door to get you into a scenario where it's like well if he likes the same thing as I like maybe there is that intersection. Like for me thinking about it, I think Rooster Teeth is the best example of it, like those in the Old Guard - there, like I looked up to them and I was like \"I want to be them\", I want to be their friend, I want all this stuff. And as Rotten Teeth grew, then we got involved with them over the last couple years, it's at a point now that I am friends with people there but then I am also just business partners with people there and that's where the difference lies is when I can walk into a room and just feel absolutely comfortable not talking to people and sitting there, then I'm like we're friends you know. So but then that begs the question right, like can can that like it's it's a little hard especially in our in our industry where you know you",
            "start": 3397.28
        },
        {
            "text": "and sitting there, then I'm like we're friends, you know, so but then that begs the question right, like can can that be it's a little hard especially in our industry where you know you have to kind of always be on and you're always sort of like when you network with people there's always going to be that gray area I don't think I ever feel like I'm ever like I love everyone that I've met at Rooster Teeth but I there's always a little part of that where I'm like this is business still so don't forget that like don't go full Nick, go 90% like 10% says well can I I'm sorry can I can I can I switch this on its head a little bit I want you to switch on its head can you remember where you're going to switch it on its head real quick on its head Kevin open the email I just sent you and then do this so real quick there you were talking about you know the list guy through Kevin Rose so you know Kevin Rose, Kevin Rose is your friend yeah",
            "start": 3434.76
        },
        {
            "text": "\"Hey Kevin, open the email I just sent you and then do this so real quick. There you were talking about the list guy through Kevin Rose, so you know Kevin Rose. Kevin Rose is your friend, yeah, yeah, yeah. We're friendly, I mean, yeah. Well, I mean next time you talk to him, you have to compliment him on kicking that raccoon's ass. Oh yeah, he gets that a lot. I mean it's just this is one of my favorite stories in the entire world because as a dog owner if a dog if a if a raccoon was messing with your goddamn right I'd grab it and throw that down the stairs as hard as I could. Have you seen the looping one? This is it, this is it right here, it is so good. The tear in the... his uh his like security cam that he caught, yeah. Look like it's wearing a Kinda Funny sweatshirt, it's just that night vision stuff. I remember when this broke and this video came out before it was the endless loop GIF. I'm just like what a badass that guy is. I never met him, I didn't know him from Adam.\"",
            "start": 3471.96
        },
        {
            "text": "just that night vision stuff I remember when this broke and this video came out before it was the endless loop GIF I'm just like what a badass that guy is I never met him I didn't know him from a whole in a while but like I would be terrified that thing would come back at me dude like well I mean that's why he's throwing the way he's throwing it that's not a get off that's I'm going to break your neck when you hit the ground God bless him for saving his dog so anyway tell Greg that flip it on his head now I will uh I'm sure he'll yeah I'm sure he'll like that um so here's how I want to flip it on his head I'm have no doubt there are lots of people listening to this that go I want to be friends with you guys the Kinda Funny guys are who I want to be friends with and I have no doubt uh at the risk of of of sounding not how I want to sound uh that you guys like like me have been in situations where there are people who are trying so hard to be your friend in a in a fan way",
            "start": 3516.56
        },
        {
            "text": "at the risk of sounding not how I want to sound, uh, that you guys like, like me, have been in situations where there are people who are trying so hard to be your friend in a fan way and it is making you uncomfortable, it's making the situation uncomfortable and they kind of don't know how to do that. And I, I so often think about myself on the other side, like we're talking about how oh I want to be friends with that person when somebody wants to be friends with me, like what works, what what do I appreciate? Because there's so many times when you just get that like \"oh\" and especially people listening to this are like \"oh my God, that's what I want to do with those guys next time I see them at one of their live events, I'm gonna use those tactics.\" And it's like no, don't use tactics. I think the key to knowing how to become friends with someone you want to be friends with is to know how to be yourself, have to be able to be around me, be around people",
            "start": 3556.28
        },
        {
            "text": "like no don't use tactics I think the key to knowing how to become friends with someone you want to be friends with is to know how to be yourself, have to be able to be around people and be cool, it's a terrible thing to say but like be comfortable and as yourself, and if you exude the things that you're comfortable with then people will want to hang out with you if they're comfortable with themselves and you can relate to people and you can compliment them and you can do all those things but you have to be okay being around other people like saying be in the same room with Anthony Carboni and not talk to him, yeah you know what I mean and I think that there are a lot of people that kind of don't know how to be themselves and I'm assuming you guys deal with it a lot, I've dealt with it a fair amount where you go to these fan meetups and it's awesome, it is awesome but there are always a",
            "start": 3615.08
        },
        {
            "text": "deal with it a lot I've dealt with it a fair amount where you know you go to these fan meetups and it's awesome it's there's no I'm not saying it's not awesome it is awesome but there are always a few people there that are just a little too intense and a little too trying a little too hard to be your friend and you you don't know them and that's okay but I think the intention to be friends sometimes gets muddied and and becomes a little standoffish in and of itself for me this this speaks to the the third way I interpreted this question or the interpretation for this topic I guess and what Nick was talking about I'm sorry what Champ was talking about was you know people I want to be friends with but I'm not where respect is due I agree Champ I'm giving you the respect you deserve right doesn't sound like it it I don't know uh no but the fact of the matter is like when I initially heard people I want to be friends with but I'm not I think of the real friends I have now that I'm not",
            "start": 3666.6
        },
        {
            "text": "doesn't sound like it, it I don't know, uh, no, but the fact of the matter is, like when I initially heard people I want to be friends with, but I'm not, I think of the real friends I have now that I'm not friends with, I'm not good enough at this, with the fact that we are all pulled and stretched so thin. I include you know, we call our audience best friends, I include them in this because it is that thing of this is a jumble of a thing but stick with me. Of I remember this story about Dan Auerbach of The Black Keys, he had done some radio show appearance or something, whatever there was a meet and greet afterwards or it was somebody called in, I forget what it was anymore, and basically the guy invited Dan over to his house, he was visiting doing this book tour or whatever, invited him over to his house for dinner with him and his wife, and Daner was like okay, and he showed up and had dinner with, I'm like what a **** awesome move, and I'm like if I ever have anything like that, a sliver of fame, I'd love to do",
            "start": 3712.12
        },
        {
            "text": "with him and his wife and Daner was like okay and he showed up and had dinner with I'm like what a **** awesome move and I'm like if I ever have anything like that a sliver of Fame I'd love to do that and now you flash forward to now where we go to events and we have an awesome meet and greet and somebody is like I'd love to take you out and buy you a beer and like PAX is coming up and the amount of people who are developers not you know what I mean people I'm friendly with and I I and we'll get into definition of friends I think later but friends on that level who are like hey do you want to get dinner do you want to do this and I'm like I would love to do that I know I will not have the energy I know I will be scattered to brain I know that no regardless of me setting a time for a brunch or a dinner or whatever something is going to happen in that day that pushes it out and it doesn't work and then to the question of like you know who do I want to hang out with but I",
            "start": 3753.64
        },
        {
            "text": "a brunch or a dinner or whatever something is going to happen in that day that pushes it out and it doesn't work and then to the question of like you know who do I want to hang out with but I or who do I want to be friends with and I'm not I owe Jared Petty about four text messages the nicest man in the industry continues to hit me up and be like hey like we need to get to hey we want to meet your girlfriend hey come out to and let us and it's like I don't respond because I'm like well I got to find a slot on the calendar and the calendar's all jacked up and then it is that thing of like even when it is all right cool let's go do something after work or whatever I know how exhausted I am at the end of the day and I know I'm not going to give him what he deserves and blah and it is that weird thing of coming into work every day going to a PX or whatever and I the way I do this job is I leave it all out on the field right and so I am a husk at the end of the day like last night",
            "start": 3790.16
        },
        {
            "text": "weird thing of coming into work every day going to a PX or whatever and I do this job, leaving it all out on the field right, and so I am a husk at the end of the day like last night you know, a Husky no no just a Husky I'm Husky all the time but uh remember that when you had to go get pants and you're like you're husy size Jesus Christ Sears **** you uh no it was that you know like last night we went out uh with one of Jen's friends Lola who's a friend of mine too again but Jen knows us way better and it was that thing of like I in the Uber ride home I had my water bottle to my head cuz I had a throbbing headache from doing work all being under the lights all day and doing podcasts and **** and then got home and then got in the Uber and then like Jen was just like you're dying aren't you I'm like yeah and like she she let me ride in silence cuz she's a lovely amazing person and then I got it together and I was okay and I built it back up and I was ready to go but it is",
            "start": 3823.8
        },
        {
            "text": "aren't you I'm like yeah and like she she let me ride in silence cuz she's a lovely amazing person and then I got it together and I was okay and I built it back up and I was ready to go but it is that thing of like it's so hard to psych yourself up to do that and I don't mean to be like not answer Jared and like you know I just got out to see Ryan Clements' kid and it's just like there all these little things is just so hard to balance the work and the things and the energy and how you get out there to your to your former point though um do you guys have that situation I I I have with my wife now um I have many opportunities I think of them as opportunities where it's like I can't really afford to go to do this thing or it's not going to work out and but then some fan will be like hey man you want to stay at my place and I'll be like actually that would work out and my wife's like are you insane you don't know this person you have no idea what what's going to happen to you he's",
            "start": 3863.28
        },
        {
            "text": "you want to stay at my place and I'll be like actually that would work out and my wife's like are you **** insane you don't know this person you have no idea what what's going to happen to you he's definitely putting a camera in the toilet right and that doesn't even occur to me you know and and then and I'm I get into arguments with her quite literally and say honey they have there's no ill will there and she's like yeah not until there is and you know it's like the one guy that you don't know that you know I mean the the example for us and for me and Colin incredibly personally and even me more is the fact that when we started this Patreon tier come be on the show and we'll take you to dinner which meant for the first year and a half come to Greg and Tim's house where they live you will know where they live and it also for I think for the most part meant I think at the end I stopped just cuz I I was more worried about switch whatever I you'll have Greg's phone number cuz he has",
            "start": 3902.88
        },
        {
            "text": "will know where they live and it also for I think for the most part meant I think at the end I stopped just cuz I I was more worried about switch whatever I you'll have Greg's phone number cuz he has to text you there has to be some communication eventually I think I moved it to Skype that's what it was cuz we had so many International people but it was like you're coming to our house and like the only Safeguard I ever put on it was that IID dropped the pin around the corner so that they didn't know my exact address unless they looked at the map and not again not because I thought they'd murder me but I wanted that one little plausible deniability switch in your head that if I got there and you were not cool something was wrong which I know none of the best friends would be who had money to come out and fly across the country to come hang out with like but it was that thing of like all right cool like you know where I live please don't be a dick you know mean like this is how it is and so but it has",
            "start": 3944.96
        },
        {
            "text": "fly across the country to come hang out with like, but it was that thing of like all right cool, like you know where I live, please don't be a dick, you know mean like this is how it is and so, but it has never backfired right, so I me what you're talking about is just having is having some level of boundaries right between you and other people and I think that does that extends Beyond just the relationship we have with with best friends out there um it extends to basically every relationship you have like and that's something that I I'm very cognizant of like I even with my family or with like my close close friends I'm like I have to be able to tell you no I have to be able to say I'm sorry, I know it's a Friday night, I know everyone's going out right now, I'm **** spent and don't you're my friend and I don't need to give you an excuse as to why I need to come out like you just need to understand that I'm just at that place right now right um but I have a problem with that because I",
            "start": 3979.12
        },
        {
            "text": "my friend and I don't need to give you an excuse as to why I need to come out like you just need to understand that I'm just at that place right now right um but I have a problem with that because I always feel bad like I want to give I I should want to be going out with people and bonding with them and you know feeling what's going on with their life especially now they all my friends have kids and I'm like God there's like another life form to think about right like I can go be this kid's uncle but at the same time like and they're calling me Uncle Nick and Uncle Nikki Uncle champ Uncle chch Uncle champ but but I I feel terrible like one of my best friends in the world the growing up he was the guy that I we'd have sleepovers at each other's house like almost every night Ste no it wasn't Ste it was Ryan um Ste hasn't had a kid yet Steve wants to come on the podcast by the way I want Steve on this podcast I'll tell you right now I gotta get back to his email um but you",
            "start": 4015.96
        },
        {
            "text": "it wasn't Steve, it was Ryan; um, Steve has kids yet. He's got little ones. Hi, he wants to come on the podcast, by the way. I want Steve on this podcast. I'll tell you right now. I gotta get back to his email. Um, but you know we had a kid and it took me a year to meet the kid. Yeah, and I felt like...and I've only met him once and I feel like a piece of **** because of it. But, but so, so I when I think that way and then I think about oh I want to I want to outreach someone that I admire or someone that you know I think could could be an inspiration in my life um and then I I just attach all that baggage to it of like this I'm not going to bother this person like I don't want to like this person's got such a full plate like I don't want to be another **** thing they have to do. That was a huge impediment for me, that's a huge thing and I've recently gotten over it and it feels awesome. That so often if I saw Greg Miller walk into the room or any of you guys walk into a room I'd be like oh I know them",
            "start": 4052.72
        },
        {
            "text": "me that's a huge thing and i've recently gotten over it and it feels awesome that I so often if I saw Greg Miller walk into the room or any of you guys walk into a room I'd be like \"oh, I know them\" do they know who I am? I'm not so sure. I'm just gonna be okay, it's fine, it's weird. It's I don't want to make it weird. They're busy and you know whatever it is. I would talk myself out, I would talk myself down and be like \"I'm clearly not important\" they're you know... and what I've gotten to is like say hi, say hi to people, it's awesome and it's a thing when you when somebody's like \"oh yeah, hey\" it's like \"oh wow, cool everything's cool\" and it doesn't have to be become a whole thing definitely not. But I would do that so often where I would talk myself out of even just saying hi yeah... and we used to talk about that with the Totally Rad Show uh Dan and Alex and I had a thing where we said \"be a blurter\" because what you do is when you see like oh my God that's Mark Hill",
            "start": 4091.2
        },
        {
            "text": "yeah and we used to talk about that with The Totally Rad Show uh Dan and Alex and I had a thing where we said be a blurter because what you do is when you see like oh my God that's Mark Hill oh my God that's **Mark Hill** okay I want to say something to my camel what am I going to say I'm going to say you have changed my life in every way and then you walk up and you go Mark HL you have changed my life you know and it becomes weird for them and it's weird for you and it's like **but** if you went that's more more camel then they go hey and you're like oh awesome and then that was that was it everyone gets what they wanted out of it exactly be a blurter you got to be a blurter and and just don't prepare it don't think about it just let it happen Kevin oh you already gave me the one good Nick blurt something out of **ethic** Carboni right now hey buddy nailed it Nick great job Nick that real real solid advice and like I even it's it's hard I think everybody you never reach a point",
            "start": 4137.4
        },
        {
            "text": "good Nick blurted something out of character Anthony Carboni right now hey buddy nailed it Nick great job Nick that's real solid advice and like I even think everybody you never reach a point where you're always comfortable with doing that like I feel like you're in situations where you still feel like what should I say what is the best thing to say and I think that it's like that is really when it comes to friendship versus uh networking versus whatever I think the only time that you shouldn't do that is if you have a very direct goal a network goal or a thing of I'm trying to come off a certain way or whatever I think an example is RTX Australia like uh we were in the same room with Hideo Kojima it was an event whatever and like I want to take a picture with him but I didn't want to be the one to go up to so was like Greg can you introduce us whatever and it's like I felt like in that situation that was the right way to go about that instead of just blurting it out and and",
            "start": 4184.28
        },
        {
            "text": "to be the one to go up to so was like Greg can you introduce us whatever and it's like I felt like in that situation that was the right way to go about that instead of just blurting it out and and whatever speak English and there's a lot of barriers there whatever there's like a level of respect it's like but yeah if it's just Mark Hamill and he just is there yeah it's like that's that is the most respectful thing to do if if you're going to have a conversation and and I how many times I'm sure you guys have experienced this too how many times have you like read Twitter where somebody's like oh my God I was just standing in line behind yeah and I'm always like why didn't you say something ex just say hey and that's that's the other part that I realized too is because I've been the guy a million times where I'm like I was standing behind the person I didn't see anything and uh but I love it when someone says something to me I love it when they're like hey Jeff oh wow hey man how's it",
            "start": 4230.6
        },
        {
            "text": "million times where I'm like I was standing behind the person, I didn't see anything, and uh but I love it when someone says something to me, I love it when they're like hey Jeff, oh wow, hey man, how's it going exactly, I love that you feel awesome, the blurt is kind of an opposite feeling too where it's just like, uh, it, it's been happening a lot recently cuz I've been hanging out at a lot of malls for some reason and our fans are in malls a lot, champ, I'll just be like I'll be there and all of a sudden like there's like oh Tim Gettys and I'm just like yes what's up dude like I'm even more stoked than they are yeah it feels great yeah and it's like then there's that moment it's like cool hey what do you, what do you have to do my favorite thing though is they're usually in groups and like they're the only person that knows who I am and that's when it's just that everyone was like why are these guys so excited to see each other and yeah it needs to happen in front of my wife",
            "start": 4268.36
        },
        {
            "text": "and like they're the only person that knows who I am and that's when it's just that everyone was like why are these guys so excited to see each other and yeah it needs to happen in front of my wife more often I always get the tweet of like I was going to say something but you were with your wife I didn't want to bother you was like that's time that's when you need to do it yeah I love it yeah that for me it's always I want it to happen with like my dad who has no real recollection of what we now he does have a better thing because it's happened in front of him and he's gotten to see me perform and do stuff so but that was always the thing right like no do it cuz like the first time I ever not that sounds weird uh the first one of the first times I ever got recognized going home to Chicago the plane landed and I had Patillo and I was all like disjointed getting out front of the seat and some L asked me a question and the guy stood up in front of me and got his back and goes holy ****",
            "start": 4306.48
        },
        {
            "text": "plane landed and I had a Partillo and I was all like disjointed getting out in front of the seat and some L asked me a question and the guy stood up in front of me and got his back and goes holy **** are you Greg Miller and I'm like yeah and he's oh it's like I got off the plane, told my dad that story and it's like years later he still talks about that story I'm like well Dad I'm going to recognize a lot more since just that weird Southwest but yeah all right sure that's something there's something so so genuine about that and like trying to tie this back to the actual topic about like I want to be this person's friend or whatever right when I'm walking through Westfield mall and there's a guy that's like oh **** hey dude oh man I just was listening to you talk about you know whatever the **** hot dogs on this show and we always go back to the hot dogs when I always do for the top anyway uh we talk we're talking about the the hot dogs and whatever and man I think this whatever",
            "start": 4341.52
        },
        {
            "text": "the hot dogs on this show and we always go back to the hot dogs when I always do for the top anyway uh we talk we're talking about the the hot dogs and whatever and man I think this whatever and it's just like a quick moment it doesn't go on too long it's not like a essay but it's like oh cool great have an nice day walk away I'm like we just had a friendly conversation you know in the same way like I had a conversation with you that I would have with if I ran into someone that I liked from high school right not one of the people I don't like from high school and I'm kind of avoiding trying to see him and walk away one of the people that I'm like oh we were we were had good times in high school how are you doing oh you're you're working here now that's great cool see you later you know I'm like that's legit yeah that's the way to do it I think that's the that it feels good for everybody Yeah Tim yeah what's your topic so my topic is hidden talents now the source of this is",
            "start": 4377.8
        },
        {
            "text": "know I'm like that's legit yeah that's the way to do it I think that's the that it feels good for everybody Yeah Tim yeah what's your topic so my topic is hidden talents now the source of this is a late night TV show I don't know what the **** it's called it's the one with the dude from The Late Late Show, I'm pretty sure it's James Corden, that Carpool Karaoke thing which by the way that's the most amazing thing that's ever been made it's pretty amazing it's no Revenge but if you're not familiar with it watch the Adele episode it I watched it twice I guess I Love Adele so much I I didn't know I loved Adele that much until I watched that and I was like she is the coolest person on the planet I want to be her friend that's you guys ever heard the the thing that that leaked online of Adele's like Vocal Track without any music behind it for hello no it's **** amazing of course it ising yeah she is you're absolutely right she's like you said that you said that like you didn't believe it before you heard",
            "start": 4413.92
        },
        {
            "text": "without any music behind it for hello no it's **amazing** of course it is, yeah she is you're absolutely right she's like you said that you said that like you didn't believe it before you heard that track now you know and now you feel bad because you hell for a second that entire story you just told us is is accurate yeah it's there's a video of her at a concert uh in like this giant Arena and all of a sudden her mic stops working like in the middle of a song and she just doesn't stop she just keeps singing and everybody joins her everyone around and all of a sudden it's just this **rupture** like everyone singing like this is epic that is a in a nutshell yeah and and also this has been the game M we're not going to be on top that I I love that she guys ever seen a well it's your turn Adele can go to hell damn I like her a lot I like her a lot sheele swell sorry Adele swell I like that that was the best one that was hidden talent no real quick before we get into that I need",
            "start": 4462.64
        },
        {
            "text": "turn Adele can go to hell damn I like her a lot I like her a lot she's swell sorry Adele, she's swell I like that that was the best one that was hidden talent no real quick before we get into that I need your help Kevin can you go to the one I need hold on all right great and then look at the camera you want to do this for the thumb no hold on what is this and then I want the meme of don't ever talk to me or my son again I want the meme text on that Image Screen C thank you yes that's hidden talents, hidden tal watching James Corden uh yeah James Corden there there was a segment that they that he was doing where he would just bring random guests out and they would do their their hidden talent and I was like all right like how funny is this going to be but what made it hilarious is you didn't know who was about to come out next and what they were going to do and I was like all right is there's gonna be a bunch of whatever that's why we're going to announce Anthony",
            "start": 4511.2
        },
        {
            "text": "know who was about to come out next and what they were going to do and I was like all right is their town is going to be a bunch of whatever that's why we're going to announce Anthony Carboni be amazing that would be amazing that would be so good so they bring out the first stop was was Andrew, not Goldb uh Garfield, Garfield, Andrew Goldberg comes out I write news really quickly write news quickly I know I beat Persona 5 in Japanese Andre Garfield comes out in a tracksuit like Missy Elliott style and he just comes out he's looking all excited he's all British cuz you know he's British and uh he he like uh the dude comes up to him with like a game show type mic it's just like so Andrew what what's your name where you from and what's your hidden talent and he's like you know I'm Andrew I'm from London uh and I'm pretty aerobic I'm pretty aerobic what the does that mean and he does a backflip that's amazing Spider-Man yeah I was going to say I know I was",
            "start": 4555.76
        },
        {
            "text": "I'm Andrew, I'm from London, uh, and I'm pretty athletic. I'm pretty athletic, what the **** does that mean? And he does a **** backflip, that's amazing. Spider-Man, yeah, I was going to say, I know, I was like this holy ****, like he just pulled some Spider-Man ass moves, like somebody probably saw him years back and was like you're Spider-Man, like that Tom how Tom Holland got the role, like back is how he got big because he was like he's actually really acrobatic as well. I, I don't know, but video of him doing acrobatic ****, yeah, I was sufficiently impressed with it, I was like all right cool, so he he like runs off in a comical fashion. You should watch this video then right after that Kendall Jenner comes out. Okay, okay, if you're not familiar with Kendall Jenner, you should be one of the one of the Kardashian little sisters, you know there's like the next the next class of them Muppet Babies, yeah, it's like one of the Muppet baby Kardashians, um, and you know she's coming to her own.",
            "start": 4603.24
        },
        {
            "text": "of the Kardashian little sisters, you know, there's like the next class of them Muppet Babies, yeah, it's like one of the Muppet baby Kardashians. Um, and you know, she's coming to her own in the last couple years, and she just comes out looking as hot as she always does, and she just like walks out, what's up, and it's like say your name, where are you from, and she does it all, and it's like what's your hidden talent. She's like I'm really good at making bird noises, and then she does it, I'm like she's really good at bird noises. I like how like I went from being like this is gonna be such a stupid segment to like they're really kicking this thing up. Then uh next up uh Stevie Nicks comes out, Stevie Nicks comes out, Stevie Nicks comes out, is your hidden talent doing play-by-play descriptions of television shows, this is really good, so she goes excitement feeds you and it's like what the heck are you gonna do, like what are you gonna do, Stevie Nicks uh she also",
            "start": 4647.4
        },
        {
            "text": "descriptions of television shows this is really good so she she goes excitement feeds you and it's like what the **** what are you GNA do like what are you GNA do Stevie Nicks uh she also referred to herself as um Stephanie Nicks when she came I was like what's your she like Stephanie Nicks I'm like I that that's just great she comes out she's like yeah I'm really good at um baton twirling she's like I'm really good with the Baton I'm like all right what like at what point how do you keep going all right like you you have to be like be at what point at what point is this gag like is the the punch line of like the payoff of this is just not going to work or whatever or it's going to be a stupid hidden talent and I'm like all right baton that's pretty **** stupid she starts spinning this thing around I'm like I'm **** impressed like you did it again you did it again then the final one the final one Taylor Lautner comes out you might know",
            "start": 4692.04
        },
        {
            "text": "Pretty stupid she starts spinning this thing around, I'm like I'm impressed, like you did it again, you did it again. Then the final one, the Final One Taylor Lautner comes out. You might know him from the Twilight movies; he's the wolf no shirt, the no shirt one. He had a shirt on, yeah, unfortunate. He comes out and this is where I'm like all right cool, like you. I got the feeling this was about to be the last one, and and he's just like, \"You know my name is Taylor; I'm from wherever the... I'm from,\" and I'm I'm really good at catching grapes in my mouth um from any distance at any velocity. And I'm like all right here we go, this is going to be good. James Corden walks 20 feet away with a goddamn grape and just launches it at him, and it gets right in his mouth, wow. And it's wide; how do you become good at that? I'm like I don't know, how is that a hidden talent, like you're good at this, and everyone loses their mind, am right, they lose their mind because",
            "start": 4731.24
        },
        {
            "text": "wow and it's wide how do you become good at that I'm like I don't know how is that a hidden talent like you're good at this and everyone loses their mind am right they lose their mind because they're like holy crap like he actually did it and he's like no further more velocity more distance and everyone's like what the heck James Gordon goes into the audience way far back and just launches it at him he Dives and it guts in his mouth he like jumps through I was like holy crap and then the segment ends and I was like I have no hidden talents but man that was crazy some grapes now is it that you don't have hidden talents or is it just that your hit your talent is your talent you don't think about you know what I mean like I don't think I have any hidden talents but I bet you would say I'm really good at remembering song lyrics but I that is Miller's hidden talent is that you can give him the name of please don't this please don't do this I'm G to",
            "start": 4781.08
        },
        {
            "text": "talents but I bet you would say I'm really good at remembering song lyrics but I that is Miller's hidden talent is that you can give him the name of please don't this please don't do this I'm G to give you an easy one I'm thr C I'm just you finish this I'll tell you what I want what I really really want so tell me what you want what you really really want see I don't know the next what's the next line I want to I want I want I really next one if you want my future forget my past with it yeah I was going to I was going to earlier I was when we were talking about friendship I was going to bust out Houdini with the their definition of friends you guys too young for for give me some of the stuff I don't know friends how many of us have them before I go any further I'll tell you about friends is a word you use every day sometimes you use it in the wrong way now you can look the word up again and again but the dictionary doesn't know the meaning of friends and if you asked me I know I",
            "start": 4827.6
        },
        {
            "text": "is a word you use every day sometimes you use it in the wrong way now you can look the word up again and again but the dictionary doesn't know the meaning of friends and if you asked me I know I couldn't be much help cuz a friend somebody you judge for yourself some are okay and they treat you real cool others mistake your kind as for being a fool you like to be with some because they're funny others come around when they need some money some you grew up with around the r and they're still real cool this very day I think we found your all earlier with the Adele joke and that was the end of the show no it just got that was **** awesome so then yeah so I'm trying to think of what Tim's hidden talent would be what what's a talent Tim has that we can sleep for a very long good one that is a good one you can't sleep for 15 hours and I'm like **** try me I feel like when when you were a kid you didn't learn some goofy thing that like I feel like all these things that you were talking",
            "start": 4870.36
        },
        {
            "text": "a good one you can't sleep for 15 hours and I'm like **** try me I feel like when when you were a kid you didn't learn some goofy thing that like I feel like all these things that you were talking about on the show are like goofy things that kids learn like a baton or you know you didn't take karate class or like learn how to yo-yo or I think I think a wot American Summer during the talent show where he just balances a broom on his hand you didn't do anything like that like spin a basketball on your finger or anything like that yeah I I don't think so you make good videos I think the only thing I have in my Arsenal comes from marching band oh like I the the ab I can actually uh twirl a mace we called it a mace not a baton but the drum major would mace sounds way cooler this big and had a sharp Point here like a pointy end and then it had like a ball at the top of it were you the leader of a marching band yeah I was I was the drum Maj of my marching bad can you get the photo and toss",
            "start": 4909.08
        },
        {
            "text": "sharp Point here like a pointy end and then it had like a ball at the top of it were you the leader of a marching band yeah I was I was the drum major of my marching band can you get the photo and toss it up for Jeff to see sh if you type in Nick Scarpino into Google one of the top five things that comes up is Nick Carpino, Drum Major yeah yeah you can see it there's a picture of me I posted with the ble of the Bands no we um we never won I don't think we ever won them no well it was actually a really sad story we had the best marching band I think one of the best marching bands um there we are that's picture of me um you can't tell there but it did in fact have a ponytail like Steven Zagier from uh yeah um I really like Ste a lot look how look at how serious you are about it I got so here's the deal I got to wear the cape and also drum major got the dark plume so instead of everyone else wore a white plume we got the dark plume it was very cool I thought very cool about it well that's",
            "start": 4952.24
        },
        {
            "text": "the deal I got to wear the cape and also drum major got the dark plume so instead of everyone else wore a white plume we got the dark plume it was very cool I thought very cool about it well that's the best plume and we had inverse uniforms everyone had a white top we had a blue top it's not a big deal is that it looks black and it looks super intimidating here it was cool we were the we were the Blue Star Regiment from John W. North High School how was it like big ass band did you have a big long band we were uh uh we were midsize band there were like cuz there were bands that were like I think it was like two 300 people I think we were only 120 at our at our Max um and we did field shows and all that stuff but it was really sad the last year uh my senior year we were going to the Bitwise show I forget what it was called um the biggest show like where all the bands in all the areas in Southern California will come and compete in different classes of course and we had a great band and we were",
            "start": 4998.48
        },
        {
            "text": "Forget what it was called, um, the biggest show like where all the bands in all the areas in Southern California will come and compete in different classes of course. And we had a great band, and we were going to go, and it started raining, and I was like, \"I was like,\" there's no way we're gonna get rained out. I'm like, and it just did. They were like, \"We were tournament Champions,\" that's what it's called, and they called... they had to call all the band directors, and they were like, \"Sorry, it's not happening today.\" Did you guys form... you know, form... we did field shows, yeah, we did. We did parade and field shows, like if I look down from a plane, I would see... you'd see like this. We did the Star so... Kevin, can you pull up a picture back up? So my freshman year, uh, during our opener, we formed the... the... the Star, which is our crest, so you can see it there. It's kind of a weirdly shaped star, so we and then it would just like you'd hit it, and then it would go forward on, and then it would move.",
            "start": 5032.64
        },
        {
            "text": "\"Star from which is our crest, so you can see it there. It's kind of a like a weirdly shaped star. So we and then it would just like you'd hit it, and then it would go forward on, and then it would move around, and then everyone would disperse and come back. And it was super fun. That's awesome man. But I was so... for a few years, I played trumpet in marching bands. And then when I got to high school, I was the assistant drum major, and then drum major. So we... I would conduct the band. Do you have to like run for that position? How does you how does one try out for it? I had to like practice my mace skills and my conducting. And like didn't they tell you like straight up, 'You're too fat'? Yeah, no. So so my band director, who is I'm still friends with to this day because he's incredibly Ste... no, it's not Steve. Unfortunately, Steve was in band. Steve was the uh the head of the drum line. Uh, my band director really wanted me to play trumpet because I was one of the best trumpet players that we had on the\"",
            "start": 5067.88
        },
        {
            "text": "not Steve unfortunately Steve was in a band Steve was the uh the head of the drum line uh my band director really wanted me to play trumpet because I was one of the best trumpet players that we had on the line but I was like I want to be a leader like I want to get experience leading this group I thought it would be really fun and it was but he was so **** **** dissuasive about it like he was just like I'm not going to give you any encouragement I don't want you to do this he wanted this other guy because it wasn't that hard of a **** job to like conduct the band right it was kind of you just needed someone there that would keep tempo and realistically the tempo comes from the drums you just watch his feet the entire time and you just give the rest of the band the drums reason being is because people over here and over here sound travels slowly compared to light and so they if someone over there was following you they would they would sound like they were off but in reality it would hit",
            "start": 5105.76
        },
        {
            "text": "people over here and over here sound travels slowly compared to light and so they if someone over there was following you they would they would sound like they were off but in reality it would hit the audience at the same time um but I wanted that job cuz I I was really good friends like and here's what it goes back to my brother was really good friends with the drum major at the time we used to party together and I was like I want to be like that guy and so when I got to high school he mentored me into the role and I got it and my band director was like CU I was overweight too my band director was like literally pulled me aside was like in the history and like this is super inappropriate already I can tell he was like in the history of this band we' have never had a fat drum major a like you can't like you can't you have to do something about this you saying I'm the first know I'm making history I don't know if you phrased it like that but it was something like in my brain that's",
            "start": 5142.6
        },
        {
            "text": "you can't, you can't, you have to do something about this, you saying I'm the first, know I'm making history, I don't know if you phrased it like that but it was something like in my brain that's what I heard and he was like, you were not remaking the Drum Major outfit, there's just one, we'll tailor it to you, but you have to be able to fit into it, and I was like **** did you have a montage to a montage, that's when I started Shadow Boxing, and I start, I would spend every night in the summer Shadow Boxing for like 30 minutes, my front lawn shirtless, why shirtless so that everyone could see my shame, this is a true story he did finally, and then I would literally open up the fridge and I would look in and I would see something that I wanted to eat and I would shake my head at it and I would just close it and I lost like 20 lbs, and my banter was like great you lost weight also we're getting new uniforms this year so go get fitted for your new uniform and I'm like you **** you ****",
            "start": 5179.12
        },
        {
            "text": "close it and I lost like 20 lbs and my banter was like great you lost weight also we're getting new uniforms this year so go get fitted for your new uniform and I'm like you **** you **** you he gave you a gift he changed his life he did actually that that that set me on the path to then be really overweight in college so thanks band director from that time who's probably still the band director there now and I'm just totally blowing him up because I know there's kids that go to that high school that listen to this um anyway he's a really great guy he just was trying to encourage me in his best way kids who go to high school and listen to this that to Nick school please dig out old yearbooks and send me all the candid from I all of them well I know you do but they're down are they here are they I'm in like pictures around the band room if it's still the same band room please God anyone listening you're doc this look uh I would have been drum major in 98 97 and then I was just I was",
            "start": 5218.04
        },
        {
            "text": "are they I'm in like pictures around the band room if it's still the same band room please God anyone listening you're doc this look uh I would have been drum major in 98 97 and then I was just I was playing trumpet in 96 95 so if they saw have those pictures up from that that was like 20 years ago there's no way they still They still hang in there but if if they're somewhere in the back room take a snap a pick for me I'd love to see all the old people that'd be fun anyway so my hidden talent is I can still do all of that and I do it for my S my my uh my wife and her sister when they're drunk because they think it's the funniest **** thing and they like wait wait wait wait he C together 120 people and go out to a field you just you do this thing no I'll do um so that was one aspect of it but what I used to do uh also was was called Parade band and that's when you you think that's what you typically think of a marching band which like you're on a parade route you know the Ferris",
            "start": 5253.32
        },
        {
            "text": "of it but what I used to do uh also was was called Parade band and that's when you you think that's what you typically think of a marching band which like you're on a parade route you know the Ferris wheel day off like there's a you know the doing Twist and Shout you're just Marching In ranks in columns down a street playing a song and so that's when the drum major actually was a little hard of a job because you had to start off the right Tempo you would start the band off and then they would watch the mace as it went up and down that's how they got their Tempo and you so you basically just watch but you had a routine that you would do and flippity Dippity **** throw it up in the air catch it behind me come bring it back here and then you stop and then you bring the whistle up come down and you would you would tweet a a succession of tweets like actual tweets with that you would do if any of our listeners are Time Travelers please go and record this there there's footage of it",
            "start": 5293.12
        },
        {
            "text": "down and you would you would tweet a a succession of tweets like actual tweets with that you would do if any of our listeners are Time Travelers please go and record this there's footage of it somewhere I can I can reach out to my old band director sure's got some footage somewhere but yes a thousand times yes but so but what we used to do was use to have to do what's called the Glide step and so you would the band would be judged on musicality obviously like you know that the judges would have the score in front of them so they would most of them need the marches anyway but so they would judge you based on how well you play the music but then would also judge you on how well you stayed in rank and form W and file excuse me and also how little your head would bob and so you had to master something called the Glide step which is you go heel and roll your foot so that your your plumes all the plumes just stayed like that exactly so I can still do that to this day my wife glide",
            "start": 5327.08
        },
        {
            "text": "to master something called the Glide step, which is you go heel and roll your foot so that your plumes are all still like this exactly. So I can still do that to this day. My wife says I glide through the world. It's funny. By the way, I have big calves. You get everyone with gigantic Hulk-sized calves from it because you would just be doing a calf workout constantly. Then there would always be the one kid who didn't hydrate correctly and so like midway through the bar you would cramp up and you'd see him on the field or point him out, and my band would be like, \"Who's that right there?\" And it's me, third flute over, and they'd be like, \"Drink more water, you idiot!\" It's me. You're no one, **** car. Oh my God, Jeff, what are your hidden talents? You know what's weird is I think all I am is a collection of hidden talents. I honestly have all those things I listed off to you.",
            "start": 5365.92
        },
        {
            "text": "car oh my God Jeff what what what are your hidden talents you know what's what's really weird is I think all I am is a collection of hidden talents I I I honestly all those things I listed off to you like can you do this there's like a summer when I just decided I wanted to collect those abilities I can spin a basketball on my finger I'm really good at yo-yo I can uh juggle you're still good at yo-yo I mean I'm all right I'm not gonna I'm notna walk the dog walk the dog yeah I'm not like yeah I'm not amazing at yo-yo but I'm like capable of doing half of that  I here's one I can demonstrate for you right now I'll do my Glide step if you if you demonstrate one for us right now yeah um I can I can do a a pretty awesome Donald Duck give it to me what do you want me to say wow yes I I just you want that is amazing how how long did it take you to master that um I don't know a few months of try holy  it is spot on works for the works for the audio audience as well yeah oh yeah they",
            "start": 5400.4
        },
        {
            "text": "you want that is amazing how long did it take you to master that um I don't know a few months try holy **** it is spot on works for the audio audience as well yeah oh yeah they like that one GL **** do it Kevin do we need to reset the cameras okay you would do this ready damn move at all it's not going to move oh my God beautiful it's a beautiful it was a beautiful I can't do that look at that there's no movement at all there's no movement you could you could hang a photo on that wow on that that's so level very very nice Nick very nice hurts your back throws your back in Kevin's hidden talent I've said this before but it is his ability to swim that's no joke that **** put him in water and he justes no he is and I'm like imagine that like a dolphin it doesn't make sense or imagine like a SE like a man yeah that's where he's hiding it's hidden it's beautiful in that form it's **** beautiful and I want to give a shout out to uh our friend Brennan who at your",
            "start": 5447.76
        },
        {
            "text": "Sense or imagine like a SE, like a man, yeah, that's where he's hiding. It's hidden, it's beautiful in that form, it's beautiful. And I want to give a shout out to our friend Brennan, who at your bachelor party all of a sudden put on \"Dirty Pots\" by In Sync and was just kind of like chilling for a bit. And then once it got to the dance break, he stands up and he just every single step he nailed it. I'm like, he looked better than Joey Fatone did. Looked better than leave Joey alone, really did. Jo-Fon was a 74-year-old man in that band, but yeah, I was very impressed by that. I would say that was one of the cooler hidden talents I've ever seen. You spent that summer, you know, gaining a bunch of hidden talents. I think that's what my hidden talent is - I'm so good at not being able to do pretty much anything that requires doing well. Question: I got Kevin to do things for the question becomes as you are the youngest among us and you were raised a bit differently because of that, do you think",
            "start": 5515.88
        },
        {
            "text": "much anything that requires doing well question I got Kevin to do things for the question becomes as you are the youngest among us and you were raised a bit differently because of that do you think the kind of I'm going to do a summer where I learn yo-yo and all these other weird things and juggling is that something that's fading away for kids cuz now they're on their phones they're on YouTube and I'm not saying like oh these damn kids but I remember when I had a yo-yo and I was never good at it but when I was like like you go to a flea market with your parents or some fair you get this shitty ass wood and Yoo like man this sucks but nothing else to do I'm in the car with them I got nothing else to do that you know you're sparking something in me so I think it's just different nowadays like we have different skill sets that like you guys don't necessarily have because I grew up Bo and figuring out other things there's no one in the world better than me at stalking people on the",
            "start": 5562.64
        },
        {
            "text": "like we have different skill sets that like you guys don't necessarily have because I grew up Bo and figuring out other things there's no one in the world better than me at stalking people on the internet I will I will get to the bottom of it, you go dark net almost yeah like you go I remember sometimes I go a little too deep you know just like you never want to go too deep you need to still have your snorkel up at least still talking about your morality I think I don't know I think Tim is talking about losing a soul I'll never forget when we were designing the logo for Kinda Funny and what was happening around that time span and how that was just a moment in time for you like in your life yeah you know I'm talking about I do let's not get into that but but yeah anyway there's like super internet stalking there there's a lot of times where it's like you know and it's not even necessarily stalking for like weird reasons it's like just stalking for like trying to get information",
            "start": 5599.84
        },
        {
            "text": "internet stalking there's a lot of times where it's like you know and it's not even necessarily stalking for like weird reasons it's like just stalking for like trying to get information you just do a reverse lookup of a phone number turns out some somebody's house or exactly you know it's like do I mean I've already gone this far do I bury the body now or do I burn it I don't know what's wrong Greg why is that can we make a joke about murder this man is the champion Greg show some respect I say you're on my side now well I thought originally when we started this gimmick that it was going to be us making fun of Tim Gettys he loves Nintendo more than anybody he's a huge joke of a champion my favorite thing though is your WWE style thing where like back in the day they made the horrible decisions of giving John Cena the Spinner Belt and like every time there's a new Champion I think that's really cool",
            "start": 5636.88
        },
        {
            "text": "thing where like now like back in the day they made the horrible decisions of giving John Cena the Spinner Belt and like every time there's a new Champion think I think that's really cool that they always let them design their own belt but then the problem is then they get like someone else would have the belt and then all of a sudden it's someone else with the Spinner Belt and like they're not going to hold the championship that long so it's like oh you're saying it was a spoiler yeah it just gets kind of yeah it kind of ruined everything so now what they do is they have the the belt but then they have these like plates that you put in on the sides that say their name or have their logo or whatever I like that you kind of did that with your that says Nick I'm pretty sure they also used to have to uh pay for their own pay for the pay for the changes in the belt themselves yeah I that's why I heard that one time I I like the one that unified this is what the belt is because",
            "start": 5678.16
        },
        {
            "text": "also used to have to uh pay for their own pay for the pay for the changes in the belt themselves yeah I that's why I heard that one time I I like the one that unified this is what the belt is because then it was something that was cool when it went around it was on different people when Stone Cold started getting belts and rocks started getting belts but they also they you know they had to they had responsibility of the care of that belt and the dudes like left them at the at airports and stuff and there was like all these stories well yeah there's the story of like Mark Henry losing the European title to the Rock in a NCAA football match or whatever on PS2 if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random top discussion for your amusement if you like that head over to patreon.com kindof funny where you can toss this a few bucks and get every episode",
            "start": 5716.2
        },
        {
            "text": "friends gather on this table each bring a random top discussion for your amusement if you like that head over to patreon.com kindafunny where you can toss a few bucks and get every episode early along with a bunch of exclusive perks and goodies and bonus episodes and whatnots if you have no money to toss though head over to youtube.com/kindafunny where I put up the entire show topic by topic day by day until it goes up as one big video and MP3 Jeff Cannata thank you so much for coming by hey its my pleasure real fun real fun guys get to know you guys a little better and uh yeah was really cool you're welcome here anytime youre a lovely guest oh well I appreciate that everyone should go check out we have concerns DLC all your shows check out your patreon page patreon.com concerns yeah and Im launching um something well its already happened by the time youve seen this so I say that what did you launch uh a new daily audio thing on the anchor app its Anchor Radio so",
            "start": 5749.76
        },
        {
            "text": "yeah and I'm launching um something well it's already happened by the time you've seen this so I say that what did you launch uh a new daily audio thing on the Anchor app, it's Anchor Radio so you should check that out. I'm there all right thank you so much for coming by buddy my pleasure until next time it's been our pleasure to serve you. What's up brother subscribe to us over here on YouTube go to Patreon over here uh watch other videos over here go to the Kinda Funny Games Channel over there Kevin said only had 20 seconds I 20 minutes I could have filled really easy too but you should click on all those things cuz we love you and you love us maybe kind of sort of",
            "start": 5787.4
        }
    ]
}