{
    "id": 2494,
    "video_id": "NOpgd3vMp4M",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Nick's Crazy High School Stories Continued! - The GameOverGreggy Show Ep. 172 (Pt. 2)",
    "description": "Nick's best friend Stu tells high school stories.\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/greggy\n\nCheck out Wheelie Cool Videos: https://www.youtube.com/channel/UC8oap2DZlaSe_NHVb59lPMQ\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1490079605,
    "duration": 1337,
    "transcript_chunks": [
        {
            "text": "This episode of The GameOverGreggy Show is brought to you by Dollar Shave Club. There's no reason to use a cheap disposable razor or pay a ridiculously high price for gimmicky, unnecessary nonsense. Make the smarter choice and join Dollar Shave Club - the key to getting a fantastic, high-quality shave at an affordable price. And right now, they're giving away a one-month trial of any of their razors for $1 with free shipping. How do you know these are good? Tim Gettys has been using them; he's trimming up this whole section. You might say Tim Gettys has a beard - what's he doing? But I guess if you have the beard, you still have to keep it in check. I wouldn't know because I'm like 13 when it comes to facial hair. There's no long-term commitments, no hidden fees, and you can cancel whenever you want. Get your $1 trial at dollarshaveclub.com, Greggy - that's Dollar Shave Club.",
            "start": 0.08
        },
        {
            "text": "$1 trial at DollarShaveClub.com Greggy, that's DollarShaveClub.com Greggy. Clean that's not their catchphrase I just made it up okay you guys yeah that was actually Stu Junior dating twins yeah how long did this last how how close was it when you guys got together it was very close because I feel no we didn't date at the same time no we didn't date at the same time she was he dated the nice one and I dated the really mean one yeah she was so messed up really me don't be afraid of it carry it with you do this this yeah we met she was she was awesome the drill team the drill team girls were like if you got a Drill Team girl you were like the man and they wore the tight black pants before yoga pants were even a thing yeah so yeah no these so some are going into I think our junior year I was sitting at the table and I just remember this really cute girl like laughing at me saying things and her my buddy was dating her sister who was the twin and she was he was just",
            "start": 39.36
        },
        {
            "text": "our junior year I was sitting at the table and I just remember this really cute girl, like laughing at me saying things, and her my buddy was dating her sister who was the twin, and she was he was just like came up to me afterward was like dude, you know she, she thinks you're funny, and I'm like okay, and he goes no, no, no, she, she likes you because of that, like this is a thing, she, she actually likes you because of your personality, and I'm like I don't, that's a thing I don't understand 'cause when you're in high school, like your whole so surface level, so surface, I don't understand it was the first time in my life where I was like, and she was like, you know, she was really pretty and really sweet and really nice, and so she dated like guys in my that in my brain were like **** you know better than better than me in every physical possible way, and so it was very strange 'cause I was like it was it was the absolute first time in my life that I realized that I'm like wait a minute someone can like you because",
            "start": 98.32
        },
        {
            "text": "me in every physical possible way and so it was very strange cuz I was like it was it was the absolute first time in my life that I realized that I'm like wait a minute someone can like you because of who you are and how you act not necessarily what you look like um again I had cut the Steven Seagal hair so the ponytail was gone thank God I can't even picture you without that I don't even know where it without the ponytail that haircut yeah oh man it was well parted or what was it it was like a hawked I think I can't remember okay little spiky push forward yeah it was like the spike push forward thing that was when I had a better hairline so it was it was a lot better than that um but yeah so hold on so you're telling me that there's the Twins and one of the twins was dating another one of your friends yeah so before Stu they this is so high school school it all sounds so weird and weird incestuous now but like I remember High School yeah exactly across four years um yeah so I mean",
            "start": 139.36
        },
        {
            "text": "of your friends yeah so before Stu they this is so high school it all sounds so weird and weird incestuous now but like I remember High School yeah exactly across four years um yeah so I mean so she dated me and then after she and I broke up because it's high school and that's what happens um our other friends started dating her and then the her sister broke up with her boyfriend and started dating Stu so it was literally our in our group of friends we had all dated one of the twins like just that's just the way it goes again not not disparaging them at all it was it's high school like that's just what you did when I talk about dating I mean these relationships lasted three months months and it was just like coup times yeah I touched a boob and that was pretty I went on and that was that was pretty much it um I was also like I also had a lot more Scruples back then than I do now I think because I was like I was a virgin still and like I knew that I didn't like her in that way",
            "start": 177.92
        },
        {
            "text": "that was pretty much it um I was also like I also had a lot more scruples back then than I do now I think because I was like I was a virgin still and like I knew that I didn't like her in that way and she wanted to take the she was like you know confident in herself she was like I would let's yeah let's let's have sex and I'm like I don't I'm not I don't love you well I did I was like I don't feel that way about you and I feel like it would be a like a bad thing to do if I were to I feel like I would be taking advantage of you knowing that I don't want to date you anymore and so instead of doing that I took the the high road which was just to break up with her she was like you're a idiot whatever okay and then immediately dated my friend and like they they did whatever they were going to do yeah which was like lots of sex lots of sex and I was like God damn and told Nick about it in detail all the time was my my other good buddy who' yeah yeah and I was like God damn it I could",
            "start": 226.6
        },
        {
            "text": "to do yeah which was like lots of sex lots of sex and I was like God damn and told Nick about it in detail all the time was my my other good buddy who' yeah yeah and I was like God damn it I could have like I but then I I I still **** I didn't I didn't want to take advantage of that um and then I and then I fell in love with another girl who was dating what boyfriend you tell you wish was dead this time no I fell in love with this other girl because a theater when you're in theater like that just the energy of sex like Sexual Energy in backstage is like right and so I fell in love with this girl it's true as a theater kid that's true Tim I remember the first time I remember my freshman year this girl in the play who was a junior senior whatever I remember her coming back and it was she took off her shirt and her pants and she was in her bra and panties back there it was like yes what the **** is happening there's a couple theater if I would have known about that I would have",
            "start": 265.48
        },
        {
            "text": "took off her shirt and her pants and she was in her bra and panties back there it was like yes what the **** is happening there's a couple theater if I would have known about that I would have joined theater I didn't know that it was the only time it happened in my four years of plays but oh no I'll never forget like there's the whatever like being in plays was fun but it was because you got to perform but it was also more fun because you got to be backstage and backstage when the lights were down there was just this like sexual energy and you would just lock eyes with someone and they just make out and Nick's a big flirt that was not what happened with me I remember Nick was an aggressive flirter no there was just one there was literally just one girl and I remember this one time like I'm like i' never really talked to her before and I just kind of looked at her and she looked at me and I was like and it would even say anything we just started making out I'm like this is the best",
            "start": 304.16
        },
        {
            "text": "I'm like, I never really talked to her before, and I just kind of looked at her, and she looked at me, and I was like, and it would even say anything; we just started making out. I'm like, this is the best **** life ever; it is exactly like that. That was a girl who was a couple years older. No, this girl was I think younger than I think she was a year younger. This is the one that I dated then again, uh, maybe different girl, different girl. Yeah, you're talking about the one that I... it doesn't matter. Yeah, again, very, very not a huge high school either by the way. So like, was quite large. It's it's just funny with the dork ratio to dork and cool with you guys here, and the way it all goes; it just sounds worse cuz I think I think about this too if I remember in junior high when we all started dating I had a crush on this one girl; she didn't want anything to do with me in that sense. Her friend was like, \"I'll date you,\" and I was like, \"All right, cool.\" So we started dating; we break up; my friend starts dating",
            "start": 340.64
        },
        {
            "text": "a crush on this one girl she didn't want anything to do with me in that sense her friend was like I'll date you and I was like all right cool so we started dating we break up my friend starts dating the girl I dated but and then then another friend started dating the girl I'd always had a crush on and it was just like oh my life's so is so crazy and difficult and it's just like my so-called life oh I'm learning oh yeah every time there was a breakup it was like the worst thing that's ever happened to any of us ever and then a month later when you found out that someone else liked you you're like she's the best thing that's ever happened to me I can't who was the other person doesn't matter um so yeah the next girl that I was obsessed with uh was my buddy's ex-girlfriend my really good friend's ex-girlfriend and he treated her very badly and she loved him for it and it was unfortunate and very dysfunctional and I liked her she liked him he liked this other girl and she liked me oh my God",
            "start": 377.32
        },
        {
            "text": "ex-girlfriend and he treated her very badly and she loved him for it and it was unfortunate and very dysfunctional and I liked her, she liked him, he liked this other girl and she liked me, oh my God, everybody at home writing this down and drawing it out, I feel a weird square instead of a triangle, it was a square, Everyone likes the wrong person, yeah, and it was like it was just the worst but again it's one of those things where you **** when you're in the middle of it you just bask in it cuz you're like oh that sweet High School drama **** where like all I would have liked now when I got to like my mid 20s and I start started dating in San Francisco, I'd be like hey how's it going they be like I don't like you, I'm like cool cool hey how's it going cool hey how's it oh you do cool let's go out you know like it just became so much easier because of all that drama of just being like being able to Slough it off and be like this person's just not into me whatever that was the thing I",
            "start": 416.2
        },
        {
            "text": "go out, you know, like it just became so much easier because of all that drama of just being like being able to slough it off and be like \"this person's just not into me\" whatever. That was the thing. I mean when you get to college and when you get out into adulthood about dating right is the fact that you never have to see someone again. The high school and Junior High was always the fact of \"I'm going to obsess and ask you out\" and if this inevitably goes wrong, I'm stuck with you for at least four years because there was like so there was middle school and at least in my experience, you're in Middle School, you kind of stick to whoever is in your school but then once you get to high school, middle school goes to a bunch of different high schools so it goes from all right I know one school worth of people to I know my high school plus all my friends have friends at the four other public high schools or whatever and it's like oh and then there's those private kids that you know",
            "start": 455.56
        },
        {
            "text": "of people to I know my my high school plus all my friends have friends at the four other public high schools or whatever and it's like oh and then there's those private kids that you know it just keeps on kind of like getting out and dances become this freaking mindfield of like your school has weird dance me yeah had weird dances you talking to your microphone High School had weird dances he yells at you off all the time talking to the microphone he just leans back off his you had weird dances what does that mean Kevin I mean no like your high school didn't like you said people were having sex at like on a table yeah yeah it's not weird oh my friend dud you were in high school you sex it didn't matter where you at you in high school someone had a blanket you just put it over you you have sex in the middle of **** football you guys had real high schools yeah I did not have these kind of high schools to touch me it didn't matter where we were at I was like let's go let's just let it",
            "start": 492.24
        },
        {
            "text": "sex in the middle of **** football you guys had real high schools yeah I did not have these kind of high schools to touch me it didn't matter where we were at I was like let's go let's just let it happen yeah no it was high school in San Francisco in in the 2000s was definitely a a thing yeah I mean a lot of my friends that were that were at Kinda Funny live too helping me helping us in some way they they may or may not have been having sex on tables and it's like what does that mean I need I need more context having sex on the table that part I got but I mean like everyone's over at the dance and there's tables surrounding it and some there's just a couple laid out on top of the table table in the middle of the dance and they bring in the sacrificial victims you have to you two have sex for our pleasure freshman it was it was it was home it was a homecoming dance and uh there it was in the courtyard of my school so there was a bunch of just like like lunch tables okay and bushes",
            "start": 533.08
        },
        {
            "text": "Nick's best friend Stu tells high school stories. It was homecoming dance and uh there it was in the courtyard of my school so there was a bunch of just like lunch tables okay and bushes there was a lot of bushes uh and then there's also a lot of construction at my school at the time CU it was during that that time where it was just like we need new libraries and the kids are going to learn and all this stuff like new science build God we gave up on that no I mean it was like there was definitely there was a moment in time where it was like there's bungalows everywhere like yeah you're not going to get a real building you are in a bungalow because the kids come in in a decade they're going to have a real building so there was bungalows everywhere so there's a lot of places to hide even during dens they weren't really hiding though like it was that was one of those one of those decisions I'm like you could have had sex in a lot of different places.",
            "start": 571.36
        },
        {
            "text": "of places to hide even during dens they weren't really hiding though like it was that was one of those one of those decisions I'm like you could have had sex in a lot of different places get like they could have gone to the science wing and they would have gotten away with it oh no they did not get away with it and it turned into a real bad thing of indecent exposure and all **** oh yeah no that shit's real like you can't just **** public yeah you probably can't I mean the thing is you can but you gotta find a better place than the middle of the quad, three yards away from the gymnasium doesn't work out um yeah I don't know so that was that's kind of but Stu by the way during all of this I don't think you ever like did you have a lot of heartbreak in high school I don't think you ever did really uh just with that big one crush the one Crush but that was that was about it never got over it uh no I did I did yeah that was the I",
            "start": 608.12
        },
        {
            "text": "lot of heartbreak in high school I don't think you ever really uh just with that big one crush the one \"Crush\" but that was that was about it never got over it uh no I did I did yeah that was the I love youy yeah that's that's the other thing when you get a little space like even when you got into college it was just like oh what the hell was I thinking in high school right and then College of course starts its own drama um but it's just a broader drama because you've got like 10,000 people to pick from instead of 100 well the drama becomes I'm an adult yeah I'm out I'm out and now I'm an adult and I don't have to and like I'm doing adult things and adult decisions and like you're like no like Facebook added a layer though that I don't know if you guys had to deal with maybe you did to some extent where it's like you you know you go to you have your middle school and high school experiences and they all feel like Middle School to me it was only 3 years that felt as long as my",
            "start": 648.6
        },
        {
            "text": "Nick's best friend Stu tells high school stories. It feels like middle school to me, only three years that felt as long as my entire time at IGN, you know, which was five years. Things that time felt longer than nowadays right? College by the way felt like a blink but uh after college, after you're separated from them, there's that moment where everyone starts coming back and then there's these reinvigorated huh I think it can work now moments. You get things with Facebook and be able to see people kind of grow up, it's like oh man you and I have a shot now where we're at now we have a chance and maybe when you go back to uh whatever the place is, Missou or no not so much High School yeah I guess so yeah St Francis High School in Illinois yeah yeah I mean your high school was weird though cuz it was so small.",
            "start": 686.88
        },
        {
            "text": "It is whether it's Missou or no, no, not so much High School. Yeah, I guess so. Yeah, St Francis High School in Wheaton, Illinois. Yeah, yeah. I mean your high school was weird though cuz it was so small and you guys you did the whole thing together that was the whole thing of like you're brought up of like I remember when uh my friend camps had a girlfriend that went to Wheaton North and then Poe got a girlfriend that went to Wheaton North and I'm like you guys are this is a long distance relationship how are you guys keeping this going that's insane you know what I mean. See, that's so weird to me cuz we didn't know anyone that dated people outside of North not really high school. Yeah, we I had a cousin that went to Proviso which is the which is like our rival one of our Rivals we had rivals with everyone again we were very good at sports so everyone hated us um but even then I'm like I would I would hang out with her occasionally and her friends but it just we didn't do that it just wasn't done.",
            "start": 728.8
        },
        {
            "text": "again we were very good at sports so everyone hated us um but even then I'm like I would I would hang out with her occasionally and her friends but it just we didn't do that it just wasn't done MH you just you just never had occasion to meet the other people talking about side it was like it's an urban sprawl so you don't really like you're not like they're over there during the football game we're over here during the football game we don't mesh see San Francisco was so different than that like sports was not a thing like yeah okay we had football teams but like they weren't the cool kids like they were just there doing their thing so it's like we especially at the school I was in the school I was in it's like they they they treated it differently because it was like these are the kids that want to do AP classes and like that is the point of it so they treated it like college like in my high school we would do the whole thing where we sign up for what classes we wanted we made our",
            "start": 764.28
        },
        {
            "text": "that want to do AP classes and like that's the point of it so they treated it like college, like in my high school, we would do the whole thing where we sign up for what classes we wanted, we made our own schedules, like all of that, so we could make our schedule so that we're only going to school a couple days a week or like make it so that we have pack day start 7:00 leave at 4: but like you're banging it all out or have giant lunches which is what this guy did um but anyway so wait what's the giant lunch, like a lunch that lasted like four hours, gotta thank you, it was fantastic uh so we would do a whole bunch of things but uh we were allowed to go off campus and a lot of other schools wouldn't let you do that so we would just go off be like hey our friends are over at Galileo go hang out with them and we would just go and we just meet a whole bunch of people, G is another High School, a different High School in the Marina, did you then go into classes and stuff with them, yeah we did all",
            "start": 801.32
        },
        {
            "text": "with them and we would just go and we just meet a whole bunch of people. It's another High School, a different High School in the Marina. Did you then go into classes and stuff with them? Yeah, we did all types of crazy stuff. I don't, I mean, a story I always tell is college but Alfredo just hung out with me at SF State. Alfredo at no point ever went to SF State; he just hung out with me in all my classes to the point that the teacher thought he was there and gave him a grade at the end of the class. You're kidding me? Why did he just go? Alfredo Diaz won San Francisco State's Bechtel Film Festival in 2011 or whatever, with me, and he didn't even attend the school but it says Tim Gettys and Alfredo Diaz why not? Why not aome? Yeah, that's uh, that's fascinating to me. So I brought you guys a little uh what you got here present gift okay Nick, you open it. Oh thank you, it's heavy; I've been holding for you for quite a while. Oh my God hold on oh the robot I I got that when I was 12 years old",
            "start": 839.44
        },
        {
            "text": "you got here present gift okay Nick you open it oh thank you it's heavy that I've been holding for you for quite a while oh my God hold on oh **** the robot I I got that when I was 12 years old and got my tonsils taken out I was given the whole Nintendo gift box there was more oh Gentleman Jack now hold on so we got one for Rob Rob can hold that can he really oh man that's awesome hold the old Game Boy jokes are coming true oh my God thank you sir oh man I love this Gentleman Jack was like the Tim drink in there slide in from the bottom oh slide from the B slide there you go buddy perfect perfect perfect sense I love it we got to rob the robot in Whiskey thanks go holy crap where did you get this from so I got it when I was 12 T oh wow got my out I got when I got my tonsils out I got some Pound Puppies **** Pound Puppies movie makes me cry every time they brought the Pound Puppies to the hospital and they told me when I had Nintendo waiting for me when I got home so I had to like get",
            "start": 878.88
        },
        {
            "text": "Puppies **** Pound Puppies movie makes me cry every time they brought the Pound Puppies to the hospital and they told me when I had Nintendo waiting for me when I got home so I had to like get better and eat my ice cream and nice motivate you to get out of **** bed yeah but anything that you eat when you have your time T tastes taken out it's just like feels like fire it's like you're eating fire it's it's was hard but yeah so I've held that my mom actually gave away my whole Nintendo set but because I was like displaying this in various places I got to keep that so that's the last remaining part it does work you locked out when I got my tonsils out woo like does little dance let me get a drink yo can you slide it so see how slow it would be to play with cuz now he would like drop the top down and press the button when I got my tonsils out Poppy and Grandma came they gave me uh stuffed uh like long neck dinosaurs that had their like clearly some from the gift shop downstairs",
            "start": 931.04
        },
        {
            "text": "the top down and press the button when i got my tonsils out Poppy and Grandma came they gave me uh stuffed uh like long neck dinosaurs that had their like clearly some from the gift shop downstairs like all right thanks for I mean I'm glad I'm not dead or whatever you big land before time I wasn't no that was a very out of touch gift with me I did not have anything you don't like dinosaurs you don't like space you don't like fun Clips without touch my questions to yes sir is we've heard a lot about Nick Scarpino was Matt Scarpino torturing you during this time not torturing me he was he was like my surrogate older brother um so he was are you an only child or you no I have an older sister um oh right you mentioned this earlier yeah um but no he was like he was always coming home from parties telling crazy sex stories and just like which I I actually tried to remember like a few I can't they all must have just blown my mind when I was that age I was able to retain anything um but crazy",
            "start": 973.6
        },
        {
            "text": "telling crazy sex stories and just like which I I actually tried to remember like a few I can't they all must have just blown my mind when I was that age I was able to retain anything um but crazy stuff in the butt and all over sounds sounds like Maserati, that sounds like Mascara so yeah so student had an older brother my brother when we became friends we were in seventh grade Matt was in high school at this point right and so we followed his Shenanigans and his Antics all the way through high school when he was in high school all the way to when he was in Sigman, now out in Cal State he just between Scarpino and a frat I can't imagine I can't imagine it was so hilarious to watch the crazy **** that they would do like they would throw parties and it would look like like they would do Florida ceiling like uh uh drop cloths like tarps so it looked like a Kill Zone like it looked it looked like a slaughterhouse like for for a serial killer right but they would rage at these parties",
            "start": 1018.48
        },
        {
            "text": "Nick's Crazy High School Stories Continued! - The GameOverGreggy Show Ep. 172 (Pt. 2)\n\nFlorida ceiling like uh uh drop cloths like tarps so it looked like a Kill Zone, like it looked it looked like a slaughterhouse for a serial killer right but they would rage at these parties with people and like it was I mean I went there to one time with them to cuz he had to stop by to get something he had forgotten and I was like I don't understand it was so Matt Scarpino there were gigantic trash cans full of ice and beer strategically placed so that you never had to go more than a foot to get a new beer or a new like a new cocktail, like it was always just perfectly there everything was like tarped down so they wouldn't ruin the floors and like they had the the the pledges would go out to all the neighbors and like just like smoo them over and like bring them stuff so that they wouldn't complain and so they had this whole thing down to a system and man they would party and then but when Stu and I would party a lot with him was when my parents would go out of town",
            "start": 1064.24
        },
        {
            "text": "they wouldn't complain and so they had this whole thing down to a system and man they would party and then but when Stu and I would party a lot with him was when my parents would go out of town to Vegas right uh they would do an annual trip to Vegas or Laughlin sometimes but um they would do this trip with their friends and they would leave us for like four or five days and my mom come over there and live there oh yeah Stu just lived there like there was one time they did it over they went to New Orleans for for like a week and still just lived at my parents house for a week and all we did was sit in we put lawn chairs in the pool with coolers of ice in the pool so that we never had to go inside unless we wanted to play Mario Kart like Mario it was Mario Kart goes inside then we cool off and we kept it so cold that it would make your nipples hard the second you walked in didn't I think I remember this didn't they get like the air conditioning bill it was a good $600 to $700 I think it",
            "start": 1103.2
        },
        {
            "text": "we kept it so cold that it would make your nipples hard the second you walked in didn't I think I remember this didn't they get like the air conditioning bill it was a good $600 to $700 I think it was the air conditioning Bill the hot tub we ran in the hot tub con yeah he there we were just like cuz at night we're like we got to get hot then we got to go in the house to get cold and it was like we would just it was just I I just remember it was a week long of just people coming into the house and I like hey what's up and they would stay and then they would get burned out from the party and they were like I got to go home dude and they would bounce out Meanwhile my brother's just going every day still drink a beer in his hand and he's like come on you got to drink more and so that was that was kind of how we grew up with Matt was he was just he would always just bring the party and no one ever got hurt though that was the best part like no he was good he if you were drunk you",
            "start": 1136.4
        },
        {
            "text": "was that was kind of how we grew up with Matt, was he was just he would always just bring the party and no one ever got hurt though that was the best part like no, he was good; if you were drunk, you stayed like you slept, you slept on a couch, you slept upstairs, like you didn't drive home. But uh, it was fun. Matt and I had some stuff in common too. The first time I came over to Nick's house for his birthday party, Matt was playing his dad's drum set; um, when they had like Rototoms, it was like, oh what this guy R... so right off the bat I was like, oh this guy's cool, and he was also into car stuff, like stereos. He was told when you got your subwoofer, my brother had an even bigger sub; I love that, go to Circuit City and spend a lot of money on Circuit City. My brother borrowed $120 from me that I had saved from lunch money in junior high, and he was like, \"I'll pay you back, I promise,\" and I was like, okay, and I just handed him a giant wad of cash.",
            "start": 1169.32
        },
        {
            "text": "borrowed $120 from me that I had saved from lunch money in junior high and he was like \"I'll pay you back, I promise\" and I was like okay and I just handed him a giant wad of cash and he immediately went and bought an Alpine CD player with his car - he had saved some money too but probably spent $1,000 on it I never saw that money Matt, are you sure it was worth it? Oh my God, I mean Matt Scarpino is such a treasure just in every sense - treasure for me, I just love that like I you know to take him down a notch I love that even then I knew him he must have been thinking \"I'm gonna make this little guy think I'm the coolest person there\" definitely oh there's a drum set happens to be just conveniently placed right here I'm going to play it for **** yeah and everybody thought Matt was the coolest too, oh yeah they were right, friends yeah well Matt was the reason why I got into theater",
            "start": 1210.56
        },
        {
            "text": "going to play he's going to rip it for yeah and everybody thought Matt was the coolest too oh yeah they were right friends yeah well Matt was the reason why I got into theater and his buddy Dave who was the drum major at North was the reason I got into band and one want to be a drum major because he like I saw him do it I was like that sounds really cool fun which Dave was the marching instructor both Nick and I won best freshman Marchers that's right at B Camp that's right because he taught us we were groomed for high places from the start yeah yeah keep looking at you I don't know if you want to end this topic or not well that's what Kevin's texting me you can always just ask Kevin it's fine this show is the show I think you have to worry too much about I thought we was going to do an hour long and break it in half right that made sense to me and keep you on your toes by the way Kevin thank you to all the people who supported us",
            "start": 1251.28
        },
        {
            "text": "Worry too much about. I thought we were going to do an hour long and break it in half, right? That made sense to me. And by the way, Kevin, thank you to all the people who supported us on Patreon last month - there they are! I know what direction they go anymore is go up, never down, never done so. What's the Nick story we need to know what's the Nick story we're missing? Cuz we literally spent 45 minutes being about all the weird incestuous girl relationships you guys had, which is all there is to high school, though. At the end, like really, is there more? It's like these guys were **** friends and there was a lot of girls involved, right. Hey, thanks for watching! You can subscribe to the channel here. You can support us on Patreon there. You can go over to Kinda Funny Games support us there because we put up a whole bunch of other shows and things that distract you. And then you can click on that mystery box, Kevin - what's the mystery box playlist?",
            "start": 1288.92
        },
        {
            "text": "Kinda Funny Games supports us, there because we put up a whole bunch of other shows and things that distract you, and then you can click on that Mystery Box playlist. The playlist is it's got a whole bunch of playlists of things we've done before.",
            "start": 1326.8
        }
    ]
}