{
    "id": 2901,
    "video_id": "AA9DD4K7stY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Troy Baker (Special Guest) - The GameOverGreggy Show Ep. 193 (Pt. 3)",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/greggy\n\nThe Kinda Funny store is having an End of Summer sale! Shop through August 20th for up to 40% off select items-  https://goo.gl/E3TpJN\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1502866800,
    "duration": 2271,
    "transcript_chunks": [
        {
            "text": "\"Hey, you know what? You need razors. You know what The Dollar Shave Club has? Razors. So stop paying so much for razors and join The Dollar Shave Club, you hairy person. They let me write this ad, and I know you like being insulted a little bit, don't you? You hairy degenerate. The Dollar Shave Club is the smarter choice. Get a great shave at a great price conveniently delivered right to your door. Think of it as a life hack that keeps you near your video game console and not out at some store being eyeballed by that cashier. Yeah, I know you're looking at me, Tony. What are you going to do about it? Tim uses The Dollar Shave Club's executive razor with that Dr. Carver shave butter, and you know what he's always telling me? He says, 'I'm a smooth boy, Greggy.' And then he takes a bath. For a limited time, new members get their first month of the executive Razor with a tube of Dr. Carver shave butter for only $5 with free shipping. After that, razors are just a few bucks a month - that's a $15 value for only\"",
            "start": 0.0
        },
        {
            "text": "members get their first month of the executive Razer with a tube of Dr. Carver shave butter for only $5 with free shipping after that razors are just a few bucks a month, that's a $15 value for only five bucks, there are no hidden fees, no commitments, cancel anytime you like, you can only get this offer exclusively at DollarShaveClub.com/greggy. That's DollarShaveClub.com/greggy. Kevin made me read this ad multiple times against my will so I didn't laugh okay what have you gone on a trip yet with your lady? No, with your older elderly we're we're driving to LA this weekend actually nice okay to a friend's wedding I which is  traveling a thing for you  like what Kevin Jesus this to give you a GL the Friday all the cool kids are going to Kevin CO's bachelor party in Las Vegas and it's about to ridiculous this guy has a wedding he has I'm going to one of my best friend's weddings in LA gone now they don't they don't matter anymore he keeps saying best friend too we've never",
            "start": 50.68
        },
        {
            "text": "it's about to get ridiculous, this guy has a wedding, he has one of my best friend's weddings in LA, gone now, they don't matter anymore, he keeps saying \"best friend\" too, we've never heard this guy's name, my best friend says we were like four years old, Kevin, named that's a lie, you made wow, he just pulled out Hero Miguel ji okay, Miguel Hernandez um okay well you're going to miss a fun dude Vegas bro, you want to come to Vegas, he said he I am in Boston, you always have an excuse, I would I I seriously totally be there Shenanigans, I recommend you listen to not next week's episode of Game of Thrones great weeks we're definitely going to get into the stories of it Andy you should be there too wait are you are you guys going to shoot from there are you going to no no no this can't be this can't be filed to our social media accounts there'll be some so where you can we can you say where you're saying no we don't want to say that on camera okay we're going to do that afterwards but I do want",
            "start": 113.48
        },
        {
            "text": "be filed to our social media accounts there'll be some so where you can we can you say where you're saying no we don't want to say that on camera okay we're going to do that afterwards but I do want to point out that it'll be actually a really good episode so again to what he's saying for programming note tomorrow live we're recording with Anthony and Guber so that'll be the week after Troy's but the one we're recording it'll be the Kevin Kevin Bachelor story is M turny so that'll be a great pairing for everything that's about to be wa wait money yeah you ever heard of her yeah she's going to be on the show for former coworker of mine cuz I used to let you no they're not they said they're they're having a lot of TR trouble they wish they had a a Content plan as strong as we did with all your party modes that are doing so well oh thanks thanks good segue we're just trying to make sure Andy doesn't leave ever understood because it's one of those Andy is too talented wait I oh so",
            "start": 167.16
        },
        {
            "text": "all your party modes that are doing so well, oh thanks, thanks good segue, we're just trying to make sure Greg doesn't leave ever understood because it's one of those Greg is too talented, wait I, oh so this is the question is it is traveling uh is it your thing like it is my thing I I don't feel I feel so comfortable on a plane I love flying I love the whole process of flying I love it okay you're a monster I I love no are you not I hate it I hate it so much you're you're cramped okay so here's the first class once okay that's the key the key is they all spend a lot of money no no no no no not necessarily just commit to somebody now if you're like Greg and I you you you hit your star or hit your wagon to the wrong star and they get bought by Alaska Airlines now for the record though every time I fly Alaska I get upgraded to first class now because I'm Virgin America gold so it does transfer yeah okay oh yeah I know your your points and everything transfer yeah yeah yeah I just know if you're",
            "start": 205.96
        },
        {
            "text": "I fly Alaska, I get upgraded to first class now because I'm Virgin America gold so it does transfer, yeah okay, oh yeah, I know your points and everything transfer, yeah, yeah, yeah. I just know if your status, do your status does. I have my Alaska VIP whatever but then I just complain about American Airlines once and they moved to gate and got me a cart to drive me. I think I might switch over there. We've never told the story on the way we've never told the on the way to Rooster Teeth to RTX, I was uh I was obnoxiously late it was like the most Andy move ever so I get I get a text so Andy's the most timid like I don't want to deal with problems no no no check this out Troy girlfriend this is ridiculous I get attacked like eventually me Nick, Nick's wife and Gia get into the the gate and we're all hanging out just waiting for this thing and Nick's like is what's up with Andy is he going to be here and I'm like oh yeah I'm sure he's fine like we don't need to worry I get a text from Andy hey when",
            "start": 255.4
        },
        {
            "text": "out just waiting for this thing and Nick's like is what's up with Andy is he going to be here and I'm like oh yeah I'm sure he's fine like we don't need to worry I get a text from Andy hey when are you guys going to get here I'm like oh we're here dude we're like in the gate and he's like oh man I've been waiting for you guys out at before security now that's a great question why would for like 40 minutes why why would you wait before I understand this is your first work trip with us ever we **** up we should talk I've never had anybody buy tickets for me right I've never had a company buy plane tickets I'm used to like oh so I'm sorry when Rooster Teeth was sending you all over the world to meet your fans they weren't sending well I was showing up with employees at that point so so this time I showed up by myself right I didn't know I could **** just swipe a card and have my identification like **** pop up on the screen or whatever so I'm waiting so I'm waiting for Nick",
            "start": 301.64
        },
        {
            "text": "so this time I showed up by myself right I didn't know I could just swipe a card and have my identification like pop up on the screen or whatever so I'm waiting so I'm waiting for Nick and Tim I've been waiting for Nick and Tim I got there like an hour and 20 minutes before the plane is about to take off um and I'm just waiting I'm like man where are these guys and eventually I'm like I got to text them cuz like they're not here yet I got to figure out what the heck to do right um and I've taken I've been on several planes right like I know the process I'm taking I've been on Southwest I've been on several which is actually three at least seven at least seven so I don't know is many two three is a few actually so I didn't know that I could just use my debit card right so I text him I'm like hey uh are you guys here and he's like yeah we've been here I was like oh man by this point the line to check a bag is so packed and I'm like how long are you gone for huh how long are you gone",
            "start": 337.2
        },
        {
            "text": "like hey uh are you all here and he's like yeah we've been here I was like oh man by this point the line to check a bag is so packed and I'm like how long are you gone for huh how long are you gone for um like 4 days borderline I always take a bag I have to take my hairspray you think this happens naturally you think this happens naturally trust me okay you can get that stuff down I can tell you okay so I'm like all right this line's packed and Tim texted me he's like dude there's a red carpet area from Virgin America they'll just like go over there and like tell them that you're really desperate I was like all right I've got to do this like and I hate doing this Troy I hate doing this I hate being the guy that's like trying to get something for free or trying to like I hear you like I hate that stuff dude even when I was a fan of Kinda Funny I hated talking to them because I'm like I don't want to be a burden to these dudes like I'm just a fan like I don't need to go say",
            "start": 382.04
        },
        {
            "text": "like I hate that **** dude even when I was a fan of Kinda Funny I hated talking to them because I'm like I don't want to be a burden to these dudes like I'm just a fan like I don't need to go say hi if they're busy they're **** busy I'll talk to them whenever you know um I just hate being that dude so I had to **** I had to bite the bullet and I I went to the red carpet area right and there's like one person in front of me as opposed to like the 15 people in line for the check bags and I'm walking up I have a Virgin America card a Virgin America credit card not the like top level one no no just one the standard like silver member or whatever so I walk up and I'm like hey I'm uh here to get my thing and I just like show the card she's like oh okay but I you know I had to act confident I had to act like I belong there exactly you're supposed to be I show her the card and she's like oh are you a virgin or are you an Alaskan card member and I was like no but I'm Virgin America so I",
            "start": 430.88
        },
        {
            "text": "I had to act like I belong there exactly you're supposed to be I show her the card and she's like oh are you a virgin or are you an Alaska card member and I was like no but I'm Virgin America so I just like kind of did that thing she was like okay uh when's your flight when do your flights leave I was like um like 20 minutes and she was like okay we got to get you out of here we we got to go so like Tim texts me hey we warned everybody that you are running very very late we warned the people at the gate that you were like on your way so I do the **** I check my bag and it's all good she's like all right we got to priority you you checked your bag 20 minutes before your flight yeah and she was like hey this is PR we got to get it on there so then I run right so then I run to the security area and the woman in the security line is like uh she's like when does your flight leave I was like Anton she's like well there's something in your bag that we need to check in your backpack",
            "start": 470.16
        },
        {
            "text": "security area and the woman in the security line is like uh she's like when does your flight leave I was like Anton she's like well there's something in your bag that we need to check in your backpack your carryon right **** **** so she looks at a two-gallon jug of water it's not water it's urine for no reason no I forgot it was oh you know what it was it was my uh it was my AC acne wipes it's my acne wipes that sort of like blew the trigger or whatever she's like when did your flight leave I was like H like **** 10 minutes she's like oh God we got to get you out of here gave me the thing I'm **** doesn't matter if you have a bomb we got to get I'm sprinting to the **** plane just running like this Greg Miller I'm sprinting horribly way like Kermit the Frog running like Kermit the Frog yeah so I'm running and she's like uh and as I'm getting to the gate the guy's like Andy Cortez you're running late and I was like I sure am so I like got there and thankfully everything was good or",
            "start": 512.32
        },
        {
            "text": "yeah so I'm running and she's like uh and as I'm getting to the gate the guy's like Andy Cortez you're running late and I was like I sure am so I like got there and thankfully everything was good or whatever but dude that's the most nervous I've ever been before a flight I've never had that happen to me in my life now being on the other side of it I had to deal with Nick who I don't know Nick does not deal well with where's Andy why is it end here and I'm trying to be cool I'm trying n Andy got this man Andy got this meanwhile I'm like **** texting I'm going to read you guys the text between me little did you know I was sitting like waiting for like an hour you're like Spider-Man Homecoming in front though is I went up to the dude and I was like hey man I'm just letting you know one of my friends is running late can we stall This Plane as long as humanly possible and he he was a cool dude like you know what we'll do what we can but we have to leave at this certain time there's",
            "start": 554.52
        },
        {
            "text": "of my friends is running late can we stall This Plane as long as humanly possible and he he was a cool dude like you know what we'll do what we can but we have to leave at this certain time there's nothing no way around look alas about to my ass I was like I was like well I call him doesn't like Mexico I was like I call him Andy but like his his name is actually Andes I was I'm not even going to try but it's a n d r e s yeah it's like Andres yeah I'm not even going to there's a fun way you say it that I just can't do yeah and I'm like so just call him Andy if you see him so that's why he called you Andy but let's go through here uh you you just go at 9:35 a.m. you're not here yet right I was really nervous and I go yeah we are oh **** I've been waiting out near the line we're at the gate I don't have the confirmation in for or anything just swipe your credit card in the thing and then like I send him the confirmation picture and he",
            "start": 593.4
        },
        {
            "text": "been waiting out near the line we're at the gate I don't have the confirmation in for or anything just swipe your credit card in the thing and then like I send him the confirmation picture and he goes man I'm an idiot I'm waiting line now to check my bag I've been here since 8:30 LOL not LOL oh no tell them you're running late if there's no line on the carpet area I would just go there and tell them you're **** he sends me a picture of like how long the light is it's packed here I'm like no no no no the red carpet I don't know what that is the pre-check bag check like the line for Virgin gold people there's an actual red car and I look there it is I'm on it let me check okay they let me do it in line for security I'm like they just started boring you got to be aggressive man he goes KK and I was like ask people if can cut you got this how far out are you I asked them to stall as much as possible you got 4 minutes dude but you so you were asking me this stuff as I was getting in line for",
            "start": 636.28
        },
        {
            "text": "was like ask people if can cut you got this how far out are you I asked them to stall as much as possible you got 4 minutes dude but you so you were asking me this stuff as I was getting in line for security I'm just looking at my phone like I don't want to like I'm so like I'm so nervous about missing this flight and we all were on the flight Andy Cortez gets on check it out I'm like I've been a fan of The Razer Teeth podcast forever and all they always talk about is like problems with flights and like problems with being late to their check-in or whatever and like this whole time I've been so proud that like on the 15 flights I've taken in my lifetime oh now it's 15 I've never had to worry about being late and this is the one time that I was like I **** this up for me it's the biggest change about hey how are you could see you try it's the biggest change about what Kinda Funny's become in the way that it's no longer just what was the four of us the five of us and we brought all the",
            "start": 687.16
        },
        {
            "text": "about hey how are you could see you try it's the biggest change about what Kinda Funny's become in the way that it's no longer just what was the four of us the five of us and we brought all the well it's cuz we were all so seasoned at traveling that why would I ever think to explain to him how to get on a plane and it wasn't until we were because this is you know where the story is going where I Andy should I didn't think I'd have to tell him just cuz I I think of Andy as a full-blown adult who knows what he's doing why would he have to be told about this but it was when we were packing up to go to E3 and we're all going to come to work do some work and then go to E3 and cool Greg shows up cool Greg shows up with a plastic shopping bag full of clothes and we were like what's that and he's like it's my clothes for the week in LA we're like we got to get you some kind of luggage to defend him a little bit he thought he had a backpack at home the guy at the Tumi store at the airport was",
            "start": 726.76
        },
        {
            "text": "he's like it's my cloth for the week in LA we're like we got to get you some kind of B to defend him a little bit he thought he had a backpack at home the guy at the Tumi store at the airport was like finally there's a reason why I'm here oh no no we took care of him before that he he came here thinking we'd have some kind of bag we went in into the closet at the giveaway closet and we had uh these ThinkGeek uh Zelda Shields and so we took one of those from Breath of the Wild and stuffed all CL it's a Zelda Shield but it's a backpack so it's a circular backpack I dig it about like 3 in deep maybe you he packed it full that's my favorite thing about it show show the people show the audience too my favorite thing about it was when we were at the airport and it came out of the security the security scanner um whatever the hell it's called the what's it called belt and it falls off and it rolls away like 15 as I was waiting there I see cool Greg's bag like roll three feet yo",
            "start": 773.84
        },
        {
            "text": "The security belt and it falls off and it rolls away like 15 feet as I was waiting there, I see Greg's bag roll three feet - that's mine. Sorry about that. They fit them; they fit cool Greg's everything. What's this topic about Troy Baker whole show? I was just wondering the whole point of me even bringing this up is that if travel is a thing for you, like if you want to do that, I cannot recommend traveling with your partner on a romance - the lady, yeah, you just need to know what you're getting into. Like I did that one of the first things we did was let's go and play together; how's this not your second date? Right, this is beyond like \"ooh, we're something special\" maybe a month then okay, we went to Vegas, uh, and then I was like, okay, you're cool now, I need to say you travel internationally. So within a couple months we did, and she could correct me, uh, but I know for fact it was New Year's Eve.",
            "start": 818.6
        },
        {
            "text": "to Vegas, uh, and then I was like okay, you're cool now. I need to say you travel internationally. So within a couple months, we did, and she could correct me, uh, but I know for fact, uh, was uh New Year's Eve, like we started dating in October, so that New Year's Eve we were in Mexico, and I was like, \"I need you to travel; I want to see you go through Customs; I want to see you pack like crazy.\" The Troy Baker trials here, see? Because I like look this is a thing for me. Like I, I love traveling. I believe look we have looked for trillions of miles in every direction and we still haven't found a place like this so I believe that you have to explore every inch of this planet, and there's something that's first of all something so that is so humbling when you go around the world and you see both the the similarities um and the differences and you realize that you fit in into this much larger it gives you a more of a macro view of who we are as a as a people and you're not so closed off and and you",
            "start": 870.8
        },
        {
            "text": "similarities, and the differences, and you realize that you fit into this much larger it gives you a more of a macro view of who we are as a people, and you're not so closed off. And, and you also see that everybody struggles with the same things, and so you're just kind of like all connected in that. So that helps. But as far as like traveling with your partner, there's nothing to me that's better about that. Because when you go to some place that's foreign, and the only thing that's familiar is the person that you're with, A) that better be a really good hang, and B) it just galvanizes the two of you because you're you're like let's get lost together, and you feel more adventurous, you're a little bit more whimsical. Um, and some of the best experiences we've had, like the first time Pam and I went to Paris, um, we're sitting at this little sidewalk café, and I'm like this is this I've been waiting to come back since I was 13 years old with my lady in Paris, like this is what",
            "start": 925.04
        },
        {
            "text": "Pam and I went to Paris, um, we're sitting at this little sidewalk cafe and I'm like, \"This is it, I've been waiting to come back since I was 13 years old with my lady in Paris. Like, this is what I've been waiting for.\" We're sitting there; it's this beautiful spot, and they're bringing us wine. We got bread and cheese and **** and this guy walks up, was Alfred, he goes, \"It was Alfred just like in The Dark Knight Rises, man, good movie, great movie.\" I across and see your face, no, terrible, terrible, just in the movie when he flies off, God damn it. Uh, but this guy comes like, no, no, no; he holds up the sign, he's like, \"I don't know what you're saying, man, sorry.\" He's like, okay, and he leaves. The guy was taking care of us comes over and he goes, \"Who is it?\" I was like, \"Just some guy who's asking for money or something.\" He goes, \"Did you have anything on the table?\" But no, I didn't; son of a **** where's my phone? And he put down the sign, grab the phone, leave.",
            "start": 971.44
        },
        {
            "text": "some guy who's asking for money or something he goes did you have anything on the table but no I didn't son of a **** where's my phone a and he put down the sign grab the phone leave fight blue and so there I am in Paris no phone **** and I went I started run after the guy and I looked I was like okay I'm in Paris with my girl on a beautiful day I have two options here I can be a douchebag and I'm going to **** go chase that guy down and get my phone back never going to find the guy Telltale choices came up or do I go back to her and go let's get another bottle of wine and she thinks I am cool as **** this guy can afford multiple phon so that's what we did it's a $600 phone like my favorite one of my favorite memories in Paris so I just I think that that traveling with your partner if that's a thing for you if you don't give a **** and you're like I I just want to live on a farm and like not do anything then don't worry about it but if it is a thing for you get in a car yeah",
            "start": 1018.72
        },
        {
            "text": "if that's a thing for you if you don't give a **** and you're like i i just want to live on a farm and like not do anything then don't worry about it but if it is a thing for you get in a car yeah or get variation of it Farm maybe not but like somewhere with a computer in a bed you have to bait people stealing your phone Tim like hey you want this I will tell you a story though Troy Baker told first time I ever had a flight with my girlfriend G. Haring uh we were flying to Austin and I had to understand how she is in a flight which is very cuddly which I'm like all right cool I'll deal with this uh we don't even start don't even start we watched a movie called Batman Begins oh i've heard of it and now i've seen this movie film foreign film yeah this will give you a good window into G. Haring so earlier you asked me did I teach Gia anything she brought me the Bachelor what did I bring her I brought her The Interview",
            "start": 1073.24
        },
        {
            "text": "Harris, so earlier you asked me did I teach Gia anything? She brought me The Bachelor. What did I bring her? I brought her Batman. So we're watching Batman Begins and there's a pivotal moment in that film where um there are two parents in an alley with a young Bruce Wayne and they get shot and die. (spoilers) She audibly gasps, could not believe it that Bruce Wayne's parents were dead and that's what made Batman. And I was like, I had to pause it, that's going to **** with him. Like I loved it so much, I hope he bounces back from this, I hope he doesn't hold it forever. What happened? He goes to an orphanage. Oh my God, it was so good though. I had to stop and be like Nick, she didn't know, she didn't **** know. She's like the soft reboot of Iron Man, she just like missed everything, her first introduction to superheroes being Nolan's Trilogy. Oh wow, what a bar is just... I mean well, the first two.",
            "start": 1117.92
        },
        {
            "text": "**** know she's like the re soft reboot of Iron Man, she just like missed everything, her first introduction to superheroes being Nolan's Trilogy, oh wow what a bar is just I me well the first two movies **** you it **** over third one's good, everything, everything man no come on defensively the third movie I don't even think Nolan wanted to make that movie, yeah and he's talented, Christ it's not just me saying it was of a whole bunch of stuff you weren't sure what you wanted to do Dark Knight Rises or Batman v Superman, what's the better movie Dark Knight Rises 100% thank you that's all see you won't get an honest answer out him because has Superman in it, yeah I know it's the better super can be blowing an here's the holding up a Nazi flag and be like I mean it's still good it's an interesting interpretation of the character you're a **** you're a **** I'm just saying for Dark Knight Rises it wasn't a good Nolan Batman and it wasn't a good comic book movie and again I will to this",
            "start": 1169.28
        },
        {
            "text": "interpretation of the character you're a **** you're a **** I'm just saying for The Dark Knight Rises it wasn't a good Christopher Nolan Batman and it wasn't a good comic book movie and again I will to this day I will always say I've said this since that movie happened I this is not a Batman v Superman thing I will always come up and be like I like Batman v Superman better right I think it's a better comic book movie your mom's name was Martha 2 there's a lot of level there do you understand cuz Bruce is a human and this is the first time he sees the alien K as a human get I don't know if you do I need to get I need she goes to the chopper where you going get her to Gotham just just over there I if you guys are busy had no idea that there was a river separating Gotham from Metropolis looks like your Dark Knight has betrayed you Greg no cuz we're still together that The Dark Knight Returns isn't a good movie no I'm not saying that it's a great movie I'm saying that it's better than Batman v Superman",
            "start": 1218.0
        },
        {
            "text": "your Dark Knight has betrayed you Greg no cuz we're still together that The Dark Knight Returns isn't a good movie no I'm not saying that it's a great movie I'm saying that it's better than Batman v Superman that's your only argument yes oh okay that let's get I want to be on the same page with you The Dark Knight Rises is it a bad movie or is it just bad at all can you trust this guy who doesn't like dude The Dark Knight if you guys want to talk about Game of Thrones being overhyped The Dark Knight Rises hate is on a whole other level of like watch the movie again Bane goes into the like they go into the stock trading center right yeah here comes a really cool moment he's going to tank the market he's no he's going to take every hostage and blow stuff up but okay there's that too he goes in before the Market opens right and then he's there for 15 minutes and leaves it's pitch black and it's pitch black why because we got to show the Batwing lazily flying traps all the cops underneath there and they always",
            "start": 1266.76
        },
        {
            "text": "right and then he's there for 15 minutes and leaves it's pitch black and it's pitch black why because we got to show the Batwing lazily flying through traps all the cops underneath there and they always come out clean. Shaving Nolan was in a rush, guys, minor issues it's a movie I don't think he busy working on here no this is my thing this is my thing every stop for a second my problem with these small things we're calling out yeah there are small things they're dumb Nolan did such a great job with the first two movies of so real Rises is not nearly as good as begins or Dark Knight I would never argue that but to argue that it is your real name Robin oh there you go with that that's fun that is I will fight people that is fun I will F I will f i I've been waiting for this for a long time go to the pl Kevin this isn't a you Kevin's my dude he's my muscle he just had to take his shirt off a this is like I feel like I'm at the weirdest Thanksgiving dinner right now we've all",
            "start": 1313.6
        },
        {
            "text": "for a long time go to the play Kevin this isn't a you Kevin's my dude he's my muscle he just had to take his shirt off at this is like I feel like I'm at the weirdest Thanksgiving dinner right now we've all been at Uncle Greg is just like he starts crying for no reason and dessert hasn't even come my little Carlos from Arizona that you mentioned have you ever seen you like the new boyfriend that my sister's dating that I haven't quite figured out I want to be cool with you like go outside every once in a while to go smoke and Mom's weird about it but I kind of want to have a cigarette with him middle gear Sal cool um I I uh have you seen Following no okay if you want to talk to me if you want to distill Christopher Nolan down to his quintessence he and Jonathan Nolan both watched his first movie which is called Following it's black and white um it makes Memento look like it's linear it will **** with you it is beautiful Hitchcock um great storytelling character-driven movie um and it's all",
            "start": 1363.36
        },
        {
            "text": "called following it's black and white, um, it makes it make sense, look like it is linear, it will mess with you, it is beautiful Hitchcock, um, great storytelling, character-driven movie, um, and it's all about a guy who gets becomes obsessed with following people and one day he follows the wrong person on Twitter. The prequel, oh, where do you stand on The Prestige? Okay, so this was a I know I T I was like do I have strong opinions about The Prestige, I don't know about that, do you how do you feel about The Prestige, um, it's so good we got to bring bourbon back to the game show, we did it on The Kevin Show and it was nonsense by the end we were all speaking in tongues, Shai. Um, I think it's a great movie, it's a great movie, yeah, I think that first of all you got David Bowie yes as Nikola Tesla as Tesla, um, this is like the weird thing where the it was early 2000 but like late '90s early 2000s there was a whole thing was like we offered a choice A and a choice B we had",
            "start": 1423.12
        },
        {
            "text": "the magician movie Yes you but this is like the weird thing where it was early 2000s but like late '90s early 2000s there was a whole thing was like we offered a choice A and a choice B we had a Coke for every movie you had Armageddon you had Deep Impact you had The Prestige and then you had The Illusionist you had all these different choices like it was probably the most frustrating time for writers in Hollywood oh what was Volcano or The Core no no no no no uh or um Dante's Peak bam I can do my shitty movies all day long dude Dante's Peak they got over that death really quickly by the way all right keep going with the grandmother no no no with the main dude in Dante's like no no no maybe it was Dante's Peak is the one with Pierce Brosnan no I'm thinking of The Core oh yeah oh they get crushed they they man they they got over that death really quick Delroy Lindo yes burned up yeah Delroy Lindo pull that um bye Tim bye Tim where's Tim",
            "start": 1489.88
        },
        {
            "text": "I'm thinking of the core, oh yeah, oh they get crushed, they they **** man, they they got over that death really quick. Del Toro yes, burned up, yeah, del Toro. Pull that um bye Tim, bye Tim, where's Tim going? Bathrobe twice, no, now got car. The I'm afraid that if I if I leave like I will be so far out of the conversation I'll come in. I was like it's kind of like we are moving quickly you come back we talk about like M. Night Shyamalan's Avatar or something, no, that's even still linear from this um hold on hold on what what I do Tim's gone okay Andy's in Andy's in let him throw something out let's talk about what Andy wants to talk about is this a new topic I mean what the the whole show has just been maybe it's just been random pop shots. What do you want to know about uh what do I want to know about Troy? What are you talking about sure um I'm saying Andy there's a GameOverGreggy show blank page in front of you, you say something and we'll all keep vibing off of it, you keep killing the vibe like you're",
            "start": 1539.28
        },
        {
            "text": "Are you talking about sure, um I'm saying Andy, there's a GameOverGreggy show blank page in front of you. You say something, and we'll all keep vibing off of it. You keep killing the vibe like you're killing it. Gotum shut up, Kevin. So a few weeks ago Trident announced don't do the gum stuff. Are you serious? We're going into gum right now. Trident announced that they have unveiled a brand new flavor – well, that they have improved their flavoring, that their flavoring is better than ever before. For but I don't really want to come; we'll move on to another subject. He's not taking it; we'll hold on go with that for a second. You can't stop Troy once the train leaves the station. Why you? The train leave the station, buy the ticket, take the ride, baby! So let's say there was bubble gum, there was gum, there was **** flavored gum. Are we about to hear we go? There's **** flavored gum, Troy. Let me let me let me preface: You have you have **** flavored gum – **** flavored gum. Um, tastes like Plapple, and you're",
            "start": 1589.6
        },
        {
            "text": "**** Flavored Gum Are We About to Here We Go There's **** Flavored Gum Troy Let Me Let Me Let Me Pref You Have You Have **** Flavored Gum **** Flavored Gum Um Tastes Like Plapple And You're You're Like Talking To A Chick And You're At A Bar Where We All Right Flavored Gum You Have C Flavored Gum You're Talking To A Chick A Bar Talking To A Chicken In A Bar And She's Like I Know I Had Such A Great Time Anyway And She Puts That In Her Mouth Pops A C Flavor Gum What Are You What's Going Through Your Head Um I Think That I'm Going To Have A Great Night Or Do You Go I Need To Leave Oh Wait What Oh It's Kind Of Like The Thing On Her Story This Is Like This I Love Saying In This Universe There's A Trident That Is Comom Flavored In This Nolan Universe It's On The Store Shelves You Pick It Up You Fine She But **** Flavored Gum Okay And And Like You're With A Girl She's Like I Wait Wait It Was So Funny I Was Watching That And She Puts In The Gut And You See That It's Comom Flavor",
            "start": 1636.72
        },
        {
            "text": "it up, you fine she but 5-flavor gum okay and and like you're with a girl, she's like I wait wait it was so funny I was watching that and she puts in the gum and you see that it's strawberry flavor G she tells you this is the first time you've lived in a universe where this exists, you make a snapshot Batman flies by in the Batwing you don't bat an eye that's just life here you see 5-flavor gum on the box what do you do what do you do he goes I'm gonna have a great night I'm like are you he jumped at conclusion it was like a Matthew moment oh because she likes this is really about you, you're like automatically assume if she likes this I'm going to have a good night you're going to have a good night so whenever you're with anyone you're at a bar the woman breaks out gum takes strawberry like oh we're going Strawberry Patch tonight we're picking some strawberries what are you  talking about mon social flavor doesn't indicate anything about anything there something about the",
            "start": 1686.16
        },
        {
            "text": "like oh we're going Strawberry Patch tonight we're picking some strawberries what are you **** talking about mon social flavor doesn't indicate anything about anything there something about the activity she's not going to go out and like you know I'm going to I want to pick strawberries to be fair to be fair I mean I I agree with the message being said oh I wish there was a live chat window that I could see right now cuz I just want to see all other girls going I just like the flavor no that's the thing though is that strawberry is a normal thing what if a dude did that are you like dude are you gay no he's just like I like the flavor have you not tasted your own **** no man now here's my thing I haven't either we talked about this on the show recently on The Morning Show someone was like have you ever tasted your own com I was like I haven't I can't believe I haven't though but since it's all my to-do L I feel like I may have",
            "start": 1727.8
        },
        {
            "text": "on the show recently on The Morning Show someone was like have you ever tasted your own vomit I was like I haven't I can't believe I haven't though but since it's all my fault I feel like I may have accidentally eaten something disgusting there's no there's definitely accidentally left a drip somewhere and then I like ate some chicken wings I've only hit myself in the face when did you when did you leave a drip didn't watch come on bro I mean I'm very negligent it's just all over me anyway I was having dinner and Oh I thought that was it's on my chest like let me just no that I I think this is a very fascinating thing because again if you saw a chick that that popped out in her mouth or if you're hanging out with a dude and he just put that in his mouth the automatic assumption is that A she's going to blow me or B my boy's gay I don't think so you just like here's the thing flavors Things N Out of 10 times don't taste like the thing they're supposed to taste",
            "start": 1768.68
        },
        {
            "text": "assumption is that a she's going to blow me or B my boy's gay I don't think so you just like here's the thing Flavor of the Month Out of 10 times don't taste like the thing they're supposed to taste like oh true like watermelon Panda Express doesn't taste like Chinese food oh very good point Panda Express is not Chinese why it doesn't taste Cherry doesn't taste like Cherry Cherry doesn't taste like cherry facts probably doesn't taste like how do we know the best how would you know how do we know still don't know I'm going to taste my own C what you guys have done here is right the problem is you're not tackling this from the right method you've currently you're you're talking about it as if it was I feel I'm the only adult at this table right now too cuz you guys are Hammer drunk I'm not Hammer drunk I feel like it's the current thing of like if we went there and bought you could buy the Big Red gum right now right gum gum Big Red gum I love that I this was this",
            "start": 1812.64
        },
        {
            "text": "\"Hammer drunk, I'm not Hammer drunk. I feel like it's the current thing of like if we went there and bought you could buy the 5 Gum right now, right gum gum 5 Gum. I love that. This was this gum thing your fault, yes. It's his fault, Kevin. Kevin said gum; he said try it is unveiling a new flavor, and I went 'come flavored.' Come what you've inadvertently done is written an episode of Sliders where we've walked into the universe where 5 Gum is a thing, where it's odd to us but clearly they all like 5 Gum enough in the flavor of 5 Gum that it's there. Yeah, 100%. 100% Here's the thing though: 5 Gum can't taste that bad, no not at all. I think this is an Extra Life goal. It's salty and stuff. What what what is the goal? No, somebody taste their own 5 Gum. I will taste my own 5 Gum genuinely interested at this. So you're telling me if we hit if we hit $100,000, you'll taste your own 5 Gum. If we hit $100,000, I will try my own 5 Gum every Everybody well he's going to go to the bathroom do you know that.\"",
            "start": 1859.84
        },
        {
            "text": "at this so you're telling me if we hit if we hit $100,000 you'll taste your own if we hit $100,000 I will try my own come every Everybody well he's going to go to the bathroom do you know that $100,000 is not Out Of Reach we've hit like bro that's like I think last year you guys hit like something we got to hit 100 this has to be like 200 we're setting no **** that we're sitting the bar I got to do this you guys heard first if we hit that he'll taste his own **** I'll dye all of my hair blue again $100,000 wow those are like totally dis hey man I'm playing ball all right I'm getting out Andy you on this too Andy what's up you going to change my C too in addition to that SK SK skate skate both of us what's up Will D our tips blonde for boy orgy cuz we know Nick won't blonde just the tips just the tips just the tips just see feel we have a boy band named boy orgy oh I know this you would have known if you came kind of funny last three I couldn't be there you want to be fourth member",
            "start": 1905.44
        },
        {
            "text": "just the tips just the tips just see feel we have a boy band named Boyzone oh I know this you would have known if you came to Kinda Funny last three I couldn't be there you want to be fourth member let us know okay well fifth Xavier Woods oh Xavier Woods wants to be in position yet but I want to be the one who never joined but got kicked out already you know what I mean like and automatically went on to do his solo down in the in the negotiations portion of it I'm and then and the negotiation in defense of in the in the negotiations is a hard word to say I did not have sex with Monica Lewinsky it's fantastic in the Oval Office has anyone here tasted their own semen cool Greg dude you're not going to get any I mean I would honestly tell you I know you would yeah I can't believe Kevin Hart is this on the level of like I can't you the who farted no no there there to me there's a difference between like I farted in an elevator and there was a night at home when I said shot my cum into my mouth there was I mean",
            "start": 1959.32
        },
        {
            "text": "like I can't you the who farted no no there there to me there's a difference between like I farted an elevator and there was a night at home when I said shot my **** into my mouth there was I mean again there's only one time but there was one time where it shot in a way I didn't expect and it hit me in the face oh didn't taste it now what's but it hit me in the face now what is interesting about this for you the jury is the fact that you tried to sell the lie to me you would never jerked off lying down that wasn't a lie I believe how the **** did you hit yourself in the face not jerking off lying down get **** whiff of this Troy Len to this **** the end of it you only like crouched over like a neanderthal what what do you mean I was more of a sit down he was hanging from his feet I would sit down just like I am right now have you never been in a hotel before well that's the thing I hadn't really you asked for for a chair I excuse me I did isue that's the I haven't had any",
            "start": 2012.68
        },
        {
            "text": "I would sit down just like I am right now. Have you never been in a hotel before? Well, that's the thing. I hadn't really... you asked for a chair. I excuse me. I did issue that's the. I haven't had any that's the creepiest thing. Just just the angry. Just tell like so. Wait, you're jacking off. You're jacking off sitting up. I was want to make sure I understand. I guess that makes sense. That makes sense. Yeah, yeah, that makes sense because you're a young kid right? Uh, no. It was more recent than I'd like. Wow, really. No, it must have been like three or four years ago maybe. And that should just pop me in the face. Young too though. Okay, that's that happens though. You know, a lot of protein. I don't know. A lot of milk drink a lot of milk. You don't get to bring up any more top um how do you say that word? What milk milk okay milk not milk. How do you say it so it's a big thing cuz it sounded like you said it the way I said no I said milk what do you say have always been a milk guy it's milk get all upset",
            "start": 2058.6
        },
        {
            "text": "milk milk okay milk not milk how do you say it so it's a big thing cuz it sounded like you said it the way I said no I said milk what do you say have always been a milk guy it's milk get all upset about it like fine it's milk sure I'll say milk I'll make sure I put that eye in there but it sounded like you just said said milk it's no no no no putting the eye there is not a concession that you're making that's the way the world is spelled it's not like you know what I'll I'll grant you that eye I'll give it to co because otherwise it's not a word in the English language what I'll say is that I say a lot of words wrong a lot of people tell me I don't say roof right I think I say rof just fine you say it wrong what do you what's the first meal of the day breakfast okay it's not breakfast I've heard that one too okay go ahead Kevin says breakfast all **** up breakfast Kevin say breakfast in your microphone what breakfast breakfast he he says it all he says Pizza wrong he says McDonald's",
            "start": 2107.52
        },
        {
            "text": "Heard that one too, okay. Go ahead, Kevin says breakfast all messed up. Breakfast, Kevin says breakfast in your microphone. What breakfast? He he says it all. He says Pizza wrong. He says McDonald's wrong. He says McDonald's wrong for sure. McDonald's. Yeah, okay. Let me ask you a question. What's the number one uh uh Mexican food chain fast food chain? Taco Bell. What is it? Taco Bell. Tim, Taco Bell. Taco Bell. No, do you see see the differences here? We have two Taco Bells and two Taco Bells. Taco Bell. Oh, you're talking about the enunciation. Taco cool. Greg, what is it? Taco Bell. Thank you, tiebreaker. What did he say though? Are you seeing that the Bell is enunciated? It's Taco Bell. It's not Taco Bell. It's like Taco Bell as the composer. It's Taco Bell. Yeah, Tac Bell. Taco Bell. Yeah, I'm with you. Okay, cool. No, you said Taco Bell. No, I didn't. I had a buddy of mine who would always always say Pro let's go to the Taco Bell guy. Let's go to Corner Store. Corner store it's",
            "start": 2155.68
        },
        {
            "text": "Taco Bell yeah I'm with you okay cool no you said Taco Bell no I didn't I had a buddy of mine who would always always say Pro let's go to the Taco Bell guy let's go to Corner Store corner store it's like no it's Corner Store yeah not the corner store like he would annunciate the store it's the it's the store that's on the corner it's the corner store it's Leva not levio exactly Le I had a friend who said the N-word a lot we don't hang out good Lord we don't hang out with him hey party people guess what there is a sale over at KindaFunny.com store up to 40% off select items Monday through Sunday go check it out have a good time and of course click here to go check out our Patreon click here to subscribe to Kinda Funny click here to go to Kinda Funny Games and click down here to go to the Mystery Spot guess what it's just a playlist of fun videos we enjoy that's what I like to put there o I'm a smooth boy Greg",
            "start": 2209.6
        }
    ]
}