{
    "id": 2921,
    "video_id": "gK0fE1Z6CWA",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Anthony Ingruber (Special Guest) - The GameOverGreggy Show Ep. 194 (Pt. 3)",
    "description": "Thanks to Beach Body for sponsoring this episode. Go text GREGGY to 303030\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1503473033,
    "duration": 1139,
    "transcript_chunks": [
        {
            "text": "Kevin Coelho is dropping pounds before our very eyes, looks he's lost more weight. Do you want to be like Kevin Coelho who's running at all brothers? Then use our sponsor Beachbody On Demand. Beachbody On Demand is an online fitness streaming service that gives you unlimited access to a wide variety of highly effective world-class workouts personalized to meet your knees plus extensive nutritional content, all proven to help people achieve their health and fitness goals, P90X, Insanity, Beachbody On Demand has them. So be like Kevin and get to using them right. Kevin, yeah, this is a brand new service but already more than a million members have joined. You can claim a free trial membership by texting \"Greggy\" just 303030 and get full access to the entire platform for free - 600 different workouts, 100 recipe videos. Ah, Kevin Coelho, Beachbody, what do you got to lose? Now if we can take a quick aside, jerk, yeah, do we want to talk about the fact that, yeah in",
            "start": 0.0
        },
        {
            "text": "free 600 different workouts 100 recipe videos ah Kevin Coelho Beach Body what do you got to lose Paula now if we can take a quick aside jerk yeah do we want to talk about the fact that yeah in front of them to Lacroix a coffee a glass of room he has a drinking problem you don't had a drinking problem for a long time and then there they all are there's I wanted to be clear I do have a drinking problem yeah but I also want to clarify that I just like drinking things I think I have an alcohol you don't know it's not an alcohol problem you said on the show before your drinking problem is that you always said on the show you said in half for you and instead of okay yeah we talked about that because I really I think about that recently but it was in dinner we had the problem with you recently is the fact that it's been a few months yeah it's been fun yeah it has little time job thank you chemically in this office man yeah it's actually your time working see that my problem is you",
            "start": 53.64
        },
        {
            "text": "recently is the fact that it's been a few months, yeah it's been fun, yeah it has little time job, thank you chemically in this office man, yeah it's actually your time working see that my problem is you just keep your body guessing to an extent that I can't worry what all exactly what do you mean oh I for me idea I mean I have the very high I do the handoff of all right coffee table soda and then all right now we're moving into we're in if we're going from the Unity yeah you like just say we're go from the accelerant to the depressant yeah I mean like I know I'm not gonna have it bouncing around like this well my brain is like Rosie I came into the show with a coffee and Lucroy coffee cool give me a blip or whatever the hell it's just there right look looks okay but it's just carbonated water oh it's essentially a naturally flavored carbonated way yeah and it's a man obsessed with it yeah because it's zero everything and I love it and I can drink as many as I want and people can't judge",
            "start": 112.23
        },
        {
            "text": "oh it's essentially a naturally flavored carbonated LaCroix yeah and it's a man obsessed with it yeah because it's zero everything and I love it and I can drink as many as I want and people can't judge me I'm not judging I don't judge myself here just earlier he's the one that said Nick wouldn't eat it with his eyes Helen Hall and Kevin's leaning in it is Mike what he gotta take up you gotta really judge with the LaCroix you like a bunch of times until you found out that it was really zero everything you were like those aren't good for you we're trying to help he's trying to help you forget I did I know he's doing it for a good reason I just want to interrupt and say you have been really judging me I want to appreciate that and I would need everyone to know and this is a big thing for me to say I'm coming forth right now making that you got to look for this a spot you're the best friend so I know I have looked more at a problem but the LaCroix problem is a good thing because it's hard for me to",
            "start": 150.84
        },
        {
            "text": "coming forth right now making that you got to look for this a spot you're the best friend so I know I have looked more a problem but the liquor problem is a good thing because it's hard for me to admit but it's hard for me to drink so right now hard for you to drink soda does that mean it burns it is too sweet and I drink a cold I drink a Sprite and it is disappointing I'm sorry to let everyone down but it's been a while now you're not going to stop drinking soda though no but it's like it's definitely slowing me down good and I'm just like I can convert I think it's good that happened that's actually very common because um you know I know people who go in detox diets and they just they stay away from sugar and then they have a bit of cereal or something any look oh my god you know like you get so used to yeah and like salt free diets that like your body will just like freak out that's me like I do I do like I've been on a little bit of a ketogenic diet for the last few months",
            "start": 187.26
        },
        {
            "text": "you get so used to yeah and like salt free diets that like your body will just like freak out that's me like I do I do like I've been on a little bit of a ketogenic diet for the last few months and you do notice that where because you're not really having a lot of sugar and so I found myself after because the only thing I'll give myself for fruits that are not naturally like not a ton of sugar first so you want to I don't cherries I feel free to have a lot of fiber in them it's like apples strawberries things like that but after if you don't if you deprive yourself of like processed sugar for a month then eat an apple yeah you'll be the best tasting really sweet thing you've ever had oh so it's like it's super sugary and soon as you start tasting that so I started craving like the other day the first time I lived I'm like okay I got a sweet Apple I had to leave my apartment and go find a Pink Lady Apple because I was craving it and that's never really like I normally do that happens",
            "start": 230.97
        },
        {
            "text": "the first time i live i'm like okay i got an apple i had to leave my apartment and go find a Pink Lady Apple because i was craving it and that's never really like i normally do that happens i'm like i got a goldfish or like Oreo cookie doesn't like that but it's very weird and to the point where it got to the point now where i eat almonds for their sweetness really yeah like i'll have it i'll have like a roasted almond i'll start eating it and it'll taste salty but then i'll also taste the natural sugars that are in a nut it's pretty fascinating so if you have like sugar Froot Loops would you be wired like a child i know that i'd be wired i think that i would definitely so i started i've also been not drinking a lot of artificial sweeteners so i've been giving myself like a diet coke here and there but nothing to do crazy and i noticed the difference now and how i feel yeah which is a very weird thing",
            "start": 272.58
        },
        {
            "text": "like a Diet Coke here and there, but nothing too crazy. And I noticed the difference now, and how I feel, yeah. Which is a very different feeling from what I normally experience. A lot of people don't pay attention to this, like, one last time you're like, \"I'm going to purposely consume this thing,\" and then pay attention to how I feel, and how it makes me feel, and my energy level now. Do I feel cathartic? Do I feel like I want to take a nap? Do I feel a little sick to my stomach? Is there that weird taste in my mouth from the coating of whatever this thing was? It's an unnatural process. And so when I have Diet Coke, I definitely feel my body just feels like I gave it something that it doesn't necessarily know what to do with. Reason you know? Granted, now I should say, when I drink a Diet Coke, I don't drink a normal-sized Diet Coke. I will go to the movie theater and get the large job okay, but then I will halfway through the movie let's go out and refill it even though the guy is like \"no sir, you can't do that.\" I have like",
            "start": 312.45
        },
        {
            "text": "Coke, I will go to the movie theater and get the refill okay, but then I will halfway through the movie let's go out and refill it even though the guys are like no sir, you can't do that. I have a job, and they know their job at the end of it. How is Hugh Jackman doing? Mmm, cuz you look great, thank you. You're looking good, you're getting more defined, off because you can't just open your... you're a friend of the family now, so I feel like you should know everything about us. About a month and a half ago, a friend of mine who works at IGN, which is a small media company in Lanka, uh, that's not really important anyway. He works there, and as part of one morning, I think it was a Monday morning, I was like hey, here's this being a motivational Monday morning on Twitter, like here's my inspiration for today right, and I",
            "start": 350.31
        },
        {
            "text": "He works there and as part of one morning, I think was a Monday morning. I was like, \"Hey, here's this being a motivational Monday mornings on Twitter, like here's my inspiration for today.\" Right? And I thought, and I put out a picture of Chris Hemsworth with his shirt off from Thor (store) and I was like, \"If only I could look like this.\" My buddy tweets back at me, he's like, \"Not on, opera. It's all about the Jackman.\" Any tweets a picture of Hugh Jackman with the shirt off from the movies, I think was The Wolverine. The one with... I was in Japan and I was like, \"Bro,\" and we got into this big battle. And somehow that escalated to him challenging me to a Jackman-off, which means that whichever one of us looks more like Hugh Jackman from The Wolverine, genuinely like well, I was like, \"This is pretty fun.\" I like when I met you, I was like, \"This dude's in pretty decent shape,\" and like when you said Jackman off them, like it's gotta be Hugh. It seemed like an idea so by January, I have to... like the light year didn't **** okay, I mean I'm",
            "start": 393.63
        },
        {
            "text": "like this dude's in pretty decent shape and like when you said Jackman of them like it's gotta be Hugh it seemed like idea so by January I have to like the light year didn't **** okay I mean I'm growing all out and I'm probably gonna do this thing or just shave this bloody battle and come with just a little spiky almost happen see exactly January 5th Alice usual in just from beer to low so whoever wins whoever wins has to buy the other steak dinner now Darren's gone dark on me but I have spies at idea yeah Aaron has two kids right wait guys livid I might have met this guy really when I was when I signed in there was this dude he was like hi and I was like like are you the bouncer huh okay there anyways I mean he's gonna he was looking at let ik little bit this is Darren right here he's that's him right there that might have been the guy though so he is a weaselly little prick then he went down Darren is Darren is already a very fit he's not unfit and in gyms imagine he'd be bigger",
            "start": 433.08
        },
        {
            "text": "that's him right there that might have been the guy though so he is a weaselly little prick then he went down Darren is Darren is already a very fit he's not unfit and in gyms imagine he'd be bigger no dude have you seen him inside I wish we getting try to look for a prom picture of him or high school Double Dare Brazil arrived he sure is ill nude duty whatever reason he looked just like me City at a time but he ever had like that now so the thing I like I'm up against a little bit it's gonna be hard for me to do this because he I had to lose a lot of body fat I used to be really fat so I used to be like middle age I used to weigh 185 and I'm like to put in context me on 185 right now so that's a lot of weight that I've lost but I still have I think for my size I'm only five eight so I should be around 160 165 ish I got 20 more pounds to lose but I'm also trying to pack on muscle so there's that there may be a long story short over wins gets state dinner at a very fancy steak restaurant",
            "start": 480.85
        },
        {
            "text": "be around 160-165 ish I got 20 more pounds to lose but I'm also trying to pack on muscle so there's that. There may be a long story short, Overkill's The Walking Dead gets a State of Decay 2 dinner at a very fancy steak restaurant and I want that **** stay down, it's going to happen. What were the spies saying about this wee little ****? Trains Gone Dark and that he's actually working out and dieting but he's just not saying that he is sure he was well-behaved saying no that's not happening; he actually is not doing any of this, he's totally forgotten about it now. I say he can't possibly forget about it every time I type, I take a picture of myself and put it on social media with hashtag Jack when I've 2017 don't forget 2017 for anyone out there following, I tagged him in that picture as me or my bicep or what Mikey Jill Jamie tag the vision so there's gotta be. If you look on Instagram he's happened a Aaron Burr's a hashtag in Brazil they when I told myself Darren Brass he still around because he to time yesterday yeah",
            "start": 528.85
        },
        {
            "text": "tag the vision so there's gotta be if you look on Instagram he's happened Aaron Burr's a hashtag in Brazil they when I told myself Darren Brass he still around because he to time yesterday yeah we would have heard about Donnie Yen no clothes with these people yes I'm losing badly but also it's a did we do have five months oh yeah no I already go well he's probably smaller towns I have I see 20 pounds worth to do with five months thank you five months at sea but he doesn't have to lose any weight so he doesn't technically have to he could just maintain for two months and then I'm horrid on a really hard boy oh what's that he's just a little chicken boy but for him it's probably if he has the kind of bill where you can put muscle on cookies play football I'm pretty sure he could no I think you got this Nick all right know what go ahead Nick ball or I'm sorry don't let Tim put you into if I did so many squats yesterday yeah like when I went to take a **** today how to do that thing",
            "start": 568.87
        },
        {
            "text": "you got this Nick all right know what go ahead Nick ball or I'm sorry don't let Tim put you into if I did so many squats yesterday yeah like when I went to take a **** today how to do that thing where as you go down to go to the toilet you gotta get with the flow of 30 degrees of space and these small legs excellent and I just think it fell into it yeah thank God night I almost bruised my tailbone but it's not that far that's not good damn it great it's great no I work out with you guys know use them yeah I do use the best over at USN he is a monster of a human being sure a monster and John Pitts who I work out with him as well the champ is like me like we can barely lift anything Sean's offended now listen listening like hey I squat more knee but compared to Yousef it's just it's not even fair that guy he squats like hundreds of pounds it's obscene so do you have it all mapped out in terms of okay no no what I'm doing right now is I'm trying to",
            "start": 607.41
        },
        {
            "text": "to Yousef it's just it's not even fair that guy he squats like hundreds of pounds it's obscene so do you have it all mapped out in terms of okay no no what I'm doing right now is I'm trying to add again functional strength trying to increase my my my movement on that motivation excuse me functional strength trying to crease my basically my each lift and then as we get closer to it I'll start getting a little more hardcore a little bit more methodical about like I'm not paying it too much attention to my macros in my diet I'm not paying too much attention like what how many calories I'm eating versus have like and what we're getting fats proteins and carbohydrates from that yes but as we push forward probably into October I'll start doing a lot more hardcore sure about Andy cracking it 100% candy going they say that the best way to lose weight is a week before competitions in candy corn diet you can get I mean it sincerely you have to I mean aren't over is the month oh yeah yeah keep",
            "start": 653.52
        },
        {
            "text": "candy going they say that the best way to lose weight is a week before competitions in candy corn diet you can get I mean it sincerely you have to I mean aren't over is the month oh yeah yeah keep this all-important question reg I know we're getting along in this topic how do you eat the kid there is no topic you missed yesterday's show begin two hours there song how do I eat the game sorta you go white and first then back-end and then I go I go tip yeah middle Holt okay yeah nobody throw it out thank you Kay oh **** you guys candy corn is g5 candy corn well I've never I've heard of it in Futurama yeah try I hate that guy Kevin bring up a photo kid on the show Anthony not like the clone yet no no no it's imagine just liquid grain of hot liquid sugar that you then colorized and then John I can't now well as an overweight child I liked anything that tasted moderately good sheriff tskany corn is one of those things candy corn is one of those things that tastes just good enough for when",
            "start": 693.3
        },
        {
            "text": "I can't now well as an overweight child I liked anything that tasted moderately good Sheriff Tyskany corn is one of those things, Candy Corn is one of those things that tastes just good enough for when you're fat and it's in front of you, you'll just eat it. And of course, it is Lord God here comes Andy Cortes to say something stupid about this. You never had candy for days, never seen candy corn. Andy come give me your account while you do this I'm tweeting a poll about Candy Corn. Come talking to my microphone tell me what you're thinking, you're gonna get destroyed. Great, Candy Corn **** rules yeah just said his opinion had no value and now I didn't, I just said you're gonna say something dumb but they turned me wrong he turned you wrong Andy I **** fought for you to work at this company I begged you almost you really did bagging and he was like now I'm good and now here we are. You refused the macaroni and cheese and you hate Candy Corn everybody loves Candy Corn really yeah Joey where do",
            "start": 744.33
        },
        {
            "text": "you almost you really did bagging and he was like now I'm good and now here we are you refused the macaroni and cheese and you hate candy corn everybody loves candy corn really yeah Joey where do you come down on me all-important candy come on come over here say into my microphone come in and say to my microphone Joey like handle poll is up candy corn question mark awesome bad those the options Pro candy corn **** yeah pumpkins those are trash the little oh yeah I am it's too much of a good thing Kevin **** this **** the fish wait you guys like the pumpkins and nothing oh no no no I'm not fat okay that's what the word sweeties or Smarties whatever the heart out there some people like Smarties right it's not that uncommon Smarties love M&M already at a time and Emily Oh Marty's Smarties there's no competition they're too big no that's now your nickels no no he there are there's there's like there are different your party parties your people are in terrible right they're",
            "start": 790.05
        },
        {
            "text": "there's no competition they're too big no that's not your nickels no no he there are there's there's like there like there are different party parties your people are in terrible right they're like Zippy okay Smarty chair and just like you know toys I'm imagine two smaller Tom's gone I saw you on the Mother then put yourself there put me no wait oh I'm Kevin drink yourself out and put yourself on the computer okay more like right here sure absolutely there he is oh it's too small thanks come hello Rimeck Hillary ambiguous hole reinvigorate yeah I've got the world at my hand baby has now was awesome I saw um Alien: Covenant oh how do you feel about that Michael husband is fantastic he is fit I love him and everything he said no incentive um but yeah yeah I like it what do you think got it I wouldn't care for that much you didn't like I didn't just like it I just was like I went he did that it when he wipes out a civilization I would like but it's cool it feels like they made a",
            "start": 839.61
        },
        {
            "text": "got it I wouldn't care for that much you didn't like I didn't just like it I just was like I went he did that it when he wipes out a civilization I would like but it's cool it feels like they made a little bit like they made a movie I do like playing another movie for me do that and then they didn't do a good job explaining wait everyone sorry i'm i needed to back up a little bit I did not watch covenant you haven't watched Alien: Covenant, even both it didn't Prometheus is incoming and Alien: Covenant and he plays a dual role in Detroit: Become Human, saying he plays the same role in Prometheus that he plays in Covenant was that like a surprise wasn't on the trailers um I was in the trailer I think really I can yeah he plays a place David comes back as like the survivor and then he plays because because the Android that he plays is a model a bit like um Johnny Five yeah yeah but I am Alien: Bishop, Bishop so very similar to Johnny Five because Johnny five alive his long programming ah dimly remember when he",
            "start": 895.95
        },
        {
            "text": "that he plays is a model a bit like um Johnny 5, yeah yeah but I am Alien Bishop, Bishop so very similar to Johnny 5 because Johnny Five is alive, his long programming ah dimly remember when he didn't want the laser anymore he wanted the suction cup, yeah that came an opossum you chasing Oscar, that was the second hearing it's all canon doesn't matter why do I Johnny Five group of references George Lorton very legitimately trying to start a rumor that Johnny 5 was the predecessor to Data Bishop, yeah her ashes how have we not talked about the Gutenberg showing up on Ballers, you **** kid what I need a whacky role for him right, yeah we're cutting Anthony was saying something sorry I go talk about Covenant I've completely lost my train of thought I think it's just hitting on demands I don't want to like spoil over too many people oh I didn't see now if you haven't seen Covenant by now no hair to see Company a lot of people out there that are probably like I'll watch",
            "start": 938.49
        },
        {
            "text": "on Demand's I don't want to like spoil over too many people oh I didn't see now if you haven't seen Alien: Covenant by now no hair to see Company a lot of people out there that are probably like I'll watch Alien: Covenant on demand bucks an Alien movie it's **** you at Wow damn flowers I'll make an alien movies why now I want them all I don't want the disability they're going to get back to the ones we want where there's aliens again that's yeah I want them to make a no I wanted to make another movie that is pretty much the exact same movie of Aliens I don't understand to this day why they haven't figured out why no one none of the people in Hollywood who produce movies are way smarter than we are haven't figured out that the only thing you need to make a successful Alien movies is Colonial Marines they were the coolest **** part of the entire franchise lie and they never brought them back I like Alien way more than Aliens I think that that's because of your upbringing and probably yeah",
            "start": 993.31
        },
        {
            "text": "they were the coolest part of the entire franchise lie and they never brought them back I like Alien way more than Aliens I think that that's because of your upbringing and probably yeah Americans yeah that's probably true no Alien is a great film I'm joking I'm joking around yeah I think the thing there though is that we can't beat Alien think we can do Alien well Alien: Covenant at times didn't feel like a remake what we needed was the Alien to fight the Predator it is any exact same movie Alien yeah I thought it picks up when David was introduced and then he got to play those roles and like I Sir Walter yeah okay yeah yeah definitely a little bit like Buffalo Bill yeah yeah where's your Greggy like a big big crap person I like any time I start doing the greatest thing when you go out I want to do good name **** me okay I simultaneously would pay any amount of money and I sometimes you would never want to see it it's so broken your shaft against so low you're never going",
            "start": 1032.64
        },
        {
            "text": "go out I want to do good name **** me okay I simultaneously would pay any amount of money and I sometimes you would never want to see you it's so broken your shaft against so low you're never going to get it up I loved that so much but for the ritual for shut up I don't know that guy's name Buffalo Bill everything that actor nominee was young he's in Monk he was in Heat yes one of the actors that he's a **** awesome A Commander it what a great role to be remembered by thanks for watching The GameOverGreggy Show everybody click here to go to Patreon clerics and click here to see a video of a very very young Andy Serkis we'd have that video it is just other content of ours Kinda Funny",
            "start": 1080.85
        }
    ]
}