{
    "id": 2934,
    "video_id": "hFXpKcyDH44",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello",
        "Anthony Ingruber"
    ],
    "title": "Anthony Ingruber (Special Guest) - The GameOverGreggy Show Ep. 194",
    "description": "Thanks to Beach Body for sponsoring this episode. Go text GREGGY to 303030\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1503644404,
    "duration": 6144,
    "transcript_chunks": [
        {
            "text": "Kevin Coello is dropping pounds before our very eyes, looks he's lost more weight. Do you want to be like Kevin Coello who's running the teleprompter? Then use our sponsor Beachbody On Demand. Beachbody On Demand is an online fitness streaming service that gives you unlimited access to a wide variety of highly effective world-class workouts personalized to meet your knees plus extensive nutritional content all proven to help people achieve their health and fitness goals, P90X, Insanity. Beachbody On Demand has them so be like Kevin and get to using them right. Kevin, this is a brand new service but already more than a million members have joined. You can claim a free trial membership Kinda Funny best friends just text Greggy to 303030 and get full access to the entire platform for free. 600 different workouts, 100 recipe videos. Kevin Coello, Beachbody. What do you got to lose? Paula, what's up everybody welcome to The GameOverGreggy Show I'm one of your hosts Greg Miller alongside",
            "start": 0.0
        },
        {
            "text": "different workouts 100 recipe videos Kevin Coello Beachbody what do you got to lose Paula what's up everybody welcome to the GameOverGreggy Show I'm one of your hosts Greg Miller alongside the producer slash seducer Nick Scarpino you brought up a picture of me from five years ago yeah and it made me sad why is that was so much skinnier but you got the arms now though I was like oh **** went off is real and it's starting to show dividends as they thank you I've noticed that my I mean I'm being I'm able to lift more now which I'm happy about because all kidding aside jacking off what are you gonna do right I'm gonna win it doesn't matter I'm going for functional strength and man and movement like I want to be stronger and I want to be able to move better so that's always - I just oppose like when you lift there's all sorts of benefits that you get from it right like it strengthens joints it gives you more you know you get a lot more power as far as things that I'm doing like",
            "start": 53.67
        },
        {
            "text": "oppose like when you lift there's all sorts of benefits that you get from it right like it strengthens joints it gives you more you know you get a lot more power as far as things that I'm doing like jujitsu things like that so that's what I'm hoping to get out of an emotion I'm already starting to know if I self get stronger which is good but next step is how do I start doing steroids at what blow starts throwing myself you're building up the power tree but next is extent oh yeah definitely yeah yeah it's over there the pr1 at Tim Gettys let's go most likely like that yeah yeah got me the last people get you they're gonna go on and then joining us for the first time on this show Anthony Ingruber hello Anthony how are you I'm great so much I didn't tell them much about you what I know cuz then what now granted I don't know much about you other than your stand-up guy you're funny I'm talented you're the Joker in Batman right now over on The Telltale Series which ever we should be",
            "start": 113.89
        },
        {
            "text": "cuz then what now granted I don't know much about you other than your stand-up guy you're funny I'm talented you're the Joker in Batman right now over on The Telltale Series, which ever we should be playing Season Two just started it's awesome this came out today yes well this is but remember you're recording a time time loop this is going out for a long time you've already won awards you've already you've already won a lot of awards for your John Doe but yes so so when I met you I met you through the power of the Internet through Skype I was hosting that Telltale show about Batman you you Skyped into it yeah I you stood out to me for two reasons strikingly handsome talented in the video game and then of course while you were skyping behind you you had a jaunt over your fireplace a giant portrait of you and Harrison Ford, that's right like this exactly like that Hey yeah that was yeah that was a lot of fun but that was the time difference was right right because that's the other thing",
            "start": 158.35
        },
        {
            "text": "\"Portrait of you and Harrison Ford, that's right, like this exactly like that. Hey, yeah, that was yeah, that was a lot of fun, but that was the time difference, was right, right, because that's the other thing that I didn't tell him about is that you live in Holland, yeah, that's right, who are you running from in the United States? You were at home this is lives exactly, yeah, there's a lot of people looking for this guy. Were you born and raised there, right, no, no, I was actually born in the Philippines in Manila, my dad was he's retired now but he was an Australian diplomat for the Foreign Affairs and Trade, yeah, and so what the Australian Foreign Affairs and Trade would be a good one, was Ron Jeremy's attorney, but so we were he was posted there and I was born, know, yeah. I'm gonna push in okay don't panic there's no Greg why did you push aspirin you gotta go out first you know have you ever watched Love and Sex stuff\"",
            "start": 201.01
        },
        {
            "text": "were he was posted there and I was born know yeah I'm gonna push in okay don't panic there's no Greg why did you push aspirin you gotta go out first you know have you ever watched Love & Sex stuff ask first I have indeed yeah so back to my father talking about my dad and then things took a little little turn so it wasn't your inborn Philippines yeah yeah and there was actually a big military coup going on when my mom was pregnant with me and my dad was almost killed at least twice like a there was a sniper taking potshots so there's a photo of him on the phone just long inhale I is that camera and there's just because he's Australian yeah there's just there's just holes in the window and he was in a car that got strafed by an airplane this could all be crazy this is like stories your dad worked in a phosphorus point this is the desk clerk no but he's had a really interesting experience but and then I was born yeah so in this crazy time and then I was there for a couple years",
            "start": 247.75
        },
        {
            "text": "\"Dad worked in Cyprus, which is where I was born. Yeah, so in this crazy time, and then I was there for a couple years, and then we moved to Canada, and I went from having a Filipino accent to really you know Canadian accent. Then we went to Australia, and my accent shifted again. In all your old videos, everything's a question, moving guys up to the end South like... huh? Get it? I hear it's like I don't know how are you, and then we went to Cyprus which was awesome when I was about ten. My dad was working on opening that border because of the Turkish invasion, I know there's a hill, yes, Cypress Hill, you know? Yeah, so there was an invasion by the Turks, and the island was split in half, the Turkish Cypriot side, and my dad was working on opening that border up because people were stuck.\"",
            "start": 310.51
        },
        {
            "text": "was an invasion on the Turkish side, and so this island was split in half - the Turkish Cypriot side. My dad was working on opening that border up because people were when they invaded it was really just grab what you have and get out, and then there were people living in those houses. So he was working hard to get those borders open so people could go there for the first time, which was really cool. And so that was my middle school years, and then we went back to Australia, and then to New Zealand for high school. That's where I started to get the thing that I want to be an actor because during high school I went to a workshop that Richard Taylor did - Lord of the Rings, everything that's awesome um, and I went there and that was like Disneyland for me. Oh yeah, that's the gun from Hellboy, that's Aragorn's sword. You know them when you walk in there's an orc, that's like I was I was there I was like 17 and they were like yes we need some extras for",
            "start": 365.67
        },
        {
            "text": "me oh yeah that's the gun from Hellboy, that's Aragorn's sword you know them when you walk in there's an orc that's like I was I was there I was like 17 and they were like yes we need some extras for Avatar I was like oh what's that like oh it's this movie that James Cameron's making six you know at the space you know this blue guy was like okay can I go on it like yeah you need to be 25 I was like I'm 17 so like okay just look older and I had like this pathetic little beard and like yeah it's fine and then they went on and so I got to go on the set for that and that was awesome like I was oh it's just a kid in I was were you on set and one of the days that James Cameron was actually directing yeah Wow yeah how was he how was he to be around there was a lot of quality attention on Sean yeah there was a lot missed a lot of it but I was there a good day and it was really cool but there was stories and stuff that was just a very stressful shoot just things went wrong and and stuff",
            "start": 414.99
        },
        {
            "text": "yeah there was a lot missed a lot of it but I was there a good day and it was really cool but there was stories and stuff that was just a very stressful shoot just things went wrong and and stuff and there was a lot of I mean it was a huge budget yeah and stuff but is your role gonna be recurring in Avatar 2 3 4 and yes I'll be playing the ground technician that face in the crowd about 50 people I'll be making that welcome return and really just a shadow on the wall but it was amazing like I can see myself all that was probably somebody else sure I'm convinced you know that's that shoulder there that's me yeah yeah and that was just an amazing experience and then and then after that after I graduated and stuff I just went to Canada to Toronto which was I was told was the next best thing for a movie guy yeah you know I tried getting to LA but I couldn't get in without a body of work or anything so I went to Toronto",
            "start": 464.82
        },
        {
            "text": "tried getting to LA but I couldn't get in, share them without the body of work or anything so I went to Toronto which was I was told was the next best thing and I wasn't getting anything like I got like a toothpaste commercial in like three years and something so I and then my visa though was at Crest or Colgate it was like some brand you know whatever so I'd get nothing really to show for it and my visa ran out and I was just going out so I moved back to Holland to stay with my folks for awhile and during this time though between high school and then what I've been doing was YouTube impressions because that was my own creative outlet to stave off the voices in my demons somehow create something because I wasn't getting work so I'm like I'm gonna just do whatever and six months later like I had enough, I I was 23 and I had nothing to show for it really just my earlier experiences and nothing how many YouTube steps I had yeah I actually had a pretty good decent number",
            "start": 513.36
        },
        {
            "text": "later like I had enough I I just I was 23 and I had nothing to show for it really just my earlier experiences and nothing how many YouTube steps I had yeah I actually had a pretty good decent number like it would get grown since like since Adeline but it was like yeah like I had like 5,000 and my Harrison Ford impression had about 300,000 views um that's cents per share which is awesome but so I I got this message that there that this director Lee Toland Krieger is making Vatel line and they were like to play the young Harrison Ford you know and I was like okay I'm gonna audition I'm not gonna get it it's gonna be they're gonna get you know it's gonna be a huge thing my audition and the director could Skype me he's like hey yeah you're in and I was like I was like you're kidding me because like Jesus it turned out that he had seen in that in that period I was like I'm not getting he and the producers had been watching all my material and they're like that's the guy",
            "start": 563.63
        },
        {
            "text": "kidding me because like Jesus it turned out that he had seen in that in that period I was like I'm not getting he and the producers had been watching all my material and they're like that's the guy yeah and and because he was looking at reference photos of young Harrison Ford in high school and he's like ah what's this video that's somebody that's somebody doing is so like and so uh you know that was insane and then and then it was like oh yeah go on the set and they didn't have a script oh I because they didn't know what they were gonna do for that base they thought it was gonna be you know from behind or CGI or something like like a guy who kind of looks like him so that role was on the script was you know a guy helps her to his car or whatever helps her get into the car and um when they saw that I did the voice and everything and and how much I looked like him on the set everyone was like you know and it's really cool it was amazing um so they were like yeah yeah just improv",
            "start": 616.5
        },
        {
            "text": "they saw that I did the voice and everything and and how much I looked like him on the set everyone was like you know and it's really cool it was amazing um so they were like yeah yeah just improv something like say something and I know nothing about cars so I'm like what do I say get off my car yeah cuz there's there's old grumpy Harrison Ford then and there's younger Harrison Ford so III did something in the between like they were like because I was like do you want me just do my normal voice he's like no no no the role is super small so we just want it you know so people like what the **** was that yeah so um he just said like yeah just give me that Han Solo grin so it was just you know and it's like every every time like just really milking it and I was just having a ball but um well do something for them because I watched a channel and I was like cuz I I knew you from the tell-tale stuff and they were like oh yeah anything and then you're the picture with you and Harrison Ford is like okay so",
            "start": 666.33
        },
        {
            "text": "for them because I watched a channel and I was like cuz I I knew you from the Tell-Tale Heart stuff and they were like oh yeah anything and then you're in the picture with you and Harrison is like okay so then I wouldn't watch The Age of Adaline, yeah it's like holy crap, you worked with Harrison Ford, yeah yeah um they've they screened it for people and they said one of the questions was how did you do the CGI to make Harrison look so young, motion capture like that was great CG, Isaac no that's Anthony, um the director was really happy with me and the last day of the shoot I was a nervous wreck though because I had no I had just YouTube and then I'm like playing my childhood hero so I was like you know and I was in my caravan, my little trailer and Harrison's trailers are Erin's the size of you know the house and as well and they're like have you met have you met Harrison yet and I said no I'm like do you want to meet him like yeah but but you know what if he doesn't like me or something like I",
            "start": 716.07
        },
        {
            "text": "the house and as well and they're like have you met have you met Harrison yet and I said no I'm like do you want to meet him like yeah but but you know what if he doesn't like me or something like I don't know if I could process it like yeah he's like one of the most kids and kids no good and you know and they're like no no he's seen you and he likes you so um so um and he made a joke about like yeah he's good he's got a weird sense of humor which is awesome but he made a joke about me and stuff so I thought that was really cool so he um what was the joke yeah what the hell no I'm like that's that's my own person that's one for me okay okay so he is so so he was rapping he was done yeah good and he thought he was rapping he was rapping no no but um so he was wrapped like for good and they're like we got to get Anthony to meet this guy because the crew wanted to see his reaction to meeting me so I was really like this like shaking you know I'm meeting Harrison Ford Jesus and so he's",
            "start": 762.46
        },
        {
            "text": "like we got to get Anthony to meet this guy because the crew wanted to see his reaction to meeting me so I was really like this like shaking you know I'm meeting Harrison Ford Jesus and so he's so we so we were in that house where they play the gamers like what was the capital of Israel you know when they're playing that game and I was in the back of that just and and the crew was like just just just calm down and look and so I'm waiting outside that house and the entire crew were there with their iPhones and stuff so everyone's piling out like Blake is coming on Blake's wonderful she's so sweet like hey hey how are you and I was like hi you know I'm pretty good and and um yeah the way here supports coming out the last guy to come out so he's literally the last person to leave so it's just like and then I see him and he's looking down because he walks the same way I think he looks at the floor and and they're like Harrison uh-huh and they're like this is Anthony he looks at me he goes",
            "start": 811.81
        },
        {
            "text": "like and then I see him and he's looking down because he walks the same way I think he looks at the floor and and they're like Harrison uh-huh and they're like this is Anthony he looks at me he goes oh Anthony yeah I've heard about you and I'm just and I was I thought I was gonna pass out but I was like hi how are you and I was a very professional and stuff when I told him though how much he meant to me you know and and we took that photo and he was just like patting me and like and then when I got home from filming when I went back home to Holland they they'd taken that focus I'd send that photo to my family yeah they printed it and mounted it on the wall and that was just yeah that was surreal for me that's awesome just childhood hero like so do you do your Han Solo Han Solo I'm kept in the Millennium Falcon sure here tells me you're looking for passage to the Alderaan system fast ship you've never heard of the Millennium Falcon it's a ship than anything else I can do the whole",
            "start": 858.52
        },
        {
            "text": "in the Millennium Falcon, sure. Here tells me you're looking for passage to the Alderaan system fast ship? You've never heard of the Millennium Falcon? It's a ship that can do the whole thing. It is so cool in the movie when you do it. When you walk up and yeah I remember actually watching that. My wife and I was like one of those Sunday movies where we're gonna sit down and I think I'd lost the last couple, you know? When you pick movies and you sure you don't pick the right ones then you lose the next choice and she's like let's watch a channel and I was like oh I'm a big fan of Star Wars and I remember that scene popping up and I'm like holy **** like it's almost jarring because it's spot-on and it's cool because you see it, like you know what the character is supposed to be right? It's you know they built up to this moment where she meets this young Harrison Ford obviously she doesn't age whatever and then you see him for the first time really. It's it's",
            "start": 910.42
        },
        {
            "text": "is supposed to be right it's you know they built up to this moment where she meets this young Harrison Ford obviously she doesn't age whatever and then you see you for the first time really it's it's spot-on you did a very excellent job and it was well done yeah well how was how was how was it like doing - seems like lightly yeah that was I mean she's one of those beautiful women in the world you know and then my first scene partner and and all my scenes were with Blake Lively I didn't actually have his scene with Harrison Ford like he looks out the window and then and then I'm biking past right so that was my interaction with him on screen but so all my scenes were with Blake Lively and she was really really friendly and I mean Ryan Reynolds as well oh yeah it's awesome no he was no I was you know this was before Deadpool but I was like dude Smokin' Aces was awesome anyway he was just really awesome um but yeah she was really friendly and really just easy to work with and very cool and we did that",
            "start": 957.67
        },
        {
            "text": "was before Deadpool but I was like Smokin' Aces was awesome anyway he was just really awesome um but yeah she was really friendly and really just easy to work with and very cool and we did that kissing scene that's when Ron Perlman was there no that was literally I didn't know Chuck Norris I met him oh right and and I'm like and he's like oh so you're filming a scene like yeah yeah we got a handshake but yeah the kissing scene we did that like nine times and I was just like really cool so now you know you're doing the Telltale thing yeah and then you joke yeah that's the other cool thing is that is that you're the Joker yeah I know but the thing is like Harrison Ford and the Joker were my childhood right like in high school I was doing them hmm or I was doing the you know Grady twins bird hey I was in The Shining like Jack Nicholson thing um and the Mark Hamill hit Lucy's you know um and and that was my thing and that was the other thing that I'd put on YouTube the other video that I did",
            "start": 999.22
        },
        {
            "text": "Hey, I was in The Shining like Jack Nicholson thing um and the Mark Hamill hit Lucy's you know um and and that was my thing and that was the other thing that I'd put on YouTube the other video that I did those three impressions of Heath Ledger, Mark Hamill, and Jack Nicholson, and then you know lightning struck twice because Telltale were casting for this thing and they saw me doing the three Joker's and they thought well if he can do those three what can you come up with you know and you know so where does your Joker lie then like where it where where did you yeah that that was a thing because being an impressionist those voices are just so close to me like if I if I if I see the script my first thought is like you know well hello beautiful or you know like any of those guys and and they really didn't want me to do an impression right so I wanted to come up with a voice that would be that could be normal almost because they really want him to be John Doe everything that I do they when I read for it they really",
            "start": 1061.59
        },
        {
            "text": "an impression right so I wanted to come up with a voice that would be that could be normal almost because they really want him to be John Doe everything that I do they when I read for it they really asked me to dial everything back like the laugh and the voice and stuff like I make it very dark and very creepy but they like to save that likely because he won't we want him to become especially in that first episode they want him to be almost sympathetic and likable like a tragic hero yeah are you familiar with what how this works in the game no so in season one Bruce gets admitted and this is spoilers for season 1 I don't know how many goddamn times I can tell you people to play this game season 1 Bruce gets admitted to Arkham Asylum as a patient ok and so obviously his ass is there there's all these other crazies there you don't have the Scarecrow guys there and so they you know he before that John Doe is there and it's the Joker clearly white skin you know green hair or whatever",
            "start": 1112.41
        },
        {
            "text": "there's all these other crazies there you don't have the puppet guys there and so they you know he before that is there and it's the Joker clearly white skin you know green hair or whatever and he befriends Bruce and kind of like he's like looking out for him but still doing it in like not doing it in the Joker way doing in the way of like because the game's so great at twisting everything and turning inside ahead where you're like is it the Joker or is this guy not the Joker yet or is he can I trust him or can I not and he's still a little bit out there but he's not having the doctors like him but he's clearly **** with them and it's all these different things of like it's not the Joker but you see how it's going to become the joke and by the end of season 1 against was he gets out and like he's out there and you can see him start on that thing and then when we played yesterday in episode 1 of season 2 he pops up again and again still not the Joker but clearly on that path",
            "start": 1157.14
        },
        {
            "text": "out and like he's out there and you can see him start on that thing and then when we played yesterday in episode 1 of Season 2 he pops up again and again still not the Joker but clearly on that path to becoming him yeah yeah that well the cool thing about him is that depending on the player's choice he'll become he'll stay your friend for a long time like he'll because when you meet him he genuinely loves Bruce Wayne like he's the one guy that he doesn't manipulate I don't think like he he manipulates everybody in Season 1 like the doctors he's like hey I'm doing great you know and he convinces them to release him he doesn't escape he gets signed out to like he's a rehabilitated person and then there's this great moment which was a real joy to play where John finally opens up to somebody and he's like I'm not doing so great you know like he doesn't like it like he likes the asylum and he liked the control he had and he's and so he finally opens up to Bruce and playing a guy who you",
            "start": 1191.01
        },
        {
            "text": "and he's like I'm not doing so great, you know, like he doesn't like it, like he likes The Asylum and he liked the control he had, and he's... and so he finally opens up to Bruce, playing a guy who you know cuts miles into people's faces or you know electrocutes them to play him like that was so cool because I'm such a huge fan but to play a character that 70 years old, but plays Jennifer in a very different way was just really great and... and this is really my first job, like, first voiceover job, so you're getting some good first gig, yes, some great games, what's next? What impressions do I put on YouTube for well the latest one I did was you know Matthew McConaughey, I watched Interstellar and I was just like you know I think I can do that voice like I call up the bank and have him forward all that money to my bank account like if it's voice-activated but yeah yeah I mean so you say yeah with the the Joker John Doe voice like we haven't seen the Joker yet cuz everything I've done has been you",
            "start": 1236.28
        },
        {
            "text": "money to my bank account like if it's voice-activated but yeah yeah I mean so you say yeah with the the Joker Heath Ledger and Jack Nicholson voice like we haven't seen the Joker yet cuz everything I've done has been you know more serene and yeah the voice I wanted to do a mix of three Joker's that inspired me so Mark Hamill and Heath Ledger and Jack Nicholson a voice that isn't really an impression of those guys but you can hear it there's inflections here and there that write like oh that sounds a bit just like cuz I love those guys like like there are so many great Joker actors but those three were my childhood yeah so I wanted to sort of honor them in a way that like this voice when you hear it you're like oh okay you know but because it has to also be almost normal like it can't be like hi Bruce I can't wait to see like it can't be too creepy because then you're gonna be like get the **** away from me so it has to be more normal like he's okay you know so that was a challenge to make a voice that's that's unsettling but not",
            "start": 1288.48
        },
        {
            "text": "too creepy because then you're gonna be like get the **** away from me so it has to be more normal like he's okay you know so that was a challenge to make a voice that's that's unsettling but not overly yeah yeah yeah there's this great there's all these little flare ups with them you know I mean really like has that moment like oh god is this where he's gonna break and there's a great one in episode one where they're at a funeral and he shows up and Bruce like why the **** are you here what kind of thing you know I mean and it gives them a card and it's a get well soon card or whatever and like my the choice I made was Bruce handing back he's like you know this isn't you don't give these kind of cards at funerals and he does really angry at himself like he's like a normal person I want so much for him to be accepted by Bruce like he **** loves them and and then he sort of goes out of his way - I like the direction I was given was a first date like a high school date so like I",
            "start": 1337.83
        },
        {
            "text": "I want so much for Anthony to be accepted by Bruce like he loves them, and then he sort of goes out of his way - I liked the direction I was given was a first date like a high school date, so like I got you a little something, please like it, you know. And that was so fun to play instead of just playing a creep or a psycho who would shoot up the funeral or something, just to play this guy who's like, \"Hey, you know I'm okay,\" trying to make it was really fun. So what's it like then to go from, \"Man, I can't book anything but this damn toothpaste ad\" to yeah, I've been Harrison Ford and now I'm the Joker, you know? My two childhood favorite things, yeah. It's really a huge honor just to play both of those characters, just because it's really like my ten-year-old self, yeah. Like there are photos of me dressed up as Indy when I was six, and then there were drawings I did of him in my schoolbooks, you know what I mean? Hahahaha, yeah, and it's just nuts.",
            "start": 1381.18
        },
        {
            "text": "yeah like there's photos of me dressed up as Indiana you know what I'm like six and then and then there's drawings I did of in my schoolbooks of you know hahahahaha yeah and and it's just it's just nuts you know that that that they trust me because I am a complete newcomer Adrien and Joker and that's a huge role yeah so they they trust me to do a good job so you or are you over like impostor syndrome where you're like I have to I can't imagine like doing an impression Harrison Ford sure and then all right cool your cast in this movie you're playing young Harrison Ford I can't imagine why there's gotta be that awesome you hang out - oh like I'm gonna walk on set and I'm gonna meet Harrison Ford and I'm gonna be around these real these real professional people who do this yeah that that is there and that's still something that I'm just because it's it everything is very new oh yeah it's always like nothing nothing nothing and I think nothing suddenly big big stuff I'm on the",
            "start": 1438.99
        },
        {
            "text": "that is there and that's still something that I'm just because it's it everything is very new oh yeah it's always like nothing nothing nothing and I think nothing suddenly big big stuff I'm on the set with Troy, you know so and I was a huge fan of BioShock Infinite and I called my agent from Toronto so I can get me into video games just like that so it really is it's overwhelming but it's also just a huge you know keep going in yeah yeah yeah you know um and it's great that I'm given the chance I'm just hugely grateful how old am I, I'm so talented so young it's a beautiful note as well no it's well it's gone are you planning on staying in Holland then I they call it the Hollywood of Holland all the thing about Holland Holland actually had it's a very big film industry right before World War two it got bombed to **** unfortunately but yeah I definitely I'm hoping that this this is gonna segue me into becoming a resident here and share taking on",
            "start": 1485.91
        },
        {
            "text": "big film industry right before World War Two it got bombed to **** unfortunately but yeah I definitely I'm hoping that this this is gonna segue me into becoming a resident here and sharing taking on because you know there's no there's not really a huge thing in Holland and I do feel that like I got cast one in a million chance of yeah of the director himself seeing me on YouTube and and the same with Joker you know the I didn't I didn't get like an audition reel and like em well that one yeah it was really like a call in the middle of the night like can you read for this so I got very lucky with both and I would like to do it the more traditional way so I can just you know settle in and take off but but yeah from Holland it's very difficult yeah you gotta get out of there I am trying no I just brought in somebody else through immigration I can't keep doing it they'll red flag my paper the one thing I wanted before we wrap up this topic that wasn't a topic but it's become a topic",
            "start": 1541.46
        },
        {
            "text": "I just brought in somebody else through immigration, I can't keep doing it, they'll red flag my paper. The one thing I wanted before we wrap up this topic that wasn't a topic but it's become a topic of one's - you like to play Han Solo, chugger. I want to point out that I was talking about all the things I knew about you beforehand what I want is that you are a genuinely awesome human being because after we met through Skype every few weeks you'll hit me up on Discord but hey man what's going on? Yeah nothing, playing these games guy, how are you? I'm good. - All right well see you later yeah and well I like it, I think you, you, I was honestly I remember um messaging some people because you had be on for that podcast yes I thought this guy's gonna rip me apart like this guy he might be a bit of a dick to me like like I was I was I was really like like I was like these like these guys like I was like oh Jesus I'm the new kid they're gonna be like so who the **** are you but you were so",
            "start": 1589.55
        },
        {
            "text": "to me, I was really nervous, I was the new kid, they're gonna be like, \"so who are you?\" but you were so gracious to me and I was just like, \"I totally misjudged you\", I was so scared going onto that podcast, I was like, \"oh man, they're gonna throw some bars\" but it was so great, like I was just doing this, if you had \"the batman\" as the Joker, we would've but you did great and I'm excited for what's next, thanks dude, but yeah, it was awesome, so it's just like, oh Greg, what you were saying, like, \"if you're in San Fran, you should come behind\", like yes, yes please, like yeah, and you made it, yeah, if you didn't know, guys, this is the GameOverGreggy Show, each and every week, four sometimes five best friends gather on this table, each bring a random topic for discussion, for your amusement, if you like that, head over to patreon.com where you can get each and every episode.",
            "start": 1634.19
        },
        {
            "text": "Four sometimes five best friends gather on this table, each bringing a random topic for discussion. If you like that, head over to Patreon.com, where you can get each and every episode early. How early? Nick's boys happen to know so early you can watch it live as we record it, like so many of you are doing right now. The dollar level - thank you; every dollar counts. However, if you don't want to get it early, whether it be as we record it or wait for us to bring out any more water... oh yeah, that'd be great. I also get me a fridge. Do you want wine or beer or anything? Well, if anyone else is having some, Oh what do you want? Yeah okay sure go get a bowl of ice to cool Greg's drink down. Help too, exactly. Of course now it's become a thing. Do you think you can Nick while you're up could you walk down to Taco Bell and get some chicken nacho things like the front door give us any money - it's no big deal. Head over to youtube.com slash KindaFunny where you can get the show topic by topic day by day until it goes up is one big thing.",
            "start": 1679.6
        },
        {
            "text": "chicken nacho things like the front give us any money it's no big deal head over to youtube.com slash kinda funny where you can get the show topic by topic day by day until it goes up is one big video in mp3 the following Friday topic number two Tim will be yours but first thank you all these beautiful people who supported us on patreon to make this happen you sure you don't want to do the other one I feel like it's a good segue you want you there's that too much there I like it you want to do that yeah we're still doing yours okay I want to talk I'm antsy to talk about number two you well originally to us number two fine then topic number two goes to you Anthony Ingruber oh my my topic okay yeah are we waiting for Nick here's the thing you talked about DC even if Nick was sitting here he'd be half on half off I know what he hears what he doesn't know okay well this is kind of a hacky question it's not a but I think it yourself down the creek I figured I figured it would be",
            "start": 1727.03
        },
        {
            "text": "Here he'd be half on half off I know what he hears what he doesn't know okay well this is kind of a hacky question it's not a but I think it yourself down the creek I figured I figured it would be appropriate I want to know you guys probably talked about this before but how do you feel about the DC Universe on the big screen we've talked about it before and we'll talk about it again I won't talk about it I will talk your ear off about it let's lay the groundwork first though okay before we give that would there's one question that'll set it all up Anthony what do you think about maybe Superman okay there are problems with it but I will say warehouse fight scene and the file thank you very much and this the scene where Batman and Superman square off yeah and also I loved Ben Affleck as Batman hell yeah and I think Henry is a great Superman I agree and I think there were just some moments in there like some plot things I was like huh and some stuff that I was liking but there were",
            "start": 1780.73
        },
        {
            "text": "Batman hell yeah and I think Henry Cavill is a great Superman, I agree. And I think there were just some moments in there, like some plot things, I was like \"huh\" and some stuff that I liked, but there were so many moments in there, like the way it shot, I like Zack Snyder's Watchmen is one of my favorite movies, yeah, yeah we all like watching Watchmen was great and he knows how to frame a shot and how to use music. And so I think cinematically I enjoyed it, and I thought that those you say it's a good movie would you say... I think we got slighted a lot, agree with that, and all it got really rammed if you had to watch one all day long for what, for an entire day, Batman v Superman or The Dark Knight Rises which one would you choose because that's what like again, the Dark Knight Rises, I loved it but again there were parts that I didn't like, you know and it's not bad, I'm not gonna be like yeah that was amazing in that one crap because with everything there's stuff that I like some stuff I didn't like.",
            "start": 1833.53
        },
        {
            "text": "were parts that I didn't like you know and it's not bad I'm not gonna be like yeah that was amazing in that one crap because with everything there's stuff that I like some stuff I didn't like and I tried to merit it like if there's a part in any movie where I was like that was great then I'm like yeah I enjoyed it if it's like I didn't like this so I hate it but but I mean that **** warehouse scene and I think Ben Affleck The Dark Knight Returns Batman Frank Miller's Batman and he's my favorite yeah that's my favorite story and Ben Affleck is very much how I envisioned him to look with that chin and really like cocky bad girl like taking a guy out with one punch more so than bail like I like Christian Bale especially him it's Bruce Wayne but his Batman was very much you know share all this all this stuff whereas no Affleck it's just I'm like you know and like a guy in a hospital and I thought that was just very comic accurate and that and that's what I like the different one about",
            "start": 1885.4
        },
        {
            "text": "this all this stuff whereas no Affleck it's just I'm like you know and like a guy in a hospital and I thought that was just very comic accurate and that and that's what I like the different one about it and we did a topic here recently about all right you know there's been this hullabaloo is bad but how long's Ben Affleck gonna be Batman what's gonna happen with all the super stuff we did a topic about like well if we had to recast it what do we do who's going to be one of our back because I think you'd be the one that I'm picturing because we've already had so many different Batman right I'm ready for a more grounded real take on him of a dude right like not yakked out of his mind yeah it he's in a suit he's got the flashlight in his mouth and he's going through files and being a detective yeah well I think I mean Troy I think in this game does it also very beautifully there's such a distinct switch between his Bruce Wayne persona and Batman persona and I think that's the most",
            "start": 1932.41
        },
        {
            "text": "yeah well I think I mean Michael Keaton I think in this game does it also very beautifully there's such a distinct switch between his Bruce Wayne persona and Batman persona and I think that's the most important thing because it is it's essentially three personalities you got the public Bruce Wayne who's oh yeah a guy dresses up like a bat clearly as issues and then there's the Alfred my parents are dead and then there's you know why do you want to kill me so there's three you know I got all those bail those are all bails Michael Keaton was also amazing just like his like you know how are you just whispered right it was it was unsettling I loved it like he was scary if you had to pick one I know you're not a fan of picking yeah I don't want your bail people yeah like oh it's cuz you were too young to understand how important Keaton Keaton I think just because it is so comic book like I love the Gotham City in Tim Burton sure that is a character in itself and I mean I mean the thing is that that's that",
            "start": 1974.83
        },
        {
            "text": "how important Keaton I think just because it is so comic book like I love the Gotham City in Tim Burton sure that is a character in itself and I mean I mean the thing is that that's that Bale's Batman wouldn't work in that universe same as um Heath's Joker sure it's too real and that's why Nicholson worked perfectly in the Burton movies because he was a he was a cartoon character you know um and then and then Heath took it to a very grungy scary state and that that's why these movies I sort of value them as their own thing I don't like mix-and-match or whatever right I mean I agree with everything that you said about Batman V Superman I think I can totally stand behind it's just the thing when you look at it as a movie yeah yeah that's when it kind of falls apart especially when are you looking at as a movie that has to be part of this bigger universe and where it falls into it especially when we've seen Marvel do that same thing so you're kind of judging against what is",
            "start": 2034.02
        },
        {
            "text": "are you looking at as a movie that has to be part of this bigger universe and where it falls into it especially when we've seen Marvel do that same thing so you're kind of judging against what is popularly viewed as a successful model and I feel like in that regard it fails because it reminds me of everyone shits on the Transformers movies for good reason transformers to the forest fight I love it like there's certain scenes that I **** love it you know but then it's like oh but Optimus would never act the way he does in every other scene or whatever that's where it's like with Batman Ben Affleck is Batman I **** him all about it it's just Ben Affleck in this world doing the things he did yeah with all these things going around I'm like yeah yeah III appreciate that and I understand I mean I I just see it for me with films like films were something that you know growing up the way I did where it was really just like three years in one country and then hi I'm Anthony hey I'm",
            "start": 2082.81
        },
        {
            "text": "I mean, I just see it for me with films like films were something that you know growing up the way I did where it was really just like three years in one country and then hi I'm Anthony hey I'm starting to get to like you I gotta go you know so I didn't have you know I've got friends now like lifelong friends from those experiences but that was always very tough on a kid so what I did have was films and that was really my childhood and that's where the impressions and stuff comes from but so if I enjoy a movie like if I enjoy part of a movie even I don't like the whole thing then I'm like yeah I enjoyed it you know and I'm not I'm not film snob or anything I'm not saying like oh it was amazing because of that one scene but I just I just take it from the enjoyment sure from something like I'm not gonna I'm not gonna be like all that movie was terrible although I did have a good time you know so it's like if you had a good time that's why you like you know cult films are so popular",
            "start": 2124.66
        },
        {
            "text": "I'm not gonna be like all that movie was terrible, although I did have a good time you know. So it's like if you had a good time, that's why you like... you know cult films are so popular like The Room, you know? Yeah, terrible movie but I love it, you know. A bit of a preview for the I Want to See It, that looks fantastic. You do another good impression, that to Troy we're doing, waiting for the game and they were chirping back and forth. Have you seen how many times like The Greatest Thing is like when you... when people point out what's wrong with it because when you watch it, you're like \"what the...\" but then people point out how many times oh hi Mark or like oh hi, it's like 14 times in the movie, yeah. Like everything is all high or when she says I don't want to talk about it, like she says that... like like like 12 times or something, like she'll just be like \"I don't want to talk about\" Scarpino wrote a script right? If every one out of every three lines starts with wait, wait.",
            "start": 2172.78
        },
        {
            "text": "it's like she says that like, like, like 12 times or something, like she'll just be like \"I don't want to talk about\" Scarpino wrote a script, right? If every one out of every three lines starts with \"wait wait\", some of that yeah right what just happened I love it write what you know you got a road yeah the way the room is one of those interesting films, it's there's a bunch of old theaters in San Francisco that are like old school, like just want you walk in it's the lobby and then there's two doors that go into the theaters very old-school historic theaters, one of which is The Clay Theatre and I saw Impact Heights that heel kick was there last time Danny was in town and they play The Room I **** you not once a month and I dry every once in a while I'll stop off at a coffee shop near a Starbucks right across the street from a delicacy and I'll see it, I'm like one of these days I really should see that movie but you know you're in for just an hour and a half of pain like if there's no redeeming qualities no",
            "start": 2215.74
        },
        {
            "text": "street from a delicacy and I'll see it I'm like one of these days I really should see \"Room\" but you know you're in for just an hour and a half of pain like if there's no redeeming qualities no I mean is that about it is that it actually because that movie got such a bad rap I still haven't watched \"Room\" with Brie Larson that movie's awesome I know it's on my watch list and I don't want to have the same billing actor you wouldn't want to be in the room oh but it's a different room because everyone's like oh I heard it's terrible and completely different movie that was what I heard when I first went when \"Room\" came out I was getting buzz last year sometime um maybe we're like he got to see \"Room\" I'm like I thought that movie was supposed to be terrible yeah I was I didn't realize there were different movies there were two different you think like the marketing people would point out like by there's one of the worst movies ever made and it's called that some call it maybe we should call",
            "start": 2260.41
        },
        {
            "text": "different movies there were two different you think like the marketing people would point out like by there's one of the worst movies ever made and it's called that some call it maybe we should call it like a little room or a big room or not that room good room yeah it's one of those I The Disaster Artist looks amazing yeah that's one of those great apparently the book is just fantastic like I love that I don't know what it is about stories about train wrecks that I find so fascinating do you know The Island of Dr. Moreau I was just about to bring up Doc I don't know this story this is Fenton there's a documentary I believe it's on Netflix still and I've Kevin can you look that up I forget the name of it just type in Island of Dr. Moreau Netflix anyway it's it it talks about the the making of The Island of Dr. Moreau starring Val Kilmer and one of us yeah this was when he went and he was just completely gone yeah he did his next movie afterward about stealing try nice little",
            "start": 2310.09
        },
        {
            "text": "making of the island of dr. Moreau starring Val Kilmer and one of us yeah this was when he went off the rails and he was just completely gone yeah he did his next movie afterward about stealing a little rod or something like that it doesn't matter it's so fascinating though because it started this cult director and I forget the guy's name, the French guy, yeah he has left it to beaver he might not be on there anymore um can you look I just looked at the title of it just have an island of dr. Moreau documentary figure that out it's it's worth watching it so it's worth the walk anyway long story short as this guy had done some cool like ish mid-80s I want to say or made middle 80s he'd done some interesting like indie films and some music videos like that no like hey we want to give you this project that's been in the works for well I lied about tomorrow and he was like cool I love that that's a great great thing for me to sink my teeth into and then it becomes this classic",
            "start": 2359.61
        },
        {
            "text": "give you this project that's been in the works for well I lied about tomorrow and he was like cool I love that that's a great great thing for me to sink my teeth into and then it becomes this classic tale of he started production on it right and every single decision they could have made went wrong way it was wrong and the wrong choice like the and they start they start talking about this like you're his losses the doomed journey of Richard Stanley's Island of Dr. Moreau as the director and then once Marlon Brando got involved it went from bad to worse and then Valeria Golino took it to another level, the stories of the way Kilmer was behaving these people like physically fighting people on the set because he was going through a divorce and um Brando there was this amazing quote where he's like \"I think I'm mistaken, check with your talents\" and he just flipped out like like it was just and they had to have a liaison between them",
            "start": 2404.79
        },
        {
            "text": "where he's like i think i'm mistaken hey check with your talents and he just flipped out like like it was just and they just wouldn't talk to each other so they had to have a liaison between and they wouldn't leave there was a story because they were filming in the tropics and it gets very hot yeah and those extras like the thing about that movie is the creature effects Stan Winston did them so everything looks great like the extras are old because there's supposed to be like half human half animals so they got so they got this amazing makeup on but they were waiting for you know hours and hours and hours because they refused to come out of their trailer Marlon Brando and Catherine Deneuve because they just hated each other so much good lord and so it was just people were like passing out and stuff and then and then just the stories it's just like it's more it's better than the movie just the stories hey I mean far better than a movie was a train wreck and you can see why it's fascinating",
            "start": 2452.2
        },
        {
            "text": "then and then just the stories it's just like it's more it's better than the movie just the stories hey I mean fight far better than a movie was a train wreck and Len you can see why it's fascinating as a child I watched that because it was huge Val Kilmer fan obviously coming off of like Top Gun Batman Forever which at the time I was like I don't know why I should like this I don't but I still love Val Kilmer right Sid thank you much yeah here done the guns in the darkness Batman smile I just **** my pants well okay fantastic it's just anyone that had to do with any of those those Joel Schumacher movies and burned a bridge in my in my brain but no I mean like coming off of that I wanted to like this member like this is really cool looking and it's like remote and then you watch it when you're a kid and you're like wow that was just yeah I'm here really cause it was like it was it was just when I was forming kind of what my idea of a good or bad movie this was me and I was like I",
            "start": 2496.27
        },
        {
            "text": "you're a kid and you're like wow that was just yeah I'm here really cause it was like it was it was just when I was forming kind of what my idea of a good or bad movie this was me and I was like I don't get this it's weird it's terrifying it doesn't make any sense it's I don't and then seeing why that is like 20 years later and I watch documentary made oh now you're talking about this one well I haven't seen it since I saw it probably on VHS I saw the theaters and then of course anytime I was a kid anything I saw in theaters I needed to watch it again where we talk about forever now we're talking about in Batman Returns I'm Remora okay it was not that bad okay tracks and we were like what we'll fight you forever that it's forever okay phone yeah the only recession when we were kids Robin it could be me my parents died like I was 23 okay films when you don't compare it to the two films that came before it if you if there if there had never been a Batman (1989) and Batman Returns if there",
            "start": 2546.79
        },
        {
            "text": "Robin, it could be me my parents died like I was 23 okay films when you don't compare it to the two films that came before it if you if there if there had never been an '89 and Batman Returns if there never been my see it more like a return to the animal that's what Schumacher did yeah when I I appreciate for that but just the Nicholson **** it's just well the first two films are beautiful their classics in anyway and it's one of the things we talked about all the time where I watched I watched the 8th Batman that's probably the movie I've seen most in in theaters I remember distinctly at three weekends in a row and it was my mom take me back to it to a to a theater to see that and they're something we're talking like this movie was shot so dark and at certain points that legitimately you couldn't tell it was going on the whole belfry scene I was just like I don't know what's happening I have to see it again to figure it out myself I still yeah like it's actually like one",
            "start": 2591.55
        },
        {
            "text": "you couldn't tell it was going on the whole Belfrey scene I was just like I don't know what's happening I have to see it again to figure it out myself I still yeah like it's actually like one of those things they had to go back and reprocess it up the brightness of it cuz people couldn't what the **** is going on all black suit everyone's wearing black there's even a black dude like there's that you can't see what's going on most the time but then you get the Joel Schumacher movies actually I'm sorry then you get Batman Returns I was like it's not that way you know that was a reason for Schumacher actually because kids were crying and McDonald's pulled out of advertising because of really one yeah I don't know a huge controversy that Penguin was so sexual oh yeah yeah **** on my bed and they were look this is like we got it let me put a button down we got a kid's meal with this guy on it so they were really doing you think so when it came to Schumacher they were like we need",
            "start": 2640.12
        },
        {
            "text": "Bed and they were looking at this, like we got a kid's meal with this guy on it, so they were really toning it back for kids. We need to give it for kids, and that was you know, there was also another documentary about the making of Batman with Schwarzenegger, no, Batman & Robin, yeah, and he was like people were ripping out designs because they were giving it to this Chinese market to make molds for toys, so they had these unfinished prototypes, and like, yep, that's good. And then they were shoving this stuff out for kids to buy, and then everything had to be like... what's an Uma Thurman was like Joel would scream out over a megaphone, remember this is for kids, it's a toys commercial, and so that was the direction, so everything had to be for kids. And then I'm gonna McDonald's away hard, oh yeah, Kevin had all the cups, it was like clear plastic cups, yeah, yeah, yeah, yeah, there was I",
            "start": 2676.56
        },
        {
            "text": "that was the direction so everything had to be for kids and then I'm gonna McDonald's away hard oh yeah Kevin had all the the cups it was like clear plastic cups yeah yeah yeah yeah yeah there was I figure where I read it but they were talking about how the the execs at McDonald's couldn't figure out like they I think it was Tim Burton was maybe was Tim Burtons saying it maybe was I'm to be trivial I have no **** idea where we'd have this show but they were talking about how there was a paradigm shift when it came to returns and that he was like it was the first time anyone was asking like why is there black stuff coming out of you know one's mouth no and like that's disgusting and do we need that and that's when he knew he was like I don't I'm not gonna do the next one of these like it's just too much just I want to justify my vision well this movie's not about the vision anymore now it's about mass marketing which is what and then Joel Schumacher was like I will sell out",
            "start": 2729.96
        },
        {
            "text": "It's just too much. Just, I want to justify my vision. Well, this movie's not about the vision anymore; now it's about mass marketing, which is what Joel Schumacher was like: \"I will sell out everything.\" Everything he did that was apparently because of Greek god statues, that was his reasoning for that. Like you know those classic yeah but I was like \"But the outside dicks though?\" Yeah, I know. Just putting that out there. If I can... yeah, I know that's maybe that was like cos there's more like I'm fine with the nipples but get rid of the little doink link down there. Kevin loves doing curse it's taken off; stay out of its way. Yeah, I miss those early films, but but anyway going back on that long road yeah when I watched The Island of Dr. Moreau I was like \"This movie's horrible\" and then seeing it going back and seeing why it's very very fascinating and then you start to look at that and go \"That has to be what happened to all of these films that I don't like\" and so when you see a",
            "start": 2770.88
        },
        {
            "text": "seeing it going back and seeing why it's very very fascinating and then you start to look at that and go that has to be what happened to all of these films that I don't like and so when you see a bad film watch this documentary and then go and watch for films like Transformers or things like that and you'll understand why these wise guys don't come together Transformers isn't that bad that's the thing I'm liking it when I saw it I was always like 17 when the first one came out yes Shia LaBeouf and I I enjoyed it although that was fun to Informers one walking out of the theater result people were like what was the tagline for that you'll you'll believe in something like things war than meets the eye yeah yeah like I remember so well this is imprinted I was like that's pretty good and she's like more like less meets the eye like people were just ripping on it I was like I thought it was okay well the first Transformers was was a standalone okay movie exactly the one with Mark Wahlberg here",
            "start": 2819.06
        },
        {
            "text": "like more like less meets the eye, people were just ripping on it, I thought it was okay, well, the first Transformers movie was a standalone, okay, movie exactly, the one with Mark Wahlberg. Here we go, first time, Mark, you think your impressions are good? Hey, I'm Mark Wahlberg, is that Optimus Prime? I don't know, everything's great, so how do you love it? Somebody bring me some drink, maybe I'm thirsty, I don't know. He just does that, what's up, do you do there's a T-Rex guy, like then the the what is it happening? What no, the trees are the trees, they're not after us, how do we fight trees? Does anyone know how to fight trees? Google it, That Happening is a movie that I put on that list of like it's so bad, like That Happening is one of the worst movies I've ever seen but I love it so much because of Mark Wahlberg. It's like what are you doing, it seems like it seems like it's actually a good story on paper, like trees because they're everywhere and if they turn on you, but translating",
            "start": 2861.99
        },
        {
            "text": "of Mark Wahlberg it's like what are you doing it seems like it seems like it's actually a good story on paper like trees because they're everywhere and if they turn on you but translating like it's something that Stephen King would come up with yeah give them enough you know time like that sounds like something that Stephen King would write like like trees they're everywhere what if they turning but translating it to film it doesn't really work cuz they're running from the wind yeah right and they're supposed to build suspense but they're just running from nothing what I like about it is that they attribute it to the end see again this is me going backward Laura flying it because I've thought about this movie way more than I should have which I guess it did its job but it's like the movies not about the trees attacking the movies about the pipe that they think it's the trees attacking but they don't know what's actually happening right and I enjoy that I feel like by the end",
            "start": 2908.52
        },
        {
            "text": "the movies not about the trees attacking the movies about the pipe that they think it's the trees attacking but they don't know what's actually happening right and I enjoy that I feel like by the end of it they **** it all up but it's just I like the idea that they're running from the wind but that could have not been the enemy yeah you know like that's an interesting idea but when it's Mark Wahlberg running from the wind into a comedy is kind of fun Mark Wahlberg I love Mark Wahlberg first of all but just going back to that Transformers movie it was just he just was up against the wall on that one right I feel like that was just they were just setting him up for failure right off the bat and then that million dollar paycheck makes on poor guy I'm sure Mel Gibson but yeah the thing is that like he did that because he was being typecast as the like in The Departed and you're like I was playing like a tough guy and he said like I want to play a teacher or something so he did like the exact",
            "start": 2962.45
        },
        {
            "text": "He did that because he was being typecast as in The Departed, and you're like I was playing like a tough guy, and he said like I want to play a teacher or something, so he did like the exact opposite of what he was always doing, so like that's why he acted like that. That time I was in Transformers; he plays the Bumblebee guy again. I have the utmost respect for Mark Wahlberg - if you don't realize, Mark Wahlberg is the one who could've produced Entourage, and he makes great content with his homies. They make great content; it's just when you see him in a movie, he's a ridiculous human being to begin with. You see even in movies like Transformers, for whatever it was, and the movie makes zero sense - all it is at one point in the movie, the entire third act is just them slow-mo jumping from one part to the other, and then grabbing a gun and shooting it; nothing happens, and then another transformer comes over, and it's just like, \"Was that another transformer?\" It's just",
            "start": 3002.08
        },
        {
            "text": "them slow-mo jumping from one part to the other and then grabbing a gun and shooting it nothing and then another transformer comes over and it's just like was another transformer it's just another weird mechanical sound like they're not even trying Age of Extinction Transformers 4 was so bad because it doesn't have the moment you're talking about okay it doesn't have the one scene that's like it's a horrible movie but there's that one thing right you know it didn't which what was the one who learn at all was it the first one where it has a dope-ass scene on the and the highway where Optimus like that's three transforms and flips and just goes like bang and takes it like shoulders something out of the well it's Optimus but in Transformers 3 has the highway scene but and Transformers do as the boy one Transformers one through three one is an okay movie two and three are not know but they have enough moments that on my alright cool shirt they're fun yeah but that's",
            "start": 3046.96
        },
        {
            "text": "Transformers do as the boy one Transformers one through three, one is an okay movie, two and three are not known but they have enough moments that on my alright cool shirt they're fun yeah but that's the whole point for films is entertainment right Kevin will come over and do a waste box your ears bang and after all so yeah the whole point is like if you took something away from it that you enjoyed then the film did its job it doesn't have to be Citizen Kane or Apocalypse Now but you know if if you left there saying you know I enjoyed that then it did its job but see I don't know about that because Batman v Superman, for example, was a disappointment for me where I enjoyed maybe Superman there are scenes in it that I loved and it was very entertaining by I left that theater being entertained but I expected more I don't expect Citizen Kane but I expect The Dark Knight that's fair let's you know I like there's like a level that like we deserve at this point where it's like at the very good Marvel doesn't",
            "start": 3087.48
        },
        {
            "text": "more I don't expect Citizen Kane but I expect The Dark Knight that's fair let's be real I like there's a level that we deserve at this point where it's like at the very least Marvel doesn't give us The Dark Knight okay fine but it but it's Batman though we've already gotten a Batman that's fair we've never gotten a Marvel story that good right but we've gotten one through The Dark Knight no no yeah we got Iron Man was pretty awesome it was but it's not The Dark Knight he's you know I'm saying can you do a Jeff Bridges idea just to give me another one give me some lines tour Oh seeing how this show is just turning into the Troy show where we just talk about whatever I love it this is great I'm having a good time watching The Vanishing last night have you ever seen this movie with can you help me it's a foreign film it Jen ran into it through the internet where I think on Reddit she saw Stanley Kubrick say this was the creepiest scariest like gave him more chills than any",
            "start": 3131.31
        },
        {
            "text": "you help me it's a foreign film it Jen ran into it through the internet where I think on reddit she saw Stanley Kubrick said this was the creepiest scariest like gave him the chills more than any other movie more than any of his movies right yeah and so I we put it on and watched it and it was it's a foreign film I forget they're going from France I think I want to see they're coming from Holland but maybe that's not it my time right now I got the guy and his girlfriend are driving through France or whatever they stop at a gas station she disappears they and so I think they remade that that was good it wasn't at all what I thought it was going to be right because I had it in my head it was going to be like the Kurt Russell one where his wife gets abducted by the truck yes that's a great movie I love kinda just talked about that the other day it's some breakdown breakdown breakdown I thought I mean like breakdown or whatever but like it's like suspense what's gonna happen",
            "start": 3179.56
        },
        {
            "text": "A great movie, I love kind of just talked about that the other day, it's some breakdown, breakdown, breakdown. I thought I mean like breakdown or whatever but like it's like suspense, what's gonna have a kind of thing and it is but it isn't anyways. Then Jen was like \"it got remade\" way like okay cool this is the original one yeah right, RoboCop and Total Recall, and then this is the other one, the 1993 remake in America, Jeff Bridges, it's awesome. I believe it's if not her that's right, it's her first film, one of her first, it's Sandra Bullock, she's the woman who gets... she vanishes and it's one of those \"what we watched the trailer for it\" and it's like funny to watch a movie because it's like literally we finished the original and watched the trailer for this one. Would've bought it probably if it was available to rent right there but like stars, whatever anyways though it was Jeff Bridges and that made me think of Jeff Bridges cuz I like Jeff Bridges is a **** G he is a **** Christian Slater as Big Boss what",
            "start": 3224.86
        },
        {
            "text": "right there but like stars whatever anyways though it was Jeff Bridges and that made me think of Jeff Bridges cuz I like Jeff Bridges is a **** G he is a **** Christian Bale as big boss what do you think no no really I would do that no no you play live action oh oh no did you like I love Greg Miller Solid five oh I didn't he I thought it was a weird move to audible to Kiefer Sutherland here when we've had David Hayter for so long and he's been so great he is snake is snake I think that that's the thing is that it's when you think of Nicolas or you think our nickels in or you think yeah there is you know you can't exactly you can't just like make anyone **** everyone gives Jared Leto so much **** as the joker I know noise people's eye shadow that I liked his interpretation I thought it was good feeling I've seen I've seen a lot of jokers in my day Solid Snake is a character because of the voice right I think that when you change that especially when you make it a celebrity it",
            "start": 3267.31
        },
        {
            "text": "It was good feeling I've seen I've seen a lot of Joker's in my day. Solid Snake is a character because of the voice, right? I think that when you change that, especially when you make it a celebrity, it takes away from it, especially when there's all the other stuff. Well, the thing is he didn't actually do that much like there was which is like for publicity because I know that Kiefer had a huge you know paycheck for that. Oh sure, but David Hayter, like I grew up with David Hayter, but I also really liked Kiefer so long. Yeah, a lot like um I just like that scene you know I'm will make diamonds from her ashes pick him in a battle with this like he had he had a cool voice but like this hater was also very snake. You know what do you think that gives him Sutherland thought when he got about halfway through that script he's like I don't know why the **** I think the story was about like I mail gets on five like I was like what was it about you know like like um",
            "start": 3318.0
        },
        {
            "text": "when he got about halfway through that script he's like I don't know why the **** I think the story was about like I mail gets on five like I was like what was it about you know like like like um Liquid Ocelot, it's supposed to be a sadist and then he was the guy who was calming down cause ya know like wow this guy is supposed to shoot out his eye and everything like and then he was just had this person he's just like that move that game from like I'd played all of them like to be fair a lot has had quite the change over it like he and the guys like a quadruple agent like he works for everybody he works for you know Filipino you know government as well like probably but I I couldn't tell you what the plumber that game was it was about you know language and how it's a very for all of us there was Metal Gear Solid, what was it called oh you're right it was something like that Wow it's definitely one that couldn't pronounce I know exactly we're talking about at the very end like yeah",
            "start": 3363.96
        },
        {
            "text": "Metal Gear Solid V. What was it called, oh you're right, it was something like that. Wow, it's definitely one that couldn't be pronounced. I know exactly which one we're talking about, at the very end, like yeah okay that's cool. Was it thanks no, that was I mean for me it's just Metal Gear Solid V what a great game so much fun to play I mean like great on that level and okay this is awesome the customization the hours and I was replayability but what a shame in two Kojima helming it because of the way he gets him and Konami and the way it all comes apart and what maybe should have been the final chapter or whatever that game every purpose and then the idea of like yeah that like alright cool we're getting one more Metal Gear game it is gonna be arguably the best gameplay the series has ever known and it's not gonna be David Ate, like we can we not just get this can we not cross the finish line with the guy it would have been cool if because I cuz I mean um Big Boss at the end of",
            "start": 3411.21
        },
        {
            "text": "ever known and it's not gonna be David Hayter like we can we not just get this can we not cross the finish line with the guy it would have been cool if because I cuz I mean um Big Boss at the end of Metal Gear Solid for how can you still be alive it was a different guy yeah and yeah it was like like um let's go my son there's no need to fight and I was like okay so they're kind of doing the same thing where the voice will shift but that was that was a moment though they did that because Big Boss had been dead that whole game yeah it was only revealed that he was still alive during the post-credits of the extended extra end right so it's like when you've seen the credits and you see Big Boss man with a different voice actor it's like wait what and it stopped it goes bring it has the animation March that was a moment I honestly thought that there would be a like a epilogue chapter where you got to see you know that kid Snake ya know in MGS4 yeah where you see the clone and then David Hayter",
            "start": 3458.58
        },
        {
            "text": "that was a moment I honestly thought that there would be a like a epilogue chapter where you got to see you know that kid snake ya know in five oh yeah where you see the clone and then David Hayter would do the voice yeah I was waiting for that I was waiting for him to be like yeah kept you waiting huh thing for the fans I remember going into Metal Gear Solid Five, mean you were like alright and then in Chapter 3 it's the remake of Metal Gear and there we're gonna get that and it'll be David Hayter with Kiefer Sutherland this is all a big play and then now that was there yeah was this all we were going into Ruse is this all a work like he's yeah exactly before there was that amazing turn I keep it so number heaven welcome over here is episode number 194 there was that great bit where they goes back to um Shadow Moses yes and it's like and he gets the USP or whatever yeah this is so calm right so come and he's like been a long time or something you really really good I got I got",
            "start": 3504.78
        },
        {
            "text": "they go back to um Shadow Moses yes and it's like and he gets the USP or whatever yeah this is so calm right so come and he's like been a long time or something you really really good I got I got a message from David that he's like stop doing my **** know you liked it cuz I send it to him I was like hey David I love you um really nice guy how many impressions can you do I mean I'm not like you look for a real number but I mean there's actually quite a lot of voices like I I don't like the ones that I do well I think I'm pretty accurate you know I don't do Walken yeah but I could you and then it wouldn't be probably good that you don't you wanna know it's looking this kind of a joke where it's just like we do everything things you can do it yeah yeah how dare you well yeah thing is like i won't i won't do something that I don't feel is that good sure like I'll be like I'm not that great at that but like if you want to hear Matthew McConaughey you know feel that confident about like",
            "start": 3549.06
        },
        {
            "text": "I won't do something that I don't feel is that good, sure. Like I'll be like I'm not that great at that, but like if you want to hear Matthew McConaughey, you know, feel that confident about... well, the thing is, like I love doing John Malkovich, but sometimes he does John yeah, I do, but but sometimes like sometimes I thought get up, but like you know he was in that movie where he's like what the **** it's like a movie with a cold burn after eating. Oh yeah, like **** you, Peck, you're Mormon compared to you; we all have a drinking problem. What the **** is this? Whose ass didn't I kiss? Like he's got this insane way of talking so good. Um, and I love John Malkovich; she was in the Empire Strikes Back movie with Christian Bale when he was 10. I was like it's like oh you're a tired boy Jim, he's like oh Shanghai Shanghai Jim, and he takes his glasses and he's like so um I'm gonna sell you for a slave because I'm a complete **** but you know I've got that charisma so I'm gonna get away with it like",
            "start": 3604.2
        },
        {
            "text": "Shanghai Shanghai Jim and he takes his glasses and he's like, \"So um, I'm gonna sell you for a slave because I'm a complete *****, but you know I've got that charisma so I'm gonna get away with it.\" Like, I thought he was like John Malkovich, so yeah, there's a lot of voices that I... But again, that was my childhood. I watched that movie when I was 10 and I loved it because Christian Bale's character was the son of a diplomat, and I was like, \"That could have been me in the Philippines if I had been born there.\" He could have been me in that situation. So, like, those films I have an emotional connection to... Like The Shining is my favorite film, and I can do like that entire scene where they're calling him Jeeves II, Oh Grady son Delbert Grady, Grady Delbert Grady... You uh, married man? Oh yeah, Mr. Grady. Yes, I have a wife and two daughters, and where are they now? You chopped your wife and daughter up in little bits and...",
            "start": 3658.5
        },
        {
            "text": "son Delbert Grady Grady Delbert Grady you uh married man oh yeah mr. Grady yes I I have a wife and two daughters and where are they now you chopped your wife and daughter up in little bits and then you believed brains out like I know sounds great too yeah no I was watching uh I watched Atomic Blonde over the last weekend what you told me yeah burn content can't bring countenance I haven't seen you since last weekend but I saw with I saw with my wife on Friday beautifully film movie fun movie great action pieces obviously I need to see it uh you can wait I don't think you need to see it necessarily I think it's like it's it's more of a spectacle movie it's the guys I'm not mistaken I think it's the guys that did John Wick so it's like the actions insane and that's really all that is about and if it's about that and just watching Charlies Throne we're amazing outfits but my my one critique of it is that she does a British accent the entire time really she's not very",
            "start": 3706.31
        },
        {
            "text": "Is about and if it's about that and just watching Game of Thrones we're **** amazing outfits but my my one critique of it is that she does a British accent the entire time really she's not very good at doing over sex and sadly yeah well that was the one thing about my upbringing that it gave me the option to learn all those different accents yeah because you just went into a pretty like a British accent oh my god pretty spot-on thanks man like for five seconds to see if you can do it for an entire film yes well you know I could just do the entire interview if you like in a different accent if you like I mean I can do like you know the Australian thing that the most insulting things you know it's very accurate the thing is like the more with the Australian accent I mean you get you know the Hugh Jackman's or the Thor's sure you know but they learned how to get rid of that mmm that inflection like they had to go to dialect coach because really if where I grew up was really they call",
            "start": 3767.57
        },
        {
            "text": "the Hugh Jackman's or the Thor's sure you know but they learned how to get rid of that mmm that inflection like they had to go to dialect coach because really if where I grew up was really they call them Baggins like bogans which were like redneck and they do sound like that like it's it's very here it always reminds me of when I forget the actor's name but the guy who is Russell Crowe now I've lost what he's into clean duck no not Dick Van he's Australian yeah I think he's New Zealander actually Samuel yeah I'll figure it out look I figured it out um lost my train of thought on that one never mind okay a lot of good you see you credit all the accents and stuff and the impressions to my dad's job you know into that for that upbringing because I think if I'd just grown up in one place and had a very normal upbringing I probably wouldn't be an actor so what what are you what is your nationality right now what's your path I'm Dutch Dutch Australian okay so you're Dutch it you see",
            "start": 3814.37
        },
        {
            "text": "a very normal upbringing I probably wouldn't be an actor so what what are you what is your nationality right now what's your path I'm Dutch, Dutch Australian okay so you're Dutch it you see if dual citizenship very cool that's actually pretty cool yeah it is very cool but doesn't help me get into the states sorry what part of Holland do you live in I live in Boston area okay Boston area which is um quite close to the coast and I love I just bike to the beach as much as I can even when it's raining and I swim that's fantastic in the ice you guys have never been to Holland have you oh no it's cool Amsterdam is very busy yeah it's not it's I mean like it's it's tiny but it's packed like the houses are all stacked and everything's very slanted like if you roll a dime on the floor so it's gonna do like everything is crooked because these houses are from you know turn Middle Ages yeah yes yeah yeah I mean it was a huge shipping port and it's very cool and yeah I do really like Holland but in",
            "start": 3862.74
        },
        {
            "text": "do like everything is crooked because these houses are from you know turn Middle Ages yeah yes yeah yeah I mean it was a huge shipping port and it's very cool and yeah I do really like Holland but in terms of work gold mine have you have you thought about doing the Canada like going to Vancouver yeah well I lived in Toronto for for three years and then I and then I also lived in Ottawa as a child okay so um and there is a scene there but it's it's it's again it was it was really the only way I got noticed was through YouTube because I was just a face in a book with the headshot yeah and it was like well what the **** is this kid done it hasn't done anything so YouTube without YouTube I wouldn't be sitting so I'm gonna write a letter yeah yeah now if we can take a quick aside jerk yeah do we want to talk about the fact that yeah in front of them hula kroy's a coffee like last summer he has a drinking problem he had a drinking problem for a long time and then there they all are",
            "start": 3913.59
        },
        {
            "text": "yeah do we want to talk about the fact that yeah in front of them Hula Krogs is a coffee like last summer he has a drinking problem he had a drinking problem for a long time and then there they all are there's I wanted to be clear I do have a drinking problem yeah but I also want to clarify that I just like drinking things I don't think I have an alcohol you don't know alcohol problem you said on the show before your drinking problem is that you said that on the show you've said it house you we've talked about that cuz I realize about recently but it was in dinner we had the problem with you recently is the fact that it's been a few months yeah it's been a couple months yeah it has thank you chemically in this office man yeah it's actually 19 see that my problem is you just keep your body guessing to an extent that I can't worry or not exactly what I mean oh I for me I mean I have the very high but I do the handoff of alright coffee stops and then alright now we're moving into a we're",
            "start": 3966.39
        },
        {
            "text": "\"Guessing to an extent that I can't worry or not exactly what I mean, oh I for me I mean I have the very high but I do the handoff of alright coffee stops and then alright now we're moving into a we're in and we're going from the Unity yeah you're like you're saying we're gonna for the accelerant to the depressant you know I mean I got oh I'm not gonna have it bouncing around like this well my brain is like poison I came into the show with a coffee and LaCroix coffee cool get me a Flick or whatever the hell it's just there right looks just carbonated water oh it's essentially it's is really flavored carbonated Wow yeah and it is obsessed with it yeah because it's zero everything and I love it and I can drink as many as I want and people can't judge me He's the one that said hello and Kevin's leaning it is Mike what you got to say KeV you gotta really judge it with the LaCroix you I got a bunch of times until you found out that it was really zero everything you were like those aren't good\"",
            "start": 4009.56
        },
        {
            "text": "leaning it is Mike what you got to say Kevin you gotta really judge it with LaCroix you I got a bunch of times until you found out that it was really zero everything you were like those aren't good for you he was trying to help he's trying to help you I know he's doing it from a good reason I just want to interrupt and say you have been really generous I wanna appreciate that and I would need everyone to know and this is a big thing for me to say I'm coming forth right now making a you gotta look far it's the same spot you're with the best friends I know I have a looking for a problem but the liquor problems a good thing because it's hard for me to admit but it's hard for me to drink celery now hard for you to drink soda does that mean it burns it is too sweet and I drink drink a Sprite it is disappointing I'm sorry to let everyone down but it's been a while no you're not gonna stop drinking soda though no but it's like it's definitely slowing me down good and I'm just like I can",
            "start": 4054.32
        },
        {
            "text": "it is disappointing I'm sorry to let everyone down but it's been a while no you're not gonna stop drinking soda though no but it's like it's definitely slowing me down good and I'm just like I can convert I think it's good that happened that's actually very common because um you know I know people who go in detox diets and they just they stay away from sugar and then they have a bit of cereal or something anyway you know like you get so used to yeah and like salt free diets that like your body will just like freak out that's me like I do I do like I've been on a little bit of a ketogenic diet for the last few months and you do notice that where because you're not really having a lot of sugar and so I found myself after because the only thing I'll give myself for fruits that are not naturally like not a ton of sugar fruit so you want you I don't cherries I could do fruits I have a lot of fiber in them just like apples strawberries things like that but after if you don't if you deprive",
            "start": 4095.09
        },
        {
            "text": "like not a ton of sugar fruit so you want you I don't cherries I could do fruits I have a lot of fiber in them just like apples strawberries things like that but after if you don't if you deprive your private self of like processed sugar for a month and then eat an apple yeah best tasting really good thing you've ever it's so it's like it's super sugary and super tart and you start tasting that and so I started craving like the other day the first time in my life I'm like okay yeah I got a good Apple I had to leave my apartment and go find a Pink Lady Apple because I was craving it and that's never really like I normally do that happens I'm like I got a goldfish or like Oreo cookies or some like that but it's very weird and to the point where it got to the point now where I eat almonds for their sweetness really yeah like I'll have it I'll have like a roasted almond and I'll start eating it you know it'll taste salty but then I'll also taste the natural sugars that",
            "start": 4137.0
        },
        {
            "text": "their sweetness really yeah like I'll have it I'll have like a roasted almond and I'll start eating it you know it'll taste salty but then I'll also taste the sweetness like the natural sugars that are in the nut it's pretty fascinating so if you have like sugar Froot Loops would you be wired like a child I know that I'd be wired I think that I would definitely so I started I I've also been not drinking a lot of artificial sweeteners so I've been giving myself like a diet coke here and there but nothing too crazy and I noticed the difference now in how I feel yeah which is a very which is I normally a lot of people don't pay attention to like like ones the last time you're like I'm going to purposely consume this thing and then pay attention to how I feel and how it makes me feel and how like what's my energy level now do I feel cathartic do I feel like I could take a nap do I feel a little sick to my stomach is there that weird taste in my mouth from the coating of whatever this",
            "start": 4176.9
        },
        {
            "text": "how like what's my energy level now do I feel cathartic do I feel like I could take a nap do I feel a little sick to my stomach is there that weird taste in my mouth from the coating of whatever this thing was that wasn't a natural in process and so when I have Diet Coke I definitely feel my body just feels like I gave it something that it doesn't necessarily know what to do you know Greg said no I should say when I drink a diet coke I don't drink a normal sized Diet Coke I will go to the movie theater and get the refill okay halfway through the movie let's go out and refill it even though the guys are like no sir you can't do that I have like you're not after me and I fill it and then I run from the movie theaters they know their job isn't and the end is in sight for those jobs how is Hugh Jackman doing because you look great thank you look you're looking good because you can't just you're a friend of the family now so I feel like you should",
            "start": 4213.2
        },
        {
            "text": "is the Hugh Jackman off doing because you look great thank you look you're looking you're getting more definition off because you can't just you're a friend of the family now so I feel like you should you should know everything about us about a month and a half ago a friend of mine that works at a company called IGN which way woohoo IGN small media company that's a lot of people part of him it's not not really important anyway he works there and as part of one morning I think was a Monday morning I was like hey here's this being a motivational Monday mornings on Twitter I was like here's my inspiration for today right and I thought and I put out a picture of Chris Hemsworth with his shirt off from Thor and I was like if only I could look like this whatever my buddy tweets back at me he's like not on that bruh it's all about this and he tweets a picture of Hugh Jackman with the shirt off from the Wolverine movies I think was the one in Japan and I was like bro and we got into",
            "start": 4255.12
        },
        {
            "text": "on that bruh it's all about this and he tweets a picture of Hugh Jackman with the shirt off from the movies I think was the Wolverine the one with I was in Japan and I was like bro and we got into this big battle and somehow that escalated to him challenging me to a Jackman off which which means that whichever one of us looks more like Hugh Jackman from the Wolverine I like what I was like it's pretty like when I met you I was like this dude's in pretty decent shape and like when you said Jackman elf I'm like it's gotta be Hugh it's so by January I have to live here Dan **** I mean I'm growing out all out and I'm probably gonna do the thing or just shave this blood and come with just a little spiky see what happens January 5th now you'd win just from beer too low so whoever wins whoever wins has to buy the other steak dinner now Darren's gone dark on me but I have spies at IGN yeah Aaron has two kids right wait did I flip it I might have met this guy really when I saw when I signed",
            "start": 4299.37
        },
        {
            "text": "wins has to buy the other steak dinner now Darren's gone dark on me but I have spies at IGN yeah Aaron has two kids right wait did I flip it I might have met this guy really when I see when I signed in there was his dude he was like hi and I was like like are you the bouncer he was like an athlete that might have been the guy though so he is a Weasley little prick then he said Darren's already very fit he's not unfit a name Jim's imagination he's be bigger no dude have you seen him in his I wish we get he try to look for a prom picture of him or high school Google dear Brazil Brazil nude he looked just like me did he out of time but he doesn't like that now so the thing is I put I'm up against a little bit it's gonna be hard for me to do this because he I have to lose a lot of body fat I used to be really fat so I used to be like we hit in college I used be 265 and I'm like to put in context Leon 185 right now so that's a lot of weight that I've lost but I still have I think for",
            "start": 4343.02
        },
        {
            "text": "I used to be really fat so I used to be like we hit in college I used to be 265 and I'm like, to put it in context, Leon is 185 right now, so that's a lot of weight that I've lost. But I still have, I think for my size, I'm only five eight, so I should be around 160-165-ish. I got 20 more pounds to lose, but I'm also trying to pack on muscle, so there's that. There's that. Any luck? Story short, Overwatch wins gets a state dinner at a very fancy steak restaurant and I want that state dinner; it's gonna happen. What were the guys saying about this guy? It'll say he's gone dark and that he's actually working out and dieting but he's just not saying that he is sure he was beautiful saying no, that's not happening. He actually, he's not doing any of this; he's totally forgotten about it now. I say he can't possibly forget about it because every time I type, I take a picture of myself and put it on social media with hashtag Jack one off 2017 - don't forget 2017 for anyone out there following, I tagged him in.",
            "start": 4404.58
        },
        {
            "text": "forget about it because every time I type I take a picture of myself and post it on social media with hashtag Jack one off 2017, don't forget 2017 for anyone out there following - I tagged him in that picture as me or my bicep or were like \"you sure he'll be tagged in the picture?\" so there's gotta be... if you look on Instagram he's still around because Aaron Burr tweeted at me yesterday but also it's that we do have five months, you guys know how hard it is to go so he's probably smaller than I have - I have 20 pounds to lose what to do with five months, 75 months at sea but he doesn't have to lose any weight so he doesn't technically have to - he could just maintain for two months and then that's horrible, boy though what's that - he's just a little chicken boy but for him it's probably easy if he has the kind of build where he can put muscle on because he plays football I'm pretty sure he could no you know things got this Nick alright don't let",
            "start": 4442.98
        },
        {
            "text": "a little chicken boy but for him it's probably easy if he has the kind of bill where he can put muscle on cuz play football I'm pretty sure he could no you know things got this Nick alright don't let Nick falter I'm sorry don't let Tim put you into if I did so many squats yesterday yeah like when I went to take a **** today how to do that thing where as you go down to go to the toilet you got like the extra 30 degrees of space and then you small legs and I just went then I just think it fell into it yeah thank God and I almost bruised my tailbone but it's not that far that's fine it's good god damn it it's great it's great it's not great it's great no I work out with Youssef you guys know you so yes we do he's the best friend over at Ubisoft he is a monster of a human being sure a monster and John Pitts our work out with him as well but some pets like me like we can barely live anything Sean's offended now listen this means like hey I squat more than you but compared to you",
            "start": 4490.47
        },
        {
            "text": "and John Pitts our workout with him as well, but some pets like me, like we can barely live anything Sean's offended now. Listen, this means like hey, I squat more than you, but compared to you, so it's just it's not even fair that guy he squats like 100 hundreds of pounds, it's obscene. So do you have it all mapped out in terms of okay no no what I'm doing right now is I'm trying to add again functional strength, trying to increase my my my movement my motivation excuse me, functional strength, trying to crease my basically my each lift and then as we get closer to it I'll start getting a little more hardcore a little bit more methodical about Joshua like I'm not paying it too much attention to my macros in my diet I'm not paying too much attention like what how many calories I'm eating versus how it like and what we're getting fats proteins and carbohydrates from that yes but as we push forward probably into October I'll start getting a little hardcore sure about it and extracting it 100%",
            "start": 4531.92
        },
        {
            "text": "how it's like and what we're getting fats proteins and carbohydrates from that yes but as we push forward probably into October I'll start getting a little hardcore sure about it and extracting it 100% candy going they say that the best way to lose weight is a week before a competition October is a month we ask you this all important question Greg I know we're getting along in this topic how do you eat the kid there is no topic you missed yesterday's show Thank You hour is there something how do I eat the corner you go white in first then back in then then I go no I go tip yeah middle hold out Thank You cat oh **** you guys candy corn as you know I've never I've heard of it in Futurama yes okay fry I hate that guy Kevin bring up a photo Katie show Anthony no no no it's imagine just liquid green of hot liquid sugar that you've been colorized in the jaw now as an overweight child I liked anything that tasted moderately good sure candy corn is one of those things candy corn is one",
            "start": 4569.78
        },
        {
            "text": "green of hot liquid sugar that you've been colorized in the jaw now as an overweight child I liked anything that tasted moderately good sure Candy Corn is one of those things Candy Corn is one of those things that tastes just good enough for when you're fat and it's in front of you you'll just eat it right and of course delicious here comes Anthony Ingruber to say something stupid about this he's never had Candy Corn he's never seen Candy Corn Anthony come give me a count while you do this I'm tweeting a poll about Candy Corn come talking to my microphone tell him we think you're gonna get destroyed Greg Candy Corn rules no I didn't I just said he's gonna say something dumb but he turned me wrong he turns you wrong Anthony I fought for you to work at this company I begged you almost you really did bad guy and he was like no I'm good and now here we are you refused the macaroni and cheese and you hate Candy Corn every love Candy Corn really yeah Joey where do you come down on the",
            "start": 4623.26
        },
        {
            "text": "you really did bad guy and he was like no I'm good and now here we are you refused the macaroni and cheese and you hate candy corn every love candy corn really yeah Joey where do you come down on the all-important candy come on come over here saying to my microphone come on I say to my microphone Joey like handle poll is up candy corn question mark awesome bad those the options yes it's a good thing Kevin  this  wait you guys like the pumpkins and nothing ok that's our word sweeties or Smarties whatever people like Smarties all right it's not that uncommon Smarties Martis Smarties they're too big no no no he's there are there's there's Italy there are different your Florida Smarties here just like you know toys imagine smaller Tom's gone I saw you on the monitor there is put yourself there put me no wait oh I'm Kevin put yourself on the computer more like right here sure okay there he is oh it's too small thanks come Hillary Hillary ambiguous holy ambigú late I've got",
            "start": 4677.12
        },
        {
            "text": "there put me no wait oh I'm Kevin put yourself on the computer more like right here sure okay there he is oh it's too small thanks come Hillary Hillary ambiguous holy ambigú late I've got the world at my hand awesome I saw um Alien: Covenant Oh how'd you feel about that Michael Fassbender is fantastic he is Fassbender I love him and everything he's ever done no he's Fassbender but yeah yeah I like it what do you think got it I wouldn't care for that much you didn't like I didn't dislike it I just was like I'm when he when he wipes out a civilization I was like it's cool feels like they made a little bit like they made a movie to explain another movie for me through that and then they didn't do a good job explaining that for fun sorry I'm I needed to back up a little bit I did not watch Covenant you haven't watched Alien: Covenant he wasn't saying he plays the same role in Prometheus that he plays in Covenant was that like",
            "start": 4745.48
        },
        {
            "text": "you haven't watched come home fast bender isn't both is in Prometheus and Covenant and he played a Detroit was saying he plays the same role in Prometheus that he plays in Covenant was that like a surprise it was out in the trailers um I think yeah he plays he plays David comes back as like the survivor and then he plays because because the Android that he plays is a model a bit like um Johnny Five because Johnny Five he's off alive his long programming didn't want the laser any more he wanted the suction cup that came in of course when he was chasing Oscar it's all **** canonical talk about Johnny-Five legitimately trying to start a rumor that Johnny Five was the predecessor to Whelan's Bishop yeah how have we not **** talked about the Gutenberg showing up on Ballers like you **** kidding weird and wacky you roll for him right sorry sorry let's talk about Covenant I've completely lost I think it's just hitting on demands I don't want to like spoiler for too many people oh I",
            "start": 4804.34
        },
        {
            "text": "kidding weird and wacky you roll for him right sorry sorry let's talk about Halo: Covenant I've completely lost I think it's just hitting on demands I don't want to like spoil for too many people oh I haven't seen it if you haven't seen Halo: Covenant by now no era to see 343 Industries there's a lot of people out there that are probably like I'll watch Halo: Covenant on-demand what's an alien movie its Wow Wow I'll make an Alien movie why now I want them all I don't they're gonna get back to the ones we want where there's aliens again that's yeah I want them to make a Dino yes I want them to make another movie that is pretty much the exact same movie of Aliens I don't understand to this day why they haven't figured out why no one none of the people in Hollywood who produce movies who are way smarter than we are haven't figured out that the only thing you need to make a successful Alien movies is the Colonial Marines they were the coolest **** part of the entire franchise i and they never brought them",
            "start": 4868.38
        },
        {
            "text": "we are haven't figured out that the only thing you need to make a successful alien movie is colonial marines they were the coolest **** part of the entire franchise i and they never brought them back I like Alien way more than Aliens I think that that's because if your upbringing and probably yeah yeah that's probably true no Alien is a great film I'm joking I'm joking around but I think the thing there though is that we can't beat Alien I think we can do Aliens well Alien: Covenant at times did feel like a remake what we needed was the exact same movie yeah picks up when David was introduced and then he got to play those dual roles and like that's the greatest thing when you go out I simultaneously would pay any amount of money and I sometimes you would never want to see it it's so broken your chapstick is so low you're never but foolish so forth shut up I don't know that guy's name hello him everything that actor Michael Fassbender he's a great actor he was in Prometheus yeah that's one of the actors",
            "start": 4915.63
        },
        {
            "text": "so broken your chapstick is so low you're never but foolish so forth shut up I don't know that guy's name hello him everything that actor Yung Hee is a monk he was in The Revenant yeah that's one of the actors that he's a **** awesome actor what a great role to be remembered by Buffalo Bill huh phone number and here's my topic I want to talk about Cobra Kai no no this is we'll get to Cobra Kai this isn't a long-lasting topic don't worry again there's a time warp for you the listener who isn't watching live right now right what are you shaking your head it we're bringing it up now how we doing on topic again now no no no it's not really a topic I discussed earlier is the worst time to do that I was just thinking as I was pointing this new Nicaragua coffee green whiskey that I've never had when I see what that's all about hold on that's not hard I'm a cheap drunk good I was just thinking Nick and his diet how impressed with that I hope he doesn't have fun anymore he",
            "start": 4978.36
        },
        {
            "text": "that's all about hold on that's not hard I'm a cheap drunk good I was just thinking Nick and his diet how impressed with that I hope I don't mean he's doing all stuff he doesn't have fun anymore he doesn't need anything fun had a blast this weekend eating all your cooking you didn't eat that much every single dish what I want to know is your listeners he gave me it was phenomenal yeah I had leftover piece of wonder piece I was like no cooking with gravy coming September however I was thinking about how crazy you are and the thing you just did in the dancing and the Buffalo Bill stuff and I was like man and Nick's not even drinking it's a time work for you but this is our last GameOverGreggy show before Kevin Coello's bachelor party in Vegas in real time when you see the Meg Turney episode that'll be the episode after we've done this where I'm sure we will talk about all our adventures but are you gonna be drinking in Vegas are you okay are you throwing it all out the window",
            "start": 5045.31
        },
        {
            "text": "that'll be the episode after we've done this where I'm sure we will talk about all our adventures but are you gonna be drinking in Vegas are you okay are you throwing it all out the window are you eating carbs uh I probably I mean I think the thing is I lately I've been building in a cheat day into into the diet not hardcore but I've been preparing for this a little bit so I didn't Friday I'm gonna try to be good Saturday I think that's not the only thing I will not do is I will not smoke during the trip you what I do no one's gonna **** smoke your brother I've already told you what I want I want it because I can't believe masks are peanuts on this trip I can't believe how excited he sees how eleven days out he started sending gifts and excitement can't wait for Vegas boys might matter if three weeks for an important thing for you to know is this is the third in a trilogy of bachelor parties because there was Nick's bachelor party years ago I wasn't invited then there was our award",
            "start": 5093.13
        },
        {
            "text": "if three weeks is an important thing for you to know this is the third in a trilogy of bachelor parties because there was Nick's bachelor party years ago i wasn't invited then there was our friend rick's bachelor party right i wasn't invited still yes five years ago was it five years ago boy god damn it's kids five years ago this is from the producers of nick's carpediem cards bachelor party kevin hart's bachelor party my god it's gonna be it's gonna be like a hangover remember exact same thing many times okay hangover series exactly it'll be fascinating to see if all of the plans come together the way i want them to i don't think it's gonna be like i think we'll have great stories coming out of this um it's just a matter of like i'm always like a little harder myself like i don't we don't have anything crazy planned for saturday night and we'll make it i know i know but i don't know yeah have you guys no man **** like when it comes to a",
            "start": 5142.76
        },
        {
            "text": "\"Harder myself, like I don't, we don't have anything crazy planned for a Saturday night, and we'll make it. I know, I know, but I don't know. Yeah, have you guys no man... Like when it comes to production, I need to know every single aspect, but I can't allow for variants like that. I need to know what's going on, but I think we're gonna have a lot of fun. We've got a great roster of people coming. Please lay it out right now for everybody at home who's on this team. We've got Tim, yeah, you, yeah. Got myself, we've got Kevin Coello, yeah. Well, Greg, therefore X, where were you first excited? You're invited if you Y, if you're still in the country, my friend, I would be there. We've got your friend James Burke who was coming. Wow, you're a wrestling fan; you've seen him on the wrestling streams we do. There you go. We've got our good friend Erik Art who we've already talked about works over at Snapchat, used to work with him on IGN. We've got my brother Matt Scarpino - that is a party. He's the heavy-lift there. I'm gonna be\"",
            "start": 5203.06
        },
        {
            "text": "our good friend Erik Art who we've already talked about works over at Snapchat used to work with him on IGN we've got my brother Nick Scarpino that is a party he's the heavy-lift there I'm gonna be honest they on that one he's the guy that's gonna go a hundred percent all the time I want it Friday I guess Saturday morning 2:00 in the morning I want him and I cigars at the video blackjack and I won't live streaming on Twitch IRL my brother you think might you think Tim has a lot of drinks in front of him wait until you see my brother just patiently my brother I'm just gonna hit the loo no it's fine he's not coming some of my fondest memories of some my fondest memories my brother are I look over at him and he's got a Bloody Mary a beer two shots of whiskey like and like a water just for just just cuz so that everything else he gets 13 cases against thirsty just alcoholic drink Alfredo Diaz ever had was that your bachelor party courtesy of man that Scarpino of course who just had them on",
            "start": 5239.12
        },
        {
            "text": "just cuz so that everything else he gets 13 case against thirsty just alcoholic drink Alfredo Diaz ever had was that your bachelor party courtesy of man that Scarpia of course who just had them on hand yeah had shots on him and that is Matt likes the party he is a consummate professional during the day party animal during the night we've got also one friend Mirabella the third yeah is the one are you kidding me this information told me Phil this weekend believe that and round tattoo yeah let's get a tattoo of you like life-sized there's two more people there sure people we also have one shark Finnegan will be coming Joe he's excited to come I talked to him on Saturday night he couldn't he couldn't be happier I knew who am I missing was lost but we were missing Stephanie Broder oh right Stephanie's coming heavens besides me his best friend his current wall now at first I thought to myself I'm like it's a little weird that a woman is joining a band that was my own sexism coming out",
            "start": 5284.8
        },
        {
            "text": "Stephanie's coming heaven's beside me, his best friend, his current wife now. At first, I thought to myself, \"I'm like it's a little weird that a woman is joining a band that was my own sexism coming out because I didn't realize was aside from being one of Kevin's best friends that she's also going to be a huge asset at the pool and at the strip clubs that we go to. June right? She'll be we'll send her in first to smooth things over, and then boom! It's not using ringing in to be a ringer; bringing as everybody knows you go to a strip club, you bring as many females as you can, and it gets you answers. They're like, \"Oh, these people can't get crazy on this.\" This is the big problem with bachelor parties though, 'cause it's always all guys. I'm more excited to have a girl on board. Why is she a ringer for the pool? Pools aren't intimidating because we're gonna have a cabana at the pool and we want people to come party with us. Sure, we don't want more",
            "start": 5334.96
        },
        {
            "text": "to have a girl on board why is she a ringer for the pool Pools aren't intimidating because we're gonna have a cabana at the pool and we want people to come party with us sure we don't want more dudes to come party with us we don't want more dudes oh hey if they're cool dudes I'm down for cooler than that because it's not up space and yeah we're all cool sorry cool dudes here's the thing let's Anthony if Anthony **** shows up with this cool hair I'm like Anthony come let's deal with the pool though Nick the pool is a top tional pool Top tional my favorite word in the English language like it's not topless pool but if someone wants to if someone's from Europe like Miller will be someone's from you know that from Amsterdam and like I don't understand why Americans are so **** staunch II when it comes to like nudity or whatever they come over your wall when they get from the waist down just really freak people let me try that at Eric's bachelor party that is the one thing they don't like",
            "start": 5386.8
        },
        {
            "text": "\"comes to like nudity or whatever they come over your wall when they get from the waist down just really freak people let me try that at Eric's bachelor party that is the one thing they don't like you to do it there just put your penis away please let me show off the thing that's in a box or not it's up to you you're the host now oh yeah so now when you see this remember again this is literally the same bachelor party three times shut yeah okay will you try to perfect something let me ask you this question okay please light up Rafael Nadal, big tennis player right not long Roger Federer, Federer he is the tennis great at tennis right yeah did he get great at a game by playing it one time and then not playing that same game ever a great point play the same game over and over and if you want to get roasted so one of the things that I think is a cornerstone of a solid bachelor party is you got to make something to remember the bachelor party by and there's nothing that screams better hey\"",
            "start": 5421.18
        },
        {
            "text": "to get grilled so one of the things that I think is a cornerstone of a solid bachelor party is you got to make something to remember the bachelor party by and there's nothing that screams better hey remember me and you'll never live this down more than a tank top with a catchy phrase on it so we have made the official Kevin Coello likes to party shirt which we will all be sporting all weekend what is the underneath party what does it say in small Texas now what I appreciate that I'm finally on the internet Nick Scarpino one of these nice where I'll get one of these shirts because in when you made the Eric Hart likes to party one I believe that worked out so well because it was the point I what I liked about it was that people come up all some who's Eric Hart and people go that their card he's getting married so we're hoping to recreate some of that magic in Vegas right we've printed some extra shirts in case we meet some fun people if you see any of our friends just happen to be in",
            "start": 5468.34
        },
        {
            "text": "he's getting married so we're hoping to recreate some of that magic in Vegas right we've printed some extra shirts in case we meet some fun people if you see any of our friends just happen to be in Vegas like if Cisco ever gets here I'm assured it's gonna be fantastic so we've got that going on for us which is fun we'll see we'll see if we'll see what's going on if people like that can we announce the next thing about this shirt cuz we're Kinda Funny I think we absolutely can if you like you want the honors of that yeah in the most Kinda Funny move of all time are we gonna sell this shirt yeah it's gonna be a t-shirt available Monday August 14th of Monday we will be doing we're actually gonna do a big sale next week as well and so we'll be selling this shirt if you guys want it's a limited edition shirt how long is it up for as if you're watching on YouTube sorry if it's gone this is this is great this is awesome information for the people watching a lot that's a sad number two",
            "start": 5526.67
        },
        {
            "text": "limited edition shirt how long is it up for as if you're watching on YouTube sorry if it's gone this is this is great this is awesome information for the people watching a lot that's a sad number two you shot I don't if you're watching live screen cap that and put on the reddit if it's somewhere around I think the limited I'm not quite sure how many we have it looks like he's wearing it when I go out I love to wear these uh officially endorsed Kinda Funny shirts this we had to make ourselves now when we made ourselves just together as a prototype the new one I think the red is gonna be a little more vibrant on it cuz this one printed a little dark having said that the it's important to note these are tank tops we were not selling tank tops we will be selling no one's gonna wear that in real life and if you do want to wear in real life just buy the t-shirt and cut off the sleeves there you go that's Rob you look awesome so that's happening for this bachelor party so the bash",
            "start": 5570.08
        },
        {
            "text": "real life and if you do want to wear it in real life just buy the t-shirt and cut off the sleeves there you go that's Rob, you look awesome. So that's happening for this bachelor party. So the way the bash party's gonna run right now, everyone gets their [inaudible] we're gonna do a little impromptu lunch, then we're all gonna go out to the gun store and we're gonna get I hope the zombie package because there's a zombie apocalypse back to the market where it's all I mean I'm everyone's allowed to get whatever they want, I'm just saying I'm encouraging people to get the zombie pepper. What does that come with? It comes with everything you'd see in The Walking Dead. So the carbines, the handguns... okay, I think you do a shot Carles. There's a car launcher feature didn't what happens there was it's not a lot of clauncher, I don't think in the gun store no I don't smack into that and then after that we've got a dinner planned that night and then probably will be will be going to a fine adult establishment and the next",
            "start": 5626.75
        },
        {
            "text": "I don't think in the gun store no, I don't smack into that. And then after that we've got a dinner planned that night, and then probably will be will be going to a fine adult establishment. And the next day is the pull day, so we'll be at the pool all day. It'll be fun, bring sunscreen. Tim, don't worry, you don't get burnt; you didn't get too burned last time over there. No, I did fine last time. Yeah, he put on sunscreen, do man! I just don't know what to tell you guys. I put on the sunscreen, and it doesn't work. It's not up to me, I real a the I lather again, a RiRi lather. And here I am, white-tanner than that I've ever been. Okay, okay, already! Gosh, why am I so ratchet? Metallian? Okay, I got bad news from Twitter right now: candy corn is bad - 57% vs 43% awesome; 80/20 max. That it's whether or not you like it. What do you land on this **** thank you **** guys, and keep your... your just never. I don't hear anybody. Nobody's coming to talk on the mic. Eiq, I can do that too. Hey Mike, do you like it? Mike's, and he likes",
            "start": 5664.58
        },
        {
            "text": "land on this **** thank you **** is guys and keep your your just never I don't hear anybody nobody's coming to talk on the mic eiq I can do that too hey Mike do you like it Mike's and he likes it he likes candy for Mike Jim what do you feel about Kenny Jim loves it Jim loves gas all right all right good it is it is worth pointing out that on Twitter at bongos for Kevin says do another poll about those candy corn pumpkins those are **** dope now you're wrong about that wrong about that long joiner well has a word or two for you she has a lot of words for a lot of people Anthony yeah have you had fun I have is there anything else you want to talk about I think we've covered premature the candy corn and yeah that was that was top of your list on things you wanted to do on this rollercoaster of a pod concern that would be was scrolling name so I would make sure I did scrolling names and then I had the topics we were going to use I did possibly it was the start of topic 2 where I did",
            "start": 5722.6
        },
        {
            "text": "of a podcast concern that would be was scrolling names so I would make sure I did scrolling names and then I had the topics we were going to use I did possibly it was the start of topic two where I did them Kevin wrote it down that don't worry about it right yeah yeah we got are we not doing my last topic cuz I was so far well I mean we just didn't do any topic do you want me this no you're right this is definitely just another way I don't know we had so much fun doing it like this yesterday I love it I don't know a good one I love SuperConscious yes yeah I'm disappointed we did not talk about the Karate Kid remake I think y'all are **** ma you do it Cobra Kai what about where this goes not a remake right I know it's a ok so I we did on the morning show sort of the details of this Cobra Kai is a comedy TV series okay YouTube Brett sir coming out on YouTube right right okay that is it's a 30 minute or 22 minute whatever episodic team episodic TV show 10 episodes is what they're",
            "start": 5764.94
        },
        {
            "text": "Cobra Kai is a comedy TV series on YouTube, right. It's coming out on YouTube, okay? That is it's a 30-minute or 22-minute episodic TV show, 10 episodes is what they're saying, and it's with the original cast of The Karate Kid. Mm-hmm, that's what we know, that's all we know. No, no, I thought it was like Cobra Kai gets grounded, yeah, and Ralph Macchio's got a prop; they're mean to him again, yeah, Johnny from The Karate Kid, this story goes, Johnny - I played Johnny in the original The Karate Kid, and he's old now, so it takes place now, yeah, and he's older, and was like, \"I miss Mr. Miyagi. You think I don't know what to do? I don't have someone telling me what to do right?\" So but I guess the story is, Johnny, the bad guy is like, restarting the Cobra Kai dojo, and then of course Ralph Macchio - I guess they're still living in the same town; they've never left. What happens to people look at Kevin? So it's been 60 years these people have gone.",
            "start": 5810.78
        },
        {
            "text": "Cobra Kai dojo and then of course Ralph Macchio. I guess they're still living in the same town, they've never left. What happens to people? Look at Kevin so it's been 60 years these people have gone together. We live in the same town. I know I'm excited about this and I'll tell you why. This might be a huge step forward for YouTube and this might get me to pay attention to YouTube. Is this a huge step forward for you to read the premium service that got this man multiple jobs? You're telling me that Cobra Kai is what's the last series on YouTube Premium that you were excited for? There's been a whole bunch of them, video you were excited for that I was excited for yeah Matt Pat says The Lazer Team that you signed up for. Oh it's not The Lazer Team, while we say ugh there was a long food production show that I signed up for YouTube Red. Interesting okay but otherwise this might give me this might actually get me to sign up for you know what you usually get with bread is like a premium service free content",
            "start": 5862.77
        },
        {
            "text": "that I signed up for YouTube Red, interesting okay but otherwise this might give me this might actually get me to sign up for you know what you usually see is like a premium service free content just it sounds like RedTube or great marketing right? You read through those perverts also great man. Here's my problem six degrees of separation from Pornhub and to get back to YouTube very easily, ah Sakura, what am I talking about? What about her maybe not the right way to bring up this conversation she's making the rounds she's doing the whole thing she's like back in the public eye really is a Sora Aoi. I was thinking who's this I don't know she's a porn star she's like contemporary and yeah you know she's still relevant here's here's why I don't like Cobra Kai sure and I don't like this and I don't like what's happening here, it's because my problem with The Karate Kid was I just didn't like seeing him be bullied all the time right and so I really don't like the idea that 40 years later you're bullies are",
            "start": 5906.17
        },
        {
            "text": "happening here sure it's because my problem with Karate Kid was I just didn't like seeing him be bullied all the time right and so I really don't like the idea that 40 years later you're bullies are still they are torturing you in the same but you don't know that right this is a comedy the Nate I know that maybe they become friends maybe they go on misadventures just like things like this like Biff and Back to the Future thing that's exactly all Biff you raped my wife but now you're polishing my car thanks to Biff we met it's like yeah weren't you raping yeah sexual assault I intervened and yeah maybe one of these kind of strange that he's like yeah you know you look exactly like my best like my son looks exactly like my best friend so it was like Show each and every week four sometimes five best friends gather on this table each sometimes freaking a random topic of discussion for your homes day if you like that go over to Patreon common of funny toss us a few bucks and you can get each",
            "start": 5967.58
        },
        {
            "text": "best friends gather on this table each sometimes freaking a random topic of discussion for your homes day if you like that go over to patreon common of funny toss us a few bucks and you can get each and every episode early but if you got no bucks to toss no big deal head over to youtube.com slash kind of funny where we put up the show topic by topic day by day until it goes up is one big video and mp3 you can poke me all you want to stop me I know we're talking with us yesterday you should come to work sometimes we've been working non-stop it's starting to wear me out Anthony Ingruber thank you so much for coming by pleasure thank you for having you are fantastic in Age of Adaline you're even better as John Doe slash the Joker in Batman I've told you a million times everybody pick up at me but for real go do it now you got six episodes out there to play right now be great stuff Tim yes don't they did one season and then they don't an extra episode that's how the six episodes hotcha god",
            "start": 6031.23
        },
        {
            "text": "but for real go do it now you got six episodes out there to play right now be great stuff Tim yes don't they did one season and then they don't an extra episode that's how the six episodes Hotcha god didn't you didn't I was gonna compliment you I will on what I love you're great and you make all these games you leave come here we go letting us know if you like this style of gamification show we get a little drunk we just go for it we just are too happy topic yeah it's just stream of consciousness whatever the hell and if you know we enjoy doing it I hope you enjoy change of pace I have topics for Meg Turney oh yeah so I need topics for me you're on Anthony getting I know can roll the punches yeah yeah I like the stream of consciousness thing it's not so stoic yeah exactly yeah and if you know Kevin Coello's phone number post that in the comments below until next time it's been our pleasure to serve you thanks for watching The GameOverGreggy Show everybody click here",
            "start": 6073.29
        },
        {
            "text": "yeah and if you know Kevin Coello's phone number post that in the comments below until next time it's been our pleasure to serve you thanks for watching The GameOverGreggy Show everybody click here to go to Patreon of Kinda Funny Games and click here to see a video of a very very young Anthony Ingruber we don't have that video is just other content of ours Kinda Funny",
            "start": 6117.36
        }
    ]
}