{
    "id": 145,
    "video_id": "rk146zC5myU",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Drugs Should Be Legal - A Conversation with Colin",
    "description": "Smoking, drugs, and alcohol. Colin's down with you having your right to choose.\n\nToday's topics were submitted by @bmack182. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1382014803,
    "duration": 586,
    "transcript_chunks": [
        {
            "text": "Like you could be an adult with a child and a full-time job and a house and all this [ __ ] and can't drink alcohol. That's [ __ ] weird. What's up everybody? Welcome to a conversation with Colin. I'm Greg and this is my roommate Colin. Now sometimes shut up out there. Thank you. Sometimes Colin says crazy stuff. You're allowed. So every Tuesday and Thursday I reach into my random topic pile, pull one out, throw it at him, and we talk it out for your amusement. If you like that, like the video, subscribe to us on YouTube, share it with your friends. Colin, are you ready? Yes. Today's topic of conversation is smoking, drugs, and alcohol from bmack182. Smoking, drugs, and alcohol. It's common. There's commas in there. Smoking. So, this is about the Oxford comma, right? Exactly. Yeah. He has three different things here. Not just smoking drugs. Smoking, comma, drugs, alcohol, and alcohol. Okay, first off, I'll start. I wish I was dumber so that I could smoke cuz smoking looks cool. Period.",
            "start": 0.08
        },
        {
            "text": "different things here. Not just smoking drugs. Smoking, comma, drugs, alcohol, and alcohol. Okay, first off, I'll start. I wish I was dumber so that I could smoke cuz smoking looks cool. Period. End of statement. Look, you're start there. Anything you do, like first off, you do this, you immediately look at your French, you're just like, \"Yeah, you're an artist. You're thinking, imagine if we smoked here. We had a little ashtray. It'd be [ __ ] awesome. God, I love smoking, but it kills you.\" Yeah. Now, I choose to kill myself with alcohol and food. It's interesting, actually. Uh the the scientific consensus on smoking killing you. This is just an aside, by the way, is that they're not positive that it kills you. Now, no, no, listen to what I'm saying. I'm listening. I ain't going anywhere. during the global warming debate that's happening like the last couple weeks cuz that we're signing like new treaties and stuff like that. People were talking about global warming skepticism and",
            "start": 42.56
        },
        {
            "text": "during the global warming debate that's happening like the last couple weeks cuz that we're signing like new treaties and stuff like that. People were talking about global warming skepticism and saying that there's like a f scientist admit there's a 5% chance that global warming isn't caused by human like you know human activity and they were saying that that's equivalent to scientific uh scientific accuracy of them uh of smoking killing a person is also at 95%. Okay, which is interesting. And they're basically and they're basically saying that like yeah we're positive but we can never be super positive about anything. So I just thought that was an interesting aside. Obviously, smoking kills people, but they're not 100% positive. Okay. If I did electronic cigarettes, would that kill me, too? I don't know what the deal is with those. That's water vapor, isn't it? Nick says no. Vapor. Just vapor. I might start doing that. Yeah. There are chemicals in it, though. Well, but it will give",
            "start": 83.92
        },
        {
            "text": "too? I don't know what the deal is with those. That's water vapor, isn't it? Nick says no. Vapor. Just vapor. I might start doing that. Yeah. There are chemicals in it, though. Well, but it will give you mouth cancer. Uh, technically, maybe. But those don't look cool. They don't look cool. That's true, too. Sorry, Troy Baker. Uh, so what about smoking? You like smoking? Uh, so, uh, you got a cat hair in your hair. Hold on. I got it. You got Okay, good. Uh, so when I was younger in high school, I wanted to smoke cigarettes because like I agreed it looked cool and it looked fun and I could never really get into it, you know, like I I was like, I want to smoke cigarettes and I just couldn't do it. And then I and in college I started smoking cloves and those were pretty good, but they burn forever. They just never stop burning and then you're wasting like half of them and they're expensive. And so, you know, I like uh I like cigars and and I'm trying to get into cigars lately. How'd that",
            "start": 117.36
        },
        {
            "text": "They just never stop burning and then you're wasting like half of them and they're expensive. And so, you know, I like uh I like cigars and and I'm trying to get into cigars lately. How'd that go? You started it when I was away on some trip. It was a good cigar. Have you ever done it again? You want to do it every Saturday? I thought about I would like to I would like to, but yeah. No. Uh my girlfriend is bust my balls about it, first of all. [ __ ] [ __ ] [ __ ] She's just terrible. I've been telling you for a long time. Just cut the dead wig. Get out of here. And smoke your cigars all day. But no, I I I want to get more into them and uh and I'm trying to do that uh you know, in moderation. Everything in moderation. What about drugs? Where do we fall in the drugs perspective of spectrum? So, I I actually had a conversation uh with my girlfriend yesterday. Did you film it? Put it on YouTube. No. Okay, good. Thank you. I I have the exclusive here for conversations with Colin, please.",
            "start": 156.88
        },
        {
            "text": "So, I I actually had a conversation uh with my girlfriend yesterday. Did you film it? Put it on YouTube. No. Okay, good. Thank you. I I have the exclusive here for conversations with Colin, please. Uh so, drug use I feel like is the prerogative of the person doing the drugs. Sure. And I understand that uh there are social uh repercussions to doing drugs, including crime. You commit crimes when you're feing, when you need money for crack or heroin or whatever, and you do stupid things. But uh I still feel I still take a very libertarian slant with drugs which is that like the act of doing drugs shouldn't be illegal. The the maybe the sale of drugs should be illegal or the cultivation of drugs should be illegal depending on but like we should you know uh it's a victimless crime until the crime is committed to fund their So is it kind of a chicken and the egg thing? Like it's going to happen, right? Probably you're going to get on PCP and [ __ ] tear your skin off and punch somebody in",
            "start": 194.96
        },
        {
            "text": "is committed to fund their So is it kind of a chicken and the egg thing? Like it's going to happen, right? Probably you're going to get on PCP and [ __ ] tear your skin off and punch somebody in the head. Sure. Um I just it's like I know from experience it's just like a future crime kind of thing, right? like we don't know that the crime is committed until the crime is committed. I just I'm not comfortable with having millions of people in the United States in jail, most of which are nonviolent drug offenders. I just think that that is [ __ ] stupid. It's a waste of money and it's, you know, for the the land of the free, you know, we we have more people in prison per our population than anywhere in the world, including places that you think like China or North Korea would have more people. Oh, really? They just kill them in North Korea, right? Uh, back to the day. Well, they also have they also have prison camps and and concentration camps that we don't know anything about. But the",
            "start": 239.92
        },
        {
            "text": "Oh, really? They just kill them in North Korea, right? Uh, back to the day. Well, they also have they also have prison camps and and concentration camps that we don't know anything about. But the point is is that but Dennis Rodman went there, didn't he fix? Yeah. Yeah. And he's been starting a basketball league over there. So, everything's pretty cool uh over there. But I just feel like the the whole war on drugs has been a failure that um you know, the the obvious thing is to not legalize all drugs. Obviously, marijuana should be legal. Um you know uh even thing like anything that's natural. I think even mushrooms should be probably legal. But but uh everything should be decriminalized. You shouldn't criminalize the use of drugs. You should try to help people if you know because you shouldn't be doing certain you know things. I don't think there's any harm in smoking weed. I think that there's harm in doing heroin or doing coke obviously. But but is the person who's doing coke the",
            "start": 277.76
        },
        {
            "text": "be doing certain you know things. I don't think there's any harm in smoking weed. I think that there's harm in doing heroin or doing coke obviously. But but is the person who's doing coke the criminal or is the person who's selling the person coke the criminal? Uh back to chicken and the egg shouldn't have it. What do you think? Should we legalize marijuana, which we're kind of doing already? We're on the track there. And then should the government sell it and then get us out of debt? Yeah. Yeah. I mean, so the whole this is there's an interesting thing going on in Colorado right now because in Colorado and in Washington, marijuana is now legal and and they well and it's not just for medical purposes, like it's legal. So, uh, they have to figure out a way to sell it. And the whole thing that they're struggling with in Colorado right now is how much they're going to tax it because they want to tax it to such a degree that it will actually be cheaper on the black market. See, this is",
            "start": 314.96
        },
        {
            "text": "that they're struggling with in Colorado right now is how much they're going to tax it because they want to tax it to such a degree that it will actually be cheaper on the black market. See, this is the problem that they have to balance is you get it. You you destroy the black market by undercutting the black market and making something legal. But if you make something too expensive, the black market still exists and the prices drop in the black market. So people still have the illegal conduit to use something that is otherwise. But I think I think a big part of it would be the ease, right? If I could walk into a 7-Eleven and buy a thing of weed or whatever, even if it was more expensive than a dude around the corner, I don't know. I'm I'm just some fat white guy. I don't want to go to the dude around the corner of the alley, get stabbed. I just want to buy at a 7-Eleven. Uh some slim gyms. I don't know. I mean, we don't know how that's all going to play out. I mean, we in 2010, we",
            "start": 349.04
        },
        {
            "text": "the dude around the corner of the alley, get stabbed. I just want to buy at a 7-Eleven. Uh some slim gyms. I don't know. I mean, we don't know how that's all going to play out. I mean, we in 2010, we voted in in California for for uh you know, marijuana legalization. Actually got voted down, which was whichucks. No one expected that was going to happen. Um so yeah, I think that marijuana should be legal. Um for sure. And uh other drugs, like those are problems. People shouldn't be addicted or be doing these drugs. I just wonder what it says about our society that it is criminal to do those drugs as opposed to saying like maybe you need help. Maybe we need to wean you off of these things. Maybe it's just cheaper to put some of these people in programs than to put them in prison, you know. Yeah. I'm not saying the person who's, you know, making the meth shouldn't go to prison. Obviously, he should. I'm saying the person kills everybody. I'm saying the person who is doing the meth needs",
            "start": 379.76
        },
        {
            "text": "Yeah. I'm not saying the person who's, you know, making the meth shouldn't go to prison. Obviously, he should. I'm saying the person kills everybody. I'm saying the person who is doing the meth needs help. Needs help that he's not going to find in prison. Okay. Yeah. And then alcohol. Same thing. Everything in moderation. Who loves drink? Alcohol is fine. I think the age of alcohol consumption should probably be lowered. Actually, please silence your phones when watching studio audience. Uh yeah, I my whole thing is like if you're old enough to die in a war, you're old enough to drink. That was always my thing when I was 18 and I told everybody when I turned 21, I'm going to be very vocal about changing. And then I turned 21, I was like, \"Ah, [ __ ] you kids. It's your problem now.\" I don't know. I I think 18 should and probably will again be the legal age at some point. Yeah. When No, I don't think it ever will. We'll never go back. I think I think it's a compelling argument to say",
            "start": 420.08
        },
        {
            "text": "know. I I think 18 should and probably will again be the legal age at some point. Yeah. When No, I don't think it ever will. We'll never go back. I think I think it's a compelling argument to say that if you're paying taxes, if you have a job and you're an adult and like you could be an adult with a child and a full-time job and a house and all this [ __ ] and can't drink alcohol, that's [ __ ] weird. That's weird. That like that just doesn't jive at all. You know, the 21-year-old like thing is just arbitrary and that's that's not the way it is in in other countries. So, um you know there's a culture of drinking in places like I'm not saying you're drinking when you're 12 in France, but there's a culture of drinking in China or like when you're a young kid and even in Canada you can drink when you're young. So, uh, younger. So, you know, that the whole alcohol, you know, thing. Uh, whenever you prohibition is a great example. You should watch Ken Burns Prohibition. I watched another",
            "start": 458.64
        },
        {
            "text": "when you're young. So, uh, younger. So, you know, that the whole alcohol, you know, thing. Uh, whenever you prohibition is a great example. You should watch Ken Burns Prohibition. I watched another one called Boardwalk Empire. Yeah. Oh, that's that's a good television program. Uh, when whenever you try to [ __ ] with a vice like that, it just becomes worse. And it's the same thing with drugs. Like, if you just legalize marijuana, then the whole uh you know, when you're 15 or 16, you're like, \"This is so cool.\" Whatever. But then you realize like anyone can just walk into a store and buy it. Then it becomes less cool to do it. and and you do it, you know, for the right reasons, which is you want to relax or whatever it is you want to do, but not not to do it just because of peer pressure or because it's illegal. Um I think the same thing, you know, played out in prohibition where it totally backfired in every way, both in in the rise of criminal activity Thompson. Yeah. Well, what",
            "start": 493.6
        },
        {
            "text": "or because it's illegal. Um I think the same thing, you know, played out in prohibition where it totally backfired in every way, both in in the rise of criminal activity Thompson. Yeah. Well, what happened look what look at what happened with the war on drugs. Like the war on drugs pinched everything so badly that it just created a a bigger crime problem in terms of drugs because the stakes were higher, you know? I think we just approach it in a weird way. Okay. Yeah. Well, there you go. Thanks so much, BMAC182. That wraps up this conversation. But ladies and gentlemen, what do you think of drugs, alcohol, and smoking? Smoking, drugs, and alcohol. We already know smoking's cool, so don't worry about that. But what do you think the other things? Let us know in the comments. Then leave your suggestion for future conversations with Colin down there. Colin, thank you so much for your time. Ladies and gentlemen, subscribe, like, and share. And until next Tuesday or Thursday, have a",
            "start": 529.52
        },
        {
            "text": "your suggestion for future conversations with Colin down there. Colin, thank you so much for your time. Ladies and gentlemen, subscribe, like, and share. And until next Tuesday or Thursday, have a conversational day. And uh I was with I was friends with a lot of history majors who was a history major.",
            "start": 566.56
        }
    ]
}