{
    "id": 341,
    "video_id": "hr1NqB78N-o",
    "show_name": "Portillo",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Portillo the Wiener Dog Bites a Butt",
    "description": "Get 10 percent off your BarkBox Subscription: http://www.barkbox.com/gameovergreggy\n\nCatch up on The GameOverGreggy Show...\n\nFull Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1405148402,
    "duration": 323,
    "transcript_chunks": [
        {
            "text": "what's up everybody it's me Greg Miller alongside the star of the GameOverGreggy Show , Portillo, my 9-year-old wiener dog who I just love more than anything in the whole wide world and he's so cute in his new bow tie his mama got him. Of course, this is another BarkBox unboxing. What's BarkBox? It's boxes like this every month, they'll send you one. You subscribe for it over at barkbox. com/gameovergreggy that gets you 10% off. Uh, they send you a box full of treats and sometime toys and your dog will learn to flip out at it just like mine has. He already knows from just the sight of the box and the fact that he's on the GameOverGreggy table that something's about to happen and he's trying to be very good and he's doing a good job. Uh, this month they sent us the large box. You can see the difference between the small one Pell got last time and the large one he got this time, which should be for larger dogs, but I don't think he'll care too much. Get in there, Pill. What's in there? What's all in",
            "start": 0.08
        },
        {
            "text": "between the small one Pell got last time and the large one he got this time, which should be for larger dogs, but I don't think he'll care too much. Get in there, Pill. What's in there? What's all in there? Get it. Yeah, get it. Oh, tear it up. Good boy. Who's a good boy? Get in there. What'd you get? What did you get, Py? What did you get? Get in. I'll take the piece of paper cuz you don't care about this is just paper. You don't care about this. Oh , bone. Oh my God, it's a huge toy for Portillo and there's so much food in here. Okay, so in this MCH Mark's box, it's a big world out there. Our pups deserve to see it, smell it, taste it, roll around in it. Uh, it looks like it's themed after a little Parisian stuff here. It's got a little guy here riding his bike. He's a little Parisian doggy there. Pell's already into the toy. He loves the stuffed toys and that definitely looks like what they gave him right away. What do we got here? This is a silly bum. This is a silly bum toy. It looks like it. Oh, it's okay, so it's a monkey.",
            "start": 38.04
        },
        {
            "text": "he loves the stuffed toys and that definitely looks like what they gave him right away. What do we got here? This is a silly bum . This is a silly bum toy. It looks like it. Oh, it's okay, so it's a monkey. Hold on, Py. Py, everyone knows how tough you hold on. Back off 2 seconds, 2 seconds, P. Py, all right, hold on. All right, so you see it's a monkey with no head cuz it's just a silly bum cuz it's got the little ass on it. Like, yeah, we get that ass. Get that ass, Py. Tear that ass a new one. Get in there. Eat that silly bum. Let's see what we got next here. Oh my goodness, here's Healthy Dog Dogma Blissful Banana chips. This is his happiest time of the month. All right. Okay, okay, okay, okay, okay, okay, okay, okay, okay. Get one of them chips. Get one of them chips. Get it. It's food here. Eat it. Eat that ship there. You go. Good boy. Good boy. All right. Well, here, eat it in front of people. Don't put it down there. Good boy. Good boy. Push, good boy. He's breaking them off piece by piece . He's into it now. He likes these banana chips.",
            "start": 78.52
        },
        {
            "text": "boy good boy. All right, well here, eat it in front of people. Don't put it down there. Good boy, good boy. Push, good boy. He's breaking them off piece by piece. He's into it now . He likes these banana chips just fine. These are another proven BarkBox winner. Healthy Dogma, put them over. No, back off. He's still getting treats. What we got next? This is a Benebone. It's a it's a dog's chew good real bacon. It's got P now. Portillo usually, well, he it's going right for the treats and the toys. He usually likes the soft stuff more than he likes the hard stuff, so let's see if he gets into this at all. He's licking it. He's trying to process what kind of sorcery this is. He definitely likes the smell of it. What do you think of this? Got party? Oh, well, I hit you right in the head with it. No, no, you want back to the self treats. All right, well, not everyone's going to be all right. You got enough bananas. All right, I guess that's enough monkey and around for him cuz the monkey, the bananas, all right, um, he'll come around.",
            "start": 132.72
        },
        {
            "text": "treats all right well not everyone's going to be all right you got enough bananas all right I guess that's enough monkey and around for him cuz the monkey the bananas all right um he'll come around with the bone maybe not and finally our final one here Hair of the Dog I didn't get that when I read it before hair like rabbit it's it's it's a rabbit Contraption here um let's see what they got here for the thing here it's 100% Ram rabbit R 100% rabbit with some kind of Berry that I'm not going to try to pronounce Portillo for real man the bananas will be there when you're done stop taking all the bananas take one of them oh yeah you got that one didn't you oh you're a tough one get in there eat that oh they smell they got a smell to them for sure who's your good boy who's a good boy well now don't don't choke yourself you're go break it off be tough ladies and gentlemen that's another BarkBox unboxing remember you can sign up for BarkBox at barkbox.com gameover Greg you get 10% off your",
            "start": 180.88
        },
        {
            "text": "don't don't choke yourself you're go break it off be tough ladies and gentlemen that's another BarkBox unboxing remember you can sign up for BarkBox at barkbox.com/gameovergreggy you get 10% off your subscription and then you get Portillo sit good boy stay you get a you get a flurry of treats like these deliver to you every month for as long as you sign up for uh once again I'm really happy with these results like I said Portillo tears apart all of his toys we just did the GameOverGreggy Show he tore apart one of his toys here I'm happy to have another one for him and then God knows this dog loves these freaking treats probably loves him more than he loves me but that's my curse having a cute dog that doesn't really love me but just depends on me for food food and water until next time BarkBox I don't have a sign off do you have anything Pill bark bark bark bark bark good boy get a get a banana no those those aren't the bananas that the box is empty there you go take another banana",
            "start": 228.56
        },
        {
            "text": "Box I don't have a sign off do you have anything Pill bark bark bark bark bark good boy get a get a banana no those those aren't the bananas that the box is empty there you go take another banana [Applause] well see yeah you ate too fast now now you're getting them all stuck in open in your mouth aren't you get you some water here in a second it's okay it's okay my baby eat this guy no you're done eating these guys now party what what hell have I wrot",
            "start": 269.72
        }
    ]
}