{
  "id": 338,
  "video_id": "JE_AC94Of5U",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Wrestling Sucks, but Jeff Gerstmann Can't Quit It - The GameOverGreggy Show Ep. 31 (Pt. 1)",
  "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nCatch Jeff Gerstmann on the Internet!\nhttp://www.giantbomb.com\nhttp://www.twitter.com/jeffgerstmann\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1404716401,
  "duration": 2701,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to the GameOverGreggy Show. I am one of your hosts, Greg Miller, alongside the producer, Seducer Nick Sc arpino. Hello. Hey, how are you? I'm doing well, thanks. Good. Be GRE. You survived VidCon. I did survive VidCon and by the time post hopefully RTX. Oh, RTX is going to be so good. I can feel so good. Austin, we're going to eat a lot of food. We're going to eat a ton of food. All barbecue, all lean protein. I'm hoping. No, I'm going to get I'm going to go that Gordo over here. The pride along Island, Colin Mor Yardi. Go Islanders. Go Islanders indeed. And our special guest from Giant Bomb, Jeff Gerstmann. How you doing? There we go. I said I wouldn't come if you guys didn't clap. We almost blew it. We almost blew it right off. Okay, all right, now all right, good. Um, thank you for coming. Yeah, no, I'm glad to be here. Tim Gettys had the audacity to have a birthday and go to Austin to celebrate with his girlfriend and wait for RTX to start. Gross jerk. Is RTX amazing? I've never been. Is we never",
      "start": 1.1
    },
    {
      "text": "I'm glad to be here. Tim Gettys had the audacity to have a birthday and go to Austin to celebrate with his girlfriend and wait for RTX to start. Gross jerk. Is RTX amazing? I've never been. Is we never have either suppos RTX. No, it doesn't. Well, the does. Of course, everybody if you it was fantastic, you guys had a great time. So good. Bernie's awesome. The reason there's it we don't know if it's up after RTX is the fact that the GameOverGreggy Show posts every Friday as an MP3 on gameovergreggy.bandcamp.com for $1. If you don't think we're worth that dollar, you can pick us up on YouTube Monday through Friday. Every topic's broken out one by one. youtube.com/gameovergreggy. We post them for free over there. So that's why we don't know currently if you're listening to the MP3 on Friday, RTX is happening. You probably just missed the the GameOverGreggy Show panel we're doing there with Barbara Dunk elman. Going to be so good with Barbara. They're live streaming it then we'll put up the video of course here if",
      "start": 47.24
    },
    {
      "text": "you probably just missed the the GameOverGreggy Show panel we're doing there with Barbara Dunkelman. Going to be so good with Barbara. They're live streaming it then we'll put up the video of course here if everything goes according to plan. You never know what that technical stuff. Yeah, that's very fancy. Yeah, it's pain in the butt. Especially especially with me running it. I just twist KN doing video on the road. It's just like any moment like it might all just catch on fire. Like I don't know these cameras all got stolen. Who knows? It's funny like I hate the differences when you go place to place. Like I've been to packs where they're like don't touch the board. You are we are union workers. And then at Pax East this year they were like oh yeah go ahead Jack on the board. We don't care. I like damn all right jerks. No idea what's happened over there. Colin **** **** Jack unions right? You're a big Union fan. I'm hug don't jack the board. I'm not going to jack. I might never mind they got jack off on the",
      "start": 87.84
    },
    {
      "text": "jerks. No idea what's happened over there. Colin **** **** Jack unions right? You're a big Union fan. I'm hug don't jack the board. I'm not going to jack. I might never mind they got jack off on the board. But is that appropriate? I said it so it's like how St no let's let's roll this back and this out guys. What's up everybody? I'm here to kind of train you guys for Pure internet celebr look just roll it back the jack off thing not cool yeah a little creepy little it's about time a real producer came in here exactly thank you can you please take over uh every single time we say something inappropriate Greg makes me bleep it no see I make him bleep when he he mentions people's names he shouldn't mention okay such as whose dick he'd want to trade and he throws out a person that there's no reason he should say that person's name on the air that's why we have to believe Nick Scarpino classic Scarpino classic classic that's what everyone says classic Sc arpino another classic Scarpino moment",
      "start": 118.88
    },
    {
      "text": "he should say that person's name on the air that's why we have to believe Nick Scarpino classic Scarpino classic classic that's what everyone says classic Scarpino another classic Scarpino moment staring at that milkshake now I want one of those milkshakes yeah there's a GameOverGreggy Show video going up about the perfect Portillo's order if you're listening to MP3 on Friday it'll be live on Saturday and if you're listening after Saturday it's live on Saturday it's going to make you hungry I just put you out there I'm dying to go back to Portillo's it's the best seeing just this like 20 seconds of video that I saw over here right now like ignited it in me all over again I've only been there like four times cuz you know it's like I'm from here so it's always like I can but you're down in LA enough you got to get to that bu I am yeah the last time I went uh I ended up really screwing myself over because I was driving back to San Francisco from LA and then in the time it took me to",
      "start": 162.96
    },
    {
      "text": "in LA enough you got to get to that bu I am yeah the last time I went uh I ended up really screwing myself over because I was driving back to San Francisco from LA and then in the time it took me to drive back down there and back to LA where I was to begin with uh I5 had caught on fire so it took me it took me a day and a half to get home you should have pacce second P's lunch so I did and so I was in a Motel 6 like late that night just with the one Portilla just San going there's a microwave in this room this is perfect and just like eating it and just like watching baseball on like a 4x3 TV going like sandwich loves me uh and God I want to go back you got to we every year after E3 I take a pilgrimage down there you should come yeah yeah big time man big time um Colin yes Jeff of course is a guest here today yes but we have another guest with us yes what explain to me this fancy bottle of bourbon uh so we have here oh dear the pop filter uh Henry McKenna 10 year bourbon now people",
      "start": 198.6
    },
    {
      "text": "is a guest here today yes but we have another guest with us yes what explain to me this fancy bottle of bourbon uh so we have here oh dear the pop filter uh Henry McKenna 10 year bourbon now people remember maybe it was 15 20 episodes ago we had David Ballard on from Naughty Dog our friend at Naughty Dog um and uh our friend Eric Cro another friend we have more than one friend we have so many friends show and uh uh Eric As ro choose one guys come on it's really hard good friends uh so uh Eric Cro owns Polite Provisions which is a a fantastic cocktail bar in San Diego and and everyone that watches this show know that Greg and I love our old fashions so uh he's a good friend of ours and so he sent us five bottles if if people remember correctly little vials they little Castlevania vials and uh we sampled all five bourbons which were all private barrels and we picked the barrel that he would use for his um for his house bourbon right um and he sent us nine bottles of the bourbon that's",
      "start": 242.2
    },
    {
      "text": "uh we sampled all five bourbons which were all private barrels and we picked the barrel that he would use for his um for his house bourbon right um and he sent us nine bottles of the bourbon that's thing so first of all Eric Asro is the man we really appreciate that so what it says we so we picked out y yeah please we picked out Barrel number 1225 from the year 2003 M this was barreled on 10603 October 6 2003 when I was at Northeastern University still so different place very different very different place uh and uh we're g we had a little bit last night I was on the comedy button last night with Alano and Scott Bramley and those guys I came home we had a little bit of this we were playing Valiant Hearts good um so we're going to sample it now again and pretend we never oh okay and it just smells I mean this is so usually we drink Knob Creek we drink Woodford pretty Eagle Rare good stuff but this is better than all of that right cuz we made it exactly we made if it wasn't for us",
      "start": 286.44
    },
    {
      "text": "just smells I mean this is so usually we drink Knob Creek we drink Woodford pretty Eagle Rare good stuff but this is better than all of that right cuz we made it exactly we made if it wasn't for us McKenna this wouldn't even be in Polite Provisions another one come on get so we'll get those poured every we go to San Diego of course I'll be at Comic-Con I'll be hosting go to San Diego I'll be hosting a meet and greet at poite Provisions San Diego Comic Con sounds Lov probably nothing yeah probably nothing will be free so bring money no but cash yeah lots of cash and come with that with that love of good cocktails of handcrafted cocktails oh takes a few minutes to make them you know you got but it's so you know but when I went there with Cheryl when we were in San Diego they had that's his girlfriend it's my girlfriend girlfriend uh we uh they had a guy in there that was chipping the ice manually which was like so cool that seems I'm sorry now I got to draw the line that like that seems",
      "start": 329.16
    },
    {
      "text": "it's my girlfriend girlfriend uh we uh they had a guy in there that was chipping the ice manually which was like so cool that seems I'm sorry now I got to draw the line that like that seems like it's going to you can't just make the ice thanks for coming thank you what were you saying make your **** point you can't just put ice in a glass you got to chip it away at it with your cool vests and your bow tie and your suspender it's a show you more than most people I think would be a man who understands fine ice I do enjoy my ice you need you need the finance when you're paying 10 12 $14 for a cocktail they put all the love and and respect into that cocktail if I could pay $8 for that cocktail and just get ice cubes You'be right that'd be all right with that okay now here's the thing I was thinking about I've been you guys haven't been in the bar yet so you can you can tell me when you go they it's like an old school kind of early 20th century inspired vibe there like a soda fountain",
      "start": 374.12
    },
    {
      "text": "thinking about I've been you guys haven't been in the bar yet so you can you can tell me when you go they it's like an old school kind of early 20th century inspired vibe there like a soda fountain kind of almost uh and they have some old paintings it's all the portraits now I wonder move with kind of like the tickly monster back in the day the tickly moner I was I was wondering would we would would Eric Adorn poite Provisions with this portrait we okay well it can't be that one we got a C I'm married to this one but I'm sure would do another one of these for us if we wanted to if it was going to be hung someplace as magical that's amazing you got to let us know if you'll hang out bare minimum if you're going to do a meet up down there I mean bring one with get destroyed yeah absolutely what's crazy is I never really realized that at this angle Colin is looking right at me so as you're looking at me you're also looking at my favorite part is like last week I was like hey Nick this is",
      "start": 418.16
    },
    {
      "text": "crazy is I never really realized that at this angle Colin is looking right at me so as you're looking at me you're also looking at my favorite part is like last week I was like hey Nick this is really crooked and you said it looks good on camera and then I watched the show and it did oh no yeah if you look at it right now it looks like it's what like it's way crooked yeah but it looks on that yeah but that's weird I know man angles angles the camera adds 10 lb and 2 in that way which way was that that way yeah sounds about normal ladies and gentlemen the GameOverGreggy Show is simple every week four sometimes five best friends gather on this table he's bringing a random topic of discussion for your amusement you hopefully like it share it you buy the podcast we already went through a lot part of it don't worry about it yeah Jeff hi you're the guest hello first off everybody should know you right you're you're like Mr video games journalism I guess so yeah something like that sure in",
      "start": 458.48
    },
    {
      "text": "part of it don't worry about it yeah Jeff hi you're the guest hello first off everybody should know you right you're you're like Mr video games journalism I guess so yeah something like that sure in a nutshell who are you if they don't know you let's see I mean I uh I've been covering video games for about like 20 years now which is kind of a long time and uh currently doing it at giantbomb.com and uh follow me on Twitter or go to Jeff gersman Donnet where I'm answering all kinds of questions doing all kinds of dumb **** oh great yeah what dumb **** did you bring today as your topic well look guys I I'm at this conundrum like the quality of my life is is is questionable at this point because I watch wrestling and I hate wrestling and I can't stop watching wrestling so why do you watch it why do you keep watching wrestling cuz you can't stop cuz I can't stop watching wrestling you don't know how an addiction works oh I know how addiction work and let me tell you right now if me",
      "start": 501.28
    },
    {
      "text": "it why do you keep watching wrestling cuz you can't stop cuz I can't stop watching wrestling you don't know how an addiction works oh I know how addiction work and let me tell you right now if me first tell you I start watching Total Divas can't stop watching that show see I can't I can't get that deep into it I that's look man you have a different strain of crazy can't handle you are too far gone you need some you need you need help man I I actually this is how bad it is my wife comes and she's like that show why are you watching that show I was like it's Kinda Funny she starts watching the show I come back a week later from a trip she's got she's seen all of them she now wants to go back on Xbox Live and buy the first season of the show oh boy so we do it and I watch it and now I'm like now I have to watch the second season of the show that you already watched it's a great show well Deb super good so my problem it goes Total Divas Breaking Bad Jesus God Game of Thrones and then",
      "start": 545.2
    },
    {
      "text": "like now I have to watch the second season of the show that you already watched it's a great show well Deb super good so my problem it goes Total Divas Breaking Bad Jesus God Game of Thrones and then whatever I don't care my two My Two D ads so tell us tell us the issue at hand so I I think you know my larger issu is I feel like that's something that you you know like wrestling was good for a little bit and it's it's you know the writing has gotten worse lately and it is what it is but I think the the larger issue there is I feel like you know there are a lot of things that appeal to I it's I I hesitate to even call it like a geek demographic because I think it's a really reductive way to talk about it but you know like the the people that are passionate about things on the internet in an extreme way comic books uh science fiction movies video games uh wrestling like all all these things kind of fit together you know horror movies whatever it ends up being people it's fine that people",
      "start": 586.12
    },
    {
      "text": "extreme way comic books uh science fiction movies video games uh wrestling like all all these things kind of fit together you know horror movies whatever it ends up being people it's fine that people are passionate about it but people are just are tearing things apart and it feels like that just every conversation online that I'm in nowadays it's just extreme one way or the other it's all it's either this is the best thing in the world or this is **** trash garbage it's a user critic I'm Metacritic basically either zero or it's either yeah it's either like Ubisoft lied to us or it's the greatest thing ever made um and it's it's I just don't know if there's a way to change it I mean obviously you know my problem is with wrestling you know it's it's it has its ups and downs I hate it but sometimes it's really great now have you been following catch me up here cuz you know you guys all go way back but we haven't really interacted that much he came which sad I know but he came in like a",
      "start": 625.68
    },
    {
      "text": "it's really great now have you been following catch me up here cuz you know you guys all go way back but we haven't really interacted that much he came which sad I know but he came in like a superstar and then left like 5 seconds later like I don't want to take any pictures who the hell beard guy whatever taking pictures I'm not going to do anything have you been watching wrestling since you were a kid uh so I watched it a lot as a kid kind of the Hulk Hogan era right you know era the era and then I say Attitude Era was the whatever I out of it I I fell out of it and kind of they know what I'm talking about yeah uh I fell out of it kind of came back when uh the NWO got big uh and and so because it became like the the story line got a little edgier a little more reality based to where you were like it blurred the lines obviously you knew it was still being written it was still a show uh but the the story lines had become more more than just like I'm going to beat the bad guy right and",
      "start": 670.68
    },
    {
      "text": "were like it blurred the lines obviously you knew it was still being written it was still a show uh but the the story lines had become more more than just like I'm going to beat the bad guy right and then you beat the bad guy and now you have chance but who is the bad guy The Undertaker or you know anyone Undertaker was literally crucifying people exactly like that's didn't the rock start as a bad guy yeah okay he's gone back a few yeah everyone kind of goes back and forth it's just you know at some point they're like well this is boring and the people aren't responding to it the way they used to so we need to swing them over to the other side and surprise everybody and then we can ride that out for six weeks Goa except for John Cena I guess well he you know maybe started out a little bit of a bad guy but he's just become just Superman he is he is the new Hulk Hogan he never loses you were saying earlier that he won something he won he won back the championship recently money in the",
      "start": 711.36
    },
    {
      "text": "of a bad guy but he's just become just Superman he is he is the new Hulk Hogan he never loses you were saying earlier that he won something he won he won back the championship recently money in the bank they they gave him the title the pay-per-view and uh you know so now he has the belts again for like 15 times or whatever it is and uh is he still wearing the Jorts oh yeah it's cargo shorts sometimes he mixes in the Jor they're still there and it's that I'm torn on that too because I've got a closet full of jean shorts guys and like I'm just one of these days they're going to come back come back out they're going to come back did you how did you find out you were out of style with shorts uh it was I wore them I was kind of like hanging on to them for a while going like no **** you guys I'm right you're wrong yeah it was for me it was I was out I wore them all through college all through college were these Jor I want to see the pictures of you and George remember you remember this is",
      "start": 750.2
    },
    {
      "text": "right you're wrong yeah it was for me it was I was out I wore them all through college all through college were these Jor I want to see the pictures of you and George remember you remember this is I I always tell this yeah this is the story of how I walked into my freshman year mind you I'd gone to private Catholic School my entire life so they finally let me off the leash to dress myself so this is I walked into my college dorm freshman year first day with from the feet to the head right uh red Converse high tops okay tube socks up to the mid uh calf there then jean shorts then a WCW t-shirt Hawaiian shirt over it oh yeah because there was a Simpsons episode remember with the gay guy and and Homer said only two kinds of guys wear Hawaiian shirts big fat py animals or gay guys and I was like I want to be a big fat party animal absolutely so I every I'm not even making this up every day freshman I wore a Hawaiian shirt I have three I own three Hawaiian shirts so then you go up the rest",
      "start": 791.08
    },
    {
      "text": "I want to be a big fat party animal absolutely so I every I'm not even making this up every day freshman I wore a Hawaiian shirt I have three I own three Hawaiian shirts so then you go up the rest of the way I bought I'd finally been able to get the nerd glass I always wanted and then I had blue hair completely died royal blue hair perfect and so I was ready to party for sure yeah but so over the years I grew out of a lot of that you know sophomore year I didn't wear the Hawaiian shirts as much I mixed in other wrestling shirts and video games and whatnot and then I was out to dinner and I already graduated college or I was about to graduate I'm sorry it was my senior year and I was out there blah and it was my girlfriend at the time that friends or whatever yeah yeah and they're like well yeah you know you know jean shorts are out of style but Miller kind of makes them work and I was like excuse me and I was and they're like no jean shorts aren't in I'm like really what happened and",
      "start": 832.24
    },
    {
      "text": "yeah you know you know jean shorts are out of style but Miller kind of makes them work and I was like excuse me and I was and they're like no jean shorts aren't in I'm like really what happened and they like who's the only other person you know who who who else wears jean shorts and I had one friend they're like is he cool and I was like no no wait a minute what **** and I like the next day went ripped them off and just with your balls out you know I just didn't know any better the phase I went through is that I I got to a point where I didn't own any long pants at all M and it's you know living in in this part you know San Francisco it's mild we work inside yeah uh clear so yeah I know right um can't tell about the tan yeah uh so basically I didn't need to wear pants so I didn't man uh so I ended up with you know a lot of pairs of jean shorts and you know some non jean shorts but mostly jean shorts and this you know this kind of carried on actually until like way past its PR you",
      "start": 869.72
    },
    {
      "text": "uh so I ended up with you know a lot of pairs of jean shorts and you know some non jean shorts but mostly jean shorts and this you know this kind of carried on actually until like way past its PR you know it was kind of like 200 2007 so it's pretty recent uh 2008 maybe uh yeah somewhere in there she like 20 yesterday last month I decided so I had kind of a full-on snap where I'm like this is **** ridiculous like what am I doing I dress myself I can do better than this yeah uh so I kind of started shopping I like you know what I'm just going to like so I went out and I just said like I'm going to spend a lot of money on one pair of jeans and see how it goes uh and I went and I bought like you know Japanese all Denim and like all the you know fancy you know weird pants that you're not supposed to wash and all that **** uh and bought them and liked them I was like okay no wait I can I I can wear some pants I and now I I'm proud to say you wear pants I own three pairs of jeans nice W",
      "start": 911.68
    },
    {
      "text": "to wash and all that **** uh and bought them and liked them I was like okay no wait I can I I can wear some pants I and now I I'm proud to say you wear pants I own three pairs of jeans nice W congratulations see this is I i'had been wearing the relaxed fit jeans forever and there's this girl at work who says that's not a good look on me and my her name's Alexa she's been on the show her exact words I know exactly we had her guest her exact words were you look like you're holding a load in your pants yeah they I got a saggy ass old man you got the Crystal Skull yeah Nick wanted to film some fancy conversations at IGN so he took me out with a budget and bought me nice pants and I was like and now they're like all skinny and they're nice and tight on my ass sometimes too tight on my dick I get told but I like that look well because you hike them up so high again the point is like my grandma used to wear sweatpants when because I don't want a saggy butt anymore and like you have to",
      "start": 962.96
    },
    {
      "text": "I get told but I like that look well because you hike them up so high again the point is like my grandma used to wear sweatpants when because I don't want a saggy butt anymore and like you have to understand you're I'm still wearing them the where the pants are supposed to be wor otherwise when I down you get that ass crack you I'm fighting against the plumbers crack I'm trying to get that ass crack out there I'm putting on shows you know I follow your ass qu crack on Twitter oh yeah it's it's got quite the follow his ass quack I just said that yeah so you know sometimes I have to wear a belt cuz you know it's like I I went through a phase where I actually dropped a little bit of weight and then these pants started falling off my ass well thank you quit but you know everyone's quitting everyone's quitting no one's quitting team fat buy team ft districtlines.com man it's you know what you you rocking XL or double XL uh I'm between right now that's a tough place to it's a tough place",
      "start": 1003.08
    },
    {
      "text": "quitting no one's quitting team fat buy team ft districtlines.com man it's you know what you you rocking XL or double XL uh I'm between right now that's a tough place to it's a tough place to be uh people ask you like what size shirt you wear I got one here for you like I I don't know how to answer this I don't know I'm just going to say XL cuz I feel bad if I say double XL but that's usually the safe answer and well my answer is always because I'm in between a medium and a large because just because of my my pregnant cut cuz you're baby and my question is always is the shirt pre-shrunk oh that's how I always preface it and usually the answer is I have no idea and I'm like well can't take that you can't take that risk no dude CU I have I have some Shir I have some shirts like the doctor Wy shirt that Greg bought me in Japan yeah uh was a large that shrunk down perfectly to a medium now I bought a resistance shirt that was a medium not pre-shrunk that looks like a **** belly shirt",
      "start": 1041.96
    },
    {
      "text": "Wy shirt that Greg bought me in Japan yeah uh was a large that shrunk down perfectly to a medium now I bought a resistance shirt that was a medium not pre-shrunk that looks like a **** belly shirt you know so you have to be like very careful even my reso gun shirt yeah very careful with that kind of stuff that's the wor you w your hand to right here I can see your entire navl yeah it's ridic it's before we move on to the rest of the wrestling story I just want to say as an aside this is the rest of the wrestling story so don't worry about it okay yeah uh I just want to say as an aside before I forget before we get any further away the fact Greg's my best friend I've known Greg for a long time the fact that Greg wore Hawaiian shirts every day when he was a freshman in M makes you want to drop kick him out of a **** window what a mohawk yeah I did have a mohawk Mohawks are cool still cool shirts are cool still cool I used to I would expect someone with a mohawk to drop kick someone",
      "start": 1085.72
    },
    {
      "text": "drop kick him out of a **** window what a mohawk yeah I did have a mohawk Mohawks are cool still cool shirts are cool still cool I used to I would expect someone with a mohawk to drop kick someone in a Hawaiian shirt that checks out that checks out we would have been best friends oh oh Vandal oh yeah the the vandals I used to wear my dad's uh when I was a freshman I went to school in Boston it was very cold uh my dad had a a peacat New York City you know he's a New York City firefighter so he had a PE coat with the FDNY logo I used to wear it look like a **** Civil War General walking around uh walking around Boston was very s very slick and Ramone my my good friend from college uh brought some pictures and showed them to me and I'm wearing that coat in like every picture yeah that's cool though see you were punk rock punk rock's always cool punk rock is is a classic look Punk Something uh home and watching strategy guides on game facts my in my SP time I was very punk rock and I",
      "start": 1123.32
    },
    {
      "text": "cool though see you were punk rock punk rock's always cool punk rock is is a classic look Punk Something uh home and watching strategy guides on game facts my in my SP time I was very punk rock and I haven't seen a picture of Greg from college but I imagine that you were just a giant nerd yeah well it was me with blue hair and a Hawaiian shirt you going back to the blue hair yeah I got this white spot you know from where my hair grew back uh I this White Spot came with it I think about dying did you D at blue and then the white spot it didn't take on the white the white spot for some reason can't take leave that and you know deliberately die around the White Spot own the white it's very distinctive uh did you bleach your hair and then die oh yeah big time yeah you you you got to bleach it white first oh god I've bleached my hair a handful of times over the years um and did you ever Frost your tips cuz I desperately want to frost my tips no but so I I would only bleach my hair once and",
      "start": 1163.16
    },
    {
      "text": "white first oh god I've bleached my hair a handful of times over the years um and did you ever Frost your tips cuz I desperately want to frost my tips no but so I I would only bleach my hair once and then let it grow out so you would eventually get to that point where it basically was cross the tips that's my um recollection of every single time I seen Clement is he's always got like that like half grown out frosted got crazy cool hair cuz he just does crazy stuff to his hair all the time see that's the thing about m is I had blue hair but it was I wasn't doing anything crazy with it like you can just picture me right now with blue hair and that was it I have one photo of me with the bleach blonde hair cuz KU came to town and they're blue so I didn't I just bleached it blonde and again it's still the same comb over hair it's just like it's just you had a combover blonde mop well I mean how do you I don't I I don't like the term combover cuz I'm not combing over that is exactly what I",
      "start": 1208.4
    },
    {
      "text": "still the same comb over hair it's just like it's just you had a combover blonde mop well I mean how do you I don't I I don't like the term combover cuz I'm not combing over that is exactly what I had when I was bleaching my hair too it was you know just parted on the left uh and and combed over to the side and I I don't know I enjoyed it blondes have more fun I don't even remember what was the original question John Cena wears jean shorts John Cen shorts tent happens yeah no I this is like for wrestling right I have this exact same story you had right where I was into it big time as a kid you grow out of it because it's you know it's Superheroes versus Villains The Clown retires and you don't want to watch it anymore true and then I remember when I got to High School uh NWC W Revenge was the jam right that's when the the WWF game started coming that's when attitude hit that's when like man this is crazy like it became okay to be into wrestling all it was a brand new product again and",
      "start": 1248.24
    },
    {
      "text": "the jam right that's when the the WWF game started coming that's when attitude hit that's when like man this is crazy like it became okay to be into wrestling all it was a brand new product again and then the problem is like I stuck with that in from high school into college well into college and then at some point yeah you're just like what am I doing this is the same thing over and over again I can't do it and like I feel even when I jump back into it now I still haven't hasn't been that giant shift you know what I mean like I don't know where they pivot to next ex it's parts of it I seem I think are super fascinating and you know like from like a business perspective like watching them try to craft that show and try to run their business so it's like I'm almost looking at it like that way now which is probably a sad way to watch any piece of entertainment programming but that's that's just how it's shaking out how's the revenue flow going the revenue flow for them is interesting uh",
      "start": 1291.6
    },
    {
      "text": "now which is probably a sad way to watch any piece of entertainment programming but that's that's just how it's shaking out how's the revenue flow going the revenue flow for them is interesting uh because I mean you can watch what they're pushing at any given moment right so you know it's like okay there are Mountain Dew bottles sitting at the announce table like you know American Idol or something would have Coke glasses or something like that or you can watch what they're pushing at any given moment and how desperately they push it you can tell how they're doing so right now like they launched the WWE Network which is their streaming service with all this back catalog stuff and you can you can look at it and go like maybe it's not going so well cuz like you watch them push it harder and harder in like in like increasingly simplified ways to like you know it started and they launched it and like okay then all of a sudden it became it's like Netflix for wrestling like they had to",
      "start": 1331.96
    },
    {
      "text": "and harder in like in like increasingly simplified ways to like you know it started and they launched it and like okay then all of a sudden it became it's like Netflix for wrestling like they had to explain it to to people who just weren't getting it and people were like you get it on a computer or a thing that you hook up to your TV it's not on your cable you need to you know it's like they're practically at some point just going to and they've done this like they they've been like here's how you install an app on your iPad go type in WW like you can watch that kind of like desperation mixed with like their amazing quest for uh like finding mainstream acceptance It's a lot like porn like I don't know if you You'spoken with porn stars oh I have um so I hung out with Ron Jeremy oh no and the name amongst names yeah um I hung out with him backstage at a strip club in Sacramento and all right slow this conversation slow this down yeah how did all this happen so a friend of M back up a",
      "start": 1368.24
    },
    {
      "text": "the name amongst names yeah um I hung out with him backstage at a strip club in Sacramento and all right slow this conversation slow this down yeah how did all this happen so a friend of M back up a couple feet here A friend of mine met Ron Jeremy so okay back in the day video game trade shows used the video game stuff used to happen at CES I know where we're going before E3 so the there were the the adult convention was happening at the same time the same badge got you into both I was 16 very excited to see the pornography yeah uh so we would go over there and I would be like I don't want to talk to any of these women um we should also preface that when we when you and I were 16 there was not a huge proliferation of porn everywhere exactly this was 1992 there was no Instagram there was barely VHS tapes at this point of pornographic material floating around like DVD pornography was just like a far away dream um so anyway a friend of mine uh started doing uh Ron Jeremy's official",
      "start": 1412.4
    },
    {
      "text": "was barely VHS tapes at this point of pornographic material floating around like DVD pornography was just like a far away dream. Um, so anyway, a friend of mine, uh, started doing, uh, Ron Jeremy's official website, uh, because, you know, he need he's a he's a busy man, he needs a website. So, so my friend started doing it and he's like, well, I'm going to go hang out with Ron because I need to update the website, we need to go talk to him about stuff or something. I'm like, okay, didn't realize it was a strip club, but Ron Jeremy was there telling jokes. He went on tour doing standup. Yeah, he did. He's got to tell people what's up, right? Usually him, that's actually, I mean, you that is like 90% of his material right there. You you nailed his act, you were perfect. Um, so he was doing that, he had his rap single out, Freak of the Week with DJ Polo, who, uh, did some work with Cool G Rap back in anyway. Um, did you make up all those names just now? No, no , Cool G Rap and DJ Polo, that's Root to the Riches, Jeff. He's a rap a",
      "start": 1455.28
    },
    {
      "text": "Freak of the Week with DJ Polo, who, uh, did some work with Cool G Rap back in anyway. Um, did you make up all those names just now? No, no , Cool G Rap and DJ Polo, that's Root to the Riches, Jeff. He's a rap aficionado. That's true. Really? That was my first introduction to Mr. Gerstmann, really? Yeah, we I the first time I ever saw you in the flesh, you you were rap battling on that Def Jam Rapstar at some video game event we were at. They yeah, they had me up on stage for that. I rapped in front of the the head of Def Jam. I was super weird. Um, he did not sign me to a deal. I asked. I said, like , I could rap like this exactly. Um, so at this point, so we are hanging out backstage at a strip club with, uh, Ron Jeremy. It's me, uh, the guy who's running a site and the guy who's currently my roommate, um, who is a nutcase . They're all anyway. Um, so me and and my friend, we're kind of sitting back there like not really engaged in this conversation. We're backstage at a strip club going like this is ridiculous, why are we here?",
      "start": 1496.52
    },
    {
      "text": "all anyway. Um, so me and and my friend, we're kind of sitting back there like not really engaged in this conversation. We're backstage at a strip club going like this is ridiculous, why are we here? Like, are there someone we're going to get found out, someone's going to ask us to leave and we're listening to Ron and so anyway, my point, uh, about the the wrestling kind of desperation is all he would talk about, all he wanted to talk about was, oh, I was in the South Park guys movie, Orgasmo. Oh, I was in this music video. Oh, I'm going to be on this TV show. Like the porn stuff was like nothing, like it was the mainstream anything he could do that would be like wider and maybe like get him out of that. So it was like this kind of like sad thing, uh, to to watch because like he just like he was kind of reaching trying to get out or or at least get bigger, uh, not that you need I was gonna say he's stretching, he's getting bigger. What is this new thing work thing I saw in a movie? No, you",
      "start": 1545.32
    },
    {
      "text": "he was kind of reaching trying to get out or or at least get bigger, uh, not that you need I was gonna say he's stretching, he's getting bigger. What is this new thing work thing I saw in a movie? No, you didn't. It's very cool. It's just a little pound. Yeah, now let's race it. Must it was a Fast and Fear it was something I can't was like of course fast when you base your life so cool. Oh my god, of course I do. Um, so he's kind of telling his stories and like actually so this this ended up getting like kind of verified formul later when they put out a documentary on him, but he would kind of doze off and kind of pick up mid sentence. Turns out he has lowgrade narcolepsy which we kind ofed talking to, but then the documentary kind of confirmed that. Um, so like this this whole story is going on and it's like super weird because there are you know nude women getting ready to get out, you know, they're putting on what little they're putting on to go take off on stage, um, as we're backstage of strip club. So",
      "start": 1583.64
    },
    {
      "text": "super weird because there are you know nude women getting ready to get out, you know , they're putting on what little they're putting on to go take off on stage, um, as we're backstage of strip club. So I'm trying not to look over at that, uh, but meanwhile, you know, the these girls that are there working are kind of coming over and trying to figure out what's going on. They are very interested in Ron because you know on some level Ron is a man who can get them out of Sacramento. MH. Um, I wanted to be out of Sacramento at that time. I would have done anything Ron Jeremy said, um, to get the **** out of Sacramento. Uh, so they kind kind of come over and try to size up the situation. They see us talking to him. They they look at us and go like well, I imagine they're thinking like well, these guys are not in the business, they're not making movies. Yeah, they must be the producers, they must be the one making they must be the moneymen or something like that. So like one by one like they kind of come back",
      "start": 1626.96
    },
    {
      "text": "in the business, they're not making movies. Yeah, they must be the producers, they must be the one making they must be the moneymen or something like that. So like one by one like they kind of come back like, hey, what's up guys? Hey, how's it going? Um, and this was this was a pretty long time ago, uh, so this will make more sense with that in mind. Uh, like you know, we're just kind of making small talk and it's like, so how's business? How's hey, how's it going? How how dollars flowing? How's things? And and you know, this this one girl's like, well, you know, I'm I'm I'm doing really well lately cuz you know, points at her face like this and goes, no doubt. Um, and we're both sitting there like for a couple seconds and we both instantly realize come to the realization like, oh, she thinks that she looks like Gwen Stefani. Yeah, who was very big at the time. How far off was she from that assessment? Not even close, like not just like so both of us just go, oh, of course, yes. I mean, look at yeah, I mean, you you're raging",
      "start": 1660.96
    },
    {
      "text": "yeah, who was very big at the time. How far off was she from that assessment? Not even close, like not just like so both of us just go, oh, of course, yes. I mean, look at yeah, I mean, you you're raging it in. Yeah, just a girl, of course. This is huge. This is amazing. Yeah , you're doing really well. think you they all think it's you. I had to get out of there so bad. Like so that that was you know, we eventually kind of got out of there, sat in the strip club, watched Ron's standup act, which really bummed me out in a ton of ways. That sounds really depressing. Yeah, it was. I mean, this story was a lot more depressing that I thought it was going to be when I asked you. That's your audience. I think you are audience and apology. That's the real lesson about the porn industry, I think is super depressing, way more depressing than than it seems. I've always imagined um and and yeah, that was uh that was a dark time. So wrestling reminds me a lot of my time with Ron Jeremy cuz they're still grasping with those strong yeah",
      "start": 1706.52
    },
    {
      "text": "than than it seems. I've always imagined um and and yeah , that was uh that was a dark time. So wrestling reminds me a lot of my time with Ron Jeremy cuz they're still grasping with those strong yeah cuz there's that that thing of like you know the come back in from commercial break and this stuff I think I've said on our podcast a little bit but they'll come back in from a commercial break and say things like did you know that Raw was the number one most watched program in the world last week it's like no one watching cares that's just them going like trying to convince people like no you're doing the cool thing you're everyone's watching Raw you're really like did you know that we've got Jon Stewart in the audience of this pay-per-view like no one cares they've been doing that forever and I mean you remember when they did like uh the one where they used to do the the it was Goldust TV in the end or whatever the GTV remember and they had like the cast of Mystery Men back there and it",
      "start": 1756.24
    },
    {
      "text": "I mean you remember when they did like uh the one where they used to do the the it was Goldust TV in the end or whatever the GTV remember and they had like the cast of Mystery Men back there and it was like what the heck what are you doing yeah yeah yeah Ben Stiller they were all back there huge wrestling fans big time ohalo special yeah I mean that's wrestling story forever and I think right now you know the big thing is like you wait for that next Innovation the fact to me which is weird when I come back and they still have that the attitude logo they still have the WWE scribble lines you know I mean like that I'm ready so you got about two more months on that I think and there after they're finally going to switch it out cuz they got to it feels like it's got to be time cuz it's still for me personally it feels juvenile right cuz I I with high school I wore ties with that to school with that on the tie you know what I mean like very cool hey when you went to Catholic school when you",
      "start": 1789.12
    },
    {
      "text": "me personally it feels juvenile right cuz I I with high school I wore ties with that to school with that on the tie you know what I mean like very cool hey when you went to Catholic school when you had to wear a tie and that was the only thing that could did you tie that around a Hawaiian shirt no that's I couldn't that's why I didn't know how to dress myself oh my God this makes so much sense but I hear what you this I think one of the things that bonds wrestling fans together is bitching about wrestling though right totally and that's that's the thing that I think applies to you know whether it's like video games or just like comic books and movies and all that other stuff like there's just a contingent of people that you know seem to live to complain about but it's not like all sports in general I guess so it's like any passion I maybe maybe it is just at some point it's any passion exists solely for people to get together around that thing they love and **** about it goes back",
      "start": 1823.96
    },
    {
      "text": "in general I guess so it's like any passion I maybe maybe it is just at some point it's any passion exists solely for people to get together around that thing they love and **** about it goes back to what we always talk about with comments on articles and videos right like there's always these negative comments on something because that's the that's what motivates people to say something that they don't like it right right yeah when you get a lot of people we get a fair amount of but you know it's it's it can be mixed sometimes but yeah like by and large it all depends on the community you build Beyond up at noon this show these people know that we'll be there talking to them but when they feel like it's just them talking I feel like that's when it's quicker to be like oh man this sucked I hate this also don't you feel like don't you guys get the the feeling that a lot of people prefer to think in sort of binary terms it's either great or horrible like you you you started this whole",
      "start": 1862.52
    },
    {
      "text": "I hate this also don't you feel like don't you guys get the the feeling that a lot of people prefer to think in sort of binary terms it's either great or horrible like you you you started this whole thing off by saying like yeah people are are extreme right now it's everything's either fantastic or not but like with everything being so fast and as fast as it is especially on the internet right isn't it just easier to like make that snap decision about I hate or Love Soccer like Greg loves soccer of me who bummed out right now super bummed out right now the USA lost **** finally these people will shut the **** up I'm like it'll be back to my Twitter feed will just be Gary Whitta and Colin Campbell and Darren Brazil talking about soccer which I can live with everyone else you're just like all right I'm going to Bor in this soccer's better than I thought it was man go USA how about give the soccer a chance from now on you mess with one of us you mess with all of us help Spider-Man what",
      "start": 1901.8
    },
    {
      "text": "all right I'm going to Bor in this soccer's better than I thought it was man go USA how about give the soccer a chance from now on you mess with one of us you mess with all of us help Spider-Man what Spiderman you know New York impression yeah go Spider-Man I'll swing all these cranes over the street for you we're all working in on: clock on this one come on guys radio it's connected to all the crane operators in New York the best thing on the planet I think you know one of the side effects I mean people have obviously always been pretty binary on that stuff but stuff like Twitter and you know comment fields and stuff just makes it so much easier I mean Twitter I mean the limitations there don't allow for nuance most of the time so it's just like **** this uh or this is great **** everyone else yeah you know and I don't know I feel like that's that's has to be the thing that you know is going to keep people away from a lot of those like those services and is going to kind of make",
      "start": 1939.24
    },
    {
      "text": "else yeah you know and I don't know I feel like that's that's has to be the thing that you know is going to keep people away from a lot of those like those services and is going to kind of make them stagnant over time if they aren't already like I I feel like I'm already like slightly tired of Twitter oh how dare you yeah it's all about moderation right yeah with that kind of see I'm I'm relatively new to Twitter fck _ Scarp it's on the screen the entire time I guess you have to say it for the MP3 people uh I'm new to it I'm still addicted to it I'll be 100% but you guys have been on it forever you guys have like hundreds of thousands of followers you're like the Ron Jeremy of Twitter right now basically yeah falling asleep mid conversation wake it up and going like let me tell you about something that happened to me 20 years ago but uh yeah I know I still like it I I like that at least on Twitter you can you do have to think a little bit if you want to say something uh halfway deep",
      "start": 1992.84
    },
    {
      "text": "something that happened to me 20 years ago but uh yeah I know I still like it I I like that at least on Twitter you can you do have to think a little bit if you want to say something uh halfway deep you know yeah like it it sharpens up like you're you're kind of oneliner like muscle gets gets a little sharper or you do the parentheses one DH 15 like okay here we go so that's why I ended up signing up for a Tumblr account at some point oh yeah because they have a means for people to ask me questions then also if I have something more to say it's and it's a little bit smaller you know it's like I don't have as many followers there so so it's like it's it's a little tighter knit you can kind of you can kind of just have conversations we've talked about internet of hate a lot and I think this flows into it in a way but we are I think way quick there's so I think there's so much vying for attention right now too is the other thing right we always talk about this with especially Netflix",
      "start": 2032.8
    },
    {
      "text": "flows into it in a way but we are I think way quick there's so I think there's so much vying for attention right now too is the other thing right we always talk about this with especially Netflix right Nick where we start something and if it doesn't grab us in the first five minutes right it's like well **** this movie I'm out where attention spans the number of choices that people have like yeah why would you settle for mediocre entertainment yet I can't **** stop watching wrestling see I felt back in the wrestling hall kind of when they did the network yeah that was amazing like that's awesome because then you can go back network network it's every pay-per-view they've ever run over the 30 years uh so it's like you can go back and watch all that old stuff and all the stuff you missed in between they have a lot of documentaries that are like the document super interesting this is what happened to me is I got the network to I'm like whatever it's trial and of course I forgot to",
      "start": 2073.6
    },
    {
      "text": "in between they have a lot of documentaries that are like the document super interesting this is what happened to me is I got the network to I'm like whatever it's trial and of course I forgot to cancel so now I'm signed up for 6 months so I'm watching it here and there we watched WrestleMania and stuff but then Christine my girlfriend watched for a little bit she's like oh that's this is weird but then like it was like you right like you're like this sucks but I can't stop watching you watch I watch I we watched WrestleMania I haven't watched WrestleMania since I don't know I was like 10 sure and uh I watched I don't know who any of these guys are cuz I like the campy old wrestling with like you know Million Dollar Man and and it's kind of getting back to some of those I feel like it's all just dudes right now you know what I mean like and then when they had the Royal Rumble kind of thing what everyone was fighting like where all the throwaway GI Joe bad guy characters were um but",
      "start": 2111.84
    },
    {
      "text": "all just dudes right now you know what I mean like and then when they had the Royal Rumble kind of thing what everyone was fighting like where all the throwaway GI Joe bad guy characters were um but yeah I was like I'm going to watch this for 10 minutes and then I sat there for like 4 hours I can't stop watching the the dark thing about that stuff is as someone who used to occasionally buy a pay-per-view before they launched the network like now my tolerance is just like I it's super high because those shows were 60 bucks a piece y for three hours getting like this great deal and now it's $10 a month so like when a pay-per-view sucks I'm like whatever it was like free yeah like I paid like zero for it like whatever I just sat there for 3 hours and ate and yogurt and portella come here away from the wires that control the camera podcast just shoot through the wires uhy yeah so it's like the the dark thing is like now my bar is way lower for but that's I mean like Greg was saying that's",
      "start": 2147.6
    },
    {
      "text": "from the wires that control the camera podcast just shoot through the wires uhy yeah so it's like the the dark thing is like now my bar is way lower for but that's I mean like Greg was saying that's all of us right like the other day I started watching Voyager and first of all I don't know if it's as good as Deep Space 9 I haven't sto I haven't started watching that yet but you guys tell me on Twitter uh and I ended up skipping whole seasons of it I was like ah it's not very good I just want to see how the season ends oh wait I can skip to the season end watch the Ser the season like you know beginning of the next one now I mean I've gone through that and you know you have no idea what the hell's going on but you watch no idea what's going on but they're almost back to Earth get into that weird habit that people get into where they just watch the First episodes and last episodes of something oh I'm I'm about there I'm actually going to go back and watch uh the Next Generation just the",
      "start": 2189.24
    },
    {
      "text": "weird habit that people get into where they just watch the First episodes and last episodes of something oh I'm I'm about there I'm actually going to go back and watch uh the Next Generation just the last like three episodes sure just cuz I can't remember how that series ends and Netflix Netflix is in that weird place where it's doesn't have a large value to most people yeah I canel mine did you yeah really I was in LA I was in a hotel room and I had a desperate need to watch Tokyo Drift it was not on Netflix I said **** you Netflix really right there first of all let me commend you on your choices in life because Tokyo Drift is wildly uh believ to have brought the series back because it's the third one yeah the second one was second one was abysmal thank you we can all agree that's the worst Fast and Furious I have a a framed Tokyo Drift poster at home oh it's so good yeah it's it's an amazing with I was yeah now that we're waiting into this topic I'm sure Tim just woke up in",
      "start": 2228.32
    },
    {
      "text": "the worst Fast and Furious I have a a framed Tokyo Drift poster at home oh it's so good yeah it's it's an amazing with I was yeah now that we're waiting into this topic I'm sure Tim just woke up in Austin screaming cuz he's not here to stop you swears that second movie is not the worst but it is the worst the worst what is then is are you saying like four or five or something think four is the worst it's the one where they go through the drug tunnels right but it's drug driving fast cars through drug tunnels drug tunnels Tim you suck Tim you suck Tim drug tunnels you don't suck Tim here's the thing about wrest poast Christine watches a little bit of it was interested enough we had Jericho on up at noon we started watching the documentaries and then we tumbled down a hole because when you're going through the documentaries for me I'm like oh yeah like the DX oh yeah the mad you know the click and the Madison Square Garden and all this is great and then she's like this is just",
      "start": 2269.96
    },
    {
      "text": "when you're going through the documentaries for me I'm like oh yeah like the DX oh yeah the mad you know the click and the Madison Square Garden and all this is great and then she's like this is just fascinating cuz like I still what I love about wrestling why I read the wrestling wrap up on IGN why I still check Raja once in a while right is that I just want to know what's going on Backstage more than anything I always feel like who are they signing who's injured like who just who got caught shoplifting ex you can always like once you no wrestling you can always be plucked out and put back in without any oh who's under feuding with great you need like one week to catch up and go like okay yeah yeah I'm caught none of this is that complicated yeah so it's like a nice like casual thing to watch cuz it sort of doesn't matter uh and it uh and it never ends so there's no season Cliffhanger there's no like I I don't watch Game of Thrones who has time for that I do wrestling song see and",
      "start": 2311.76
    },
    {
      "text": "watch cuz it sort of doesn't matter uh and it uh and it never ends so there's no season Cliffhanger there's no like I I don't watch Game of Thrones who has time for that I do wrestling song see and but and this is the thing that this is what you're talking about too I think there's a problem with it is since it never ends there's no you know you have to have a new storyline every week every two days really and so then you're always like well see what's going on cuz it's easy to pop back into it's like video games right there's so many times I want to start a new game but I'm like I don't have enough time to invest in this right now Tot but I'll put back in Skyrim or whatever at DC Universe Online I know that that's me with Wolfenstein like I really want to play it and it's like one of those things where it's like I know I need a chunk of time and instead I spent that same chunk of time playing like eight different smaller games just so I didn't have to commit to playing Wolfenstein",
      "start": 2349.96
    },
    {
      "text": "things where it's like I know I need a chunk of time and instead I spent that same chunk of time playing like eight different smaller games just so I didn't have to commit to playing Wolfenstein all the way through yet okay uh and yeah that's so wrestling is just like a video game you started and you know yeah just like I play it and you know do you think you'll ever quit I I mean I quit for years and then kind of fell back in and fell out and fell back in and I well so I mean the real answer is at this point we are now doing a monthly wrestling podcast nope uh so thanks a lot Dan now I've got a business reason yeah to business Reon now you get to write off the WWE Network exactly but I will I will I will say this just generally about the the hate and how hate is attracted to people haters are attracted to everything right like you can't kind of Escape it the binary nature of zeros or tens and loving or hating something Greg I like politics I this a very very political thing like",
      "start": 2384.12
    },
    {
      "text": "are attracted to everything right like you can't kind of Escape it the binary nature of zeros or tens and loving or hating something Greg I like politics I this a very very political thing like loving and hating and evil and good but I think back to you know the founders in the Constitution when they wrote it and when they were kind of all partying together after they won the revolution 13 Articles of Confederation then the Constitution they didn't anticipate political parties and in fact tried to warn against them and immediately they fractured and had political parties within like one year after the Constitution like offici you know Federalist and Anti Federalist and the broad sheets back then were like horrific like much worse than the newspapers and news like we make fun of like MSNBC today but like the newspapers back then were insane like what they were saying about people and stuff like that and so it's it's just it it's it's just time it's the hating is timeless and it's",
      "start": 2426.24
    },
    {
      "text": "MSNBC today but like the newspapers back then were insane like what they were saying about people and stuff like that and so it's it's just it it's it's just time it's the hating is timeless and it's everywhere like did you know Alexander Hamilton **** his mom like you know was like like crazy as you know not literally that but like crazy I'll vote for that guy yeah so you know he went over a sect of the population like yeah check check check beenin there brother all right could he couldn't run for president wasn't born in the United States but uh yeah that was his big mistake was not being born in the United States uh he was born in the Caribbean but uh yeah so I I just feel like it's everywhere like it just touches everything it kind of sucks and I I've been trying to be better about what we talk about I'm a huge Jets fan so when football happens I would always make fun of Mark Sanchez especially after like 2009 and 2010 he started like really crumbling and I was like you know i'",
      "start": 2464.28
    },
    {
      "text": "what we talk about I'm a huge Jets fan so when football happens I would always make fun of Mark Sanchez especially after like 2009 and 2010 he started like really crumbling and I was like you know i'be like you know he throw an interception be like Mark Sanchez **** sucks you know on Twitter or whatever like what like what's with this guy bench him and then I'm like is that really necessary to say that you know like what first of all what if he like reads that that hurt his feelings like I don't like when people are mean to me on Twitter and then I you know and I had that same Instinct today like with the hockey free agency started I'm a big Islanders fan so I I um I originally wrote my tweet out I'm like I'm going to keep a close eye on uh Twitter today to see how badly G snows the GM **** everything up that's what I wrote and I'm like that's mean so then I just to race it I said the New York Islanders because then it's a group at least a group of people that was that was after",
      "start": 2500.8
    },
    {
      "text": "**** everything up that's what I wrote and I'm like that's mean so then I just to race it I said the New York Islanders because then it's a group at least a group of people that was that was after that last uh wrestling pay-per-view all I did was get on Twitter and just type wrestling exclamation point it's almost as if someone were like I mean I can I can kind of understand a little bit but I don't know what would drive a man to like rant for 15 minutes straight about how much he hates like a sport it's you're you're being like the Twitter kids and the comic kids you're misrepresenting the argument it wasn't that I hated the sport it's the fair weather fans for the World Cup that popped up out of nowhere that I know I was one of them today the sport isn't you weren't tweeting your balls off legitimately got at that game and I sat down and I came over to give you the score I me the sport isn't even worth hating it's worth completely ignoring it's just like why pay any",
      "start": 2537.8
    },
    {
      "text": "your balls off legitimately got at that game and I sat down and I came over to give you the score I me the sport isn't even worth hating it's worth completely ignoring it's just like why pay any attention to it it's everywhere you couldn't get away from it's for brins and hobos it's like for now it's now it's over you should have seen the the comments are the be the **** best on that on that on that video that we did for the World Cup whatever I'm g go back and look it's so good dude because I my favorite thing and I tweeted about this I don't know how you guys feel about this I thought it was funny I got retweeted like hundreds of times I was saying like the guys are like **** **** Americans with your your arrogance you **** **** like all this kind of stuff whatever and I'm like like you know they so full themselves they're **** worthless like all this kind of **** I'm like you're on YouTube it's an American website like we we made that are you on your are you typing it",
      "start": 2577.76
    },
    {
      "text": "like you know they so full themselves they're **** worthless like all this kind of **** I'm like you're on YouTube it's an American website like we we made that are you on your are you typing it from your iPhone and then are you going to go check Twitter and play Xbox and then and then watch your American movies and your American TV shows and listen to your American music and all like relax a little bit like all right we have like a bad reputation around you but you're still replicating everything we do they're going to go play ZX Spectrum games it's like relax what's the why why so personal it wasn't even against soccer it wasn't even well because I well because because Tim named it why the World Cup completely sucks which is probably a good it's a good title to get people to click on it we definitely got a lot of clicks on it yeah that was clickbait you guys are nightmares for that sort of thing but yeah that's absolutely we have good we're going to name this we're going to",
      "start": 2613.0
    },
    {
      "text": "on it we definitely got a lot of clicks on it yeah that was click bait you guys are nightmares for that sort of thing but yeah that's absolutely we have good we're going to name this we're going to name this one like you know uh why I can't quit wrestling Halle Berry naked this is that episode look at Halle Berry nakeds to put a pin in itry call it Halle Berry naked and then parentheses not Swordfish cuz it's every time I click on that it's always just that same thing it a good thing wrestling is junk food and it's comfort food totally you go back to it it's you know you're getting into and yeah yeah and I don't have to pay close attention to it it can just be on and I can do something else with my time thank God Raw's three hours yeah right [Music]",
      "start": 2655.0
    }
  ]
}
