{
    "id": 483,
    "video_id": "3w9aKBtq1Vo",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Would You Buy An Unlimited Movie Theater Pass? - The GameOverGreggy Show Ep. 55 (Pt. 3)",
    "description": "Greg Miller wants to know how much we would pay for unlimited movies.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1419408008,
    "duration": 1516,
    "transcript_chunks": [
        {
            "text": "[ Music] my topic, we've been talking about movies a lot. Yo, on the way here, I saw something very interesting in the Kansas City Star, where I go for all my news. JK was on Reddit. Uh, AMC to test monthly movie Subscription Service. Interesting. This is stolen from The New York Times. I don't know why it takes me there. Uh, blah, blah, blah. Now a major movie theater chain is trying to step onto the subscription gravy train as it seeks to reverse audience declines, especially among young movie goers. AMC Theaters, the number two chain in North America behind Regal, has agreed to pilot a partnership with Movie Pass, a three-year-old company focusing on letting people attend a movie a day for one monthly fee. I want to know how we feel about this, how much is it, and what would you pay for it? What would you pay for a movie a day for a month? Well, I can go up to a movie a day. I'm obviously not going to go a movie a day. I would pay, I'd pay $39.99 a month for that. Tim, I don't like this a day business. Why? Because what do",
            "start": 1.1
        },
        {
            "text": "a movie a day for a month? Well, I can go up to a movie a day. I'm obviously not going to go a movie a day. I would pay, I'd pay $39.99 a month for that. Tim, I don't like this a day business. Why? Because what do you want to see multiples in a day? Yeah, no, they're saying you can see up to, oh, you want to see more than one movie in one day? Yeah, a three-year company focus on letting people attend a movie a day for one monthly fee. I think maybe they're just saying like you can go 30 movies if you want. Oh, okay, if that's the case, I think they're saying it sounds like they're saying one month, one, one, one a day. Interesting. I'm going to read a little bit thinking, thinking that I, I like, well then just hop around and screw them over. Like $29.99 and I wouldn't use it every month. Yeah, see my problem is if it's subscription model that you'd have to sign up for and have a yearly subscription to, I, I don't see, I don't like having, having to see a movie. That's my, you feel like you have to go see? Yeah, I would",
            "start": 48.12
        },
        {
            "text": "subscription model that you'd have to sign up for and have a yearly subscription to, I, I don't see, I don't like having, having to see a movie . That's my, you feel like you have to go see? Yeah, I would feel like I, in order to get benefit, like value out of it, I would have to go to two movies a weekend or something like that, depending on the price of course. Uh, Sean Finnegan was telling about they're actually is a theater chain in LA that was doing that for a while, but it was like $30 and so you had to see, you know, there's a threshold where you have to see a certain, you know, if it's $7 a ticket or $8 a ticket, how many movies would you have to see to make it, to get your money back and make it valuable? And it turned out, I think with him in this instance, it had to be six and he was like, I love movies, but I can't see six movies at a theater. I don't have time for that. Like I go one week, once a weekend, so four would be my threshold. How much is the ticket right now? About $10, so it would have to be no, no,",
            "start": 93.88
        },
        {
            "text": "I can't see six movies at a theater. I don't have time for that. Like I go one week, once a weekend, so four would be my threshold. How much is the ticket right now? About $10, so it would have to be no, no, no, it's $110 more, $9, $11. I might, 12 is it ? I don't know. I mean, I'm, I don't usually when I go to see movies, it ends up costing about $15. I always get on Fandango, it's always like, here's tax and service fees and like they, they have that weird like, hey, this is a convenience fee. It's pretty convenient, but I guess I don't want to pay this fee. I feel like if this whole thing had like real life RPG elements to it, I feel like it would entice me a bit more, like you're leveling up, like Starbucks. Yeah, yeah, stuff like that. If it was like, if it was actually enticing me to see more movies, I feel like that could be cool and interesting. Okay, what, what's your number? What's your, I to see a movie, like as many movies you're talking about , basically as many movies as you want in a month? I would say $20. Wow, wow.",
            "start": 132.76
        },
        {
            "text": "be cool and interesting. Okay, what, what's your number? What's your, I to see a movie, like as many movies you're talking about, basically as many movies as you want in a month? I would say $20. Wow, wow. It's a low, you love movies, you go to movies, but I don't think I can get out. Well, okay, 30 bucks. The subscription passes that were offered in January in Boston and Denver, I'm sorry, what they're going to do in Boston and Denver and they'll add more cities soon. Uh, you have the $35 package for normal movies, 45 for like something different, which I mean IMAX or IMX or 3D. So even cheaper, I would have paid , I, I would do $35. I mean, I feel like that would get me to the movies. See that and that's what I think about it too is like I, I, I like the movies. I do like movies once in a while. I like going to the movies, but then like it's, it's such a, I always **** about it, right? Of like, like we wanted to go see, uh, uh, after we sh had a conversation with Colin, uh, Christine and I wanted to go see what was it,",
            "start": 175.24
        },
        {
            "text": "movies, but then like it's, it's such a, I always **** about it, right? Of like, like we wanted to go see, uh, uh, after we sh had a conversation with Colin, uh, Christine and I wanted to go see what was it, what was it, what was it, what was it? Yeah, that's the one. No, it's not whatever, Birdman. We're going to go see Birdman and like I was like, we'll go to only go to the Kabuki because I can book a seat there at least and then all of them were way up close. We're like, well, we're not even going to go now. It's too much work. You know, I don't want to be up close and so then we're like, we'll go tomorrow and then something else happen. We didn't go because like, oh, the time schedule's not going to work , stupid stuff like that. But again, if I had this, I feel like I would be, well, I got to make this worth it. I got to see at least this many movies a month. That's my problem though is that movies are the one thing that I reward myself with and having to put any sort of constraints on top of it where it's like, oh, and",
            "start": 221.32
        },
        {
            "text": "see at least this many movies a month. That's my problem though is that movies are the one thing that I reward myself with and having to put any sort of constraints on top of it where it's like, oh , and I'm like having it feel like it's the gym membership where it's like I'm paying for it, but I'm not really using it, so should I cancel that? Oh, **** and then it's a stress factor that I just don't need my life. The other big thing though that I think would stop me from getting, but she motivate you is you have a bunch of movie theaters right by you. I do. We have no movie theaters over here. If you want to go see the movies, it's a car ride, it's parking, it's this, it's that, maybe it's a cab ride. Da, da, da. The only problem is the movie theaters that are, I still have to take my car to any cineplexes. All the movie theaters I have are only three screens. So by thinking about that, there's only maybe one or two movies out a month in those screens that I'd want to see. I see. So otherwise I have to go to",
            "start": 253.6
        },
        {
            "text": "the movie theaters I have are only three screens. So by thinking about that, there's only maybe one or two movies out a month in those screens that I'd want to see. I see. So otherwise I have to go to the AMC Van Ness or the Metreon. I don't trust theaters like that. I love those theaters though. They remind me, yeah, I love the bed bugs. Everybody, you don't get the bed bugs and the seamen on the seats . That's that stuff. And also I, I feel like at this point our TVs are nicer than that ****. No, they actually the, the theaters, the screens near me, they went all digital, so they have all new screens and they're digital projectors, they're actually really nice, the good sound systems, except now that the sound systems are so good, you really kind of start experiencing that, uh, the age of the theaters because they're not, uh, soundproofed. So Interstellar was next to me and I was watching like some romcom with my wife, I can't remember what it was and every like at every line there was like, gee, I hate that. Oh, I was",
            "start": 287.28
        },
        {
            "text": "not, uh, soundproofed. So Interstellar was next to me and I was watching like some romcom with my wife, I can't remember what it was and every like at every line there was like, gee, I hate that. Oh, I was like, wow, man, this that was crazy. Here's something interesting. It's the whole article is talking about how you know movies, movie theaters are **** and they're, they are just trying to catch up and they can't do it. Millennials, they, you know, ingest content in a different way. You're not a millennial. I'm a damn Millennial born in'89. You were just trying to tell us you were an 80s kid. You can't have it both ways, Tim. Yeah, Tim, I'm a, if I have to choose one, I'm a millennial. Oh man, Vince McMahon doesn't get your generation and he never will. Anyways, uh, trying to catch up. This is one last month for instance, AMC offered members of its Rewards program , AB AMC Stubs, the chance to see Interstellar as many times as they wanted for $19.99 to $34.99 depending on the Vie. You do that, that's the Sean Finnegan",
            "start": 322.04
        },
        {
            "text": "AMC offered members of its Rewards program, AB AMC Stubs, the chance to see Interstellar as many times as they wanted for $19.99 to $34.99 depending on the Vie. You do that, that's the Sean Finnegan special. Do you know how many times Sean saw Interstellar? No, I think it was four. I think it was four times. I know he went and saw her a bunch of times and like long movies, Sean loves it. He loves film though. He loves film. One of those he, he's I think exception to the rule. This gets me excited because I've been, I've been trying to make a point literally for years, probably four or five years to get back onto the movie train. Can't do it though. We try. I, I try and I just can't do it, but I feel like you know, because I really used to go to movies all the time. Like I was really from , you know, from when I was a child to through college, I would go to the movies all the time. Yeah, me too, like multiple times a month and I saw everything that I wanted to see. There was never a movie came out I was like, I didn't",
            "start": 361.36
        },
        {
            "text": "a child to through college, I would go to the movies all the time. Yeah, me too, like multiple times a month and I saw everything that I wanted to see. There was never a movie came out I was like, I didn't see it. Yeah, now there's every movie that comes out I'm like, I didn't see it, you know. I, I, I'm looking for a way to get back into it. I, I enjoy film. I don't know anything about it, but I enjoy it and like digital, I, I still, I, that's what I'm saying is I still feel like, you know what, I know you feel very strong about the movie theater and, and I, I think movie theaters have a place. I like going to them. They're fun, they're fine, not all the time though, but I think that like we could all benefit from them from the ****, you know, the Publishers of these movies or whatever that you know, the production companies to just release the goddamn movies day and date, preach brother, you know, even for $20 or something like that, preach it. Interstellar, not like go to the theater and see Interstellar and this",
            "start": 403.52
        },
        {
            "text": "companies to just release the goddamn movies day and date, preach brother, you know, even for $20 or something like that, preach it. Interstellar, not like go to the theater and see Interstellar and this beautiful screen, this great sound system or buy it for for $20 and watch it on your **** TV, you know, like just do it already. So scared of, I'm really conflicted. I, I, I want there to be a thing that saves theaters. I'm not a smart, they, they won't though. Like remember when we said, remember when we said , you know, you thought that like, like things like Tower Records or Warehouse would always be there. Nope. I never remember saying that. Those people were stupid. I, I would have thought that right back in the'90s going to be anything like that. This is like when theater movies came around, they thought they going to put theaters out of business or whatever, like when TV came around, it's going to put radio out of business. Like it's going to get to be a smaller market share for sure, but it'll still be there",
            "start": 437.4
        },
        {
            "text": "to put theaters out of business or whatever, like when TV came around, it's going to put radio out of business. Like it's going to get to be a smaller market share for sure, but it'll still be there to be the boutique experience. Yeah, but radio is so much cheaper. Like there's so much more infrastructure you need with movies, but you're going with the movie thing. I, you know, we had this conversation before on the show about digital distribution, like the movies are going to make that money upfront faster and it's going to look more successful. This weekend I watched, uh, uh, Life After Beth, which is an independent movie with, uh, Aubrey Plaza and then, uh, Sex Tape, Cam Diaz and J, it was fun and it was one things I saw the trailer when I was on a Virgin Flight come back. I was like, that actually looks kind of good, but I, it was, I'm sure if I saw that on TV during what or I guess on the internet before I did something else, I, it would not have motivated me to go out and see it, but I paid, I rented it for the",
            "start": 475.08
        },
        {
            "text": "good, but I, it was, I'm sure if I saw that on TV during what or I guess on the internet before I did something else, I, it would not have motivated me to go out and see it, but I paid, I rented it for the six bucks or whatever and I was like, oh, I had a really good time with that. That was a fun movie and it's like, wouldn't you want that six bucks on opening weekend from me who wouldn't come out and see it and again, if it scales, maybe that's where it breaks down and gets different. I, I think so too. I think this reminds me a lot of digital distribution with video games because clearly Sony and Microsoft and the third parties would love to just have digital distribution. They would love it. They cut out GameStop game like and all the merchandise guys. Um, products would become cheaper, become cheaper to make. It would, it would help, it would be, it would help, it would help everybody except for the stores that they rely on to sell hardware and get people in stores, buy games because it takes acclamation",
            "start": 512.12
        },
        {
            "text": "make it would, it would help, it would be, it would help, it would help everybody except for the stores that they rely on to sell hardware and get people in stores, buy games because it takes acclamation to get to that point. I think the same thing's true with the movie studios. I bet you that they would love to do something like that because they can make their movies cheaper. They don't have to distribute their movies. They don't have to cut, make any cuts with the movie theaters . They cut out the middleman. They go straight to the, to, they go straight to the the consumer even if they only save, I know that I know that movie theaters don't make a ton of money on the tickets. They make a ton of money on their concessions, but I feel like they could lower their margin, you know, and make more money by just going straight to the people and being like, well, you can have the movie theater experience or we just, I don't think it could be $6. I think it would literally be $19.99 because you can have all your",
            "start": 550.04
        },
        {
            "text": "just going straight to the people and being like, well, you can have the movie theater experience or we just, I don't think it could be $6. I think it would literally be $19.99 because you can have all your friends over and watch the movie. Yeah, see I think, I think yes, it's different for games though because games don't have a like they don't have Windows, right? A game comes out and it's windowing as DLC where six months later or two months later they have DLC that drops and you start making more and more money off the game or you have , you know, there's all sorts of manners of making consistent money in Games. Movies, you have the the the importance of the theater is that everything builds up to that, right? And then that is the window, the window that it's in theaters, right? We've already seen a huge decline in DVD sales and Blu-ray sales because people digital distribution has basically killed that market or is killing that market to a certain great. Um, **** it, you know, same with CDs except you're",
            "start": 579.4
        },
        {
            "text": "in DVD sales and Blu-ray sales because people digital distribution has basically killed that market or is killing that market to a certain great. Um, **** it, you know, same with CDs except you're, you're crazy, you still buy CDs, which I don't know. Um, Blu-rays are still huge for for a number of reasons, but they're, but yeah, I mean the DVD Market , it used to be the Home Video Market, right? And that thing like doesn't exist anymore. Now it's the digital distribution Market, which is sort of video on demand, but video on demand was a a big market, right? You had video on demand in hotels, uh, Airlines, you had all that stuff, see your cable box, eventually you had video on demand and all that things, right? Those, those markets are starting to go away as everything becomes homogenized into that one day and dat digital distribution. So they're trying to figure out ways to have it, um, sort of not Pitfall on them, right? And and not completely destroy the industry because you don't have that many opportunities. I",
            "start": 616.48
        },
        {
            "text": "digital distribution. So they're trying to figure out ways to have it, um, sort of not Pitfall on them, right? And and not completely destroy the industry because you don't have that many opportunities. I mean you don't have, you have a ton of opportunities back in the day to make money off of films, but not so much anymore if that makes sense. The Nielsen company said last week the movie going, I'm sorry that the movie going of Americans age 12 to 24 dropped 15% in the first 9 months of 2014 compared with attendance in the same period of last year. Total attendance has declined about 5% so far this year compared with last according to box office analysts because of fewer broad appeal films and about a dozen more modest movies. I think that they're almost making excuses. I just feel like the precipitous fall is going to happen regardless. There were big movies this year. The I I I I hear what you're saying to be fair games most, you know, a new game sells a vast majority of his copies in two weeks, so",
            "start": 655.28
        },
        {
            "text": "fall is going to happen regardless. There were big movies this year. The I I I I hear what you're saying to be fair games most, you know, a new game sells a vast majority of his copies in two weeks, so like, so you know, you have 14 days to make most of your money back or you're screwed, right? And I'm sure movies have the same conundrum, but I I can't help but wonder if the movie studios must embrace the what the music industry timately had to embrace with iTunes, which was like, this is going to happen and we can either get in on it now and make our money and accept that we are going to shrink or we just shrink and don't accept it, you know, because I mean I think that that is what's happening even if we could compromise on a level of the TV shows, right? Where I love Walking Dead. If I miss Walking Dead on a Sunday or whatever, I can buy it on iTunes Monday morning. So if you're worried about those getting your views on that first night then or in this, you know, opening weekend great, but then",
            "start": 694.72
        },
        {
            "text": "Dead on a Sunday or whatever, I can buy it on iTunes Monday morning. So if you're worried about those getting your views on that first night then or in this, you know, opening weekend great, but then Monday or Tuesday put it out on digital distribution so I can get it. Sure, cuz if I'm not motivated enough to get that weekend you're talking TV though. TV is at a whole different , I'm saying take TV and apply to this. You can't just every time we say something do it like these other people you and your Hollywood Elite fascist people can't keep putting us down with saying it's not, don't touch me, don't touch me. No, it's just TV. TV is in a in a what much uh uh worse off Place actually. Oh yeah, they're screwed like network television People Like Us. Yeah, yeah, it's it's not I mean it's it is because of that Millennial Gap, right? It's people just like the that that core demographic that all important incredibly important like I guess it's what 17 to 35 demographic is that on the 17-year-old side they're",
            "start": 739.12
        },
        {
            "text": "Millennial Gap, right? It's people just like the that that core demographic that all important incredibly important like I guess it's what 17 to 35 demographic is that on the 17-year-old side they're not they don't care about TV anymore. Yeah, and they cannot get ratings like they were talking about the gap between the highest rated show and the lowest rating show not being that big anymore, which is a really scary thing. Like think about that. Like you used to have Seinfeld that was like a Titan and then you had really crappy shows that were like riding on its coattails that could be made because friends was yeah, that was just terrible that was rubish didn't make any money. Um, but you don't have that anymore. Like name like other than The Big Bang Theory and Modern Family which I think are two really big shows like there aren't that there's not that big Chasm anymore of success doesn't make that much money though. I'm joking I know yeah that's the problem and it's a great show but it's because",
            "start": 780.24
        },
        {
            "text": "big shows like there aren't that there's not that big Chasm anymore of success doesn't make that much money though. I'm joking I know yeah that's the problem and it's a great show but it's because it's a great show for us. We're all above 30 almost. Tim, you're like what 39 40? Well yeah, he's you know he's a millennial flash. Do you even watch like Millennial 80s kid and and what is your proven sort of like what when you go home what do you do for entertainment not not in the kind finds of your own bathroom slow be watch a lot of YouTube that's a you watch a lot of YouTube and that's the problem right is that not a problem for us because we're on YouTube and we're you know cuz we're smart kids but uh dude that traditional mainstream media is really doesn't get it they don't understand how to bring it back. Well I mean that's the thing is that we're all so fractured both young old and this I foret we're talking in the office today about movies and somebody was asking talking about all these",
            "start": 818.76
        },
        {
            "text": "it back. Well I mean that's the thing is that we're all so fractured both young old and this I foret we're talking in the office today about movies and somebody was asking talking about all these great movies I'm like I don't I haven't seen anything. I't seen they talking about TV and I'm like no I go home and I play games or I you know do something on the Internet there's only so many hours in the day that's the biggest problem. The the TV Market's going to be the first it's already cratering but it's going to be the first to to totally be different in a few years. I think we're already seeing with alart kind of like HBO and Showtime are going to go that way. Netflix is already making better shows than most of the networks so like you know of cards what like House of Cards is coming back and that show is **** awesome you know like so you know and then and then random ass like like PBS is you know helping fund Downton Abbey and getting that from from you know their British broadcasters or",
            "start": 857.92
        },
        {
            "text": "that show is **** awesome you know like so you know and then and then random ass like like PBS is you know helping fund Downton Abbey and getting that from from you know their British broadcasters or whatever and it's like that's better than **** anything on TV. Well the I'll tell you one thing the BBC has a way better model for television than we do . They make four to six episodes of a that's their season. We for some reason back in like up until about a few years ago were like we got to make 23 episodes of Television that's that's absurd no thank you that's too much and yeah when you think about it when it made sense when you couldn't record TV because then you had you strung along the audience for 23 consecutive weeks or if they did that crap where it's like week six you stopped and you bring it back like that was horrible the Smallville model yeah the Smallville model hey What's happen in the middle nothing it doesn't matter skip it uh but yeah now they're now they're at you know 12",
            "start": 890.28
        },
        {
            "text": "it back like that was horrible the Smallville model yeah the Smallville model hey What's happen in the middle nothing it doesn't matter skip it uh but yeah now they're now they're at you know 12 13 episodes per season and when you watch something like Sherlock it's three episodes and they're basically movies and they're awesome and it makes sense but you have to find a different way to make money off it you can't do you can't do ads anymore and that's what terrifies people is like so much of the infrastructure and so much of the revenue in that industry is driven by baking ads into something and now they have analytics that prove that no one even sees those ads unless it's a live piece of Television which is why # Peter Pan Live was a worldwide phenomenon of Awesomeness what how did how give me some Captain Hook lines it was terrible Peter grow up why aren't you old yet I'm old God it's just getting worse guys well I feel like what you're saying with the 24 episode thing was true but",
            "start": 932.08
        },
        {
            "text": "me some Captain Hook lines it was terrible Peter grow up why aren't you old yet I'm old God it's just getting worse guys well I feel like what you're saying with the 24 episode thing was true but just be like and it made sense when we were kids we were excited about that from September to March you can watch sure new episode you know the guys from M boette were in a room in the late 80s we got to give these kids 24 episodes a Year Sandy Duncan on Hogan family you know and they were they were stoked about Sandy you know Sandy Duncan being on **** Hogan Family for 24 episodes a year but I agree with you when I when I watched Sherlock I only watched the first season I was really into it and uh I was just like this is awesome these are just movies yeah they're like literally almost two hours each you know and it was it was like a self-contained story and it was great and even Downton Abbey is like seven or eight episodes beautifully written way way better than that's that I've seen anywhere",
            "start": 969.6
        },
        {
            "text": "each you know and it was it was like a self-contained story and it was great and even Downton Abbey is like seven or eight episodes beautifully written way way better than that's that I've seen anywhere on TV including AMC you know like so and AMC's obviously turnning on some good stuff especially with Mad Men which is **** high Game of Thrones 10 episodes you know but see that that's crazy because it's like then you're left with pretty much a year waiting for the next season yeah sucks but it's worth we had more things like Game of Thrones right like well that's what HBO is so good at is when something you something great ends something great begins or whatever so like when yeah you game thrs went away I think then they started off Newsroom right and now granted this final season of Newsroom was only five or six episodes and it was like a I think it's cuz they didn't even want to do it well it I mean it works because like don't like that was all thing it suck to see that show go I",
            "start": 1010.44
        },
        {
            "text": "Room was only five or six episodes and it was like a I think it's cuz they didn't even want to do it well it I mean it works because like don't like that was all thing it suck to see that show go I like I love Newsroom or whatever but like it also ends and it's like man that was great and I love the entire ride there wasn't some season I dropped out in the middle of and was like oh I'm not doing this Aaron Sorin wasn't beating you over the head with his Aaron Sorin dialogue no he was but I like that I like that once in a while shut up you love The West Wing I love The West Wing because I don't feel like I don't I feel like the Aaron Sor and meters off the charts in new new I feel like I feel like it's not I mean Aaron Sorin is all over The West Wing but I don't feel like the Aaron Sorin meters off the charts you know he did and I've only seen a couple episodes Peter it's fine Peter what are you doing come get a drink with me you can't you're not old enough you gotta be old at Peter I",
            "start": 1051.32
        },
        {
            "text": "off the charts you know he did and I've only seen a couple episodes Peter it's fine Peter what are you doing come get a drink with me you can't you're not old enough you gotta be old at Peter I want to watch a Sizzle reel I'm gonna go on YouTube after this and just see if I can find all the Captain Hook moments from that you probably can I haven't watched it yet they were pretty amazing uh no the the problem with the Newsroom I think was that yeah it was a little too Sorin he got I think he had a lot of creative power in that one yeah and uh they they just let him go I liked West Wing because it was a little more fair and balance like you'd always have the more conservative character matched up against the more liberal character and they would go at it and it would you would you would come away like understanding both sides of every argument whereas I feel like the Newsroom just didn't do that so much it's a little bit more preachy so to speak uh but yeah I feel like if the film",
            "start": 1086.28
        },
        {
            "text": "come away like understanding both sides of every argument whereas I feel like the Newsroom just didn't do that so much it's a little bit more preachy so to speak uh but yeah I feel like if the film industry sadly will and needs to go through transformation as does uh television and this is a good step this subscription model but I don't think would you do would you would you sign up for $35 I don't think that I would honestly Tim would you sign up I don't think there's enough movies that come out like I was thinking back to this year there's not that many movies that I like $35 that's about how much I spent in May of 2014 yeah which is Godzilla X-Men um go Captain America 3 no no was April excuse but um I know Maleon came out around then I but I would have much like there was like Guardians was August I remember from May to August it was like oh Spider-Man was in there Spiderman pretty much every weekend we were going to the theaters and besides that I mean it was just like once",
            "start": 1122.72
        },
        {
            "text": "was August I remember from May to August it was like oh Spider-Man was in there Spiderman pretty much every weekend we were going to the theaters and besides that I mean it was just like once every two months maybe. Well I feel like this is going to be really good if you have a family, right? Where you buy them like some sort of pass or you get, you know, if they have a bulk pass or you buy everyone and you can just go see a ton of movies because that's I used to have a friend that worked at Blockbuster and he was I was like, who rents all of these Trans Morpher movies, you know, when they when they make the crappy like, you know, Transformers is coming out in like two weeks and Trans Morphers, um, and he goes families man, like when you've got a family like you've got to take them somewhere, you have to do stuff with them. So this maybe this will work out well . See sounds thrilling. That's the same reason I think that movie theaters are going to survive as just a boutique experience because when you",
            "start": 1169.92
        },
        {
            "text": "to do stuff with them. So this maybe this will work out well. See sounds thrilling. That's the same reason I think that movie theaters are going to survive as just a boutique experience because when you go on a date, you're still going to take your date to the movie theaters. It's an easy date, but will we still have giant cineplexes, right? Do we need giant cineplexes? I much prefer the small one, the, uh, iPic theater, you know, where you go there and it's like super, super Boutique, 20 seats, they come and wait on you, they give you the food. Yeah, I think for me the reason I want I brought Kevin around. Kevin was shaking his head when I said no clex and I was like, they bring you the food and the drinks. He's like, all right, the reason I think I love the CLE, the the giant clex has less to do with the actual experience and more to do with what it stands for to me, which is that movies were always a big, yeah, freedom in America, 100%. These colors don't run, Greg. They don't run. Little college kids need jobs. Uh,",
            "start": 1205.24
        },
        {
            "text": "experience and more to do with what it stands for to me which is that movies were always a big yeah freedom in America 100% these colors don't run Greg they don't run little college kids need jobs uh no it it's that to me a film release was a huge event right it always felt that way and I F you I would always follow I still to this day follow films through their Inception of like the first time you hear something about them like for instance James Bond just got like you know Spectre just came out you see the new their first poster they showed the picture the Slate right it's like what scene is that and just diving into that doing the Tim Getty's like I'm gonna just pick this thing apart you know and just live it until it comes out and it's it's this big rush of energy you know leading up to this giant mega clex that you're like which theater am I going to get hopefully it's not the one with the **** Coke stain on it that's some douchebag through at the at the screen um and then yeah",
            "start": 1240.96
        },
        {
            "text": "this giant mega clex that you're like which theater am I going to get hopefully it's not the one with the **** Coke stain on it that's some douchebag through at the at the screen um and then yeah you like when we went and saw Dark Knight that was amazing right seeing that with 400 other people in a theater you just you can't be beat but it is going to go away and it sucks how much cooler was it when you saw the Dark Knight Rises was that I saw that in a boutique theater with my wife after my bachelor party so it was actually I'm I was so glad that I survived that weekend that that movie could have been 15 hours of Bane just reading an encyclopedia and I would have liked it ODB um I want to make it a point in 2015 though regardless I'm going to put up the the fake word irregardless of going to the movies multiple times a month Nick will you go to the movies with me multiple times a month yes I'd love to I would love to we should just we should just map out a a game plan every month I",
            "start": 1277.12
        },
        {
            "text": "to the movies multiple times a month Nick will you go to the movies with me multiple times a month yes I'd love to I would love to we should just we should just map out a a game plan every month I like seeing any movie I don't think there is I mean uh it's a bold if you're doing this by the past y'all just said you wouldn't buy yeah but again my problem is I don't I don't just go to AMC's right like I go to the Lee neighborhood theaters most of the time but the Lee neighborhood Le neighborhood theaters man the bomb Tim knows what's up I don't know what's up they're on Chestnut Street and uh what about Rogers you rers I got you Tommy Lee Jones ging you okay we quiet I will go see movies with you I don't mind paying the full price for them either I don't need a bargain to go see movies I will pay the full price let's do it let's go to multiple movies a month I love that I'm saying uh roughly three two and a half to five movies a month I we do that I see I like the half that you're going",
            "start": 1325.24
        },
        {
            "text": "pay the full price let's do it let's go to multiple movies a month I love that I'm saying uh roughly three two and a half to five movies a month I we do that I see I like the half that you're going to walk out on like no no I'm just saying on average we should be going to two and a half movies to five movies a month a lot of see how long that lasts yeah it won't even begin probably no I'm hoping it does because I really I'm I'm trying to get a make a point I feel like it's a huge gap in my knowledge the last seven years or so like I just don't have any frame of reference on film anymore at all you saw Lincoln you saw American PIR that Lincoln might have been oh no Batman was what was the last movie I saw I saw my own documentary that I was I I did my own documentary I was do series but that doesn't count that doesn't count about hockey it about it was about again world world one one it's called I Nar and I was and I was in it uh I think it might be I don't know it will it will be uh",
            "start": 1363.12
        },
        {
            "text": "doesn't count that doesn't count about hockey it about it was about again world world one one it's called I Nar and I was and I was in it uh I think it might be I don't know it will it will be uh I think they're working on it that was the premiere and it was only like a month ago um really I thought it was longer than that no it was about a month ago all right um I forgot what I was saying let's go see more movies no not yet really I either I didn't see Interstellar I didn't see Gone Girl I didn't see what's another movie you really like this year that I haven't seen Gone Girl's coming out soon I'm Gone Girl blew you away **** Gone Girl I Can't Wait everything I hear is good Emily Ratachowski man that girl would have given you I would have given you my money when you were out if you would have just been on demand now you gotta wait Gone Girl sorry Ben Affleck you don't get another boat I think it's out on demand now it probably it's probably out to be sold you have buy is attainable",
            "start": 1405.48
        },
        {
            "text": "have just been on demand now you gotta wait Gone Girl sorry Ben Affleck you don't get another boat I think it's out on demand now it probably it's probably out to be sold you have buy is attainable on the internet I know that much here's my one here's the one thing that before we finish this topic and then we'll talk more about this in the coming years but the one reason I am for the day and date is because it's of evens the playing field a little bit lately I've been watching a lot of indie films a lot of independent films that have low budgets and it's I I My Hope Is that to the to Modern like new audiences that come in they look at these things like a film that's made for a million dollars or less than a million dollars in indie film quote unquote uh on the same level as a Gone Girl if they're both out the same day right it's harder competition but at the same time I feel like it's it's it's really difficult to compete as a Creator or as a as a filmmaker this day and age with a",
            "start": 1446.4
        },
        {
            "text": "if they're both out the same day right it's harder competition but at the same time I feel like it's it's it's really difficult to compete as a Creator or as a as a filmmaker this day and age with a studio that's only making $200 million film you know so it's cool to see guys like Mark Duplass or things like that like guys artists like that be able to put something out and still make their money back and still creating content okay bye that's it that's my last that's my long diet tribe on [Music] film",
            "start": 1486.04
        }
    ]
}