{
  "id": 476,
  "video_id": "7SOmKTz0SOY",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Portillo"
  ],
  "title": "Thanks, @CNeishTweet - The GameOverGreggy Show",
  "description": "Christopher (http://www.twitter.com/CNeishTweet) has a hard to probounce last name, but he's been supporting http://www.patreon.com/kindafunny for three months at the Thank You video tier. Here's where we gush over him.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1419180452,
  "duration": 343,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up Christopher N Neish, N-E-I-S-H. It's Neish. No, there's no accent at the end. And hey Christopher, it's the GameOverGreggy Show. If you know anything about it, it's that we're a bunch of idiots and we don't know how to pronounce things. Thank you for your support on Patreon. You've done it for 3 months, which was all we asked of you. You're an amazing person. Thank you for being there. Now we all get talk. This is this table, this table, Portillo calling a little bit. I like how you introduce your dumb dog before you introduce me. You've only been life partners for the last 24 years, but Portillo takes the cake. I'm just saying, I I I'm not lying in the BarkBox videos when I say Portillo is the most important member of the game show. I'm Greg, this I'm one of the co-founders, Kinda Funny. This is one of my co-founders, Nick, one of my co-founders, Tim, my **** dog. Oh, and there's Colin, the the fourth guy that helped, you know, it's no big deal. I mean, I don't remember any of you filling out the log",
      "start": 1.1
    },
    {
      "text": "one of my co-founders, Nick, one of my co-founders, Tim, my **** dog. Oh, and there's Colin, the the fourth guy that helped, you know, it's no big deal. I mean, I don't remember any of you filling out the log information for the YouTube, so I think I'm the only founder and you're all the **** employees. I'm just wondering who who you know that first show we did, I wonder who that show was about, kind of what gave us the drive. I'm just goingon to say I'm YouTube though, clutch. Damn, that wins. Who invented YouTube? Me. Now here's what I don't like, Christopher. I'm looking through your tweets and I like that you follow us, that's cool, but you have you have this photo of a bunch of Oreos and then a Chicago shot glass and coffee cup. Is that a Pokémon ball and Pokemon ball, a little flash? God damn it, Nick, how is that a Poké Ball? No, that's the that's the light, that's a reflection light. How why am I not tagged in this photo? This see Chicago and Oreos, yeah, that's a pretty Greg Miller photo. Got to get a photo on",
      "start": 50.44
    },
    {
      "text": "that a Poké Ball? No, that's the that's the light , that's a reflection light. How why am I not tagged in this photo? This see Chicago and Oreos, yeah, that's a pretty Greg Miller photo. Got to get a photo on there too. You're an egg right now. Yeah, I don't like the eggs on that. I was complain about he's an egg up here. He's he's been he's been on since 2009. Oh manic lur Christ, you know. Oh, there they tweeted us on October 10th. Funny is that I literally he got really excited when he saw his name of the than he must be really excited to hear us insulting his Twitter pick right now. Oh no, well I mean it's not you know insult sh of white. I didn't realize that the the egg picture was a reference to TW the Twitter bird for until literally mon embarrassing long time. Wow, I just got that . We're we're digging into Google search to find Christopher on Face the we're g are we stalking him right now? I love the power of the internet find his Instagram except for we couldn't find you think this is the same",
      "start": 95.16
    },
    {
      "text": "into Google search to find Christopher on Face the we're g are we stalking him right now? I love the power of the internet find his Instagram except for we couldn't find you think this is the same Professor Rocky Balboa true from SF State? There's no way. Yeah, how how can you tell? There might be more than one Christopher N. I know type in Christopher Nolan and see what happens. What that's not gonna help anything. He Christopher doesn't use Facebook that much either. It's confusing. Hold on, maybe his about will tell us something. No no workplaces to show, no schools to show, no places to show. All right, here's what you do Greg, go back to the Twitter uhhuh then go to that Oreo picture. Yeah, right click on it okay search Google for this image okay wasn't damn how do you know this stuff is it just wait can I I can click on no yeah just right click search Google for",
      "start": 135.72
    },
    {
      "text": "I I can click on no yeah just right click search Google for this image should be an option inspect element oh hold on click on that yeah click on the URL page you know properties search Google for this image there you go we're on it we're on it we're finding you Christopher you **** you think you can hide from us you can't hide from us you can't hide from the law no other images oh God all this is there's about two results what it's not going to work then usually it's a good way if it also posted to his Facebook or something we could find it that way hold on we're going to go into his media yeah see what his photos and videos look like we'll find something in here we're going to get you Christopher don't worry oh he's tweeted our video so inappropriate oh as a proud as a proud citizen of the planet Jasper I will gladly accept the code Planet Jasper that's a deep cut I'm back hold on all right he CKN19 on PlayStation Network that sounds like the secret why are you so curious to not",
      "start": 180.8
    },
    {
      "text": "the planet Jasper I will gladly accept the code Planet Jasper that's a deep cut I'm back hold on all right he CKN19 on PlayStation Network that sounds like the secret why are you so curious to not know I want to know things about our people so what let him just himself let him have the no picture let him live in anonymity let him have a last name that's not realu was thatu yeah what about nice full nice full page add Ruby at the back of DC comic books yeah he's taking a lot of foot of his PlayStation stuff I like that yeah he's got a Vine here of Game of Thrones all right we'll give up now since I'm being told are you done I'm giving up I said it I just wanted to get I wonder if he's the CK there's a CK that follows me really closely on the Twitch as well I don't know if that's you CK if it is he really to bad marer at all there CK you can leave the room now you can just leave CK y can't CK y yes yes no please hey Christopher thank you so much for your support on patreon.com kind of",
      "start": 220.68
    },
    {
      "text": "it is he really to bad marer at all there CK you can leave the room now you can just leave CK y can't CK y yes yes no please hey Christopher thank you so much for your support on patreon. com Kinda Funny being a fan of us we have a lot of cool stuff coming up in 2015 we're excited you're part of it you get to be the ground floor when we get big you can say I knew those guys when they made this video before Tim died of drugs drugs just of drugs not even a drug overdose just drugs yeah I like how all three of you at me sua fed huh I think all three of you looked at me when you said drugs for some reason not cool who's going to give the drugs that kill me Nick it's going to probably be me I'm just saying 100% yeah but I'm not GNA it's not be that hard though I'm like Tim let's go do drugs and you're like yep I'm in that sounds great Kevin will already died of a heart attack long ago oh God climbing a wall someplace cuz he's part of the community climbing community it's Kevin Kevin and I",
      "start": 271.44
    },
    {
      "text": "you're like yep I'm in that sounds great Kevin will already died of a heart attack long ago oh God climbing a wall someplace cuz he's part of the community climbing community it's Kevin Kevin and I are part of the climate Community thanks Christopher thank you very [Music] much",
      "start": 318.96
    }
  ]
}
