{
    "id": 477,
    "video_id": "FXKp3zWl8oQ",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thanks, @ROIZENGH - The GameOverGreggy Show",
    "description": "Roizengh (http://www.twitter.com/roizengh) has been supporting http://www.patreon.com/kindafunny for three months at the Thank You Video tier. We don't know much about him, but we know we love him.\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1419180446,
    "duration": 219,
    "transcript_chunks": [
        {
            "text": "[ Music] What's up, Roizengh? Ro Ro Roizengh. I said it right, right? Pokemon? Is it? No, it could be. I mean , he it looks like he's got an like an anime. Well, it's not a Pokemon, but it's anime. That's just a man. That's not a Pokemon. Um, thank you so much for your support on Patreon these past three months and supporting us at this tier, which has been ridiculous to get this video. We're pleased to have you as a best friend. I'm Greg, that's Nick, that's Tim, that's Colin. This port's on the ground. Calm down. I don't know what your problem is. You have this chip on your shoulder, something about the dog. He's going to die 30 years before you. That's that's your come that's it. Jeez, I'm really going to go early. Well, of course you are. Um, I'm looking through your here's the problem, Roy Zing. I'm going to call you Roy from here on out. I don't have a lot of information on you. We've done a few other of these thank you videos. I got photos to show the guys who who these people are. What's happening? You've only got five photos and",
            "start": 1.1
        },
        {
            "text": "out. I don't have a lot of information on you. We've done a few other of these thank you videos. I got photos to show the guys who who these people are. What's happening? You've only got five photos and videos on your Twitter. Can we make up Roy Zing's back history? Please do. Yeah, like remember that the show uh with the shark people in the 90s, Street Sharks. Street Sharks, yeah. Yeah, I'm sure Street Sharks was his favorite show. He was really big into it. He didn't like the main one though, and he didn't like the like the other cool one. He liked the third one that no one remembers their name. Where did he come down on uh like Saved By the Bell versus 90210? Oh, nice. He just didn't watch either. He versus California Dreams. Oh, California Dreams exclusively. Uh, I want to point out that the second tweet here on Roy's page is a retweet from Michael. He retweeted Michael Rosenbaum, so he knows what's up. He does know. I say I want to say he's a huge fan of Bel Biv Devoe. I'm not quite sure you retweeted me too, but",
            "start": 48.08
        },
        {
            "text": "on Roy's page is a retweet from Michael. He retweeted Michael Rosenbaum, so he knows what's up. He does know. I say I want to say he's a huge fan of Bel Biv Devoe. I'm not quite sure you retweeted me too, but yeah, I think he's a huge fan of that. Yeah. Um, loves Devo, man. Devo. That's I was thinking of. You're right. I love you're definitely right about that. Really like he retweet Colin very selective about metal though. You know what I mean, Colin? Yeah, I mean stainless steel is his favorite, right? Yeah, he likes he likes heavy metals literally. He likes heavy metals, but doesn't like Metallica or Mega Death. He likes alkaline metals. Loves to though. Alkaline Trio. Remember them? That F almost every weekend at bars, but he fights dirty, so he wins every fight. Uh, but he's the character that you can get behind when he does that, you know, like he's not the kind of guy that you're like, oh, that guy a cheater. I don't want to align myself with him. He fights for for the good cause, but he's not afraid to cheat to win. Eddie",
            "start": 92.48
        },
        {
            "text": "that you know, like he's not the kind of guy that you're like, oh, that guy a cheater. I don't want to align myself with him. He fights for for the good cause, but he's not afraid to cheat to win. Eddie Guerrero. What would Christopher Walk en say to him if he ran into Christopher Walken would probably look at him and be like, Ro Z hey, hey Roy, what are you doing? Roy, you got to come over here and listen to some Mega Death with me. They're really great Mega Death. All right, well, Roy, that's your backstory. We hope you like it. If you don't, make a Twitter bio easier in that goddamn bio, man. I'm dying over here. Pretty sure we nailed it. Roy, thank you so much for your support on Patreon. Thanks for watching all the YouTube videos, downloading the podcast, doing all that crazy stuff. We're honored to have you as a best friend. Until next time, it's been our pleasure to serve you. Thank you. First down, first spring break forever spring break, Roizengh. Secret agents working over time, fighting crime. They're fighting clim.",
            "start": 142.0
        },
        {
            "text": "best friend until next time it's been our pleasure to serve you thank you first down first spring break forever spring break Royen secret agents working overtime fighting crime they're fighting clim [Music ]",
            "start": 189.76
        }
    ]
}