{
    "id": 94,
    "video_id": "rFTNmg9KYr8",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "What's Wrong with Walmart? - A Conversation with Colin",
    "description": "Should you hate or love Walmart? Today, Greg and Colin discuss the retailer's success and what it means for consumers.\n\nToday's topic was submitted by Kevin Crum. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1375189213,
    "duration": 497,
    "transcript_chunks": [
        {
            "text": "That could also be argued. My argument is this is the free market in the United States and you don't have to work at Walmart. What's up everybody? Welcome to a conversation with Colin. I'm Greg and this is my roommate Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday I reach into my random topic pile, pull one out, toss it at him, and we talk it out for your amusement. If you like that, like the video, share it with your friends, subscribe to us. I like you to do this, by the way. That I've been practicing like 50 episodes with you now. Conor, are you ready? Yes. Today's topic of conversation is Walmart from Kevin Crumb. The old Crumb Bum. Crumb Bum. You like the Walmart? You hate the Walmart? I think Walmart's great. Walmart is awesome. Um, so Walmart's a product of the market. Yeah. And that's basically it. Yeah. I mean, people like talk [ __ ] about Walmart, but the fact of the matter is like Walmart has driven prices down for consumers and is like very",
            "start": 0.16
        },
        {
            "text": "of the market. Yeah. And that's basically it. Yeah. I mean, people like talk [ __ ] about Walmart, but the fact of the matter is like Walmart has driven prices down for consumers and is like very consumer friendly. M. Now, you can make the argument that they're um anti- union, which they are. Yep. So am I. And that they uh are they they don't pay a living wage as it were to some some of their employees, right? They're associates. Sure. Sure. That could also be argued. My argument is this is the free market in the United States and you don't have to work at Walmart. Yep. So, you don't have to shop at Walmart. Yeah. And you certainly don't have to shop at Walmart. You do because it's much cheaper than everything in in in your area. And how do they do that? Because they they have they are masterminds of production and delivery, right? Like they are masters of e economics of of economies of scale and of cutting prices like the low low price there. they they work on such a low margin, like",
            "start": 38.96
        },
        {
            "text": "of production and delivery, right? Like they are masters of e economics of of economies of scale and of cutting prices like the low low price there. they they work on such a low margin, like an extraordinarily low margin that it's like really fascinating how they make any money at all and like how they are so streamlined and profitable. It's an like they are like I've read quite a few books about Walmart and they're just really wellrun. Like it's just like a really really great idea for a shop. I think what kills me about Walmart and used to eat me up was when I still lived in Columbia. I worked at a daily newspaper and I would write these stories about small surrounding communities were about to get a super Walmart and there would be these protests against Walmart, all the local businesses, all the towns people how they didn't want this Walmart. And for me, I never understood how they thought this worked that if you love your local hardware store so much, don't shop at Walmart. Don't",
            "start": 85.12
        },
        {
            "text": "all the towns people how they didn't want this Walmart. And for me, I never understood how they thought this worked that if you love your local hardware store so much, don't shop at Walmart. Don't go buy your hardware supplies at Walmart. If you buy it from your local hardware store, they keep going. But people didn't get that. They they didn't want the idea of having to compete. You know what I mean? Like maybe I'm just, you know, a city person who loves the internet. But for me, Walmart has beaten the mom and pop store at what they do because they can get the supply so fast. It's always there. You don't have to walk in and get something ordered to you. It's always going to be there. Now granted, the internet has now beaten Walmart where I don't even I I mean, granted, there's no Walmarts in San Francisco, but I order everything off Amazon, right? And get it delivered right to my doorstep. Even if I live far away, I would do that still. If I was around a Walmart, I think I'd be more",
            "start": 135.12
        },
        {
            "text": "in San Francisco, but I order everything off Amazon, right? And get it delivered right to my doorstep. Even if I live far away, I would do that still. If I was around a Walmart, I think I'd be more inclined to do that. But you'd go to these protests and these people would be out there saying they don't want this in their community. Well, no one's forcing you to use it in your community. Your your local community stores can still exist if you choose to shop at them over the others. Yeah, that's exactly right. I mean, so vote with your wallet. Yes. Like I I'm impressed by Walmart because they see ahead of things. Like they're they're always ahead of the curve. Like for instance with e-commerce like they nipped that in the bud not not only having like their own e-commerce shop which is actually quite successful but that they like started to initiate new things into like their bigger stores where it's like now it's a supermarket too and like and like you go there like you can't buy food",
            "start": 171.92
        },
        {
            "text": "quite successful but that they like started to initiate new things into like their bigger stores where it's like now it's a supermarket too and like and like you go there like you can't buy food well you could but you like can't buy produce and like no one buy does supermarket shopping on the internet where it's like delivered from Amazon you know like like you so you go there and you're like oh yeah like I can go buy a DVD now like like they're very clever you know like and what's really respectable about Walmart. What I really respect about them when you read about them is that they what is it? Bentonville in Arkansas. Bentonville, Arkansas. Like their headquarters is in Bentonville, Arkansas. And like they still are in these like [ __ ] buildings. Like their campus is like awful. Yeah. Like they like it's like old like they are like fierce about like not spending money. So it's not like yeah like their CEO makes a lot of money and like their board makes money and like their",
            "start": 206.72
        },
        {
            "text": "Yeah. Like they like it's like old like they are like fierce about like not spending money. So it's not like yeah like their CEO makes a lot of money and like their board makes money and like their executives but like they are like they're they're not like frivolously spending money and like like they keep their cost low by at shops by keeping their own cost low as well. And um they've revolutionized in many ways um uh products that you see in stores. A good example that a lot of people don't know about is deodorant. Like Walmart revolutionized the way deodorant is displayed on the shelf. Did you know this? No. So deodorant used to come in cardboard boxes. Do you remember this? Like you'd buy like a a bottle of band and it would come in like a a cardboard box and a box would take about like 10% more shelf space, right? Yeah. And so Walmart was such an economy of scale that they went to the deodorant manufacturers, many of whom were selling more deodorant at Walmart than anywhere else,",
            "start": 241.68
        },
        {
            "text": "10% more shelf space, right? Yeah. And so Walmart was such an economy of scale that they went to the deodorant manufacturers, many of whom were selling more deodorant at Walmart than anywhere else, and they're like, \"We're not buying your [ __ ] anymore unless you get rid of these boxes.\" And and and the the the shops were like, \"Why?\" And they're like, \"Cuz you're taking too much space up on our shelves.\" And they're like, \"Okay, well, we're going to change. And since we have to change for you, we're changing for every everyone else, too. And by the way, that like also like cuts down on cardboard usage and uh drove the cost of cardboard down. So, um you know, because those cardboard manufacturers are now desperate for business because they no longer had the deodorant companies to buy their cardboard from. Like there's like really fascinating repercussions about what Walmart does. And I understand that like people are afraid of Walmart, but like you you you hit the nail on the head.",
            "start": 283.6
        },
        {
            "text": "cardboard from. Like there's like really fascinating repercussions about what Walmart does. And I understand that like people are afraid of Walmart, but like you you you hit the nail on the head. Like these mom and pop shops are great and Walmart kills them because people don't practice what they preach. Yep. That's once the Once the Walmart is in the like once you know that you can go and get a head of lettuce for a dollar instead of $3, you're not going to be able to justify it to yourself to go get the head of lettuce for $3 anymore. And that sucks that like a a buyer for a supermarket that doesn't have the scale and reach where they can like literally make a penny on every head of lettuce and they must make 50 cents on every head of lettuce. That sucks. But that is the that is what happens. This is proconsumer. You know, Walmart is good for the consumer. Well, I it just for me it always goes back to what you're saying that yeah, these people who are afraid of Walmart still shop at",
            "start": 321.12
        },
        {
            "text": "This is proconsumer. You know, Walmart is good for the consumer. Well, I it just for me it always goes back to what you're saying that yeah, these people who are afraid of Walmart still shop at Walmart. When I meet a person who hates Walmart and doesn't shop at Walmart and again, not in the Bay Area since there is no Walmart. When I meet somebody outside of that and I'm like, \"All right, that's cool. You're practicing what you preach.\" You know what I mean? Like, I will go out of my way to get a head of lettuce that's organic, that's a, you know, blah blah over here, whatever. That's awesome. But there's so many people who talk [ __ ] on Walmart and then go and pay Walmart for their things. Yeah. Get the [ __ ] out of here. Yeah. Like don't like Walmart's margins are so low that like you could easily put them out of business if you just didn't shop there. I got this friend named Po. You heard of him once. He didn't like this Quiznos commercial they did once. You ever see this one with",
            "start": 357.28
        },
        {
            "text": "easily put them out of business if you just didn't shop there. I got this friend named Po. You heard of him once. He didn't like this Quiznos commercial they did once. You ever see this one with the little talking gerbble? Eat Quiznos time. He hated that commercial so much he has never eaten at a Quiznos again. He that's you know it's crazy but he's voting with his wallet. He's doing what he needs to do to drive home his point. Yeah. I I I I just think that like the people that are against Walmart are the same people that are against like the market itself because the Walmart is just Walmart is just the product of the market, right? And they're a fascinating company. Like like read about them. Like read about their their supply chain. Like they're so on top of their [ __ ] that like and they keep their prices so low that when someone buys something at a store, this information goes to Bentonville immediately and they're like ordering new [ __ ] So there's never like there's like they",
            "start": 389.12
        },
        {
            "text": "keep their prices so low that when someone buys something at a store, this information goes to Bentonville immediately and they're like ordering new [ __ ] So there's never like there's like they know exactly what they need for this store. Like maybe this store goes through a lot of laundry detergent, but like not every store needs laundry detergent. This store in Louisiana goes through a lot of laundry detergent and they know and they have algorithms that figure that out like that. So there's always a steady supply of things that the people need in that community. Like it's very impressive. Very impressive. And you know like you know haters be damned like Walmart the success of Walmart kind of speaks for itself. I think good conversation Kevin Cran. It's good point time to point out this conversation is brought to you by No, I'm kidding. If only right making that kind of Bentonville money. Ladies and gentlemen, what do you want to see Colin talk about? Let us know in the conversation",
            "start": 425.76
        },
        {
            "text": "conversation is brought to you by No, I'm kidding. If only right making that kind of Bentonville money. Ladies and gentlemen, what do you want to see Colin talk about? Let us know in the conversation topics below. We call them comments, you leave yours, we get on the air, we all have fun. Until then, share the video with your friends. Like it so we know that we like you. And then subscribe to our YouTube channel. Until next time, have a conversational day. You know, back to I guess the question at heart, paper or plastic? They have their different uses. Now, I understand that plastic bags are bad for the environment. I think the environment will probably persevere. I like the plastic bag.",
            "start": 462.4
        }
    ]
}