{
    "id": 2063,
    "video_id": "3M2gl98ls8A",
    "show_name": "Animated",
    "hosts": [
        "Nick Scarpino"
    ],
    "title": "Update #3 - Kinda Funny: The Animated Series",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1474560000,
    "duration": 112,
    "transcript_chunks": [
        {
            "text": "Hey everyone what's up it's Nick Scarpino from Kinda Funny thanks so much again for watching episode five last week yes it finally launched thank you for your patience thank you for all of your support and and your kind words and even some of your unkind Words which were always very super critical and helpful um and very respectful in this whole process and I really appreciate that guys um so thank you for watching episode 6 hard at work on that uh Den is cranking on that and we're also working on the intro the intro is almost done I'm very excited take a look I'm going to show you like 5 Seconds of it right now don't tell anyone I showed you this though cuz Tim's like don't show anyone cuz it's got to be cool it's going me this cool surprise and I said no I want to show some people cuz this is so dope watch this anyway so that's what you guys have to look forward to um hopefully fingers crossed uh the intro will be coming out in October and then it will be a part of the show",
            "start": 0.12
        },
        {
            "text": "is so dope watch this anyway so that's what you guys have to look forward to um hopefully fingers crossed uh the intro will be coming out in October and then it will be a part of the show from that point on because it is an intro for the show but we're going to be able to get to show you guys that in October super excited about that and then episode 6 is coming imminently of course uh we mentioned to you guys we're the the the production timeline is still a little bit longer than we thought it was going to uh but we do have another group now that is working in the fold so we're able to work on two episodes at the same time very excited about that also for anyone who's a Patreon supporter we've got some fun behind the scenes stuff coming for you uh I'm experimenting with uh actually going through my workflow showing you guys my timeline uh and actually taking you guys through sort of um the animatics and kind of how some of the decisions that I tweaked to you know to to kind of",
            "start": 31.32
        },
        {
            "text": "going through my workflow showing you guys my timeline uh and actually taking you guys through sort of um the animatics and kind of how some of the decisions that I tweaked to you know to to kind of go from the animatic stage to the final stage and what I changed what I didn't change why I changed it and share sort of my method Theology and my mentality of how I work if that's of any interest to you guys whatsoever I don't know if it is but if it is those will be on Patreon shortly um and let me know if you guys like those I'll do more of them thank you again for all your support you guys rock my socks you allow me to hang out with Kevin Quello all the time Kevin is actually looking at his belly button right now so we're I'm going to go and we're going to see what's what's so important in there",
            "start": 72.6
        }
    ]
}