{
    "id": 2046,
    "video_id": "dzhmWxUBOcI",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Greg Loves Oceanhorn  - Kinda Funny Plays",
    "description": "Greg shows Tim a Zelda-like game called Oceanhorn.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1473868806,
    "duration": 1139,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to another Kinda Funny Plays. I'm Tim Gettys. I'm joined by GameOverGreggy himself, the first-person shooter Master. That's what they call me, Greg Miller. Thank you. Big fan over here. Greg was right. We were playing Oceanhorn: Monster of Uncharted Seas, right? I got a lot of questions. It sounds like a game that, no, why would you play this? But as you can see, I've played an hour and a half of it already, and I'm level three, so I'm much an expert as it say. Thank you, Kevin. Thank thing number one, it says press options. Yeah, I that CRA, can we bring back Start and Select? So hard to do that. Need. So it's Zelda. It is Zelda. There's my shield, there's my sword attack. I'm dashing around. But okay, so it's, but it's Zelda, but it's on the PlayStation 4, correct? But you're telling me, Greg, you're telling me that before this game was on the PlayStation 4, yeah, it was a mobile game. Yeah, as you may or may not know, as Colin and I say often, games don't exist until they come to a PlayStation platform. So",
            "start": 0.08
        },
        {
            "text": "me that before this game was on the PlayStation 4, yeah, it was a mobile game. Yeah, as you may or may not know, as Colin and I say often, games don't exist until they come to a PlayStation platform. So this popped up the other day and we're like, oh, this game looks like Zelda, cute. And I look into it and I download it. I start playing. I'm like, man, this is actually, this is good. You know what I mean? Like, I'm having fun playing this. I'm getting my gems. I got all these things. There you go. That's some of my XP. As you can see, I'm getting closer to level four right there. I got all these challenges to do. But I'm playing it and I'm like, well, this is, this is just Zelda. And it said like, they say the thing like, inspired by Zelda. And it's like, n****, you ain't inspired by Zelda, you're ripping off Zelda. But I started talking about it and then somebody hit us up and they were like, well, yeah, this game came out three years ago on iOS. We're like, what? And you go look and you're like, sure enough, **** it did.",
            "start": 44.88
        },
        {
            "text": "I started talking about it and then somebody hit us up and they were like, well, yeah, this game came out three years ago on iOS. We're like, what? And you go look and you're like, sure enough, **** it did. This is Zelda. There's puzzles, there's swords, there's enemies, there's all these things. But I love that. I love the just unabashed on this. Like the also the top-down kind of isometric look is very fitting for a Zelda game. We usually just get the either more straight top-down or the 3D. This is kind of somewhere in between. I'm liking this, Greg. Good. And I'm glad that I started you at a place I left off in with one of these bomb dungeons that I kind of was just exploring. I don't think I'm in the right spot, so I totally have to run around now, look like a ****, try to figure my way out, because I want to get you back to the, the, because on top of you're seeing the gameplay, you're seeing the dungeons. I don't know if we'll see any puzzles. There was one here that I got. Clearly, I was pretty good at it. Had to go",
            "start": 84.24
        },
        {
            "text": "you back to the, the, because on top of you're seeing the gameplay, you're seeing the dungeons. I don't know if we'll see any puzzles. There was one here that I got. Clearly, I was pretty good at it. Had to go more do this stuff. But uh, there's, you get, it's like a Wind Waker mashup of Zelda where you have a, you have a little ship, you go through, you shoot some stuff. Everybody's having a good old time. I saw you post on Twitter. Yeah, you posted a an image, a Tw, a Twitter video. It was a GIF. It was a video, a motion picture, as they say. Yeah, a motion pict. That looks like Wind Waker, but you're like, oh, it's on PS4. And then a bunch of comments like, oh, this is a mobile game. And I'm like, I'm so confused. What is happening? And then someone tells me that, oh, guess who did the score? Nobuo Uematsu. What? Nobuo Uematsu? If you don't know, I don't really like, really that if I said Nobuo Uematsu, that doesn't, I'd be like, oh, Japanese guy, he probably made a video game. Oh my God, Final Fantasy soundtracks, like all of them up until",
            "start": 122.96
        },
        {
            "text": "don't know. I don't really like, really that if I said Nobuo Uematsu, that doesn't, I'd be like, oh, Japanese guy, he probably made a video game. Oh my God, Final Fantasy soundtracks, like all of them up until modern times. We're talking Final Fantasy 1. Was he at the thing we hosted? 4? No. 5, 6, 7, 8, 9, 10. Now you're just counting. You're just counting. Yeah, uh-huh. That's how it works. He did the theme song for Super Smash Bros. Brawl. Okay, now, now you're talking. He's probably the most influential composer, video game composer of all time. Kondo is probably the only other one that Nintendo stuff. Did he do your favorite 11? Um, I, he did songs in 11, I think. I think. Anyways, he uh, he does stuff for this game. What's not clear to me, because it said another name that I was not familiar with just, just by uh, looking, reading it. Sure. Maybe if I heard it, I'd be like, oh, I know that name. But just reading, I didn't know who. So I'm not exactly sure if he just did the title theme or if he did the whole thing or what. I'm a",
            "start": 159.44
        },
        {
            "text": "it. Sure. Maybe if I heard it, I'd be like, oh, I know that name. But just reading, I didn't know who. So I'm not exactly sure if he just did the title theme or if he did the whole thing or what. I'm a little surprised that he would be working on a game of this status. What do you mean? You're trying to say mobile game? So games are games now, and you know that better. I do. I do. But like that, it sounds weird to me. But it's not a like a Square game or it's, you know, this like, who made this? Some kids? Just some kids? No, I forget their names. It's uh, that's what I'm saying though. Some kids don't, ain't gonna know Uematsu. Hold on. I'm gonna do some Googling because I want to, I'm very interested in this. I want facts. I want to give the people facts, because I'm sure they have just as many questions about me about this Zelda game. They got as many questions about me as I about them. You know what I mean? I know what you mean. I'm right there with you, bro. I'm one of them dumb kids. You are not one of those dumb kids.",
            "start": 213.4
        },
        {
            "text": "this Zelda game. They got as many questions about me as I about them. You know what I mean? I know what you mean. I'm right there with you, bro. I'm one of them dumb kids. You are not one of those dumb kids. You're very smart. So what's called Oceanhorn? Yeah, Oceanhorn. I don't have, here, here, I need a master key. I don't have one of those. I don't have a master key. Usually that leads to a master. I have to fight. I don't know where they got that idea, but it's pretty smart. Is this game now available for Xbox One as well? PlayStation 4 or Xbox One just came out uh recently, depending on we post this. I don't know. See what type of reviews it's getting. Very good reviews. Yeah, it's getting the nines out of tens. That's on the Steam or is that on the, started on, that's on the Steam, because one of our kids hit me up today was like, nobody's talking about this game. What do you think of it? And I say, you should buy it. You probably shouldn't quit the a dungeon you don't remember too well. That's how this happens though.",
            "start": 256.6
        },
        {
            "text": "was like, nobody's talking about this game. What do you think of it? And I say, you should buy it. You probably shouldn't quit the a dungeon you don't remember too well. That's how this happens though. Nobody Judge Greg. The, the, what's the point of this Let's Play, Greg? The point of this Let's Play is showing this game to people and being like, do you want to play this game? And it's not about you being good, it's about them being like, this is something I want to play. This is something I want to play. So here's what I think I got to do is I got to get one of these boxes, right? Mhm. And I got to, I got to push it. No, that's gonna be tough. I probably can't push there. So what's the little green above you? That's my stamina for, yeah, my run button. Because I was thinking if I can get up here, but that wouldn't work. Cornfox & Bros. is the developer. Mhm. Good name. All right. All right. It, this looks like one of those games. This guy, pronunciation, I don't know what I'm gonna do in here. Pron, pron, pron. Heikki Repo seems",
            "start": 294.08
        },
        {
            "text": "Cornfox & Bros. is the developer. Mhm. Good name. All right. All right. It, this looks like one of those games. This guy, pronunciation, I don't know what I'm gonna do in here. Pron, pron, pron. Heikki Repo seems to be like one of the, he's the designer, artist, and writer. Composers, we got Kenji Ito. Okay. I'm not sure if I know that. Nobuo Uematsu? Are you sure that Nobuo wasn't at the, the event? Because he sounds like a guy from the event. One of our dudes from the event. Nobuo Uematsu? He was not at the event. He was in a video at the event. Ah, okay. He was doing a Distant Worlds concert. Distant Worlds, fantastic. It's in Newtown. Go check it out. Um, Shimomura was happy event with us. She's the composer of 15 and Kingdom Hearts. Goa. Hold on. Maybe I can take this. The most beautiful thing I've ever done. The Let's Play is the most beautiful thing you've ever done. I don't know. Hopefully, here we go. Here we go. Getting to the bottom of this. The music of Oceanhorn was composed by Kalle Ylitalo, of course, which is the most impossible name",
            "start": 326.28
        },
        {
            "text": "thing you've ever done. I don't know. Hopefully, here we go. Here we go. Getting to the bottom of this. The music of Oceanhorn was composed by Kalle Ylitalo, of course, which is the most impossible name I've ever said. K. A. L. L. E. Last next word, L. Y. L. I. T. A. L. O. Nope. No. Nope. Uh, with a few additional compositions by Kenji Ito. So, so here's what's happening, Timothy. Mhm. Is I went into the bomb cave before they told me to go into the bomb cave. I'm wondering if I **** myself over. I get out of the bomb. That was not where I should have put that. I want to get there. That Treasure Chest. Kenji Ito, Sword of Mana. The Mana games. He, he was in the Black Mages with Nobuo Uematsu. That makes sense. There you go. You're, there's boxes. There's a treasure chest up here. I don't know if you're familiar with treasure chest in these kind of games. They're important. Can't push that one. And then that's a puzzle. Solid right there. Put on the board, everybody. Don't hit that blue thing, because it, thank you, Kevin, for your excitement. Tim, you",
            "start": 384.0
        },
        {
            "text": "kind of games. They're important. Can't push that one. And then that's a puzzle. Solid right there. Put on the board, everybody. Don't hit that blue thing, because it, thank you, Kevin, for your excitement. Tim, you can go to hell for not having any, for being dead inside. Because I'm gonna get some gems. There we go. You got a regular key. That ain't no master. Yeah, but there's a regular door back here to get. No, I'm gonna come down here and start some **** with these rats. What do you want? ****. Pick the wrong place to come. Bave. Hey, rat. Smack that rat. I like how it's even Zelda-esque like sounds. I'm telling you, man. Is it perfect? Is it a great game? No, it's a fun game. But I mean, why not? What's not great about it? I mean, it's, you know, it's pretty simplistic. It's a rip-off. Sorry to spoil it for you, Kev. Like, for some reason, see, like, this is one of those things like, I know this is gonna be important. I'm gonna get probably a bomb flame arrow or something I can use on that bad boy. Looking forward to that. I",
            "start": 439.24
        },
        {
            "text": "some reason, see, like, this is one of those things like, I know this is gonna be important. I'm gonna get probably a bomb flame arrow or something I can use on that bad boy. Looking forward to that. I like that he's blue. Yeah, no, it's very, I mean, hey, like, it looks a lot like a uh, Breath of the Wild, right? Yeah. Isn't that what they're calling it these days? Fresh air. Breath of fresh air. Breath of fresh air. Birth of a Nation. Birth of a Nation. N-no, not Birth of a Nation. That's a, that's a different thing. Here we go. Now we're gonna start some ****. Birth of a Nation with some **** up ****. I'm gonna be real. Yep. I don't remember what that, it's a book, right? About the America. It was one of the first ever movies ever made, and it was very racist. Weird, man. Destroy the wall. I get some bombs here. Giant centipede layer. Centipede. It just says centipede. What are the chances it's centipede? The fire puzzles. I'm not to keep, keep, man. Pretty on the nose about this. Yeah, straight up calling them puzzles. Not cloer",
            "start": 497.6
        },
        {
            "text": "centipede layer. Centipede. It just says centipede. What are the chances it's centipede? The fire puzzles. I'm not to keep, keep, man. Pretty on the nose about this. Yeah, straight up calling them puzzles. Not cloer of Trials or any weird ass ****. Tri. So we got to use that fire for sure. But first we got to smash these goddamn pot. Why the **** not? You know? Yeah, yeah, yeah, yeah. I know there's no roll. Uh, that's the one thing. I got the dash. You got the dash. You got the St. I know, but it's like, he hasn't learned the roll yet. You know as well as I do, there should be rolls. Rolls on rolls. Rolls. Weir. I like you way, way too together. Get out of here. There's a fire puzzle. Seems like you solved it. Well, we'll see. Nice. I like that you're adding the real, the realistic sound effect. It now I'm gonna get that Master keying. Okay, we get the camera spin. Y-I mean, come on, guys. You got, you telling me you got Nobuo and he couldn't figure out the ****? So I like this game a lot. I think awesome. Now here's we got to",
            "start": 533.76
        },
        {
            "text": "Okay, we get the camera spin. Y-I mean, come on, guys. You got, you telling me you got Nobuo and he couldn't figure out the ****? So I like this game a lot. I think awesome. Now here's we got to put some people on blast though. You ready? Yeah. Uh, you, I tweeted out the video, right? People, it's a mobile game. And then uh, Rainafar Brownman over on Twitch, he pops in and just says, Hey, I just streamed this for eight hours. Lots of fun. Then King of the haters, who wasn't a hater before it all, funky cool Medina, Louis Medina. CH. He goes, was anything like, I wasn't that great. I was like, Louis, you shut the **** up. You don't, if I wanted to know about how to dress cool, I'd talk to you. If I want to know what games are fun, I ain't gonna go talk to you. Lou knows his games, man. Man, he dresses like Drake. I'm not gonna listen to him. Yeah, but like, I mean, that's kind of, you know, racist. No, it is not. No, no, that is not. Kevin, bring up a photo of Louis Medina. What you trying to say? And tell me he does not dress",
            "start": 589.88
        },
        {
            "text": "gonna listen to him. Yeah, but like, I mean, that's kind of, you know, racist. No, it is not. No, no, that is not. Kevin, bring up a photo of Louis Medina. What you trying to say? And tell me he does not dress like Drake. I didn't say anything about his looks, his complexion. Can you get your hand away from the screen, please? Thank you. I was just called the racist, and we, I will not, I refuse to believe we live in a day and age. The Minority Report is saying it's fine. We do not live in a day and an age where I can't say a gentleman of ethnic background dresses like Drake, and that's somehow a race thing. The other last time I went to a party with him, he was in the outfit from that video with the colors. Hotline Bling. The video with the colors. You know what I'm talking about? Going after this centipede. Going down the hole. That pipi. That hole looks like there's some centipedes down there. I just want to see what's happening on these other places. Get in the ho. God. Everything floats down here. Now I'm looking",
            "start": 642.36
        },
        {
            "text": "the hole. That pipi. That hole looks like there's some centipedes down there. I just want to see what's happening on these other places. Get in the ho. God. Everything floats down here. Now I'm looking for my dad in this game, by the way. Look like, oh no, there's two of them though. Let's see if they think about these skulls. Oh man, now you're thinking with your head. Oh no. Get down and start whacking. Uh, there might be a trophy for that's why I have to tell my girlfriend all the time. All right. I don't get it. You're down there, start whacking it. And damn, look at these trophies I'm getting now, bro. Pulling that hat trick out. These like Buzzy Beetle looking dudes. Yeah. Defeat the sets of, you are the Exterminator. The game, very good with this trophies. Level four, Pilgrim. And that's what I, I didn't, I didn't, I haven't checked in on the Brownman's stream to see what's going on. But uh, the eight hours, that's a lot longer than I thought this game would go for. You know what I mean? The way I'm getting the",
            "start": 685.88
        },
        {
            "text": "didn't. I haven't checked in on the Brownman's stream to see what's going on. But uh, the eight hours, that's a lot longer than I thought this game would go for. You know what I mean? The way I'm getting the trophies and the level up here, this game looks like it fit right on home on that their PlayStation Vita. Oh no, I agree with that 100%. I thought you say as well. But NX kind of has its own Zelda. I'm actually interested in how this would play on a mobile game. Like a mobile, like uh, one of our fans put up uh, the Apple TV version. It's just like one button. Yeah, but I'm talking about the one true mobile platform. Mobile platform. Yes. All right, Kevin, you can leave. You can leave. Kevin, you can leave. Can they hear your comments? Your little, your little comments? No one can hear anything that Kevin's saying. Yeah, they can. So that was a mini boss. Oh, I'm, I'm assuming so, because you still have your master key. Well, I opened the door to get in. I think I'm good. Oh, are you still then? I think so. It's just like, it's like a",
            "start": 744.28
        },
        {
            "text": "token of appreciation. It's like a key to the city. Congratulations. Well then, where's your like item? Is this it? No, that's just a heart. I mean, you know, I didn't have to even go over here. I'm sure we the opposite way. There's gonna be some stuff going on. This is like a, I'm exploring, as they say. They call me Dora the Explorer. Captain. This is not boring. This is a Zelda knockoff. We're playing together. Everyone's enjoying it. They're like, trophies and Zelda on PlayStation. All right. They are like, why is it not on Vita? That is a great point. Because it should be on Vita. I'm very curious the history of this game. Like I said, his dad's missing. Mhm. That's kind of the history of what's happening. Oh, oh, there, see. Oh, it's bombs. We got bombs, everybody. Okay, there's some music. I'm down with that music. Well, yeah, we have",
            "start": 787.88
        },
        {
            "text": "like I said, his dad's missing. Mhm. That's kind of the history of what's happening. Oh, oh, there, see. Oh, it's bombs. We got bombs, everybody. Okay, there's some music. I'm down with that music. Well, yeah, we have the sound turned down. You anyway. So this makes you feel like you just did something. Sure. Accom. I just **** some **** up. Zelda-style on PlayStation 4 is Oceanhorn, which wasn't a real game until it came here. Yeah. Like if they want me to go that other way, you know I'm gonna go here. Oh God. Well, oh God. All right. You know what? We, you know, it's my first bomb. We're using it. We're learning. I'm okay. Safe back here. Thank you, Kevin. Oh, double treasures. We got treasure. Double treasure across the sky. He doesn't care. Seashell. Seashells. Oh, it's for cleaning your pot shells. She. Nope. No. Close. I mean, in the fact that like, we knew what you were trying to say. Yeah, we all did. Now I don't like that the crystals aren't different colors. You know what I mean? Give me some nuance there with like my Rupees. You",
            "start": 830.2
        },
        {
            "text": "fact that like, we knew what you were trying to say. Yeah, we all did. Now I don't like that the crystals aren't different colors. You know what I mean? Give me some nuance there with like my Rupees. You know how I love a good Rupee. You love, love a good Rupee. Damn. I give some bombs. You don't want to die. Got you want to **** die. Damn. Bombs. We got the bombs. I'm down with the control scheme. R. Shield. Right. Okay. Okay. I'm telling you, man. They're doing things right with this. Can you shield and walk? Yeah. Oh, you damn right. Can I think it might make it too easy? Because I can not only, I can shield and then swing out of the shield. Can you shield and sprint? No. No. That'd be safe. That's too much. Come on. How you gonna run? So you're going up to the Overworld here? Nope. Not the Overworld. The entrance. We're back up here where we, we kind of started. I got bombs now, which are important to everything. I want to see a field. Is there any fields? Sure. We're gonna get the hell out of here. Oh, those rats. And I'll take you",
            "start": 888.68
        },
        {
            "text": "where we, we kind of started. I got bombs now, which are important to everything. I want to see a field. Is there any fields? Sure. We're gonna get the hell out of here. Oh, those rats. And I'll take you to uh, bath rats. My least favorite type of rat. Bath rats. Kill it. Yeah. Seemed like he was just smelling you, you know? Yeah, I know. Not really trying to start ****. You never know when they're gonna start. You know what I mean? Really? I don't know. I, it's kind, I'm just talking about like the Bubonic Plague. You don't want that **** again. You don't. You don't. I've heard bad things about that. Kevin knows what I'm talking about. Hell yeah. Hell yeah, says Kevin. Hell yeah. He knows what I'm talking about when I talk about the Bubonic Plague. Y-hell yeah. I took a class in college called Disease! So I'm pretty well. As did I. Did you really? I did. It's a great class, wasn't it? It's called Disease! Hell. I also took a class called Sex! Guess. No, you did not. Guess",
            "start": 931.4
        },
        {
            "text": "I'm pretty well. As did I. Did you really? I did. It's a great class, wasn't it? It's called Disease! Hell. I also took a class called Sex! Guess which one I took first. You guys went to weird schools. I appreciate it. Yeah. State. Super odd. Are you making fun of me? What? No. No. Okay, cool. This is what I wanted to see. I want to get you water. You want to talk to this dude? There's towns people. Oh, yeah. Can you throw them in the well? No. Can you stab him? He fell into a hole and he climbed up quickly. Yep. That's what they all say. The Tim Gettys store. Mhm. Has kind of an Animal Crossing graphical look. Sure. I'll give that. I'll give you that. I like it. Well, ladies and gentlemen, this, don't you want to get, I want to get in the water. Let me get you the, come on. Oh, you the O wide vast seas that we've heard so much about. There we go. That ship doesn't look like a dragon, but I'll take it. Here we go. Because like, it's one of those, I, I feel like the game has no real",
            "start": 971.2
        },
        {
            "text": "oh, you the O wide vast seas that we've heard so much about. There we go. That ship doesn't look like a dragon, but I'll take it. Here we go. Because like, it's one of those, I, I feel like the game has no real business looking as good as it does. It has no business looking as good as it does or being as fun as it is. Because this, well, there was some other game recently on an island that I was like, oh, yeah, I'm, I'm looking forward to this thing. And I got it. I was like, oh, this is like, this looks like Wind Waker. It's the worst kind of thing. You know what I mean? And then when I got my hands on, I was like, oh, you know, this a lot of fun. And I wasn't exp. That one I didn't like. This one I thought was gonna be the same thing, right? I was like, that game looks pretty good. **** you. Now look at this guy over here. He's trying to, they're trying to hide. And then you shoot up these crates. Yeah. Get all the bonuses. Get all the items out of them. See my XP. Oh, there a floating island in the sky. Yeah. Oh, yeah. You know, Knuckles",
            "start": 1019.48
        },
        {
            "text": "to, they're trying to hide. And then you shoot up these crates. Yeah. Get all the bonuses. Get all the items out of them. See my XP. Oh, there a floating island in the sky. Yeah. Oh, yeah. You know, Knuckles from Sonic the Hedgehog. He comes from a floating island. All right. So this is Oceanhorn. This is cool. I see a single horn, but that's cool. We're Oceanhorn is the monster that we think killed our dad that we're like out after. Really? Yeah. Wait, so your dad's dead? You're not looking for him? No. Well, no, I'm sorry. My dad went out to fight Oceanhorn. We're not sure if his, we're charting the Seas. They're, they're still Uncharted, Kevin. Once they are charted, you'll know. You no, I saw, I saw a map. They're charted. See, I got to do this. Got Tickle Town. Tickle the town sheriff. Tingle's there. Ladies and gentlemen, this is Oceanhorn: Monsters of the Sea. You can get it now on PlayStation 4, Xbox One, PC, and mobile devices, apparently. Um, yeah, this looks super dope. I'm excited. I'm happy that games are looking this good",
            "start": 1061.8
        },
        {
            "text": "is Oceanhorn: Monsters of the Sea. You can get it now on PlayStation 4, Xbox One, PC, and mobile devices, apparently. Um, yeah, this looks super dope. I'm excited. I'm happy that games are looking this good and come out on PS4 and come out years ago on mobile and we don't know the difference. Let's see if I can, if, let's see if what. Happ. Impressive. Hold on. I'm gonna blow that thing up. See if I get some. Nope. Didn't work. All right. Bye.",
            "start": 1108.84
        }
    ]
}