{
    "id": 2062,
    "video_id": "oMGwFD1N7sM",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Games Set In Specific Time Periods - Kinda Funny Gamescast Ep. 86 (Pt. 3)",
    "description": "If we could make a game set in any time period, what would it be?\n\nThanks to Casper for sponsoring this episode. Go to http://www.casper.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1474462806,
    "duration": 722,
    "transcript_chunks": [
        {
            "text": "third topic of the day brought to you by Patreon. You can go to patreon.com/kindafunnygames and support us just like my boy Mike Lynch did. Mike Lynch has a question for us. Okay. He says \"I was wondering if you guys could think of a genre of game and a time period you would like the game to take place and what studio you would like to make it. For me I'd like a first-person open world RPG in the vein of Fallout 3 made by Bethesda during the Revolutionary War. Thanks guys. Keep up the good work.\" Uh the game that I the one game that I I thought deeply about making and I wouldn't make it but I mean like if I were to make a game this was on we were at IGN was a strategy role-playing game economic game set in the revolution that was on that I that I wanted on DS. Um and I think it's funny because there was a I I don't know if it ever came out. I don't know what happened to it. I remember being at reaching out to these guys. There was a Kickstarter game that was like a",
            "start": 0.13
        },
        {
            "text": "think it's funny because there was a I I don't know if it ever came out. I don't know what happened to it. I remember being at reaching out to these guys. There was a Kickstarter game that was like a Japanese role-playing game style title set in the American Revolution and it looked **** awesome and they would not return my emails. I was like I I like I don't know if it's cuz I worked at IGN or what what it was but I wanted to like talk to them about their game. I think the American Revolution I agree with him is a a place ripe for good storytelling. We got a little bit of an Assassin's Creed 3 which I think that from a presentational standpoint they **** nailed it. Um but I always I always thought a mildly supernatural so not quite Final Fantasy Tactics not overt magic use and crazy creatures and stuff but like some sort of like kind of supernatural grid-based turn-based strategy role-playing game set in the Revolutionary War with the and you play with the Patriots and the",
            "start": 55.32
        },
        {
            "text": "creatures and stuff but like some sort of like kind of supernatural grid-based turn-based strategy role-playing game set in the Revolutionary War with the and you play with the Patriots and the Rebel and the Rebels. Um or the Patriots rather in the Redcoats I think would be **** awesome. Be totally awesome. like some weird mysticism in there that would allow it to be more fun than shooting just a musket you have to reload for 45 seconds. Um which would you know was the reason why you can't have a first-person shooter in that era for instance. Um so I agree with him. I think that that would be a great time to explore. I think that would be a compelling time to explore especially now. Um and you know I I it's probably done on PC a little bit that you know but we don't see that in the console space at all. I can't think of one game that took place in the American Revolution other than uh than Assassin's Creed 3 on console. Well I could be wrong but I'm sure maybe it",
            "start": 91.52
        },
        {
            "text": "that in the console space at all. I can't think of one game that took place in the American Revolution other than uh than Assassin's Creed 3 on console. Well I could be wrong but I'm sure maybe it exists but I can't think of it. So third person action adventure. I would I'm giving this to Sucker Punch. I'm giving Sucker Punch this. So think Infamous right? And I'm going to stick with superheroes. I'd want it to be in the 30s 40s New York/Metropolis whatever. But that style of of superhero game in that genre. And we'll just say Superman. It's Golden Age Superman right? So he can't fly. He's just leaping over tall buildings in a single bound but the buildings look awesome. It's in New York. We've got those **** suits with the huge shoulder pads and the press hat and all this other stuff and talkies like that you know? So dine New York blah blah blah like that kind of **** going on. But like a throwback to like yeah the 30s 40s even roaring 0s if we want to get weird",
            "start": 126.8
        },
        {
            "text": "stuff and talkies like that you know? So dine New York blah blah blah like that kind of **** going on. But like a throwback to like yeah the 30s 40s even roaring 0s if we want to get weird with it and go you know what I mean? But like that kind of world to exist in and like you see it I I like period pieces in Americana and that's one of the things where I was excited for Assassin's Creed 3 being in the you know over here and this is this cool part of history but it didn't work in terms of where I wanted. I'd rather see Assassin's Creed do something like that in the booming city. This is what's happening. We're going down. You know what I mean? Like Model T kind of cars going. And you get that if you're doing the Superman one right? Him from Action Comics #1 or whatever smashing that car. You know what I mean? Like having it out there and having that be the stylized world you're in. And have it be like a Max Fleischer cartoon or whatever. Have that be the art style and",
            "start": 166.88
        },
        {
            "text": "that car. You know what I mean? Like having it out there and having that be the stylized world you're in. And have it be like a Max Fleischer cartoon or whatever. Have that be the art style and have that be the characters and have that you know girls in those pencil skirts and that kind of outfit and being in that version of America which I don't think has been explored long enough or well enough. games like you know our mafia games will take us back closer to that time not in that time but close to that time and have us exist. But to be able to be around that and have like exist in New York and tell maybe you know don't don't even do Superman just do a superhero period piece in that kind of world and what that would look like and what's going on and dealing with corruption and the mob and that kind of thing. I think that'd be cool. Yeah this is like the most copout answer ever but because I'm using a already established franchise and people have talked about this specific",
            "start": 202.32
        },
        {
            "text": "mob and that kind of thing. I think that'd be cool. Yeah this is like the most copout answer ever but because I'm using a already established franchise and people have talked about this specific thing for so long but I would absolutely love a Romeo and Juliet-esque Zelda where it's Zelda future stuff. I want Aona to be a motorcycle him using guns instead of a sword. Like that type of stuff. I can't even imagine the the **** kid. Sorry. I can't imagine I I I couldn't I couldn't imagine the uh the **** furor if they ever did something like that. I think that would be awesome. That sounds awesome. But man people would lose it if they did that to Zelda. They would lose their minds whatever. I'm like I think it'd be super cool. I think it would be cool too. And I think that it would allow them uh to really update things and give us the same thing that we know and love the same type of gameplay and the same type of adventure and feel but kind of just give it a different tone.",
            "start": 237.52
        },
        {
            "text": "allow them uh to really update things and give us the same thing that we know and love the same type of gameplay and the same type of adventure and feel but kind of just give it a different tone. And I think that Zelda with a different tone could go a very long way. I don't want futuristic **** I want it to be kind of set in present. Okay. Right. But like a dark present. So or or a dark present and a light present. Like that's the thing is Zelda gives you the the room to you know most the the best Zeldas have the kind of dichotomy between the the same world and whether it's the past and uh future or dark side light side whatever it is. I think that uh if you ran with that there's so much things you can update in in cool little clever ways that most are just you know stupid little nods and like \"Oh I see what you did there.\" But I think that that would kind of shift everything to really get me super interested. Uh I think that the Zelda that we're getting now is a a really",
            "start": 285.84
        },
        {
            "text": "nods and like \"Oh I see what you did there.\" But I think that that would kind of shift everything to really get me super interested. Uh I think that the Zelda that we're getting now is a a really good kind of step back to move forward. Like it's kind of going back to the beginning to then push ahead. But I think something like I'm talking about would just be more of like a um alternate universe thing. And this doesn't need to be like I' I'd like it to be mainlined in the sense of it's this is a real Zelda Zelda whatever but like it doesn't need to be like in the the story line or whatever. It can be completely non-canon. When you started I thought you were going to say uh Feudal Japan Assassin's Creed the one that people have been banging the drum for forever. Assassin's Creed with samurais and stuff. Yeah that that's good too. Or an Onimusha game in Paris would be cool. Any Onimusha game generally would be nice. They put it on the **** moon for all I care at this point. I just",
            "start": 331.36
        },
        {
            "text": "samurais and stuff. Yeah that that's good too. Or an Onimusha game in Paris would be cool. Any Onimusha game generally would be nice. They put it on the **** moon for all I care at this point. I just want I just I can't believe I don't even want to get down on this road again. It's so annoying to me that we haven't had a game. It's been 10 years. Yeah it's upsetting. Dawn of Dreams came out right? That was what it was called in in uh 2006 I remember. It might even been 2005. I think it was five. Uh yeah fall 2005 I think. You're right. So it's been over 10 years. I don't know what the **** they're thinking with that. The new the new Zelda game. I I It sounds cool. I mean just speaking generally on the NX Zelda like I was thinking about it recently. I'm like you know I'm kind of stoked about this game. Like it's it's uh it's strange. Like I remember when we played at E3 I'm like \"This is strange. This doesn't even feel like Zelda at all. It's way more mechanically",
            "start": 373.76
        },
        {
            "text": "of stoked about this game. Like it's it's uh it's strange. Like I remember when we played at E3 I'm like \"This is strange. This doesn't even feel like Zelda at all. It's way more mechanically complicated than any Zelda game I've ever played in my life which is cool.\" Like it just it looks fun you know? I I was like \"Yeah I'm I mean I'm going to buy an NX. As long as they don't as long as they don't **** it up you know I'm going to and put that analog stick below the face buttons where it belongs.\" Then other than that um yeah I'm stoked about it. So just as an aside since you brought up Zelda I was thinking about that recently. The game looks game looks **** cool. No that's what I keep going back to in the fact that we have a flight on Sunday and **** it'd be nice to play Zelda on that flight. Just sit there have a real have a full-fledged game that isn't you know my visual novels that I that I'm getting on my Vita over and over again. Well speaking of",
            "start": 410.4
        },
        {
            "text": "to play Zelda on that flight. Just sit there have a real have a full-fledged game that isn't you know my visual novels that I that I'm getting on my Vita over and over again. Well speaking of that though uh another game that I thought would be really cool would be an RPG set in American high school. We get a lot of Japanese high school things and stuff. But I would love uh a real RPG set in America early 2000s. So when I was in high school you know that's what I want. I just want cuz like excited for YIIK. Playing Emily is Away. Like I love that idea. And if they took that but actually fleshed it out and made a RPG out of it I think that there's so so much you can do there. um gameplay mechanics involving downloading music and making mixtapes for girls and like really getting into it. That does sound good. You got to play Saturday Morning RPG like that game. It's on Vita. It's on PS4. You should that's it's exactly",
            "start": 446.72
        },
        {
            "text": "music and making mixtapes for girls and like really getting into it. That does sound good. You got to play Saturday Morning RPG like that game. It's on Vita. It's on PS4. You should that's it's exactly what you're describing. All right let me get like and a lot like you it takes place in school but like you're it's more 80s-ish so it's not quite like the era you want. I like the gameplay of making mixtapes but the mechanics are cool. Like you like you have a bunch of different weapons that are like based like you have a ruler or like um like a compass that you would draw circles with and like they all have different rules and stuff attached to them. A compass. A compass. Uh that No I need a compass you know like a computer. So uh so like it's you should look at that game is really cool. You should look into that game. Um yeah it's really it's a really really neat game. I think you it's five episodes. You can beat each one in like a few hours. Not even. Cool. Very cool.",
            "start": 492.56
        },
        {
            "text": "should look into that game. Um yeah it's really it's a really it's a really really neat game. I think you it's five episodes. You can beat each one in like a few hours. Not even. Cool. Very cool. Let's both play it on our flight. I'm down. The other another idea I've had for a long time and it's just Transformers but if you took the Transformers IP out of it I don't feel like we've ever gotten a really really good fun mech game that's not overly complicated. Uh Zone of the Enders is is close for what I'm talking about but even that it was it ended up being um either a bit too convoluted in the controls or in like number two went a little too far down the anime hole. Uh which was the is the other thing of like we haven't got a mech game that I feel like doesn't either do do that as well. Um I would want a game that is based in like steampunk era times like when like the with trains and all that stuff but it's it's Transformers but they're not Transformers. There's robots that",
            "start": 536.24
        },
        {
            "text": "Um I would want a game that is based in like steampunk era times like when like the with trains and all that stuff but it's it's Transformers but they're not Transformers. There's robots that turn into things and the robots in disguise. Uh but actually really sticking to the robots in disguise part of it. So it is a stealth game but you're this giant ass mech but you have to get places without people seeing you. So you have to be really careful about um people finding you. But because it's like back then information doesn't travel that fast. So if people find you in the woods and you're a train you're okay. You got a while to get out of that area and like then those people would be like \"Oh we saw this like giant robot thing.\" And then people wouldn't believe them and stuff. I haven't thought too much about this. Yo there's trains going through the woods with no tracks. But like with with the trains or cars or like planes what they were back then and all that stuff. So I",
            "start": 582.48
        },
        {
            "text": "haven't thought too much about this. Yo there's trains going through the woods with no tracks. But like with with the trains or cars or like planes what they were back then and all that stuff. So I think that uh it could be cool but it's it's stealth based and it's more about like the these alien creatures that transform into things but like they're trying to escape. I don't know what but I think I think it'd be fun. I think that there's there's a lot to be had there. And like we never we don't get too many games in that world. Uh recently on what was the game you were playing? The dig. The SteamWorld Dig. Oh SteamWorld Dig. And then there was the other one SteamWorld. SteamWorld Heist right? Whatever. Yeah those are cool but I'm talking a bit more. I not played I have not played Heist yet. It's supposed to be excellent. I have not played it yet. Any other ideas? I'm all out. No. Do you have any ideas Big Kev Dog? No. No. No. No. Never get enough 80s games. Always a fan of",
            "start": 622.28
        },
        {
            "text": "Heist yet. It's supposed to be excellent. I have not played it yet. Any other ideas? I'm all out. No. Do you have any ideas Big Kev Dog? No. No. No. No. Never get enough 80s games. Always a fan of 80s games. Yeah. Neon. What was it? The Blood Dragon. Far Cry. Oh yeah. Yeah. Far Cry. Blood Dragon. That type of stuff's awesome. Yeah. It's It'll be interesting to see with like the success of Stranger Things. I'm not going to say the stupid one. I want to make fun of Stranger Things and then Oxenfree. If you'll see more games coming up that are in akin to Goonies akin to hey here are normal kids in this situation. How do we that's popular right now the call back to the 80s or just being younger and being in high school. How do we take that and put that into a video game and make it different and not have it be you know it's no offense to Oxenfree but how simplistic that is. What if you did do it and you did an RPG about it? You did do a class-based thing where you're moving",
            "start": 659.92
        },
        {
            "text": "it different and not have it be you know it's no offense to Oxenfree but how simplistic that is. What if you did do it and you did an RPG about it? You did do a class-based thing where you're moving around and doing this. I think Life is Strange also kind of falls into that. category. Cool.",
            "start": 706.64
        }
    ]
}