{
  "id": 2041,
  "video_id": "Rsf3bB6c2-g",
  "show_name": "Gamescast",
  "hosts": [],
  "title": "Deus Ex: Mankind Divided Review - Kinda Funny Gamescast Ep. 85 (Pt. 1)",
  "description": "Nick reviews Deus Ex: Mankind Divided.\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/gamescast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1473685202,
  "duration": 1328,
  "transcript_chunks": [
    {
      "text": "This episode of the Kinda Funny Gamescast is brought to you by the Dollar Shave Club. Guys, you don't need to choose between price and quality to get an amazing and affordable shave. DollarShaveClub.com is the answer. To prove how amazing their shave really is, right now they're going to give you your first month free to join the club. DollarShaveClub.com delivers amazing razors right to your door for a third of the price of what the greedy razor corporations charge. Join the club just like I did earlier and stop dealing with the drugstore hassle and battle locked up razor fortress ever again. I've been using them, I've been liking them, they've been keep clean for packs. Just go to Dollar Shave Club and pick a razor from their lineup of amazing blades. I have tried the Executive Blade with their Dr. Carver's Shave Butter. The blade just gently glides for the smoothest shave ever. See why over 3 million members like me love Dollar Shave Club. They're so confident in the quality of all their products",
      "start": 0.08
    },
    {
      "text": "Carver's Shave Butter, the blade just gently glides for the smoothest shave ever. See why over 3 million members like me love Dollar Shave Club. They're so confident in the quality of all their products that now you can get your first month of the club for free, just pay the shipping. After that, it's just a few bucks a month, no long-term commitment. So you know, if you're one of those people that are that are scared like Nick, it's okay, no hidden fees. Go to DollarShaveClub.com/gamescast. That's DollarShaveClub.com. What's up, guys? Welcome to the first ever episode 85 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, one of them at least, Nick Scarpino and Greg Miller. Colin Moriarty is out there doing fantasy football stuff, but we're recording this in a weird ass out of order, out of sync thing. So topic one, we've done topic two, three, and four, which you will see shortly. We're recording topic one now because I wanted to bring Nick Scarpino, the",
      "start": 38.2
    },
    {
      "text": "in a weird ass out of order, out of sync thing. So topic one, we've done topic two, three, and four, which you will see shortly. We're recording topic one now because I wanted to bring Nick Scarpino, the Producer Seducer, on. Yes, sir, to talk about Deus Ex: Mankind Divided. I'm pretty excited about it. Before we get to that, Nick, I got to do the whole rigmarole. I apologize. This is Gamescast, the first what segment? I forgot. I'm sorry. It is the first segment. That's why you're introing the show right now. Makes sense. You ever hear an intro the show before? No. Don't listen to this show. Black it out. Started thinking about what I'm going to say. This is the Kinda Funny Gamescast. Each and every week we get together to talk about video games and all the things we love about video games and NeoGAF threads and forum discussions and Facebook posts and press conferences of which there was a whole bunch today, uh, as of the time recording this, the the PlayStation, the amazing PlayStation conference occurred. PlayStation",
      "start": 95.0
    },
    {
      "text": "and Facebook posts and press conferences of which there was a whole bunch today, uh, as of the time recording this, the the PlayStation, the amazing PlayStation conference occurred. PlayStation Meeting 2016. Never. PlayStation 4 Pro didn't even have a hype video to start it off. They didn't even care. Like, fuck it, fuck it. It was a meeting. It was a very serious business meeting. Oh, yeah. They're like, what are business meetings? Have no fun. Perfect. That's what we want. Nailed it. Demos. But their tech demos got it. That reminded me like the duck, remember the duck play Super Rub'a'Dub? Pone. Yeah, Super Rub'a'Dub the game. Yeah, that was a thing. All I did, the only thing I saw from it really was like, I tuned in for like the Mass Effect demo. Mass Effect looks good. It looks really good. And then when right when it got exciting, they stopped it. They're like, things are about to explode. And then they're like, cool, that's it. That's all you get. Cut that in 2017. Literally stunning. So I don't know. Yeah, I you guys this, do I",
      "start": 142.04
    },
    {
      "text": "exciting, they stopped it. They're like, things are about to explode. And then they're like, cool, that's it. That's all you get. Cut that in 2017. Literally stunning. So I don't know. Yeah, I you guys this, do I need a PlayStation Pro? Do we all have to upgrade? Of all people, you don't. Beautiful TV. You have a PlayStation 4, right? Yeah, yeah, you're all set. Yeah, well, here's what I want to float real quick, 'cause I didn't bring this up in the live stream because I was falling asleep, uh, and it might have already, while we've been doing this, maybe it's been confirmed, denied one way or the other. Mmm. It sounded like the guy in Mass Effect was Nolan North. Oh, playing a little bit younger and a little bit less Nathan Drake. Could be 100% wrong. The only reason I bring it up is because if you remember, while they were doing Uncharted 4, there was an article that was like from Variety, I want to say, maybe somebody else, but it was a long form profile in Nolan North talking about his career and what he is is, and he told the",
      "start": 188.44
    },
    {
      "text": "Uncharted 4, there was an article that was like from Variety, I want to say, maybe somebody else, but it was a long form profile in Nolan North talking about his career and what he is is, and he told the interviewer, um, yeah, you know, and I just got a call and I could, I thought he said Warner Bros. got a call from Warner Bros. and that's going to be the next decade of my life. And everybody was like, what does that mean? And and there's all this speculation about what it was and then nothing. I know, never really talked about it again. I don't think it's been revealed what it would have been. But then I saw, I when I heard him today, what I thought was him today, 'cause we're listening off speakers off the thing. Maybe I'm totally wrong and it's not him at all. We have a 50-50 shot. Yeah, it's either him or Troy Baker. So, well, it wasn't Troy Baker. I have a pretty good ear for everybody. I thought, I'm like, that sounds like a Nolan. And that would make sense for if they're doing another trilogy of BioWare. But then",
      "start": 229.64
    },
    {
      "text": "or Troy Baker. So, well, it wasn't Troy Baker. I have a pretty good ear for everybody. I thought, I'm like, that sounds like a Nolan. And that would make sense for if they're doing another trilogy of BioWare. But then that doesn't make any sense for why he would have said Warner Bros. That because they were all thinking it was a Superman game. That's why I remember this. If you want to get the show early, you can go to Patreon.com/KindaFunnyGames. Throw some dollars, get a whole bunch of goodies. You know how that works. If you don't, you can go to YouTube.com/KindaFunnyGames. Get a little free trial, a free little demo, free to play, free to watch. It's free. It's just free. Free to love. You can enjoy it. Free to love. We ain't letting none of that YouTube censorship get in our way. Fuck, fuck you. I can say whatever I want. Isn't that damn right, Kevin? Kevin, can I get, can I get a report on that? You YouTube and your censorship say, fuck YouTube. I mean, come on. Maybe it's just misunderstood what they meant, you know, you",
      "start": 266.2
    },
    {
      "text": "isn't that damn right, Kevin? Kevin, can I get, can I get a report on that? You YouTube and your censorship say, fuck YouTube. I mean, come on. Maybe it's just misunderstood what they meant, you know, you didn't think about that, did you? That's maybe they just misunderstood what's going on. It's like the Fine Brothers. Maybe it was just a misunderstanding. No, all jokes aside, definitely go check out Freddie Wong's article on Medium that he wrote about like really detailing the whole YouTube censorship thing. We haven't got into it on any of the shows. I don't think we even need to. I don't think, yeah, I don't think there's anything we could add to this discussion because I can't add one thing. Freddie Wong is my pickle bro. And I'm upset that you didn't introduce him as such. What up, pickle bro? It's a weird thing to do, weird thing to say. You know what that means? It means we both like pickles a lot and we ate pickles a lot in Austin. Remember that time you gave, you made me do a pickle chaser for after a shot? I",
      "start": 299.72
    },
    {
      "text": "to do weird thing to say. You know what that means? It means we both like pickles a lot and we ate pickles a lot in Austin. Remember that time you gave, you made me do a pickle chaser for after a shot? I almost threw up. If anybody wants some fun tonight and is a legal age or Mom and Dad are at the ball, don't do that. Don't do that. No. Where the parents go? I don't fuck know. No. Next time you're at a bar, ask for a shot of Jameson with a pickleback. It sounds gross and it's delicious and amazing. It's delicious and amazing. It's disgusting. You know what my topic is for GameOverGreggy tomorrow? Then picklebacks. Are we you going to make us do picklebacks? What you want to do? Yeah, the paint can was actually pretty good. Trust. Picklebacks are amazing. But the pickleback was, what did you say over there, Kev? Say, could we do paint can right? Can we do paint can right? Yeah, we correct. You didn't drink paint can. No, you guys didn't drink at all. We drink all. Yeah, fingers in the can drink. That's what I'm saying.",
      "start": 338.96
    },
    {
      "text": "could we do paint can right? Can we do paint can right? Yeah, we correct. You didn't drink paint can. No, you guys didn't drink at all. We drink all. Yeah, fingers in the can drink. That's what I'm saying. Let's do it right now. Not right now. Now I'm saying picklebacks on GameOverGreggy show. All right, Kevin. So, Nick, yes, we're having you on because the the one game a year that you play through has has it's come and gone. Deus Ex: Mankind Divided has happened. You've played it. I have. You've played it a whole bunch. Yeah, you've talked about it a lot. Greg, you did multiple Let's Plays and streams. I've done Let's Plays, I've done streams, I've done panels over many PAXes. Have I been saying it wrong all the time? I say Deus Ex and you're saying Deus Ex. I used to say Deus Ex. Really? I say Deus. Yeah, Deus Ex. Is it Deus Ex? Is it short? It's definitely not Deus Ex. Yeah, that we know for sure. I thought forever it was Deus Ex. And you're a fuck liar if you didn't think it was Deus Ex. True. When you knew that for the longest time, I thought",
      "start": 378.76
    },
    {
      "text": "is it short? It's definitely not Deus Ex. Yeah, that we know for sure. I thought forever it was Deus Ex. And you're a fuck liar if you didn't think it was Deus Ex. True. When you knew that for the longest time, I thought it was just short for Deus Ex. And then Greg told me that was that was a game and an indie film that was squashed together. Say the way you're saying it again. Deus Ex. Deus Ex. It might be Deus Ex. I mean, now you say it and like he says it and he knows a whole bunch of random facts. It could be Deus Ex. You say Deus Ex. Is there anyone that we can like figure this out? Yeah, I'm sure we have friends that work on the game. Get get on it. Anyways, well, Greg's doing that. Yeah, I want I want kind of to do a review discussion of this game. You know, you know how we, I don't know if you knew this, Nick, but we do reviews over here, games. I want to know, should people play this? What do you think about it? How does it compare to um Human Revolution that came out last generation? Give me your thoughts. Yeah, so Human Revolution, I think it's a uh definitely",
      "start": 426.36
    },
    {
      "text": "to know, should people play this? What do you think about it? How does it compare to um Human Revolution that came out last generation? Give me your thoughts. Yeah, so Human Revolution, I think it's a uh definitely worth playing. Um, I enjoyed it a lot and a lot more than I thought I was going to, uh, given that my first couple Let's Plays and experiences with it looked somewhat like um a child trying to hunt a boar. It was just I got slaughtered every single time. Um, but what I have to, what you got to remember, say it your way. Deus. Deus. Like Deus or Deus. Right? Okay. Like Deus. Not Deus. It's Deus or Deus or Deus. Not like Goose. Spell Goose for me. Deus. Um, no, I really enjoyed it. I had a great time playing it. Um, and I actually kind of want to go back and do a couple more Let's Plays now that I remembered and kind of trained myself to play the game because it's very different. It relies largely on stealth, which as you know, is not my forte. Stealth is not stealth and me and don't necessarily mix. So I played this the",
      "start": 475.16
    },
    {
      "text": "trained myself to play the game because it's very different. It relies largely on stealth, which as you know, is not my forte. Stealth is not stealth and me and don't necessarily mix. So I played this the same way I had to had to play Human Revolution, which which is the first 5 hours of the game for me were were just torture until I leveled up my augmentations enough to the point and found the correct weapons and kind of level those up as well, um, to the point where I could just take out anything that came into my way. And then you just start to feel like a god and it's super fun. Um, but that that's that's kind of the, it's kind of one of the reasons why I like the game is, you know, uh, you get the opportunity to go about things multiple ways, right? You can you can take all the enemy as head-on if you want, bottleneck them and take them out one by one. And you're going to, you know, you're going to go down in life, you're going to waste a lot of your resources, but ultimately you're going to regain",
      "start": 525.88
    },
    {
      "text": "you want, bottleneck them and take them out one by one. And you're going to, you know, you're going to go down in life, you're going to waste a lot of your resources, but ultimately you're going to regain those back when you pillage their bodies for for spoils. Or you can sneak around them. Or you can go above. You know, there's all sorts of different ways you can go about things. And I and I love that freedom in this game. Um, it's one of the reasons why I I was drawn to Human Revolution originally, just because I like the style of it. And I was like, oh, I want to kind of, you know, every once in a while I'll jump into a game that I know I'm going to be in for like, you know, 10 to 20 hours. Um, largely I usually play games at about four to 5 hours 'cause I have the attention span of a of a like a gnat. But um, every once in a while I throw myself into these, which is funny, 'cause Greg even commented when when I first started playing Let's Play, he like, this is the strangest game for you to play because it takes a lot",
      "start": 566.64
    },
    {
      "text": "once in a while I throw myself into these, which is funny, 'cause Greg even commented when when I first started playing Let's Play, he like, this is the strangest game for you to play because it takes a lot of attention. There's a lot of things you have to go through to actually get the story correct. You have to go through all the emails and all the pocket secretaries and all everything you can find in the world adds to this grand story that they're telling. Um, and you know, I think Greg was correct in assuming that that would completely just baffle me and that I would lose like lose, you know, attention. It it was always such, you know, you're always, you play like, maybe I'm not, it's not joking like an insult, you play like a meaty, you play like three or four meaty games a year, right? Like last year it was Metal Gear, Axiom Verge. You like spent hours and hours with these things. Arkham Knight. So when you were like, when you were like, oh, Nick, I loved Human Revolution. I was like, really? Like, I would never in",
      "start": 601.48
    },
    {
      "text": "Metal Gear, Axiom Verge. You like spent hours and hours with these things. Arkham Knight. So when you were like, when you were like, oh, Nick, I loved Human Revolution. I was like, really? Like, I would never in a million years pegged you as like the Deus Ex guy. And Square Enix is confirming Deus Ex. Deus Ex. Okay. Because I was like, man, I that seems like something someone would have corrected me on on the 30 Deus Ex panels I've done over the last 3 years. Makes sense. So we will say that from now on. Let's all say it together. Deus Ex. He's the only one saying it weird. You were right. You were right there. I I'm more on the Tim front. Deus Ex. I just wanted, we could have thrown him under the bus, but you for your little boyfriend. Every um, yeah, no, I mean, I think it to answer your original question, I think it holds up very well. Obviously, I think it's a fitting sequel or I guess it's what is the third or fourth still sequel? Yeah, I guess it's sequel in the series. So, um, I liked it a lot. It's it's it's gorgeous. The game design is",
      "start": 637.6
    },
    {
      "text": "I think it's a fitting sequel or I guess it's what is the third or fourth still sequel? Yeah, I guess it's sequel in the series. So, um, I liked it a lot. It's it's it's gorgeous. The game design is great. I'm still, you know, I'm going back and doing a new game plus right now. I'm just still floating around Prague, which is where you're primarily centered. That's kind of like the hub area where, you know, you can go. All the vendors are there and all the side quests are pretty predominantly held, you know, or played out in Prague. And then you go to other cooler areas like London and some other stuff, um, to do the actual bigger story missions. Um, but I'm going back now because I'm tanked up like a fuck. Like I'm just like all my guns are leveled up, all my augs are leveled up. Greg's tweet the other day where like, I'm going to do my Let's Play, my my stealth playthrough. And it was all these fuck guns and grenades. Yeah, I mean, that's it's uh, like as try as I would, as as I have, I cannot. I just don't have the",
      "start": 683.44
    },
    {
      "text": "I'm going to do my Let's Play, my my stealth playthrough. And it was all these fuck guns and grenades. Yeah, I mean, that's it's uh, like as try as I would, as as I have, I cannot. I just don't have the patience for stealth. And when you have every gun in the game and it is tremendously powerful, it's it's like a fuck drug, man. You just you're just looking at that guy over there and you're like, why am I sneaking around you? Why am I afraid of you? You should be afraid of me. You should be afraid of me. Fuck. And let me tell you why. Yeah, exactly. Robot dick punch. Yeah, go leveled up dick punch. Um, no, but it's super fun. I like it a lot. And anyone that's the fan of the series, obviously, you've probably played already. If you haven't, get off your ass and go play it. It's really fun. But they, I'm sorry. So like, I know Colin and I got turned off to Human Revolution based on controls. I jumped in. The battery thing was weird for me in the Let's Plays we had done, uh, uh, here on Kinda Funny, right? I didn't feel",
      "start": 718.92
    },
    {
      "text": "I know Colin and I got turned off to Human Revolution based on controls. I jumped in. The battery thing was weird for me in the Let's Plays we had done, uh, uh, here on Kinda Funny, right? I didn't feel like I was that limited. And granted, I was playing a little bit further in your save. Did they address that in your opinion? Uh, well, the controls are completely different. Okay. So you can right when it starts, it asks you if you want to do the new control scheme or the Human Revolution. And pick the new one. It's it's much better largely because I think, uh, if I remember correctly, in Human Revolution, you had to click in one of the sticks to aim. And that was the worst. Now it takes a little getting used to. And that's one of that's one of my only gripes about the actual control scheme is that the to cover, you have to click in the stick, which when you're in a firefight, inevitably you end up vaulting over fuck for the first like three hours of the game and getting your head shut off. Sure. Um, because",
      "start": 760.6
    },
    {
      "text": "you have to click in the stick, which when you're in a firefight, inevitably you end up vaulting over fuck for the first like three hours of the game and getting your head shut off. Sure. Um, because you just you have to just kind of settle down, breathe, and get through it 'cause every every single thing is everything the controller does is a vital component to your survival in the game as opposed to a normal first person like Doom for instance, where you're like, I don't have to really worry about the trigger. That's pretty much it. Yeah, everything else take care of itself. Um, but yeah, but I liked a lot. Um, I'm going to go back and play more of it, I think tonight. And probably I'm losing steam on it pretty quickly though, because I have beat it. Um, and again, it's it's another one of those games where your choices actually do matter in it. And I I learned that the hard way. Um, I don't want to get, are we spoiling anything? I don't know how far. Try not to. I'm not going. Yeah, so did you get a ending? I did",
      "start": 796.64
    },
    {
      "text": "your choices actually do matter in it. And I I learned that the hard way. Um, I don't want to get, are we spoiling anything? I don't know how far. Try not to. I'm not going. Yeah, so did you get a ending? I did not. Okay. Yeah, I got I got probably I got an okay ending. Okay. There's a lot of things you can do. If you do correctly, you can really have a good impact on the overall story and the overall world. What's happening in the world. And I did not do those things correctly. And so, uh, my the world that my Adam Jensen is living in is probably a lot darker. Yeah, than it should be. Um, yeah, a lot of is how was the story this time around? It was cool. It was a little, uh, for me, it's hard to follow the story. It's same with Human Revolution, right? That's that's my only other gripe with the game is that it's the story is so intricate and it's told over so many different cut scenes and so many different emails and so many different like conversations that you're kind of happen to walk by that it's harder for me to",
      "start": 830.08
    },
    {
      "text": "is so intricate and it's told over so many different cut scenes and so many different emails and so many different like conversations that you're kind of happen to walk by that it's harder for me to follow. Um, there's a lot of enemies in the game that you don't really see. There's a lot of, you know, it's sort of a lot of the game is based on that that sort of conspiracy notion that there's this bigger organization out there that's that's trying to pull, you know, pull the strings and you're just a puppet and you're trying to figure out who you're really working for, who's working against you. Um, to put in context, at the very, very, very beginning, you you get a cut scene, um, with this sort of Illuminati group that is doing something nefarious. I'm not going to spoil what. Um, but you really have to pay attention to that. Got. 'Cause I didn't the first time and I was like, I don't really know what's going on. And then on my new game plus, I came back actually with having the full context what this how the",
      "start": 868.12
    },
    {
      "text": "attention to that. Got. 'Cause I didn't the first time and I was like, I don't really know what's going on. And then on my new game plus, I came back actually with having the full context what this how the story was going to unfold. And I'm like, oh, fuck, this is like the this is the setup for the entire story. I get that. But they introduced, I fuck you not, five different groups, 10 different characters. Um, you never really see these guys again until maybe like, I don't know, six, seven hours into the game. So you can't really remember what's going on. And then you are set up as working for war or one organization and you're a sleeper in another organization trying to get to a third organization that may or may not be a good organization. Yeah, because they might be a puppet of another organization that might be tied to this Illuminati group. So it's it's a very intricate. There's a lot of stuff that happens. And and the reason why they set it up that way, obviously, is because they want you to have a nice",
      "start": 908.16
    },
    {
      "text": "be tied to this Illuminati group. So it's it's a very intricate. There's a lot of stuff that happens. And and the reason why they set it up that way, obviously, is because they want you to have a nice like, you know, 10 to to 100-hour long game with side missions and things like that. You're actually invested in. But the actual story itself, I feel like could have been told in a slightly more concise way. And that's again, just for me, because again, I have the attention span of a three-year-old. Um, I need I like the idea of the three-hour story that plays out over five hours, not the two-hour story or three-hour story that plays over over 20 hours because I feel like I just got lost at a certain point. And I'm like, who am I supposed to kill? Oh, there's no repercussions really for killing anyone. Everyone's going down. And then at the end, I'm like, oh, there were repercussions for killing people. I made a mistake. Did you have you played the original? No, I jumped in. The first uh Deus Ex that I played was",
      "start": 946.64
    },
    {
      "text": "down. And then at the end, I'm like, oh, there were repercussions for killing people. I made a mistake. Did you have you played the original? No, I jumped in. The first uh Deus Ex that I played was Human Revolution. And I played it on a whim. Uh, I mean, again, I think I liked never judge a book by its cover. But I I Brennan loed to me. I was like, that's really cool cover art. I'm going to play this game. And I just got hella into it for no reason. So I'm just going to go out on a limb and assume that you don't remember uh Mankind Divided or Human Revolution that much. I don't think I beat Human Revolution either. So I I think I played probably about 80% of it. But I don't remember ever actually beating that game. So so you kind of answered the question I was about to ask. But do you think you need to have played that one to enjoy this one from a story? Or yes, if you want the full story, yes, because it picks up right after like some crazy fuck goes down and explains exactly why the world is the way it is. Um",
      "start": 982.96
    },
    {
      "text": "that one to enjoy this one from a story or yes if you want the full story yes because it picks up right after like some crazy **** goes down and explains exactly why the world is the way it is um the world starts well I don't want to spoil too much of it for you guys but yeah I would go back and play the first one me it's fun um but it's a radically different game and I think this one plays a little bit better I put it in context I think this one this one they do a lot of interesting things where if you if you find certain elements in the game or you complete certain missions the right way you actually bypass some really hard parts which is really really cool but if you remember correctly one of the biggest gripes people had of Human Revolution myself included was like the **** like hours in or even like an hour in you you face a boss that's like impossible and that's the first boss and every boss after that is like roughly as hard in this one depending on how you play you might",
      "start": 1024.88
    },
    {
      "text": "hours in or even like an hour in you you face a boss that's like impossible and that's the first boss and every boss after that is like roughly as hard in this one depending on how you play you might not get a boss battle it's crazy and so stuff like that's really really cool where where you I'm I'm going to be honest with you I use the guide probably about 80% of the time like I'd log on just kind of make sure I didn't cuz I wasn't sure I wanted to do another game after this and I'm glad I did because a lot of those other things I would never have even thought with my style of play I would never have happened upon them a lot of them literally like you have to like sneak up on people and listen to their conversations and they'll be like oh this thing's hidden over here like oh great and and obviously you don't you know that's not timing wise you it's triggered by you going up to them but if that person has a giant **** hole in their head because you just put a shotgun to mouth yeah",
      "start": 1063.68
    },
    {
      "text": "obviously you don't you know that's not timing wise you it's triggered by you going up to them but if that person has a giant **** hole in their head because you just put a shotgun to mouth yeah he can't he's not talking anymore so uh but it's fun again that's good that but but that's not that is a way of playing the game and it's super gratifying to me because I get to a point where I'm like okay my strategy is to figure out where everyone is in the world and instead of sneak around them figure out what the best bottleneck point is and then bring them on and take them out one by one yeah and it works and you can beat the game that way if you want but I'm telling you right now probably imploring stealth better idea just for your overall ending so Breach Mode you guys did a stream of that what is it what that's important thing we should have done at the beginning but I just want to put it out here for full transparency that Deus Ex, no, Deus Ex: Mankind Divided sponsored our studio launch and and",
      "start": 1100.64
    },
    {
      "text": "what is it what that's important thing we should have done at the beginning but I just want to put it out here for full transparency that Deus Ex, no, Deus Ex: Mankind Divided sponsored our studio launch and and also Square sent us to so many PAXes and we do their panels and stuff this is not part of the sponsorship just a heads up if Nick hated the game he could tell you he hated the game and it wouldn't be a big deal we haven't even played the game probably never will um yeah we played Breach Mode on the stream or whatever Breach Mode is like Metal Gear Solid VR Missions oh cool where it's like you're going in you're I forget the story based around it like you're You're Not Jensen you're a hacker or whatever but you hack by going in and doing things so you're running around using the mechanics of it but dodging you know like VR cameras and VR enemies and knocking them out and getting info data and getting out for a certain time kind of thing time trial and that's that style of level actually it's not",
      "start": 1139.08
    },
    {
      "text": "you know like VR cameras and VR enemies and knocking them out and getting info data and getting out for a certain time kind of thing time trial and that's that style of level actually it's not kind of a spoiler but it it pops back up in the game is actually really cool moment in the game um I won't spoil it for you guys but it works in organically into the story which actually thought was really cool having played Breach Mode going in and seeing that level and like oh this is dope this you remember this it was pretty cool yeah it was pretty cool um so there there's DLC coming up of which we will be as part of that sponsorship we'll be doing a stream where you play the DLC that a lot better at this time are you excited about that oh God yes um yeah I mean again I this is the first game I've ever actually gone back and done and played again do you play Arkham Knight again uh no because I was I think by the time I kind of finished Arkham Knight I think I don't think I actually got the ending",
      "start": 1179.44
    },
    {
      "text": "I've ever actually gone back and done and played again do you play Arkham Knight again uh no because I was I think by the time I kind of finished Arkham Knight I think I don't think I actually got the ending ending ending of ar oh right right okay I'm sorry I don't want to do this anymore like I was kind of burned out sure okay um I you know you go back and play for like five more minutes in the level and screw around and you're like this it just feels empty whereas there's so much more to do in Deus Ex right now that I'm like oh cool and I want to I want to kind of want to play through the story the whole story again to see if I can get a better ending because I'm lot but I've already already started **** that up already I've already gotten into a fight with the cops I think I killed all of them in Prague which is probably wanted man right now now what are you going to do they got cool **** got to live got to be Adam Jensen got to get that grenade launcher somehow so Nick do you do you",
      "start": 1215.48
    },
    {
      "text": "in Prague which is probably wanted man right now now what are you going to do they got cool **** got to live got to be Adam Jensen got to get that grenade launcher somehow so Nick do you do you recommend people play Mankind Divided oh yeah absolutely absolutely I mean if you're a fan of the series or if you're actually just jumping in you could probably I would say play Human Revolution first but if you don't have the patience for that I completely understand I would read a summation of that yeah read the Wikipedia read the Wiki page and then and jump in they do a really good job of sort of like like right at the beginning obviously they they tell you the big thing that happened in Human Revolution and how where the world's at right now you get a sense of it and spoilers it's not a Utopia and I don't think anyone's expecting that but yeah definitely jump in play it if that's the kind of game for me it's great it's not that hardcore it it doesn't have that like hardcore RPG experience",
      "start": 1255.76
    },
    {
      "text": "and I don't think anyone's expecting that but yeah definitely jump in play it if that's the kind of game for me it's great it's not that hardcore it it doesn't have that like hardcore RPG experience right like you can you can have fun you can literally get to the entire game without killing one person if you're really good at stealth um and and I think that's pretty cool awesome thank you very much for joining us Nick to see you soon on the Kinda Funny Gamescast if not you could find Nick on Kinda Funny was going to go slower than that over on the GameOverGreggy Show on love and sex Monday 9:00 a.m. uh Colin is now going to join us for some fun we're going to talk about some Nintendo games some PC games and some other ****",
      "start": 1290.84
    }
  ]
}
