{
    "id": 2034,
    "video_id": "V5XGqa5NAow",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Camping Stories - The GameOverGreggy Show Ep. 144 (Pt. 4)",
    "description": "Nick brings up camping trips.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1473318001,
    "duration": 1482,
    "transcript_chunks": [
        {
            "text": "This episode of The GameOverGreggy Show is brought to you by Squarespace. Whether you need a landing page, a beautiful gallery, a professional blog, or an online store, it's all included with your Squarespace website. And yes, if you've never heard me say it, ladies and gentlemen, we built the original KindaFunny.com with Squarespace. And like I always say, we are dumb, each and every one of us. Not you guys, each and you know, each and one of the Kinda Funny guys, each and every one of us, very dumb. So if we, in a time of quitting our jobs, not knowing what we're doing, trying to tell Kevin to go back into the wood, we can't afford them. If we could build a site with Squarespace, you know you can too. So start your free trial today at Squarespace.com and enter the offer code Kinda Funny to get 10% off your first purchase. Nick, yes, what's your topic? My topic comes from Patreon. Oh, Patreon.com/KindaFunny, where people can go and back us and get the topics, the show. Um, I assume it's this right?",
            "start": 0.08
        },
        {
            "text": "your first purchase. Nick, yes, what's your topic? My topic comes from Patreon. Oh, Patreon.com/KindaFunny, where people can go and back us and get the topics, the show. Um, I assume it's this right here, right? One that says Patreon topic. Greg printed this out for me. He was like, 'I have your topic for you. I'll print it out for you.' And they didn't give it to me till right now. The first time I ever went tent camping was with my husband. Who did this? Who put this one in? In Ju, uh oh, this at MissMovies. At MissMovies, Brian. Hi, what's up? Uh, it gives us a lot of support on Patreon and gives us a lot of topics, which great. I think we did our topic last week, didn't we? Yeah, fantastic. Kevin, give me, give me a, give me Nick's one shot so he can say thank you to MissMovies. Thank you, MissMovies. You're my only hope. Uh, I was 9 years old and 7 months pregnant with my first child at the time. Our campsite was in Yosemite, uh, inside the park but outside of the Hub, so we needed to drive in during the day to",
            "start": 37.04
        },
        {
            "text": "only hope. Uh, I was 9 years old and 7 months pregnant with my first child at the time. Our campsite was in Yosemite, uh, inside the park but outside of the Hub, so we needed to drive in during the day to see, to sightsee. At the time, there was a construction happening, uh, on the main road into the heart of the park. What we didn't know is that is, uh, that the be, that beginning at 10 p.m. and lasting until 4:00 a.m., large gravel trucks would pass directly by our campsite every 3 to 5 minutes, going up and down the road. It was the equivalent of camping on a freeway. Uh, needless to say, I didn't sleep for two nights, and on the third day, I pulled a Troy Beverly Hills move and booked us a room at the Ahwahnee Hotel for the remainder of our stay. Do you have any memorable camp stories or memorable summer camp stories that you can share with us? Thanks. I want to stress again, I love how much context MissMovies. Fantastic illustr, you, you want to see include what is your favorite color? I, I can, I can truncate that a",
            "start": 90.68
        },
        {
            "text": "that you can share with us. Thanks. I want to stress again, I love how much context MissMovies. Fantastic illustr, you, you want to see include what is your favorite color? I, I can, I can truncate that a little bit. You to give me another read, give me another read of what the topic might be. Let me try it again, guys. This topic comes from Patreon.com/KindaFunny, where you can go to support us. Uh, the question comes from MissMovies at MissMovies. Do you have any memorable camp stories or memorable summer camp stories that you can share with us? Is the question. I love it. No, no, we're just, we're just yanking her chain, having fun. Prologue, in case you didn't have one. If you were searching, she'd kind of give you a launchpad. Yeah, exactly. I love that. Oh yeah, was that? Well, no, she gives us enough context so that if we were just all like, know that's still a topic. It took long enough. We got, we got a story out of it. Um, have you guys been camping? I'm an Eagle Scout. I'm full, full of camping stories, full of them.",
            "start": 132.08
        },
        {
            "text": "if we were just all like, know that's still a topic. It took long enough. We got, we got a story out of it. Um, have you guys been camping? I'm an Eagle Scout. I'm full, full of camping stories, full of them, full of them. I, the opposite. I went, I went to the only camping experience, close camping experience I've ever had in my entire life, sixth grade camp. I went for, it was like three days. On the first day, I called my mom and said, 'You have to come pick me up. I don't like anything about this.' Didn't like it. There was like, they had, they made climb a rock. We had to catch like a butterfly. It was hot outside. I did not like anything about it. And that was the last time I went camping. Oh wow. Okay, well, the other extreme, you, you went camping all the time. Uh, yeah, I was, uh, I, I will not tell you the story about how I was on the island of Catalina and was, uh, almost gored by a boar, uh, that was then, uh, shot by a sniper rifle and a goty in a helicopter. What the ****? Why wouldn't you tell us in between the, the two?",
            "start": 172.0
        },
        {
            "text": "I was on the island of Catalina and was, uh, almost gored by a boar, uh, that was then, uh, shot by a sniper rifle and a goty in a helicopter. What the ****? Why wouldn't you tell us in between the, the two campings? 'Cause in the summer, so we went back in the summer, we're like, 'Are the boar still here?' And they're like, 'No, we killed them all.' We, God, we went up above Catalina. Is that why they did, they give you the, the medal there, the little Eagle medal? I wish. Yeah, like antler dodging or something. That would have been a sweet, uh, Merit Badge is what they're called. Merit Badge, excuse me. They should have been called Bullet Time. Um, uh, I went on a, a long term, which means you don't hike and then back to the car. You keep going and going and going and going. And like everything that you have, all your food, everything is all in your backpack. And, uh, uh, woke up in the middle of the night, my tent had collapsed because it was hailing. And so all the Scouts got out and we're like, 'Okay, we're all going to go to the lodge,'",
            "start": 213.2
        },
        {
            "text": "is all in your backpack. And, uh, uh, woke up in the middle of the night, my tent had collapsed because it was hailing. And so all the Scouts got out and we're like, 'Okay, we're all going to go to the lodge,' because it's just like, it's, you know, our tents can't handle this. But do you have bear bags? Anybody know what bear bags are for? You catch, hoist the food up in a bear bag so bears can't get out. It, 'cause if you're like, 'Oh, put in that tree there,' they'll get it. If you put, you're like, 'I'll put in my car,' bear will has no problem with car doors. We'll rip it right off. Um, we're like, 'Oh no, with the rain and everything, maybe the bear bags fell.' So me and two other Scouts went to go check in the bear bags. Bear bags are fine. Uh, all those Scouts have now headed back towards the lodge. So we go running across this open field, going back towards the lodge. Uh, lightning hits, got to be 100 yards, like right behind us. Totally go blind because it's this massive white light. Follow the ground, get up, go back to the camp. All",
            "start": 248.24
        },
        {
            "text": "field, going back towards the lodge. Uh, lightning hits, got to be 100 yards, like right behind us. Totally go blind because it's this massive white light. Follow the ground, get up, go back to the camp. All the Scouts are freaking out 'cause they were all on the porch, saw the whole thing happen in front of us. And one guy went to take off his jacket and the zipper had melted. The zipper had fused. Jesus, in his jacket. Electricity went to the ground and went through because we all fell on the ground. What you're supposed to do, supposed your hands on the ground so if a charge goes into you, it doesn't like go straight up to your head, so it actually like goes back into the Earth. I would have jumped, would have tried to jump. Got a nice little jolt. You see it coming, it's like, but, uh, I mean, the boar is a sniper rifles, though. That's, that's no, that's, is that because they, there was a overrun in the boar population that year? Is that they have to do that sometimes? You know, it was like, there was like, if there were",
            "start": 281.56
        },
        {
            "text": "though, that's, that's no, that's, is that because they, there was a overrun in the boar population that year? Is that they have to do that sometimes? You know, it was like, there was like, if there were Scouts in one side of the road or boars in the other side of the road. Got it. Where's the car? Which one is the cat? I am thoroughly impressed. Like, not only did you just, I didn't do anything, annihilate that topic. Should have been, yeah, that's crazy. But I got, yeah, I got all sorts of fun camping stories. Do you still camp as an adult today? I went camping last week and in the Grand Canyon, which I'd never been ever. Oh wow. So finally got to the canyon. Yeah, I've never had a desire for it. I ju, I just watched, and this reminds me like, 'cause she was camping in Yosemite. I just watched, what's that? You just watched Heavyweights? No, I did not. Is that a David Arquette film? Please tell me David Arquette. It's that, it's that, uh, fat camp movie where they're all holding the same on the. I never watched as a kid. Hit too close to home. No, I",
            "start": 320.28
        },
        {
            "text": "no, I did not. Is that a David Arquette film? Please tell me David Arquette. It's that, it's that, uh, fat camp movie where they're all holding the same on the. I never watched as a kid. Hit too close to home. No, I, uh, you should. It's fantastic. I watched, uh, and I recommended it for Kevin, and Kevin liked it as well. I'm a documentary on Netflix called Valley Uprising about the rock climbing in Yosemite and how that came, that came about from basically like the late 50s, early 60s on to what it is, has evolved to today. And it made me actually want to go to, which is not that far from here. Um, and not camp necessarily, but at least see it once with my own eyes and then go back to that hotel she was talking about because it's very nice. Is beautiful. Is it? Is awesome. Have you been to your? Oh yeah, my, my mom is a hippie from Bay Area. Yeah, I've been to like, with 13, she brought, got my mom and dad got married at Yosemite. It was them, the person that married them, and a deer. So that was thing. Did they bring the deer? Was the witness? No.",
            "start": 361.24
        },
        {
            "text": "Bay Area. Yeah, I've been to like, with 13, she brought, got my mom and dad got married at Yosemite. It was them, the person that married them, and a deer. So that was thing. Did they bring the deer? Was the witness? No, they didn't bring the deer. Was just, they brought it hoof over and hit it on the marriage license. Did they invite more deer? And that was the only deer they showed up. Show up. The deer couldn't make it from Florida. Yeah, I was pretty bad. Um, I've been camping way, way, way more times than I would have ever liked to. Um, probably three or four times camping. I got to imagine you hate it. Oh, it's the, yeah, it's the absolute worst. Nothing about it is like, Tim, this is a selling point for you. All of it's horrible. I mean, the, the worst thing was there was one time we went, and this is like, I've told the story before, but I, I need to reiterate. We were like camping in Yosemite, but Kevin and his mom and them actually had a hotel. And, um, eventually we, I convinced the people I was with to go let me stay with them. So I went to",
            "start": 398.28
        },
        {
            "text": "need to reiterate. We were like camping in Yosemite, but Kevin and his mom and them actually had a hotel. And, um, eventually we, I convinced the people I was with to go let me stay with them. So I went to do that. And then the, the reconned, I, I think you got the other way around. You guys had the hotel. No, all your mom had the hotel for sure. Me and my mom were in a tent for a night. No, because Spencer burned his foot, and then we had to go to your mom's hotel. Not true. I hate it when they, we were, we were in a tent. I had to spend a night in a tent with my mom because my brother was with him, and we were meeting him later. So I'd then go to this hotel, and Kevin's there, and he left the, he fell asleep with a bag of potato chips on his belly 'cause he's Kevin. Wasn't the first time, won't be the last time. There's multiple corrections on this story. On the floor, because we didn't have enough beds because we weren't originally like going to. On floor next to the potato chips. They were next to the trash on his belly.",
            "start": 441.4
        },
        {
            "text": "corrections on this story. On the floor, because we didn't have enough beds because we weren't originally like going to. On floor next to the potato chips. They were next to the trash on his belly. Were you eating potato chips out of the trash? No, he's lying. 'Cause it does end with the, with the raccoon on my belly. They were just next to the. I'm sorry. Uh, let's slow the story down a little bit. And I need you to start from at least the midway point. So what did, did, did Kevin commune with a raccoon? Like, what, what happened? Yeah, so, so his mom left the sliding door open like a little, like it was one of those like, just to let some air in when they smoked. Raccoons can just kind of like, 'Oh, this little **** got in there.' They can open it. I mean, they have. We hear some noises, and this is back in the like, you know, Jackass days, early Tim days, where I'm just running around with the handicam at all times. Obviously, this thing has night vision. So I turn the night vis on 'cause I hear some stuff, and I like go to",
            "start": 489.92
        },
        {
            "text": "know Jackass days, early Tim days, where I'm just running around with the handicam at all times. Obviously, this thing has night vision. So I turn the night vis on 'cause I hear some stuff, and I like go to like look at Kevin, and there's just this raccoon on Kevin. Look over his eyes. Let me pause right there. Was Kevin awake? Was Kevin also enjoying the potato chips off of his own stomach? 'Cause I imagine that the raccoon's sitting there and he's just feeding, 'Get one and I get one and he gets one and I get one.' No, he just, it was a, it was a horrifying experience. Did you kick? Happened. Yeah, I don't. Eventually, like, I, I was, raccoon is still on his chest to this day. I mean, it was one of the biggest, you know, upsets on my life because I mean, Kevin was fine, obviously. But then, uh, we accidentally taped over the footage, which is like, I, I felt bad for a year after that. I'm just like, 'I failed my life. That was the best thing.' Okay, so you film him, you see it, you know what happens. Wait, tell me, tell me some, what, what happened?",
            "start": 540.64
        },
        {
            "text": "is like, I, I felt bad for a year after that. I'm just like, 'I failed my life. That was the best thing.' Okay, so you film him, you see it, you know what happens. Wait, tell me, tell me some, what, what happened? What happened is I believe my mom was the one that like saw that those was raccoon on my chest, and she was like, 'Tim, get the camcorder.' And you guys filmed it, but you guys got it too late, and you guys just got it leaving. That's not what was the music playing. The thing that got accidentally erased was so funny. Yours is wrong. Absolutely not. On that same trip, I fed a squirrel for a really long time. Fat squirrel. Squirrel video of that to this day. He was so big. Was this just an endless bag of potato chips? It's Kevin, always the next. There was another time in fifth grade when we went on our like fifth grade camping trip or whatever. We had to like hike up a mountain, and then I kicked a rock off the mountain, and my shoe flew off. And then rest of the trip, one shoe. That really sucked. So I was like, '****'",
            "start": 581.96
        },
        {
            "text": "camping trip or whatever. We had to like hike up a mountain, and then I kicked a rock off the mountain, and my shoe flew off. And then rest of the trip, one shoe. That really sucked. So I was like, '**** camping.' Um, then there was, there was another time when I was a little bit older, I think it was in eighth grade. Me and all my like, even like current friends went out 'cause one of them was like, 'Let's go camping. It's going to be **** fun.' It absolutely wasn't. Except we all brought our Yu-Gi-Oh! cards, and we hadn't played Yu-Gi-Oh! for years at that point. And we all **** playing. That's all we did all night. It was pitch black outside. Um, so that, that time was kind of fun, kind of. But I still don't want to do it again. We can't like, we had, we had, we started with a pop-up camper that you put on the back of Dad's truck, you know, and you'd park it and you crank it up and you had the thing or whatever. And then eventually had an RV. And we, does that count as camping? I don't. Okay, was that when you were lost?",
            "start": 631.68
        },
        {
            "text": "Dad's truck, you know, and you'd park it and you crank it up and you had the thing or whatever. And then eventually had an RV. And we, does that count as camping? I don't. Okay, was that when you were lost camping? Yeah, the RV is when I got lost to Disney World. There's a lot of these stories have been told tangentially. I'm going to have to get that one later. Once we took the, the pop-up camper down to the, the Steam Show Sandwich Fair. And then that's where I ate too much cherry pie and vomited into a bucket while sitting in the back of the, the pop-up camper. I believe that if I'm lying, I'm dying, Colin. And in that pop-up camper too, I'm just a little kid. I don't know, five, we'll say or whatever. I remember my mom did something nice to me, and I'm like, 'I need to compliment her.' Called her sexy. She's like, 'You don't know what that word means, do you?' I'm like, 'No, not really. Not really what I'm trying to be. I'm trying to be helpful. I'm trying to be a helpful on there. Take care.' You know, we discover the bodies. This",
            "start": 670.32
        },
        {
            "text": "know what that word means, do you? I'm like, 'No, not really. Not really what I'm trying to be. I'm trying to be helpful. I'm trying to be a helpful on there. Take care.' You know, we discover the bodies. This will all for when Greg called his mom sexy. I believe I've told the stories of going to Yogi Bear National Park, right? Amboy, Illinois, up there. Jellystone Campground, right? You remember these stories? They, they come back to you. We used to catch the tadpoles, **** buckets and buckets full of tadpoles. What are we going to do with these things? We don't know. Tad saw Wayne's World at the, the, in one of like, they do the movies at night, you know what I mean? I'll never forget this, Tim. I'm seeing Wayne's World, had a billion Cokes, had to pee but didn't want to miss any of Wayne's World, right? M-hm. It's not going the way you think. Kevin and I go all the way through it to, you know how you got to pee, you got to pee, you got to pee. And then it's just like, you don't have to pee anymore. Now the pain is so intense. That's",
            "start": 711.36
        },
        {
            "text": "you think. Kevin and I go all the way through it to, you know how you got to pee, you got to pee, you got to pee. And then it's just like, you don't have to pee anymore. Now the pain is so intense. That's just life. And then the movie ended, and we got up, and I had to walk back like hunched over 'cause it hurt so much. And then I finally got into the RV, got to the toilet, and then I had to sit there for like 30 seconds, warming everything up, getting his machine ready to run. That's the worst is when you have to pee and it, and it hurts so little bit because you held it in for so long, and almost nothing comes out. And you're like, 'What the?' And you have to give it about another 10 minutes, and it's like, 'All right, like, we're good. Everything's.' Yeah, yeah, yeah. That's what the Pearl Jam song was about, right? Exactly. Uh, so I like being, I like the outdoors, like especially as a kid. But I, I like day hiking and stuff. Like, I've been camping, but I, I agree with him where it's like, it's fun in your mind. I mean, there are",
            "start": 753.16
        },
        {
            "text": "people clearly that enjoy it. Really, my dad's one of those people too. My dad, like, my dad always would kid around. I love to tell stories about my dad 'cause he's, you know, he's a funny dude where he's like, 'Just give me an,' what did he tell me and Denan, my brother, where he was like, 'Give me a matchbook, aluminum foil, and a knife, and drop me in the woods, and you'll never see me again.' Or something like that. We're like, 'What the **** are you talking about?' Like, 'That's all I need.' And I'm like, 'All right, Dad.' Uh, but, uh, so he, he likes doing those kinds of things. But honestly, like, and it's kind of sad, like that my, my camp or day camp or like summer camp stories are like, like one of them is, uh, when I was in private school, uh, we would go for a week to this thing called Nature's Classroom, which was like, uh, I lived",
            "start": 789.88
        },
        {
            "text": "my camp or day camp or like summer camp stories or like, like one of them is, uh, when I was in private school, uh, we would go for a week to this thing called Nature's Classroom, which was like, uh, I lived in New Hampshire, and we'd go to like Upstate New Hampshire, like Laconia or something like that. And, and, uh, go to this thing. And I went, and I **** hated it. So the second year, I like demanded to stay, and like four kids, like in eighth grade at that time, like all stayed in. I just played Apple games for a week. So that was cool. But the other, the, uh, the bit that Chip's Challenge, yeah, Chip's, yeah, I played like Oregon Trail and like Jeopardy!, where it had, yeah, like, like it has like 15 questions. You just memorize it all. You're having the perfect game. Uh, yeah, and then I'm like, like I'm trying to impress the teacher like, 'Look how **** smart I am.' Uh, but honestly, and it's kind of a sad thing, like my one of my camping memories, I been between third and fourth grade, um, I had left Long Island to go live",
            "start": 830.6
        },
        {
            "text": "the teacher like, 'Look how **** smart I am.' Uh, but honestly, and it's kind of a sad thing, like my one of my camping memories, I been between third and fourth grade, um, I had left Long Island to go live with my mom in Maine for a few years. And, and she like worked, she was a, worked at Delta. So I, uh, uh, went to this summer camp, and it's like the only time in my life like I was kind of always flew under the radar like in school. Like I wasn't a popular kid, but I was just kind of like normal person, you know? And it was the only time in my life I remember getting picked on like every day. That's like, that's what I remember about that experience. Is like, there's this kid, this blonde piece of **** that used, that probably like didn't pan out very well, that, uh, yeah, used to pick on me like every day. That's, that's what I remember about that experience. Like, I don't remember anything else like that whole summer, but that kid like busting my ball. You fantasize sometimes that you go back and just punch him in",
            "start": 869.8
        },
        {
            "text": "what I remember about that experience. Like, I don't remember anything else like that whole summer, but that kid like busting my ball. You fantasize sometimes that you go back and just punch him in his **** face? Uh, no, fantasize. I fantasize, uh, sometimes about, uh, just seeing him now and, uh, him being a **** complete loser. That's, you know. Would you be surprised if he was like Forbes Fortune 500, really nice guy? He was missing a chromosome. I would be shocked if he even graduated high school, honest with you. Uh, so that's, that's what I, that's what I remember like about those kinds of things. But I love, I love hiking. Like, I really love being in the woods. Like, there's something about the woods on Long Island. Like, we have great Pine Barrens. And in New Jersey too, where, where near where my beach house is, like, we have great Pine Barrens. And like, just going in there. And I worked at a thing called Post Morrow Foundation on Long Island, which is a land trust, uh, where they buy a ton of land because Long Island's",
            "start": 908.08
        },
        {
            "text": "we have great Pine Barrens. And like, just going in there. And I worked at a thing called Post Morrow Foundation on Long Island, which is a land trust, uh, where they buy a ton of land because Long Island's getting like really overrun. Like these like try to buy land and be like, 'Just get the **** out of here.' A lot of NIMBYism on Long Island, which is fine. Um, and have no idea. NIMBY is an acronym for Not In My Backyard. And, uh, so like people that are like, 'Just get the, like, stay the **** off the island. You have no reason to be here.' And there's these guys, you know, this very, these very nice people that Mike, my friend, my best friend Mike's mom works for. Yep. Uh, and I worked there. And, and it was, what was so cool about it is like, I would just be in the woods all day. That's all I had to do was like go in the woods and like clean up trails and do all kind of ****. I was like, 'This is so lu.' Get Lyme disease. Uh, no, I used to get poison ivy all the time, which is like, I don't, is there even poison ivy out here?",
            "start": 948.92
        },
        {
            "text": "woods and like clean up trails and do all kind of ****. I was like, 'This is so lu.' Get Lyme disease. Uh, no, I used to get poison ivy all the time, which is like, I don't, is there even poison ivy out here? Because like, I don't see it like, poison right? And poison sumac and **** like that. Like on, uh, dude, it is on Long Island. It is everywhere. Like, it is everywhere. You're at 7-Eleven, you grab a bag of **** Cheetos. I used to get it. I used to get it **** constantly when I was a kid. And, uh, we had an inground pool. So like, like the, I used to dive in like when I had it. Like the chlorine helped you. And I used to take oatmeal baths like, like that you buy to like, uh, and there's this stuff called, um, what is it called? I want to say Tecnu. That's the anti-****. It's, uh, it's this, it's this like stuff that you buy that you can like rub on yourself and then like basically like put your hands like and weed and stuff like that. And like it, you don't get it. So anyway, I lived in fear of that **** as well. So",
            "start": 985.36
        },
        {
            "text": "buy that you can like rub on yourself and then like basically like put your hands like and weed and stuff like that and like it you don't get it so anyway I lived in fear of that **** as well so I tried to stay out of out of uh out of there but when I'm in the woods here I don't notice it I see it when I'm back home like every it's when I was at at the wedding in Connecticut for Mike Pope uh in the middle of nowhere like Cornwall Connecticut we were going into the woods he it was like a very like uh Game of Thrones like I told you guys it was like uh he like shot a literally shot a flaming arrow into this into this uh this bonfire to start it like it was all game like his best man our friend Cory wore like the King's Hand thing or whatever and uh so we had to go into the woods to get brush and all that kind of stuff and it was my first time in years being in like an East Coast like Northeast woods and I saw everyone I'm like **** I washed my hands so many times like totally in in",
            "start": 1028.64
        },
        {
            "text": "and all that kind of stuff and it was my first time in years being in like an East Coast like Northeast woods and I saw everyone I'm like **** I washed my hands so many times like totally in in fear cuz I knew I knew how easily I got it so no thanks um but anyway long story short I got picked on I hated Nature's Classroom and and uh I mastered Jeopardy on that when you talk about summer camp I think of I used to the the you know Village of Glen Ellyn through the park district had a su like a day camp summer camp thing which I don't know it's not you know not you're going somewhere to stay but every morning you get dropped off and you would do activities and then in the afternoon You' always go to the pool and just hang out of the pool all day and then they'd bring you back and then your parents pick you up and there was a guy there the opposite of what you're saying a friend of mine I don't remember his name anymore cuz we were summer camp friends that you saw every summer camp",
            "start": 1066.52
        },
        {
            "text": "your parents pick you up and there was a guy there the opposite of what you're saying a friend of mine I don't remember his name anymore cuz we were summer camp friends that you saw every summer camp called me Spud but said it in a loving way and I liked it I liked being called Spud so Tim you can call me Spud if you want to can I call you no yes you can call me Spud too everyone can call me Spud can we call Kevin Spud he doesn't like that no he doesn't like being called potato it's different that's a different thing a c potato uh one time when I big old Jamie Kennedy was dropping me off uh I got out of the I got out of the car and she I we were I was fighting about something dumb I'm some dumb young kid I leaned and I slammed the door and I didn't move my head fast enough so the top of the door the triangle caught me on the side of my head and cut open my head and I didn't notice it till hours later cuz it knocked my glasses off were the glasses real Colin no they were from a box of",
            "start": 1104.64
        },
        {
            "text": "door the triangle caught me on the side of my head and cut open my head and I didn't notice it till hours later cuz it knocked my glasses off were the glasses real Colin no they were from a box of cereal and I wore them every day knock the glasses off my head and I noticed later that I had this Blood On My Head you would be such a different person if you had an older brother yeah you know that somebody would have rained me in oh my God like if I had done that my brother would have never he would be still picking on me about that if I cut my head open any of the **** you just said like me just randomly wearing glasses for no reason you imagine Matt Scarpino like allowing that to happen no **** this was of course the summer of Back to the Future II right yeah so there was many cool sunglasses they came with Cheerios cool now little Greggy Miller did not like Cheerios doesn't like cereal to begin with you know that so I was at I was at an impass on how to get these cool glasses they",
            "start": 1142.6
        },
        {
            "text": "they came with Cheerios cool now little Greggy Miller did not like Cheerios doesn't like cereal to begin with you know that so I was at I was at an impass on how to get these cool glasses they had I wanted the Back to the Future glasses luckily Poppy big old Jamie Kennedy's dad mhm he ate Cheerios so one day I went over there and he gave me his glasses and they were the Dwayne Wayne you know knockup ones and I was like thanks went home broke off the sunglasses part filed down the plastic little things and then I just had I had fake glasses thank you for the A Different World reference by no problem that's what I do for you and then I had those forever for a second I think said Dwyane Wade and I was like I don't think he was playing back then I don't think he wears glasses uh anyway so then I had those and then it was on a bus as part of the summer camp thing or whatever where I was horsing around with some girl I remember and she not like in the sexual sense Tim slow we know Tim knows",
            "start": 1182.72
        },
        {
            "text": "I had those and then it was on a bus as part of the summer camp thing or whatever where I was horsing around with some girl I remember and she not like in the sexual sense Tim slow we know Tim knows thank you thank you very much and she like we were she kicked me or something and not broke the glasses and she broke down in tears cuz she thought you know as your kid these things must be worth $50 there's no way your parents are going to sue us or whatever and I was like no no they were never real and she never talked to me again she was so offended that I had lied All Summer Long about these glasses but I knew one day I would need them and I'd be ready for them and here I am yeah they are real they are real also a lot of cicadas one summer you know these guys they show up every 15 16 years or whatever these **** everywhere I don't know making noise where you catch them it got to be a big thing because you you know cicadas I do big old **** all right I know about I know about them from",
            "start": 1222.36
        },
        {
            "text": "or whatever these **** everywhere I don't know making noise where you catch them it got to be a big thing because you you know cicadas I do big old **** all right I know about I know about them from Beetleborgs yeah of course we catch them I mean they're everywhere and they're just harmless you we're trying to be on the swings or whatever these **** there and there was big brouhaha cuz kids would bring them in they just have cicadas and then people like you can't bring in these cicadas anymore and then if I'm lying I'm dying Tim somehow cicada got in my shirt all right so I I technically I fied in this cicada and I got in trouble for it and of course I broke down in tears pleading my case that I didn't know there was a cicada in my shirt how can I be unjustly represented this way in this trial by combat you can't be held accountable for what's in your shirt exactly Brandon I'm I'm so happy you get to be here for I like to think about the apocalypse when I'm camping because what if",
            "start": 1259.08
        },
        {
            "text": "trial by combat you can't be held accountable for what's in your shirt exactly Brandon I'm I'm so happy you get to be here for I like to think about the apocalypse when I'm camping because what if that happens what if that what if that happens power's gone it's gone like none of us are doing anything on the internet anymore it's gone so over there's no more power everybody's got to you know grow their own food and everything and then all these people hate camping they're oh I'm really dirty and all the Eagle Scouts are like later yeah you're going to be good fine I don't want to live in that world I always talk about this well you might have to wife send the **** automatic smart c car to me I'm I want I want barrels through everyone and anything driven by a cat I'm saving your life this is for you J I can't slow down please jump on I'm sorry um I I my wife and I talk about this a lot because we love we're huge fans of The Walking Dead right and obviously like you know first season",
            "start": 1300.76
        },
        {
            "text": "is for you J I can't slow down please jump on I'm sorry um I I my wife and I talk about this a lot because we love we're huge fans of The Walking Dead right and obviously like you know first season of that you're like well I would totally die there's no possible way that I could live out near a rock quarry and sustain myself um I have a brother-in-law who lives in uh Lake Tahoe and so the plan is steal a motorcycle because I know how to ride because you don't want a car got to have a motorcycle it's the only probably going to take us you figure there's a lot of cars blocking up the road so it's maybe 6 hours to eight hours we can get enough gas it's fine and then he'll take care of the rest because he is like a man's man he's the kind of guy that like packs stuff on motorcycle goes out for like days and then comes back and he's just a little sunburned and maybe his arm has been broken for like 5 days but it doesn't matter cuz he's like whatever like he's a firefighter all this so he",
            "start": 1339.04
        },
        {
            "text": "like days and then comes back and he's just a little sunburned and maybe his arm has been broken for like 5 days but it doesn't matter cuz he's like whatever like he's a firefighter all this so he knows how to do all this stuff um guns all that all that stuff they they go out and shoot things so basically my only responsibility to my wife at that point is just to get her to my brother-in-law and then whatever he can do whatever he wants to do I mean he can have her it's fine you can take her by the Moonlight it doesn't matter um isn't it her brother no no no it's her sister's husband thank you I was I was right there with you I was like no I'm sorry I I guess technically that is not my no rules sorry it's my that would make him my wife's brother-in-law but I say my brother-in-law too we're very close if you didn't know ladies and gentlemen this has been wo woo woo The GameOverGreggy Show stopping good time stop yeah well Brandon's got to go he's got a plane cat I got to go out where you",
            "start": 1378.16
        },
        {
            "text": "very close if you didn't know ladies and gentlemen this has been wo woo woo The GameOverGreggy Show stopping good time stop yeah well Brandon's got to go he's got a plane cat I got to go out where you going to go I got to go home and eat some Bean if you didn't know this The GameOverGreggy Show each and every week four sometimes five best friends gather on this table he's bring a random topic discussion for your amusement if you like that head over to Patreon.com/KindaFunny where you can toss us a few bucks and get each and every episode early along with a bunch of exclusives perks and goodies if you have no bucks to toss no big deal head over to YouTube.com/KindaFunny where the show's broken up topic by topic day by day until we post one big video and audio file for your listening pleasure Brandon Jones thank you so much for coming thank you for having me I love these topics these were great everyone of course go to Patreon.com/Allies support him they're struggling nobody's giv any",
            "start": 1417.16
        },
        {
            "text": "Brandon Jones thank you so much for coming thank you for having me I love these topics these were great everyone of course go to Patreon.com/Allies support him they're struggling nobody's giv any money been a huge failure they didn't expect it just numbers dropping congratulations on all your success love you guys congratulations you in your studio thank you thank you until next time it's been our pleasure to serve you",
            "start": 1460.44
        }
    ]
}