{
    "id": 2029,
    "video_id": "xWcfyDx1zxc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Anthony Weiner's Weiner - The GameOverGreggy Show Ep. 144 (Pt. 2)",
    "description": "Greg brings up a story that doesn't sound real based on its name.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1473145201,
    "duration": 1540,
    "transcript_chunks": [
        {
            "text": "this episode of The GameOverGreggy Show is brought to you by Squarespace whether you need a landing page, a beautiful gallery, a professional blogger, an online store, it's all included with your Squarespace website. And yes, if you've never heard me say, ladies and gentlemen, we built the original KindaFunny.com with Squarespace. And like I always say, we are dumb, each and every one of us, not you guys, each and you know, each and what other Kinda Funny guys, each and every one of us, very dumb. So if we, in a time of quitting our jobs, not knowing what we're doing, trying to tell Kevin to go back into the woods, we can't afford them. If we could build a site with Squarespace, you know you can too. So start your free trial today at Squarespace.com and under the offer code Kinda Funny to get ten percent off your first purchase. My topic: Anthony Weiner. Good Lauren sending, looking, hate that, do nudes and such. Yeah, buddy. Wool Red Fur. Whoa, what are you not familiar with Anthony Weiner? Is it the giraffe?",
            "start": 0.0
        },
        {
            "text": "off your first purchase. My topic: Anthony Weiner. Good Lauren sending, looking, hate that, do nudes and such. Yeah, buddy. Wool Red Fur. Whoa, what are you not familiar with Anthony Weiner? Is it the giraffe guy? No, no, no, he is not the giraffe guy. Who is the giraffe? She is the the the other Weiner that's running in San Francisco. The guy who, uh, I know, is that Jeremy Reeder? It's up something. I see a lot of a sign that Weiner. No, that's the guy from Marc Weiner. Marc Weiner. What? How many? What? Marc Weiner? Why is he a giraffe? Know what do you wanna spawn? And if so, in San Francisco, this guy Weiner, not, is you gotta fire that McChicken sandwich. Hahahahaha. Should have been my topic. No, he is running for something here in the city and one of his posters has it with a giraffe for some reason. It's really funny 'cause it seems like it's really heavily targeted towards the like Chinese community. Yeah, definitely. And the giraffe is, I don't think you're the giraffe about your a giraffe and I don't think it is a monkey.",
            "start": 36.96
        },
        {
            "text": "it seems like it's really heavily targeted towards the like Chinese community. Yeah, definitely. And the giraffe is, I don't think you're the giraffe about your a giraffe and I don't think it is a monkey. Is a rat? There's a rake. There's a dragon. I don't think the giraffe was on the right. Has a giraffe get its own year? And on on my ride home on my new bike, first day I bought it, I rode through an ad for him. He was filming an ad where he's walking. Please Google women's groceries home. He's you willingly buy that helmet? Yeah, yeah, we throw that on your head. We'll give you a hell yeah. You're **** right I did talk to you. Yeah, you got damn right I bought that helmet. That's my Evil Knievel helmet. It's awesome. And then you see you be good to see the Weiner guy over there. It was that or a water matter guy. So Anthony Weiner is not this guy. Anthony Weiner is, well, you can detect rivers where ya know exactly. He's able to solve it. There's the **** giraffe God. Now it's all who's got it, Ryder? There's some",
            "start": 103.58
        },
        {
            "text": "so Anthony Weiner is not this guy. Anthony Weiner is, well, you can detect rivers where ya know exactly. He's able to solve it. There's the **** giraffe God. Now it's all who's got it, Ryder? There's some other guy's last name Weiner and he sending dick pics. Yeah, you're gonna love this story. Love the story. He was a congressman from the great state of New York. Disgrace. I and it doesn't, he's not even, he sent a dick pic to start all this off. Tim, what he did was tweet from his own account a dick pic. Oh yeah, this is all those on my channel. Yeah, exactly, exactly. Everything, every was trying to get her step down and she came out that he'd been sending these things that he's, you know, married. She's pregnant with his kid. He's married to, uh, the closest confidante aid, not. And now just where it gets like really or abran even humor, humor, humor, humor. Yeah, you maybe that's why I'm getting any beggar human. Yeah, like a very close confidant and like adviser to Hillary Clinton that was relevant. Now they've",
            "start": 146.18
        },
        {
            "text": "really or abran even humor, humor, humor, humor. Yeah, you maybe that's why I'm getting any beggar human. Yeah, like a very close confidant and like adviser to Hillary Clinton that was relevant. Now they've separated. Uh, so anyways, the this happens though, every salesman step down. He doesn't step down. Then he finally got off step. Two steps down, right? Then he comes back and he's gonna run for mayor of New York. There's this great documentary called Weiner. Nominal. Yeah, I watched it. I watched it Saturday, finished it Sunday because I got tired in the middle of it. Sweetie. Ah, really? Just say that. It's what we're old men. I was it was 1:30 at night. I was tired. It was I wasn't enjoying it as much anymore. Weiner is the documentary. You should pick it up on Amazon. Better. Yes, it wasn't long. It was a long back a minute. What now? Long, little skinny hour and a half. Um, so the the documentary is caring, is following him through his mayoral campaign here in New York to come back. Exactly. He turns out there. So he",
            "start": 189.61
        },
        {
            "text": "a minute. What now? Long, little skinny hour and a half. Um, so the the documentary is caring, is following him through his mayoral campaign here in New York to come back. Exactly. He turns out there. So he thought he turns the corner. He starts one of the polls. Weiner's pulling out in front. They say it's going real well for a lot of good New York Post headlines. You should look into, right? Yeah, they're the best. And then more photos surfaced that he had sent this Las Vegas cocktail girl. Was it wasn't he didn't he have an online persona on some sort of Carlos Danger? Right? He was going by the name Carlos Danger when he was sharing new daughter in Dr. you know, photos in his abs, in his dick and all. You might be asking yourself, huh, what's bad about this? Yeah, well, as I was too, I was like, I don't stay away. This guy's not a national hero. This is hilarious. Except the fact that he's married, married, has a kid. But when they first drop, the Ranger comes in. He'd been married less than a year, about a year, I think.",
            "start": 232.93
        },
        {
            "text": "guy's not a national hero. This is hilarious. Except the fact that he's married, married, has a kid. But when they first drop, the Ranger comes in. He'd been married less than a year, about a year, I think, to Huma Abedin. By the way, officiate their wedding. So this is **** really. I you really want to **** this up. Not that it matters because taking the the interpersonal relationship, she's a phenomenal person. Like she comes off as a very nice, very, very cool person. Except in the documentary, of course, you see her drink her dreams. And because like she doesn't, they don't, she's pregnant when these initial pics come out and it's a huge disgrace and he leaves Congress, right? She stays with him. Then this mayoral campaign kicks up. She's doing the campaign stops. Everything's going really well. Then more images come out and she's they have this horrible scene. It was a great scene for us and from this documentary of him trying as soon as it happens on the phone, trying to spin it to his person or whatever. And she's",
            "start": 277.15
        },
        {
            "text": "out and she's they have this horrible scene. It was a great scene for us and from this documentary of him trying as soon as it happens on the phone, trying to spin it to his person or whatever. And she's on the phone listening in or whatever. And like it's the realization that this is happening again, that he was doing this when they said they were the number one. Like she's like pacing and you can see your start to lose it and they likely bail off to leave the room and stuff. It's really intense because you see this guy, this dirtbag treat her like **** trash over and over. Carlos Danger, Carlos Danger, treating her like trash or whatever. And it sucks because in the movie, I'm washing to do. I know my guys want his politicians. I don't mind shooting straight doing this. Had that great 9/11 speech on the floor. That was cool, right? Give him that before we knew what's happening. He's always been a piece of ****. Yeah, but he's like doing things like, all right, cool. He's gonna shoot from the hip and he's like",
            "start": 316.62
        },
        {
            "text": "that was cool, right? Give him that before we knew what's happening. He's always been a piece of ****. Yeah, but he's like doing things like, all right, cool. He's gonna shoot from the hip and he's like always gonna so **** this up. If I'm lying, I'm he loses the mayoral campaign, Tim. Okay, if I'm lying, no, he doesn't. Oh, did he? No, he just **** straight up losses. Just destroy. Not even like close. He went from being in front of, he is the last place candidate. And one of the things she stays with them. They have this kid. It's gonna keep going. She then goes and runs Hillary's campaign. She's yeah, second commander, whatever. I finish this documentary on Sunday 'cause I got tired. No big deal. There's no shame in that, Tim. There sometimes I need to go to bed. Thank you, Nick, for having my back. Sunday night, kismet intervenes. News breaks that this has happened again. This **** has been sending more nudes into this that is still under Carlos Danger. Know this, you know, he's just using his Twitter or me on his",
            "start": 351.45
        },
        {
            "text": "intervenes. News breaks that this has happened again. This **** has been sending more nudes into this that is still under Carlos Danger. Know this, you know, he's just using his Twitter or me on his Facebook. His Twitter was Twitter. It was Twitter 'cause he deleted his Twitter afterwards. He's DMing people. He's DMing. Listen to Colin sliding them DMs. Do your Twitter. Now what happens, Tim, is that he still send in these junk photos, right? He sends one that looks a lot like the original because the original was just him. It that broke the one he tweeted, right? Was just, I believe it was his, he was in the grey shorts, thinner in the white shorts, light gray shorts, then with his dick all to the side or whatever. They accidentally tweeted then delete an artist like a nice way to clearly in my head. And then he sends this pretty much the same photo in white undies to this girl and the problem is his toddler son is in the background sleeping next to him. That's its inhuman outfit. No, it doesn't.",
            "start": 388.71
        },
        {
            "text": "and then he sends this pretty much the same photo in white undies to this girl and the problem is his toddler son is in the background sleeping next to him. That's its inhuman outfit. No, it doesn't humor out there on the campaign trail with one Hillary Rodham Clinton, the next press the United States. My might think about this whole thing. It's obviously he's got some issues, but I think this would make a phenomenal, phenomenal film starring Pauly Shore as Weiner. No, he does. The Pauly Shore would be a great how **** asking that because this story's so it's unbelievable. It's it's so unbelievable that it that the fact that it's true blows my **** mind, right? In the second I was, oh, this is something if I were a writer to sit down and like, this is a great story that I'm gonna tell. No way would this ever happen or a life except that it did. No **** way does a guy get a second chance like that and it just does the exact same thing to firebomb his life. He was gonna win. People loved it. He comes",
            "start": 427.8
        },
        {
            "text": "ever happen or a life except that it did. No **** way does a guy get a second chance like that and it just does the exact same thing to firebomb his life. He was gonna win. People loved it. He comes off as a genuinely like, hey, I **** up. I **** up. I'm a person. He came off as very, very genuine, very, very like man of the people. I have 63 ideas to change New York City. It's like riding bikes around. People are screaming at him. It's this beautiful moment. This documentary, you're like, wow, man, this guy's except you know how it ends. Yeah, you can see the end of it. Oh, you see the end of Weiner before you ever get to it. But I mean, the happiness the documentarian must have felt, you know, yeah. Oh, things I know. I just, I just, just containing as hard to kids like they'll smile, don't smile. Yeah, I got it. I got it. I got it. No, they had been friends because I think he, I think if I'm not mistaken, I heard interview with him when this whole thing when when documentary was making circle in the rounds and I think",
            "start": 472.84
        },
        {
            "text": "it. I got it. No, they had been friends because I think he, I think if I'm not mistaken, I heard interview with him when this whole thing when when documentary was making circle in the rounds and I think he was I think on the honest prior campaign and then decided to quit politics and become a documentarian and that's how he got in. Like I was like, oh, we're gonna do is so they were friends and he was like, even as his friend, I couldn't believe that he was allowing me that kind of access because if you notice when the calls start coming through, he doesn't tell him to get out of the room. Yeah, it's there's three people in that room when the realization setting in and it's not recreated. This is a real moment. It's her, it's him and the guy holding the camera, right? And I think and they even asked him in the document, why'd you let me do this? It's like, I and I think the answer he gives, the subtext of the answer that gives is that I think in the back of his mind, he thought in some way or thinks in some",
            "start": 516.19
        },
        {
            "text": "the document, why'd you let me do this? It's like, I and I think the answer he gives, the subtext of the answer that gives is that I think in the back of his mind, he thought in some way or thinks in some way that there's that all press is good press. That no matter what happens, as long as people are talking about him, there power and and something positive that can come out of that as far as like him furthering his career as a personality. My interpretation of it too, I think is the fact that they knew those photos were going to come out, right? He knew there was more photos out there. He said they talked about it at some point where is like, we knew this might happen. 'Rememorable. I like it.' It's the timing. Like they're sent during the separation period after he's been caught or whatever. This is already happened with Congress, the part of it. Um, I think there's part of him that is like, best to do this documentary. Let's run for mayor. Best case scenario, I win and I'm the mayor of New York and we have a",
            "start": 553.33
        },
        {
            "text": "happened with Congress, the part of it. Um, I think there's part of him that is like, best to do this documentary. Let's run for mayor. Best case scenario, I win and I'm the mayor of New York and we have a documentary chronicling my rise or worst case scenario, we have this big moment of drama that happens in it or whatever. And it does set me up as personnel because that's the end of the the documentary, right? It's like the cut of him on Bill Maher and a million other things and cracking wise about it and doing all these different. Yeah, okay, you know, a couple. It's okay. I mean, I thing again, so recently, yeah, yeah, this week it broke and now Huma's finally act. She's like, I'm done. Separated. Got it. Yeah, got it. See, I mean, this is is this kind of did we have a topic about this about Anthony Weiner? No, we know. Yeah, we talked about Gawker. It was similar to the topic about that, right? Where it was like, when does when is it become news now that he's not a public figure and now that he's that he's just being",
            "start": 592.99
        },
        {
            "text": "Yeah, we talked about Gawker. It was similar to the topic about that, right? Where it was like, when does when is it become news now that he's not a public figure and now that he's that he's just being, I guess, I think he's a lobbyist. Don't know. Maybe Sunday. That may be so. He's just one of us. Is this a Yahoo! strike? Which is, yeah, that's my thing. Now, now that he's not no longer a politician, he's no longer in the public sphere. When does it become like not newsworthy to talk about someone just sent a dick pics to someone? Yeah, but I mean, like, is it always going to be newsworthy because a straight problem? Yeah, he's a he's a public figure permanently, right? His wife is still like, exactly, is also help me, but she's behind the scenes, right? She's not like she's out there yet. What if she's trying to separate from him too? Yeah, well, now know because of this. Ya know exactly why Kimberly keep sending dick. Now that he's separated without. Yes. Oh, yes, D. Right? What once was not whence it all was that the whole",
            "start": 634.48
        },
        {
            "text": "from him too? Yeah, well, now know because of this. Ya know exactly why Kimberly keep sending dick. Now that he's separated without. Yes. Oh, yes, D. Right? What once was not whence it all was that the whole realize whole like fascination. I think the whole thing, I can get away with this and it can be mayor. But he knows you can't get away with this. He's got to be addicted to it, right? That's got to be the thing. But it wears ladies be married as part of the addiction. I mean, this is how horrible does. Have you seen his documentary? Not, but as grants amazing. It's on it's on Netflix right now. I buy, you know, I've arrested off nicely on FX. Yeah, it's definitely worth the five min. How much it is? It's it's actually for one, it's a phenomenally well made documentary and it does what I think every documentary should do, which is it really it has a has a perspective and it shows you these characters in as real as you possibly could. I don't think that it it doesn't he does do a lot of commentary and as far as",
            "start": 675.4
        },
        {
            "text": "do, which is it really it has a has a perspective and it shows you these characters in as real as you possibly could. I don't think that it it doesn't he does do a lot of commentary and as far as like this guy's **** terrible person. Oh, no, no. I'ma show you this person good and bad. And there's moments where you're like, this the guy's not that bad. He just has an addiction to his dick. You know, he just has an addiction to doing these things. Like it is a call. We'd be like, oh, he's not holic. I get that. Or the mayor of what was it? Was it the mayor of the governor of like Detroit, Toronto, Toronto? Someone's doing crap for ya. Yeah. And then like they like, I just love crack. Did he really? They get Boyd and miss that headline. Well, or there was the guy that was caught with a prostitute doing crack too. It was like another mayor. And Marion Barry was a Willie, you know, that's why are you see, uh, not Willie Brown. Um, yeah, I know exactly your anyway, those guys. I mean, for some reason, I mean, those guys all got",
            "start": 714.31
        },
        {
            "text": "like another mayor. And Marion Barry was a Willie, you know, that's why are you see, uh, not Willie Brown. Um, yeah, I know exactly your anyway, those guys. I mean, for some reason, I mean, those guys all got reelected, right? What didn't they? Didn't. Yeah, yeah, yeah, he did in D.C. So there isn't we do have a fascination. And that's what the doctor does is like telling that human condition of like, this person has fallen from grace and now they're climbing back and we can forgive even our boat. Even though I don't believe we should be really necessarily forgiving our public figures for smoking crack with prostitutes or cheating on their wives. But because they're supposed to be the best of us, even though everyone **** knows or not. And I don't know why we even ever come close to assuming that ever. But in the documenter does a great job of painting him in both lights. It's what I'm trying I'm trying to say. So it's definitely worth the watch. It's beautifully filmed. The craziest part of it though is when",
            "start": 757.03
        },
        {
            "text": "the documenter does a great job of painting him in both lights. It's what I'm trying I'm trying to say. So it's definitely worth the watch. It's beautifully filmed. The craziest part of it though is when the girl that he sent the pictures to, ya, starts trying to confront him with a full media bridge behind her. And you're like, oh my God, this this went from one horrible human being to just a whole cast of horrible human beings trying to capitalize off of this **** thing that this one guy didn't even he's trying to capitalize either toward the Eddie. Like, how do we spin this way? I think we could spin this. And his ability there on the phone with his political advisor, Eddie, the guy's like, this guy's running his campaign. He's like, do peak it. Like, this is it. We're done. Mad. You got it. Just you gotta just give up. You got to give up. It's nuts. Yeah, it's it's interesting horns. So Anthony Weiner's an interesting case for me because I was talking I was talking to Greg about it earlier. There are",
            "start": 797.47
        },
        {
            "text": "give up. You got to give up. It's nuts. Yeah, it's it's interesting horns. So Anthony Weiner's an interesting case for me because I was talking I was talking to Greg about it earlier. There are three Democratic politicians. So I **** loathe. I loathe them. And Anthony Weiner is one of them. Debbie Wasserman Schultz is one of them. And Alan Grayson is the other one. And the reason I loathe all three of them is because they like dehumanize their the opponents. They just talked so much ****. They've all unraveled for their own way. And it's been a **** pleasure, frankly, to watch. Anthony Weiner is the reason that Anthony Weiner does like he got his comeuppance not because it was not because of his politics. It's me. And this is the thing I'm surprised you guys aren't bringing up is that when the first thing happened, he **** lied, right? Forever about it. He said he got hacked. Ya.",
            "start": 834.13
        },
        {
            "text": "because of his politics. It's me. And this is the thing I'm surprised you guys aren't bringing up is that when the first thing happened, he **** lied, right? Forever about it. He said he got hacked. Ya. Like like four days. I got I got hacked. They can't explain. I remember watching it MSNBC that night when you're Tom and I'm like, and he gave like a, you know, uh, like a gorilla kind of candid interview where he's like, I, you know, you got it. You gotta get off Capitol and go any shows. And I was like, you're full of ****. We all know you're full of ****. You're **** lying. We all know you're lying. Everyone knows. And this went on for, you know, not forever, but politics. It is. I mean, three, four cycles, you know, like at that point, it's it's, you know, I lost all respect for him. He wants to Bill de Blasio. Bill de Blasio is a nutjob. You know that good that tell you all you need. Like, you know, it wasn't like we had the best of the best running for mayor in New York City. You know, like and we never have. But I",
            "start": 874.09
        },
        {
            "text": "de Blasio is a nutjob. You know that good that tell you all you need. Like, you know, it wasn't like we had the best of the best running for mayor in New York City. You know, like and we never have. But I don't know if you know that. What about Giuliani? I love Giuliani. But I mean, you know, we've had some **** characters as mayor. Any cash like Bloomberg who who's a billionaire who just changed the rules when he was initially gonna run for a third term. It was like, I guess so that's fine. Uh, sure, why not? You're me on Bloomberg. Um, so I I like I don't like to take necessary pleasure and most of the downfall or like that the bad **** happens. People was bad **** happens to all of us. And it's but like someone like him, it's like the second, third sounds like you're an **** and you **** deserve everything that's coming. You didn't learn anything. You have a beautiful, smart wife. You have a child. You have this family life. You were given a second chance. Yeah, and even a third chance. And you **** it up.",
            "start": 913.51
        },
        {
            "text": "that's coming. You didn't learn anything. You have a beautiful, smart wife. You have a child. You have this family life. You were given a second chance. Yeah, and even a third chance. And you **** it up. So **** you. You know, like that's that's the way I feel is like there are people that would there are people in prison for nonviolent drug offenses that would kill for a second chance that would kill the Anthony Weiner and ham be an ex-congressman that gets the benefit of the doubt and they don't get it. He got the benefit that out twice. Mm-hmm. You know, so you know, **** riddance. Yeah, I mean, I feel like I feel like I agree with you wholeheartedly. But I think also there's a side of it where I mean, I think this is this is a classic addiction problem, right? He is addicted to whatever this thing is, whatever this is giving, whatever a hit of dopamine his brain receives when he sends one of these pictures out. There's something there similar to how I would imagine people have a gambling",
            "start": 953.98
        },
        {
            "text": "thing is whatever this is giving, whatever a hit of dopamine his brain receives when he sends one of these pictures out. There's something there similar to how I would imagine people have a gambling addiction, right? There's a psychological problem that he has that I just wish like the one my one takeaway was looking at him. I'm like, I wish I were this guy's friend so I could sit him down and be like, you need help. Like you have everything and you are purposely throwing that away. It's like a guy who makes, you know, gets it gets a check for fifty thousand dollars and the first thing he thinks about doing is going to a casino, right? It's the exact same thing in my brain, which is like that sucks. But that is something that could hopefully be corrected if you're willing to do that. This guy looking at his life, it looked almost perfect, right? Some people, I don't know. It's just to me, it's just always the thing though, like the look of it. You know what I mean? Well, yeah, but I'm not justifying it. Don't get",
            "start": 991.91
        },
        {
            "text": "his life it looked almost perfect right some people I don't know he just to me a citrus always the thing though like the look of it you know what I mean well yeah but I'm not justifying it don't get me wrong but clearly like his marriage hadn't been working from the get-go you'd assume right and I wasn't justifying sexting random randos he never cheated right it was always just this internet shopping Yahoo they want to go about may wanna cut it that is cheating that you know like though I know but I was saying physical I'm just trying to lay yeah I understand that but I mean to me I don't know that this guy is doubtful it's like in credit it's an incredible thing to watch like I it is a spectacle I fit you do I agree you do feel bad about it knowing who wants to watch it's almost cringe-worthy when you're like I have to watch this personal cell truck then we could talk about in the Gawker topic to your point the only difference there is that Anthony and this is what I said it was one",
            "start": 1031.87
        },
        {
            "text": "when you're like I have to watch this personal cell truck then we could talk about in the Gawker topic to your point the only difference there is that Anthony and this is what I said it was one of the caveats is Anthony Weiner's a political figure he's fair game and I and I I agree like that is fair game like that that's that's fair game because you are representing us he is literally a representative from New York City you know like there's a few million people that that are like he's the guy in front of them and so if he's shit up then that's fair game it's different than the Condé Nast guy it's different than Hulk Hogan you know like it's it's it's so uh yeah that's the bad you're right though he did really have it all and it's not just about his wife being smart beautiful it's about his connection to the Clintons it's about all these things like you're a shit you are a shit shit I mean that's that's the biggest thing they are supposed to be the smartest and brightest of us",
            "start": 1069.85
        },
        {
            "text": "his connection to the Clintons it's about all these things like you're a shit you are a shit shit I mean that's that's the biggest thing they are supposed to be the smartest and brightest of us I'm like you could have written you would have you would have been in the White House in two seconds good and I'm not saying and in terms of present I'm saying like you could work in the West Wing you could have worked in the Naval Observatory with the vice president you could have been some fun things and you or been back than that but gotten back in the house cuz God knows New York City sends shit lunatics to the house representatives every two years right so there's no reason why you couldn't gone there you could have run for this to look at our senators now in New York City and I say ours always be in New Yorker but like I that's the thing I frustrates me the most is that like he didn't know what he didn't have like a lot or anything he really did have it all like all of it",
            "start": 1107.56
        },
        {
            "text": "I say ours always be in New Yorker but like I that's the thing I frustrates me the most is that like he didn't know what he didn't have like a lot or anything he really did have it all like all of it everything and he any through the white man it's said Tim our dick pics okay I mean consensual dick pics I think that's the start of that if somebody's asking for it or you have a relationship with them that are that's acceptable then yes otherwise absolutely not in no way shape or form so I mean two it sounds like these are not consensual no these are consensual oh he was having sexting relationship that these girls girls outside Langly finals on Facebook when you are married absolutely not this is it also the cautionary tale of like you just can't try he thought he was in trusting cheating online relationships were like the dick pic wouldn't go any further than that that's that's not the moment you put it out there yeah you need to be able to literally if you're married but if you're",
            "start": 1136.27
        },
        {
            "text": "online relationships were like the dick pic wouldn't go any further than that that's that's not the moment you put it out there yeah you need to be able to literally if you're married but if you're married and your wife doesn't know yeah well no matter what my belief and it always has when it comes to dick pics or any of that stuff is never put something out there that you're not okay everybody seems sure there is that chance of that happening the moment that you take a picture on your phone it exists whether or not you uploaded to the internet you did that and that you need to live with it your folk again I there's so much things that could happen with this machine that you decided to do that with yeah you know so you got to be okay with it so make sure you're checking your ankles at all times candidates yeah I think that's the big thing towards why President Obama can't use an iPhone he's not allowed to use an iPhone or Android device us use a BlackBerry I'm think we're like because",
            "start": 1174.84
        },
        {
            "text": "times candidates yeah I think that's the big thing towards why President Obama can't use an iPhone he's not allowed to use an iPhone or Android device us use a BlackBerry I'm think we're like because they're worried about the microphone and what about all this kinda stuff like he's not allowed because like of all these things that could possibly happen what I wonder is you know you have to have some sort of there's like 530 house representatives and senators right like if you're one of those people and that person on the other end knows that you're one of those people you're it's for you what what's happening but I use it my first thought like you say that I was like I so then how does Obama take his dick pics my guess you presentable camera that we will know Tim and I always have the moment when you and Nick have adult conversations but you're like there's 537 right in me Tim's made eye contact real shit now you gonna put like first four thousand I got a lot right you attending",
            "start": 1210.58
        },
        {
            "text": "when you and Nick have adult conversations but you're like there's 537 right in me Tim's made eye contact real shit now you gonna put like first four thousand I got a lot right you attending my state to me to slippery congressman your nut situation you're gonna be blackmailed and like see I'm like in some way some shape or form you're gonna be blackmailed yeah and and that's why I mean that's that's why it like everyone's like if you just take it to the nth degree the the Obama girls don't have Secret Service agents because they're afraid they're gonna get assassinated they're afraid they're gonna get kidnapped and ransomed and and Obama's gonna blackmail to get kids back that's why they're protected like the West like you you don't like you yeah exactly so like it goes beyond that it's like these people have state secrets these people have like all these things like you have to be smart you know and it so goes beyond the dick pics it's the funny thing but the thing is is that this",
            "start": 1246.57
        },
        {
            "text": "like these people have state secrets these people have like all these things like you have to be smart you know and it so goes beyond the dick pics it's the funny thing but the thing is is that this guy can't be trusted with anything that's what you saw so you should have never been given a second chance that's why when I thought he's running for mayor I thought it was a joke I was like you kidding me yeah like Bill de Blasio and these other guys that are like are running but Anthony Weiner is like shouldn't be trusted with anything especially the most important sitting are cut in our country like Des Moines well that's why I think in a weird way we kind of need Weiner like we can we all need we're gonna mean like you know on a lonely cold evening but like it we need somebody like this to make this gigantic mistake so we all like this the thing we brought up the name we're like we think we know who that is like we better know this is we better remember this I wonder if you learn",
            "start": 1288.63
        },
        {
            "text": "to make this gigantic mistake so we all like this the thing we brought up the name we're like we think we know who that is like we better know this is we better remember this I wonder if you learn from those other politicians learn from it because I feel like if you're that unmoored right where you can't figure out is even one day an idea yeah I know it's gonna take the real sad part of it is it's a slippery slope and things like there's like what neighbors home on it's an addiction and like people don't realize unless it's cigarettes or drugs that addictions can be anything yeah and people can be addicted to porn they can be addicted to sex they going to be addicted to these feelings you have and being addicted to craving attention sexually in in this new age and like that is totally thing and that I think is the the part that gets hard because these these are people you know these are just peep and it's like yeah that's the hardest thing is like the it doesn't matter that they're",
            "start": 1324.78
        },
        {
            "text": "and that I think is the the part that gets hard because these these are people you know these are just peep and it's like yeah that's the hardest thing is like the it doesn't matter that they're they're politicians or whatever it matters in the way that like they need to be extra careful of what they say and do but at the end of the day they're just like us but I think it's more than that see like that I think creates a culture of lying it's like why I gotta be really careful so I gotta spin this story it's right have to be you oh you're not gonna come out and say the same but those who I am saying be careful you don't do it yeah is what I'm saying you have to be extra careful not to do it because you are being put under a microscope but I think that's just holding you to being a better person it's not saying that if you're not a politician that you should do these things it's just saying that like you you're accepting that responsibility on a whole of you or we have to call a spade a",
            "start": 1363.93
        },
        {
            "text": "it's not saying that if you're not a politician that you should do these things it's just saying that like you you're accepting that responsibility on a whole of you or we have to call a spade a spade right and at this point just realized that this this stupid outdated ideal that our politicians and our celebrities have to be perfect is just it doesn't work anymore right and that's what every time I see something like this I'm like this is just another example about the world technology is evolving the world faster than then then we can wrap our heads around and then fast that we can accept right is that guess what yes everyone is a sexual being everyone does this stuff everyone you know guys cheat on their wives why women cheat on their husbands like this stuff happens right it doesn't make a person terrible but the fact that matter is we still have this puritanical ideal idea that when we elect someone to office they then they have to be a perfect human being or a sports star a",
            "start": 1402.18
        },
        {
            "text": "make a person terrible but the fact that matter is we still have this puritanical ideal idea that when we elect someone to office they then they have to be a perfect human being or a sports star a person who's a quarterback or you know you know Michael Jordan or or Tiger Woods has to because he's so good at this thing that he has to be perfect and it's like no that's stupid that's not telling anyone anything that have any merit or value right because no one's perfect these are just really human beings that are accomplishing these things I I don't understand why we still has guarded this ideal that politicians are all good wholesome people I don't understand that there's so much evidence to the contrary why can't we just rejigger the way we think of you know people that are supposed to be going representing us I think the I think the major screw-up was that when he got that second chance to me again it's not like okay how do I how do I be a good politician now it's like you need",
            "start": 1443.13
        },
        {
            "text": "to be going representing us I think the I think the major screw-up was that when he got that second chance to me again it's not like okay how do I how do I be a good politician now it's like you need to take a long hard look at yourself right and you don't do exactly amen and you need to be firm and you need to uh really loving really drastic action really be really honest and prickly be uncomfortable you know that I really but we were to see you admit this you know and like I think that's I I think he yeah I think it's less about how anything is political advisor could have done or anything is sure he could have helped him with like you really needed to probably just back out of politics altogether for you know a good amount of time I'm just kind of you know look in the mirror and be like okay why am I doing this like I have all this stuff and yet it's not really what I want to do yes I just want to send it to my dick pics is very very important to me yeah yeah there's a market for that",
            "start": 1487.8
        },
        {
            "text": "okay why am I doing this like I have all this stuff and yet it's not really what I want to do yes I just want to send it to my dick pics is very very important to me yeah yeah there's a market for that there's market for anything on Patreon",
            "start": 1526.83
        }
    ]
}