{
  "id": 46,
  "video_id": "MVIlmrbWLZI",
  "show_name": "A Conversation With Colin",
  "hosts": ["Greg Miller", "Portillo"],
  "title": "Where Are New Conversations with Colin and Oreo Orations?",
  "description": "Holy cow, chemotherapy sucks. It's so bad, Greg's taking a break from A Conversation with Colin and Oreo Oration -- but just until we get to 2013. Get the full scoop!\n\nSUBSCRIBE/LIKE/SHARE\n\n- A Conversation with Colin-\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\n- Oreo Oration - \nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\n#OreoOration Playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&feature=plcp\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325",
  "published_at": 1355234435,
  "duration": 141,
  "transcript_chunks": [
    {
      "text": "Oh , hi there, it's me, Greg Miller, GameOverGreggy here on that there internet. You know, we've had a lot of good times in this kitchen table with the old Conversations With Colin, the Oreo Oration. We have a lot more good times in the future, but as many of you know , I've been fighting this year, cancer. The cancer's gone, still doing a lot of chemotherapy for the cancer and it's getting to the point, ladies and gentlemen, wo, these final chemos are just beating the living out of me. It's, it's rough. So what I found is that I got no energy to come home and edit videos for Conversation With Colin , for Oreo Oration. Not canceling these shows, mind you. These shows are still very much in production, but we're going to take a break till 2013 when I'm back on, uh, the healthy train there, as healthy as somebody who eats chicken wings and pizza every other day can be. So don't panic, the shows will be back in 2013, but we're going to take our, we're going to take our winter break here just like Nashville just did over on",
      "start": 6.28
    },
    {
      "text": "chicken wings and pizza every other day can be. So don't panic, the shows will be back in 2013, but we're going to take our, we're going to take our winter break here just like Nashville just did over on ABC. Great show, if you're not watching Nashville, by the way, please watch Nashville. Uh, while you wait for more Oreo Orations, while you wait for more Conversations With Colin, make sure you subscribe to my channel right here, then make sure you click here to go to the Conversation With Colin playlist, then click here, go to the Oreo Oration playlist. Uh, plenty of content there. I'm sure you've missed a few episodes, no big deal, you go get them. The best part about, of course, the Oreo Oration ones, a lot of people have left video responses since we started doing that. So go back, look at old episodes , look at what people said. You click on, oh my gosh, look at that Casey Wayan, he's talking about Oreo Orations and Oreos there. I like that. Uh, you know, for sure on this video, feel free to leave the Oreos that I'm missing,",
      "start": 43.8
    },
    {
      "text": "said you click on, oh my gosh, look at that Casey Wayan, he's talking about Oreo Orations and Oreos there. I like that. Uh, you know, for sure on this video, feel free to leave the Oreos that I'm missing, that I still need to review. On this video, feel free to leave Conversations With Colin you'd like to see. That guy's crazy. I'd love to see what else he has to say, but you have to tell us what it is. So we've covered the big things. Don't worry, not, I'm not dead, that's the good thing, not dead yet. Uh, coming back, uh, tired, very tired. So I'm going to break till 2013. Conversation With Colin, subscribe, Oreo Oration, subscribe. While you wait, we will continue over on that thing called Start, youtube.com/ start to do up at noon every Monday. Go check that out. Mike Ducker writes it, Brian Alano is fat on it. Um, um, and until then, I mean, just keep it on YouTube, subscribe to GameOverGreggy, follow me on Twitter, all that stuff. I goddamn these kids in this house. Thank you, good night. [Music]",
      "start": 80.0
    }
  ]
}
