{
    "id": 4241,
    "video_id": "pEyFDWhzk_Y",
    "show_name": "Cooking With Greggy",
    "hosts": [
        "Greg Miller",
        "Kevin Coello"
    ],
    "title": "How to Make Buffalo Blue Burgers - Cooking with Greggy",
    "description": "Greg's back with Second Helpings to show you how to make some bomb ass Buffalo sauce/blue cheese burgers. \n\nBURGERS\n1) Take about a pound/pound and a quarter of 80/20 ground beef and mix it in a bowl with your choice of seasoning. I say you use Joe Beef steak seasoning and worcester sauce. Mix it good.\n2) Get a handful of beef, and pound them from the center out. You want a divot in there.\n3) Put a cast iron skillet over medium high heat. Toss a hunk of butter in there. Toss the Burgers in there.\n4) Cook them until their done through. I dunno. Five minutes a side? Pay attention to them and try not to flip them more than once. \n5) They’re done. \n\nSAUCE\n1) Take a big ol’ hunk of blue cheese and put it in the bowl.\n2) Dump some Frank’s Red Hot in there.\n3) Mix it up.\n4) Taste it. You like it? If not, add more sauce or cheese and mix it up. Like it? You’re done.\n\nToast your buns, put the burger on the bun, and top with the sauce. Enjoy!\n\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.\n\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1556035247,
    "duration": 992,
    "transcript_chunks": [
        {
            "text": "[Music] [Applause] [Music] what's up everybody welcome to cooking with Greggy second helpings we are back and guess what we're gonna show you some easy meals you shouldn't be afraid when you go into the kitchen isn't that right next door you know heck yeah don't be afraid of your kitchen don't be afraid of the kitchen get in there and cook that's what cooking we've got you one was all about and then afterwards you guys were like that was great can you show us cheaper even easier things and I said I sure can for the most part so second helpings here we're starting with the buffalo blue burger if you follow me on instagram comm slash game over Greggy you might have seen me a few months ago put up this buffalo blue burger on the hashtag cooking with the Greggy thank you all so much for using it it's incredible to see your support and what it was is that at the time we were sponsored by Frank's Red Hot to go do a cooking with Greggy on Instagram bring back cooking with drag you use it and",
            "start": 0.39
        },
        {
            "text": "it it's incredible to see your support and what it was is that at the time we were sponsored by Frank's Red Hot to go do a cooking with Greggy on Instagram bring back cooking with drag you use it and make a buffalo obviously Frank's red hot sauce mix it in with some blue cheese and make a burger now my whole thing about it is as you know I will dip my wings in ranch like a real gentleman these blue cheese is for the peasants as I always say so I've never been a big blue cheese fan and so when I did this activation with them I was like I'll try this out and see and by golly was it amazing and so here we are not sponsored by Franks now again Nick you run the finances yeah is if we do this right now can we charge them for it later yeah absolutely perfect so Frank's if you like what we do today give us the money and if you don't whoever edits this or you know what we'll put out a director's cut of this where we just bleed Franks over and over again all right so what I have here about what",
            "start": 47.91
        },
        {
            "text": "give us the money and if you don't whoever edits this or you know what we'll put out a director's cut of this where we just bleed Franks over and over again all right so what I have here about what jeez Louise pound pound in a little bit maybe two pound into 2.5 you know to pound on quarters they say of a 80/20 ground beef I got my blue cheese block over there I got my Frank's redhot I got worst rooster sauce and then I got a job 'if spice mix that I love quite a bit if you think about burgers a long time ago is I went to tailgates right and we wouldn't know what the hell we were doing so we would just take the burgers me & poby and stupid kids straight out of the freezer boxes toss them onto the the grill there the propane grill and think man we're tailgating this is great it was until I moved in with one Mike Mitchell back in the day and started going to 49ers games that he would go to these tailgates and just go crazy and he'd had these amazing burgers I was like what are you doing",
            "start": 89.25
        },
        {
            "text": "moved in with one Mike Mitchell back in the day and started going to 49ers games that he would go to these tailgates and just go crazy and he'd had these amazing burgers I was like what are you doing with these burgers they're insane he's like you just use salt and pepper Him and you put some oyster sauce in there and I was like you are brilliant man like Mitchell and I appreciate you so ever since then I've been doing it I'm using yeah this is a spice mix I like it's the same stuff I put on steaks I think I might have done it in cooking with Greggy before I put it in the ground beef you can put whatever you want into your ground beef of course a lot of people put onions in there some people put pickles in there you ever seen that Nick yeah pickles in a burger boy I feel about that no no yeah see that's the thing I don't this is supposed to be simple right you could do it with salt and pepper in the Worcester sauce you it was just salt and pepper you could just put the freezer burgers",
            "start": 131.91
        },
        {
            "text": "see that's the thing I don't this is supposed to be simple right you could do it with salt and pepper in the Worcester sauce you it was just salt and pepper you could just put the freezer burgers in there you know what I mean I think it's better to make the patty yourself have some love and care in there make it feel like a man you know get in there knead it general my massage is good and then I'll tell you why everybody because when she's not here I'm pounding this meat visible nobody's ever seen bare bare do you feel it yeah there's so many of us here it's awesome fun right and I feel like you know season one we're all I call us and make a real cookie show this time around man dicks out what a carry yeah right oh so what I like to do is pound it out and look at it right and like is that enough did I do good and then I did I think of like oh I want to put more in there but I don't want to touch with my hand so I go get a paper towel I'm very I don't want to kill anybody that's always",
            "start": 164.28
        },
        {
            "text": "enough did I do good and then I did I think of like oh I want to put more in there but I don't want to touch with my hand so I go get a paper towel I'm very I don't want to kill anybody that's always the thing right we talked about this before right Nick yeah I love cooking my fear is I'm gonna make something ever he's gonna poop the pastry dice that is the nightmare scenario for my number one fear in life well especially via cooked it and you know like I brought up the other day undebatable which was many months ago for you watching this you know I remember when jack-in-a-box killed somebody and I'd never heard a jack-in-the-box before then and so I was like I'll never eat a jack-in-the-box and I've only done it once and I didn't die but I'm not risking that in my house I don't want to be on the internet and on the TV is like oh man remember that guy used to review Oreos he killed for sure [Music] I can't promise I won't grab her you know stogie no need I like to make about a",
            "start": 211.83
        },
        {
            "text": "to be on the internet and on the TV is like oh man remember that guy used to review Oreos he killed for sure [Music] I can't promise I won't grab her you know stogie no need I like to make about a palm-sized ball and then start flattening it out now key to burgers not making these on a cast-iron skillet of course because I live in San Francisco and don't have easy access to a good grill you start pounding it out you want to put a divot in the center though so that when they get on there they don't turn into hockey pucks and puffs if you put it in there flat like you think oh that's gonna be perfect like they do in like the Burger King commercial then it'll actually puff up and get all small weird they got to go in there you got to spread it out break it out like that Pat it down like that put a little divot in there right you can almost imagine let's put in some maybe that buffalo blue soft room make here a little bit in there do it that one gonna make three out of this pound and a",
            "start": 247.68
        },
        {
            "text": "put a little divot in there right you can almost imagine let's put in some maybe that buffalo blue soft room make here a little bit in there do it that one gonna make three out of this pound and a half you could go bigger you can go smaller you can scale the recipe to you how many people are in your house right now like a question like I'm a cop right how many people in your house right now gnarrk man I've never seen cool Greg more fun than that time I accused him of being a narc he took that real seriously and I don't think our relationships ever recovered there's things like that you live and you learn you know what I mean now I know like cool Greg isn't a narc and I know he can be trusted with the secrets and the body now you might say Greg how long you to put you're gonna do these cast-iron how long you keep them on there I'll tell you what man you look at recipes on the internet and it ranges people are like oh you're cook them like I cook my steaks obviously which I went like",
            "start": 289.82
        },
        {
            "text": "how long you keep them on there I'll tell you what man you look at recipes on the internet and it ranges people are like oh you're cook them like I cook my steaks obviously which I went like fast right remember jack-in-the-box killed somebody it was the burger wasn't don't shake your head that's how it is and like people are tell every ette watching 20/20 Hugh Downs Barbara Walters and they were talking about it's kid eating this burger and at the end Barbara Walters said remember always always order your burgers well-done and I was like if Barbara Walters says it she's already old so I know I can trust it because I want to grow up to be old - this is a kid how long you're gonna cook the burgers for but somehow you managed to bring Barbara Walters into the conversation so anyways Internet I'll tell you you know some people say two minutes aside some will say three I end up usually going wait longer I would instant read thermometer they go back and forth with of course don't be afraid",
            "start": 332.96
        },
        {
            "text": "I'll tell you you know some people say two minutes aside some will say three I end up usually going wait longer I would instant read thermometer they go back and forth with of course don't be afraid to cut one up and look and do it stuff like that I'll usually go more like five and I think I might because there's not even heat distribution on my stove and stuff like that but who knows speaking of Stoke Greg way as I fall back here we're gonna fire at my trusty cast-iron skillet like I said I'm doing it similar to how I do my steaks so I want a really high heat on it so I'm gonna go you know between medium and high and can we call it medium high but I always go more towards the high cuz I want that char but then again I don't want them to be wrong side and I kill Barret I don't think of you I paint it's hot hot as I like it I'm gonna get in here get a good dollop of butter and then you start eyeball again cooking not exact science it's jazz you're gonna tell me Louie Armstrong used to",
            "start": 383.22
        },
        {
            "text": "I paint it's hot hot as I like it I'm gonna get in here get a good dollop of butter and then you start eyeball again cooking not exact science it's jazz you're gonna tell me Louie Armstrong used to walk into the club and know what instrument he was gonna pick up no he didn't he just jumped in there and he's like is it trumpet tonight I don't know Lou Lou Lou no and it's a sex slide all my butter to burn that happens a lot to me because I talk too long or something let it go the butter is in there the way I want it now my Big Daddy burgers are in there the way I want them [Music] I'm gonna let them sit eka set a four-minute time let him go for four like I said I like I let him go too long but it's cuz I'm a big weirdo about people dying and again they're always juicy inside because I'm locking in that flavor this is the thing about cast iron is that gets there it Sears it in it keeps the juices locked in I used to use grill pans that could dry out so easily not a big fan while that",
            "start": 423.01
        },
        {
            "text": "locking in that flavor this is the thing about cast iron is that gets there it Sears it in it keeps the juices locked in I used to use grill pans that could dry out so easily not a big fan while that goes we're gonna get to what makes these obviously Buffalo blue burgers so I have this big old chunk here of blue cheese and like I said I know what you're thinking Greg you've turned your back and everything you loved you never talked about blue cheese you sold out again this isn't sponsored unless Franks wants to now also if somebody else wants to we'll do two versions alright cuz I think I have crystal in here to know here I got I got sweet baby's raised so if if Frank's refuses our demands an editor take a shot of this you know it ends at Andy screencap it right now I'll be quiet thank you give your consideration on that one Greg your editor loves you and then what I need you to do is cut it out with Photoshop and then you can paste that over anything right I'm telling you it's all",
            "start": 489.61
        },
        {
            "text": "you give your consideration on that one Greg your editor loves you and then what I need you to do is cut it out with Photoshop and then you can paste that over anything right I'm telling you it's all it's you got it now right we're not using that but that's what it is you can any any hot sauce you want to use cuz again they didn't do it so I'm just gonna take the blue cheese I'm gonna put it well but throw some right there for some reason put it in there I'm again you know how much should I use Greg what just use a lot what I found is that even when you have leftovers you can save them on the side put them on anything you know what I mean somebody tries to feed your vegetable put it in this you got the yeah yeah your buffalo blue you're all set it looks like a good amount but I'm gonna still put more in there right and then you're like all right cool what are the ratios mr. Miller and the ratio is our man just let it go just let it go look you can do it and see what you want it to be",
            "start": 533.86
        },
        {
            "text": "put more in there right and then you're like all right cool what are the ratios mr. Miller and the ratio is our man just let it go just let it go look you can do it and see what you want it to be like you know what I mean everybody was like I'll make these recipes simple and make them cooler what do I just do there I said you can put anything you want in that burger you want to put pop rocks in and go ahead whatever I'm not gonna stop you don't put pop rocks in the burger you don't know do that idea remember when they said don't put trying to make it she's like what was a good cheetah they put something in man they put a ranch and she knows it was not good and I'm Lucchese cheetah wasn't that good well you're gonna like this blue cheese mix I'm Haley I have me like that believes you think's getting missing so yeah just keep on spreading that around I feel like I want to hog wild with the Franks out the gate I use a lot more than I did the first time when I distress me but guess what",
            "start": 574.42
        },
        {
            "text": "getting missing so yeah just keep on spreading that around I feel like I want to hog wild with the Franks out the gate I use a lot more than I did the first time when I distress me but guess what I'm not screwed because I got more cheese I want a more of pasty substance you know Nick yeah I'm not looking for a very liquidy liquidy and he's go on after the burgers oh yeah yeah this is the topping what you're gonna do I didn't pull it I'll get it I got you do a lettuce you do the burger you do this on top okay you're gonna flavortown buddy you want to go to flavortown Nick I'd like to live in a flavortown thank you are they renting I think they only buy okay well I can't afford it then well I mean we've cheaper than here so as you can see Oh echo stop we'll get back to this I got stop echo I love you stop echo play Hall and Oates no will get claim all right see you come over here oh my god echo stop shut up as you can see they're getting they're getting what I want they got a good Brown",
            "start": 616.79
        },
        {
            "text": "love you stop echo play Hall and Oates no will get claim all right see you come over here oh my god echo stop shut up as you can see they're getting they're getting what I want they got a good Brown going on there I'm gonna come over here watch this bad boy Wow look at that char that's what I like in a burger power they get happening again oh these are looking great guys I'm off I'm off water in here too damn it sit right there are you tall enough to stop it they're coming for us [Music] okay so we turned off the fire alarm that's the one thing about it what I don't like about my kitchen of course I rent so I can't change it is that the exhaust fans back here there's no hood in the front so when I cook anything on the front burners will show the big burner is the most powerful burners guess what happens it just goes up and then goes right to the smoke alarm then all hell breaks loose we're fine now what happened I grabbed some lettuce like I said I forgot to build the burgers the",
            "start": 660.11
        },
        {
            "text": "guess what happens it just goes up and then goes right to the smoke alarm then all hell breaks loose we're fine now what happened I grabbed some lettuce like I said I forgot to build the burgers the burgers are still going I use this and read thermometer over there to check I'm trying to get amino 160 165 there below that and but more importantly for me is I've made these burgers before it's the fact that when I go over there and poke them they don't have the right texture right we all have eaten the cheeseburger we've all know what a burger patty that's done should feel like that's still very loose it's more similar to what I when I was pressing over here which gives me more time to go over here keep combining my Buffalo bloomix here now what I was saying before before I was rudely interrupted by everything going to help if you look at it you can see we're no longer the bright red right we have this nice orange going we can see that the blue cheese is gone and mellowed the sauce but",
            "start": 725.2
        },
        {
            "text": "by everything going to help if you look at it you can see we're no longer the bright red right we have this nice orange going we can see that the blue cheese is gone and mellowed the sauce but it's still lumpy as you can see so I don't really want to get in there and get a more smooth mixture I gotta use the spoon in the back of the spoon crush it down get in there and make it the way I want it again it's up to you your texture your taste again as you can see I've made a ton but as I said before I don't really like blue cheese so what am I gonna do with this thing and blue cheese if I don't use it on this and again you could you could dip batteries in this stuff and I'd eat it it's that good oh yeah were there baby we're there again oh my god it's just the mellowed Buffalo right in the it removes some of the heat it still got the kick in the tang obviously well the buffalo sauce the heats gone and then the abrasiveness of blue cheese that I'm not a fan of also mellowed out they come",
            "start": 759.67
        },
        {
            "text": "removes some of the heat it still got the kick in the tang obviously well the buffalo sauce the heats gone and then the abrasiveness of blue cheese that I'm not a fan of also mellowed out they come together they make this beautiful orange baby I'm Nick don't you want an orange baby god yes thank you Nick always said that you have that's true I said orange if I can't have orange bright red platon Nick you want lettuce on your nothing no really are you eat any of this no yeah okay you got me for a second there so assembly line it up here Pramila you know you like it cut Neff don't you do what you're doing it you know Kevin's gonna eat more food called more great not cooking with off-camera Kevin so you want it like that you want like an X okay I got you big guy is there a show pony right there these little guys are embarrassment but then this is the coup de Gras you know pack pack - I was too hard on the other paws I feel like I had to stop there you know and there you go Buffalo blue",
            "start": 808.15
        },
        {
            "text": "these little guys are embarrassment but then this is the coup de Gras you know pack pack - I was too hard on the other paws I feel like I had to stop there you know and there you go Buffalo blue burgers okay so we took our Beauty shot we also put more on there of course you can see it all dripping off on the sides there being delicious and amazing so I'm gonna jump in to the show Pony burgers we talked about a look at it you want to squeeze it like that to see it come out sides oh my god Nick does it do it for you god yes in a way that makes me question a lot about myself yeah oh my god no it's alive it's everywhere Chemical Mito can get by it can we go and give calf calves a little bite calf can't bite bite oh god that's juicy right this is what I'm talking about the cast iron locks in with juice and as you can see this is the big boy I was worried about killing us not kill not overcook perfectly done you gotta get in there you gotta Tomino obviously make some mistakes look around",
            "start": 867.23
        },
        {
            "text": "with juice and as you can see this is the big boy I was worried about killing us not kill not overcook perfectly done you gotta get in there you gotta Tomino obviously make some mistakes look around see as you go but yeah they killed it I don't I say they I mean milk me because I made it right that's cooking with Greggy the Buffalo blue burgers what do you think of my recipe once you use it go ahead and try it what would you do differently would you put the onions in there I want all your YouTube comments of course you guys like it Kevin likes it Jenna didn't come out well is it as good as that first time we made it okay good well like I said super simple super easy impress your friends loved ones and anyone else is a funeral home until next time know it's been our pleasure to serve you [Music]",
            "start": 940.66
        }
    ]
}