{
    "id": 2230,
    "video_id": "G8ZKI5m808M",
    "show_name": "Miscellaneous",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Street Fighter II: The Animated Movie - Kinda Funny Watch-A-Long",
    "description": "Thanks to Crunchyroll for sponsoring this video!\n\nGet your free Crunchyroll Premium trial to watch-a-long with us at http://www.crunchyroll.com/kindafunny\n\nStreet Fighter II: The Animated Movie http://www.crunchyroll.com/street-fighter-ii-the-animated-movie/street-fighter-ii-the-animated-movie-street-fighter-ii-the-animated-movie-dubbed-716297\n\n\n\n\nLet us know what anime we should watch with you next in the comments!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1481562001,
    "duration": 5813,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to Kinda Funny Watch-Along the second one we've ever done today Nick yes we are watching Street Fighter II yes the animated movie God bless it I love this movie I'm excited to watch it again I haven't seen it in a very long time yeah so this should be fun so here's the deal if you're if you're not familiar uh what you got to do is go over to crunchyroll.com kindof funny get a free 30-day trial of Crunchyroll Premium which will allow you to watch the show ad-free in HD alongside with us what we're going to do is say 3 2 1 hit start watch it together if you join in later you can come find where we're at we're doing it live with chat on Twitch right now we'll be able to talk to the chat as things go on but then later this will be posted on YouTube you can leave comments below letting us know what you want us to watch for the next episode of Kinda Funny Watch-Along you ready for this I am are y'all ready for this at home engage I'm going to assume that you are so",
            "start": 0.08
        },
        {
            "text": "below letting us know what you want us to watch for the next episode of Kinda Funny Watch-Along, you ready for this I am are y'all ready for this at home engage I'm going to assume that you are so here we go Kevin you ready mhm three two one and here we go can you guys hear yep oh yeah 480p the highest solution yeah I don't think this was actually made in St in HD I think this was an SD movie it's crazy yeah Dark Times **** yeah yes this is so good there's something about this genre of '90s rock that's just baller as hell oh man yeah boy this is hype as **** group tack this style of Animation is so awesome it's so awesome and I feel like you don't get this anymore you know what I mean it's like takes too much time it's too hard that's the problem yeah it's all CG now I've been watching uh lately I went back and watched the old Spawn cartoon on HBO loving that as well but it's that hardcore animation where you're like this is just not tenable it's not ten yeah this came in such a",
            "start": 40.48
        },
        {
            "text": "uh lately I went back and watched the old Spawn cartoon on HBO loving that as well but it's that hardcore animation where you're like this is just not tenable it's not ten yeah this came in such a great time too because like we were getting so burned with video game movies but this was like it felt true to the spirit of it like you saw the art of this and you're like that's what you imagine Street Fighter to be yeah it's a got growing up I always thought his name was Sagat like Bob Saget always come to mind made him a little less intense no it's that guy just he just did a muscle scan I don't think that was him I think it was isn't it someone else who's watching him yes yeah oh thank you God look at those shoulders I love that Sagat was the kickboxer too that was always the coolest thing is they had the different styles yeah but Sagat had that like that real fun like actual traditional kickboxer style like from Thailand damn look how **** big he is yeah he's like a",
            "start": 139.72
        },
        {
            "text": "coolest thing is they had the different styles yeah but Sagat had that like that real fun like actual traditional kickboxer style like from Thailand damn look how big he is yeah he's like a giant but I mean you're right that's the cool thing about Street Fighter II they really nailed the whole not only is everybody from different parts of the world but they all have different fighting styles that are mainly focused and based on where they're from yeah and I love the uh it's basically the Ultimate Fighting Championship before the Ultimate Fighting Championship was a thing yeah Street Fighter 2 especially like the cast was so representative you know oh yeah oh yeah man man it's the Rivalry is oldest time itself give it to him give it to him oh I love that and I love that this is before he got the scar on his chest and that's what gave him the scar wait really that's awesome get some just cut his chest open with his sure Colin has such good impressions of the sounds",
            "start": 219.88
        },
        {
            "text": "he got the scar on his chest and that's what gave him the scar wait really that's awesome get some just cut his chest open with his sure Colin has such good impressions of the sounds does he he has little Ryu (not J) Jamrock says Street Fighter was the original Overwatch that is a astute comment it's it's it's that's a stretch but yeah I'll give you that verdict I'll give you that I always wanted um my arms to look like his and they never did I feel like that's still your goal oh it's totally my goal hey you don't have to do that here we go look his leadership capacity is off the chart potential fighting capacity 3620 there we go yes yes yeah the movie Now what's funny about this is I think this came out after the uh Vanam (not vanam) movie if I'm not mistaken and I think I remember that being hilariously how much better this movie was than the Vanam movie I'm gonna look that up real quick while we're watching I think that's right I also love like how in depth this goes with the",
            "start": 277.56
        },
        {
            "text": "that being hilariously how much better this movie was than the Street Fighter II: The Animated Movie I'm gonna look that up real quick while we're watching I think that's right I also love like how in depth this goes with the Street Fighter story and lore whole Shadow Law and all that stuff I also like how their special moves like the Hadouken and stuff like that are special in this like they can't just spam them over and over you can't you got to just like you got to get the power up Cammy's about to just kick someone you can't with Chun-Li you go oh yeah s I'm sorry oh jeez get out of here way I'm sorry uhoh there we go yeah that gratuitous butt shot yeah you got to get that Cammy cosplay why not little Bay um ma'am we've we've talked about your uniform you can't wear that anymore it's not politically correct we have to have you in a black suit did you get the email did you get the email top secret operation to destroy Shadow Law do we get guys we got to get a better you got to",
            "start": 368.08
        },
        {
            "text": "\"It's not politically correct, we have to have you in a black suit. Did you get the email? Did you get the email? Top secret operation to destroy Shadow Law. Do we get guys? We got to get a better name for this. Okay, so this was '94. The **** is that Omaha State? Oh good, there we go. See, look, look, say B Rock but look up there it says M Bison. Oh wow, look at that. He's Balrog. Did you know about all this? Yeah, yeah. The M Tyson... Mike Tyson, Mike Bison. Yeah, those of you at home who don't know in Japan, three of the main bad guys' names were all switched around because they couldn't call the boxer M Bison, which is weird. I guess they didn't want to get sued by Mike Tyson. It'd be ridiculous. I mean, it's kind of a blatant ripoff of Mike Tyson, but H yeah. So what's the word on the movie? Uh, sorry. Oh, same year, same year. Interesting huh, interesting. Oh my God, remember Street Fighter: The Legend of Chun-Li in 2009 with Kristen Kreuk. Yeah, I don't think I ever saw this. Oh my\"",
            "start": 441.88
        },
        {
            "text": "Street Fighter II: The Animated Movie - Kinda Funny Watch-A-Long\nthe movies uh sorry oh same year same year interesting huh interesting oh my God remember Street Fighter the Legend of Chun-Li in 2009 with Kristen Kreuk yeah I don't think I ever saw this oh my God but I remember this is like this is Kristen KR like oh hell yeah look at that flat top oh what's up CHun-Li how you living dog she wearing that outfit I see completely inappropriate just want everyone to know that damn you hear that yeah yeah and there's a lot of cross-eyed stuff in this movie yeah I remember uh brush head I mean his hair it does look like a brush the boxer has intense cross-eyes Central West say go home and be a family man yes oh there we go some cool action are we in India or am I just really insensitive and they're in Thailand yeah I think they're in Thailand yeah like I don't yeah uh what is this song I thought you I thought you knew this song no no no no that's the thing the the so the Japanese and American versions have totally different",
            "start": 513.12
        },
        {
            "text": "in Thailand yeah like I don't yeah uh what is this song I thought you I thought you knew this song no no no no that's the thing the the so the Japanese and American versions have totally different soundtracks but they are just like random collections of songs that's the one of the problems like they to Street Fighter has such great soundtrack that I wish that they kind of made remixes and **** but they didn't just sad this shit's hot Admiral Chris Tim who's your main I'm not great at Street Fighter but Chun Li's my girl who who do you use uh usually Caner youw I always like want to pretend like I'm not a Ken fan but I am I love can it didn't used to matter now it does matter cuz they're different but a lot of people are asking what we're doing now we're doing a watch along where you can go to Crunchyroll.com KindaFunny get a free premium trial to watch Street Fighter II: The Animated Movie along with us if somebody in the chat one of the the mods or Ziggler or somebody cool could",
            "start": 617.56
        },
        {
            "text": "\"Go to Crunchyroll.com, Kinda Funny get a free premium trial to watch Street Fighter II: The Animated Movie along with us. If somebody in the chat, one of the mods or Ziggler or somebody cool could uh every once in a while remind the chat leave some links that would be dope. We yeah we're talking to y'all having a good time, having a great time. We have lunch delivered, it's going to be Fun. You guys should get pizza too, Pizza together. Let's see who did the move, dang there lots of stuff happening here uh people asking if we've seen this anime before. I have seen this anime but it's been years, I don't think I've seen it since 1994 so it's been a long time yeah I think I saw it probably last in like 1999 or that 22 years this 22 years old is that is my math right on that yeah that makes sense that's wild on E classic Nick phase yeah boy look at these dudes walking through like what up if I if I worked for these guys like if I signed up for this group of like yo I just I lost my job and I've\"",
            "start": 668.24
        },
        {
            "text": "wild on E classic Nick phase yeah boy look at these dudes walking through like what up if I if I worked for these guys like if I signed up for this group of like yo I just I lost my job and I've been down on my luck and there's this new group hiring right and that was my job interview I walked in and saw these guys i' be like you know what guys I'm going to go work in the sweat shop I don't you guys look like a bunch like a freaky a freaky decky group of people you're all like why are your shirts off constantly you got a A guy that's obviously a boxer walking around with boxing gloves right right right he got this dude with freaking bandages and a giant Scar and this homie the cyborg we got Bison without the eyes could we put some clothes on him yes we could but then we can't look at his salty thighs salty all right damn look at Vega's claw that thing doesn't this **** scrape like I be like this yo who scraped the wall I'm looking you Vega and like I didn't do it I'm from Spain",
            "start": 717.28
        },
        {
            "text": "thighs salty all right damn look at Vega's claw that thing doesn't this **** scrape like I be like this yo who scraped the wall I'm looking at you Vega and like I didn't do it I'm from Spain like yeah **** it's not a Spanish accent Kevin can you do a Spanish accent Kevin give us an Espanish accent Kevin oh Kevin chuchi B Ben pener 2 says Nick if you could get jerked off by Honda would you turn it down no I would do it just say I did it cuz he does the whole yeah I think be cool but I worry that'd be a little overzealous I'm not that girthy like I'm not that big so like if you went up with me he either's going to lose it or it's going to take it off and I need that **** yeah you do really the only joy I have at this point in life Sterling says Entourage the first ever CrossFit yeah right those guys are doing they're like the strongest man competition ever it's good and cut to Ryu doing katas on a Mountain Top does this bring you back Nick why do",
            "start": 769.16
        },
        {
            "text": "the first ever CrossFit yeah right those guys are doing they're like the strongest man competition ever it's good and cut to Ryu doing katas on a Mountain Top does this bring you back Nick why do you remember this so well to your Shadow Boxing days break in when you like this could have been Reus them it would have been great let me do this way punch punch punch punch punch punch yes I love this so much because this is when karate if you were a black belt in karate you literally were Untouchable you were the cool kid you were the coolest kid no one could touch you no one could ever beat you look at his bandana just look how much why is it so long you know where he got that bandana from right we're about to find out we are about to find out we're about to find out skipping a be he knows everything yeah look at that he just did it oh you have to practice it the thing about the Shoto is that you have to practice it otherwise you can't get the height MH you know what",
            "start": 824.56
        },
        {
            "text": "a be he knows everything yeah look at that he just did it oh you have to practice it the thing about Street Fighter II is that you have to practice it otherwise you can't get the height MH you know what I mean a pineapple it's your dude Ken Masters there he is what I loved about this was um the actual choreography in this is awesome yeah you're right though we don't get things like this anymore and like back then it was it was fairly common like yeah they would just make these things but a lot of yeah and we just don't get this like it's just a different style you know like they went for a very like a almost a real a more realistic Style with it you know was beautiful very floaty though well he's Ryu It's a flashback he's remembering this that's why it's floaty well I'm saying they're the gravity like they're well they're uh kung fu fighters so you're right you're right they are you're a master of karate you can literally defy gravity sloughing off I'm definitely not",
            "start": 886.72
        },
        {
            "text": "the gravity like they're well they're they're uh kung fu fighters so you're right you're right they are you're a master of karate you can literally defy gravity sloughing off I'm definitely not accusing you of that whoa whoa sorry nice sacrifice throw eventually I'm going to be a bad **** in the United States there's something about these instruments that just screams **** winded mountain tops yeah it screams wind it screams mountain tops it screams mid90s and it screams karate karate yeah what I what what martial art was he supposed to be a master of I'm gonna look this up real quick oh there we go yeah boy get in Seattle there's that Alice in Chains everyone's talking about M. St Queen 5000 says do you guys remember Three Ninjas oh yeah of course we remember Three Ninjas how many Three Ninjas movies you watch Nick uh I believe I watched at least the first two okay I don't know if I got beyond that though wait you mean you missed the one with Hulk there's four of them",
            "start": 951.84
        },
        {
            "text": "\"How many Three Ninjas movies you watched, Nick? Uh, I believe I watched at least the first two. Okay, I don't know if I got beyond that though. Wait, you mean you missed the one with Hulk Hogan? There's four of them: there's Three Ninjas, then Three Ninjas Kick Back, then Three Ninjas Knuckle Up, and then Three Ninjas High. Now I know you're asking but Tim, didn't they also record Three Ninjas Knuckle Up, the third movie, at the same time they did the first one? Yeah, why not? Yes, you're right, you're correct, and they were released out of order so they get younger as the movies go on. Great, yeah, different actors too for some of them, great. Then they go to Hi-Mega Mountain, all different actors except for the grandpa, and they added Hulk Hogan. Good, well, Hulk Hogan really does take it up a notch. Yeah, Mavic Zero says there's an animated series for Street Fighter that has the same animation style, that's pretty good, I think it was for Alpha 2, Street Fighter Alpha: The Animated Series, but I\"",
            "start": 1023.04
        },
        {
            "text": "notch yeah Mavic Zero says there's an animated series for Street Fighter that has the same animation style that's pretty good I think it was for Alpha 2 Street Fighter Alpha the Animated Series but I could be wrong so they're long okay so Ryu's its Shokan I guess is what R's fighting style is supposed to be based on Shokan Shodoukan yeah what is that fighting style like Kung Fu or Karate or Campo J Jamrock says RP tum tum we miss you did Tum Tum die who's Tum Tum was the was that that goddamn gorilla that's Har okay T.T.'s the younger brother in Three Nas okay well he died of a crack addiction probably or something like that oh Nick well I don't know that's what that's what happens to all Hollywood stars they die of crack crack cocaine hey I'm just doing this warm my bicep oh you just got **** in the nose son your tooth son Jesus Christ wearing your Vega pants how you going to eat that **** lunch that's **** up oh **** what's up Philong now I wanted to like Fong",
            "start": 1064.36
        },
        {
            "text": "you just got **** in the nose son your tooth son Jesus Christ wearing your Vega pants how you going to eat that **** lunch that's **** up oh **** what's up Phil Niekro now I wanted to like Fong when he was introduced with I think what was it uh Super Street Fighter Turbo didn't like him why didn't like the way he controlled couldn't couldn't get it he's complicated he's the uh you know obviously based on like Bruce Lee and I loved that when I tried to fight for the first time I just couldn't deal with it he's very loud yeah he's not an Ewok at least they got that right hey shout out to that Baywatch trailer though yeah right that thing **** made my day that was great I loved the the joke about Zangief's balls sounding like it yeah little girls little girls that's hilarious that was pretty long voiced by Bryan Cranston no don't believe you that's not Bryan Cranston it's hard to find though because I don't know if they have the uh also Tim Chad Power still alive okay good Chad",
            "start": 1129.72
        },
        {
            "text": "pretty long voiced by Bryan Cranston no don't believe you that's not Bryan Cranston it's hard to find though because I don't know if they have the uh also Tim Chad Powers still alive okay good Chad Powers AKA Tum Tum still alive Chad I remember uh it's weird that you say Chad powers and I know that that's Tum Tum Power Chad Power uh because I remember Colt who was my favorite because he he was blue his name was like Elliot Slade or something like that yeah see I don't know I don't know how to find the American cast I'm might have to Google it just go on uh no it's the Japanese cast no but you should be able to it should be underneath it see this one Max Elliott Slade there you go I got half of it right two3 yeah get ready R you were you a Ryu or Ray guy oh was Rayu but it's wrong it's Ryu you didn't know there we go yeah this movie was so **** hyped watching it cuz it's like oh he did the move he did the move right it's dope and then he screamed water there we go then he's got",
            "start": 1198.44
        },
        {
            "text": "Ryu, you didn't know there we go? Yeah, this movie was so hyped watching it cuz it's like oh he did the move, he did the move right, it's dope and then he screamed water there we go. Then he's got put down like a like a Rabbid dog. Oh, you dropped all your Monopoly money, sir! Holy crap, it does say Bryan Cranston, it's F long, that blew my mind, that blows my mind. Bryan Cranston's done a lot of animated movies. What the heck, Bryan Cranon is F long as Philip Williams? I don't know why it's Philip Williams as Bryan Cranston is Fong, that is Bri holy crap, that is Bryan Cranston. What where did you find the D **** may you keep scrolling down okay cool wow that's amazing to me no no don't know what you're talking about very tranquil Fighters are weird hey let's be the living crap out of each other and now let's just have a nice conversation and then let's just walk and walk away from each other hella awkwardly. No, he's like hey what you going to come his way or what's up? Nah I'm",
            "start": 1263.24
        },
        {
            "text": "of each other and now let's just have a nice conversation and then let's just walk and walk away from each other hella awkwardly no he's like hey what you going to come his way or what's up nah I'm G to pull over you I just got to keep walking I walk the earth then they're friends the thing is they're good so they know that he knows that Ryu is a badass and that respects his um he respects him he respects his art oh people in the chat are saying that Bryan Cranston didn't want his name associated as an animated video game character so used the pseudonym Phil Jackson no I think it was Phil Williams Phil Jackson different guy different dude yeah what's going on with the camera is he on a boat yeah he's on a boat oh yes yeah Phil Jackson coach of the Knicks former coach of the uh Lakers if I'm not mistaken Bryan Cranston also voiced different voices on Clerks: The Animated Series Bryan Cranston also voiced a bunch of random bad guys in Power Rangers so much so that they named",
            "start": 1355.56
        },
        {
            "text": "if I'm not mistaken Bryan Cranston also voiced different voices on Clerks: The Animated Series, Bryan Cranston also voiced a bunch of random bad guys in Power Rangers, so much so that they named the Blue Ranger Billy Cranston really after him, that's hilarious. Also, the voice on uh the Lilo and Stitch TV show, really yeah a stitch no oh there we go my boy Hawkeye himself, Tom Hiddleston, five it's funny how close they look to each other, yeah that's the craziest thing and their accents almost almost spot on. The minority part is that racist, no see it's fine Kevin, Kevin's on my side these days, damn call a **** bag I'm gonna punch you right in the solar plexus son what the hell is a solo Plex, solar plexus oh how many abs does Tomahawk have 18 I counted it looks like his pecs have abs everything is ABS I'm wearing shorts and Doc Martens I'm dressing like Kevin what's way to do Seattle in the '90s yeah I know hey it's lung capacity uhoh we're going to get a sweet Hadouken nope no dude I'm not",
            "start": 1409.08
        },
        {
            "text": "is ABS I'm wearing shorts and Doc Martens I'm dressing like Kevin what's up do Seattle in the 90s yeah I know hey it's lung capacity uhoh we're going to get sweet nasty hadouken nope no dude I'm not trying to **** kill you well beer why is he fighting him I don't know doesn't matter let's stop asking questions I'm getting my sweet por why's going on oh yeah he looks like he's jacking it smoothie Whiskey in the comments says are they some kind of Street Fighters oh **** Kata I see what you did there so this is my boy D this is your boy D yoga flame yoga flame yoga flame I think that's gonna be a lot of people don't realize how deadly yoga can be when sped up it's just like tai chi up when there's no when you take out when you take out the yoga pants and put in a fist yoga becomes arguably the most dangerous martial art on the planet M and decidedly less sexy way less sexy same I wonder if I could sell Gia on Street Fighter by telling her there's a yoga character probably yeah probably is that",
            "start": 1485.88
        },
        {
            "text": "dangerous martial art on the planet M and decidedly less sexy way less sexy same I wonder if I could sell Gia on Street Fighter by telling her there's a yoga character probably yeah probably is that that's Akuma just chilling there what's he doing there eating oranges a bum why all they why are they all **** bums vagabonds like Ken like everyone gives Ken **** cuz they're like you fight for money he like yeah I got drive a Porsche yeah you live on the side of a trying to live Central West says man I wish rival schools would make a comeback that was a great fighting game it was I missed that a lot that altered not Altered Beast what was the game where you turned into animals alter Beast no no well yeah you're right there's a fighting game that you turn into animals beast beast mode Beast Wars it wasn't Beast Wars battle Borg that is gandi holy **** bloody Roar is what it was Bloody Roar think that's it pener 2 says yoga pants are the greatest gift yoga has to offer",
            "start": 1588.88
        },
        {
            "text": "Wars it wasn't Beast Wars: Battle Borg that is Gandhi holy **** bloody Roar is what it was. Bloody Roar, think that's it, Pen 2 says yoga pants are the greatest gift yoga has to offer the world. Some would say flexibility, relaxation, and mindfulness, but you're right; they'd be **** wrong. You're right, yoga pants arguably the best. Apparently Akuma pops up in random places, says Maverick Zero, keep an eye out; that's cool. I don't remember him being a part of this though. Yeah, yeah, I think he's just random in the like it is, just a background character. Yeah, but I mean he's not a main character; he doesn't affect the plot. That's cool; they just kind of built him in. What was it? Who was Akuma in the actual series in the game? Wasn't he supposed to be like a god character of some sort? **** if I know, no one knows anymore. People are giving a lot of love to Bloody Roar, and it was kind of like an anime. SC Optimus S, it's $15. How much milk you gonna buy? A **** ton of milk, dude; that's a lot.",
            "start": 1639.88
        },
        {
            "text": "no one knows anymore people are giving a lot of love to \"Blood Blockade Battlefront\" and it was kind of like anamorphs SC Optimus Prime, it's $15 how much milk you gonna buy a **** ton of milk dude that's a lot of money for the United States in Kolkata you can buy a **** cow for that much in Kolkata I don't know that for sure I don't you've ever been to Kolkata nope nope never been into you yes Kevin just came in with a bunch of pizza this is going to be a good time I love it oh here we go E Honda oh you're so slippery thank you can I also trouble you for my charger for your laptop yeah it's about to die disy it's been my my life goal to get Alfredo to cosplay as Dolph Lundgren and Kevin as E Honda Kevin did cosplay as E Honda one time really well he just was after he showered in a hotel uh he put the towel remember he did the the picture and it was amazing yeah it's awesome I remember I remember saying hit that let's see what's up images I don't think it's going to be oh no no was just an E Honda thank you just",
            "start": 1689.8
        },
        {
            "text": "he did the picture and it was amazing yeah it's awesome I remember I remember saying hit that let's see what's up images I don't think it's going to be oh no no was just a a Honda thank you just just just a Honda just a Honda motorcycle one J it I thought so Sterling life Co says why buy the milk would you get the cow for free from Ryu solid Point that's a good point a very good point see do never had this ability in the game to slow down time slow down time and **** with the Honda's head this would be too op I got uh jalapeno poppers and mozzarella sticks yeah that's a good idea idea I'm going to get one of those mozzarella sticks did you get any Coke no we have some here Nick thank you oh oh E Honda Tim hammy one of those mozella sticks that's a popper the mozzarella is thick they're different oh careful they can get hot oh that's tasty oh he's got RKO by yonda RKO that's why also Brian Cron yeah yeah I just surrendered",
            "start": 1781.6
        },
        {
            "text": "Street Fighter II: The Animated Movie - Kinda Funny Watch-A-Long\nThanks to Crunchyroll for sponsoring this video!\nGet your free Crunchyroll Premium trial to watch-a-long with us at http://www.crunchyroll.com/kindafunny\nStreet Fighter II: The Animated Movie http://www.crunchyroll.com/street-fighter-ii-the-animated-movie/street-fighter-ii-the-animated-movie-street-fighter-ii-the-animated-movie-dubbed-716297\nLet us know what anime we should watch with you next in the comments!\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nmozzarella sticks that's a popper the mozzarella is thick they're different oh careful they can get hot oh that's tasty oh he's got RKO by Yonda RKO that's why also Brian Cron yeah yeah I just surrendered ehonda stop being a **** dick this is all I want to do in life Nick is watch movies and talk **** talk with the chat talk **** and just eat pizza I know it's fun we got to do this more often man mhm these watch-along songs are like really fun what is up with the cross eyes everyone's **** crossey sorry it's okay I didn't realize someone went to town it's okay thank you the **** guitar these are the best things on the planet she bringing back his change oh my God Gandhi just got throat checked **** kill Gandhi check can't kill Gandhi he's a pacifist is he like a **** bad guy alt mhm no little known fact about the mid 80s to mid90s the Uzi mhm number one used weapon ever people love that Uzi dude spray and pray you also got to appreciate what's the plot of this movie so far we're 32",
            "start": 1840.88
        },
        {
            "text": "known fact about the mid 800s to mid 90s the Uzi is number one used weapon ever people love that Uzi dude spray and pray you also got to appreciate what's the plot of this movie so far we're 32 minutes in they're recruiting Fighters we don't know why we don't know why God we use eyebrows man they're so epic Richard Epcar as Ryu it's so funny all these guys didn't want to do they didn't want their names on this stuff so all these people have different voices this is hilarious the guy played Bison Steve Blum who Steve on him I don't know that name looks familiar Steve Blum I think that's Starscream I was in Cowboy Bebop Rebels he's done a ton of VR, VR Batman: The Telltale Series Justice League vs. Team Titans they're really good there's one more left he was Spike Spiegel and Cowboy Bebop yeah I love that do you ever watch Cowboy Bebop oh yeah if they've got that on Crunchyroll we should watch through that again too and he was Starscream in Transformers there you go yes oh R yep the",
            "start": 1970.68
        },
        {
            "text": "yeah I love that do you ever watch Cowboy Bebop oh yeah if they've got that on Crunchyroll we should watch through that again too and he was Starscream in Transformers there you go yes oh R yep the best Transformers cartoon not no it beats Beast Wars shut up Beast Wars is great but it's not Prime Steve Blum if you get if you get a sack can you grab us a couple Waters yeah sure thanks boss you want a beer instead yeah no I guess I'm not driving today so sure yes no I'm good no beer thank you though you want a water yes please C. Master is this dude in the games at all that dude this **** like Frankenstein dude that dude yeah no he's not also they're the best around and know they're exactly equals I like how they have fighting potentials are you trying to rhyme is that what you're trying to do are you screwing with me I don't understand somehow still wouldn't be worse than Trump thank you did he bring me one it's on that side give me a second thanks get thing what's going on in that",
            "start": 2072.48
        },
        {
            "text": "to do are you screwing with me I don't understand somehow still wouldn't be worse than Trump thank you did he bring me one it's on that side give me a second thanks get thing what's going on in that box nothing it's empty mhm if a job's finished she's finished get in there she's going to talk **** I'll get some in a sec so Kirk says Cowboy is on Crunchyroll thanks for dealing with Funimation that's awesome if you haven't seen Cowboy Bebop you should definitely watch that the theme song alone it's so good fantastic got almost 600 people watching with us thank you very much for joining us for this Kinda Funny Watch Along I mean there's about 600 bosses out there going hey what the **** why aren't you working yeah why are you watching two videos at once Shying Boo says Transformers The Animated Movie is the best Transformers I'll give you that as a single piece of content sure no Beast Wars it's better than Beast Ken Masters what a goddamn bad I wonder how the process went do",
            "start": 2155.48
        },
        {
            "text": "the animated movies is the best Transformers I'll give you that as a single piece of content sure no Beast Wars it's better than Beast Ken Masters what a goddamn bad I wonder how the process went do you think they designed for you and they're like okay cool this is the main character this is you know people can learn how to play using this character and everyone just wanted to play as him they're like I guess we just got to make another one that does the exact same things probably but they came from Street Fighter weren't they the original Street Fighters well I mean but still yeah oh yeah they guaranteed were the street fighter one yeah I think Ryu and Ken were just Street Fighter I think that's what it was wasn't it and then they were like these guys are the homies we should definitely include them I could be wrong I'm not well versed in Street Fighter one no one is that's true that's sexual harassment gal uhoh she aint **** around with those damn G yeah you're right you can",
            "start": 2235.68
        },
        {
            "text": "include them I could be wrong I'm not well versed in Street Fighter II no one is that's true that's sexual harassment Gal uh-oh she ain't **** around with those guys yeah you're right you can only play as Ryu or Ken mhm and they were the exact same move set mhm I'd like to replace 3 for one I just remember reading that some more people are asking if there's a thread in the forums to suggest anime for us to watch later no but when this goes live on YouTube which should be next Monday uh go leave things in the comments and that's how we'll get things people were suggesting this so I got it look at her look at Chun Li Chun Li love Chun Li how does Guile even fit in that car he doesn't the hair is so much it's so girthy also we're two incredibly hot bodies we should push those against each other every once in a while in the shower see what happens no you don't want that okay fine I'll just shower anyway FYI there's a shower scene oh I know there's a shower scene FY this is one of those",
            "start": 2300.24
        },
        {
            "text": "other every once in a while in the shower see what happens no you don't want that okay fine I'll just shower anyway FYI there's a shower scene oh I know there's a shower scene FY this is one of those scenes when I was a kid where I was like am I allowed to be turned on by this right now yeah it is it is kind of weird I think she was in a fight with M. Bison it's dope it's hot as **** and they nailed the Hadouken yeah that scene was banned when it first came to America really mhm and then they had to edit this I'm assuming this is the extended version with it you would hope better be scholar Lux says Tim I think you guys would dig Fullmetal Alchemist: Brotherhood for a watch along everyone recommends that to us and I've never seen it you've never seen it I think I watched the first episode stuff I've seen it but the problem is uh it's too many episodes I don't think it would we can yeah we could do that many oh man DJ struck dude you got a good face according to those numbers damn tear",
            "start": 2388.92
        },
        {
            "text": "stuff I've seen it but the problem is uh it's too many episodes I don't think it would we can yeah we could do that many oh man DJ Struckman dude you got a good face according to those numbers damn tear a hole in that ass I'm going to tear a hole in that ass oh Tim there's a popup on here on the time thing oh no 10% remaining of battery you should probably plug that in Nick I'm grabbing your port that's fine why is his name say Jesus why does he have a Jesus shirt this give it enough power m i don't need like charge need to stay on wait actually I don't think this will let's try plug it in M head off maybe it's one well it says not charging do you want to try mine but again I don't need to charge I just need to have power yeah sure I I love that they just met each other DJ before even talking to him kicks him yeah he grabs his kick he says what's up gu how you doing like he that's how Street Fighter say hello yeah Street Fighters yeah it looks like it's working big Kev dog could you get me some",
            "start": 2440.6
        },
        {
            "text": "to him kicks him yeah he grabs his kick he says what's up gu how you doing like he that's how Street Fighter say hello yeah Street Fighters yeah it looks like it's working big Kev dog could you get me some napkins thank ni you want any uh-uh I'm good you like that salad it's really good thank you okay wow they just zoomed in on her crotch and said speaking of interesting yeah what do you think of this girl's crotch like well you know I don't know anime gets really raunchy it does get really raunchy like uncomfortably raunchy and like any level of raunchy is uncomfortable well what's happening did he get thrown down a freaking elevator it wasn't an accident I threw him down a Elevator Shaft give me Las Vegas is this M Bison yeah or Balrog in America oh yeah little bunny thank you you just pour wine out we're having fun that was weird as hell that dude had your beard what that dude had your beard think guy can go himself it's a good beard such a doofy ass  is it in your pants",
            "start": 2551.92
        },
        {
            "text": "we're having fun that was weird as hell that dude had your beard what that dude had your beard think guy can go **** himself it's a good beard such a doofy ass **** is it in your pants is that a funny feeling in your pants I love when to do the dub over because the voice acting is is like just a little off all the time you know what I mean you need to chill this like take a little breath Take a little breath every once in a while what's this this is when M. Bison fights a bear Oh you mean I'm joking Zangief yeah did you ever watch Street Fighter: The Later Years on College Humor um yeah yes I did and hilarious fantastic hilarious Gouken is definitely the odd man out when you look at the roster that's like maybe we should get him some help cuz he's a monster good job on the pizza C what is it in yours special oh really yeah I uh tried to get the sauce but there was no place to buy do you change the name of the stream oh **** see the internet explorers watch Street Fighter",
            "start": 2641.0
        },
        {
            "text": "C what is it in yours special oh really yeah I uh tried to get the sauce but there was no place to buy do you change the name of the stream oh **** see the internet explorers watch Street Fighter 2 good suggestion actually can change a Kinda Funny Watch Along Street Fighter too okay actually change it to Tim and Nick watch along Street Fighter II oh here we go everybody prepare your minds and bodies and souls shower scene you straight see it too I mean it's steamy but like it's tasteful it's artistic mhm we're about to get the Marsha Brady as I like to call it oh I see you see this I don't know what that means no that's not that's straight that's a straight butt that's straight butt and thigh that good but she got that like um that like I got to do a lot of squats but yep shout out to squats man they make it they make",
            "start": 2762.52
        },
        {
            "text": "that's straight, that's a straight butt, that's straight butt and thigh, that's good but she got that like um that like I got to do a lot of squats but yep shout out to squats man they make it or break tight G has been doing them squats has she oh yeah and I'm like damn squats really make the difference they make all the difference pop they give it that pop you're right they give it that pop let me get one of those pieces of pizza really yeah I'm going scrape the toppings off like I do oh hold on open it up big Nick I'm going in tough I'm going in t probably just keep going back and forth to more naked chle the director was like this guys I don't think you're understanding it I only want to see her in the scene little hair flip oh yeah give me what I desire there no that's not what I'm talking about oh look at that side boob though you know there yeah I'm going to stop myself right there good the why I you just never seen this before Zigler that's what a",
            "start": 2841.68
        },
        {
            "text": "that's not what I'm talking about oh look at that side boob though you know there yeah I'm going to stop myself right there good the there why I you just never seen this before Zangief that's what a female oh my god oh well we screwed that up didn't we no we okay we're not showing it oh yeah there we go that's the Maury Povich will you see the silhouette no we just saw some nipples though but we did you see some nipples that was fantastic I didn't remember that I did not remember seeing full on full frontal nudity from Chun-Li it's not full fral 10 oh he didn't see the little coochie what didn't see the we didn't see the uh yeah the how's your mother why we call that's what they call it's the clinical term it's the how's your mother this is my favorite scene of the movie coming up not just the shower part okay that's a dope fight at the mood music sexy got to get them buns ready for hair right not for the action mhm taste good what's that the toppings are excellent you like it oh",
            "start": 2896.0
        },
        {
            "text": "part okay that's a dope fight at the mood music sexy got to get them buns ready for hair right not for the action mhm taste good what's that the toppings are excellent you like it oh yeah it's good this is like everything on this pizza uhoh Vega coming from above cell phone it's amazing Oer he's the snake Veo is the treacherous one cuz what's under that mask we don't know he's beautiful he doesn't want to **** up his face he's narcissistic we know his mask off right I didn't see it why is he sticking his tongue out behind you who cuz he's nasty and he licks he licks his he's licking his thing the blood off of the thing oh yeah G spinning bird kick Chan spitting Star Kick there you go yeah his friend also voiced by Brian Cron you're right Brian Cron voiced Fong and Vega Claus that shouldn't have turned me on as much as it did oh just got a little hard damn she just threw a **** couch thre oh there we go spinning bird cake oh that looks **** painful that guy's voice sounds",
            "start": 2950.84
        },
        {
            "text": "shouldn't have turned me on as much as it did oh just got a little hard damn she just threw a **** couch thre oh there we go spinning bird cake oh that looks **** painful that guy's voice sound familiar too oh no I'll take the stairs damn it this is taking too long I'll take all 87 stairs her boob physics are ridiculous I guess all physics are ridiculous **** wall oh no rejected that's just something so great about this scene they panties that's what it is that's what it is yeah so good got put through the **** wall Vega good Lord the relationship weirdly developed in this movie what the **** happened to the wall what why is there a giant hole in your wall what is happening that's what she died that's the last time we saw Chun Li he's not just another Street Fighter this guy's an all- American what's happening with those jalapeno poppers they all gone they're gone it's fine they went quick did you even have one no I didn't get one but it's okay sorry I'll live I had two",
            "start": 3171.6
        },
        {
            "text": "an All-American what's happening with those jalapeno poppers they all gone they're gone it's fine they went quick did you even have one no I didn't get one but it's okay sorry I'll live I had two mozzarella sticks so kind of went to that damn that got real real fast how do you think V looks I wonder how much the licensing cost for this a lot is that Alison Chains or Soundgarden Alison Chains is that Alison Mozzie IRL says did I miss the shower scene you did you did sorry might as well just tune out just kidding you think they were in the same room when they recorded that L dialogue no I dare I definitely don't think they are uhoh flashbacks why is he angry all the time we're running we're bare but there's nothing homoerotic about anything about us no they're beautiful they're they're friends look it's baby Ryu I like how you got jacked after this he was like this you know what the secret to my f style is lots of steroids anabolic steroids trt HGH we're doing them all we're",
            "start": 3349.88
        },
        {
            "text": "friends look it's Baby Ryu, I like how you got jacked after this. He was like this, you know what the secret to my fighting style is? Lots of steroids, anabolic steroids, TRT, HGH - we're doing them all, we're doing the full regimen. Can you can make it nope, grabbing your head. I grabbed it. We are friends for life now because I saved your life and you owe me. Let's take this moment in... hey man, thanks for saving my life. Hanging over, I'd be hungover if I were hanging over that Goroh. Oh, you see that? What did it say? Capcom truck - don't know what ky03 says. I never thought I'd end up seeing Chun-Li naked; I knew I would one day, all the searching I've done. Yeah, it's been uh a lot of time running around in my head. You just check my head. What Kevin said is no one knows - I'm just saying Lisa, that it's Lisa you're hot, but this offer expires in a day. Yeah, Chun-Li's out there, but I'll be honest with you, you are hot; you got it going on. Where are you going? Japan, Japan, Japan. I've got to go to Thailand see some stuff.",
            "start": 3450.6
        },
        {
            "text": "\"Hot but this offer expires in a day, yeah Chun Li's out there, but I'll be honest with you, you are hot, you got it going on. Where are you going? Japan, Japan, Japan. I've got to go to Thailand see some stuff, see about some stuff. Zigger says it's not hard to find her naked, not that I would know or anything. Zero why don't you throw some links in the chat for everyone? I'm joking, am I? You are, am I joking? Kevin has that Pizza Master. This movie was good, you gave this movie a lot of praise beforehand, you were like 'this movie is what I didn't give any credit to', you love it, like I don't remember any of it and then beat by beat telling us what happens in the next two minutes. Apparently I watched this more than once, I mean this is a very Nick movie, there's something about men training to fight yeah that you're just into, Scorpion, I know kind of Whispers it in a sexy way, sex appeal, how do you find the makers of movies? Movies, yeah okay well this is a movie no I mean there's no like movie section\"",
            "start": 3543.08
        },
        {
            "text": "you're just to ni scorpion I know kind of Whispers it in a sexy way sex appeal how how do you find the make like movies movies yeah okay well this is a movie no I mean there's no like movie section to find them oh yes damn I mean me yeah I do I miss watching reac I want to know who this guy is who did this guy Eddie Frierson as Ted Richards let's see what else he did Tangled Frozen castle in the sky Brad Pitt's Money Ball prob took the shadow Chronicles is it called Brad Pitts Moneyball it is called Brad Pitts Moneyball its like Tyler Perry's Madea goes to a castle in Scotland he's only done 15 movies and that's definitely one of them great Scott I'm madea I'm Tyler Perry the more you talk about it the more I think it actually might be real it might be real if it's not it should be what the hell I appreciate the amount of outfit changes that Ken has had yeah Ken's got a lot of costumes here like I love I'm loving this look",
            "start": 3612.76
        },
        {
            "text": "Might be real, it might be real if it's not, it should be. What the hell? I appreciate the amount of outfit changes that Ken has had. Yeah, Ken's got a lot of costumes here. Like, I love, I'm loving this look. This is my favorite look. It's good so far. He has the Converse on, yeah, the Chucks with the skinny jeans and the FL. Here we go. Don't give a **** about that. No, I think that is he Vega in this. I mean, they verbally say Bison but any time it says it, it'll say Vega. Got it? So confusing. The scene where he has to fight Ryu is jacked. Yeah, it's so juiced up, man! If you don't mind me asking, what type of hair product do you use? Ah, by body spray from him but I mean my face, my head. Peanut 423 says the Street Fighter movie would kill it. Probably would. He's already killed Turnaround. Let's go back to IHOP and they're getting around the world quick. Well, they got that cool jet. They got the Qanji Jet, right? Just getting around everywhere. Yeah, speaking of Southeast Asia, pardon me, is that right? Scoped him a",
            "start": 3742.4
        },
        {
            "text": "getting around the world quick well they got that cool jet they got the QanT Jet right just getting around everywhere yeah speaking of Southeast Asia pardon me is that right scoped him a 7 and says hey Nick where can we get that sweet appropriate shirt you're wearing Oh you mean this shirt you can get that at c.com store or having all sorts of stuff over there there you go is the plushy pillow up that still up yeah get that plushy pillow get it sweet nasty get after I planned this you see Tim cuz we're watching Super Street Fighter II yeah that was good did you actually plan it I did oh I was like what chur they wear oh we're watching Street Fighter II oh right I know it's strange I actually thought I had thank you you damn man she look like that bad off but I guess she was I guess why is her hair all wrapped up what possible good could that what's the point of that also my arms are super jacked to get shoulders like this oh my God cuz he's showing her how **** big his arms are",
            "start": 3840.84
        },
        {
            "text": "is her hair all wrapped up what possible good could that what's the point of that also my arms are super jacked to get shoulders like this oh my God cuz he's showing her how **** big his arms are seriously Vega is Dead all I swear to God that this is not earned at all no not at all when it started you were like look at their relationship it's crazy how developed it is I hate you Kevin why does it do with the yin and yang Circle get and yang I don't know what you're talking about Kev oh it's Lisa oh he's naked so naked yeah he has to be super naked they're like sir you know the machine works if he's wearing clothes right off and Bison's like I don't believe you I think it only works if if there's clean air that can hit his pee the cool clean air has to hit his pee he looks like uh my dog Kabam the Action League now right he's super strong and super naked I don't remember what his name was oh no it's like the keep him in the machine until his penis gets rock hard then he's ready to fight",
            "start": 3960.4
        },
        {
            "text": "the Action League now right he's super strong and super naked I don't remember what his name was oh no it's like the keep him in the machine until his penis gets rock hard then he's ready to fight and him and his Salty Thighs all right his creamy butter is Sal where salty thighs come from you know where it comes from sweat sweat they start to sweat and then build a little salt build up on it little residue uhhuh it gets better for the friction you got to grab a hold of something it's got to be those thighs where did his dick go all those noises this is some good sound design right here oh they're breaking his brain right now he sounds pretty broken they've succeeded it's his pee hard pull him out of the machine put some goddamn clothes on him give him his red tunic I that I'm just throwing out there I wonder how much he washes that that gi of his because that kimono has got to stink by now he's just straight up free climbing mountains in it that's what he does man and is he's a",
            "start": 4072.76
        },
        {
            "text": "Out there, I wonder how much he washes that gi of his because that kimono has got to stink by now. He's just straight up free climbing mountains in it, that's what he does, man. And is he a free spirit? He is. I love that he wears his freaking gloves; his toes are grabbing on. You've got to do it, yeah. Good Ken, now that you're here, take my hand. Let me lick that off you real quick. I'm sorry. Oh, **** there it goes. And that's how it happened. Now we're friends for life. Now, are these the designs from like Alpha? Yeah, yeah, cuz that's when Ken got that long hair, like the younger one, which is pretty cool, yeah. It's pretty dope. I like that they did that. I want to see a Street Fighter 5 anime where it's hot for you with a beard. Oh, yeah. Oh, yeah. There's something called Street Fighter II: The Animated Movie, I think. That's the animated series. Pop off says Nick, were you and Chun-Li or were you and Ken? I'd watch them both. I'd watch a three-way between those two, and I don't mean like a threesome where the two guys don't pretend.",
            "start": 4142.52
        },
        {
            "text": "Animated Series p pop off says Nick were you and Chun-Li or were you and Ken? I'd watch them both, I'd watch a three-way between those two and I don't mean like a threesome where the two guys don't pretend like the other one exists. I mean where everyone's included. Salty thighs, we're the two guys forend. Let's open up that can of cashews and see those thighs have salt on them if you know what I mean. Oh my God yes, Captain G put the cashew in my mouth. Yes, a captain yeah yeah, go Captain G and Master Bison. Master stop calling me Master Bison, you know what that sounds like? Just call me Bison or Master Zigar says Nick looks like hot Ryu thank you it's true you do MC Steamy S West says all it took was feeding Nick Pizza to get to this point salty thighs to be fair I would have started talking about this before Pizza happened. I'm all hip-hop Tim yeah I'm all hip-hop you **** it up boy um I did Scar chest and guess what happened Scotus s says Tim looks like hot Chun-Li it's true I'm practicing my",
            "start": 4231.48
        },
        {
            "text": "before Pizza happened I'm all hip-hop Tim yeah I'm all hip-hop you **** it up boy um I did Scar chest and guess what happened scotus says Tim looks like hot Chun Li it's true I'm practicing my jiggle physics are on point is there any characters we haven't seen yet cuz there the four new the latest characters there was Cammy Fong DJ Tom Hawk tom yeah and there's the four Shadow Law bosses and then there's the Originals there's Ryu Ken Chun Li Honda D Zang um Vega no no no Vega one of the Shadow guys Blanka is ituma this yeah there's one that I'm missing here not name what's the name of that lady up there on top of your head she's not from two no hold on I'll look it up do Ryu Chun Li do Blanka Honda you got Ryu Chun Li Ken Gil Dhalism Bison Vega Sagat Blanka Zangief Honda Akuma I must have said him and just skipped it Cammy Fong DJ T-Hawk that was that's it my up I love Yanda's voice cuz like it just doesn't look right doesn't work at all it's so gu that's who I forgot",
            "start": 4302.12
        },
        {
            "text": "Akuma, I must have said him and just skipped it. Cammy Wong, DJ T.Hawk, that was that's it. My up, I love Vega's voice because like it just doesn't look right, doesn't work at all. It's so gaudy, that's who I forgot. Thank you. How can you forget Captain Zangief? I don't know. Captain Zangief, my dude. Hi, Captain Zangief. Yeah, I guess we've seen everyone do their pose about to do one of them Sonic booms. Have they not met yet? That's E. Honda is fat but also jacked like they had to give him ABS too. Every time that's how I imagine Matt Scarpino looks - that's exactly how Matt looks, jacked with abs and fat. I love how Ieyasu is one of the like just a homie. You know what I mean? Like he's the guy we are watching Street Fighter 2: The Animated Movie. You can watch along with us by going to crunchyroll.com/kindafunny, signing up for premium free trial, and then going to the search bar typing in \"Street Fighter II\" anime series. Looking at this time code... yep, 114. Oh, here we go. Evil Ken - you know he's evil because his eyes are red. Mhm, are they? Yeah, I remember.",
            "start": 4424.36
        },
        {
            "text": "\"free trial and then going to the search bar typing his 2 anime series looking at this time code yep 114 oh here we go Evil Ken you know he's evil cuz his eyes are red mhm are they yeah I remember that of course that's how everyone knows that you're if you're um been possessed by something or taking control of your eyes are red so if I ever come in my eyes are red it means that Kevin finally won and he's taking control of me and he's the one making me watch so much porn to masturbate all the time have you seen the uh Transformers: The Last Knight trailer no I heard it's out though I heard it's amazing it's uh amazing is not the word I'd use but it does end with Optimus having purple eyes and killing Bumblebee wow seems so wow good Bumblebee's a prick uh oh here we go this fight is dope I remember being little seeing this and being like yes Ken I know your eyes are red and maybe let's just do something with the eyebrows too but Jesus Christ I don't have one SE drift says purple eyes and little face\"\n\nI made the following corrections:\n\n* \"anime series\" was already capitalized, so no change needed\n* Corrected \"Street Fighter II: The Animated Movie - Kinda Funny Watch-A-Long\" to match the title of the video (no direct quote in this chunk)\n* Corrected \"Transformers 5 trailer\" to \"Transformers: The Last Knight trailer\", as it is a more accurate reference to the actual movie\n* Capitalized proper nouns like \"Evil Ken\", \"Optimus\", and \"Bumblebee\"\n* Left other text unchanged, including filler words and phrases.",
            "start": 4534.2
        },
        {
            "text": "little seeing this and being like yes Ken, I know your eyes are red and maybe let's just do something with the eyebrows too but Jesus Christ I don't have one SE drift says purple eyes and little face palom emoji what the **** what you face paling bro they were purple what if y just took everyone down was like bye guys I'm going move where he just does the how I imagine Kevin fights just the torpedo head uhoh here comes the cross eyes why does he need have real eyes all their eyes seem kind of off everyone but the boxer in particular yeah about get thrown son is there nkin over there can I have one of those yes oh my God o it's fighting dirty this makes me want to go back and play the original Street Fighter 2 here we go just took that house down someone's like yo what the **** was that EA's house yeah hey man that's not insured I built that from straw and horses oh oh they hugging oh **** is that the end of them I think they both died there yeah no I don't know I doubt",
            "start": 4586.92
        },
        {
            "text": "EA's house yeah hey man that's not insured I built that from straw and horses oh oh they hugging oh **** is that the end of them I think they both died there yeah no I don't know I doubt he dies I'm sure he's going to climb his way back up uhoh a Dutch angle I love it stop being a **** that moves in the game like the animation this is is amazing they just don't do **** like this anymore oh so much hair grabbing yeah they got to pull they got to pull a little bit more put some punches into those thighs yes he remembers that bandana all those years ago I gave it to you I took it off my head and put it on your head we had a great moment we had brother time and then when our master wasn't looking we went for a little bit of a Jaunt Through the Jungle the Master's jungle the Master's jungle I remember we used to fight in the streets Ken what happened that was a goofy ass jump say my name Ken he's like say my name say my name romance conquers all that was intense you",
            "start": 4725.56
        },
        {
            "text": "Master's jungle I remember we used to fight in the streets Ken what happened that was a goofy ass jump say my name Ken he's like say my name say my name romance conquers all that was intense you what did he do so I was looking at more stuff on Crunchyroll how did I miss this it's nighttime it's crazy this two of us and how to learn how to fight really paid off you think Ken dyes his hair yeah definitely he's not a natural blonde like that he has like a little bit of sandy blond there and he's like I want all blond so I don't look exactly like Ryu it's not working guys fighting him in the game was such a pain in the ass such a pain in the especially since you had to do it all in like one sitting yeah so by the time you got him you were so tired, tired you were so **** tired so tired of Hadouken getting over and over again I think I only beat that game like twice and I I'm not doing this again yeah ha you clearly don't know how much of a butt my chin looks like yeah God damn",
            "start": 4851.12
        },
        {
            "text": "of Hadouken getting over and over again I think I only beat that game like twice and I'm not doing this again yeah ha you clearly don't know how much of a butt my chin looks like yeah God damn look at his chin thing has got a hole in it man that's a butt chin a thing got a hole in it it's true well guys I'm going back to Seattle where I'm from Frog and Bullfish says Tim a lot of sites call Goichi \"Sendo\" one of the goats I want to get back to anime is it a good place to start it's the best place to start that might be my favorite piece of fiction that's ever existed Game of Thrones being the only Contender got it sense is busy sense just discovered x video oh all right s I'll leave you to it make sure you bait Go the real Kinky  he's like Sensei needs to wash him hentai what is my what AM my fists hurt so much from punching rocks he's going to use karate to make his legs move It's All Coming Back to Me Now there was a chair and a dude that was watching me in the chair",
            "start": 5035.52
        },
        {
            "text": "my what are my fists hurt so much from punching rocks he's going to use karate to make his legs move It's All Coming Back to Me Now there was a chair and a dude that was watching me in the chair and for no reason I was naked and he touched my thighs a little bit they're so salty they're so salty creamy salty thighs what was the point of the dou oh my my legs work oh no they don't work just kidding damn I thought my legs worked but they do not work does thunder happen when it's not raining and lightning yep sure is that a thing yeah yeah in Texas it's just the thunderstorms out of nowhere Austin T just straight up was like breathing Spirit discipline I'm going to say that from now on whenever I get into a hard spot breathing Spirit discipline oh **** here's katas here comes the Kata pyp says can you guys do a let's watch with a full porno at some point yeah that would actually be hilarious I would definitely watch that I have a few that we could watch it's called watch along along",
            "start": 5108.6
        },
        {
            "text": "Says, \"Can you guys do a let's watch with a full porno at some point? Yeah, that would actually be hilarious. I would definitely watch that. I have a few that we could watch - it's called Watch Along to... It's called Jackal Along. Oh my God, Mind and Body is one. I see my body's healed this healing wind that just came through me healed my body. Yeah, the breathing and discipline fixed his legs. What do you see in front of your eyes? You got those dumb legs, Ken. He's about to get... Canen punched in the face. Nope, he moved. This movie though - it really does like everything a season of anime does just in an hour and a half. It's great. It's like all right, cool. We have the two main characters; they fight, then they team up together to fight the bad guy. Yeah, it's good. It's classic. Hey, who are you calling dog? I got a plane. I have my own jet. He can fly. He's a vampire. Dark Knight says it's about to become a three-way. Yeah, we're deep in the three-way tag category, my friend. Damn.",
            "start": 5221.44
        },
        {
            "text": "calling Dog, I got a plane, I have my own jet, he can fly, he's a vampire Dark Knight 6678 says it's about to become a three-way, yeah we're deep in the three-way tag category, my friend, damn lookie why, why would he say that, damn, I love that, that like that sound of like the Ghee Scopt says how about some Sailor Moon for the next watch log could be fun there you go bring the moves, yeah boy coming down with it too oh **** just got double haduken oh man how the **** are we G to get home now we got to walk back through Calata yo we fight better together than we fight apart damn how do they survive was he with Gu he's the GU and the Boxer and Ball Rock yeah where's Chun-Li at she coming up on ite okay now yeah she's fine this reminds me of the 1998 Godzilla movie mhm it's urgent oh man they got fit than a Northstar on Crunchyroll the movie yeah and the series oh yeah oh yeah Jesus he's like killing people to get there and it's just like dude she's awake that's all I could",
            "start": 5332.4
        },
        {
            "text": "oh man they got fit than a Northstar on Crunchyroll the movie yeah and the series oh yeah oh yeah Jesus he's like killing people to get there and it's just like dude she's awake that's all I could have just told you that I'm sorry I apologize this license PL it's cap 2088 cap for Capcom 13 which is a weird ass game they've covered up their thighs Boo mother yeah we got to have sex with you damn this just got nasty I like those two together you too make cute babies with giant shoulders and thighs so much salt you know you don't have to be a bum anymore Ryu like I think we settled that actually because I just handed you your ass up on that mountain hey Ken about that question I said no I've been out here getting goodie Honda dick who would have thought Summa wrestler dick is great dick wouldn't want to be a yo so we getting married or what he like hey remember when I asked you if we should get married I lied I'm really into",
            "start": 5590.44
        },
        {
            "text": "Have thought Sumo wrestler Dick is great, Dick wouldn't want to be a **** yo, so we're getting married or what? He likes. Hey, remember when I asked you if we should get married? I lied; I'm really into For You. I've just discovered my love for him goes deeper than just friendship, but he's got to watch that damn key. Would you imagine like what would you do if you just met a dude that's been walking around in a **** gi and a black belt the entire time? Shoes on, dirty feet would be disgusting either D. That FL there, he goes; then he walks off, just like the end of Gouken from Kung Fu Man. He's a traveler man; that was beautiful, that was beautiful. Oh man, oh I'm tired; I know I am too. Pizza, it's nap time. Hit me right in the crotch. All right, well, ladies and gentlemen, thank you very much for joining us for this Kinda Funny watch along of Street Fighter II: The Animated Movie. Let us know in the comments below what we should watch next. Thank you to everyone joining us in the Twitch chat; thank you.",
            "start": 5708.52
        },
        {
            "text": "Us for this Kinda Funny Watch Along of Street Fighter II: The Animated Movie. Let us know in the comments below what we should watch next. Thank you to everyone joining us in the Twitch chat. Thank you to everyone watching us on YouTube. Until next time, I love you.",
            "start": 5796.2
        }
    ]
}