{
    "id": 2228,
    "video_id": "IUV3Z8I07QI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Troy Baker"
    ],
    "title": "Troy Baker Returns (Special Guest) - The GameOverGreggy Show Ep. 157",
    "description": "Special guest Troy Baker returns to talk about what he's been up to, senses, taking care of yourself, and not using phones. (Released to Patreon Supporters 12.09.16)\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1481270401,
    "duration": 6672,
    "transcript_chunks": [
        {
            "text": "oh hey there everybody it's me Greg Miller from The GameOverGreggy Show here to talk about movement watches that's right you're looking at a movement watch Kevin tried to see my secret paper but I won't let him see it hey there's the thing I'm here to tell you about our sponsor Movement Watches Movement Watches which is MVMT Watches was founded on the belief that style shouldn't break the bank The watchmaker's goal is to change the way consumers think about fashion by offering high quality minimalist products at revolutionary prices we get it ladies and gentlemen holiday shopping can be tough but thanks to Movement Watches all that gift giving anxiety can disappear with the press of a button these watches make a perfect purchase for anyone in your life guy or girl and remember they start at $95 seriously they sent a whole bunch of these watches to us go Kevin Kevin this is they sent us a bunch of these watches this is my black one with the black face and the red things and I like",
            "start": 0.04
        },
        {
            "text": "at $95 seriously they sent a whole bunch of these watches to us go Kevin, Kevin, this is they sent us a bunch of these watches, this is my black one with the black face and the red things and I like it quite a bit, I was going to wear it to a wedding but I forgot it here at the office don't do that when you go to weddings otherwise you don't have a movement watch remember ladies and gentlemen right now you can get 15% off with free shipping and free returns by going to movement watches.com kinda this watch is a really clean design seriously I get compliments from you guys in the comments all the time except when you're like why are there so many ads now is it time to step up your watch game go to mvmtwatches.com kinda what's up everybody Welcome to The GameOverGreggy Show, I'm one of your hosts Greg Miller alongside the producer Nick Scarpino, hi this shirt's back it is the Enjoy Coke shirt has returned it really is I thought it was dead wasn't it dead for forever it's",
            "start": 35.96
        },
        {
            "text": "of your hosts Greg Miller alongside the producer Nick Scarpino hi this shirt's back it is the Enjoy Coke shirt has returned it really is I thought it was dead wasn't it dead for forever it's been dead for so long it's like when you did your bachelor party me and Colin were making fun of you by both wearing it yeah that was the first one this was the second one but I thought it was retired then I had to get this one back in the rotation do you hide it in like the vents and stuff at night so she doesn't throw it away no the problem is I just all I have is gray t-shirts and black t-shirts so there's one cool your black t-shirts are all kind of funny shirts the Hawkins shirt and Donut Cop shirt it's Beat cop be cop my apologies my apologies um and then 30 other shirts that we make because we don't like making shirts that aren't black well now we do we do first ever heather gray shirt just look at look at Colin I get my one shot just let go move away for a second she",
            "start": 113.88
        },
        {
            "text": "we make because we don't like making shirts that aren't black well now we do we do first ever heather gray shirt just look at look at Kevin I get my one shot just let go move away for a second she really likes grabbing some well you know what I was going to say look at these titties but my titties don't look bad in this shirt well no they're not they're not the they look like titties so well I mean they usually look way worse over here returning to the show mentioning the Milon Mning you have a stroke I was here for it mentioning I also first off you've been on this show a lot Troy Baker you're aware that I have strokes on every show we do it's been a while I'm pretty sure at that Telltale thing today I flubbed my outro and nobody stopped me I'm like you know what it's good enough just let it go no you did to Batman on M man I don't know mask now man and we catch you in the flare St I don't I don't think I've ever heard you pronounce the slash nor it's just producer Seducer no I say slash all the",
            "start": 155.24
        },
        {
            "text": "did to Batman on Man of Steel now man and we catch you in the flare St. I don't I don't think I've ever heard you pronounce the slash nor it's just producer Seducer no I say slash all the time producer slash slash guns all right you know what set up high call it should be producer I'm going to go to the right side of the table Yeah you have to introduce these guys you can do uh the pride of Long Island normally when you do that it gets like wow woo Col Mori I don't go woo you don't but people do people watch home when you're wooing at home that happens he's used to ruin why you being like this Detroit Baker **** why are you his side I'm with you all the time help me out and then I was really impressed by your producer skills by the way you're just you did a little bit that you guys were doing earlier Tim Gettys oh thank you thank you L I appreciate that yeah man yeah yeah I'm the producer Seducer Apprentice sure SL pure one yes I've been complimented twice today on my production",
            "start": 196.68
        },
        {
            "text": "We were doing earlier Tim Gettys, oh thank you, thank you. I appreciate that, yeah man, yeah yeah. I'm the producer Seducer Apprentice, sure SL Pure One, yes. I've been complimented twice today on my production SKS, that's pretty cool. Who was the other one? Nick, no, you got nice yourself, three. You got a nice compliment earlier today from uh someone in in the in the chat and Twitch saying they've loved to watch your... they liked watching your career. You got a compliment on PS I love you too, yeah. Mitch saying he loves I I saw and I saw you responded \"Everyone Loves Me Now\". 2017 is going to be the year of Tim Gettys. We already had we already had the year of Kev in 2016, literally nothing happened. Year of the Yosh, yeah. Year of Luigi, year Luigi is like year of Kevin, just a fu Never End burnout, nobody cared. Years of Kevin, wait, wait, are we calling this last year the the burnout year that",
            "start": 247.6
        },
        {
            "text": "of the Yoshi year of the Yoshi, Luigi year, Luigi is like the year of Kevin, just a few NeverEnd burnout, nobody cared years of Kevin. Wait, wait, are we calling this the last year the Burnout year that nobody cares about? Yeah, but this is the year of... so everything that happened is Kev's fault. You, Kevin, you, Kevin, Kev, how's that feel, man? Do we have you to blame for everything? We started off with Bowie and we ended with Trump, thanks, Kevin. That's right, cry, you know what you've done. I want to taste your tears for this, BB. I want your tears in cheers, by way of cheers, cheers, Che, cheers, gentlemen, drink on the show. Sorry, it's just water. I thought you were going to get some. I was going to get some, but then someone talked me into it. Ening people since 1974, I know right, that's not how Nick Scarpino rolls. Kevin's drunk, hold up, hold up. So what? You haven't been here in this new studio; this is the first time I get to pop my cherry here. The last time I was here...",
            "start": 293.08
        },
        {
            "text": "that's not how Nick Scarpino rolls Kevin's drunk hold up hold up so what you have not been here in this new studio this is the first time I get to I get to pop my cherry here the last time I was here was in the spa room yeah the spot what do you think this is dope guys this is really really impressive and I I remember cuz I've been watching I I thought this was just like a green screen and you just like made like some little pixel art on the back it's it's like a legit wall you can watch TV on that thing we can we watch porn on a couple times can yeah there's no speakers though so you have to just imagine what it sounds like I don't do the voices who watches who watches not on mute bully sounds Kevin just does this constantly you watch it on mute I don't want to hear that **** dude really no I'm all about it I need to hear it I need the like the wet noise I mean I need it see this is the thing top about porn's always complicated somebody running in watching porn we talked about this",
            "start": 338.56
        },
        {
            "text": "no I'm all about it I need to hear it I need the like the wet noise I mean I need it see this is the thing about porn's always complicated somebody running in watching porn we talked about this recently where it's like porn's the one thing that still in 2016 well oh people are down to talk about it but it's just like it's the one place where you're allowed to discriminate by race and by age and by like all these things and you're just like that's kind of weird like I'm not into that yeah and you click categories and like there's a c like Asian is a category no no no it's like six toes like there there's someone did that data farming and it just impresses me and it's the it's a true story like if you can think about it there's probably a website devoted to it like the most weird oh guaranteed well I mean speaking of weird things and this is like probably the most popular of the categories teen stop and think about it for a second that's creepy as all **** 18 they mean 18",
            "start": 382.44
        },
        {
            "text": "Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture. guaranteed well I mean, God speaking of weird things and this is like probably the most popular of the categories teen stop and think about it for a second that's creepy as all **** 18 they mean 18 they mean I've never seen one that even comes close to I I'm willing to put money that teen is is up there teens' top five for sure top five is a lot different than the top cuz there's I mean it we are off to a no one knows more about porn than Nick Scarpino oh I I guarantee you's up there okay but is it the top you think what are what are the other contenders corn releases that every year they release Here We Go Kevin's pulling some stuff here oh that's right they do top is that Deno okay I mean I guess 201 is that the guy from Patreon great massage number nine massage number nine squirt number eight oh step sister number seven really number six mom wow why is that number five mil even a more specific Number Four cartoon number three number three stepmom really we're covering mom step",
            "start": 428.56
        },
        {
            "text": "Eight oh step sister number seven really number six mom wow why is that number five mil even a more specific Number Four cartoon number three number three stepmom really we're covering mom step two is no team number two is number two number one anal it got to be anal sorry I don't know why I'm so excited this is like the Playboy Channel number one what's interesting to me about that is that that could also mean that there are more women that watch porn or there's dudes afraid of dicks I'm willing to bet that's the thing afraid of them yeah they're like they're there's so many guys that like I don't even want to see it no that's that's too much I need I'm a narrative guy yes do you read your porn too no you're alone in this sorry my apologies because we're not in the 70s and this isn't Penthouse but I I I I want there to be a narrative I want there to be like some kind of setup you know my I don't know she's going to kill me for saying this uh my wife and I travel a lot",
            "start": 478.04
        },
        {
            "text": "Isn't Penthouse, but I I I I want there to be a narrative. I want there to be like some kind of setup, you know? My I don't know, she's going to kill me for saying this. Uh, my wife and I travel a lot, and we've been to this great place in Mexico. And for some reason on Mexican television at least where we stay, it's not like some crazy swingers' joint or anything. It's a nice resort; one of the channels is like CNN, HBO, and then porn - just porn, straight but horrible cheesy porn. And like literally, we saw the guy with the pizza box. So it's like 1:00 in the morning or whatever, we're getting room service. Just Jing, we've been drinking, and she's just going through the channel. And for some reason, it's I don't know why they did this if it was intentional, unintentional, and ironic. But it's like you know, see about this level right here? You, the point is like oh my everybody knows immediately what channel you're on just by the jumping like 20 decibels of volume. But we are pissing ourselves laughing so hard because",
            "start": 538.36
        },
        {
            "text": "see about this level right here, you know the point like oh my everybody knows immediately what channel you're on just by the jumping like 20 decibels of volume but we are pissing ourselves laughing so hard cuz the guy comes in he's like somebody ordered a pizza I'm like this has got to be a joke this has to be a joke nope and then he throws the empty cardboard box there's no pizza in there why bother wasting money and just immediately it's really y y y YK hilarious so I love that that's bad that's that's an example of a bad narrative in a porn yeah when do we start filming please give us an example of a good narrative have you ever seen one you're like yeah yeah erotic The Blair Witch Project part three three at one point the ghost picked up the camera while Bigfoot **** him which was The Hills Have Eyes parody and if you've seen The Hills Have Eyes you don't want to see no porn of that that shit's **** up that's **** up yeah that's sick why did you ruin it the hills have eyes though where the thighs were",
            "start": 586.48
        },
        {
            "text": "and if you've seen The Hills Have Eyes you don't want to see no porn of that, that shit's messed up, that's messed up, yeah, that's Saw why did you ruin it, The Hills had Thighs though, where the thighs were The Hills have Thighs, Thighs. I understand, yeah, I don't like the saving Brian's privates and stuff like that, I I I immediately can't go, this is a joke, what about Pirates, that was a really successful Point Break, Pirates was huge, the most money ever spent there was CGI and stuff, I remember I downloaded that it was uh the first thing first thing I ever saw on HD was the Pirates of the Caribbean porn, Witchblade, Witchblade yes, Witchblade is fantastic, who is the star of that, Witchblade babe, this is this is the porn we're talking about here, this is this is It's that old 2001 yeah oh yeah this is the one we uh got off of uh we went and rented from uh or we didn't rent we went to the FYE but what what was the other what's the one like FY this in every Mall um Virgin no one like that anyways the wall did you guys have those",
            "start": 639.16
        },
        {
            "text": "went and rented from uh or we didn't rent we went to the FYE but what what was the other what's the one like FY this in every Mall um Virgin Megastore no I didn't have that but anyways we went there we bought this we took it home we watched it we bootlegged it we wrapped it in plastic and came back and returned it took it horrible we were dumb kids we wanted to see if we can get away with like the first time that's happened one I'm I'm actually more of like a uh like a Zan King you know uh Red Shoe Diaries oh you you like your real Emanuel romance I'll never for oh like Emanuel there was one where a guy was on a plane and then like the the the girl next to him just kind of looks over and just starts it was incredible I was like that's top five I want I want that to happen to me in my life um Lethal Space the Exorcist Project I mean that's four that's not one could find one but cuz one was in the woods you had a Salem one up there so maybe",
            "start": 676.48
        },
        {
            "text": "want I want that to happen to me in my life um Little Space the Erotic Witch Project I mean that's four that's not one could find one but cuz one was in the woods you had a Salem one up there so maybe it was or I'm sorry one of these movies the one we did this to was I thought was three but it was very much they went into the woods there was a it wasn't a Bigfoot that's right I'm sorry it was a monkey on the loose what about Kiss of the Vampire Kiss of the Vampire uh is that what it's called this is the trilogy the trilogy that came out between 2000 and 2001 The Making of Erotic Witch Project 2 sounds wow who wants to see behind the scenes for a porno if you didn't know ladies and gentlemen this is The GameOverGreggy Show each crap all that scripted by the way all that was scripted four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kindof funny where you can toss us a few bucks and get",
            "start": 724.52
        },
        {
            "text": "five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kindof funny where you can toss us a few bucks and get each and every episode early along with a bunch of exclusives perks goodies if you have no bucks to toss no big deal you can head over to youtube.com/ kindof funny and get the entire show broken up topic by topic day by day until it goes up as one big video In Mp3 the following Friday we're gonna we're going to snip out all that first part right guys definitely topic cool okay cuz I said some things that I don't want we cut out all the racist **** though right no we kept that in there not saying just kid we didn't say any of that Trump Troy Baker hi bring us up to speed well when you come through you're one of the best friends we love to just talk and ramble with you what's been going on what have you been working on what's going on in your life it's been a hell of a year gentlemen it's been",
            "start": 767.64
        },
        {
            "text": "one of the best friends we love to just talk and ramble with you what's been going on what have you been working on what's going on in your life it's been a hell of a year gentlemen it's been a hell of a year um some really cool things happened this year let's start off with the good uh I remember in 2007 February 2007 I was doing a horrible horrible movie in Texas Erotic Nightmare Project Erotic Nightmare Project uh five never saw the light of day funding halfway through because well you know guess who had a penis um it's one thing I don't test for in an erotic audition you know it's like just one final question do you have a penis no okay cool you're good to go uh so I'm I'm sitting in this hotel room doing this horrible movie and a friend of mine um said here borrow my PS3 and I want you to play this game called Uncharted and I immediately fell in love with this franchise it it inspired me I was like I want to do that cuz I found out the process that they had it was",
            "start": 812.12
        },
        {
            "text": "and I want you to play this game called Uncharted and I immediately fell in love with this franchise it, it inspired me I was like I want to do that cuz I found out the process that they had it was something completely different even though we had had some version of performance capture for years I mean probably seven eight years at that point maybe 10 years um this was the first time that it really if they were in a jeep they built a Jeep if uh if they were in a plane they built kind of like something that felt like the interior of a plane they were building sets for this um and I fell in love with it cut to 10 years later I get to be in an Uncharted right not only in an Uncharted but I get to play Nathan Drake's brother yes it was was awesome um and it's it's interesting because I remember they were doing Uncharted 3 um and I was right down the hall at the studio where they were doing everything at and I just remember knocking on the door like hi I I do stuff I want to be please",
            "start": 857.68
        },
        {
            "text": "were doing uncharted 3 um and I was right down this the the hall at the studio where they were doing everything at and I just remember knocking on the door like hi I I do stuff I want to be please can I maybe on this and they're like no and they're like this is Nolan North and I got Star Struck I was like and there was Richard Mille I was like holy **** I got to hear Sully's voice come out of Rich Mille's face hole which is cool um and then I'm so glad that even as badly as I wanted it then I'm so glad that it didn't happen to me then because if it had happened to me then I wouldn't have been on set with friends I would have been on set with people that I would have I wasn't ready to do that work um and so it's it's just cool that that patience can and Temperance can can really teach you and prepare you for things so wait you knock on the door for Uncharted three say hey to everybody blah blah does that plant the seed for The Last of Us for you to get absolutely not no they literally",
            "start": 903.4
        },
        {
            "text": "and prepare you for things so wait you knock on the door for Uncharted 3 say hey to everybody blah blah does that plant the seed for The Last of Us for you to get absolutely not no they literally were like who's this fanboy I'd been in for like a second and they're like get out of here good for you um but I played Uncharted 2 and I was just I I thought it was incredible and it really was I mean it was game of the year and and uh in a lot of ways changed gaming so to be a part of that um they nominated for awards which it should be because people gave their lives over for that thing um so who knows so that was a really cool thing that happened uh I got to play Batman not just Lego Batman but just like Batman, Batman and Bruce Wayne um which we got to talk about today yeah um Batman: Arkham and mask over on Telltale's YouTube channel Borderlands felt like it went for years and we literally started this Batman this year and we're going to finish this year it's like every episode will",
            "start": 947.28
        },
        {
            "text": "and mask over on Telltale's YouTube channel Borderlands felt like it went for years and we literally started this Batman this year and we're going to finish this year, it's like every episode will be uh put together and out in a single calendar year which is impressive um it's been great because once again we get to as you always pick up on um we get to bring together the Holy Trinity so it's it's me it's Laura Bailey as Selina and it's Troy Willingham who is killing it, killing it as Two-Face or Harvey Dent um depending on your choices that you made this game how you play but see this is what I'm talking about you did you knock on the door and charted 3 did that lead to like no but then you got this click now you guys are like the wrestling clique remember this Triple H and Shawn Michaels and all them, that's you guys you go around and I'm sitting here playing I'm playing uh Telltale 'cause I'm I'm going through all the the episodes now cuz I I like to binge play um Netflix has",
            "start": 993.52
        },
        {
            "text": "and all them raor that's you guys you go around and I'm sitting here playing I'm playing uh Telltale 'cause I'm I'm going through all the the episodes now cuz I I like to binge play um Netflix has ruined me even when it comes to games and stuff I want to do everything it wants I don't want to wait I don't want to wait the fact that I have to wait till for episode 5 is crushing me um even though I know how it goes it's still a completely different experience when you actually sit down and are tacti playing it um not tactically but tactile like tactile I need you'd appreciate that I do um Colin do you appreciate that he plays it on an iPad no he's gonna give me **** for that yeah I know that's why I brought it up I I play every Telltale Game on an iPad I mean that's I'm not going to sit here and judge you you will judge Jud judgment had but I'm sitting there playing and if you play the game uh and you're in episode three you get to the Great uh apartment scene with with Selina Kyle",
            "start": 1036.72
        },
        {
            "text": "and judge you, you will judge judgment had but I'm sitting there playing and if you play the game uh and you're in episode three you get to the great uh apartment scene with with Selina Kyle and I'm sitting there and I I press pause and I texted Laura I was like **** you're so good you're just so dropped in I forget that it's you and it's we've seen great great versions of of Catwoman Selina Kyle. Did it um Arin did it, I mean you can go down the list but Laura Bailey I just I just believe her I just always believe her and the reason why the three of us work together a lot is because a we all three have a great hand with each other um I've been working with Laura on another project and it's just it's the same thing as with Travis we could look at each other go I got it I got it no words need to be said um Travis is the same exact way we can feed off of each other and we bounce back and forth um that's why a lot of times we have a tendency to work together and",
            "start": 1075.84
        },
        {
            "text": "it I got it no words need to be said um Travis is the same exact way we can feed off of each other and we bounce back and forth um that's why a lot of times we have a tendency to work together and they're really good and I just have pictures of people that they don't want to surface so that's how I get always black so talk to me a little bit about the fact that you you're Lego Batman which is awesome in itself but I remember talking to you when Arkham Origins was coming up and especially you and uh Roger E. Moser thank you I was I was saying Conrad for some reason but I and I get picture of him oh no I love him Roger's great everybody knows that um but I remember talking to you guys when you first or when you got came for press tours but talking about when you first got the roles leaving there and going like this is awesome oh **** like this is going to be a real we thought we were going to get fired every time we walked out the studio without",
            "start": 1125.84
        },
        {
            "text": "when you first got the roles leaving there and going like this is awesome oh **** like this is going to be a real we thought we were going to get fired every time we walked out the studio without we're going to get fired so does like that was a younger Troy Baker not by much though Morey Troy Baker one who hadn't like you know started withering and dying like now though you're you know you're on top of your game you're the top of the pyramid you're top of the world was getting this Batman role with Telltale was this easier did this make more sense to you that you're taking a psonic role nope it always feels like holy **** I always get that drop pit in my stomach I think that um one thing that I've learned as as I go along is to a get over yourself um there's nothing that can break you there's nothing that can break you so even if it's horrible if it's bad okay you move on you move forward it's not going to be the end of you let's be honest at the end of the day we're making games okay",
            "start": 1168.88
        },
        {
            "text": "nothing that can break you so even if it's horrible if it's bad okay you move on you move forward it's not going to be the end of you let's be honest at the end of the day we're making games okay so it's we're not liberating hostages we're just we're trying to find something that we can connect with other people and humans can find a way to to have an experience that means something that that hopefully inspires them to go off and create their own art who knows um or understand that they can beat whatever obstacle that is in front of them that's why I love to play games if if he can do that then I can do that and that's one of reasons why I love Batman so much he's a normal guy he's just a guy who's got a few resources billions of dollars at his disposal but he chooses to kind of smart and genius yeah but he made himself smart and genius he wasn't like born with an IQ off the charts he was just a guy that his parents got killed and he decided **** you I'm not going to let that",
            "start": 1209.88
        },
        {
            "text": "and genius yeah but he made himself smart and genius he wasn't like born with an IQ off the charts he was just a guy that his parents got killed and he decided **** you I'm not going to let that tragedy spur me on into depression or into addiction which that could be argued as well whether this is an obsession but he's trying to do right he's trying do right um but I I look at that and when I originally sat down and talked to them about the character is you know are you sure you want me to do this you know because I could recommend a lot of other people that'd be great for this and they said we we think you could do this okay if you believe I can then who am I and that's something that a friend of mine Ames Kitchen who works at Warner Bros when I auditioned for Joker and I turned it down twice he brought me into his office and he played my audition for me he was like look if we think you can do this who are you we're really really smart and we're really really successful we make a",
            "start": 1253.32
        },
        {
            "text": "Twice he brought me into his office, and he played my audition for me. He was like, \"If we think you can do this, who are you? We're really smart, and we're really successful. We make a lot of money.\" I appreciate your opinion, but get over yourself. So for me, I always get that pit in my stomach, you know, the dropping sensation. I'm like, \"Oh my God, I'm going to screw up.\" This is going to be... Get over yourself; you haven't screwed up yet. So don't just do good; just get in there and do your absolute best. If it bombs, fine; it bombs. Move on. People will move on too. But I think I just have to keep my head down and focus on the task at hand.\n\nHere's a question I've never asked you... Oh, it's loaded. Okay, and I'm only asking because you're boozing when the Lego Batman movie gets announced. I remember going, \"Oh my God, that's awesome.\" And then reading the release, I'm like, \"It's Will Arnett who's great; don't get me wrong, but Troy is Lego Batman.\"",
            "start": 1298.64
        },
        {
            "text": "The Lego Batman movie gets announced I remember going oh my God that's awesome and then reading the release I'm like oh it's Will Arnett, who's great don't get me wrong but Troy is Lego Batman cuz I've played all the Lego Batman games I watched The Lego Batman movies that are put on DVD or you know Blu-Ray now digital on demand they're everywhere go get them um but I was like oh that that sucks and that's weird did you know they'd play with it cuz Lego Dimensions has that great scene where you guys meet and it's the two that's why they did that yeah yeah I mean it I'm not going to lie that was I was like ah come on man Will Arnett is talented he's hilarious but a four-year-old who's going to go see that in the theater is not going to go is that the guy from Arrested Development yeah um yeah Blades of Glory he's brilliant Blades of Glory um even in an animated role he was great as the Vulture in uh Horton Hears a Who he's hilarious he comes across great he's got a fantastic voice in a lot of",
            "start": 1339.72
        },
        {
            "text": "Blades of Glory he's brilliant Blades of Glory um even in an animated role he was great as the vulture in uh Horton Hears a Who he's hilarious he comes across great he's got a fantastic voice in a lot of ways fantastic Batman like a better Batman than me he's got a great baritone gravelly voice I'm I'm more of like an Adam West purist kind of guy with just a chip on his shoulder you know it's that kind of thing so do I want the opportunity to have played that in a major wide theatrical release that'll make millions of dollars sure did I get it no cool so what I still got to be Batman he got to be Batman Adam West got to be Batman George Clooney got to be Batman Val Kilmer got to be Batman that's just the way this goes um the only one besides Christian Bale that was offered I'm going to probably someone's going to hate me for saying this cuz it's not true the only person besides Chris Baily to be offered Kevin's going to look it up and verify check this for me no it's 50/50 shot Kevin's already got up",
            "start": 1384.44
        },
        {
            "text": "going to hate me for saying this cuz it's not true the only person besides Michael Keaton to be offered Kevin's going to look it up and verify check this for me no it's 50/50 shot Kevin's already got up he's done he's checked out milkshake he's done the only person to get offered uh multiple Batman roles or multiple movies on a Batman was uh Michael Keaton and he turned down the third one um and he he said he was like no Tim Burton no me I hope yeah he said uh and I hope I'm not throwing him on the bus um but there's this house off of the one in Malibu that he would drive past and he said if I done that third one I'd own that house so when you go and watch Birdman that's that process MH he's Batman Birdman and he talks about the house that he has to sell and everything so when I'm watching Birdman I'm watching Keaton go through this whole thing and and really cathartically get through that regret that he had but understand he made the better decision as an artist it wasn't the smart business move",
            "start": 1435.4
        },
        {
            "text": "watching Kaito go through this whole thing and and really cathartically get through that regret that he had but understand he made the better decision as an artist it wasn't the smart business move because you would have put a lot of extra coin in your pocket but it cost you something um but yeah I mean you don't get offered these things all the time if you get to do it once kick guys you get to do it once here's your badge here's your jacket move on somebody else is going to do it behind you but I love the fact that they at least were able to put it in the game yeah I'm sure he made way more dollars than I did for him to come in and go I'm that man um but it was fun it was at least they they own the fact that here's two conflicting universes and that was the point about it that I didn't get when it got announced and I didn't know how much you knew and now I think it makes more sense but the fact that it wasn't your Batman cuz my concern was it was going to be a Lego Batman movie where",
            "start": 1488.36
        },
        {
            "text": "when it got announced and I didn't know how much you knew and now I think it makes more sense but the fact that it wasn't your Batman cuz my concern was it was going to be a Lego Batman movie where it was your Batman, your Universe just with his voice but then when you see that it is this goofy funny one like you know this is based on The Lego Movie or whatever where he pops up with wild style for the first time it's like oh that makes more sense and the fact that yeah in Dimensions both Universes can exist that's cool but I I get to do it first yeah I do and you're the better one don't get me wrong I was I I have this and there's very few of these that I have all of us that did um um DC Super Heroes United were the first to ever give a voice to those Lego characters yeah that's cool whatever happens from then on we got that so we're the progenitors it's fine well that's the cool I mean like it's cool to see for me as a fan that Universe go and grow and go different ways where it's like",
            "start": 1524.96
        },
        {
            "text": "Happens from then on, we got that. So we're the progenitors. It's fine. Well, that's cool, I mean, like it's cool to see for me as a fan that universe go and grow and go different ways. Where it's like you know, you're Lego Batman now you're Batman in Telltale. Laura was Lego Catwoman now she's Catwoman in this game. Travis never had a job before this; never his first job. He was a farm boy out there just working in the fields. You guys found \"farm hand,\" my apologies, boy. A completely different should apologize. So what else is new? 2016 man. I'm not going to do it. We even talked about this. I'm not going to do it, but wow. I will say this: I had uh, we're just coming out of the Thanksgiving holiday right? Yeah, um, and tensions are high right now. Just like everyone's kind of like a little bit more cynical, um, a lot less open to other people. People, um, every year for Thanksgiving my wife and I go get a... we were in a house up in Big Bear, California, just somewhere up in the mountains, and unexpectedly we got like a...",
            "start": 1565.28
        },
        {
            "text": "Open to other people, people. Um, every year for Thanksgiving, my wife and I go get a house up in Big Bear, California, just somewhere up in the mountains, and unexpectedly we get like a foot of snow overnight, and it was oh, it's so beautiful, oh crap, how are we getting out? Because all the main roads they salted and took care of, but we have to navigate a 35° angle driveway that goes into this street, and on the other side of that street is just a 50ft sheer drop, just Brink into trees and death, Jesus. And then another 45° yeah, beautiful driving up, but covered in ice and snow. We were trapped, and I'm in my car; not like we didn't bring like a Jeep or something. We're not getting out of there; we're stuck. The car is covered in snow, I'm like, \"I don't know what to do.\" I managed to finally kind of get down the hill, and then I don't realize that if I don't have the proper equipment, I'm not getting up this hill back up the hill so we are stuck at this fork in the road where I got up this far but I",
            "start": 1615.64
        },
        {
            "text": "of getting down the hill, then don't realize if I don't have proper equipment, I'm not getting back up this hill. So we're stuck at this fork in the road where I got up this far but can't get up. Then these dudes in a green Jeep Cherokee pull up next to us, start going up, come back and say \"You guys need some help?\" We're talking like ex-cons or hoodlums, that's what you see in these dudes. It was Paul and Travis, they said \"You guys need some help?\" I'm like \"Yeah, we really do, man. We really really do.\" Can you help us? He's like \"Absolutely.\" So he's talking like okay, here's what you want to do, do you have this, want to have that? Okay no problem, hopefully you get that. Um, he's like \"We'll clean this up for you\" and we're standing in front of this huge house with a massive driveway that looks like it just goes up into the sky and this guy goes \"Wow, man, who does that driveway?\"",
            "start": 1665.36
        },
        {
            "text": "clean this up for you and we're standing in front of this huge house that has this massive driveway that looks like it just goes up into the sky and this guy goes wow man who does that driveway I was like probably someone who's hating his life and he goes hating life loving life that's money on the ground baby and I got super heart checked I went man here I am thinking that here's this horrible thing you know and people down here do these jobs and this guy is like that's opportunity that's not adversity and I went dude you just checked my heart man I really appreciate you absolutely what what I do goes you go down the hill you get some snow chains I'm going to be you know carving all this ice off of this driveway and he did and and we're like gave him a bottle of bourbon afterwards and brought down coffees and we're like telling stories this guy got shot in the stomach during a drug deal Jesus he was dead for eight minutes I saw the scar too like you haven't shot he was like I've been",
            "start": 1711.0
        },
        {
            "text": "brought down coffees and we're like telling stories this guy got shot in the stomach during a drug deal Jesus he was dead for eight minutes I saw the scar too like you haven't shot he was like I got shot I was dead for eight minutes and I was like what what he's like yeah they shot my friend he just drops on you Jim Icedrinking bourbon can your bathroom it it kind of they did first of all they asked so it got really weird because they're like can we use your bathroom I was like yeah come on yes can come on up to the house and walk in andure anything can happen to me was the stupidest thing but what's the worst case scenario worst case scenario is we get robbed and that sucks and I've been held up at gunpoint before and it's stupid and it's scary but you live most people do not want to intentionally harm people they just want cash money or or things so I was like yeah dude come on up and I was cautious and and as safe as I could made sure my wife was safe and it was all on my side",
            "start": 1754.6
        },
        {
            "text": "Harm people, they just want cash money or things. So I was like, \"Yeah, dude, come on up.\" And I was cautious, as safe as I could make sure my wife was safe, and it was all on my side. It was all on me, so it was all my prejudices going not necessarily the guy got shot at during a bad drug deal. So we're talking about that was the thing where you're like, \"Textbook.\" I'm like, \"Oh well, that kind of sucks.\" And then I was like, \"Oh well, living up to it, I guess.\" I don't know, where you know? I mean, sucks. I asked him that. I was like, \"What did that do for your life?\" And he goes, \"What do you mean?\" I was like, \"You died, dude. You died for eight minutes. You got shot in the deal.\" He was like, \"Straightened my life up.\" That guy's family or that guy had to end up paying all my medical bills. And he goes, \"I got paid, you know, to move relocate wherever I wanted to.\" So I picked here. I like, I work, you know, started working at Snow Summit. He goes, \"Now I do this. Got a wife and three kids about two streets over that way.\" I was like, really.",
            "start": 1801.28
        },
        {
            "text": "wherever I wanted to so I picked here I like I work you know started working at Snow Summit he goes now I do this got a wife and three kids about two straights over that way I was like really he goes yeah man he goes I'm not stupid goes I'm an honorable student my entire life I'm just thuggy and I went that's it that's it you're an honorable Thug and so it just kind of checked my heart to be able to look at somebody and go there's something in my white privileged that looks at you and says I should be afraid of you but in a lot of ways you know I'm the one that you should be afraid of because you know you stole their Jeep stole their Jeep you basically used your charms to take advantage of them the entire time the car they're still tied up in that house fools probably dead now fools probably dead now it was a great Thanksgiving and and that's my story for good one that's a good one this is really good small batch burden yeah I'm glad yeah we for you so that pretty much brings us to",
            "start": 1845.12
        },
        {
            "text": "\"Dead now it was a great Thanksgiving and that's my story for good one, that's a good one. This is really good small batch bourbon. Yeah, I'm glad yeah we're for you so that pretty much brings us to speed. What do you guys want to talk about? Whatever it's good, it's good to have you around. We like you, yeah. It's good to see you. It has been a long time. I was commenting to Nick, this is the best your hair's ever looked. I want you to know I enjoy the hair and I enjoy the beard. How's this? You last time you were here, you had the super long hair and the big bushy beard at one point. I was like growing my hair to prove something to somebody. It was like, well, I don't know what I proved. I've never seen you when I was like... yeah. It was getting like that. When you get stopped uh at at like border patrol um like when you're going through customs coming back from the country they're like so where exactly have you been? Um, that's when you go 'I got to shave this, I got to get rid of this.'\"",
            "start": 1892.24
        },
        {
            "text": "patrol um like when you're going through customs coming back from the country they're like so where exactly have you been um that's when you go I I got to shave this I got to get rid of this but yeah the beer was bushy and the hair was long it was weird um I did the whole you know more looks cool so let me shave my head and then I was like okay I'm done with that okay I'm done with that and like 6 months later going oh no no no no no you have a long way to go so all the girls that like did that decide like I shave one side of my head cuz they look great on Miley Cyrus I want to see them right now Cassie C who's Cass Cassie Cassie the Filipino singer she's the first one to do it People Credit Miley shout out to Cassie I take a break real quick the song me and you why are you doing this why can't you just say the words cuz they weren't they were a letter me and you me every every word is a letter and you know there was the n and the U right am I wrong yeah yeah wait she it's me and you",
            "start": 1932.0
        },
        {
            "text": "can't you just say the words cuz they weren't they were a letter me and you me every every word is a letter and you know there was the N and the U right am I wrong yeah yeah wait she it's me and you you she's illiterate yeah yeah first illiterate lead this country to Greatness there we go oh wait is it and yeah there's an A and a D also and oh Grammy thanks we printed it it was 2003 it was time two M 2003 is that how long that that haircut goes back to you Osbourne was one of the first people to do it where she was just like **** you Dad that was different though was Notorious noty was the first person to do it all 100% one wait quick timeout Kelly Osbourne's Papa Don't Preach a good cover terrible good cover good cover it's a bad cover I don't remember that cover so it could have been that great that was like Papa Don't Preach I got to cash this check Papa Don't Preach she actually I had to say this I was on a flight with her a couple weeks ago she's super nice and so was her mom I super nice did",
            "start": 1975.64
        },
        {
            "text": "was like \"Papa Don't Preach\" I got to cash this check, \"Papa Don't Preach\", she actually I had to say this I was on a flight with her a couple weeks ago she's super nice and so was her mom, I super nice did you walk over and start talking to her no she actually walked over to me and started talking to me so they they didn't have any uh overhead on the flight that we were at they didn't have any overhead space so she comes she's like what you mind if I put this up I like let me help you out with that and they started talking to they got on the flight like super late like that almost didn't make it she was super nice um her mom was super nice her nice to the flight attendants everything so she has a bit of a redemption for me my wife because my wife used to watch a lot of the uh well she got a bad she got a bad rap when she was on the Osbourne show when when they were doing the reality show cuz she just came off like a brat but then later in life like she does all that stuff for now um and",
            "start": 2025.84
        },
        {
            "text": "She got a bad rap when she was on the Joan Rivers show, when when they were doing the reality show cuz she just came off like a brat but then later in life like she does all that stuff for E! now um and she was working on Fashion Police yeah Fashion Police um which I refuse to watch anymore I swear to God I watched I watched I must have watched at least 30 episodes of that show was hilarious Joan Rivers is a comedian if you ever want to watch like her old stand up like dude she is amazing she's an inc consummate Storyteller um workaholic too there's that documentary on Netflix about her maybe it's on Amazon I watched it a couple years ago about her like her late years and how she was just a grinder man just super **** inappropriate hearing those jokes come out of a 75-year-old woman's mouth it's like do you remember when when um she had passed away and then like months later a tweet came up from her because they had put in Hoot site she had like a sponsorship for like",
            "start": 2062.6
        },
        {
            "text": "Woman's mouth, it's like, do you remember when, when um, she had passed away, and then like months later a tweet came up from her because they had put in Hootsuite. She had like a sponsorship for like an iPhone, and so she just randomly tweeted, and everyone's like, \"What the ****?\" Spooky that's awesome, so spooky. Oh, you guys, you should get an iPhone was like Harvey Firestone for some reason it was the weirdest thing. Oh my God, am I dead too? God, Harvey Firestone Scene goes, what's this world coming to? I think about that a lot though when we like as we make content fire a lot about Harvey Firestone yeah specifically just har no um just in general like what happens when people when when the YouTube generation starts to fall off and die like what happens to all no I mean like it'll keep going but I'm talking about like people die what happens when the Franco will ever die like the average person doesn't necessarily look at when a video was made right so you could see a video and not realize that you're watching a",
            "start": 2100.0
        },
        {
            "text": "people die what happens when the Franco will ever die like the average person doesn't necessarily look at when a video was made right so you could see a video and not realize that you're watching a dead man yeah like no it's crazy I mean Facebook was kind of the first thing that really had to deal with that didn't we all just die on Facebook like a month ago we did so like Facebook has like there's the whole thing where now if people like when people die you can have their Pages set so it's the the phrasing on it is different so it's more like remembering this person it's like in a memorial more of a memorial thing I just used the same word you did but but what but what what happened uh Facebook like a week ago is there was a glitch somewhere and it everyone was dead so you went to this is how you find out isy this is my aggregator for like social news is like okay so what else have I missed who else Trump is President right what not Donald Trump yeah the homone two guy um that's uh\n\nCorrected corrections:\n\n- \"Franco\" → \"Franklin\" (assuming a reference to Franklin Graham or another public figure, but more likely referring to Frank Sinatra, known as Ol' Blue Eyes)\n- \"homone\" → \"homo\" (likely a typo for the word \"homo\", possibly referencing the Homo genus of primates, but more likely referring to the term \"homo\" in the context of human biology or LGBTQ+ terminology)",
            "start": 2145.92
        },
        {
            "text": "is how you find out this is my aggregator for like social news is like okay so what else have I missed who else is President right what not Donald Trump yeah the other guy um that's uh that's one of those things like that that when I heard about that I wanted to talk to Colin about that cuz I was like I think this is no no not well everyone wanted to talk about Colin about Donald Trump that was literally my first thought I was like I think he killed himself col was like this is it what we prepped this was that four years of college no I meant the uh when the Facebook thing happened I was like maybe this is the simulation maybe we're all in the simulation and it just borked and this is their way of telling us like this is the first clue I was saying it's like a Black Mirror episode or something was trippy I love that show so much okay season two you didn't like season two that's the one with White Bear and the no no no no no no no no no okay sorry uh the newest season",
            "start": 2187.72
        },
        {
            "text": "episode or something was trippy I love that show so much okay season two you didn't like season two that's the one with White Bear and the no no no no no no no no no okay sorry uh the newest season season three I'm only halfway through it I think I only have two episodes left to watch okay uh five and six okay so I don't I don't have I I actually think think that the first two seasons are really strong the first episode's still one of my favorites in the first season oh about The Expanse in **The Pig** yeah **The Pig** yeah The Pig really good one probably some of the most disturbing I've ever seen I'll be right back um is one of my favorites uh is that where the guy leaves in uh Hayley Atwell um where her yeah yeah Agent Carter and the guy from Star Wars yeah yeah um that is to me boil it down to me just a beautiful episode um the only one I didn't like was the talking bear one yeah that's the Wo or whatever that was the that was the worst one but White Bear was",
            "start": 2228.48
        },
        {
            "text": "is to me boil it down to me just a beautiful episode um the only one I didn't like was the Talking Dead one yeah that's the Walking Dead or whatever that was the worst one but The White Bear was terrifying The White Bear is awesome they they ruined the end there's two Bear episodes no there's The White Bear The White Bear is the name of an episode has nothing to do with bears the other one is is about uh the one's called Yellow and I think it's called White Christmas is the most disturbing especially with the time manipulation in it uh because it makes you want to like you lose your it's that's a really thought-provoking I think most people would agree that's exactly what I was about to say which I've been going through and um you may already know about this there's a whole bunch of cashed uh Rod Serling like snippets on YouTube where he's talking about writing um and they're if you're a writer they're their Bible for you to go through because it's it's just incredibly compelling honest there's a certain Swagger that only",
            "start": 2268.12
        },
        {
            "text": "where he's talking about writing um and they're if you're a writer they're their Bible for you to go through because it's it's just incredibly compelling honest there's a certain Swagger that only Sir Patrick Stewart had where he can say the most arrogant things but it's truth so you look past the fact that he's he's just being honest he's like I'm really good at this I'm really bad at this but I'm really good at this um I'll I'll point out a few of them to you but i' love to see that White Christmas felt very Sterling cuz Miss movies who was our guest a couple weeks ago brought me the uh cuz she knows I'm huge Twilight Zone fan she brought the Twilight Zone compendium which is like pages and pages on each episode the production and the actors and like interviews with people and stuff like that and I went and read the the prologue and I didn't know this about Rod Sterling that like he was writing like uh tele plays whatever they were called in the early 50s like these and he walked away and and",
            "start": 2310.12
        },
        {
            "text": "I went and read the the prologue and I didn't know this about Rod Serling that like he was writing like uh teleplays whatever they were called in the early 50s like these and he walked away and and they're like why are you walking away from this and he's like I want to write sci-fi and they're like what the **** are you talking about you know like like it was like it was considered like you're Dr you're just taking your career just ruining it yeah like you're just jumping off a cliff and he's like I want to write Science Fiction with Ray Bradbury and all these guys and like you're a **** idiot go ahead and do that and then his show ended up you know being what's crazy is he's writing all of this in the midst of McCarthyism and so for him to be able to they even asked he was like who on a second so is this show political no of course not it's the most political show ever same thing with Gene Roddenberry 2 the number one",
            "start": 2347.8
        },
        {
            "text": "on a second so is this show political no of course not it's the most political show ever same thing with Gene Roddenberry um Star Trek was the most I I just found this out about um Roddenberry 2 the number one tenement that he said we absolutely you can change a lot of stuff about this but the one thing I will never give on we'll never have money there's no currency interesting that's to him that's how we were able to overcome and and finally go to the Stars it wasn't that the Vulcans came down and we had that whole um what's it called First Contact yeah but it was the fact that we finally realized money is the root of all evil and if we can just get rid of this then we can actually become a United world and so he would never change that and it's never really mentioned yeah even more so dude it's not even communism it's like there's it's a just a commune it's just we work to give that' be amazing communism by the way on paper not that bad great idea it's a fantastic idea Khan loves it no",
            "start": 2383.84
        },
        {
            "text": "it's not even communism it's like there's it's a just a commune it's just we work to give that' be amazing communism by the way on paper not that bad great idea it's a fantastic idea Khan loves it no it does I mean just any sort of utopian idea works it just doesn't work in in practice in practice absolutely impossible people are selfish it's impossible teach according to his means to each according to his ability is is an impossible thing to or from each according to his ability to each according to his means whatever the **** it is the the idea that like you get what exactly what you need and you give the most you can possibly give is not something that's going to work for anyone no because that's not how we evolved we evolved by surviving and adapting and more and more more well what a lot of people don't know like because I I don't talk too much about high school specifically like my political ideology in high school is that I was always uh I always had conservative bent but I",
            "start": 2428.64
        },
        {
            "text": "a lot of people don't know like because I I don't talk too much about high school specifically like my political ideology in high school is that I was always uh I always had conservative bent but I didn't really realize it there was a time in high school and I was like really into socialism and communism not like that I would call myself that but I started reading it I was uh introduced to Marx's little book or whatever and uh in an AP class whatever and I was like this is fascinating stuff when you read about it the but it's just the same thing with Thomas More and all these guys when you read about like any utopian ideal it just doesn't work in the middle is the only place that can possibly work and it was Churchill that said what do you say capitalism is like the worst of all ideas or something like that you know like the the only tenable idea because even in North Korea they have markets now China's not communist anymore",
            "start": 2468.16
        },
        {
            "text": "worst of the or the best of all the worst ideas or something like that you know like the the only tenable idea because even in North Korea they have markets now China's not communist anymore what did old Onion Man think about you coming home with all this Pinko comic **** my dad probably didn't tell him probably probably afraid to tell him why you wearing that b Colin yeah but I mean it was just I just like to well that was you know I was I was reflecting on this yesterday actually we were talking uh at dinner about some specific things where when I was at dinner with Greg and we were saying that like no one wants to have conversations anymore about hard issues like everyone's always offended by everything so like I'm like I liked I I don't believe in Orthodoxy so I'm like uh universal healthcare for instance I'm I'm I'm totally diametrically opposed to it not because I don't think it's a good idea but because I don't think it can work and so I'd like to have conversations with",
            "start": 2497.2
        },
        {
            "text": "healthcare for instance I'm I'm I'm totally diametrically opposed to it not because I don't think it's a good idea but because I don't think it can work and so I'd like to have a conversation with people be like okay I'm open to it tell me how it works you know as opposed to being like I am just against it and I absolutely for it yeah exactly I don't understand why people feel that way about anything you know so like that's my whole thing is like I have principles but I'm willing to even bend those principles if you can prove to me why I'm wrong and that's why I like having conversations or being able to say and here's how I'm going to be able to execute this without completely fundamentally uprooting people's lives that's the problem um we are so far down the road when it comes politically and economically if we were to go if if the president tomorrow says every car is not only hybrid full electric there'd be people that would be like yay we did it an accomplishment victory",
            "start": 2532.08
        },
        {
            "text": "and economically if we were to go if if the president tomorrow says every car is not only hybrid full electric there'd be people that would be like yay we did it, an accomplishment, victory, and there would be millions of people that literally would have no idea what they're going to do because there's no infrastructure in place to be able to support a decision like that which is the right decision in the turn of the century, early 20th century, 99% of the cars on the road were electric; we've moved backwards since then. How? Because we put our best foot forward and that was with you know fossil fuels and being able to take oil and petroleum and make it into gas. So until we come up with a better solution and build infrastructure for us to be able to do that, you're absolutely right, it's the status quo, it's set as parabus, and that's sad but it's also come up with a better solution yeah and that's what that book remember",
            "start": 2567.12
        },
        {
            "text": "to be able to do that you're absolutely right it's the status quo it's set as paribus and and that's sad but it's also come up with a better solution yeah and that's what that book remember we were talking about um it's a book called The Moral Case for Fossil Fuels by Alex Epstein, who was on the Rubin Report, written by your old roommate and that was the whole argument and being like these things aren't necessarily wrong or false what people are saying about global warming what people are saying about petroleum but it's like you're going to ruin people's lives like it's not possible to like just make it go away you don't have any plastic anymore without oil you don't have any like they're like you just can't you just can't do it so I like to have the academic conversations about how we can incrementally get to these particular places and I and I always I always just find like academic conversation in EN lightning and I've changed my mind about a lot of things because people have told me why",
            "start": 2615.68
        },
        {
            "text": "get to these particular places and I and I always I always just find like academic conversation in EN lightning and I've changed my mind about a lot of things because people have told me why I'm wrong and I believe you know that I'm right when I have a conviction but there's that the conviction is not set in stone by any stretch of the imagination do you think it's the micro level way of approaching it as opposed to do you think that people can literally Implement change by doing it on a micro as opposed to a macro level I think so because I think if you I think small changes always amount to big changes so it's it's it's it's a matter of um there's a great interview uh that I recommend everyone see it's the best Obama interview I've ever seen and I watch you know I'm I'm really into politics whether I no whether I agree with Obama or not I did vote for him in 2008 but uh it was Bill Maher got interviewed by him and Bill Maher finally got to him and it's a **** amazing interview because he",
            "start": 2647.24
        },
        {
            "text": "whether I no whether I agree with Obama or not I did vote for him in 2008 but uh it was Bill Maher who got interviewed by him and Bill Maher finally got to ask him questions and it's a really amazing interview because he asks him questions that no one else does, like what do you think of atheists? Are atheists considered a class of people in the United States? I'm an atheist so everyone's like is atheist a class of people that are kind of uh uh discriminated against in the United States and Obama had interesting answers and one of the things he was asking about was healthcare and Obama said people don't understand that this is a sixth of the economy, you can't just nationalize it, hundreds of thousands not millions of people lose their jobs, he's like you can't just flip a switch like that I like pragmatism you know I really do I think and that's why I think you always end up in the middle I am conservative in a lot of ways but I am very much in the middle you know and that's one of the things I think",
            "start": 2679.64
        },
        {
            "text": "you know I really do I think and that's why I think you always end up in the middle I am conservative in a lot of ways but I am very much in the middle you know and that's one of the things I think about with like where where a lot of the hyperbole with Trump whether it's true or not ultimately is like he's actually politically the most moderate Republican that's ever been in the office so like that's one of the things where I'm like he's really not even a republican he's really actually kind of a Democrat you know so really not even a politician no he's really that's the whole thing I'm like presid I have I I am intrigued by him because I didn't vote for him I left the Republican party over him but I am intrigued by him because he he won and vanquished all these people but also like his Solutions inherently should be very strange and very different because he agrees with Bernie Sanders about a lot of **** and he also agrees with Mitt Romney about a lot of **** right there's not",
            "start": 2714.84
        },
        {
            "text": "Solutions inherently should be very strange and very different because he agrees with Bernie Sanders about a lot of things and he also agrees with Mitt Romney about a lot of things. Right there's not many people who agree with Obama about a lot of things, exactly like, like he's against free trade, that's not a Republican tenant. I'm against free trade too, but he's it's not that he's not that's not a Republican tenant, so I'm interested in people that have that's why I wanted him to nominate a Democrat for his running mate because I thought that that would have been like that would have been amazing because it would have been like I'm not really or I'm not really Orthodox and that's why I was really interested in independent candidates this year. Fox News their heads would have gone fake if that would have happened, like or just a businessman that's liberal or something like that, that's independent, cuz all these political parties are starting they're starting to cross over and that's why I left the party.",
            "start": 2750.8
        },
        {
            "text": "like or just a businessman that's liberal or something like that that's independent cuz all these political parties are starting they're starting to cross over and that's why I left the party cuz I was realizing I'm not really a republican you know like I'm I'm actually just kind of somewhere in the middle with I think almost everybody we should have had he should have gone with the Godfather pizza guy or the guy who was the first the Rent is Too Damn High those were people that would have been Herman Cain and and Vermin Supreme yeah exactly those would have been some interesting choices New York City's very own Vermin Supreme yeah which one was The Godfather Herman Cain the guy that ran in 2012 the black guy he murdered somebody you're thinking of Carl Paladino who stabbed him he was the he was the CEO of Godfather's Pizza or whatever and he ran for president now I understand I had not made the connection I was like he was the guy supported by Carl Paladino used to make me laugh because",
            "start": 2784.6
        },
        {
            "text": "CEO of Godfather's Pizza, or whatever, and he ran for president. Now I understand; I had not made the connection. I was like, \"He was the guy supported Cover the Unplugged cuz Mark Ryan used to make me laugh because that was his thing.\" He's like, \"I'm a CEO,\" he was a CEO of Burger King or something too, and then he was a CEO of Godfather Pizza. His tax plan was called 999, and I'm like, \"And Mark Ryan, even his tax plan sounds like a pizza deal.\" He sells people on it; if you're in the UK, it's an emergency, like call the police at 9% income tax, 9% business tax, 9% VAT, 999 deal. It's cheaper on Tuesdays. Colin, yes, what's your topic? Well, today I went to the eye doctor because I... uh... I was talking to you know I think I mentioned this to you guys too at dinner again last night, but to other people, I'm like, \"I let these you know have a little bump on my arm or a...\" I'll let it go for a while. You keep bringing up the bump on the arm; do you have a bump on your arm? No, no just as",
            "start": 2819.24
        },
        {
            "text": "to other people were I'm like I let these you know have a little bump on my arm or a I'll let it go for a while you keep bringing up the bump on the arm do you have a bump on your arm no no just as example I had I had skin cancer and I didn't know for years because I was just like that's fine so I have a question about the eye doctor is it true you will go blind uh no it's not true hopefully not cuz that would be terrible and then I would have to have someone put a gun in my mouth okay uh so be different uh but not pull the trigger just the you never know because you can't see it now choke me and it could may not be a gun it could be something else so um I went to the eye doctor I was having problems with like I have great vision but I was I there something my my left eye was bothering me and so it's gone away but I I don't **** around with it the reason I bring up the bumps on the arm is I can let this stuff go forever but when it's my eyes I like immediately like go to the",
            "start": 2864.92
        },
        {
            "text": "me and so it's gone away but I I don't **** around with it the reason I bring up the bumps on the armor is I can let this stuff go forever but when it's my eyes I like immediately like go to the doctor CU I'm like I can't **** around with this so I get the normal rig Moro whatever they you know they they don't dilate the eyes anymore now they take those really cool pictures they puff youre no no I hate I used to like tense up like I still do when they're like all we're going to it feels like an attack it's an invasion of your privacy you walk around like you're absolutely ston like do you okay it's like I am the it's so bright oh my go remember in the when you were a kid and your parents would come back with those like wraparound like the the Ray-Ban sunglasses so so I have literally no idea what you guys are talking about are you serious went the eyes oh man I've went to the once I think in my entire life I wonder like and so here's the thing there's a chance that your your",
            "start": 2901.36
        },
        {
            "text": "No idea what you guys are talking about, are you serious? Went to the eye doctor once in my entire life. I wonder, and so here's the thing: there's a chance that your vision's horrible right now - that's 100% possible, cuz like if you were to go to the doctor, it could be a life-changing experience. Yeah, my wife had that same thing happen to her; she was like, \"I'm getting these weird headaches,\" and I said, \"That's a card for me to read.\" She went, and he's like, \"Yeah, you need glasses.\" She reads yeah, it's super hot - she goes to the library a lot. Uh, I play Librarian with her; are you the librarian? So wait, you're putting the books away, shushing her. She keeps shushing him. Library, we're just like... it's more like the uh, I'm like the older one that's managing, um was she not managing? We never got an answer, remember being rude; remember when I was like, \"I don't\"",
            "start": 2936.84
        },
        {
            "text": "we're just like it's more like the uh i'm like the older one that's manist trying um was she not men trying she i we never got an answer remember inter so rude remember being i was like i don't understand what men rating is the mom had explained that remember when you called your mom sexy i do remember that thanks for bringing that one back up that's why the fourth on Pornhub the fourth most searched term is Mom that's but three times though it's it's Momom and mil yeah what is i'm not going to get what you got what is with the whole brother sister stepmom thing here's the thing i don't think that's one of those things i know this goes back to what we were talking about earlier people are searching for teen not because they're looking for little kids like for like 13 to to 17 it's because they're looking for young people are searching for Mom and mil not because they're looking for moms and mils but because they're looking for older women i think that that's what it is older women is like i'm 90",
            "start": 2982.04
        },
        {
            "text": "for young people are searching for mom and mil not because they're looking for moms and milfs, but because they're looking for older women. I think that's what it is. Older women is like, \"I'm 90.\" See here's the thing: I think that the teen thing and I think that stepmom thing are tied back to when you are young and horny, like right when you're... sounds like it's going in a bad place. I'm with you, cuz Bill and Ted's even did the whole thing; it had the edgy complex; it was it was Ted who was absolutely had a crush on Missy mom well, and I'm thinking more of like when you when I think about my horniest time right when I'm just jacking off all the goddamn time right. I think about high school right when like your hormones are percolating you're coming all over the place. Well okay never mind about it; it's like it's a 50/50 as to whether he's ever done it before, you know what I mean? If this was live, I would love to see the metrics towards it's like it's all but te you want",
            "start": 3032.68
        },
        {
            "text": "mind about it it's like it's a 50/50 as to whether he's ever done it before, you know what I mean. If this was live, I would love to see the metrics on it. It's like it's all but there - you want to think about all the teenagers who didn't bang all these cheerleaders who did whatever, because when you're young, hot moms are nostalgic. Thank you, I see okay so that's yeah no and we were talking about nostalgia which is painful memories, up you should probably do that topic sometime on the show man I thought I had a revelation smoking uh so um yeah so my eyes I went I went and got my eyes checked out and they did fine like they were like I was like my eye doctor said everything looks fine there's a tortilla chip back here old tortilla chip I don't uh she said you have 20/20 Vision which you had for a while, these your glasses are for distance and you see better than 20/20 with your glasses on or whatever which is awesome so but but she found this little thing where",
            "start": 3083.8
        },
        {
            "text": "2020 Vision which you had for a while these your glasses are for distance and you see better than 20/20 with your glasses on or whatever which is awesome so but but she found this little thing where she's like this thing has been developing in your eye for like four years this like this small thing that's getting like a little bit bigger and bigger and she named it and she's like I'm not really worried about it come back in 6 months uh and we'll take another picture we'll monitor or whatever but it made me think like which is a classic question and believe it or not we looked at the document because I was like we must have because Tim always ruins my life I'm like I got an idea guys I even wrote it down and it's like we did that literally two weeks ago Superhero movies um and uh it was it was the it's a classic thing that I think you people talked about when their children and you know around you know a bar or whatever near at a bar a random question which is five senses if you",
            "start": 3129.52
        },
        {
            "text": "Was it was the it's a classic thing that I think you people talked about when their children and you know around you know a bar or whatever near at a bar a random question which is five senses if you had a lose one sense to protect the other four and perpetuity uh so in other words you could literally go and sacrifice preemptively one of your senses to make sure that none of the other four would ever be affected and that you would be perfect so perfect hearing perfect vision whatever which one would you lose you know and uh to me it would be feeling touch oh no way no way I can't you want to know why stick with me oh God Superman, The Animated Series yeah God John Corben, John Corben right sign you know he gets in bed with Lex Luthor or whatever they make him Metallo then he realizes he can't feel anything Luther says don't worry we'll be able to do some adjustments he's like great it doesn't happen he gets it he's like what and he's like oh those adjustments were for you to make",
            "start": 3158.8
        },
        {
            "text": "Feel anything Luther says, don't worry we'll be able to do some adjustments he's like great it doesn't happen he gets it he's like what and he's like oh those adjustments were for you to make and then Corbin goes crazy and starts tearing off his flesh and fights Superman doing all this different stuff but when he kisses Lois Lane, when he reaches out and touches people he can't feel anything that would be a nightmare you never know how hard you're squeezing something think about but think about uh what else you have to give what else you have to give up well and that's and that's where it gets into the Sophie's choice between taste and smell they're intrinsically tied they are but like because this is the way I kind of looked at it right because obviously losing uh feeling would you obviously lose the ability to know pain and all those kinds of also sex and all those kinds of things but is it most smell would be the obvious one except for it's so intrinsically tied to taste so",
            "start": 3199.68
        },
        {
            "text": "obviously lose the ability to know pain and all those kinds of also sex and all those kinds of things, but is it most smell would be the obvious one except for it's so intrinsically tied to taste. So, I love eating 'cause I'm you know that's like, would you rather eat for the rest of your life and eat good food and be able to do that or would you rather have sex and and the answer frankly is that I'd rather eat and like and that's just I was guessing yours, I wasn't saying mine by the way. I I would like if someone was like you can only eat and enjoy that or you can only have sex which is a finite thing in your life by the time you're 45, 50, 55, 60 it's over, like unless you're taking pills and all those yes especially for you Greg so Greg ain't making a difference it's true. So one my whole thing is like and that would protect it in perpetuity right but you would be able to protect your feeling like your your sex in perpetuity too so the thing is that the feeling would would always be there",
            "start": 3233.48
        },
        {
            "text": "is like and that would protect it in perpetuity right but you would be able to protect your feelings in perpetuity too so the thing is that the feeling would always be there and you feel more than just sex though you know I mean it's a nice scratch of the back it's tickling the hair sure but you wouldn't if you get rid of taste or smell you're losing your sense of taste which is an important thing to keep in mind though is if taste doesn't matter then you can just eat you know does it's sweet but you can eat a bunch of salads and be fine and you'd be super fit you'd be super good and then you get Daredevil sex so the sex feels even better than normal cuz you know Daredevil you can't see so all of a sudden his other senses are better that's okay so that's a good caveat would your other senses only be protected would they be heightened presumably they do say like when you're deaf or whatever you see better or what vice versa that's just you so it's possible I mean that could be a caveat",
            "start": 3268.04
        },
        {
            "text": "be protected would they be heightened presumably they do say like when you're deaf or whatever you you see better or what vice versa that's just you so it's possible I mean that could be a caveat as well so I get to **** better I Vision I don't know if I would go that far but we're not Androids but so that's so that's my thing it's like I don't want to lose any of them but I think I would probably lose feeling but the problem is you'd burn your hand you you you'd break your leg you do there's so many things where I don't think you would like if you can't feel you don't even know your legs crossed right like you try you don't your legs to sleep and you try to stand up on it and fall you turn into Kevin is really what it is cuz when you were earlier you were talking about pain the feeling thing and just like you were saying like the you don't know how hard you're grabbing this stuff that's how Kevin lives his life no like he just is running around his every all his limbs are flying",
            "start": 3307.04
        },
        {
            "text": "thing and just like you were saying, like the way you don't know how hard you're grabbing this stuff, that's how Kevin lives his life. No, like he just is running around, all his limbs are flying everywhere, smashing things, and **** like that's just Kevin crushing Paula at all times. Sure, that's all right, he'll never know that we know Paula would love to feel numb, let me go, let me go through the process of elimination. Can I choose all of them? So if I had to give up my sight, that means I would never see my wife, I would never see my kids if we have any, I would never see Sunset, I would never see all the beautiful poetic things right. You would never know how cool your socks are, true, how good your scarf is. People could tell me like dude you're dressed on point and like wearing a mix of plaids, you know? I mean the worst thing that could possibly happen was like a Coca-Cola shirt, no, but then but that's the thing though when you don't know then you can just be that",
            "start": 3342.48
        },
        {
            "text": "wearing like a mix of plaids, you know, I mean, the worst thing that could possibly happen is we like a Coca-Cola shirt. No, but then, but that's the thing though, when you don't know, then you can just be that much cooler, and all of a sudden everything's that much better. Like have you ever seen Ray Charles not having a great time? Yes, it's about the majority of his life he was on heroin. I wonder that's debatable because heroin is a hell of a drug. There is a hell of a drug. I would say that I I don't think I would want to give up those things. I wouldn't want to give up being able to see those things no more video games, Tim. No more Pokémon. I know I would never want to not be able to hear some music. I would never not want to be able to hear this is my nerd; my nerd is classical music. So like there's a Bach piece from the St Matthew's Passion that I just if I could never hear that piece again or uh Jungle Boogie, yeah, you know Classics are great. Um, if I could never hear that stuff again, uh, and again I go super",
            "start": 3386.04
        },
        {
            "text": "from the St Matthew's Passion that I just if I could never hear that piece again or uh Jungle Boogie yeah you know Classics great um if I could never hear that stuff again uh and again I go super sappy but if I if I couldn't hear my like my wife laughs crazy if I could never hear that again I would I would cry um so I couldn't give up those two the sense of touch and feeling I don't know how that would work like I would have no sensory awareness there's a great animated series Superman show I'll show you that really covers this okay this is the Metallo thing she already covered it um so I'm up to speed can you touch Troy again just a it it wasn't a touch it was a caress it was like a loving caress is the touch thing a thing cuz obviously there's deaf people and there's blind people are there people that can't feel I knew a guy oh Kevin has a story go ahead I'm sure it's fascinating no there there are people that can't feel pain and that's a really really bad thing I I mean I know",
            "start": 3429.64
        },
        {
            "text": "there people that can't feel I knew a guy oh Kevin has a story go ahead I'm sure it's fascinating no there there are people that can't feel pain and that's a really really bad thing I I mean I know that's just one aspect thing but it's like there's a lot of things you don't think about being not not being able to feel pain like little babies will bite through their tongue constantly **** yeah imagine like we come back from the dentist and you can't feel your mouth and also when you're chewing your tongue that be everywhere yeah also restroom stuff like when you don't know that you have to go poop because it does you don't feel that urge guess what you do every couple hours the time also but like imagine ifs imagine if like if you didn't feel anything imagine if your like insides hurt and you didn't know why and you wouldn't be able to feel it and you're having like some sort of weird aneurysm this leads us to a great tangental thing yeah off of him being able to say something else",
            "start": 3479.76
        },
        {
            "text": "you didn't know why and you wouldn't be able to feel it and you're having like some sort of weird aneurysm this leads us to a great tangential thing yeah off of him being able to say something else about Superman oh oh you want to test me Baker you want to see if I can get this back to Superman um he reads a lot of comics I just want you to know pain is not an enemy pain is a friend pain lets us know something's wrong painless us know you've got something on your eye painless us know you got a bump on your arm you got skin cancer painless us know you're sick painless us know that we are it's our alarm system of going something's wrong the fact that we are are to go back to more of a political thing that we are the most self-medicated um with just it's the wild west when it comes to that um where there's no checks and balances I can go yeah I can go to several different and I know so many people right now that are functioning addicts on medicine they're they're given a prescription for",
            "start": 3522.44
        },
        {
            "text": "where there's no checks and balances I can go yeah I can go to several different and I know so many people right now that are functioning addicts on medicine they're they're given a prescription for something that they're given a prescription from this doctor for this thing these two doctors aren't talking to each other so they're giving a prescription for this thing and you look at just the people this year that have died from a drug overdose from prescriptions from things that their doctor gave them to help them feel better um it's not heroin it's some of them are forms of opiates but for the majority these are things where doctors with people that we trust say can you please help me I'm in pain and they go this is what you need no it's not what you need to do is sit down and talk to somebody about why you're feeling this amount of depression and I'm not in any way diminishing anybody's depression I do believe that there are chemical imbalances I believe that there are serious serious",
            "start": 3574.8
        },
        {
            "text": "about why you're feeling this amount of depression and I'm not in any way diminishing anybody's depression I do believe that there are chemical imbalances I believe that there are serious, serious issues that people need to deal with um I'm not saying you're just sad go take a you know get over it but I don't believe that you're we are not meant to be on a prescription medicine for our entire life and I think that one of the reasons why is because we view pain as something bad as opposed to something that's really, really beautiful and it means it's our body working so no I would not give up my of of touch CU I as Kirk said in Star Trek IV I need my pain my pain is what makes me who I am I'm not going to you know um negate a choice that I made just because it would rob me of pain or take away my pain I want that pain to be there um did you like the reference really can you start Trek Five: Space Spore Frontier Four remember yeah that was an excellent pull by the way can you just join us on the",
            "start": 3623.76
        },
        {
            "text": "my pain I want that pain to be there um did you like the reference really can you start Trek five Star Trek Frontier four remember yeah that was an excellent pull by the way can you just join us on the show like every week CU you're you're really cool come I like you a lot no I I mean I hear that like that's tangent I don't want to go on but yeah but I did you got yours no just the concept of of of where medicine is and how doctors are sort of forced to to do out pills and they don't actually spend time can't spend time with patients for various reasons but they're not forced they're not forced they're coerced and they're incentivized to do so uniquely American I think too in terms of our heavily medicated things very uniquely American well yeah it's very fascinating there's a um my wife was looking into uh other other alternatives to that I think she came across I don't think it's I can't remember what they're called not holistic doctors but they're they're doctors that will actually sit",
            "start": 3671.24
        },
        {
            "text": "into uh other other alternatives to that I think she came across I don't think it's I can't remember what they're called not holistic doctors but they're they're doctors that will actually sit down and and do like they'll sit with you for two hours they'll run all sorts of labs and and do like a full workup on you first before they give you any sort of recommendation as to what to do if you're in pain or if you're suffering from something just because they want to know the full spectrum of what could be causing anything which I think is very very fascinating obviously it's very expensive which sucks that our our Healthcare can't really support that but I mean they'll look at nutrition is the number one thing that could be causing you problems in your life first and foremost like what are you putting in your body what's going into your gut what how is that having effects on your brain um how is that having effects on your immune system all that stuff it's very very fascinating um but",
            "start": 3715.32
        },
        {
            "text": "you putting in your body what's going into your gut, how is that having effects on your brain um how is that having effects on your immune system all that stuff it's very very fascinating um but there's just not a lot of and the problem with pills obviously is that you're not getting there's not enough like they're not focused enough for uh for specific problems especially mental problems and that's what a lot of people have have issues with is that it's kind of a one pill fits-all sort of solution and that's unfortunate um is an anesthetized well yeah I mean that's the problem is right it's it's it's it's masking the symptoms but not the underlying issue so but so I'm with you on that for sure I always talk to Greg about we talk about nutrition every once in a while when uh because he's trying to quit team fat and um I thought you were leaning to a joke I was G to be part of not against me I want you to change I've actually had conversations about this I want I want you to just",
            "start": 3750.72
        },
        {
            "text": "he's trying to quit Team Fat and um I thought you were leaning towards a joke, I was G to be part of not against me, I want you to change I've actually had conversations about this, I want I want you to just change one letter and fit yeah dude no way never because we okay I'll get real um I um this year was was was really scary for me um in April about actually about back up February kind of started getting a little sick and so uh in April I went to I got to present it to the BAFTAs which was really really cool um but I barely made it there because I the second our plane touched down I was horribly sick and our car was literally downstairs uh to pick us up and take us to the to take us to the uh show and I looked at my wife I was like I don't know if I can go and I got myself in the car it was about a 30-minute car trip I was dying the entire time I sat down in my seat and they were like we need you and they literally brought me backstage I presented the award and I got out and I left um and we had",
            "start": 3787.6
        },
        {
            "text": "\"Car trip, I was dying the entire time. I sat down in my seat, and they were like, 'We need you.' And they literally brought me backstage. I presented the award, and I got out, and I left. Um, and we had already booked this trip for my 40th birthday. We were going to go to the south of France. Stupid, it was cool. Um, so we go from London to Paris, and I'm just... 66 si si, I can't keep food down. I'm just... I feel like I'm dying. And we get to the south of France. We're in this beautiful hotel overlooking gorgeous things, and I am... I'm in this um, I'm in like the shower basically. And um, it's about 2 o'clock in the morning. And I'm trying to figure out how I'm going to tell my wife that I have cancer. The next morning, uh, wake up, and she's having breakfast. I'm just not eating or anything. She says, 'Okay, something's wrong. Something's really, really wrong.' So we get the name of a nutritionist who was recommended to us. And this is why I bring this up. And um, I was like, 'I need to talk to'\"",
            "start": 3844.12
        },
        {
            "text": "It's like I'm something's wrong, something's really really wrong. So we get uh the name of a nutritionist that was recommended to us and this why I bring this up. And um I was like I need to talk to you and he's like cool, we'll set up an appointment when you get back. I like I need I need to talk to you now. So this guy facetimes me and I'm sitting there and he's not really paying attention to me. He's like okay, I want you just kind of walk me through your symptoms, let me know what you're going and I'm like looking at going do I need you? I need I need you to be with me on this. I said uh well you know I'm having these problems and this symptoms and this symptoms. He's like okay, okay, okay. And I said if had some weight loss and he's like how much. I said about 20 lbs and he stops and he looks and he goes walk me through that. And I'm like **** here we go all right this is where the bad news starts. And um he goes why don't you just tell me this, what did what did you have to eat.",
            "start": 3897.72
        },
        {
            "text": "\"Greg goes, 'Walk me through that.' And I'm like, **** here we go. All right, this is where the bad news starts. And um, he goes, 'Why don't you just tell me this? What did what did you have to eat today?' And I said, 'Um, I had some Pudding.' He goes, 'Okay, what else?' He said, 'Just just just Pudding.' He goes, 'For breakfast, for lunch, for dinner.' I said, 'No, I've just had a little bit of Pudding.' And he goes, 'Oh my god, dude. Of course you're going to be losing weight. You're on the same diet as like a Hollywood starlet trying to play a heroin addict. Of course you're going to be losing weight. God, you're scaring me for a second.' And he looked at me and he said, 'I'm going to heal you.' For someone in the medical field to say something like that without there being like this I'm a you know Southern Baptist preacher you know tent revivalist thing... Like dude, for someone to look at me with the with the level of conviction and passion and be able to go, 'I can't wait to roll my sleeves up. Don't worry, he's like.'\"",
            "start": 3938.04
        },
        {
            "text": "know tent revivalist thing like dude for someone to look at me with the with the level of conviction and passion and be able to go I can't wait to roll my sleeves up don't worry he's like I know the place that you're in right now and you don't deserve to be there and I really needed to hear those words you don't deserve to be as depressed as you are because there are people that legitimately have something I I save that for them you just don't feel good and he did that he as soon as we came back he had a nurse come to my house at like 8:00 in the morning do a full battery of test and I found out I had like SIBO I had I had like a bacteria thing that's it and I got him some completely natural things cleanse my body out and I'm rocking and rolling it's been a long fight back but none of that was covered by insurance it was horribly expensive if I didn't if I wasn't in the same situation in life that I'm in right now I would still be in the same place that I was there that's wrong that's",
            "start": 3986.8
        },
        {
            "text": "was covered by insurance it was horribly expensive if I didn't if I wasn't in the same situation in life that I'm in right now I would still be in the same place that I was there that's wrong that's wrong and that's the kind of attention that every doctor and I've been to my doctor I've got a great doctor but he looks at me he goes I don't know antibiotic pain pain medication or antibiotic it's the only two things that a doctor gives you this is a nutritionist which a lot of people talk up to chiropractor nutritionist those are two kind of like Fringe doctors this guy healed me dude he he assessed what was going on he broke it down so much he was like let me guess about 10:00 every night you just get wired you're amped I'm like yeah he goes okay I said how how did you tell he goes the spit test that you did and every day like they'll spit into a tube there you go he's like I know exactly what's going on in your life I know exactly your circadian rhythm is off he just like ran",
            "start": 4034.24
        },
        {
            "text": "the spit test that you did and every day like they'll spit into a tube there you go he's like I know exactly what's going on in your life I know exactly your circadian rhythm is off he just like ran the gamut I wanted everybody to do that test to be able to do that but it's uh I don't know where I was going with that anyway no that's but that's awesome like my that's and that's that's the kind of thing that my wife and I are like we look into because it's just even just to be able to do it even if you're feeling okay just to see where you're at where your body chemistry is at where your exactly like you know gut biomes at things like that where you're just taking stock of all these things that there's there's you just don't traditionally talk to a doctor about I brought up Greg earlier I was I was joking with him um but I always find it hilarious that when you take when you have a pet and your pet's not feeling well and you take him into the the vet the first thing I ask you is what",
            "start": 4080.08
        },
        {
            "text": "was I was joking with him um but I always find it hilarious that when you take when you have a pet and your pet's not feeling well and you take him into the the vet the first thing I ask you is what what did he eat what what's what's in his diet what are they what is he putting into his body right they don't ask the the pet about anything in its you know what's your uh what's your history yeah exactly because they can't because they can't right and so the so that medicine is sort of evolved to be like it has to be biological we have to figure out like what's happening chemistry wise in this in this in this animal to make him act like this right um because you can't really talk to him and talk about his past not to say that there aren't you know things that happened in people's past that do cause brain issues things like that but um but that but I always find that fascinating that that doctors don't spend any time talking to people about how they eat and we don't put we put",
            "start": 4117.0
        },
        {
            "text": "that do cause brain issues things like that but um but that but I always find that fascinating that that doctors don't spend any time talking to people about how how they eat and we don't put we put basically we're just essentially divorced from what we put into our bodies versus our health right we just don't we think those two are mutually exclusive we'll put premium gas in our cars because we want it to run better but we'll put **** into our bodies we don't care about we put in our bodies right um and that's to say that I understand that it is it's economically difficult to eat healthy in this country I readily admit that um I've started cooking you know we're talking about this we I've started cooking more for myself just because I always swing from extremes I hate going to a restaurant cuz I'm like I got sick from food before I don't want to get sick again if I prepare my own food and it's become this fun thing I love cooking I made this stew the other night that was epic",
            "start": 4151.96
        },
        {
            "text": "restaurant cuz I'm like I got sick from you before I don't want to get sick again if I prepare my own food and it's become this fun thing I love cooking I made this stew the other night that was epic bro it was epic it was a thing of beauty I've been loving the pictures of seeing like this what we met I was like **** dude that inspires me I'm like I'm not going to have that that man outdo me I'll tell you what Rachael Ray and yes I can Rachael Ray Rachael Ray magazine get on that that's where you get these recipes come from Colin how good were the chicken breast last night yeah you made some great chicken right Spanish chicken and Chorizo because I can really I can really relate to what you're saying in the sense because I've had stomach and colon issues my entire life and to the point where I like when I was young I went to Boston University to their medical center as a kid because they were like what the **** is wrong with this person you know and that was when we had barium enemas",
            "start": 4195.96
        },
        {
            "text": "like when I was young I went to Boston University to their medical center as a kid because they were like what the **** is wrong with this person you know and that was when we had Barium Enemas and all that we don't they don't do that kind of **** anymore as we've talked about in the show in the past but I know what it was like to be like when they would be like oh you have this or this and I'm like but what you're saying doesn't make sense and that was and it was the whole the Celiac thing when they were like you have celiac disease which I thought for two years I had celiac disease there was a moment where everyone had celiac disease like I thought I did do yeah and and I'm like but what you and like well I'm like so this is something you're born with and it's genetic and they're like yes and I'm like but what you're saying doesn't make sense I grew up in an Italian house all we ate was pasta and garlic bread allil and pizza and I had no issues with any like it doesn't it's",
            "start": 4231.76
        },
        {
            "text": "yes and I'm like but what you're saying doesn't make sense I grew up in an Italian house all we ate was pasta and garlic bread always and pizza and I had no issues with any like it doesn't it's not related to food but you have it and I'm like but it doesn't make sense I remember getting into a fight with the doctor like and the nutritionist there and they're like \"but but you do\" I'm like \"but you're wrong you're wrong you know like it doesn't make sense\" and then they did an endoscopy and they're like \"no we were wrong\" it pisses me off people go \"I stopped gluten and I feel fantastic\" of course you did you stopped eating processed foods you started eating real food that's one thing my doc said is like if I could cut anything out for you it was sugar and literally no offense this is my only source of sugar now I don't I just don't do sugar and I don't miss it it's like a day or two of like withdrawal everything but then the second that you get over it you're okay",
            "start": 4256.88
        },
        {
            "text": "this is my only source of sugar now i don't just don't do sugar and i don't miss it it's like a day or two of everything but then the second that you get over it you're okay you're totally fine but i highly support uh eating cleanly whatever ever that looks like for you i'm not telling you you have to eat kale constantly Kale is good for you though i'm just saying it's good too it's a cut on the album of Health Cal everyone agrees just eat clean just eat clean dude i want to talk and maybe some because what happened to me was whatever uh bad stuff that i had going on i took an antibiotic and it was just a nuclear blast the ly broke and all the good bacteria and it took about a year of building up good bacteria and i'm like there i read an article recently this reason why it's on my brain about diet soda artificial sweeteners and what those do to your gut they do the same thing that antibiotics do they nuke all the good",
            "start": 4296.08
        },
        {
            "text": "read an article recently this reason why it's on my brain about diet soda artificial sweeteners and what those do to your gut they do the same thing that antibiotics do they they nuke all the good bacteria and allow the bad bacteria to to um kind of grow and thrive and it'll it'll **** you up and that can actually affect Cravings it'll actually like make you crave sweet things more yeah it does there's all sorts of research coming out on artificial sweeteners that I'm trying I'm like it's terrifying to me because I drink a lot of diet soda, going to say Diet Coke I Envision my stomach is kind of like level 19 or level 20 in Dr. Mario you know and like you kind of got to like really you got to really like kind of get you know some good bacteria but yeah it's it's it's it's I can really relate to what you're saying because it's like I like there's these people are medical professionals they go to school they're very smart and I have a lot of respect for the medical profession you know my",
            "start": 4340.76
        },
        {
            "text": "to what you're saying because it's like I like there's these people are medical professionals they go to school they're very smart and I have a lot of respect for the medical profession you know my girlfriend's an ER nurse but above and beyond those people spend 10 15 20 years doing the residencies and all these kinds of things but there is like common sense **** where like they're just it's a churn so like there's no time to sit there and be like but you're wrong like I knew I **** knew it when they told me that I'm like what you're saying doesn't make sense like you have a full patient roster and you have to stay current that's hard that's not easy right I mean you're asking you're asking a human being to know **** everything they just can't possibly know that right um and a lot of doctors like I've heard I don't know I've medical school but don't spend a ton of time in medical school on nutrition specifically like you don't I I just don't think they spend a ton of time on",
            "start": 4379.12
        },
        {
            "text": "of doctors like I've heard I don't know I've medical school but don't spend a ton of time in medical school on nutrition specifically like you don't I I just don't think they spend a ton of time on that I could be wrong let me know in the comments ER doctors and public defenders those two they have on average I think John Oliver did something like this where they have like on average like 8 minutes max with you 8 minutes to determine if you're going to live or both senses like if you have or you're going to spend your life in prison you're going to spend your life on a medication 8 minutes is not enough it it you have to invest um but I I will honestly say this if you want to get really really high just go be active go do something just walk outside do something active one of the best things is this stupid Apple Watch or that's not Apple Watch something that tells you it's time to stand up if you stay seated for more than an hour which I'm looking at",
            "start": 4413.68
        },
        {
            "text": "Things is this stupid Apple Watch or that's not an Apple Watch, something that tells you it's time to stand up if you've been sitting for more than an hour. Which I'm looking at this, it's been over an hour - it's just as bad as smoking a cigarette. We stand up for a second, and it gets weird. And framing strange things, I don't care. Oh look at these sweat stains - another reason I don't wear white. Jesus God, have so many black t-shirts standing here it looks like Troy. Oh yeah, sitting down. Hand jobs have fun internet, have fun with that anyway. You guys have made a compelling case on feeling why I wouldn't want to lose my feeling. That leads us to the last one, which is a sense of taste and smell. Which trust me, guys - giving up my sense of taste would be bad. Man, that was good. You are by far the best dressed guest we've had on ever. I think do you like my Westworld outfit? I love it! I love it. Doesn't it look like what Bernard wears? It looks like a cross between Bernard and Ed Harris's character, The Man in Black.",
            "start": 4457.32
        },
        {
            "text": "\"Guest, we've had on ever, I think. Do you like my Westworld outfit? I love it! I love it. Doesn't it look like what Bernard wears? It looks like a cross between Bernard and Ed Harris's character, The Man in Black, a little bit, cuz he has like that that that sort of uh that little fluffy thing. The fluffy thing - what do they call those? Not C-Kat, thank you! I was going to say KFF, but that's you. Hold liquid. Do you believe Ed Harris is hold on... hasn't watched any of it. Ed Harris is a phenomenal actor. I'm waiting for Westworld and he's waiting for Batman to marathon through to not be yeah, I don't like waiting; it'll be good. And I agree with you. Netflix is the same way with whether it's uh Stranger Things - would Stranger Things have been as good if I couldn't have watched it in like two days? No, Stranger Things would have actually had to stretch it out intentionally because I... I didn't want it to quite end so it is a dichotomy.\"",
            "start": 4500.12
        },
        {
            "text": "been as good if i couldn't have watched it in like two days no stranger things would have actually had stretch it out intentionally because i i didn't want it to quite end so it is a dichotomy you know it is a paradox actually i'm watching vep right now oh God I love excellent show fantastic especially now I love how you never see look at you're like that's so funny that they would make fun and you're like no that's our political system is it's like a documentary I love her I love her bagman is like uh Buster Buster yeah yeah he'll always be Buster in that too yeah um and that and she's mother yeah oh God she is I will say real quick before we move on to the next topic about uh Julia Roberts aging like a fine wine oh God just wanted to throw that out there um how about oh my God Gillian Anderson oh my god you watch God yes I watch what the hell happened to her she's better she was she was cute she was cute in The X-Files yeah she is sexy she is fantastic",
            "start": 4536.52
        },
        {
            "text": "Out there, um, how about oh my God Gillian Anderson, oh my god, you watch God yes I watch what the hell happened to her, she's better, she was cute, she was cute in The X-Files yeah she is sexy, use in a 70s term and I'm talking about like not just like aesthetically like she is just a powerful woman with presence super sexy like intimidating and I love it, she's incredible and she's brilliant and Jamie Dornan's getting that too God bless him because he... I could what happened in I didn't I didn't see the movie but I was like that's the guy from CHiPs yeah and also Winona Ryder we were just talking about this today Danica McKellar, she's a mathematician right or something no she has a theorem named after her it's crazy like she does not age at all I know I mean look at Troy you don't age oh I had my 40th birthday what dude looks 10 years younger than I do how old is he 36 36 almost 37 40 gets cool dude 40 is awesome I'm excited about 40 yeah 40 is awesome you'll do 40 really well think so",
            "start": 4578.16
        },
        {
            "text": "my 40th birthday what dude looks 10 years younger than I do how old 36 36 almost 37 40 gets cool dude 40 is awesome I'm excited about 40 yeah 40 is awesome you'll do 40 really really well think so now are you still **** cuz we were talking earlier that as you get older you don't **** cuz true dude give away sensation gives away You're the youngest in the room do you mean other people or or just like you can **** yourself if you want but yeah but see that's what I was going to say when you said no no sense of uh of touch because masturbation who cares about sex the **** am I going to do with myself every was the one who said is like forget if you can have sex with the person that you're going to marry can you talk to them after 40 years or 20 years whatever cuz I guarantee you that's one thing you will be doing right I completely believe in that but no dude it's it's uh uh yeah I'm still Tim Gettys was going to say something you give up I've had a couple scares my life and",
            "start": 4629.88
        },
        {
            "text": "one thing you will be doing right I completely believe in that but no dude it's it's uh uh yeah I'm still Tim Gettys was going to say something you give up I've had a couple scares my life and they they kind of uh gave me a lot of information about how I would handle this this topic no no no not actually never had a pregnancy scare um but Nick chimed in into my ear with herpes a herpes scare never had a herpes scare no never there's never been any sex there's like you know there's a lot of rubbing that happens sometimes you don't know what it is you've ever had a pregnancy scare no you none of that none of that you never feel more alive driving to Walmart going God no God no you never feel more alive than when she goes H never mind no I just got my period like yeah I had once in my life where that happened and it was like it was like for some reason 15 days late and she called me and I was like she's 15 days late it was some ridiculous it was like an antibiotic thing she had",
            "start": 4670.72
        },
        {
            "text": "my life where that happened and it was like it was like for some reason 15 days late and she called me and I was like she's 15 days late it was some ridiculous it was like an antibiotic thing she had taken it like threw off her oh my God days I would be losing my mind over it's a very different time now like birth control is way more of like just a common like that that is the I didn't grow up in the 18th Century what was it stuff rags in each other control your maiden hath borne a child of yours you joke and say that but it's like then when I when I talk to you about like any sex things it's like me like me and my friends are so different like my girlfriends that you know or like is he the Millennial contingent yeah okay no he does he and and it is uh crazy to talk to him about like his experiences with women and specifically like how they view different things like porn things like that versus mine growing up like me in my 20s if a girlfriend found out that I was",
            "start": 4712.4
        },
        {
            "text": "about like his experiences with women and specifically like how they view different things like porn versus mind growing up like me in my 20s if a girlfriend found out that I was watching porn she'd be offended right or you would deny it or I emphatically deny it, porn never even though they could literally go one folder deep on any folder in my computer and probably find something, any folder folder deep going into the midterm what the **** I didn't I didn't want to find the folder that had everything so you in multiple places why would you look in there yeah exactly but no but I but I I definitely think I grew up in the wrong era I think that I I should have been your age I would have thought you definitely would have thought but no I've had some St is where uh when I was younger I went to Santa Cruz the like the beach with Kevin one time and like there you know we'd be in the waves and **** and like I remember one time like the we'd like just be playing and like",
            "start": 4756.84
        },
        {
            "text": "younger I went to Santa Cruz, the beach with Kevin one time and like there you know we'd be in the waves and stuff and like I remember one time like we'd just be playing and like body surfing and stuff and a really big one came in and like slammed me into the ground and I got a lot of sand in my ear and then I remember uh going back and taking a shower and getting it all out and it felt like it got it all out um but I always felt like this weird thing where it felt like it kept popping all the time I'm like that's weird and whenever I'd shower whenever water would get in is when I would notice like the water would stay in there for a while and then it wasn't until no it's not even that bad it's not bad this isn't bad um I said oh God no no no no no no no you better ratchet this story up dude no went to the doctor and and it was just wax I had a lot of wax in my ear and but that was my thing is like I just get a lot of wax filled up and it's",
            "start": 4795.96
        },
        {
            "text": "no no no you better ratchet up this story dude no went to the doctor and and it was just wax I had a lot of wax in my ear and but that was my thing is like I just get a lot of wax filled up and it's been a problem in my life and I just didn't realize it till that point Q-tip stuck in there but it's like it's way in there and it's to the point where put that thing in and pull I according to the doctor I'm not supposed to do it myself like it's too deep in there where do it it's no no no they like it needs to be done by a doctor with the weird ass thing and I need to go every like couple years or whatever and like but whatever they do I'm oh my God like I'm missing out on so much that I didn't realize because you couldn't hear because I couldn't hear and it was like an ear opening moment and uh then it it wasn't until later I had this a very similar thing with my glasses I I or with my eyes I knew I couldn't see as well as everybody else I was 17 or whatever and I I was kind of fine with it cuz",
            "start": 4832.32
        },
        {
            "text": "it wasn't until later i had this very similar thing with my glasses, i or with my eyes, i knew i couldn't see as well as everybody else. i was 17 or whatever, and i was kind of fine with it cuz i'm like failed the driving test you ran over a kid, a couple people. this is a very 17-year-old Tim Gettys uh belief, and i'm like hey the girl across the street she's hot as hell they're all tense everything here i live in a world of tense everything is great he's like yeah that's an old man i don't give a **** she's hot as hell uh that was my life and i like living that life but then when i got my internship at IGN, that was like oh **** this is the first real thing like i don't give a **** pressing my college professor but i need to perform here so that's when i got glasses put them on i'm like oh **** yeah the world is so different than i thought it was and it was like crazy cuz i've lived my whole life that way, you know, now yeah now contacts and it's just like",
            "start": 4875.44
        },
        {
            "text": "put them on I'm like oh yeah the world is so different than I thought it was and it was like crazy cuz I've lived my whole life that way you contacts now yeah now contacts and it's just like it's insane how big of a difference it is cuz like even without contacts these days like once you use glasses for a while you can't like your vision gets even worse cuz you're so dependent on and so used to just being able to see this so if I don't have my contact in I wouldn't drive like I don't feel safe whereas a couple years ago I would have and been totally fine with it um so I've kind of experienced these things where these moments of like oh my God like this thing is back in my life uh about a month ago I woke up in the middle of the night with the worst pain I've ever experienced and my ear my left ear was just ringing and it would would not stop ringing and it felt numb like the entire ear felt numb and I would touch it I'm like what the hell is happening and I'd put headphones",
            "start": 4918.48
        },
        {
            "text": "my ear my left ear was just ringing and it would wouldn't stop ringing and it felt numb like the entire ear felt numb and I would touch it I'm like what the hell is happening and I'd put headphones on and there was a definite difference between the two I'm like **** crab yeah um and it it was driving me crazy because like I got really scared to the point that I didn't really want to talk to people about it cuz I was like I don't know what's happening to me and this could be like life-changing cuz like I started going through all these like it was so bad that I reached a point that I'm like what if I go deaf yeah and like what if I can't or show what if you don't and what if that's what you have constantly like you constantly have that ring I mean well that was I mean that if it stay if the other ear went that way so like tonight you're saying so I did a lot of Googling did a lot of figuring out I know I know cuz then you start like convincing yourself that you're dying that's when",
            "start": 4959.88
        },
        {
            "text": "the other ear went that way so like tonight you're saying so I did a lot of Googling did a lot of figuring out I know I know cuz then you start like convincing yourself that you're dying that's when you have AIDS that's what we thought everything **** but but I I kept doing it's probably just an allergic reaction or AIDS and uh but it ended up being I mean at least again I don't know I didn't go to an actual doctor for this I was planning on it Kevin again Kevin snapped on the looking at looking at all the I got it works right got his leather but then I was I after like really goog cuz again if you just do a Google search you have AIDS you're going to die but if you keep going deeper you can get to a point where I'm like all right am I really experiencing this am I experiencing that is this happening is that not happening all that and I got to a point where I'm like this thing telling me that if I go to Walgreens and buy one of these nasal congestion things that it's a nasal",
            "start": 5001.76
        },
        {
            "text": "is this happening is that not happening all that and I got to a point where I'm like this thing telling me that if I go to Walgreens and buy one of these nasal congestion things that it's a nasal thing and I was like this is what it sounds like like it it's not necessarily horrible tonight it's not necessarily I'm going to for whatever and it's definitely not the wax thing and I did that for about a week and I'm like it's gone nice holy **** it but there was fears that I had then where I'm like holy **** if I lose hearing like I wouldn't be able to do the show obviously I wouldn't be able to live my life I wouldn't be able to listen to music like all of these things that I'm like side never hear Kevin again though I will say this never never count yourself out because I think you would be an incredible deaf guy it would be hilarious to see you still like like try my best the really good thing and I'm not going to make fun of that people making fun of him you're more making fun of",
            "start": 5046.16
        },
        {
            "text": "be an incredible deaf guy it would be hilarious to see you still like, like try my best the really good thing and I'm not going to make fun of that people making fun of him you're more making fun of Tim what podcast I can't do it I wouldn't be able to we have to get new mics cuz the mics hide the lips you would be able to read lips what do you think Tim me yeah what's the topic yeah I I couldn't I couldn't do it I definitely couldn't do it I think I've come down to I would want to give up smell and I went back and forth for a long time but I already have a bad sense of smell right I give up smell I think that I you know how I wouldn't wouldn't be sure my taste would be different but I would still have taste and develop a new taste whereas you figure with smell with smell I'm going to give up I'm going to smell this great pizza this great pasta whatever then I'm going to eat it and not get any enjoy I know the games you like you don't really have that very good taste to be honest and and",
            "start": 5087.64
        },
        {
            "text": "I'm going to smell this great pizza, this great pasta, whatever. Then I'm going to eat it and not get any enjoyment. I know the games you like; you don't really have that very good taste, to be honest. And farts would never be a problem, that's true. But you would never be able to smell less farts. I feel like smell would help me a lot when hanging out with Kevin so much. Oh yeah, you wouldn't be able to taste or smell Kevin. Yes, Kevin just sat back down after handling whatever business was at the front door and he just started laughing. Yeah, for no reason; he heard it. He heard he heard his name; he knew it was funny, a fart noise. You made a fart noise probably. Taste yeah, just I mean if if we're talking about smell yeah if we're talking about the uh the general I think if you had to smell that pizza and couldn't taste it that would suck. See I think I would you you said 7:30 I need to be at the airport by 7 at the latest. I what I usually do is send people out of here, I I leave at two hours so I",
            "start": 5132.48
        },
        {
            "text": "and couldn't taste it, that would suck. See, I think I would you said 7:30, I need to be at the airport by 7 at the latest. I what I usually do is send people out of here, I leave at two hours so I would say 5:30 you could leave here for 7:30 flight yeah you're 7:30 yeah we're close enough to the airport, I think you'd be fine at 5:30 but you could leave now. Do you like to get there two three hours early, like my mom and I am super weird about that. I first of all I'm not someone who likes to be late, uh I used to be until my mentor of mine showed me that's an absolute sign of disrespect and what it communicates whether you believe that or not. My wife used to be late too and she's no longer that way when it comes to airport, Port I am the first on the plane, I want to be in like the lounge or in the air in the terminal and hour before but the second I get on a plane I set up shop like I am I am good. That's why honestly like a 45-minute flight back to LA yeah sucks I",
            "start": 5171.08
        },
        {
            "text": "be in like the lounge or in the air in the terminal and hour before but the second I get on a plane I set up shop like I am I am good that's why honest like a 45-minute flight back to LA yeah sucks I hate it can't get comfortable no you don't have to do anything you're just going to sit there and wait you will sit on the tarmac longer than you will fly do you want to leave then we're not trying to hold you hostage want you leave at 5:30 by six like I don't yeah I don't think it would take longer to the city right here right here you're right but it's up to you if you like do we have one more topic you wanted to cover traffic I mean two what do we have we got New Year's Eve stories and musicals you want you want to do one more and then bounce yeah all right which one you want to do I don't know man Shake It Up let's see what happens I was thinking about calling an audible on my topic I thought about a different topic what's your topic kill I thought you took a bite of celery I was like",
            "start": 5217.32
        },
        {
            "text": "know man Shake It Up let's see what happens I was thinking about calling an able on my topic I thought about a different topic what's your topic kill I thought you took a bite of celery I was like what sounds like celery when's the last time you guys were in situation where you were forced to not have a cell phone how awesome was that did you realize how awesome that that that aspect of the night was for us I got it go for it um the trip that that uh my wife and I Travis and Laura I'll go for their Laura's and Pan's birthday um Travis and I loved girls cannot no scuba diving No SCUBA diving for me glutton for punishment and Travis is a water baby so it's that's what we do we go scuba diving so we get out there early in the morning and we walk out into the boat and I'm like son of a **** and I literally walked out into the water phone in my pocket with your phone turned around I was like oh my God I pull it out I'm looking I was like oh **** and there's one of the guys that's",
            "start": 5260.04
        },
        {
            "text": "and I literally walked out into the water, phone in my pocket with your phone turned around. I was like, \"Oh my God,\" I pull it out, I'm looking... I was like, \"Oh ****\" and there's one of the guys right there, uh, like a little concert on the beach. I was like, \"Dude, I'm so sorry.\" He's like, \"I'll put it up in your room, don't worry.\" So I hand him off my phone, and I turn around to walk back in the ocean, and Travis comes walking... I was like, \"**** walked in the water with my phone pocket,\" and I just got the new or whatever is before the seven, or whatever came. But I was just gotten the phone like a week before. I was like, \"Pam's going to kill me.\" Go out scuba dive, come back, it's great. Look at my phone, toast, seawater... like salt, no way, it's gone. So I'm sitting there, we're on the beach, got no phone. So what do you do? Yeah, dude, I just... this has become a sense for us. It thinks for us, it sees for us, it plans for us, it hears for us, it talks for us. To take that away... I mean, I remember sitting there on",
            "start": 5307.6
        },
        {
            "text": "do you think for us it sees for us it plans for us it hears for us it talks for us to take that away I mean I remember sitting there on the beach looking and I just literally watched the clouds and I was so aware I was listening to the breeze I was listening to conversations happening back here I talked with Pam which we never talk yeah um God my go wouldn't shut up y y y y I read uh Devil and Miss Prym which I think you would really enjoy uh Paolo probably saying his name wrong um I I just I did stuff and I was like whoa this is really really helpful and since then I try to make a point because it's so easy to look at a screen mhm any screen and scrolling man you get addicted to it this okay so what we used to do being a kid of the 80s is if you're in a situation like that that required that you went out and smoked you went out got a cigarette cuz you could be in the most uncomfortable situation ever I'm going to go outside",
            "start": 5351.84
        },
        {
            "text": "the 80s is if you're in a situation like that that required that you went out and smoked you went out got a cigarette cuz you could be in the most uncomfortable situation ever I'm going to go outside have a cigarette and you're party of one totally fine I'm sitting out here there's an activity to it if there's someone that you couldn't stand you at least could commiserate with this but now this was at least some kind of like social interaction with the cigarette hey can I bum a light can I bum a smoke hey can you knock over a microphone that's what I do for living too by the way weird um but for some reason now we've gotten so just closed off and we don't talk we don't interact we don't do anything I even caught us in the in the way back we're like having a really intense conversation resp you called down out in the Magic Kingdom um I think you would dig that um out already because he heard Magic Kingdom so in the future then everyone say when it is um we've conquered death",
            "start": 5407.12
        },
        {
            "text": "resp, you called down out in the Magic Kingdom, um, I think you would dig that, um, out already because he heard Magic Kingdom, so in the future then everyone says when it is, um, we've conquered death, it's basically the Reincarnation wall thing, you can just download your Consciousness to a new body, so if you want to experience dying go for it, um, or you can just live forever but the whole there's no phone thing cuz we can just subvocalize, so I can be talking to you and meanwhile and basically having a separate conversation with any number of people Dr. Manhattan **** that's where we're headed and we already do it, I'm listening to you as I'm texting these people but I don't I don't want to get there so I think it's great to not look at just don't look at a screen just sure don't get me wrong there's I being disconnected is not bad but I do feel like it gets a bad rap of you're looking at it so you're not we were still having the conversation still being a part of it but I was texting Kevin",
            "start": 5459.0
        },
        {
            "text": "I being disconnected isn't bad, but I do feel like it gets a bad rap. If you're looking at it, you're not part of the conversation still, but I was texting Kevin to see if he could get us food to make sure that it was working and when he couldn't, I was able to Postmates us food so we got here to keep everything on schedule so you could leave and do...and it is that thing of like you're live fast, you're interacting with other people right? Like if I come out of a shoot or whatever and I have a message from Jen and my mom and whoever else and I'm going back to them while I talk to Nick about something else. Granted, if Nick was like, \"You know, your family member's dying,\" yes, put the phone down. But if we're just bullshitting, then it's a live text conversation whereas the text is a you know text conversation that we're having. If that makes sense. But take Saturday right for instance, which was a different environment, give this, give them all so for context.",
            "start": 5506.2
        },
        {
            "text": "the text is a you know text conversation that we're having if that makes sense but take so take Saturday right for instance which was a different environment give this give them all so for context uh a bunch of us uh went to a wedding on Saturday night where the the two people the bride and groom requested that we all turn our cell phones in beforehand so we had a Val like we got on the bus to go to the location where they were getting married and they get they had a little slip of of uh plastic with a little valet slip and you put you know the tore one off put on your phone put in the plastic sealed it gave it to the person and you got it back at the end of the night when you were leaving um and every single person myself included was like I'm not doing that 100% not every single person just Nick uh started four days before that he wasn't going to do it I didn't do Kevin didn't do it I'm Kevin straight up his phone people that didn't do it my friend",
            "start": 5539.12
        },
        {
            "text": "person just nick uh Nick started four days before that he wasn't going to do it I didn't do Kevin didn't do it I'm Kevin straight up his phone people that didn't do it my friend and for for different reasons right various reasons like my friends behind us have a newborn they're not giving up like one of the phones so they just had to figure it out right but then I mean I'm not talking about everyone specifically just for my own for myself I'm like I don't want to do that there's all these stupid reasons why that I don't want to give up my phone right now they could lose it uh something could happen like I what if I get like what if the bus turns over I get thrown out the window no one can find me I'm not going to be able to call an Uber to get home stupid reasons like that right but inevitably it's the whitest thing you've ever said but my wife uh who is not really that addicted to her phone was like why don't you just do it let's what's the worst that can happen like where you know if",
            "start": 5574.32
        },
        {
            "text": "it's the whitest thing you've ever said but my wife uh who is not really that addicted to her phone was like why don't you just do it let's what's the worst that can happen like where you know if I'm sure if if someone lost your phone the groom would buy you another one like it's it's not that big of a deal I'm if my wife's with me I'm totally fine yeah if my wife's with me I'm totally good but so I mean and that was kind of my kind of what hit me over too cuz she was like I'll do it I'm like well you're here we're going to be together all night it's not a big deal like you're the only person in my life that doesn't have someone else immediately in the vicinity so if she needed help whatever um we turn him in and I'm like initially like this is weird I'm I'm I found myself looking like checking my pockets for the first hour like where's my phone and we were sitting and it was probably the worst environment to not have your phone we were at a Greek Orthodox wedding so we were at",
            "start": 5613.2
        },
        {
            "text": "my pockets for the first hour like where's my phone and we were sitting and it was probably the worst environment to not have your phone, we were at a Greek Orthodox wedding so we were at a wedding where the ceremony was all chanted in exactly I can't it I can't handle it too much now again to interject right here with guilt that you should feel yourself come on that's the worst situation, not even if I had my phone at no point would I have broken it out during that ceremony, you would 100% have been at a Greek Orthodox wedding, boring OMG I know check it out you know no way man I can't do that, you would have been at least tempted to be like like during the 13th time walking around the little pillar with like the things on their head I'm like I haven't been to church in forever and like not granted I'm you know I'm Roman Catholic so it's not the exact same when they broke out the incense and we're going like that I was like oh this smells takes me back and when I shut",
            "start": 5652.16
        },
        {
            "text": "and like not granted I'm you know I'm Roman Catholic so it's not the exact same when they broke out the incense and we're going like that I was like oh this smells takes me back and when I shut my eyes I started nodding off like oh this sensation takes me back funny I felt a finger up my like oh I just went to a a Greek or Russian Orthodox wedding this summer and they were saying how they used to be comically long and they actually and this particular one truncated to a more Roman Catholic size uh thing which only 45 minutes thankfully cuz they used to be like 2 and a half hours I think something yeah know I mean I I I remember cuz I used to shoot wedding videos I remember some of them going up to like an hour and a half I I've never experienced was two hours for the record I forgot my movement watch like I said I wanted to wear so I didn't have it and I had no idea the time I thought it was way longer than 45 minutes really that was I didn't know we walked out like what",
            "start": 5699.56
        },
        {
            "text": "watch like I said I wanted to wear so I didn't have it and I didn't know the time I thought it was way longer than 45 minutes really that was I didn't know we walked out like what **** time is I'm looking at the sun why is the moon on fire that's the sun oh God you told me dude that was 2 and a half hours I would have been like yeah man that sucked yeah I don't think it was one and a half it as some of you have watches you checked your phone like 20 times my phone yeah I mean your watch like you were constantly yeah but I didn't know when it started that was the thing my wife told me it started 5 before I would have kept the hour and then it ended 45 after I would have kept at least my watch on and said am I going to be like 30t away from where the phones are well that was my problem so I knew when my phone was close cuz my Apple Watch would all of a sudden give me like text messages from all the **** that didn't so they were like there was like a sneak dude did you actually",
            "start": 5735.76
        },
        {
            "text": "so I knew when my phone was close cuz my Apple watch would all of a sudden give me like text messages from all the **** that didn't so they were like there was like a sneak dude did you actually turn your phone off going there's a ton of people and you know but see here's I'm on the flip side of this I'm way closer to Greg on this where I'm just like all right I understand that personal interactions are important and they're great and all that stuff uh having a phone doesn't stop those from happening I have amazing conversations with all the people close to me constantly how often do we talk we do talk a lot but here's think about we talk all the time all this was the first situation where for a 10hour period yeah I was just constantly having conversations with people about what about not being able to use phones that's my problem at all yeah we were there 12 to it was 12 to 12 my problem is then all of a sudden we're talking to these people and all everyone's bitching about is their",
            "start": 5774.96
        },
        {
            "text": "to use phones that's my problem at all yeah we were there 12 to it was 12 to 12 my problem is then all of a sudden we're talking to these people and everyone's bitching about is their phones and not being able to have them and like oh man this sucks or whatever and then the worst thing is you have a conversation you're like oh yeah let me show you this thing oh wait I can't show you this thing conversations now are about things that rely on this I did have a lot of conversations too about the fact that I would love to take a photo of this not even talk to anybody this is really pretty and there's a lot of cool Instagram when when's your when's your wedding day it's Tuesday November 8th uh we ask that everyone turn off their phones no there is a world that's going on 10 hours absolutely not I love you and I appreciate your hipster Pinterest wedding that you're having but no I'm going to I'm going to hang on to this phone I'm going to understand the principle behind this",
            "start": 5810.32
        },
        {
            "text": "absolutely not I love you and I appreciate your hipster Pinterest wedding that you're having but no I'm going to I'm going to hang on to this phone I'm going to understand the principle behind this which is can you please be present but don't you can't force that as like I want everyone to like each other and get along well for them to be fair for them uh the person that was getting married it was our friend Alexis and our friend Hunter and he's a San Francisco Giant so I think it had more to do with the fact that a lot of Giants players were there and they didn't want them to feel uncomfortable with random people taking pictures of them partying my wife is a wedding photographer she also does a lot of weddings and one of the weddings that they're going to do someone is in the military they're like you can't take pictures of our guests for a number of reasons like okay we completely understand that and then so it was yeah for them I think it was less about being",
            "start": 5846.0
        },
        {
            "text": "Is the military they're like you can't take pictures of our guests for a number of reasons like okay we completely understand that and then so it was yeah for them I think it was less about being president more about just them being able to control the airport in London he was awesome how do you mean everyone at the airport so Jeff Goldblum, The Osbourne Family, Colonel Power - who am I missing, pal? I don't know. Uh, he was super. I told him that was like you would have been the first President I was going to vote for. He said, \"I was never going to run.\" I was like, \"I would have voted for you.\" Um, he said, \"Well now you tell me true story.\" Colin hates Coen because he ruined his first name. He's the only guy running around calling himself ****. I know Collins - we all call him Colin C. He's going to be like, \"I'm Coen, pal.\" Then when he becomes Secretary of Defense or whatever and lies about Anthrax to the UN, everyone's like, \"Great now you're Colonel\" and I'm like, \"No, I'm Colin. I'm Colin, damn it. You still call me Colin.\"",
            "start": 5884.52
        },
        {
            "text": "pal then when like he becomes Secretary of Defense or whatever up there lying about Anthrax to the UN everyone's like great now you're Colin and I'm like no I'm Colin I'm Colin damn it you still you still own it I I can't wait for the all caps kind of funny Twitter of I'm calling I'm calling damn it I I will say this there there's a a friend of ours had a birthday and one of the ideas that they had to do for the birthday was to um write down a word that for you describe them could be just a word or most people do like group of words or phrases sentence I think that's what they call it um and it's I I love the thought behind it but it was it was really really strange because it was like there's you know 50 people there whatever mhm and so it's like okay what's your word tell me what you think about me um Travis was also there and he and I were talking about this and I was telling him was like I I feel like that's like a I don't want to make a ceremony of that I want to you either know",
            "start": 5921.12
        },
        {
            "text": "about me um Travis was also there and he and I were talking about this and I was telling him was like I I feel like that's like a I don't want to make a ceremony of that I want to you either know how I feel about you or I'm going to tell you one-on-one just just between you and I I'm going to tell you that it's weird however that's my awkwardness with it sure you know what I mean so other people could have been like I don't think I've ever told you this before and I don't know when I would an opportunity to tell you this again so now let me take this opportunity to tell you this so I I I think there's some situations where this has made us socially underdeveloped in our attempts to be socially connected we're actually way socially disconnected um but I do I agree I don't want to throw the baby out with the bathwater because I love watching the thing between you and Scullville going back and forth and learning learning about you as a person just like like that's a guy that has a good",
            "start": 5966.12
        },
        {
            "text": "Baby out with the bathwater because I love watching the thing between you and Scullville going back and forth, and learning about you as a person, just like that's a guy that has a good sense of humor about himself. I love watching what you're doing with your cooking; I love what you're doing with your podcast career - these are the things that are important, that they're really important. I do say that they're... I I can't, I know that I use it too much and I CH I do be cognizant of that right because it is that thing of literally waking up and the first thing I do is grab my phone and then use you know use the phone as you go to the bathroom and brush your teeth and then I'm walking out and checking my phone, and he's done and then I'm checking and it's like, for every great text message I have or email I do need to send there is a **** of just like man I got time to kill what's happening on Twitter from last night or I'll dig deeper into Facebook",
            "start": 6016.52
        },
        {
            "text": "there for every great text message I have or email I do need to send there is **** of just like man I got time to kill what's happening on text from last night or I'll dig deeper into Facebook and see what's going on right now it's like no no that I know I what I found lately is the Do Not Disturb mode being my best friend wiping that on closing it and put it in your pocket and then I'm not getting the vibrations because then it is the thing of like is this a **** text or an important text what am I getting is this something I need to interject and stop what I'm doing right now yeah that's something I did uh early on in my relationship with G where she not disturb uh never text it back did it end it's it's I I realized that uh it bothered her when my phone would be going off all the time and when I touched the phone all the time so it's just like all right cool easy fixes cool like I enjoy talking to her so it's not an issue um but uh in terms of even when it's not about my",
            "start": 6053.44
        },
        {
            "text": "the time and when I touched the phone all the time so it's just like alright cool easy fixes cool like I enjoy talking to her so it's not an issue um but uh in terms of even when it's not about my one-on-one time with her just seeing my phone vibrate like it's it's that that feeling on the so like whatever just turn off vibrations my phone's silent no vibrations having an Apple watch totally changes the game but before the Apple watch and there was a year of this where I didn't have it it's just like for me to get a notification I would have to go like that and yeah there's a whole bunch of them but uh it's that would that meant that I'm actively seeking out the thing you have to hit Refresh on the page to you're giving time to it it's sure things are there yeah instead of being like oh man like what was that what is that thing that just happened could be or it could be a death there's a huge sign of respect for just like when I I sat down I didn't realize that my phone was up as",
            "start": 6092.76
        },
        {
            "text": "like what was that what is that thing that just happened could be or it could be a death there's a huge sign of respect for just like when I I sat down I didn't realize that my phone was up as soon as I saw something come up don't even look at it and if I do that you're in I'm in and I I want you to know it's it's a sign of respect or even more just like this thing goes away and if you do that for your partner or for a friend you don't have to go you know what let me turn this off for you you do that one small gesture and at least for me I look at that and go he's really listening yeah and that's my thing like I I don't like put my phone like that because I totally agree with what you're saying just because like I don't putting my screen down on things I'm one of those guys if you if I see a disc that way on a on a table czy I'm defriending you um but for me when you have the watch it doesn't light up ever so like my phone will just be there will not light up and like",
            "start": 6134.36
        },
        {
            "text": "if I see a **** disc that way on a on a table czy I'm defriending you um but for me when you have the watch it doesn't light up ever so like my phone will just be there will not light up and like again the only person I really give a **** about in this scenario is my girlfriend and she knows so it's just like I don't give a **** if you see my phone lining up I don't care well I feel like you know I to the point to the answer the question I'm not going to Bel her the last time I I told the story was three days in Connecticut at a wedding no **** phone access at all I lost my mind for like 10 hours and then I thought it was like the most liberating thing ever it's the same it's the same thing when my phone I went to update my phone I haven't updated my iPhone like 18 months because whenever I tried to update it it just bricks so I haven't updated my phone when I did last time I just lost everything and I was I was sad for like a second and I'm like I don't really care",
            "start": 6174.84
        },
        {
            "text": "whenever I tried to update it it just bricks so I haven't updated my phone when I did last time I just lost everything and I was I was sad for like a second and I'm like I don't really care like I have like all I'm like I have all these pictures that I'm never going to look at again and all of these contacts of people I don't talk to you know then you slowly get like you know your 15 people that text you and you're like who is this and then you just add them back to the so I felt like a liberating kind of thing I am getting concerned that we are using these things too much and I've tried to like mine's not in my pocket or anywhere here and because and I'm not I'm not always good about it but I feel like um I don't I don't like talking to someone when they're on their phone and all that kind of stuff and I try to be cognizant of it that I I do it to other people sometimes and I try not to do that as well so um I think that uh you know like when I go walk Lola or I go do something I",
            "start": 6209.48
        },
        {
            "text": "Kind of stuff, and I try to be cognizant of it, that I do to other people sometimes, and I try not to do that as well. So um, I think that uh, you know, like when I go walk Lola or I go do something, I intentionally leave my phone behind, and I also turn off all notifications except for text messages and calls, like none. So yeah, like I don't need to know anything else that's going on. And uh, the one thing that I want to throw in there which is kind of a curveball is texting in particular - cell phones have always done this, but texting in particular, the rise of texting over the last almost 10 years, I guess, I mean people have been texting since the 90s, but you know when we really started text messaging, um, I feel like people text just to text sometimes. And I don't like the idea that when you call or text someone, that you owe them a response necessarily, like it's a complicated kind of thing because it's so easy. That I'm hearing from people that I'm like",
            "start": 6244.32
        },
        {
            "text": "like the idea that when you call or text someone, that you owe them a response necessarily, like, it's a complicated kind of thing because it's so easy. I'm hearing from people that I'm like, \"why are you even no offense, but why are you telling me this?\" or \"and then we have to have a conversation about this.\" So I'm trying to be also better about leaving people alone and sending some messages that, like, we don't need to have a conversation about X Y and Z every day just because you can reach out to me doesn't mean you have to. It's just as bad as someone calling you, leaving a message saying \"hey man call me back, you mother.\" I checked my voicemail for this, that's why Visual Voicemail is the best, like yeah cuz it's funny to hear Siri make of that um Gorilla Glue on The Ellen DeGeneres Show because it goes back to you know we were talking I mean it's not an original or new idea, I think this is in comedy sketches and whatnot but the idea that",
            "start": 6281.52
        },
        {
            "text": "that um Gorilla Tess on the blank line **** because it goes back to you know we were talk I mean it's not an original or new idea I think this is in comedy sketches and whatnot but the idea that like why are you calling me who calls people like I love calling people well we I have a few friends like youon is one of my friends like to the point get to the point that's why text is great here is exactly what I want to say here's the problem though you cannot discern tone or intt I will never in my entire life handle something that matters with you over text ever yeah if it's something to hear your tone now first off you are a **** hypocrite you get that response because if I don't respond I'm going to hear about it and you just said not every text needs a response but when I send the approval BL blah blah blah blah blah blah blah blah oh man what else is there to say what else is there to say you're you're a hypocrite you're forcing me into a conversation I don't want to be him",
            "start": 6320.88
        },
        {
            "text": "approval BL blah blah blah blah blah blah blah blah oh man what else is there to say what else is there to say you're you're a hypocrite you're forcing me into a conversation I don't want to be him you're a **** hypocrite it's different with us it's different or it should be but the uh yeah like I cuz I get number you know when you get calls from numbers every once in a while I get no I get a pit in my stomach when I'm like who is calling you whose number is this I get so excited I'm like who's this and I just when it's a real looking phone number it's not no 800 **** or like there's not like have you guys gotten calls where there's like 13 numbers on it and I'm like what the **** is this calls with just zeros yeah there's like some weird **** going you change the way that you answer do you like turn into like the series this is Tim Gettys no no I I was usually my name just y well when Stereolab call was our our Aaron M anniversary and we went to a really nice",
            "start": 6366.32
        },
        {
            "text": "answer do you like turn into like the series this is Tim Gettys no no I I was usually my name just y well when Stere Provisions call was our our Aaron M anniversary and we went to a really nice dinner at Stere Provisions and I got a number a call the day before from a number that I didn't recognize I was like oh God Almighty and I answered it and they and I realized that I was had this like perky like I don't talk like this because I'm answering the phone because I don't know who you are salutations how are you sir thank you so much we'll see you tomorrow and then I'm like H the phone went back to the bed or whatever it is yeah so this sucked during the the election times because I kept getting a bunch of phone calls from like local people trying to get me to support  **** so many and Jane Kim both of them oh yeah he's a good dude would call based on the giraffe on his poster and he looks like a nerd like it is a good a and he had Jal white in his video they kept calling from these",
            "start": 6403.88
        },
        {
            "text": "Kim both of them oh yeah he's a good dude would call based on the giraffe on his poster and he looks like a nerd like it is a good guy and he had Jailbreak in his video they kept calling from these 415 numbers I'm like work and it's just like a bunch of crap then I feel bad for hanging up but I'm like no I don't but I'm like you sound like a nice person why are you doing this job Tim Tam yeah how do you want to do this it's 512 do we try to do a 15-minute topic or do you want we can break up the first topic episode yeah it was a great episode second was long second though Kevin **** you Kevin the first one felt really long do more do do do Kevin do voice Kevin I have to say that if you are ever fortunate enough to visit the studios of Kinda Funny please go to the bathroom just just to wash your hands which you should do anyway to be sanitary whatever but you'll just get what a what a magical treat that was that was probably the moment of the day we had a really good Telltale show we've",
            "start": 6440.44
        },
        {
            "text": "your hands which you should do anyway to be sanitary whatever but you'll just get what a what a magical treat that was that was probably the moment of the day we had a really good Telltale show we've had a really good GameOverGreggy Show but when you were like youing about them so anyways what are we I mean just full unabashed laughter and my favorite part was the that the immediate connection Kevin and ever understand he's like he saw it didn't he I don't even tell you what it is I don't tell you what I mean people know a lot of people know a lot of people know not everyone knows maybe one day you if you don't know then you will know but what I'm really happy about is you're the first person to without prompting give it a good response because there's been some people that we've kind of been like but you should you should check out the bathroom yeah exactly then they go and like but like the most people just kind of go in and they'll come out be like oh that's funny I think I was mid",
            "start": 6485.96
        },
        {
            "text": "like but you should you should check out the bathroom yeah exactly then they go and like but like the most people just kind of go in and they'll come out be like oh that's funny I think I was mid think I was like we having a conversation and then just which is really weird that I was just like as I'm I'm going to keep going with this conversation I'm going guys mind if I leave the door open here just going to do some bu hey guys what do you think we should do about this um s like Putty from Seinfeld a little bit there David putty no that's the reference he's doing oh I I I didn't he's friends with him they're friends I think I knew thaton he's in Tales from Borderlands Patty is oh really he know I'm sorry like you're going to kill me I was like oh Jesus that's how I'm going to kill you if you didn't know ladies and gentlemen this has been the GameOverGreggy show each and every week four sometimes five best friends GA on this table each bring a random topic discussion for your",
            "start": 6523.44
        },
        {
            "text": "you if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends GA on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kindafunny where you can toss this a few bucks get every episode early along with a bunch of exclusive perks and goodies if you have no bucks to toss you can head over to youtube.com/KindaFunny get the entire show broken up topic by topic day by day till it goes up as one big video and P3 Troy Baker we love you so much love you guys too man everybody follow him on Twitter that was a big thing today during The Telltale Show he wanted to make sure that he had a Twitter Troy Baker voice actor is what it stands for I hate that now too you change it oh you have a check mark though you can't change it damn but you I mean come on you're Troy Baker you can make change the guy that has I just I highly just want Troy Baker but then there's this",
            "start": 6566.04
        },
        {
            "text": "it oh you have a check mark though you can't change it damn but you I mean come on you're Troy Baker you can make change the guy that has I just I highly just want Troy Baker but then there's this guy who like I ride motorcycles and take a picture of my cat every once a while you could do Troy Baker I could Isn't that cool Nick are you on your phone right now no he's ashamed that he's Nick Scarpino everywhere there's another Nick Scarpino a great guy way really weird but he has it on everything everything including Facebook like I'm not that Nick Scarpino I'm the other Nick Scarpino and it's like we want to hate him so much and then we knew who he was and now we know that we met him like more this guy's awesome and he's here no he's in Chicago originally working for Google and then yeah he went to Portillo and this is after he'd become a thing where like our audience knew him and he knew us and one day I woke up and there was a tweet from a fan who's like how do you feel about Nick",
            "start": 6604.88
        },
        {
            "text": "he went to Portillo's and this is after he'd become a thing where like our audience knew him and he knew us and one day I woke up and there was a tweet from a fan who's like how do you feel about Nick Scarpino working at Portillo's and I was like what yeah small world Troy it is until next time it's been our pleasure to serve you cool",
            "start": 6653.52
        }
    ]
}