{
    "id": 5587,
    "video_id": "6D6KpsxLKfg",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Blessing Adeoye Jr."
    ],
    "title": "Vote in the PS I Love You XOXO Awards Now - PS I Love You XOXO Update",
    "description": "Greg and Blessing need your input for a special episode!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nBlessing - http://www.twitter.com/BlessingJr\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Blessing Adeoye Jr., and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1608040804,
    "duration": 177,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to not an episode of ps i love you xoxo i'm one of your hosts greg miller alongside the game awards future faces of gaming or whatever it was the blessing addie oh yeah junior first of all it's the future class second of all this is an throw it all away we don't need it uh last week ladies and gentlemen on p.s i love you xoxo we said hey next week this episode will be our final episode of 2020. let's do the awards and we're like that's a great idea and then in the post show we came up with a bunch of different awards we're like yeah that's a great idea and then it kind of dawned on me that like that didn't really probably give you enough context for what the awards were and that we want you to go over there and give us your suggestions and your comments your concerns and all that jazz and make this into a bigger thing than just us horsing around with awards so what we thought we would do is delay recording of this episode till our final day of work friday",
            "start": 0.56
        },
        {
            "text": "and all that jazz and make this into a bigger thing than just us horsing around with awards so what we thought we would do is delay recording of this episode till our final day of work friday and what we'll do then is post it as our normal tuesday episode next week so no full episode of ps i love you xoxo this week just a call for you to be part of the final 2020 episode the psi love you xoxo awards next week i need you to go to kindafunny.com p.s awards and get in there this of course will link you to the patreon page where you can be part of the show you click on the piece i love you link and i've read i've gone through and redone the entire uh uh forum blessing you know wow i've gone in there and redone everything so you guys can go in there and tell us what the best playstation exclusive of 2020 was and why what the best playstation character was of 2020 and why what the best place playstation trophy list of 2020 was and why what the best playstation plus game of 2020 uh was and",
            "start": 40.16
        },
        {
            "text": "of 2020 was and why what the best playstation character was of 2020 and why what the best place playstation trophy list of 2020 was and why what the best playstation plus game of 2020 uh was and why and then also the most underrated game a playstation game of 2020 and why on top of all that i've added in a short answer field of what playstation 2020 award did we not list that you'd like to see blessing and greg argue about so you have homework to do ladies and gentlemen to get yourself one final episode of ps i love you xoxo the psi love you xoxo 2020 awards are you excited blessing oh i'm so excited what do you think's gonna win well now you know why i mean what best playstation exclusive is the last of us done personally get out of here bear it i don't know man personally five royals pretty upset oh here we go won the fan vote at game awards there's a lot of contention i'm aware i'm aware that it's not easy you know what i mean that's why you gotta go ladies and gentlemen",
            "start": 80.8
        },
        {
            "text": "royals pretty upset oh here we go won the fan vote at game awards there's a lot of contention i'm aware i'm aware that it's not easy you know what i mean that's why you gotta go ladies and gentlemen kindafunny.com p.s awards that'll take you to the patreon page you can vote there i'm linking to the bronze level so you can get in there and get it done all right everybody got it so again we're recording friday which means thursday night get all your uh your responses and all your votes in all your categories in then we'll record friday then it'll go up tuesday the only piece of kind of funny games content uh going live during our break all right is that all right with you blessing that's okay with me is it all right with you barrett only if persona 5 royale wins well you'll have to wait and see ladies and gentlemen we love and appreciate you until next time it's been a pleasure to serve you",
            "start": 126.48
        }
    ]
}