{
    "id": 5595,
    "video_id": "dTdFImdNnHY",
    "show_name": "Reactions",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Sephiroth In Smash Bros! Kinda Funny Live Reactions",
    "description": "Tim and Bless react to the Sakurai Sephiroth breakdown with all the Final Fantasy VII love!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nBlessing - http://www.twitter.com/BlessingJr\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Blessing Adeoye Jr., and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1608307507,
    "duration": 2390,
    "transcript_chunks": [
        {
            "text": "voodoo rearea ares b 9 b 9 eb 4 a face the voodoo way boo boo so 03 e is a man itv wide place bathing griar jarrar zone saucer voodoo ree aiyaa [music] therefore have a sore to do ben referee hour ws quickly 4 file 2 there was aria blue sky dua driver game muse yay summer usdm another b 3 clear jack ba baby aaaaaa [music] aaaaaaaaa r 2 he Ichiro al teyo ree a ami me too blue sky hare pivo when burning r bandar happening so that's how we introduced finn and gui final fantasy en 4 ff 7 anorexia jewelry master artist 4 yeah haa haa but there are no dedicated hair sets, that is to say hairstyles, right This is the one in the me fighter where you can just force it ap era  I would like to introduce Sephiroth. First of all, I think he is one of the most famous villains in games, except for King Bowser. He is a legendary soldier who appeared in FF 7. He boasts strength that exceeds 1000mm. In the end, he tries to use the ultimate destructive power to take the power of the stars for himself.",
            "start": 19.92
        },
        {
            "text": "Bowser. He is a legendary soldier who appeared in FF 7. He boasts strength that exceeds 1000mm. In the end, he tries to use the ultimate destructive power to take the power of the stars for himself. His distinctive features are Masamune's appearance. The number of employees who will play the Azara Falls is a stylish, away girl. It is a work that you can enjoy the layout of, and I am looking forward to the sequel. Booby is also faire. The legs are caries watch before and after, so I think it's fine if they are dry. Please note that Reiji is not crying. The in-game camera is special and is still in development. So let's get started. [Music] 3. Yes, this is Sephiroth, who is currently receiving the brand. His biggest feature is that he is a swordsmith. The prefecture is long, so the beach is very wide. And he is relatively tall and has a body. It is necessary to have a lot of free time, and for that cover, the lighter one is better for surgery. The color variations are  We have prepared",
            "start": 216.9
        },
        {
            "text": "very wide. And he is relatively tall and has a body. It is necessary to have a lot of free time, and for that cover, the lighter one is better for surgery. The color variations are  We have prepared a topless version and 7 p 8 p 9. Well, since it's Philos overall, no one has a dark image, but Yazaki the 7 p 8 p. Let's have a final battle, oh, Mummy Julep, yes, Menez flat, hey, the company name. Please note that the voice will only be implemented in Japanese. That's the monkey, and its biggest feature. When Sephiroth is in a pinch, he'll turn back. Like this, one wing is fast. Char. When one wing is in, there are various effects. First, the speed and attack power increase slightly. Then, even if you release the air, you can make one move. In other words, it's delicious to have a chair by the way, Big One. Midi in in place ber. And if you don't get a good color, you'll be able to see it. Ice and no forfeits are handy, you can learn it at Yodo Station Uchikawa. 4. Even if you say this,",
            "start": 300.93
        },
        {
            "text": "the way, Big One. Midi in in place ber. And if you don't get a good color, you'll be able to see it. Ice and no forfeits are handy, you can learn it at Yodo Station Uchikawa. 4. Even if you say this, you can use your finger to pie the venue electric before the game, the store you enter before the game, Goro-ga-saka, in August, this is here. rrr bordese. Good play 5 ice cooler. Uses the Voodoo 2 is a user wow. After all, the edge pattern stick is over 100% already rif shorts anh up mitre  Zun zun zun When the stock number is raw, it is aaaaaa OS, and there is a difference like this that a big type will appear at about 30%. Now, I will explain the normal technique and prepare the basic technique and I would like to match it with the game of muse machine and concentrate and talk about it. It is an exception, but bye-bye Lavie G up the general cod produces an OSGU ice cream with few cods. In this case, if you do a slash attack, the closest one will be the middle one, and when it becomes",
            "start": 362.07
        },
        {
            "text": "is an exception, but bye-bye Lavie G up the general cod produces an OSGU ice cream with few cods. In this case, if you do a slash attack, the closest one will be the middle one, and when it becomes the tip, it will be 9 do. Well, today is a good insect, but tei 2 re not to do with ta--- First of all, a weak attack is a dye that comes out compared to other fighters. Among Sephiroth's techniques, it is a particularly fast one, so let's use it when the opponent gets close. Next is a dash attack. It is a technique that attacks while stepping forward, and it has a considerable reach. Also, a footer is neatly made, so it is quite useful. I hope that you will win. Next is a strong horizontal attack. As you can see, the reach is quite long, so you can open up and down and lure.  If you have one, you won't even hit the double 90 on the opponent you've hit, so it's a good idea to aim for a large area. It's difficult to hit an attack today, but it has a long reach and the judgment is also good.",
            "start": 435.23
        },
        {
            "text": "you won't even hit the double 90 on the opponent you've hit, so it's a good idea to aim for a large area. It's difficult to hit an attack today, but it has a long reach and the judgment is also good. Depending on the hero you have, you may be able to swing through and attack with the Power Veil Real Venture. However, this is only if it's not offset. Yes, you can see the poor display bar. With a cooler that is in the area, it has enough power and blows away the ice castaway to the area. This is a gay man, but the timing is quite large. Even if it is shielded with a poke, it will be a counterattack, so please be careful. Next, the up smash act is taught to have a fairly wide range. It will hit opponents in front and behind on the ground. It's wide, but the target is still large, so be careful. The up smash attack can attack a fairly wide area with debris. It's also powerful. If you don't hit the ground, debris won't come out, but it is possible to prevent recovery.  It's been 14 years,",
            "start": 499.61
        },
        {
            "text": "The up smash attack can attack a fairly wide area with debris. It's also powerful. If you don't hit the ground, debris won't come out, but it is possible to prevent recovery.  It's been 14 years, but it's still good, but the shield destruction is in the middle, Khan, pd, normal Kudu is good, the moon is big, Seiko, I think it's one of the quicker techniques, and it's suitable for prefectural government. The next forward air attack has a fairly long reach, it's the main technique. fokids, Shiusagi Aso, there's a tour Mercy in that direction, but maybe, this is fluffy, the variety also changes love, pure pr, Ferrara, but the area is very thin, so as you can see, it doesn't hit with small jump attacks, Bubar is flat, oh, if you provide something, you can do here till irena version, ah, how to use this, 2 hers, it's a high per powder used for feints, 12100610 sheets, it has a wider range than an aerial attack, and it's also powerful, so instead of an aerial, you can turn around and use",
            "start": 570.02
        },
        {
            "text": "to use this, 2 hers, it's a high per powder used for feints, 12100610 sheets, it has a wider range than an aerial attack, and it's also powerful, so instead of an aerial, you can turn around and use the back mouth, it 's important to launch both the aerial trade and the back aerial attack just before the ground and hit them, otherwise they won't hit on the ground, Even if you burn your head with a saint, you can still barely get on the ground, but you have to take that into consideration because the forward air attack comes out faster than the backward air attack. Specifically, the air attack has an attack start of 13 frames, and the rear deep eats up, 1 hit, and it's coming, but I shouldn't say that. This game is a fun art game that I'm thinking of night game stitching, so I think it's okay for only people who participate in tournaments to say such small details. So it's fun to be attacked in the middle of the microphone. Voodoo Zel Hagiya It's similar to the up smash attack that I",
            "start": 637.5
        },
        {
            "text": "okay for only people who participate in tournaments to say such small details. So it's fun to be attacked in the middle of the microphone. Voodoo Zel Hagiya It's similar to the up smash attack that I mentioned earlier. Well, you can actually use it instead. The front attack range is 1 barrier bp 0 and breaks the meteor, so it can be used in various energetic ways, so try it out and make it ux. Next, who is Sanbu County cursor army nua express scent keep it home preview, so it's good for selling or attacking from above. The attack range is quite wide, so even if you crouch down and say it, it's Uzume, and thank you for your investment. B'z party in charge  It will be Gokuin Faiz, so I think it's possible to return from the drawing party. Voodoo Will the passengers destroy themselves? Route I want to use it, but it's better to use it after being paid for. Bar Next is the grab-up, but Piper who has a sword is definitely a throwing reel. Orenge Ah, Doily is a good app getter. Afa has a",
            "start": 696.3
        },
        {
            "text": "I want to use it, but it's better to use it after being paid for. Bar Next is the grab-up, but Piper who has a sword is definitely a throwing reel. Orenge Ah, Doily is a good app getter. Afa has a voice that has been sipped from fine wine. Ueno up, immediately Nemoto Tour. Barr 3 Number Pro Loker Rooster Getty Well, even though the power of the throw is low, it can be used in some kind of combination, or to break down the instruction, so I think it can be used in that way, so I'm considering various things. Render Another l Now, let's introduce the special moves. Well, Manshuku, normal, Hisowa. USA Dwarf, bad, well, that's all. If you hit it with Hard Sparking Flex Arm Abe, it will be a flare. The distance is relatively long and it will explode at the end. If you eat it a little, it will be a mega flare. The distance is shorter than that, but it has excellent power. l remenber 2 village Autumn vegetables or something like that, the crown of blue, roasted, falls off and suddenly wins.",
            "start": 756.76
        },
        {
            "text": "be a mega flare. The distance is shorter than that, but it has excellent power. l remenber 2 village Autumn vegetables or something like that, the crown of blue, roasted, falls off and suddenly wins. Even flares take a long time to fire, but their power is immense. You can stop eating midway with the shield button, but you can't hold the wall. Nishishinjo Giga Flare can't be used in the air. Abe: The time is too long. Giga Flare can also be used like this. [Music] benders Fa There is also this way of using it. 2 volumes, guard bems, catch, you get a version because you're 50 years old, but actually there is a little bit, which I'll explain later. Kyushu No. can do it, but it's good. It doesn't recover much, so it feels strong when it explodes. Fans can also do it. Reflection is a good idea, but it's a play that never reflects. Target damage is 0, so it could end up being too much. I think having three projectiles is a considerable strength, so I hope you can use them well. Next is the",
            "start": 822.87
        },
        {
            "text": "but it's a play that never reflects. Target damage is 0, so it could end up being too much. I think having three projectiles is a considerable strength, so I hope you can use them well. Next is the horizontal special move, Shadow Flare. It's already here, and it opens up the surrounding area, and after a while it guides and explodes. Depending on the degree of damage and how much it's stacked,  It circles around the opponent or increases the number of trues, up to a maximum of 5. It is also possible to make a seal. It is also possible to use it by waking up the seal. It can also change direction when the time comes. It may be possible to use it like this. This tea ceremony flare can be used against a third party who is thrown by someone in a big brawl. A pastry chef who does a Boober. By the way, it can also be shown off in your own car. There is no color or the same country. Synth Power Stone. It is a special move. Polestar nude aerobics. What do you mean? There is a mountain of red",
            "start": 903.64
        },
        {
            "text": "the way, it can also be shown off in your own car. There is no color or the same country. Synth Power Stone. It is a special move. Polestar nude aerobics. What do you mean? There is a mountain of red light called East 1 line. It is rare for this type of rushing technique. If you put out Gara opinion for 10 minutes with 5 losses and 0, you will be in trouble with the break technique. But it will not do anything if you leave it for a while, so it is a larva. There is a slight difference in the flight distance. This is one match. This is 8 throws and one match. Hattori line is better. I want to have a memorial service only for the Prime Minister dyeing rice. It is good to use such a scene. Of course, it is originally intended to be used for recovery. Iranian Essence Green can be caught, but in the 8-throw battle, it will jump out a little higher. There is also the point that it uses a straw to attack, but please be careful of this difference. The next special move is called the first",
            "start": 1009.83
        },
        {
            "text": "in the 8-throw battle, it will jump out a little higher. There is also the point that it uses a straw to attack, but please be careful of this difference. The next special move is called the first move. Honeycomb Shield Shine Flower Can't be done again. Character Lure Can be used like a counter. Unlike the mage type, whether it hits or not, the campaign type will be the opponent of Tiger. The selection is powered up depending on the strength of the attack received. As you can see, it is like this for attacks from behind. Unfortunately, it cannot reflect projectiles, but it can be prevented. Furthermore, it is rare for a counter type, it can be broken by possessed attacks. Maximum charge shots are also quite difficult, but damage can be prevented. People who like this should be careful of the new character cone pou dou dou to prevent recovery. Audi a sa pusai Supermarket-born sweet bar. A single sweat, no alcohol set, supernova Nezu, but a dynamic technique that explodes the work. Did",
            "start": 1089.18
        },
        {
            "text": "the new character cone pou dou dou to prevent recovery. Audi a sa pusai Supermarket-born sweet bar. A single sweat, no alcohol set, supernova Nezu, but a dynamic technique that explodes the work. Did you notice that each person has a different reaction here? [Music] Yua  I stopped it just before it happened because I don't think you'll notice. One person is blown away, one is a mushroom, and the other is a sieve break. It was like that in the original, but it has a certain degree of effect that appears randomly. It was a slow flower mushroom that comes out wobbly. There was a Brione profile column. If this happens, the tree from before will be sideways from the player, and with smashes and such, it will be difficult to get even with 0% accumulated damage. The flower will increase the damage. If you take it normally, it will become even bigger. It went in so much. This mushroom, ah, the record is strong. If it suddenly goes into the record, it will try to return and talk to the winged",
            "start": 1149.58
        },
        {
            "text": "If you take it normally, it will become even bigger. It went in so much. This mushroom, ah, the record is strong. If it suddenly goes into the record, it will try to return and talk to the winged ants. It 's a technique that can be used because it's a fan before. There are various improvisations required. I hope you enjoy it. By the way, I also made some changes to Cloud's booth color trump card. It is also the Super Ultimate God Slash Version 5. Final Fantasy 7 Advent Tube Who will improve? The technique to separate the combined sword is the roof tone faction. Jive. Educational power and other performance are exactly the same as the odd color. As you may know, Cloud's horde colorways come with sleeves and without sleeves. This is also something that fans of the original will find interesting. Next, I'd like to introduce the stages. I created a stage called the Great Northern Cave. I kept the shape of the stage simple, but the background is what's happening in the story. This actually",
            "start": 1223.79
        },
        {
            "text": "Next, I'd like to introduce the stages. I created a stage called the Great Northern Cave. I kept the shape of the stage simple, but the background is what's happening in the story. This actually includes the developments at the end of FF7, which can't be helped, so if you don't want to see this, you might want to turn back. Well, you don't have to, after all, it 's a game from over 20 years ago, and with that new remake, it's only natural that it will be like this, so I'd be happy if you could take a look. Then, Message Temple 1 a Great Northern Cave BD There's also a rabbit woman, and the final battle is leading the way in 7, so it 's the end point. The processed Great Northern Cave, made of resin, has a great fork and my connection is with the Highwind's second form, which is also flying. Sephiroth has arrived at Aso, the Liberal Democratic Party, Guardia, Australia, Menmeonmanman. In order to stop this, the party's objective is to defeat the regular Ross and release the white magic",
            "start": 1284.73
        },
        {
            "text": "Sephiroth has arrived at Aso, the Liberal Democratic Party, Guardia, Australia, Menmeonmanman. In order to stop this, the party's objective is to defeat the regular Ross and release the white magic Holy that Aerith never used. He continues to bark at Yasuhiro Hoshino. There were also steps like this in the original work, and he jumped up and down, but the Great Northern Cavern is said to be where Jenova fell 2000 years ago. It was then sealed away in the ancient spring and excavated by Shinji. Kaka Morifuji and the stage that was later named after the succession ceremony was affected by the fire, which is not good. Sony Sony R. I ate a whole body cheer poster 3. Good price. Right. Fare Party. Plan the water room. Run away. Then, the eyes of Tebes spread out before your eyes. A special dish comes out and turns to block the meteor. Highwind will change to its third form here. However, it is said that Holy was activated too late, but the right hand cannot be stopped. Then the life",
            "start": 1342.97
        },
        {
            "text": "dish comes out and turns to block the meteor. Highwind will change to its third form here. However, it is said that Holy was activated too late, but the right hand cannot be stopped. Then the life stream, which is the power of the stars, emerges and adds up. This kind of story may not have been seen before in the cruise stage. I hope you enjoy it. g 6 s #Audi baby bash Now, let's move on to the actual battle. This time 8 up brawl and step towards the door, needs a beautiful step, then I won't say it's not the 4th Gijun Fest, somehow pregnant's convenient Blue Do, you can enjoy the boss rush, lots of bosses from the past appear, well originally it seems to be a boss, it's too erotic game, I thought it might be a good fit, so I put it in, the strong character is strong in front, so you have to be careful, first is Rio race, Whew, but what a game, good filtering, this is, when will you receive, it 's Malleus, so you can fly or put it in right away, it's a good idea to leave with that",
            "start": 1412.55
        },
        {
            "text": "to be careful, first is Rio race, Whew, but what a game, good filtering, this is, when will you receive, it 's Malleus, so you can fly or put it in right away, it's a good idea to leave with that thought, I threw out a false tooth, Darles Cafe's, it's delicious, it's delicious, after this, outside the house, a little, Dairi 4 sr 5 big, rosenbaum esp work to do perl render, Cygodard wear, haha, let's stop Poodle, good, I 'll read and curl as much as possible to the app owner, Stewardess' tea leaves, me too, the snacks are okay, not so inferior, I got scolded Enter the mother and negotiate 4 Yes, dangerous, dangerous, the office of Tars has been caught SR Building place Pita's business white It is said to be round, but there was a boo boo, the age recommendation system is caught Fefe ... Pokerless fan take ifind sa well head sen game boober leather upper instep re re re re not to do us army reb walker 6 us arele walkman do esperde other [music] this is what ah yeah vivid 5 ever rupiah",
            "start": 1480.89
        },
        {
            "text": "fan take ifind sa well head sen game boober leather upper instep re re re re not to do us army reb walker 6 us arele walkman do esperde other [music] this is what ah yeah vivid 5 ever rupiah cold performance group n gamer cute zu art spoiler pde rosuudou sap attack patty is well a little bit of gacha good n first step first bus able to do right another one or lacus if you say this a there is a grab this one you check my is hiro brother rassesa this matter for murder the person benz general affairs rear ba g ladder inuneko there are a lot of bikers but if water that is cp campaign that is blue zu seaper ken pena is just quite a lot of base nox is there is a big house ne in the middle of it can be done ne this is also often a little pou dou dou 1  There is also a butter pub bathed in blue labyrinth Sagittarius Iku p Consumption soap manti orders to do you spell right bs Weber pop manager wow seriously 9.9 go this bar to the unwilling as limp 4 is aji show thank you wow and dancing",
            "start": 1673.45
        },
        {
            "text": "labyrinth Sagittarius Iku p Consumption soap manti orders to do you spell right bs Weber pop manager wow seriously 9.9 go this bar to the unwilling as limp 4 is aji show thank you wow and dancing cashier & it's a fight in the northern large cavity for some reason this is bad from the start follow yu raise filer wear meow that display live game good blue yabesou re you doing vinegar to put ingredients in is waa Nagae auro small and even very dangerous if you can just down here the booth is fielder kahn now 3 screens this is a brand that shakes like this tee bel amer ears book pern archaeology and byron fashion perdere join program space and per me knock airwave mall blue do field the rest is crazy but I don't think I'll do it for about 1 now when I tried to grab it 1 person deidara k pro game pad roche Fefe ... Fefe ... Fefefefefefefefefefefefe I hope you'll enjoy the boss rush mode. Here 's an introduction to Rona Meer en 25's Pink. Here's the list of songs. Nine new songs have been",
            "start": 1847.36
        },
        {
            "text": "game pad roche Fefe ... Fefe ... Fefefefefefefefefefefefe I hope you'll enjoy the boss rush mode. Here 's an introduction to Rona Meer en 25's Pink. Here's the list of songs. Nine new songs have been added, making it 91 songs in 1 round. The big mother of the song was Ale Rip to Do, and then I put it on the desk. I think some people might say that Mr. is stingy, but that's not true. I 'll say it out loud. For example, when a character appears in a game, or when they collaborate, there are more cases where there isn't even a single song. That's right. You have to get permission so that everything is OK in the world. Well, some can be obtained properly by one company, but some span multiple companies, and it's completely different depending on the country, so it's painful to resolve all the rights and implement it. Sakura is wow. The taste of the Airs muffler is a bit strange. It is scheduled to be distributed on December 23rd. This is the number of Christmas taxes, isn't it? If you",
            "start": 1947.48
        },
        {
            "text": "the rights and implement it. Sakura is wow. The taste of the Airs muffler is a bit strange. It is scheduled to be distributed on December 23rd. This is the number of Christmas taxes, isn't it? If you have a minimum guideline of 2, you can receive it as it is. This is the last one at the grave of by  Cab not saying, by the way, us esterase ning to do Shimaunzu, this is Roy's choice, and it's difficult to follow, but since he's Moss, he's strong as a boss, so I thought I'd like to do it with Prana, so I chose the limited-time appearance of Sephiroth as a government [music], which is pretty good, and if you can defeat this, you can go ahead and use Sephiroth and the north a lot. I'm planning to make easy normal to a reasonable extent, but very hard quite difficult. In fact, there is a rear release, but Philos pei Tsubettsu or venture Ferry, those who chose hard will have a lot of challenges, but I opened the chair type paper, I think I'll put it in later, but I canceled it. The",
            "start": 2030.25
        },
        {
            "text": "a rear release, but Philos pei Tsubettsu or venture Ferry, those who chose hard will have a lot of challenges, but I opened the chair type paper, I think I'll put it in later, but I canceled it. The distribution date of the Seculos Challenge is scheduled from the December version of the happy day to April Day, 23 people, 10:00. Hare, brother to Sephiroth Challenger here, it's heavy on the implementation, but Patty sap tourless, but this is Tigger Seb en 3 Percy pou dou dou I'm happy  r about 1000 sheets, 100 characters equator 5 in, and then saaaa. At the end of the battlefield Ogawa Kamiyo cleaning, you can now choose the correction method from the all-song lottery and my song selection. All stage songs are eligible for the all-song lottery and stage selection. If you switch the menu with my song selection, the selection will be selected from the spiral folding selection. Also, since I couldn't introduce it in the game, the share of the outside Sekuros is ramen. Somehow, I'll take",
            "start": 2117.68
        },
        {
            "text": "my song selection, the selection will be selected from the spiral folding selection. Also, since I couldn't introduce it in the game, the share of the outside Sekuros is ramen. Somehow, I'll take out the book and have a bill, 4 fried shrimp, and a bar. You can do it. Rextron Sign language is different. Dowsofit a f 7 us really had a hard time recording this time. I think it's important to be able to confirm it, and in that sense, the staff really did a great job. So, it's time to close. Thank you very much. Pay Star Leather Sefotax Stop nas Flasher listing us floss rme releases ks pou dou dou head wings Funny mode rdoc perfumen Dark Ba ​​Spray 0 4 Pro fax derp  Do render former redstone blue do 4 refeia roller all er 4 n zoom smashway arab ah ah ah ah bubar rear arlen to do game forester view power",
            "start": 2208.36
        }
    ]
}