{
    "id": 1624,
    "video_id": "MX97aycXvPQ",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Shuhei Yoshida on PlayStation VR, First Party Studios - PS I Love You XOXO Ep. 28",
    "description": "@Yosp himself swings by a JUMBO sized episode to talk VR. Meanwhile, Greg and Colin debate PS4.5 and berate fans and friends alike! (Released 03.22.16)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://youtu.be/ri5pTkp9Rls\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1458659801,
    "duration": 7567,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to PS I Love You XOXO, episode 28. I'm one of your hosts, Greg Miller, alongside the pride of Long Island, Colin Moriarty. It's good to be here with you today. It's good to be here with you today, Colin. How have you been? I'm fine, thank you. How are you? I'm excellent. Yeah, have you been playing video games a little bit? What have you been playing? A little more of The Division. What level are you now? 13 maybe 14. I... uh... I tell you what, I had a lovely time at GDC. Yeah, I had a lovely time at South by Southwest. I desperately missed The Division. I can't wait to get back to The Division. It's a good game; it's a very good game. Level 19 is where I left the main character. The secondary character is level 13, I think level 12 somewhere in there. I gotta get back and get to 30. I gotta get into this Dark Zone. I gotta help Fran. I can't leave him out there unprotected. No, you must... I've been doing that. I've been Tuesday we have a date to",
            "start": 0.5
        },
        {
            "text": "get to 30 I gotta get in this Dark Souls Zone I gotta help Fran I can't leave him out there you can't leave Fran out there unprotected no you must I've been doing that I've been Tuesday we have a date to get it all I guess today when you're watching this we have a date tonight to get it back on track cool that's fun and then I've been playing Salt and Sanctuary although I only played it for a couple hours I haven't had too much time to play uh Greg was here for like nine days so um I just haven't had too much time to play what are you were doing GDC stuff as well initial impressions of Sal uh I like it a lot I think that it's uh not a game for you but I think that knowing your gaming preferences but you should try and come to your own conclusions you keep saying it's 2D Dark Souls it is unabashedly dark souls like I I I when people said that I like okay so it takes some ques it's a very difficult game a grinding game it is dark souls like I don't think they're trying to hide it I think that",
            "start": 59.6
        },
        {
            "text": "dark souls like i i i when people said that i like okay so it takes some ques its a very difficult game a grueling game it is dark souls like i dont think theyre trying to hide it i think thats theyre trying to be obvious about it is it it homage yeah you can say that okay uh everything about it except perspective in the way Dark Souls though i you know in bloodborne it was always about watching your guy i felt like always think of it is you know im watching my boss my enemy and then im strafing in 360° to roll away from their attack to get behind him and attack them usually or something like that how does that work in 2D um so you could still roll and block and stuff like that and jump okay which you dont do in Dark Souls sure trying to get over them or dodge their attack and then run up on them yeah uh i havent fought too many difficult enemies that require too much maneuvering yet uh but the boss i fought was pretty hard it took me like six or seven tries to beat the boss",
            "start": 98.56
        },
        {
            "text": "run up on them yeah uh I haven't fought too many difficult enemies that require too much maneuvering yet uh but the boss I fought was pretty hard it took me like six or seven tries to beat the boss although you know I get a little impatient when I play 2D Souls games like I like try to brute force my way through things uh the way I play Mega Man so until you get really good at it but you have to you have to really be smart playing this game but but everything about it is Dark Souls-like that there's a you pick your um your character class you customize that character um you can leave notes in the wild for other people to read um a lot of the on-screen imagery is the same I think it says vanquished or something similar to what it says in Bloodborne or Dark Souls when you kill an enemy or when you're you know um skill tree and kind of equipping and unequipping things uh very RPG-like not not you know unique to Dark Souls um in that respect uh the obtuseness of it is",
            "start": 136.92
        },
        {
            "text": "kill an enemy or when you're you know um skill tree and kind of equipping and unequipping things uh very RPG like not not you know unique to Dark Souls um in that respect uh the obtuseness of it is really what reminds me of Dark Souls too as well just in the sense of um the story it's like very vague it's very weird it's a very weird game which I don't think anyone would deny Dark Souls and Demon's Souls and Bloodborne are weird I think Bloodborne's like the least weird of all them that I've played I played Demon's Souls and Dark Souls um so it's cool I like it uh I want to continue to play it I assume it's going to get very hard I don't like games that are too deep people a lot of people are talking about the skill being ridiculous and it is like the skill tree is so does that a turn off absurd I like a deep skill tree but I don't like when an up two game has a deep skill tree cuz I don't really know what the **** I'm supposed to do where you're supposed to be putting these points and",
            "start": 173.64
        },
        {
            "text": "I like a deep skill tree, but I don't like when an open-world game has a deep skill tree because I don't really know what the **** I'm supposed to do where you're supposed to be putting these points and stuff. So, I have a lot to figure out. I've played the game for literally two hours, so it's not like take what I say with a grain of salt, but I'd take a grain of salt in Salt and Sanctuary. Uh, go try it out if you'd like; see if that 2D hardcore grueling game is for you. You collect salt instead of souls to upgrade your character, you lose your salt if you die, and then you have to go back to the enemy that killed you to get it back and stuff like that. So, I mean, it is dark; it's not trying to hide it, and I respect that. Why go halfway if you can go all the way? Now at GDC we played a lot of great games; we had them people come through, loved the arena Gods, loved the dodgeball game, but then I went to South by Southwest, they had a gaming show floor, I ran around their con, and I finally got to play a game I've",
            "start": 212.84
        },
        {
            "text": "them people come through loved the Arena Gods loved the dodgeball game but then I went to South by Southwest they had a gaming show floor I ran around their con and I finally got to play a game I've been talking about a lot or at least tweeting about a lot this Valhalla you seen this one the VA-11 HALL-A it's this game it's the Cyberpunk uh bartending game where you go through and make drinks for stuff and the story is playing out is like you you're just a bartender right so the the gameplay is I'm just I'm it's just a cook I'm just the chef I can't do it well you if Nick was here he'd do it for us but this one you go through in the Cyber you know Punk World cyber steampunk world or whatever go through make these drinks for people get their stories and stuff I only played like 30 minutes of it I'm like Yep this is what I wanted it to be it's goofy it's got a sense of humor coming to VA-11 HALL-A so there you go that's all I want out of it that's huge but you",
            "start": 255.44
        },
        {
            "text": "I only played like 30 minutes of it. I'm like, \"Yep, this is what I wanted it to be.\" It's goofy; it's got a sense of humor coming to Vita. So there you go, that's all I want out of it - that's huge. But you sit there, you look at the recipe book, you add them up, you put them in, you mix. If you if you mix them too long, they blend; then you **** it all up. If a guy comes up and he's acting like he's a big guy, you need to double the drinks and stuff. It's very interesting; I'm very fascinated. Sound yeah, ladies and gentlemen, this is PS I Love You XOXO, this is Kinda Funny.com - you don't know, you almost said PlayStation podcast. I did. Yeah, it's been a long time since I've been on this show. It is the number one PlayStation podcast on the internet, and you picked a hell of an episode to come join us out with uh Shuhei Yoshida coming by. Yep, you did an interview with him at GDC; it was top secret - it wasn't on the live streams; nobody saw this one. I haven't even seen it yet. How's it go? Does it go? She was good; she talked a lot about VR uh.",
            "start": 294.52
        },
        {
            "text": "by yes you did an interview with him at GDC, top secret, it wasn't on the live streams, nobody saw this one, y I haven't even seen it yet, how's it go, does it go, she was good, talked a lot about VR, uh tell you got a lot of VR questions and uh we're going to talk a lot about VR too as well as uh talked about the first parties and what everyone's doing and and all this so um I think people will find it quite informative as usual cool yeah you got that, you got a whole bunch of our reactions to this VR stuff, you got all these reactions to everything with this 4.5 stuff, there's a lot of stuff going on in this show remember PS I Love You XOXO posts every Tuesday at 9:00 a.m. Pacific time so please like subscribe share youtube.com/kindafunnygames and of course if audio MP3s are your thing and let me tell you looking at the numbers there's a lot of you that are and I thank you for that make sure you head over to SoundCloud, you head over to iTunes, you subscribe to the feeds there, share them with",
            "start": 334.68
        },
        {
            "text": "tell you looking at the numbers there's a lot of you that are and I thank you for that make sure you head over to SoundCloud you head over to iTunes you subscribe to the feeds there share them with your friends do all that stuff and hey a special thanks all of you I won that South by Southwest gaming award at the South by Southwest show all because of your support thank you all so much for going to vote for me you are all fantastic people and if you get us to $30,000 on a month on uh Patreon for Kinda Funny Games we will smash the award that's not a real Milestone at all I would've said it higher than that 50,000 an' Joy at 50,000 we do the Viking funeral for it oh okay we push it off into the bay and you get to fire flaming arrows at it the Game Awards the Game Awards that camey damn cool it is a really good one heavy as a **** it is man you can kill someone with that yeah I probably will kill Greg with it by the end of this someone's going to die with it",
            "start": 378.36
        },
        {
            "text": "award that camey damn cool it is a really good one heavy as a **** it is man you can kill someone with that yeah I probably will kill Kevin with it by the end of this someone's going to die with it Colin let's begin the show with what is and forever will be Roper's report time for some singular possessive news there are nine items on the list although Baker's Dozen although on kindafunny.com psq cxxs says Hey guys question for Colin when compiling Roper report I wonder if you ever intentionally avoid totaling the list to up to 13 exactly I can only imagine the reaction you would receive from Greg if you were to deliver him an actual Baker's Dozen thanks Christopher uh yes I do intentionally avoid it because you remember on the old show podcast Beyond! when you did 13 I wouldn't say Baker's Dozen I've edited the list twice to avoid 13 so far on PS you want to make out I like you no I like you no I like you Colin all right so with this with this list I with this list I struggled on",
            "start": 417.44
        },
        {
            "text": "doesn't that I've edited the list twice to avoid XIII so far on PS You want to make out I like you, no I like you, no I like you Colin all right, so with this with this list I with this list I struggled on which on which to put first because there are really three pieces of big news but I think I have them in the right order here uh no put your hand down because otherwise it loses the whole you know nope the special something that happens when you stop you're being weird I don't like it Welcome to PS so let's start with PlayStation VR okay number one the pricing of PlayStation VR has been revealed along with its release month final specs in everything that comes along with it for starters psvr launches in October of 2016 and will cost $399.99 in the US, in the UK it will cost £349 and in mainland Europe it will cost €399 Euro in Japan PSVR will cost ¥44,980 in the Box you will get the VR headset a processor unit the headset connection cable an HDMI cable a USB cable stereo headphones an AC power cord",
            "start": 460.96
        },
        {
            "text": "cost €399 Euro in Japan. The PlayStation VR will cost ¥44,980 in the box. You will get the VR headset, a processor unit, the headset connection cable, an HDMI cable, a USB cable, stereo headphones, an AC power cord, and an AC adapter. The PlayStation VR doesn't come with a PlayStation camera, which is required, nor does it come with the PlayStation Move controllers, which are optional. Its external dimensions for the headset are 187 x 185 x 277 mm (counted width by height by length). The processor's dimensions, counted the same, are 143 mm by 36 mm by 143 mm. The headset weighs 610 G, and the processor unit weighs 365 G. Its display method is OLED, and the panel size is 5.7 in. The panel resolution is 1920 x RGB x one uh by 1080 or 960x RGB by 1080 per I. Its refresh rate is 90 to 120 Hz, its field of view is approximately 100°, it has six AI motion sensing systems built-in, three AI gyroscope and three AI accelerometers. You can connect an HDMI cord auxiliary cable and headphones into the headset; HDMI to TV, HDMI to PS4, a USB cable, and an",
            "start": 513.76
        },
        {
            "text": "AIS motion sensing systems built in three accelerometers and three gyroscopes. You can connect an HDMI cord, auxiliary cable, and headphones into the headset. An HDMI to TV, HDMI to PS4, a USB cable, and an auxiliary cable will be connected from the processor unit to the PS to the TV and PS4. 230 developers are supporting PSVR according to Sony with 160 different projects currently in development for the headset. So that's basically the high-end finality of PSVR as we know it right now. What do you think pricing is great? Uh, what about the hidden costs Colin? The camera, the wands! OMG, so the camera thing is unfortunate and I I think it was actually... I don't want to spoil too much of what Shuhei says here about why the camera is not bundled in but I think he has something interesting to say about it that was not what I expected him to say about it. So you'll see what he says about it later on. Is it my hardcore prediction for what I was saying earlier at the show? What that like a hardcore",
            "start": 563.4
        },
        {
            "text": "not what I expected him to say about it so I think you'll see what he says about it later on is it my hardcore prediction for what I was saying earlier at the show, what that like a hardcore PlayStation user already has the PS4 and somebody who some I don't know I don't want I don't know I don't know um but he also was clear well you'll see I don't want to spoil too much uh so I think the pricing is right the timing is disappointing because I want it now but I think October's fine and gives developers time to finish their games we're hopefully going to get games like RIGS at launch uh EVE Valkyrie ready to launch all this kind of stuff so some good triple A games uh can I ask you a question before you go further yeah and I love you and I love what we do here in all of our lives together is the show interview packed with enough information that you'd want to talk about it so we should insert tots, tots, tots right here we could cuz I don't want I want pulling punches it's mostly",
            "start": 610.04
        },
        {
            "text": "Is the show interview packed with enough information that you'd want to talk about it so we should insert Tots right here? We could cuz I don't want I want pulling punches. It's mostly about VR if we can get some VR info right from the horse's mouth, the horse being Shuhei Yoshida, the kelp is the information on PlayStation VR. I feel like that should be on the table. Sure, we can. I mean, we've never done this early, but we can do that. Ladies and gentlemen, today for the topic of the show, Tots... Dots... oh you're slowing the pace down, I like that you're enjoying it, you're letting it linger let it linger a little bit like that song. You have to let it go. Most of the Cranberries' songs were sad, weren't they? They were really pretty sad songs. Zie great band, pretty sad song. Yeah, I'm a Cranberries fan for sure. Ladies and gentlemen, for the topic of the show, we went and talked to Shuhei Yoshida, and when I say we, I meant Colin, and he did it at GDC after the announcement of",
            "start": 644.8
        },
        {
            "text": "pretty sad song yeah I'm Cranberries for sure ladies and gentlemen, the topic of the show we went and talked to Shuhei Yoshida and when I say we, I meant Colin and he did it at GDC after the announcement of PlayStation VR so before we talk any more about this VR business why not kick it over to the president of Sony Worldwide Studios, SIE's greetings and salutations welcome to PS I Love You XOXO recording live from GDC live for us not for you I'm Colin Moriarty this is Greg Miller this is Shuhei Yoshida let's give a round of applause yay Oh yay this this is my first appearance on PS I Love You I feel like it's a good one to be on this is a good girl, Maiden voice no no no no I was on the second episode well he said my first one on this show making it about himself yeah we come to P.S. I Love You thank you Shu uh Shu how's it going good yeah yeah how is uh GDC well are you excited or both mhm yeah I let's let's get right into well I'm going to say my traditional first question for later which is about Sony Ben but right",
            "start": 694.0
        },
        {
            "text": "going good yeah yeah how is uh GDC well arey or excited or both mhm yeah I let's let's get right into well I'm going to say my traditional first question for later which is about Sony Ben but right now uh we'll uh talk a little bit about VR because obviously psvr is the big thing at this show price point $399.99 in the US uh October 2016 release date 50 games or so by the end of the year so between October and December uh all sounds good to me so you've been getting a pretty positive response from people yeah yeah yeah well beyond positive so because we are so close to what we are doing and uh I was hoping that people will be very happy but uh when we announced the price and people were super yeah and I was saying earlier people in the room were like clapping and standing up so yeah it's good yeah it's huge I I uh we were having a crisis of confidence on PS I Love the last few weeks because when Oculus price point was announced at 600 and then Vive was at 800 we were",
            "start": 742.36
        },
        {
            "text": "yeah it's huge I I uh we were Greg and I were having a crisis of confidence on PS I Love You XOXO the last few weeks because when Oculus price point was announced at 600 and then Vive was at 800 we were like maybe we just don't know what we're talking about like maybe psvr is going to be $1,000 or $700 like who knows but it's the $399 price point seems quite affordable and quite reasonable and I was surprised to learn that you guys are selling it at a profit too like you're actually making money that's unbelievable so like how did you like did you identify this price point a long time ago or did you kind of have to nip and tuck a little bit to figure it out yeah so the uh we had in our mind the target is like you know Andrew saying that we always wanted to this to be for us to be able to sell around the console price so specifically $399 was the Target price but we didn't put the Target price before what we are you know making what we have to accomplish we really really",
            "start": 795.6
        },
        {
            "text": "be able to sell around the console price, so specifically $3.99 was the Target price, but we didn't put the Target price before what we are you know making what we have to accomplish; we really really really believed and I believe that's the same for other companies like Oculus and in Valve guys, that the VR is so new and so important uh we have to uh do it right for the first time when we bring our first consumer uh product, it has to be really really good in terms of quality so that people have a great experience and become fans of VR in general; so uh we waited until we are able to we have a list of technical Milestones that we wanted to hit, and that's pretty common in this industry; we share kind of you know understanding and research results, and so we have to wait uh till now to launch our first product because now this year we can use 120 Hz displays",
            "start": 839.64
        },
        {
            "text": "Of course, understanding and research results and so we have to wait until now to launch our first product because now this year we can use 120 Hz OLED that doesn't exist anywhere right? So we are making a custom-made cutting-edge tech display for PS3. That's beautiful and that's super fast and it creates super low latency because we believe that's necessary to provide the great VR experience for consumers. And also, you know from especially worldwide studio standpoint, we work with the hardware guys very closely like a team to develop new systems, and we always discuss what features have to be in the system. And one of the things, some of our teams like Japan Studio or London Studios are strongly suggested to the hardware guys that we want to make VR something that people, you know, families or friends can enjoy together in the same room, same living room. And specifically, Japan Studio proposed this idea of if PS4 can render two different",
            "start": 902.32
        },
        {
            "text": "something that people you know families or friends can enjoy together in the same room same living room and uh you know specifically Japan Studio proposed this idea of if PS4 can render two different images at the same time one for person wearing the headset and another for TV so that other people can play games together with the person with you know wearing headset so we call it social screen and separate mode and uh in order for us to do that we needed to put you know resources processing resources on the PU unit that we are calling processor unit that splits the uh signal uh video signal from PS4 to TV and headsets and we can have two completely different images at the same time so that the uh we can do something like Playroom VR and that adds up the cost to the system but we believe that's super important for VR to take off you know for VR to be welcomed by people not just by core Gamers but for the whole family of the core Gamers so that was the first thing we wanted to",
            "start": 966.76
        },
        {
            "text": "that's super important for VR to take off, you know, for VR to be welcomed by people not just by core gamers but for the whole family of core gamers. So that was the first thing we wanted to accomplish. And then we looked at the cost and we relied on our capable hardware team - they've been making hardware for a long time, and we have resources to work with Sony to create the system and source high-tech components for us to be able to sell at the reasonable target price that we had in mind. So we didn't want to lose money selling hardware because we are a commercial company. But more importantly, if we're losing money selling hardware, we cannot spend money to support software development communities or provide assistance or trials to consumers or do promotions. So we don't have to make a lot of money from selling hardware but we don't want to put",
            "start": 1032.28
        },
        {
            "text": "Community or provide you know assistance or trials to consumers or you know do promotions uh so uh we you know we don't have to make a lot money from selling hardware but we don't want to you know put ourselves in the position to lose money by selling hardware so that that will limit our other activities so uh I'm very relieved that we are able to accomplish all of these and hopefully hopefully that will help uh accelerate the adoption of this new exciting medium mhm have you been seeing I mean I've heard rumors that the pre-orders are already like doing very well are you seeing like positive feedback about you know for pre-orders and from the market itself uh are you are you optimistic that this thing's going to sell meet whatever your internal targets are for the year well we had an internal target that we realized was a bit too small um too small uh that was the reason we pushed back the launch from the uh first half that we are kind of thinking around you know June time\n\nI corrected spelling errors and phonetic mistakes, capitalized proper nouns (hardware), and left the original meaning intact. I also preserved filler text and incomplete sentences as they were in the original chunk.",
            "start": 1099.28
        },
        {
            "text": "internal Target that we realized was a bit too small, um, too small, uh, that was the reason we pushed back the launch from the uh first half that we are kind of thinking around you know June time frame like uh you know E3 time frame before but and the hardware development has been done you know it's it's on schedule and U we we are great but but uh in order for us so more and more uh we get feedback from consumers and you know retailers and such uh our business side realized we need more unit than we had you know originally anticipated to be to prepare for the launch so the only thing we can do is to delay the launch so that we can manufacture more for the day one it's a great sign yeah definitely so that's the reason that's the biggest reason for the October launch as opposed to first half but we at the same time we knew we know that delaying it will give you know time for all the software developers including ourselves to keep polishing the games because VR is a very difficult in",
            "start": 1149.08
        },
        {
            "text": "half but we at the same time we knew we know that delaying it will give you no time for all the software developers including ourselves to keep polishing the games because VR is a very difficult hard there are lots of Hard problems we have to solve so that you know most people will have a great experience you know when they try PSVR for the first time so the uh giving teams in all teams uh more time will ensure or will help them uh improve the initial uh experience of the consumers when they buy PS VR on their games uh so these are the two major reasons that we push back the launch time frame has it been hard to explain to people that don't have it on them how awesome it is absolutely yeah including ourselves you know we there's all you know for each one uh who you know who are excited about VR has had one moment or one demo that uh made us convert from like a Skeptics to this passionate believer and that could be different",
            "start": 1210.12
        },
        {
            "text": "you know who are excited about VR has had one moment or one demo that uh you know we went through that made us convert from like a Skeptics to this passionate believer MH and that could be different per person and uh so the when you try the good VR experience that's something Beyond what you expect before you know you tried it so the trial is super important it's always a number one uh important method to communicate this uh experience to Consumers so do you think that uh you know come when October's coming up do you think you'll like have stores like GameStop and Best Buy will there be demo units that people can try and you think that'll be really important uh well in general you know trials are so important and uh you know with the uh delay of psvr launch we will continue to bring PlayStation VR to many you know events or you know we might create some truck crew of kiosks to drive around Nation or you know different countries or we might set up some",
            "start": 1275.16
        },
        {
            "text": "continue to bring PSVR to many you know events or you know we might you know create some truck crew of kiosks to drive around Nation or you know different countries or we might set up you know some special uh promotional event so that people can you know try out and also uh we I I'm sure each countes you know our business group uh will talk to liters you know especially those retailers who have the larger space and can set up a proper space for to demo Hands-On demo of PSVR and uh and that's important have an attendant to be able to educate you know person who just come to the shop to be able to properly set up uh so so that all of that you know we would do what do you make of the criticism I I personally don't agree with it but it is common criticism that the VR unit doesn't come with a camera or move controllers which I think is not really even that relevant but specifically the camera do you what do you make of that because that seems to me to be the most common naysay about",
            "start": 1336.52
        },
        {
            "text": "a camera, um Andor move controllers, which I think is not really even that relevant, but specifically the camera. Do you what do you make of that? Because that seems to me to be the most common naysay as were yeah PSVR is not $400 it's $460 yeah I saw this comment yeah but but you know pretty early in the process we decided to not bundle camera because we know that many people already own the camera, especially people who purchase PS4 in the first year and uh for those people if we bundle as a standard camera another one you know they will be mad you know because they cannot do anything with it you know because PS4 can accept only one camera right maybe they sell at eBay or you know whatever but uh so and same thing with Move, your camera is required but because we know that you know many people already own it you know so we do not put in the basic uh Unit B basic uh uh product but uh in each region you know uh uh typically our um uh companies come up with uh uh different kinds of",
            "start": 1392.68
        },
        {
            "text": "many people are already on it, you know, so we do not put in the basic Unit B, basic product but uh in each region, you know uh typically our um companies come up with uh different kinds of bundle packages so um you will see uh it the approach would be different, you know, region by region uh one country might have uh bundle just with camera or you know other might have you know camera and PS Move or uh like that so that's always uh part of the thinking but this week's announcement for us is to announce the base unit uh that's consistent globally and for people you know we know that early adopters of PS4 many of them already on cameras, we don't want them to spend more money than necessary yeah it's interesting I actually had even thought about from that perspective especially because you had a camera shortage um my last question about VR before we move on to software is which is your specialty uh is how did you become you know you've been",
            "start": 1445.76
        },
        {
            "text": "Perspective, especially because you had a camera shortage. Um, my last question about VR before we move on to software is which is your specialty. Uh, is how did you become, you know, you've been an evangelist about this since the days of Morpheus? You've been into this and obviously, you know, being an executive at Sony, you've been privy to this long before we have. But you're in charge of the first-party software studios like you have nothing to do with hardware, like in terms of, you know, you certainly have input and knowledge and all that kind of stuff, but that's not what you do on your day-to-day business. So how did they... how did you find your way like as the primary hardware evangelist for PSVR? Like it seems like you're the lead on this from a Sony perspective, but it's not necessarily within your purview. I'm the weed... whatever it means. Lea, I thought you said weed. No, you're not the weed.",
            "start": 1506.96
        },
        {
            "text": "You're the lead on this, from a Sony perspective, but it's not necessarily within your purview. I'm the weed... whatever it means. Lea Le Oh, I thought you said weed. No, you're not the weed. The not the weed. I don't think you're the we... um. He's nothing. Well actually, my base is in Tokyo, you know that? Yeah, so I moved to Tokyo from uh, uh, Shuhei's office to uh, Tokyo office in 2008 when I became the uh president of our Studios, you know, Kar... you know, asked me to move so that we could work very closely with the hardware group uh at that time. Uh, we were the hardware teams were starting to design PS VR and started to discuss you know PS4. So uh, and the cars asked let's change the way you know uh, uh, PlayStation used to make Hardware uh, that was um pretty much purely Hardware team driven you know with the genius of Ken Kutaragi to more collaborative effort between the Studios game creators and the hardware you know engineering team in Tokyo and that's how we designed and and we brought in Mark Cerny",
            "start": 1547.92
        },
        {
            "text": "genius of Kojima to more collaborative effort between the World Studios game creators and the hardware you know engineering team in Tokyo and that's how we designed and and we brought in Mark with his genius um to design PS Vita and PS4 and we are so happy with the result because lots of ideas um Hardware you know team can come up our game teams can evaluate and test and yeah this is great or this is you know we cannot use it and Hardware guys really enjoy these conversations because uh in the end they do not just want to create great Hardware they want Hardware that great games can be made and delivered to Consumers so they love this you know very tight communication that we have uh between World Studio teams and uh Hardware team so by because I understand and speak Japanese natively um me being in Tokyo actually I can attend any meetings Hardware meetings in Tokyo and uh help uh um Hardware team and a specific uh game team to communicate to attack some specific uh hardware issues that",
            "start": 1612.6
        },
        {
            "text": "being in Tokyo actually, I can attend any meetings Hardware meetings in Tokyo and uh help uh um hardware team and a specific uh game team to communicate to attack some specific uh hardware issues that they are you know looking at so I've been doing it for a long time so I spend uh quite good amount of time my time to work with the hardware guys uh even though my primary responsibility is to to manage the you know game studios that you know uh so um that's how I've been deeply involved uh in the development of PSVR you know from the very beginning I was one of the you know cheerleaders uh within the company uh to do we are is great we should do this uh kind of cheerleading uh we I've been doing so because uh I've been in in the you doing some you know PR work for PS4 as well so naturally I've been um uh talking on behalf of the company of how PSVR out uh would be great um let's talk about games how's uh how are the studios doing how is everyone doing oh I I know they are working",
            "start": 1674.6
        },
        {
            "text": "I've been talking on behalf of the company about how PSVR would be great. Let's talk about games, how are the studios doing? How is everyone doing? Oh, I know they're working very hard, yeah. And I think Uncharted 4 is coming out, oh, very excited. I assume you've played it. Well, I try not to play it just like yourself, yeah. I tend to play games before uh it's complete and like uh you know so I play games in you know early stage, you know uh Alpha stage beta stage. So when games come out, I might not touch it, you know because I played it and uh that doesn't help me enjoy the best out of our games. Um but that's part of my job, right? You know I have to play myself and give feedback to the teams because teams can be too close to games when they're in development. So me like coming in and try you know um could give them some you know fresh perspective so however you know I know Naughty Dog will make an amazing game so they don't need any help, so I just",
            "start": 1738.84
        },
        {
            "text": "so I like coming in and try you know um Can could give them some you know fresh perspective so however you know I know n dog will make amazing game so they don't need any help so I just like I I wait you know until it's finished but somehow I got hold of the C you know almost final and I played the first hour or so and I decided to stop yeah because uh it was great but uh I really want to play this game like you know other consumers so I I'm trying to forget what I saw uh How is Sony Shuhei Yoshida doing how's their game shaping up well yeah well some of them are here because it's GDC right so I was talking with uh well they are doing well they are doing well yeah they're making a game you love this you love the team and I I'm increasingly happy about what they are doing awesome um do you I don't want to dominate the conv no it's fine you can dominate all I have one question one very obvious question for people that know me Crash Bandicoot will we ever see Crash Bandicoot again",
            "start": 1803.2
        },
        {
            "text": "do you I don't want to dominate the convo no it's fine you can dominate all I have one question one very obvious question for people that know me Crash Bandicoot will we ever see Crash Bandicoot again and if you see so um one of the so I I took like 20 or so you know maybe more interviews this week after the announcement psvr and uh most of the people asked the question about psvr but one journalist asked so you know here and there you know people are asking some you know classic uh game of uh on PlayStation might come back and I said that the the I have an advice to people that you know you should not try to read too much from uh you know corporate executive uh by uh what they are wearing on t-shirts yeah so as a reference to the Crash Bandicoot t-shirt which was maybe not the smartest maybe not the smartest idea especially if it's Shuhei Yoshida probably you know he would wear anything you know he likes to wear the day of the presentation probably you know I can see how people drew that",
            "start": 1867.6
        },
        {
            "text": "not the smartest idea especially if it's Shuhei Yoshida probably you know Shuhei would wear anything you know he likes to wear the day of the presentation probably you know I can see how people drew that conclusion but but uh he can do what he wants yeah yeah know definitely t-shirt or not hope is out there oh by the so by the way um and I used to work together as a localization producer for Sony Computer Entertainment back in the days so Shuhei was in the in Europe in London and uh localizing games from us and Japan for the European market and I was in Japan localized games Sony games you know from us to Japan so we used to meet as a group of global like a production team uh in Sony office all the time so he has some special attachment to of course no that makes sense um all right so so Ben's doing their thing Sucker Punch coming along uh you had said at E3 you played some prototype um did I say that you did you said you played something yeah yeah I said I said played something yeah yeah you all",
            "start": 1926.72
        },
        {
            "text": "Shuhei Yoshida on PlayStation VR, First Party Studios - PS I Love You XOXO Ep. 28\nGreg Miller and Colin Moriarty discuss Sucker Punch coming along, mentioning a prototype played at E3. They also talk about Sony Santa Monica's hiring spree for their AA team with Shuhei Yoshida, who they interviewed on the show earlier that day.",
            "start": 1982.2
        },
        {
            "text": "about that but I know we talked a little bit about them hiring like going on a hiring spree for their AA team um so I guess we're kind of a ways away from seeing anything from uh you would assume H yeah oh what else oh by the way by the way did she talk about the new like a video series that yeah she had mentioned it yeah she had talked a little bit about that yeah I I thought that was pretty interesting yeah I haven't I haven't actually watched me they on Playstation blog is that where living or on YouTube YouTube or if you follow Sony Santa Monica on Twitter there's link okay and uh they just released a second episode of focusing on one uh team member who you know who is doing a job uh in the in the office Santa Monica office and those people are super creative and talking about their job and what they do at the studio you know so it's pretty interesting I I don't know why they are doing it but maybe they are thinking that might help for recruiting purpose probably yeah but but you know if you're",
            "start": 2029.68
        },
        {
            "text": "do at the studio, you know so it's pretty interesting I I don't know why they're doing it but maybe they're thinking that might help for recruiting purposes probably yeah but but you know if you're interested in the uh process of you know making games in a studio you know that's a pretty well done video so yeah it's awesome she made her pitch at the end in terms of getting trying to get people to you know go to the website and and apply because we do have a lot of devs and aspiring devs in our audience um instead of prying about games you can't talk about I'll I'll we let's finish with two games that you can talk about how's uh The Last Guardian uh looking is it still on track for this year yeah yeah yeah it's unbelievable reining it yeah yeah is unbelievable that's why I'm asking yeah yeah yeah well you know the team in Japan are very busy working but uh they seem to be very excited awesome I'm excited I want to see the final product too and then finally the game",
            "start": 2082.68
        },
        {
            "text": "yeah yeah yeah well you know the team in Japan are very busy working but uh they seem to be very excited awesome I'm excited I want to see the final product too and then finally I mean the game I think the first party game we're most excited about other than Uncharted which is close is Horizon um we got confirmation uh did we like we talked to Shuhei Yoshida who the hell did we talk to I don't remember the game is coming out this year right I mean you guys are targeting fall yes um I'm so EXCITED are you excited about this game because I feel like if Horizon hits and I think you agree if it hits and it's what it should be this is a brand new huge IP this isn't a one this doesn't seem like a one-off game to me this seems like it could be a series for you guys and Gorilla Games pivots away from Killzone just does this uh moving forward I mean are you optimistic about it are you excited about it well like uh People Media people ask me questions very",
            "start": 2128.84
        },
        {
            "text": "you guys and God of War pivots away from Killzone just does this uh moving forward I mean are you optimistic about it are you excited about it well like uh People Media people ask me questions very nicely that you know well you know this this may be like a picking a favorite from your children but uh do have any favorites from uh the games coming out this year I always answer Horizon Zero Dawn so even more than Uncharted you said uh well Uncharted is great I love you know what it is right like yeah yeah yeah Horizon Zero Dawn is oh I cannot wait to play yeah so this this like uh robot and uh it's Combat Action right I love action games and uh you know it's a open World open field it's it's amazing it's uh it's super fun I'm so excited so that's going to be your big like tent pole fall game I guess is is Horizon Zero Dawn you're going to be focusing on that figes cross yeah I'm excited well next time I come to Japan maybe you know you can just sneak me a build and you know because I know you have you know an alpha",
            "start": 2171.32
        },
        {
            "text": "you're going to be focusing on that Final Figma cross, yeah I'm excited well next time I come to Japan maybe you know you can just sneak me a build and you know because I know you have you know an alpha build of it at your office probably and you just want me play it a little bit and we can mess around with it a little bit that's fine um do you guys have like a Target date on The Last Guardian is it the summer or is that also going to be in the fall or can you not talk about that I don't think we're talking about the timing yeah yeah we release it when it's done mhm we've heard that before yeah uh all right let's wrap it up there we don't want to keep Shuhei Yoshida forever he's got other things to do Shu thank you for joining us at GDC I hope you have a good rest of your show thank you for having me you know back here uh this year and uh next year I'll be back to be an assistant for this Premier Business uh game yeah he needs he needs his young Japanese assistant to play the game for him while he about",
            "start": 2221.8
        },
        {
            "text": "back here uh this year and uh next year I'll be back to be an assistant for this Premier British uh game yeah he needs he needs his young Japanese assistant to play the game for him while he about he's new game thanks Shuhei and thank you Tim uh back to the show excellent interview Colin I assume I still haven't heard on read or watch Kevin just delivered me the file so back to the point then of what you were saying before what is his what is what does he say about the camera well he was saying that you know the he doesn't want people to feel like they needed to buy the camera twice or only give them an option to buy the camera with the PSVR unit so he's saying kind of half what you're saying but he's saying like if we just bundle the camera with the PSVR unit then what if you have a camera yeah that's a good point that's a good point and so it goes both ways I think that that I'm sure there's some marketing to with all respect to Shuhei I think that that's a great answer and that's there's",
            "start": 2257.16
        },
        {
            "text": "that's a good point, that's a good point and so it goes both ways, I think that that I'm sure there's some marketing to with all respect to Shuhei Yoshida, think that that's a great answer and that's there's certainly truth to it if not completely true but I also feel like that's a little bit PR because you could have two SKUs but I respect what he's saying the hidden cost of the P of the PSVR is only the camera so like the PS4 you'll need $350 the units 400 so that's and then the camera is about 50 or 60 so you're talking about like $800 for everything, the VR itself costs $800 yeah without even having the high-end PC rig that you need to run it Oculus is $600 plus the PC rig so the hidden cost of those things is the PC so I pound-for-pound as I said I think on GamesCast Vive could be free and it would still be more expensive than everything you need theoretically to run PSVR so um or to just run VR generally on that unit so I I'm quite impressed with it we I feel like we've talked about it so",
            "start": 2301.2
        },
        {
            "text": "still be more expensive than everything you need theoretically to run PSVR so um or to just run VR generally on that unit so I I'm quite impressed with it we I feel like we've talked about it so much I don't really know what else to say about it well we threw it away that one time we did the thing at GDC where we lost it and then we talked about it we about GamesCast I I don't want to be redundant people they love the boil down opinions of the PlayStation Faithfully I'm super stoked we had a million questions about it so Colin I'm going to start throwing some of them at you are you ready remember ladies and gentlemen to be part of the show go to KindaFunny.com/PSQ just like MatroYam did hi Colin Greg with the PSVR price tag being announced at 399 I am pretty happy my concern is that it will not hit its potential in the market do you worry that if Sony's PlayStation VR does not sell well within 6 to 12 months that it might lose support like the Vita did Vita is a great device",
            "start": 2345.72
        },
        {
            "text": "will Not Hit Its Potential in the Market Do You Worry That If Sony's PlayStation VR Does Not Sell Well Within 6 to 12 Months That It Might Lose Support Like The Vita Did? Vita Is a Great Device That Seems to Have Been Abandoned. I Own One for Remote Play and It's Great, Never Got Off the Ground. And I've Also Been Impressed. I've Also Been Impressed with PS Now. These Ideas Have Not Done What Sony Thought They Will. Will VR Be Another Underachiever? Matt, This Has Been My Concern from the Get-Go That This Would Go the Route of the Wii or PlayStation Move Where It Comes Out, It Gets Here, People Aren't Into It, Developers See That and They Don't Make Games for It. But I Don't Know. And I Don't Want to Get Too Bullish. I Believe Even VR. I Like VR. I Think You're Super into VR. You Talk About It as If It's Like Going to Be Here for Sure Forever. I Have No Doubt About It. That Was What I Was Talking About on the GameCast with Tim, Where You Know and He's Not Here to Defend",
            "start": 2389.72
        },
        {
            "text": "it as if it's like going to be here for sure forever I have no I literally have no doubt about it that was what I was talking about on the GameCast with Tim Gettys where you know and he's not here to defend his position so I don't want to talk about it too much but like comparing it to Wipeout I think is just a huge fallacy there's nothing gimmicky about VR it's not a gimmick like I like it's it's just it just isn't so but I I do still worry that it could be a piece of tech that doesn't get get doesn't get adopted it's if it comes out and does this thing I do not think it's going to be to set the world on fire now but I think they're going to have VR in 10 years sure again this is laying the foundation I think and what you when you talk to developers they're either super into it or not into it but I feel that there are enough developers that are super into it that I don't I was you know we talked about in the GameCast right and I still stand by is the fact that Cinema mode is a great you know play",
            "start": 2432.08
        },
        {
            "text": "that there are enough developers that are super into it that I don't I was you know we talked about in the GamesCast right and I still stand by is the fact that Cinema mode is a great you know play your games on your VR unit is a great way to give you something here at launch and even if it's a mediocre launch lineup and there's only one standout or whatever it's still something to use it so you don't see it on your shelf every day and resent the fact you just spent $100 on it it's a reason you could put it on you could show it to a friend you could do something with it that keeps it in this positive conversation long enough for more games to get here and show you what the real power of VR is yeah I and I still think that we have to keep open minds and and be bullish about the possibilities of VR outside of gaming I just think that like when we think about VR in terms of just gaming it's small-minded and it's not the end it's the beginning of VR and that's what it's so exciting about",
            "start": 2464.56
        },
        {
            "text": "of VR outside of gaming I just think that like when we think about VR in terms of just gaming it's small-minded and it's not the end it's the beginning of VR and that's what it's so exciting about the tech is that it's The Proving Ground for the tech and we don't see that very often in games but as I said before and some people confused by it I think on the Game Over Greggy where I was like you know it's a gimmick until it it it was a gimmick until it's not or it's it's not a gimmick until it is and what what that means is anything can be a gimmick analog sticks could have been a gimmick until they stuck right or Rumble could have been a gimmick until it's stuck or the d-pad back in the day could have been a gimmick until it's stuck and replacing kind of a an analog joystick I feel like VR has such incredible application and is such a way such a new way to play games that it it it will seem gimmicky until you put it on and you'll realize it is no gimmick and the one whether or not you know",
            "start": 2503.08
        },
        {
            "text": "such incredible application and is such a new way to play games that it it it will seem gimmicky until you put it on and you'll realize it is no gimmick and the one whether or not you know there are big developers we like out there like Shuhei Yoshida that don't believe in making games for VR but I'm not sure that they don't believe in vr's tech I've really not met anyone to be honest that I've talked to that has played VR PSVR Oculus Vibe whatever it is that hasn't been blown away by it like not even been like oh that's okay it's a huge step it's something different it's what you talk about a lot where you're waiting for something that couldn't have been done on a previous generation VR are is that experience you have this device and you can't do this on something else in this way when we were at Achievement Hunter we at Rooster Teeth we were in achievement Hunter's office and I was playing with the Vibe and I was playing like some stupid game where you like are a monster",
            "start": 2535.32
        },
        {
            "text": "way when we were at Achievement Hunter we at Rooster Teeth we were in Achievement Hunter's office and I was playing with the vibe and I was playing like some stupid game where you like are a monster walking through a city like just destroying **** and it's not a great game it's just like it's an interesting kind of tech demo you use like the motion controls to grab things and throw them and crush people and all sorts of stuff and I like smashed Nick with my hand when I was like throwing something because I had already forgotten that I was even in space like in a space with people around me like it was weird like I I was so I'm like what's going to be like when I play e Valkyrie or something what game I'm really excited about that I'm willing to break all my conventions be like no online gaming conventions for I'm going to play that game because it's **** awesome yeah so I think that PSVR or Oculus or Vive is relevant but let me read number two because it's relevant to this okay",
            "start": 2574.04
        },
        {
            "text": "gaming conventions for I'm going to play that game because it's **really** awesome yeah so I think that PlayStation VR, or Oculus, or Vive is relevant but let me read number two because it's relevant to this okay number two Gamespot reports that PlayStation VR may sell 1.6 million units globally before 2016 ends according to research provided to the website from analyst firm IHS screen digest we all know the the research notes that such sales would give psvr a 64% share of the VR Market due The PS4's ease of use and ready to go nature compared to its more expensive more complicated counterparts that require high-end PCs to run The Firm predicts 53 million PS4s in homes by the end of 2016 which outstrips the reported 17 million PC consumers that are capable of using Oculus Rift so that's an interesting number they count in their in their statistics 17 million PC consumers that are really ready to go yeah like and can play Vive or Oculus as is uh compared to 53 million PS4s that'll be ready to go um",
            "start": 2605.8
        },
        {
            "text": "number they count in their in their statistics 17 million PC consumers that are really ready to go yeah like and can play Vive or Oculus as is uh compared to 53 million PS4s that'll be ready to go um and that 1.6 million units will be sold from October to December of PlayStation VR well that's the thing right the Amazon UK they sold out of their pre-order allotment right quick and then here in North America right the deal is that they're only selling the special bundle that comes with the wands and the camera which people are pissed off about but that was what I saw announced I haven't seen clarification have you I haven't seen at some point Amazon's going to sell it here in America that you can get just the headset oh when when I yeah when that happens I'll I'll order mine sure um so this is relevant information even though it's just a prediction from an analyst firm that does make its money from being right that it's not going to set the world on fire but 1.6 million even if they sell all of those units",
            "start": 2645.52
        },
        {
            "text": "relevant information even though it's just a prediction from an analyst firm that does make its money from being right, that it's not going to set the world on fire but 1.6 million, even if they sell a million of these things in the first two or three months, that seems to be successful to me, I don't think that they would be disappointed in that, that's a pretty significant attach rate and that's what I keep going back to yeah we you know we say the same things on these shows every week I guess but the fact of it is I think it just comes down to what Sony's bar for success is I think Sony knows what they're doing you talk to Shuhei Yoshida and he says we're launching this like we launched the PlayStation in 20 years, we're going to look back and talk about the launch of PlayStation VR, they're talking about laying groundwork and laying a foundation and this isn't the one that destroys everything, this is the one that gets the hardcore people who already are hardcore enough to buy a PlayStation 4 camera",
            "start": 2683.6
        },
        {
            "text": "groundwork and laying a foundation and this isn't the one that destroys everything this is the one that gets the hardcore people who already are hardcore enough to buy a PlayStation 4 camera and already own a camera to get in and see this tech and be down with it speaking of which over at kindafunny.com/psq, randomer wrote in said hi Greg hi Colin when I open my browser Tuesday morning I read the news about the price and for PlayStation VR I was happy for you guys Ashc was right I listen and watch every week and I see VR as a technology of tomorrow so until now I was thinking of buying PlayStation VR 2 or three but during my shower that day I started thinking about PSVR and the fact that it was cheap and I could show my 80-year-old grandparents or my 21-year-old sister-in-law, side note she's buying a PlayStation 4 for my brother then she says a whole bunch of other stuff I have no question but I am the proof that the price and the novelty of VR will make it",
            "start": 2718.48
        },
        {
            "text": "She's buying a PlayStation 4 for my brother. Then she says a whole bunch of other stuff. I have no question, but I am the proof that the price and novelty of VR will make it sell now. I just need the money for it, but that's another problem. Thanks for everything, Valentine. So, is working for them right? The price we talk about - the Optics of it - that it is so much cheaper than Oculus, that it is so much cheaper than Vive. It's half the cost of Vive, and that it's approachable. You know what I mean? Like, right now we have a Vive in the living room, and Kevin keeps asking me every day, \"What are we doing with it?\" What are we doing with it? Can I take it home? Don't take it home because one day no, we're going to use it for stuff. But it's like, we should sell it. I don't want to unpack it 'cause we have to bring it in here and use it in the r room and use it on the rig and we're going to have to probably bust the table out of the room to have enough space to use and all this.",
            "start": 2766.28
        },
        {
            "text": "unpack it cuz we have to bring it in here and use it in the r room and use it on the rig and we're going to have to probably bust the table out of the room to have enough space to use and all this different stuff and get it all set up in this different PC and then our monitors are always in different places whereas with PlayStation VR it's like alright cool there's a PlayStation 4 in every room on every TV and just jack it in and sit on the bed even you just move your head and do whatever yeah I I'm confident like I don't think it's going to be this thing that's going to set the world on fire right away but it will be it's not going anywhere it's just not like I just think that there's a significant level of delusion and think that this technology is going to be introduced and that great minds aren't going to be able to do things with it it might not always have an application in gaming and it might not always set the world on fire with gaming but it is going to exist and is",
            "start": 2802.88
        },
        {
            "text": "great minds aren't going to be able to do things with it, it might not always have an application in gaming and it might not always set the world on fire with gaming but it is going to exist and is going to muddy your own point when you do this because you talk about this all the time that yeah like the real drive of VR, the real interesting thing of VR isn't the games right you always say you hope in 20 years nobody's even talking about it for games it's you're using it to do these different experiences live concerts go to the museums go to Mars different stuff like that I think that still leaves games out to dry on this round right it could be that you get this tech and you play this tech and you're like this tech's cool, these games suck but there's something here and then it is somebody goes off and does it if you know whatever happens here leads to the concert venues leads to this leads to all these different live event kind of ideas that that doesn't help games if the games",
            "start": 2835.0
        },
        {
            "text": "Goes off and does it if you know whatever happens here leads to the concert venues leads to this leads to all these different live event kind of ideas that that doesn't help games if the games fizzle out on that front no it doesn't help games but I'm not I'm not so I don't know that I really care you know like I I'm like way more interested in the technology than I am in the games all I'm trying to say is that this is a rare moment for gaming where the technology will be proven on games you know computer computers personal computers as we talked about in the GamesCast were simply not proven on games games came a little bit later the application for and what was exciting about when Xerox was working on the Star and the Alto for instance in the mid '70s was the application for your office um you know the the application of Apple 1 and especially Apple II um to uh run word processing and and spreadsheets and calculators and all sorts of like weird things like that gaming was around and it",
            "start": 2868.56
        },
        {
            "text": "you know the application of Apple I and especially Apple II, um, to uh run word processing and and spreadsheets and calculators and all sorts of like weird things like that gaming was around and it existed I mean gaming was done on mainframe computers in the 60s and 70s with Punch Cards. It's not to say gaming has a very intimate relationship with Computing; it's just to say that the technology was proven later IBM PCs weren't sold in 1981, 1982 on the back of games; it was sold on the back of spreadsheets. So to have this technology come fourth and be like we are going to prove VR with games is exciting and it could be daunting but I do think that the the the application of this is going to be obvious like immediately it's going to be obvious to people much smarter than us about what to do with it and it's not going to have anything to do with games now we might be playing games on PSVR or just VR generally in 10 or 20 years I'm sure we will be but I hope that we don't think",
            "start": 2906.84
        },
        {
            "text": "what to do with it and it's not going to have anything to do with games now we might be playing games of PlayStation VR or just VR generally in 10 or 20 years I'm sure we will be but I hope that we don't think about it like that about like look at this great gaming device it's like look at this device that's in the center of your living room in 20 or 30 years that can do anything that moves on to have its place like a computer where there's different functions for it exactly gotcha so it's I just I think it's so evident that's why I'm so that's why I'm so shocked that a lot of the Nay saying maybe I'm dead wrong but I don't think so like I I just I just don't now I think the Nay saying though is because it's about games right now you know what I mean it doesn't benefit anybody if they buy a PlayStation VR the games all suck developers abandon it but then a developer from a company X makes something awesome in VR you still spent $400 on a gaming device that doesn't do anything yeah but when like",
            "start": 2948.96
        },
        {
            "text": "VR the games all suck developers abandon it but then a developer from a company makes something awesome in VR you still spent $400 on a gaming device that doesn't do anything yeah but when like when you know um Boston Dynamics or uh NASA or SpaceX get their hands on this thing sure it's going to be way cooler than what I did the game developers going to do you know so and I also want to say that this can go for augmented reality too and I do think that both will hit I I wonder which one will will be more important than the other but um I think a is too far behind you know what I mean I just don't we we're not seeing it we're not on that level yet even Hollow lens was cool but where is hollow lens how far out is hollow lens yeah what does that mean now here's an idea somebody wants to bounce off you Colin us whatever it's monkey over on kindof funny.com psq he's jumping into this whole live action concert thing that Lauren Lanning was talking about with VR and all this different",
            "start": 2984.04
        },
        {
            "text": "bounce off you Colin us whatever it's monkey over on kindof funny.com psq he's jumping into this whole live action concert thing that Lauren Lanning was talking about with VR and all this different stuff right hello Colin and Greg a couple of months ago Sony quietly announced that they've bought a concert venue in Time Square and called it PlayStation theater I thought it was an odd purchase because it wasn't really video games related it didn't hit me until GDC when they announced the price for PlayStation VR that this venue could be used for VR concerts they haven't really talked about what they plan to do with VR besides video games I forget Sony's a huge company outside of gaming they could do VR music videos live VR Beyoncé concerts private VR movie screenings or something like experiencing an E3 PSX press conference in VR for those who can't attend in theory it sounds great but getting all these different sectors of the company on board is probably really difficult",
            "start": 3026.2
        },
        {
            "text": "like experiencing an E3 PSX press conference in VR for those who can't attend in theory it sounds great but getting all these different sectors of the company on board is probably really difficult could they pull something like this off yeah there's something to that I think although I I you know who knows because The Branding deals are you know the Islanders play in Barclays Center for instance it's like it's not it's not an uncommon thing for these companies to get their name on something and I agree with you but it did get its own PlayStation blog post like they made a thing about it that this was happening and I thought at the time too I'm like that is a weird choice this would be this is a this sounds it sounds crazy when I read it the first time and you thought about it you're like that'd actually be a really cool idea yeah I think there's something of like we have this PlayStation Theater and what it is is tied into PlayStation VR and our Live Events and all these different",
            "start": 3065.32
        },
        {
            "text": "that'd actually be a really cool idea yeah I think there's something of like we have this PlayStation Theater and what it is is tied into PlayStation VR and our Live Events and all these different things yeah I think there's something to it it goes to what Lauren Wainwright was talking to us about on GamesCast at GDC uh the idea of live concerts and live events which I think is really smart and I also think it's really smart to buy in New York just simply because um not the greatest city in the world but it's also where every band goes yeah like you don't do a tour without going to New York so it's like why would you ever do that so it it's even when even when foreign bands or whatever come for only a few shows in not Foreigner okay but even when foreign bands come from overseas to the United States New York's obviously one of the places you stop in so this is just a way to just work into the like if it's you know it's not it's not like you're getting a place in Texas or something like",
            "start": 3101.36
        },
        {
            "text": "States New York's obviously one of the places you stop in so this is just a way to just work into the like if it's you know it's not it's not like you're getting a place in Texas or something like that where it's like you might not go there even though Texas is a big state it's just it's a hub of of activity to be convenient to the ax that you would need so I do think that it could be nothing but I do think there's probably something to it how confident are you that PSX 2016 will be VR compatible that they'll have a 360 degree camera front row middle of the thing or whatever not front row but right there that's a really nice idea probably I mean that's **** awesome you totally hope they do and that's what you're I mean you're talking about with the applications and what I'll be really fascinated to see how PlayStation does it cuz when you're talking about NASA you're talking about you know getting out there for concerts my initial thought and has always been what I just talked about",
            "start": 3134.72
        },
        {
            "text": "to see how PlayStation does it cuz when you're talking about NASA you're talking about you know getting out there for concerts my initial thought and has always been what I just talked about right is like that's great that doesn't help PlayStation VR but when you rope in the fact of like what if it was the PlayStation Theater and it was that through PSN or more likely or not the PlayStation Theater app that I'd go to that yeah I gave them certain amount of money and I got to go to whatever concert is there or I gave them that and they are showing movies probably not new stuff but like return of the living Dead's anniversary comes up and they're going to do it this thing and then you can get there and sit with other people same thing though becomes like what does that do to PS and I think it'd be PSX over E3 personally E3 is harder to control it isn't their show I mean don't get me wrong they have ethernet and a million things going on there but there's another million things going on",
            "start": 3172.08
        },
        {
            "text": "it'd be PSX over E3 personally E3 is harder to control it isn't their show I mean don't get me wrong they have ethernet and a million things going on there but there's another million things going on at E3 PSX it would be all about PSX right like you'd be able to do that I that also gets me super excited to think about what PlayStation blog and like their live coverage would be right of PSX it's like roaming reporter or just roaming camera dude right who has the 360° unit on him and is just walking around and you get to see everything that's happening at PSX yeah again this is this is the exciting thing is like that the exciting VR virtual reality is not for games ultimately I mean it's just not for fake things it's for real things so yeah we're going to be playing games on them I'm excited about the games but it is virtual reality like you are in you know going to Mars in 10 or 20 years and putting 3D cameras there so you can walk on the surface of Mars is way more exciting than any",
            "start": 3206.92
        },
        {
            "text": "about the games but it is virtual reality like you are in you know going to Mars in 10 or 20 years and putting 3D cameras there so you can walk on the surface of Mars is way more exciting than any game except for PlayStation, period you know like and being able to go to your favorite concerts or a sporting event I'd pay the NFL $500 a year to just sit and watch the Jets you know in the MetLife stadium at the 50 yard line would you though talk about how the experience is better on TV the experience the experience is better on TV if you are in 90% of that Stadium if you are in the you know because there's a perspective problem when you watch live football as we know a 10 yard run depending on where you look at looks like it's a run a run at a loss or something like that so like sitting at the 50 yard line or having the option to do that going to an Islanders game and sitting behind the glass and really being able like that's what VR's all about to me reality you're",
            "start": 3245.68
        },
        {
            "text": "so like sitting at the 50 yard line or having the option to do that going to an Islanders game and sitting behind the glass and really being able like that's what VR's all about to me reality you're virtually in it sure you know it's not virtual fake **** you know like I so I mean like I like I like the idea of the games whatever I'm just saying like we let's think think big this is the proving round and that's what I'd love to hear Sony start talking about or PlayStation start talking about a little more what are they doing with this new device this new tech outside of games because these they should have probably hire a monkey because monkeys' ideas are pretty good do this at the theater exclusive theater stuff exclusive movie stuff do it at exclusive shows PSX all these different things every keynote you have now every kind of thing like that you have a camera set up there that there is a reason to Jack in to the Matrix there should be a reason to Jack in or I'll be jacking in",
            "start": 3287.16
        },
        {
            "text": "every keynote you have now every kind of thing like that you have a camera set up there that there is a reason to Jack in to the Matrix there should be a reason to Jack in or I'll be jacking in all over the place jacking off when Jackie Chan comes back hey Greg hey Greg I'm sitting here right now on PlayStation VR watching this in my underwear sure is better than being on the stage I got another one for you Colin and this is interesting Mass Effect 3 says holy **** PlayStation VR is launching in October for $399 US American dollars and that is awesome I was ALs it was also men I should say that there will be 50 Games available at launch, 50-50 in the launch window to be clear from the launch in October until the end of the year is what they're saying and some of those are sure going to push uh that's a crazy amount of games so my head immediately went to my wallet how much will PSVR games cost I doubt PlayStation VR games will be physical I don't know all the logistics for that but what",
            "start": 3323.36
        },
        {
            "text": "uh, that's a crazy amount of games so my head immediately went to my wallet how much will PSVR games cost I doubt PlayStation VR games will be physical I don't know all the logistics for that but what prices do you think will be explored will there be a range like there are with indie games that indie games can go anywhere from $5 to $40 or will there be some kind of set price at like the $30 level the same way triple A games are typically priced at $60 I will probably buy most of the launch games so I'm really curious what these will cost anyways you guys are great and I love the hell out of the show Greg uh hey it was something it was a question I thought about after Shuhei Yoshida had left which was Will games be released at retail and I think they will be I I think that's number one I do I think there will be a lot I think there's going to be a lot of indie stuff just like there is now and any other you have to have games on the shelf next to the unit you can't just sell the unit with",
            "start": 3363.76
        },
        {
            "text": "think there will be a lot I think there's going to be a lot of indie stuff just like there is now and any other you have to have games on the shelf next to the unit you can't just sell the unit with the hope of PSN selling games rigs e Valkyrie like the big the big Ace Combat real games yeah exactly the real games quote unquote yeah so I think the price point's going to go from free to 60 and one of the things I brought up on the Game Over Greggy cast was the idea of games being even more expensive typical games that would need to be reworked in some way to run in PSVR because as we talked about with uh with uh Shuhei Yoshida a while ago like you can't and and and we know like you can't just put a game on PSVR it needs to be rendered twice at 120 frames and uh you know we're 60 and 60 so that it looks right and there in so saying even saying like they're not even sure that they would allow games running it lower than 60 on PSVR at all because it just doesn't work sure um so yeah I I I still have",
            "start": 3405.64
        },
        {
            "text": "right and there in saying even saying like they're not even sure that they would allow games running it lower than 60 on PSVR at all because it just doesn't work sure um so yeah I I still have this idea and I know it's a technical hurdle and it's probably not possible I'm I don't have a technical mind like that but to just say like Far Cry 5 is $60 you can buy a $20 patch for it that will rework it so that you will work on VR you know like I think I really do think you're going to see things like that I don't I I don't I I think because you're not going to have a game that runs natively in VR and runs on the TV at the same time because that doesn't seem right either because then you're like leaving you're kind of making concessions for one or the other and then you're forcing those concessions on the person that doesn't want to play like that but it also allows developers to make a little bit of money on making a game VR compatible and then having that check box on the on",
            "start": 3441.88
        },
        {
            "text": "concessions on the person that doesn't want to play like that but it also allows developers to make a little bit of money on making a game VR compatible and then having that check box on the on the box especially if PSVR takes off which it may or may not I don't know if that it will but I don't know I don't think that's beyond the realm of possibility I feel like the way we've talked to developers when they're talking about how you have to not only the rendering part of it but the fact that things have to exist in this 3D plane or whatever you have to build a mountain your HUDs have to be completely different and then the you know field of view is so different and all these different things I just feel like it breaks the game to it's what we they've talked about it like I think it was Shuhei Yoshida who was talking about it isn't as easy as just porting a game over to VR you have to go in and rebuild all the assets and so when you sit down for Far Cry 5 you start talking about how much",
            "start": 3484.24
        },
        {
            "text": "wght who was talking about it isn't as easy as just porting a game over to VR you have to go in and rebuild all the assets and so when you sit down for Far Cry 5 you start talking about how much time that would take and how much work that would take I don't think the $20 is is maybe it's $120 or maybe the game is only built for psvr I don't know like there needs to be some I think it'll be that it's only built PS cuz this I'm sorry this this is the way VR succeeds is that it's built for VR none of this **** **** move windowed in here's one mode in BioShock where you **** use a move that's garbage nobody wants that those modes suck it has to be built from the ground up yeah I think that there needs to be a AAA solution because I do not think that psvr will be a gaming have much gaming application for very long if they're not triaa games the good news about Sony selling it at a profit which they did confirm and I couldn't believe is that um this money can be used to reinvest into",
            "start": 3517.12
        },
        {
            "text": "application for very long if they're not tria games the good news about Sony selling it at a profit which they did confirm and I couldn't believe is that um this money can be used to reinvest into not in their internal Studios were probably because I don't think their internal studios are really interested in making VR games other than maybe London and Gorilla Cambridge and Japan Studio and clearly Sony Bend who just won't release a game I doubt Ben's working on he's got glasses he knows but uh invested in the second parties to make new games new trip they they I do think that people are asking a lot why we talk about Vita and PSVR side by side is because I think they can learn a lot from the way V was handled to make PSVR more viable they must invest money they must like that's why people like oh they're making a profit I'm like it's not gratuitous it's not an altruistic thing they're doing doing A and B like they can use this money to reinvest into the PSVR thing if they were",
            "start": 3554.96
        },
        {
            "text": "people like oh they're making a profit I'm like it's not gratuitous it's not an altruistic thing they're doing doing A and B like they can use this money to reinvest into the PSVR thing if they were losing $50 a unit plus they had to reinvest money into into games to the tune to maybe a$ hundred million dollars or more given to 10 different teams I don't know I I I just think that you have to they have to invest that money wisely into into second party and hopefully third party experiences I'm just curious how much asset reworking is really required because it doesn't really make any sense to me and I don't have a technical mind of why if the if if Far Cry 4 or Far Cry 5 is in 3D in a first-person perspective why you couldn't just make that first- person perspective render twice on a on a headset and that wouldn't I don't see how that would break the the the assets you would need to rework the HUD because that couldn't be flat but everything else is already in 3D so that's the kind of",
            "start": 3592.36
        },
        {
            "text": "headset and that wouldn't I don't see how that would break the the the assets you would need to rework the HUD because that couldn't be flat but everything else is already in 3D so that's the kind of stuff that like I'm a little I'm a little fuzzy on because I'm not you and I are stupid yeah talking to microphones for a job we don't know what the hell's going on cuz like that seems to be I don't want to say easy I'm sure it's not easy but that seems to be something that would be possible I don't understand why a rock in Far Cry 5 wouldn't look right in the headset it's already rendered in 3D you know what I mean yeah I'm thinking I'm thinking I'm trying to wrap my head around the problem cuz I I don't no either obviously now someone like Shuhei Yoshida knows much more about this than us and I take him at his word because the HUD thing is a real is a real problem yeah but that's where the $20 patch would come in and remove the old HUD and remove all the things that don't work and add in",
            "start": 3632.2
        },
        {
            "text": "I take him at his word because the HUD thing is a real is a real problem, yeah. But that's where the $20 patch would come in and remove the old HUD and remove all the things that don't work and add in all the things that do work. But you think that the infrastructure of the shooter, like if you removed everything on the screen that was flat - so like the hood, yeah, the menus, yeah - and you just were in the game in a headset, why wouldn't that render on PSVR? That's the one thing that's the one thing that's the one I think about it when we were talking to Shuhei Yoshida right and he was in, and he was like well the fact of the matter is there's no roof and there's no floor you know what I mean, like the game's built around. And I'm not saying that's a big difference compared to what we're talking about, no, no. There is a floor and there is a roof in sure but I mean think about",
            "start": 3667.52
        },
        {
            "text": "I mean, like the game's built around and I'm not saying that's a big that's a huge difference compared to what we're talking no no there is a floor and there is a roof in sure but I mean think about looking down in Far Cry like what is your body you don't see your body ever right and that's something you have to solve for there's like little things like that that that you're using like where are all the weapons going and coming from we never know but if I could suddenly look over my shoulder and just see that there's all stuff piled behind me or nothing or appearing from nowhere that's the little things where it's like there's so many little workarounds and slight of hand tricks that developers use for games that we would never know about but when they go in there like I think Firewatch right when they went in there and like turned the camera around and it's just like this horrifying arm like it's just an arm and all the stuff over here that like pulled out and that with those screenshots",
            "start": 3703.08
        },
        {
            "text": "they went in there and like turned the camera around and it's just like this horrifying arm like it's just an arm and all the stuff over here that like pulled out and that with those screenshots they released that were like to show you how weird it is there's that kind of thing and I'm not saying these are deal breakers I think you're you're making a good point with the Far Cry now I'm understanding a little more what you're talking about with like the HUD but I just everybody seems to think it's and say that it's more complicated than we think it is which I understand oh I'm sure it's not easy at all it's not like porting a game from PS4 to Xbox one but or putting your goddamn trophies on your trophyless game uh but it's it's it it's just interesting to me to learn more about why this might be so hard from A Game's perspective if you all the flat things out of a game so that you are in a 3D World already then why wouldn't that game work that's that's the one",
            "start": 3736.28
        },
        {
            "text": "why this might be so hard from a game's perspective if you all the flat things out of a game so that you are in a 3D world already then why wouldn't that game work that's that's the one thing I don't understand so when Shuhei Yoshida says that you have to rework all of the assets does he literally mean all of the assets or does he mean the flat assets or the personal assets like your legs or your arms that you know aren't you're just a block really behind the camera because what the **** do they care but they have to worry about that when you have to when you look at yourself I completely agree they know way more than I do but I just don't understand it I need to wrap my head around that I need a technical somebody discussion about one of the developers who knows this and is working on VR email me please and we'll figure it out I also I'm saying $60 for retail games I think they're going to stick at that thing yeah I think will be 60 I think but I still I",
            "start": 3770.04
        },
        {
            "text": "this and is working on VR email me please and we'll figure it out I also I'm saying $60 for retail games I think they're going to stick at that price yeah I think will be 60 I think but I still I think your Indie Games your other VR games your ER experiences I think are going to come in more like $29.99 I I think it'll be a while before we get Indies that are going down to like you know where you're thinking $9.99 15 bucks well what's interesting about that is that I think the games are probably harder to make and I think that they you're going to need a greater margin too so this is one of the things that you might have to get used to with PSVR is that if there's only say 2 million of them in the Wild by March of 2017 then these guys are only going to be selling 10 20 30 50,000 units of of a normal game maybe and so they're not going to be able to charge usual $15 for a game because how are they going to make another one so I think we're going to have to get used to paying more",
            "start": 3812.08
        },
        {
            "text": "of a normal game maybe and so they're not going to be able to charge usual $15 for a game because how are they going to make another one so I think we're going to have to get used to paying more unfortunately for VR games and that's or VR experiences as it were the other thing that that Shuhei Yoshida touched on which I thought um uh pretty interesting well there there were multiple things but the one thing he talked about was that they were afraid they would have too many games and that's one of the and that's one of the things related because it's so funny it's almost serendipitous that he brought that up considering that that would what I was talking about with Donald Mustard and a couple other people I was talking about that with Cliff Bleszinski I talked about Shannon Studstill about like are there too many games M and my I am emphatically yes half the **** that's released on PSN if not more every week should never be released these guys are selling 10,000 units of a game it's like you're",
            "start": 3845.52
        },
        {
            "text": "too many games M and my I am emphatically yes half the **** that's released on PSN if not more every week should never be released these guys are selling 10,000 units of a game it's like you're burying what was the point your stuff so they it seems like they're cognizant that with psvr that they need to have quality experiences that are not hard to find if you if you launch with 50 games I think it's a huge mistake no reason to launch with 50 games there's no reason to have 50 games on that thing in six months you know mean the thing about the the thing about 50 games between October and the end of the year that I understand would be the fact that if these are coming out and they are experiences you know what I mean like I played that uh Garry the G game right now I'm sorry I played Garry the G experience at PS VR releasing at GDC and it's an interactive short film you know what I mean there's no game to it you sit there you nod it's totally and this I guess in the final version",
            "start": 3879.84
        },
        {
            "text": "the G experience at PS VRs releasing at GDC and it's an interactive short film you know what I mean there's no game to it you sit there you nod it's totally and this I guess in the final version you'll be able to talk into your camera but we at a lot event so it's just based on nodding or shaking your head no while this seagull talks to you and it was cool and it was but it was super short and it was over and it's like would I ever play that again no would I spend $5 on it to have so that yeah when Grandma comes over when Mom comes over I get to say that I think that's when they say there's going to be 50 games I think there's going to be five real games five like games that are like meaty and eating up all your time you're leveling up and eat Valkyrie and you're doing all this stuff and then I think there's going to be 45 to 40 experiences that are probably coming in and like this it'll it'll be clear this is kind of a demo see how this works da d d I think you're going to see a",
            "start": 3916.24
        },
        {
            "text": "and then I think there's going to be 45 to 40 experiences that are probably coming in and like this it'll it'll be clear this is kind of a demo see how this works da d d I think you're going to see a lot of that stuff that we've seen so far and tinkered around with I would be sure they like put out the kitchen as like an experience right here's an experience pack five VR experiences for 25 bucks or something like that and it is these Tech demo it are these Tech demo reels we'll see we will in October all right number three or do you have more questions no number three according to a substantially sourced report from Kotaku Sony is officially working on and seemingly plans to release an updated PlayStation 4 unit dubbed by many the PS4.5 here's what Kaku had to say so instead of like boiling it down I'm just going to read the story okay this story is by our friend Patrick leic we love you Patrick he says Sony is currently planning a new version of the PS4 with increased graphical power",
            "start": 3960.6
        },
        {
            "text": "it down I'm just going to read the story okay this story is by our friend Patrick Ley, we love you Patrick he says Sony is currently planning a new version of the PS4 with increased graphical power and games running at 4K resolution developer sources Tel Katakis, we don't know whether current PS4 owners will be able to upgrade or if they'll have to buy an entirely new device to benefit from the power boost but from what we hear Sony has started briefing developers based on conversations with developers who have spoken with Sony this PS4.5 will include an upgraded GPU both to support high-end 4K resolution for games and add more processing power to that which can enhance the games supported by PlayStation VR, the headset Sony will launch this fall it's unclear if PS4.5 is an official name or just a nickname that developers have been using one developer jokingly called it the PS4K while tell me about the device in layman's terms 4K resolution is around four times the pixel size of 1080p",
            "start": 4006.28
        },
        {
            "text": "just a nickname that developers have been using one developer jokingly called it the PS4K while tell me about the device in layman's terms 4K resolution is around four times the pixel size of 1080p which is the current standard for games on PlayStation 4 and competing consoles the current PS4 can output 4K photos and videos but cannot support 4K resolution for games with this upgrade it would besides resolution developers would have an opportunity to push more effects and other graphical tweaks to make their games look better thanks to the new GPU a more powerful PS4 would also allow the machine to be more competitive with PCs in the world of virtual reality with a higher end GPU the PS4 could easily match up against the more expensive Oculus Rift and HTC Vive virtual reality headsets which are designed to work with powerful PCs when contacted yesterday about this report Sony declined to comment quote we can't comment on rumors or speculation endquote a spokesman said in an email",
            "start": 4040.0
        },
        {
            "text": "which are designed to work with powerful PlayStation consoles when contacted yesterday about this report Sony declined comment quote \"we can't comment on rumors or speculation\" endquote a spokesman said in an email the traditional response the circle of people who knew about this upgraded PS4 was small until recently I first heard about the device from one trusted source then to Kaku's Jason Schreier and Steven Totilo were also able to independently verify the existence of these hardware plans with their own developer sources although some of the details have been vague one source told us that the device felt exploratory and that it may not even be released this year we've also heard uh that at this week's game developer conference in San Francisco Sony held meetings with developers about the hardware and how it would work as we were chasing down the story coincidentally Kaku uh UK EIC Kit McCarthy overheard some developers casually talking about the machine",
            "start": 4076.12
        },
        {
            "text": "and how it would work as we were chasing down the story coincidentally Kitachu, uh, UK EIC Kazunori Yamauchi, Governor me, Kazunori Yamauchi ain't it? Overheard some developers casually talking about the machine wall online at GDC they mentioned the name PS4.5 and discussed its increased horsepower mentioning both 4K resolution and PlayStation VR. Our sources aren't sure when this upgraded machine will ship to consumers nor how much it will cost. The PS4's price dropped from $400 to $350 last fall, and one source indicated that this new PS4.5 could let Sony keep selling PS4 hardware at a higher profit margin for $400. There are still a lot of big questions surrounding the device: Will Sony allow people to trade in their existing PS4s to buy their new machine? How will developers cope with releasing games on multiple types of hardware? I don't think they will. Could some games only support PS4.5 as is the case with the New Nintendo 3DS? I don't think so. When this PS4 goes on sale, will Sony be able to",
            "start": 4108.92
        },
        {
            "text": "on multiple types of hardware I don't think they'll be able to support some games on PS4.5 as is the case with the new Nintendo 3DS, I don't think so. When this PS4 goes on sale, will Sony be able to sell old PS4 hardware at a lower price? How can Sony manage all of this without fragmenting the market? Right now we don't have the answer to those questions. The PS4 and PS4.5 may not be alone either; I've heard whispers about an upgraded Xbox One for a while now, blah blah blah. We're also concerned that this goes back to Phil Spencer's whole thing about seeing this console generation as changeable and upgradeable. This concerns me greatly and about PlayStation's prospects of ruining a good thing. I'm curious about what you think about this news because they'll only be making games for PS4, not PS4.5, of course they will; otherwise how would it work? Well, I mean, I think the fact is that it's the developers who would",
            "start": 4146.56
        },
        {
            "text": "making games for PS4 not ps4.5 of course they're going to only make games for ps4.5 so why otherwise how would it work you know well I mean I think the fact of the matter is it's it's I the would be that it runs better on PlayStation 4.5 right wouldn't that be the like in my head not again not being a a developer not being a hardware manufacturer or anything right no I know surprisingly no no me and Portell aren't building PS4s back there I think there's a way for it to coexist not coexist but like phase out like when I would think PlayStation 4.5s arrival would Mark the end of the PlayStation 4 ski we know and have I would think that listen we're putting out this new one it's going to run Run games better it's going to make VR look better it's going to do d da da da da I think it's like PC I think that's the best way I can compare it or put it into how my mind thinks about it is it would be like you're going to have either high-end specs or low-end specs you're going to have there's",
            "start": 4184.76
        },
        {
            "text": "PC I think that's the best way I can compare it or put it into how my mind thinks about it is it would be like you're going to have either high-end specs or low-end specs you're going to have there's two specs here and if it says it's PlayStation 4.5 compatible it won't say compatible it'll say enhanced by PlayStation 4.5 exactly and it'll be one of those things where you put it in it won't be like a PC you'll put it in and it'll know if it's PS4.5 or not and then you'll get that kind of experience I think if and so then it would be the only messaging I see away cuz in my so in my head in the Greg Miller scheme is that's how it works right these games work on either system they just run a lot better over here and you're going to get games that are not running you know well at all on PlayStation 4 and they're running great on PlayStation 4.5 that sucks I don't think it's going to be every game it's going to be the games that aren't optimized it's going to be this it's going to be again",
            "start": 4229.24
        },
        {
            "text": "4 and they're running great on PlayStation 4.5 that sucks I don't think it's going to be every game it's going to be the games that aren't optimized it's going to be this it's going to be again high and low settings where you you get all these PSee reviews and it is well it runs really crappy on this GPU or this processor hard drives is that what they use mouse mouse and keyboard if you use this mouse and keyboard it doesn't run well I don't know what the hell happens in PC reviews but you understand my point and I think what you do though is that you phase out the old PS4 so it's like if you are going to the store to buy a PlayStation 4 now you are buying a PlayStation 4.5 I don't think you sell it as a boutique item like don't get me wrong I inane if they come out and they're like PlayStation 4.5 it's better on VR it'll look better it makes your games run better PlayStor will run better in general it's just maybe it's got a better internet interface or whatever so I'm getting",
            "start": 4275.12
        },
        {
            "text": "\"4.5 it's better on VR, it'll look better, it makes your games run better, play store will run better in general, it's just maybe it's got a better internet interface or whatever, so I'm getting better speeds on up and down even though people have said that's PlayStation servers, and again that's outside of my wheelhouse of expertise if it's a better Playstation experience I'm in and that gets me super excited period about it I love a soup. PS4 I love my PS4 now but I think you put that into shelves you put it on store shelves and maybe you this is where I'm I don't have an answer for you Colin is that I think you put it on store shelves phase out the PlayStation 4 you you know you end that skew Al together this is the new skew the problem with doing that is I don't understand how much more it costs to make the new PlayStation so I don't know for me the problem and the messaging issue wouldn't be that there's two cuz there wouldn't be anymore there would just be PlayStation 4.5 but I don't\"",
            "start": 4310.96
        },
        {
            "text": "costs to make the new PlayStation so I don't know for me the problem and the messaging issue wouldn't be that there's two cuz there wouldn't be anymore there would just be PlayStation 4.5 but I don't know if you need to go back to the $3.99 price point that's the one thing I can't wrap my head around because if that would be the one confusing thing because it was a big deal to bring the price down people like that thing but now for $50 more you're getting a better unit is that enough or is the profit margin already what they have already on PlayStation 4 is it still there with PlayStation 4.5 but not to the same extent but they're ready to eat that cost to get this out to make PlayStation VR better to sell that to sell games you know what I mean like there is a domino effect here yeah I I don't know that you're right though I think I I I just I just don't see them this is a bad idea I I just I don't I don't see if if it works the way you think you say it's going to work then it's fine",
            "start": 4346.76
        },
        {
            "text": "don't know that you're right though I think I I I just I just don't see them this is a bad idea I I just I don't I don't see if if it works the way you think you say it's going to work then it's fine but I just don't know how it would work like that because then you're telling console developers that they have to start scaling their games like and have and have settings and stuff like that the one thing about making from what I understand from my developer friends about making console games you know exactly what is going to run your game right like the PS4 is the PS4 all 40 million of them are the same so like you so now you're going to have multiple skews to PS4s and like what if then the patch doesn't work on this PS4 but it works on this PS4 and then this guy this guy's PS4 runs this game better but then this guy's PS4 runs it like **** but he didn't know that because he doesn't he he only buys two games a year like I hear you I don't know man this this this when I read this",
            "start": 4387.92
        },
        {
            "text": "game better but then this guy's PS4 runs it like **** but he didn't know that because he doesn't he he only buys two games a year like I hear you I don't know man this this this when I read this I was like oh no like this isn't good you can't you if you're doing this they have to be and they've been very clever so far with everything they've done with psvr with PS4 itself been very clever about the marketing and the way everything rolls out but why interrupt the PS4 right now why disrupt anything this thing is on Pace to out sell PS2 which is unbelievable it's not going to 152 million units not possible there's no way PS4 sells that much but PS4 will sell over 100 million units making it one of only four consoles that would have ever done that up there with original PS1 PS2 and the Wii it's a really successful unit and I'm talking about home consoles not now real quick to interject though on my side of the fence and again we're saying the same thing I don't know you're right I do",
            "start": 4428.84
        },
        {
            "text": "it's a really successful unit and I'm talking about home consoles not now real quick to interject though on my side of the fence and again we're saying the same thing I don't know you're right I do love that about consoles at work I always make fun of PS4s for that right but what you just said kind of plays into their strategy if they can do this and release the new PlayStation 4.5 that is you know does this does this better da da da I'm ready to buy a new one and I bet a whole bunch of our fans are ready to buy a new one suddenly you are you're moving more units than again you're you're getting a you're pumping the number back up I'm not buying PS4s anymore I got two I'm done you know what I mean I have one in my house but now all of a sudden there's a new unit out there I would a whole bunch of people would and then if you're doing it the way I'm I'm positioning it and you know ignoring the how does it work factor of it you suddenly then you won't you don't",
            "start": 4465.08
        },
        {
            "text": "bunch of people would and then if you're doing it the way I'm I'm positioning it and you know ignoring the how does it work factor of it you suddenly then you won't you don't lose anybody you don't lose anybody who was you know on the fence about it now they have need another incentive to buy it cuz it's better than it was before but the stratification of of consoles never really happened like the only examples of it really happening was like with uh the expansion pack on N64 which was like something that actually came with a game at one point and maybe like the ethernet hookups for PS2 and stuff like that but it wasn't like a major thing like you couldn't play Majora's Mask without the expansion pack right on N64 but most games worked fine on N64 and they never released a new N64 ever it was the same unit always and that thing was built in from the very beginning to work with it with the unit you already had so the two things I'm wondering and again this is a technical thing is is",
            "start": 4505.32
        },
        {
            "text": "was the same unit always and that thing was built in from the very beginning to work with it with the unit you already had so the two things I'm wondering and again this is a technical thing is is Tim Gettys' point on GameCast is is the PS4.5 or the expandable console going to work with it somehow work with the USBs or something like that I don't think that's possible so the only other thing that I I think is that they are going to release a unit that might be the new PS4 slim that might be the 2009 version of the PS3 when you know it became $300 or whatever except for this is probably more expensive but I I fear for them because this isn't we are we are the console space is about is not about Unity over Xbox PS4 and Nintendo everyone seems to hate each other but the but the but PS4s are PS4s are p and PS4 is already the most powerful console now it's not it's not going to be maybe when Nintendo releases the NX something I don't think that the NX is going to be more more powerful than",
            "start": 4541.68
        },
        {
            "text": "are PS4 is already the most powerful console now it's not it's not going to be maybe when Nintendo releases the NX something I don't think that the NX is going to be more more powerful than PS4 but um that doesn't seem to be Nintendo's thing but I just don't know that this is a good idea I think that they really might shoot themselves directly in the foot by doing this that that this this is if there's not a clever way to do this that does not affect anyone then don't do it at all at least not now do it later I think that the the impetus behind the PS4.5 should the rumors be true and I suspect that they are considering you know Kaku wrote it and I trust him completely is the VR unit yeah like it wasn't I don't think it's about 4K I don't think any of that matters I think it's I think it's like they were saying oh **** like we can't render this stuff the way it needs to be rendered for big games and eventually Oculus and five are going to embarrass PSVR because they're not",
            "start": 4583.92
        },
        {
            "text": "think it's like they were saying oh **** like we can't render this stuff the way it needs to be rendered for big games and eventually Oculus and Five are going to embarrass PSVR because they're not dependent on a static piece of hardware, yep, and so this is going to make people think differently about PlayStation or think differently about home consoles. I just don't know that the console space wants that, and I still contend that the console space never cared about power, so you're forcing them to care about power because of something they might not even want, and then this is going to cause different tiers or different echelons of games because I do not believe that in four years if the like if the PS4.5 comes out next year in two years there are going to be games that will not run on the original PS4 because why how is that all going to work, like I I just I don't I don't get it if the if the extra CPU and GPU stuff or whatever for rendering in graphics or rendering bigger",
            "start": 4631.8
        },
        {
            "text": "run on the original PS4 because why how is that all going to work like I I just I don't I don't get it if the if the extra CPU and GPU stuff or whatever for rendering in graphics or rendering bigger worlds and with less popping and all that kind of stuff I just then you're just going to get the shitty version of it and then you're just going to pawn that off on people with the original PS4 the People by the way that were there first you know what I mean that that to me is a dangerous Market play you're going to tell the people that bought your **** already you know and has supported it and made it what it was you guys need to get another one now along with all the other people that are going to buy in now and I'm going to sit there and be like well dude I've been there since November 2013 that's kind of **** Pascal Durbán writes into Kinda Funny.com PSQ just like you can to get your questions read on the air and says hi Greg and Colin rumors of a so-called PlayStation 4.5 are",
            "start": 4665.32
        },
        {
            "text": "2013 that's kind of funny Pascal Duran writes into Kinda Funny.com PSQ just like you can to get your questions read on the air and says hi Greg and Colin rumors of a so-called PlayStation 4.5 are running amuck and having just bought my PS4 a couple of months back this leaves a sour taste in my mouth an upgradeable console is one thing but being compelled to replace an entire system more than once in a generation is something else entirely my question is this if the rumors are true do you guys think that this is a necessary step to keep up the pace with the other platforms and the era of VR or is it a slap in the face to the 40 or so million PlayStation 4 owners especially those 8 million myself included who purchased their consoles this last holiday season in the hope that it would see them through the end of the current generation much love from South Africa Pascal",
            "start": 4702.4
        },
        {
            "text": "see them through the end of the current generation much love from South Africa Pascow, that's that is definitely the concern you're bringing up, and no disrespect to him, it's a bigger insult to the people that were there in 2013 sure you know and 2014, that people that made and bolstered these numbers and got these developers working on games that are going to be coming out over the next few years like those are the people that bought in, and so I just think this is super complicated which is why one of the guys you know that used the word exploratory in talking to Kitakaze because I don't I don't believe that this is the thing that's necessarily going to happen I don't I can imagine a fight and this is all conjecture but I can imagine a fight between the marketing team and like and being like how do we do like how you know but we could all also be looking at this through warped lenses that aren't even what they're doing and so like we don't have any answers and they're not going to",
            "start": 4745.72
        },
        {
            "text": "like how do we do like how you know but we could all also be looking at this through warped lenses that aren't even what they're doing and so like we don't have any answers and they're not going to talk about it so and that's the thing is like we we don't have all the information so you're left to jump to conclusions but I think the main concern in knee-jerk reaction is that uh I I've just bought it I've done this I expected this I expected this I expected that I mean that's not the way the world works anymore we talk about how do you keep up with this and how do you keep people buying how you keep doing I you know how many people buy a phone every year you know what I mean like buy a phone every year for the next Suite of upgrades to do all these different things like I did buy my PlayStation 4 at launch right and right now if they were like runs better less load times da D it's going to make I'm like yeah I'm in I'm totally in cuz I love my machine experience so far and I know",
            "start": 4779.72
        },
        {
            "text": "4 at launch right and right now if they were like runs better less load times da D it's going to make I'm like yeah I'm in I'm totally in cuz I love my machine experience so far and I know not everybody and maybe that is the thing it's a luxury item you're still using an iPhone 5 you don't need to jump that way and so certain things don't run as well but you're not like destroyed by it no it's true and you're right we do look at tech in a different way because we are such a consumerist technological society now that we don't hold on to things for years anymore like we used to but you also have to remember that like it's it's it's a price thing too like we could easily we make we both make well above the median household income in the United States you know like there are people that just that bought in saved their money worked hard to buy their PS4 and another and then and then Sony's just be like **** you you know now like like now and I I I just I know that's not necessarily how",
            "start": 4813.72
        },
        {
            "text": "that bought in saved their money worked hard to buy their PlayStation 4 and another, and then Sony's just be like \"you know now\" like, like now, and I, I, I just I know that's not necessarily how it's going to go down, I'm sure that's not going to be Sony's intent, regardless of how out but to me I wouldn't be surprised if some people felt that way, it's like what the heck, like we we bought it on this PlayStation 1 came out in '95 and they were making games on it until '03, PS2 came out in '00 uh and they were making games on it until a couple years ago, and then the PS3 is still getting games even though it came out in '06, and I bought this thing in '13 and in '17 I have to buy a new one right you know or I'm I'm asked to buy a new one to play the best version of the games that should be running on my machine for several more years, I understand the PlayStation 4's power is finite and I also understand the technology is moving exponentially forward but I just feel like and I'm not saying that they're",
            "start": 4850.48
        },
        {
            "text": "on my machine for several more years I understand the PS4's power is finite and I also understand the technology is moving exponentially forward but I just feel like and I'm not saying that they're wrong I'll buy it too I don't I actually the selfish part of me was like fine that sounds great I mean my main thing is I just feel like this is what right now with zero information right as we talk about this it is us coming on us and I and I mean both of us the gaming populace coming off as a bit entitled like yeah the business models change because it's not 1989 anymore you know what I mean like it's not that world anymore we live in a world where everything is evolving all the time and so this is the Xbox is doing the same thing right and this is the same thing that was brought up over on our Kinda Funny.com PSQ from Eagle Laser Cobra hey guys the rumor going around is that Xbox might release an updated and more powerful Xbox One I was just wondering if you guys think about these",
            "start": 4886.56
        },
        {
            "text": "on our kinda funny.com psq from Eagle laser Cobra hey guys the rumor going around is that Xbox might release an updated and more powerful Xbox one I was just wondering if you guys think about these half steps in console generations and if you think that people who don't update might get burned somehow personally I'm against these upgrades and more powerful things cuz I want I if I wanted to update my gaming equipment every two to three years I'd buy a PC thanks for your awesome show PS I Love You XOXO we're seeing that you're we're talking about that and that's the thing is I just feel like console manufacturers are painted into a corner in the fact that right now or yeah right now everything's going great Gangbusters and it's really doing well and awesome blah blah but Vive and Oculus and PC gaming are making these leaps every six months what is the thing where the change it's Baker's law or something yeah exactly I mean everything is changing all the time and what happens is yeah",
            "start": 4925.12
        },
        {
            "text": "and PC gaming are making these leaps every six months what is the thing where the Chang is Baker's Law or something yeah exactly I mean everything is changing all the time and what happens is yeah sure it's fine but then how many times I mean do you see PC games pour it over and the console version does get the **** version and it doesn't run well and da da da da da like that's the thing I think they're trying to stop in a business model and trying to figure out I don't know if this is a solution I'm not saying it's right or wrong I'm just saying that I think we need to be aware that it's 2016 and like the things that have worked before for decades aren't the same things anymore Apple has shown a whole new thing with hardware and how this can all work I don't know what the solution is I'm totally on board with buying a new PS4 though it's Moore's Law by the way um yeah no I I I agree with you things are changing it's just it's at the very least we can say it's unprecedented in the",
            "start": 4969.2
        },
        {
            "text": "is I'm totally on board with buying a new PS4 though it's Mo's law by the way um yeah no I I I agree with you things are changing it's just it's at the very least we can say it's unprecedented in the console space when when the there was new skus of even Atari consoles but when the new when the top loading NES came out for instance in 1994 alongside new games some 10 years after the NES came out it still played all your games sure it actually played them better but you could play all of those games Mega Man 6 for instance or Yoshi's Island came out alongside the top only NES which could be played on the original NES skew the very first one New York City 1985 so that's and the same thing with SNES the same thing with PS1 you know the PlayStation came out and the PSone the small one when you put the little screen on it played all your games PS2 had multiple skews PS3 had multiple skews so it is at the very least unprecedented it's going to require education and it's going to require",
            "start": 5007.64
        },
        {
            "text": "you put the little screen on it played all your games PS2 had multiple SKUs, PS3 had multiple SKUs, so it's going to require education and it's going to require patience but I think maybe the way you're pitching it is smart to say like well you don't have this expectation with your laptop or your phone or your tablet which is great so we see I'm fascinated I'm fascinated too but there should have been more foresight if this is what they wanted to do into the unit that already exists because there was no reason why this PS4 unit couldn't have been couldn't have had options you know for it might have been complicated you might not want people to do it but expand you know like expand it a little bit have ways to pull things in and out like make it very consumer friendly maybe it's a little more expensive at the beginning maybe you charge a little more for it but you with the understanding of being like well we this is so friendly that even your even",
            "start": 5047.52
        },
        {
            "text": "friendly maybe it's a little more expensive at the beginning maybe you charge a little more for it but you with the understanding of being like well we this is so friendly that even your even your electronics ignorant grandmother could replace Plug and Play the CPU in this thing or Whatever It Is by doing X Y and Z it's very simple you know now I'm not saying that that's an easy thing to engineer but I'm not an engineer at Sony you know so it's it's uh if that's the way they want to play it the unit should that PS4 the way it is right now that that that that beautiful sex beautiful piece of piece of work you know should should have been the same one we could could use for 10 years just **** in out of it I hear you but again easier said than none what the **** do I know number four Uncharted 4 Thief has officially gone gold na dog Neil Druckman, friend of the show, revealed the news on Twitter holding the final gold copy of the game on a burned Blu-ray disc he also noted that",
            "start": 5089.4
        },
        {
            "text": "4 Thief has officially gone gold, na dog Neil Druckman, friend of the show, revealed the news on Twitter, holding the final gold copy of the game on a burned Blu-ray disc. He also noted that I was wrong with Colin was wrong hashtag about the reason for the delay; maybe manufacturing was to blame after all. So I think he also tweeted out a picture although I couldn't find it of someone installing the game on a PS4. Um, so the game na might have yeah yeah, so the game's done. Um, I'm sure they'll patch it. Uh, but yes, so they're sending it over for manufacturing. The game will be out till May; we probably won't get it for another month. Um, I'm predicting we have it by the end of the show; that would be bold, huh? I'm going to check my email right now. All right, this is weird; you're going to check your email for the game has to go through CT; we'll CT it for him. Well, if we give it the seal of approval, we'll just put it up on the PSN; all we do is update. We don't have our Uncharted.",
            "start": 5130.72
        },
        {
            "text": "the game has to go through ct we'll ct it for him well if we give it the seal of approval we'll just h up shoe be like it's good publish put on the psn all we do update we don't have our uncharted codes all right so this is a weird one number five ryme the PS4 exclusive originally revealed at Gamescom in 2013 before PlayStation 4 was even released has officially reverted back to Spanish developer tequila works the company both tweeted out and about it and released a press statement uh press release and statement to sites like polygon noting that quote se is no longer proprietary of the ip nor the publisher of the game end quote in a tweet the company said quote tequila works has chosen to reacquire the rights to its open world adventure game rhyme we look forward to the release of rhyme in the future end quote the company also insists on Twitter that the studio is still working on the game the story is very very fishy there's way more to this story now over at Neo",
            "start": 5169.24
        },
        {
            "text": "in the future end quote the company also insists on Twitter that the studio is still working on the Game The Story Is Very Very Fishy There's Way More To This Story Now Over At NeoGAF, Here We Go To The Gaffer Or Harry Or H E R R E or it could be a capital I but I think it's L H R R E you know how it usually says member or what junior or whatever it says it says accurate under his name or whatever so apparently this person has been verified again take everything with a grain of salt that I'm about to say here's what he or she says tell me what the Harry says about rhyme all this info he or she says comes from a source very close to the studio first of all I was told that the reveal trailer was all cinematic it was faked to mimic gameplay assets Etc from the real Game but 0% of the game was implemented so all the real challenge for the studio was to put all that Vision in the final Game and apparently this has been impossible to achieve This words are what does that mean",
            "start": 5211.08
        },
        {
            "text": "of the game was implemented so all the real challenge for the studio was to put all that vision in the final game and apparently this has been impossible to achieve these words are a direct quote from my source about this news and the studio itself it contains his personal opinion quote Sony required about one month ago that the devkits be returned and canceled fundings into Tequila Works due to the game had no sense basically there wasn't a game no sense now Tequila Works, in Spanish. So you assume this person's first language is English. This is a consensus uh this is a consensus I don't know what it says of the bad Studio Direction basically Raúl Rubio thinks that he is the next Tim Schafer. The truth is that Raúl was fired from Mercury Steam, Mercury Steam is the Spanish studio behind Castlevania, of course the people from Mercury's team speak really badly about him the main critics are he has no idea about games technology he has crazy ideas",
            "start": 5248.32
        },
        {
            "text": "Steam is the Spanish studio behind Castlevania, of course. The people from Mercury speak really badly about him, the main critics are he has no idea about games technology, he has crazy ideas without sense. If you add that his wife is the chairman of Tequila Works, looking into info you can find this, you can see that basically she's a public notary in Spanish; she hasn't any background in making games. The results are that Ryūma has no publisher and it is not canceled due to the fact that they got public Spanish funds to develop the game. Um, so there's a lot of like weird stuff going on and rumors about Ryūma by the way have been circulating in like Insider forms like NeoGAF for some time that the game was cancelled. Um, take all of that all of it with a grain of salt and Sanctuary, but Ryūma um it seems like Sony gave Ryūma back to Tequila Works and and the one thing that's weird to me about the story the comment I think on Twitter was that we have chosen to reacquire the rights to",
            "start": 5289.84
        },
        {
            "text": "Ryme, it seems like SE gave Rime back to the Killworks and and the one thing that's weird to me about the story the comment I think on Twitter was that we have chosen to reacquire the rights to a game that you didn't own it sounds now again this is all conjecture it sounds to me Sony said like you know what you go ahead and keep that you go ahead and work on that you enjoy that um now people have to remember that this isn't the first time Son has dropped an exclusive remember me is a really great example of a game Sony funded um don't nod um the guys that are now huge because of Life is Strange made Remember Me which was an interesting kind of dystopian you know third person game um and Sony straight dropped it was supposed to be a PlayStation 3 exclusive they dropped the game and Capcom published it um later on so this isn't the first time they won multiple Game of the Year Awards no but uh this is the first time so this is not the first time Sony has dropped a game I'm just",
            "start": 5327.88
        },
        {
            "text": "Capcom published it um later on so this isn't the first time they won multiple Game of the Year Awards no but uh this is the first time so this is not the first time Sony has dropped a game I'm just interested in what the hell happened here it sounds to me like the game was just a disaster now uh you know whether or not that's true whether or not whatever happened who knows but um who's to say yeah I just think that uh do you have any insight into this cuz I people were excited game was off the rails you know what I mean mean like I mean granted it sure it's all conjecture there but whatever like it does I'm sure Sony was like no we're we're done well the big thing about the the again the unsubstantiated but apparently true Neo post is that they went and they were like you're giving us our Dev kits back that's a pretty that's a pretty bold thing to say like you're not like they probably were funneling money into this and it seems like a lot of people on NeoGAF you know people that",
            "start": 5364.52
        },
        {
            "text": "Dev kits back, that's a pretty bold thing to say like you're not like they probably were funneling money into this and it seems like a lot of people on NeoGAF, you know, people that aren't accurate in quotes, um, were just like \"it sounds like a scam\" it sounds like there was never a game or whatever I'm like I'm not trying to go that far these guys did make a game they made Deadlight but um so it's not like this was their first game it just seems like uh it was like a hope and a dream that Sony was like \"you know, have a shot\" not nothing to show for all this work yeah they probably dumped you know you would assume tens of millions of dollars into the game so um since it was in it was announced in 2013 so who knows when it actually entered development yeah um maybe we'll know the real story one day I don't know but um we'll find out we will I bet we'll find that the whole story one day somebody will leave put up a blog, real quick back to PS4.5 could it be that we haven't",
            "start": 5408.64
        },
        {
            "text": "story one day I don't know but um we'll find out we will I bet we'll find that the whole story one day somebody will leave put up a blog real quick back to PS4.5 could it be that we haven't heard much from say Sony Santa Monica or a Bend Studio because they're working on PlayStation 4.5 game yeah it's possible but I doubt it because you can still show that and say that is I hear you I don't think it's possible either well it's possible I don't think it's the reason because you can show the game and not be like by the way it only runs on PlayStation 4.5 what's that nothing leave me alone I'm John Garvin I'm John Garvin hey everybody it's me John Garvin I interviewed John Garvin a couple times does he sound like this hey it's me John Garvin hey Eric Jensen keep on taking keep on taking vacations you don't have to work on any game we're not making anything we're not making any Jackie's like hey Colin let me introduce you to John Garvin hey Colin it's nice to meet you it's me John Garvin",
            "start": 5445.64
        },
        {
            "text": "you don't have to work on any game we're not making anything we're not making any Jackie's like hey Colin let me introduce you to John Garvin hey Colin it's nice to meet you it's me John Garvin John Garvin's responsible for some hits like Siphon Filter and Siphon Filter 2, Siphon Filter III, and seven Siphon Filters did you know that Eric Janson where's the **** game Eric Janson hey it's me Eric Janson I heard you mention my name I don't know where the game is I'm going to take pretty pictures and not make anything Eric Janssen I have to respond to your Twitter thing because I messaged I saw he did send me a Sony Ben sticker oh which I appreciate you put on your laptop yet no I got a I have a Missoula Alumni Association sticker I have in order to put you want put on your laptop no I want to be associated with Miss there a lot of racist over there at the school I think that's why you'd want to be associated with huh Trump in 2016 huh I never said that I know uh all right let's blaze through",
            "start": 5496.8
        },
        {
            "text": "associated with Miss Theresa a lot of racist comments over there at the school I think that's why you'd want to be associated with, huh? Trump in 2016, huh? I never said that. I know. Uh, all right let's blaze through the rest of these. Let's blaze man. Let's do it. Blaz them. Dank y, speaking of dank, Yarum nugs number six, Bloodborne is getting a real-life card game, not a digital card game, officially licensed by Sony and published by Cool Mini or Not Games, according to GameSpot, which cites designer Eric Lang's Twitter account. The game, the card game will be quote simple but highly deep and interactive and quote, and is based on the quote \"The Chalice\" dungeon runs where players compete to kill monsters and take their blood and quote. He noted that it's a quote risk management game with a bit of group think, inventory management upgrades and tactical play in an intense 30-minute card game end quote. There's not yet a release date attached to this project. Number seven, The Division is officially the biggest new IP in",
            "start": 5535.48
        },
        {
            "text": "upgrades and tactical play in an intense 30-minute card game end quote there's not yet a release date attached to this project oo number seven The Division is officially the biggest new IP in gaming history according to its week one sales the game grossed more than $330 million in its first 5 days on the market which is a record for a Ubisoft release of any kind Ubisoft noted that the game reached 1.2 million concurrent players during its first weekend and players after 5 days spent over 100 million hours playing the game cumulatively its performance at Market has even surpassed the massively popular MMO FPS Destiny Peds mcals writes in kinda funny psq and says hey Colin Greg with The Division earning the title name Peds mcals hey Peds mcals oh Jackie T's answering this question hey Colin Greg and Jackie t with The Division earning the title of the bestselling new franchise ever when Destiny was the previous holder do you guys believe The Division owes some of its success to Destiny",
            "start": 5573.12
        },
        {
            "text": "Greg and Jackie talk with the division earning the title of the bestselling new franchise ever when Destiny was the previous holder. Do you guys believe the Division owes some of its success to Destiny? I feel like Destiny was a lot of people's first loot-based game, and popularized the genre on consoles in a way Borderlands never did. Would the Division still have done as well if without Destiny? And will the success of these two games influence more titles in this genre? Thanks for the amazing content you put out each week, Peds Mcalister. Yeah, I do 100%. I think it was one of those where... when I talked about The Division right and why I was excited for it, I kept saying it's third-person Destiny in New York, that set it up perfectly for what you're getting in it, set the expectations perfectly for what you're going to get. I think too, I jumped into that game expecting to have a fun game to run around and loot stuff in, and maybe the story will be there, maybe it won't be, whatever.",
            "start": 5615.04
        },
        {
            "text": "Perfectly for what you're going to get, I think too. I jumped into that game expecting to have a fun game to run around and loot stuff in, and maybe the story will be there, maybe it won't be - whatever, I don't care. It's about playing with other people, and that's what it's been for me exactly. That's why I'm in love with it, why it's delivered, why I'm aching to get back to it. Are you aching? I'm aching! No, for real - like I'm trying to figure out if I should... there's no way. I'm going to Vegas this weekend with Po, and I'm trying to decide how I should bring a PS4. No, cuz then like I can just send him to do stuff, and then I can play this once in a while - that's probably not a really nice thing to do. You know what? He's a dummy kid. He's a dummy kid... Uh, no. They owe a great deal to Destiny now. The interesting thing about Destiny to me is in Destiny specifically, which I guess will come out 2017, is how these two IPs will interact with each other because it seems",
            "start": 5654.0
        },
        {
            "text": "a great deal to Destiny now the interesting thing about Destiny is in Destiny specifically which I guess will come out 2017 is how these two IPs will interact with each other because it seems like they're going to take players away from each other and this shows the finite even though one's first person one's third person one's way more of an MMO than the other same idea though it is the same idea and I still I still contend that there's only a finite amount of space for these games well that's the big question I mean he puts Overwatch versus the gearbox game for instance he's like do you think that these two games are going to influence more in this genre I definitely think we've talked about it all the time right that they're the industry moves in waves and there is going to be more of these games that are jumping with your friends like consoles and go and do this and shoot that and get loot and da but I think you're going to see success for each one of them diminish as it goes",
            "start": 5690.72
        },
        {
            "text": "of these games that are jumping with your friends like consoles and go and do this and shoot that and get loot, but I think you're going to see success for each one of them diminish as it goes because by the time the ones that are like Destiny's hitting - it's a great idea let's make a game not just a vision, and there's going to be more, there's going to be another wave of OverWatch battles, they all run together, you know what I'm talking about, there's going to be all these games, more, there's going to be another wave of them, and by that point, who am I committed to the Division right, that's where my guys are like, I don't want to go do this because it is such a time sink, and it is this giant thing, it's a problem, it's going to be a problem for people, are going to be releasing games like this in the future too, especially with Ubisoft and Activision Blizzard in the space, you really can't beat their talent, their ability to recruit talent, and their money, and their marketing power, yeah Destiny",
            "start": 5720.48
        },
        {
            "text": "the future too especially with Ubisoft and Activision activated in the space you really can't beat their talent their ability to recruit talent and their money and their marketing power yeah Destiny 2 if I was at Activision and I was a Bungie I'd be very interested in what the Division is doing not because they're the same kind of game but just what are the hooks of that game why are people really into it and will both people remain let's keep in mind Destiny has been out for a year and a half and it's still played by millions so it's not like it's a little it's almost two years right well it came out fall 2014 and it's uh spring 2016 I'm sorry I thought I was I was thought it was earlier than that well you're wrong I apologize let's check I was like it's not earlier than that though okay I don't think I apologize maybe take all see what my September 9th 2014 okay uh number eight Firewatch is officially a Smash Hit commercially the studio revealed in a blog post that the PS4",
            "start": 5753.96
        },
        {
            "text": "okay I don't think I apologize maybe take all see what my September 9th 2014 okay uh number eight Firewatch is officially a Smash Hit commercially the studio revealed in a blog post that the PS4 and PC Adventure game sold more than 500,000 copies in its first month at full price and that the studio made back its capital investment in a single day reiterating some of what it told us during the Kinda Funny Games Cast the studio notes how grateful it is for the game's success while stating that it's continuing to refine the experience and patches including on PS4 where it wasn't running great at release uh so congratulations to Campo Santo we know people over there personally they were kind enough to come over here and do things with us so we appreciate them congratulations of stuff with us on and off camera yeah something's on record something's off the Record and finally pulsating number nine wrapup third person platformer Sky Force and PLU Adventures on Clover Island is coming to PS4",
            "start": 5795.88
        },
        {
            "text": "us on and off camera yeah something's on record something's off the Record and finally pulsating number nine wrapup third person platformer Skylanders and PS I Love You XOXO Adventures on Clover island is coming to PS4 later in 2016 supermassive games the studio behind Until Dawn and the VR title Until Dawn: Rush of Blood revealed another VR game this one exclusive to the psvr called Tumble it's a Puzzler Adventure game Zing: The Land Beyond previously announced for PS4 is also coming to psvr interactive movie \"Gary the Gull\" is coming this is spelled wrong, told you to psvr RBI Baseball 16 is coming to PS4 on March 29th Shadow Complex Remastered is finally coming to PlayStation 4 in May and finally the long rumored Bioshock collection which is clearly real since it's been rated by multiple gaming rating awards has now been rated by the Taiwanese regulation board according to GameSpot revealing its box art in the process so when they're going to get **** or get up the pot with this thing who knows who",
            "start": 5829.44
        },
        {
            "text": "has now been raided by the Taiwanese regulatory board according to GameSpot, revealing its box art in the process. So when they're going to get it or get up to speed with this thing, who knows? That's probably going to be a summer release on Vita. I can't wait; I love Bioshock and I'm gonna play it again good. And I never beat BioShock 2 and I never beat Infinite, so maybe that's my way to do it all. We'll see. It won't be you; you'll get distracted there'll be other things to play. I'm definitely going to Platinum Bioshock because it's so good. I believe that uh that's it for the news. Greg and Colin, you know I'm stoked. So stoked for God of War. I know you are, but he's so far off; he's still flying away. If I wanted to know what came to the PSN store, where would I go? You go to the official list of upcoming PlayStation 4, PlayStation 3, PlayStation Vita software by the kind of",
            "start": 5871.24
        },
        {
            "text": "wanted to know what came to the PSN store and PlayStation Store where would I go you go to the official list of upcoming PlayStation 4, PlayStation 3, PlayStation Vita, and PSP software by the Kinda Funny co-founders here are the games \"101 Ways to Die\" comes to PS4 digitally says in this puzzle platformer, platformer you'll need to use your creativity, cruelty, and an absolute lack of morals as you help the evil Professor Splat and Futter complete his life's work to create the most horrific recipe book ever \"101 Ways to Die: Cat Lateral Damage\" comes to PS4 digitally says cat lateral damage is a first-person destructive cat simulator where you play as a cat on a rampage knocking as much stuff onto the ground as possible see the world through the eyes of a cat I can't wait this is a game that came to PC and I ignored it and now here it is on the greatest platform I want to get some trophies you think it's got a platinum we can find out find out for me Colin as I smoke this imaginary",
            "start": 5909.96
        },
        {
            "text": "that came to PC and I ignore it and now here it is on the greatest platform I want to get some trophies you think it's got a platinum we can find out find out for me Colin as I smoke this imaginary cigarette it does **** yes Steve Gainer you're a hack da of the tentacle remaster comes to PS4 npsv to digital and is Cross by originally released by LucasArts in 1993 Day of the Tentacle is a mindbending time travel cartoon puzzle Adventure game in which three unlikely friends work together to prevent an evil mutated purple tentacle from taking over the world perhaps it's Ultros from Final Fantasy VI you going to play it no no me neither Dragon Fantasy: The Black Tome of Ice comes to PS4 digitally Cross by with Dragon's Dogma Book 2 on PS3 or PS Vita so if you have uh Dragon Fantasy Book 2 on PS3 or PS Vita it is free join Ogden and the heroes of Westeria in this classic JRPG epic travel through the Frozen wastelands of Tandria experiencing action-packed battles without Random Encounters using",
            "start": 5951.0
        },
        {
            "text": "or PS V it is free join Ogden and the heroes of Westeria in this classic JRPG epic travel through the Frozen wastelands of Tandria experiencing action-packed battles without Random Encounters using spatially aware area of effect attacks and power moves travel by pirate ship defending against enemies and thrilling ship to ship rock monster combat defeat oncoming hordes of demons and huge bosses that threaten the entire world of Dragon Fantasy cool I will Okage Shadow King comes which I used to call Oage when I was young who of course cuz that makes sense yeah uh I think it is Okage though Okage Shadow King comes to PS the PS2 game comes to PS4 digitally says in an unexpected twist of fate the E the spirit of an evil King is Unleashed and possesses the shadow of an innocent young boy named Ari wielding the burden of this evil ghostly being Ari and his friends must journey across a wonderfully animated Whimsical world uh Paranoia Activity was supposed to come to Vita but it just crossed",
            "start": 5996.8
        },
        {
            "text": "wielding the burden of this evil ghostly being Arin and his friends must journey across a wonderfully animated whimsical world uh Paranautical Activity was supposed to come to Vita but it just crossed out **** Republic comes to PS4 digital and Retail says you receive a call from Hope, a woman trapped inside an eerie totalitarian state by hacking into elaborate surveillance networks. Guide her through a web of danger and deception developed over 5 years by industry veterans, Republic is a thrilling adventure that explores the perils of government surveillance in the internet age. Definitely want to play that from our friends very very fun game Track Mania Turbo comes out and it has a trial on PS4 digital and Retail says available for the very first time on PS4, Track Mania offers you the ultimate arcade racing universe where everything is about reaching the perfect racing time, test your skills in more than 200 tracks, experience immediate fun by challenging your friends at home offline split",
            "start": 6034.44
        },
        {
            "text": "arcade racing universe where everything is about reaching the perfect racing time test your skills in more than 200 tracks experience immediate fun by challenging your friends at home offline split screen or online and finally War Thunder comes to PS4 digitally this is out on the 24th so this is a Thursday release challenge your friends online locally or play against AI to rule the world in this epic strategy game invade territories and devise tactics to defeat your opponents and take over the world hey guys we're going to be featured on the PlayStation blog and we want to sell our game all right cool what should the uh art be that we show in this game nobody's heard of just give them just give him the title just give him the logo for the game shouldn't we maybe put a screenshot in I don't know if many people have heard of Warhead no no no no no just shove it in there just put it in I wanted on a transparent background the logo of the game people aren't going to know what",
            "start": 6071.36
        },
        {
            "text": "in I don't know if many people have heard of Warheads no just shove it in there put it on a transparent background the logo of the game people aren't going to know what it is not going to no people get excited for Warheads they'll think it's a candy tie-in we'll trick them that's it for the games garbage Colin yeah I don't disagree with you thank you I love you very much love you too Colin we already did Tot so it's time to check in on the trophy times so I want to know what you got for me this week breaking trophy news well it's like catastrophic damage thank you very much so Catastrophic Damage uh let's see has he's got him yet uh 17 bronze 10 silver five gold One Platinum so more of a Gone Home game than gone home the Platinum is called Platinum this is my kind of game it's kid-friendly so let's see knock over 1,000 objects knock over 5,000 objects knock over 20,000 objects for bronze silver and gold get a score of 2,000 or more in objective mode play in the",
            "start": 6107.76
        },
        {
            "text": "my kind of game it's Kid Icarus so let's see knock over 1,000 objects knock over 5,000 objects knock over 20,000 objects for bronze silver and gold get a score of 2,000 more in objective mode play in the Little Big Planet mode for an hour is a bronze trophy uh be a cat for 30 minutes straight yes is a bronze trophy uh unlock and complete the Museum the museum oh no that's very cute in objective mode unlock and complete the Super Mario hat in objective mode catch a mouse Catch 10 mice defeat the laser pointer is come on col this is awesome it sounds pretty cool uh collect photos there seems to be a lot of collectible stay airborne for 3 seconds carry an object for 1 minute complete a an objective without using Paws and the icon is a paw with a like line through it bigger Meowth is a silver meow a whole bunch and then big Meowth is meow a lot oh my God you nailed it this is the trophy list that nailed it I'm actually more excited about this game now because of the trophies uh",
            "start": 6156.92
        },
        {
            "text": "is a silver Meowth a whole bunch and then Big Meowth is meow a lot oh my God you nailed it this is the trophy list that nailed it I'm actually more excited about this game now because of the trophies uh Warheads trophies are up should we look at those how many platinums does this got Warhead says no Platinum it says uh three bronze three silver two gold Silver win the game in less than 15 turns win the game in less than 10 turns win in less than 10 minutes win in less than 5 minutes win in less than three minutes defeat an online player defeat 10 online players defeat 30 online players no thanks no thank you Stranger of Sword City on Vita which people are pretty excited about comes out uh 27 bronze 15 silver two gold One Platinum let's see tell me a little bit about Stranger of Sword City I don't I don't know much about it is this one of the NIS games uh no I don't think so let me look Stranger of Sword City I've seen people talk about it oh it is yeah it is it let's look at it it looks",
            "start": 6211.64
        },
        {
            "text": "don't I don't know much about it is this one of the NIS games uh no I don't think so let me look Stranger of Sword City I've seen people talk about it oh it is yeah it is it let's look at it it looks like a oh no we I played this it um it's a Looks Like a Dungeon Crawler yeah we played this yeah I played this game this is a uh a JRPG okay like first person so like okay uh let's see Day of the Tentacle 53 bronze trophies three silver one gold One Platinum are there more tank controls in here from 53 platinum or 53 bronze trophies 53 Bronze 53 Platinum trophy that'd be all over jeez that's wait you know what **** off I'm reading that list let's see wake me when Full Throttle gets let's stop with a republic ooh Republic Republic actually let's go here Republic has 16 bronze six silver seven gold One Platinum M listen to every single Zag tag tape help Hope collect every band book and game cart in the game scan every omnivore item in the game those are all gold trophies so those are",
            "start": 6257.76
        },
        {
            "text": "gold One Platinum M listen to every single Zagreus tape help Hope collect every band book and game cart in the game scan every omnivore item in the game those are all gold trophies so those are collectible trophies listen to The Zeros so it says there's ones for completing things for finding all the tapes and all the omnivore view and all the collectibles in each stage for silver trophies and bronze trophies oh yeah it's good so it seems like alright so here's an example bronze listen to all The Zeros tapes found in episode one silver scan all omnivore items in episode one um gold help Hope collect all banned books and Game Cards found in episode one and then bronze complete episode one and it seems like there's that the and then they all accumulate into gold trophies at the end okay very cool I can do that you should get us codes for that I already have mine oh I think you sent me mine too all right good come to think of it now I'm distracted because now like I don't know if I should keep saying",
            "start": 6317.8
        },
        {
            "text": "do that you should get us codes for that I already have mine oh I think you sent me mine too all right good come to think of it now I'm distracted because now like I don't know if I should keep Sanctuary cat cat lateral damage meow a whole bunch meow a lot two trophies right there somber wrote into kind of funny.com psq for trophy time and says hey Greg and Colin this could be a trophy time question it is good job something I haven't really thought about when considering to buy a PlayStation VR as trophies I wasn't really planning to buy a PlayStation VR but now that I think about it psvr should be another way to get trophies my question is what kind of trophies support do you think psvr will have do you think we will see many platinums considering most of the launch games seem to be smaller games how cool will it be to see a PlayStation trophy pop in VR that's going to be interesting the interface will be interesting I have not seen a PlayStation trophy prop in VR yet no yeah and",
            "start": 6366.12
        },
        {
            "text": "games how cool will it be to see a PlayStation Trophy pop in VR that's going to be interesting the interface will be interesting I have not seen a PlayStation Trophy pop in VR yet no yeah and that's what I'm prob not even implemented yeah but I'm excited to see it when it happens but I do think it's going to be interesting I think it's going to run into the the not having a lot of platinums well I think the experiences won't I bet you that rigs will he told us it will Rigs will uh e Valkyrie is combat but yeah I think most impr I think the majority of games won't it'll be there will be these little experiences where you get a gold at the end agreed not a fan of that agreed well I mean that's fine I mean what I still contend that God of War doesn't deserve a platinum like it's not a big deal it's the game can be beaten in literally 90 seconds yeah of course if but I mean that and there's a trophy for it yes but that's part of the thing you wouldn't know how to do that till",
            "start": 6407.48
        },
        {
            "text": "a big deal it's the game can be beaten in literally 90 seconds, yeah of course if but I mean that and there's a trophy for it yes but that's part of the thing you wouldn't know how to do that till the end of the game you know what I mean it's not like you I know what you mean it's not like you can literally beat the that was that was a good one, that was a good use that was a a real use of the the phrase uh you wouldn't know how to do it until the end so that doesn't count I don't I don't like that uh we spent a lot of times we spent a lot of time in this episode yeah not but time technically is you know poor times everywhere right true flat circle already with reader mail kind of.com psq mail with off cocktail D I'll to see a few ones that aren't VR related how about that Colin sure don't get the hell out of here cuz I got to go see Batman v Superman tonight, yeah this I mean with the with the shoe thing this is going to be a long episode yep I'm gonna give you two all right number",
            "start": 6443.96
        },
        {
            "text": "get the hell out of here cuz I got to go see Batman v Superman tonight yeah this I mean with the with the Batsuit thing this is going to be a long episode yep I'm gonna give you two all right number one comes from Dr. Pow dear Kinda Funny boys I'm putting it on Front Street I want a sequel to The Order: 1886 it was the first big game I played on the PS4 and I had a really good really good time with it although I may have stacked the odds in my favor on this front because I played it over an extended period of time by only completing one chapter a day I enjoyed the characters and the world that Ready at Dawn developed and want to see where the story goes my questions are does The Order: 1886 deserve a sequel is it likely that it would get one and what could Rad or any other developer do to get you fellows back in Sir Galahad's boots thanks Jeff PS your one true love so Colin yeah number one does it deserve a sequel yeah it does I 100% agree with you yes it does cool world beautiful he said the",
            "start": 6482.76
        },
        {
            "text": "back in Sir Galahad's boots thanks Jeff PS your one true love so Colin yeah number one does it deserve a sequel yeah it does I 100% agree with you yes it does cool world beautiful he said the world he said the world and characters that Rad developed that was those weren't the problem yeah you know those were the best parts of the game right it does deserve a SE it deserves a sequel It's it's an interesting world it's just the game exactly is it likely uh I think it's a 50/50 chance yeah I think it's likely I think it's going to happen do you think Rad will develop that's the big question he says and what would Rad do to get you back I don't know if it'll be rad that's the big I think it could be so as far as I understand Rad is working on like some they're working on three games I think right they're working on a VR game I think some other game and then a PS4 game and my assumption is that the the the capital investment into that engine which was so they were obsessed with it",
            "start": 6529.4
        },
        {
            "text": "right they're working on a VR game, i think some other game, and then a PS4 game. my assumption is that the capital investment into that engine was so they were **** obsessed with it, and that was the problem - that was seemed to be the problem was they were just obsessed with the technology. that was the problem with the game. I've told the story many times, so I don't want to reiterate too much of it, but like the first time I saw the game it ran like **** like the first time you actually saw the game, but like when I saw the game in 2013 in Germany they were just showing Gadh running around and like look at this cape physics. and I'm like when I saw at E3 2013 so even before that they had a behind closed door demo where they just showed the trailer again and then I had to spend my five minutes with them being like what is it, you know? and then you know, you know, is it a shooter, yeah? you got to ask about. and they're like yeah. and I'm like is it first person, like no third person",
            "start": 6571.32
        },
        {
            "text": "five minutes with them being like what is it you know and then you know you know is it a shooter yeah you got to ask about and they're like yeah and I'm like is it first person like no third person and I'm like all right like time's up I'm like you could have just showed me a **** screenshot and and I could have like you know figured that out for myself so they were really worried about things that had not that were ancillary to the game's quality the problem with the game was not the way it ran the quality problem with the game was not its um it's characters or its story or its setting it was all awesome they nailed it it's very it reminds me a lot of Assassin's Creed in the sense that I'm like this is awesome if you just look at it um The Game's super short it's not media I mean I didn't think mechanics were even fine but it's just like I'm like did you forget to make the game how long was this in development for inexcusable that this game is so short and so **** shallow",
            "start": 6605.84
        },
        {
            "text": "didn't think mechanics were even fine but it's just like I'm like did you forget to make the game how long was this in development for inexcusable that this game is so short and so **** shallow you know but it is such a waste that is that is the thing that I I I'm you know and I think Sony might know that with r da where I'm like what a **** waste you have this engine you have this world you might as well make the order 1887 and that's the thing ready on super talented son knows that and so I think you take what you've learned from this experience what people want out of this game what they did to all the knocks they did get for it and yeah you give them another shot you do I mean but maybe you don't I don't know that game was in development for a really long time Sony might just take the engine and run and but they own the IP anyone can make the game rad doesn't have to make the game although I'd feel bad if they didn't get them you know they're really into that story and Shu",
            "start": 6643.52
        },
        {
            "text": "the engine and run and but they own the IP anyone can make the game rad doesn't have to make the game although I'd feel bad if they didn't get them you know they're really into that story and Stu like that it would be nice to least have them write it and that's the thing I think they get I think they get a shot at it again they might be working on it right now and and I wouldn't be surprised to see it emerge not this year probably but next year D3 and I wouldn't be surprised if it was way better you know I oh God yeah I'm I'm way it's an Assassin's Creed and Assassin's Creed 2 situation where I'm like oh okay there's something there but I didn't like all of it but I think the next one when you sit down and you actually have a Vision now and the the line share of the technical work is done and you understand what people liked about it now you get to jump on that there you go well I mean so do I think it deserves a sequel absolutely uh it's made it was ended to make a sequel yeah the",
            "start": 6680.36
        },
        {
            "text": "and you understand what people liked about it now you get to jump on that there you go well I mean so do I think it deserves a sequel absolutely uh it's made it was ended to make a sequel yeah the way the game ends is really cool actually and and um it would be interesting to explore that new world that you know they find themselves in and uh I just think it's about a 50-50 chance that it's real because I I don't Sony might have lost tens of millions of dollars for all we know on that game and and so that game regardless of the the Order: 1886 or whatever they're going to call it comes out or is announced it's going to have a stigma attach to it of a really shitty game so like not a really shitty game we do get people who argue with us and like you know he really enjoyed it there are people I say yeah you're right you're right that's hyper it's not a Naughty Bear it's not a Naughty Bear but it is not anything better than you know like where I was just like I wanted that game to end",
            "start": 6716.28
        },
        {
            "text": "I say yeah you're right, you're right that's hyper it's not a Naughty Dog bear it's not a Naughty Dog bear but it is not anything better than you know like where I was just like I wanted that game to end and it wasn't even that long yeah especially that stealth part I was like this game's **** annoying me now but the in the garden or whatever yeah I'm like come on **** sucks but like the the there is a nugget of something good there we know what Naughty Dog is capable of and uh I would like to see them work on something but Sony might look at and be like well this game's going to cost x amount of tens of millions of dollars to make we already lost x amount of Y amount of money on the original it's going to have this stigma attached to it but maybe we can sell the original again or bundle them together I mean I don't know I wish I knew the answer but I don't I literally not even off the Record do I know the answer I heard nobody at PlayStation knows the answer no one knows they were just told",
            "start": 6750.92
        },
        {
            "text": "I mean, I don't know, I wish I knew the answer but I don't. I literally don't even off the record do I know the answer? I heard nobody at PlayStation knows the answer; no one knows. They were just told, \"Ready, don't do what you want. Figure it out, report back to us if you want.\" If you want somebody else to do the game, just tell them, just give it to them, let them talk to us. I'm auditioning and we're jumping to introduce you, ladies and gentlemen, to your new PS I Love You best friend. Remember, go to cny.com forums, go to PS I Love You the boards, then go to PS I Love This best friend XOXO, where you can write a little post about why you need PlayStation Network friends. We read your story; you get people. This one comes from Bean man $29.99, Bean man, Bean man $29.99. Hey, Bean man, Jackie T is here, beanman 2099 says, \"I picked up a PS4 back in June and love it. Although I only had an Xbox 360 during the last console generation, I would love to fill up my friends list with the big beautiful\"",
            "start": 6787.68
        },
        {
            "text": "is here Beanman 2099 says I picked up a PS4 back in June and love it although I only had an Xbox 360 during the last console generation I would love to fill up my friends list with the big beautiful best friends I plan on kicking ass during this trophy war and I would love some great friends to play The Division and Uncharted 4 multiplayer with my PSN is Beanman 29.99 thanks PS I Love You but I'm not ready for a serious relationship Jacob from Missouri so Bean Man 2099 is Jacob from Missouri too so talk to him about Mizzou the Tigers if he's going to miss the Rams and Jeff City whatever the hell is happened there you know what I mean KC City KC McCaffrey talk about that a little bit talk a little bit about big old KC big old KC what you doing over there how's how's it going uh time for this week's forgotten PlayStation game this is where Colin or I or You from the audience talk about a game everybody's forgotten about that a PlayStation game it is my turn you have a good memory and I",
            "start": 6831.88
        },
        {
            "text": "Week's forgotten PlayStation game, this is where Colin or I or you from the audience talk about a game everybody's forgotten about that's a PlayStation game. It's my turn. You have a good memory and I like that about you. Your phone's ringing; it's Northeastern asking me for donations. You want what? Off you want what? My donation was the $80,000 I still owe you. I was in an Uber the other day, and Missou called me, and they were looking for donations. They said I'm assuming students call you like, \"Oh, I'm doing a thing,\" and it's because I donated to them once, and I talked to this sophomore journalism major for like 10 minutes in that Uber ride, and then she got to the point, and I was like, \"I'm not going to pay anything. I've just been talking to you.\" I was trying to... You know, you don't want to be mean to them; they're kids, but yeah, I wasn't... I don't feel comfortable when they're like, \"You know, can you give us\"",
            "start": 6881.32
        },
        {
            "text": "been talking to you I was trying to I you know you don't want to be mean to them they're kids but yeah I was I wasn't I don't I don't feel comfortable when they're like you know know can you give us $200 I'm you're a random person who called me I'm not going to Northeastern literally costs I think $47,000 a year **** off there's like 20,000 people there do the math you know like leave me alone uh my forgotten PlayStation game of the week will sound like a joke but stick with me it's Folklore folklore we always gave Ryan a lot of **** for Folklore cuz he gave it a 9.0 at IGN it was like one of his first reviews for some reason we did give a lot of **** it wasn't a bad G it wasn't it was fun game and that's why I'm nominating it was you know this action RPG whatever you want to call it where you're busting ghosts that was it and it was using six axes but not in a super annoying way where you got the ghost caught and then you like fish him out I'm **** it's Japanese they were",
            "start": 6913.68
        },
        {
            "text": "it where you're busting ghosts that was it and it was using six axes but not in a super annoying way where you got the ghost caught and then you like fish him out I'm **** it's Japanese they were Japanese yes I know that they had a sense of style you went to this remember you go to this land where you could supposedly be there you went there and investigate This Woman's mom I can picture her in her little hat but that doesn't help me who the **** that doesn't help me that developed with their hat oh Game Republic oh yeah I know they're defunct now yeah they made uh let's see Genji: Dawn of the Samurai Brave Story New Traveler Genji: Days of the Blade Kuro on PS3 Clash of the Titans on PS3 Knights Contract I remember that game on PS3 yeah while I'm saying Folklore because it's like Ghostbusters and here I wanted to give you the intro paragraph for one Ryan Clements at PAM Cider you know from the PlayStation blog this is how his review opened a melancholic piano sigh",
            "start": 6956.84
        },
        {
            "text": "It's like Ghostbusters and here I wanted to give you the intro paragraph for one Ryan Clements at PlayStation Blog. You know, from the PlayStation blog, this is how his review opened: a melancholic piano sigh under the backdrop of a sea of blown wind as you meander along the paths of D'Duan Village; your steps color the scene with murder, suspicion, and knowledge of the many realms of the Netherworld. This surreal and often times haunted journey is the Journey of Folklore, and this is one great reason to own a PlayStation 3 - that's a **** intro. Clemens, I know you're over there right now getting no coffee left and right keeping Jackie out of the building; you got your stun baton keeping them out. Yeah, I'm telling you son, you know how to write. Oh yeah, Clen is a fantastic writer. Colin, would you like to know the PSN's worst name of the week? I'm going to get it, even if I don't want to. I'd love to tell you about it, but first, I'll tell you about this one sponsor: Audible.com. Do you love",
            "start": 7004.4
        },
        {
            "text": "know the PSN's worst name of the week I'm going to get to learn it even if I don't want to I'd love to tell you about it but first I'll tell you about this one sponsor, Audible.com. Do you love books, but fine that you never have time to read them? Well, Audible.com has the perfect solution: get audiobooks and listen to those books you've been meaning to read while on the go at the gym during your commute. Audible.com provides over 180,000 titles from leading audiobook publishers, broadcasters, entertainers, magazine and newspaper publishers, and business information providers. Their app is free and works on iPhones, iPads, Android, and Windows phones. You can also download and listen to on your Kindle Fire and over 500 MP3 players. And unlike a streaming or rental service with Audible.com, you own your books so you can access them anytime and anywhere right from your smartphone. Audible.com also has the great \"listen guarantee\": if you decide you don't like their book, you can shoot um if you",
            "start": 7051.28
        },
        {
            "text": "your books so you can access your books anytime and anywhere right from your smartphone audible.com also has the great listen guarantee if you decide you don't like their book you can shoot um if you decide you don't like the book you choose no worries you can exchange any book you aren't happy with for another title anytime no questions asked and just for our listeners of PS I Love You XOXO audible.com is offering a free 30-day trial membership go to audible.com PS today to start your free trial again show your support for us PS I Love You XOXO and get a free 30-day trial at audible.com PS back to the psn's worst name of the week this is where you write in with your bad PSN name and you get to kindofunny/ps put it up there do it no more rocket leagues no many random people you're seeing some of you're trying to get it again also side note sidebar if you're one of the hi how are you doing it's Colin on the sidebar if you're one of these people who writes in with the questions every",
            "start": 7090.68
        },
        {
            "text": "seeing some of you're trying to get it again also side note sidebar if you're one of the hi how you doing it's C on the sidebar if you're one of these people who writes in with the questions every week I love you a lot of you are starting to **** slip and go back to like writing novels here Ain't Nobody Got Time forol what's your **** question zigger I started reading the zyger post tell them how it is millions of paragraphs here and I'm just like shut up zigger sh he's John Steinbecking it up over oh my God you're over here telling me about how the dirt tastes I don't care ziger Steinbeck talks about the clay one more time I swear to Jesus I'm Coming For You today's post comes from John John says Hey guys wanted to give a different take on worst name of the week my spin in this whole thing is that I wasn't creative enough when creating my name years ago my last name is Reckless true story which could lead to many creative username Reckless abandon rock and wrecking",
            "start": 7135.8
        },
        {
            "text": "\"Thing is that I wasn't creative enough when creating my name years ago, my last name is Reckless - true story, which could lead to many creative usernames like 'Reckless Abandon', 'Rock and Wreck', and 'Express Wrecking Ball' are just some of the ways I could have gone with when I was creating a name instead I just took my name and kept it simple so John Reckless was created. I would love to be able to change my name and add a little creativity to it, so please Shuhei let us change our names - John Reckless now here Colin yeah is where we tell John Reckless that he's a **** liar, he's a straight up **** phony why because how long has the Kinda Funny forums been around? Nearly a year, June May nearly yeah Kinda Funny Live nearly a year. It's like what do you think John Reckless who's so upset about his PSN name and he could have done all these creative things... What do you think his Kinda Funny username is? Same as John **** Reckless just John Reckless take to Greg, John Reckless if you're going to get up here on my\"",
            "start": 7180.88
        },
        {
            "text": "and he could have done all these creative what do you think his kind of funny username is same John Reckless just John Reckless take to GRE John Reckless if you're going to get up here on my show and lie to me and tell me you want to you want to waste Shuhei Yoshida's time changing a name when a year ago you were still just out there putting yourself out as John Reckless you can go **** yourself sir tell them great nobody's going to waste Shuhei Yoshida's time unless it's me and Colin that's what we do that's what our job is my specialty is wasting Shuhei Yoshida's time you don't get to come in here and be like I want a better name when a year ago you picked the same shitty name that's just that's that's like I don't want to get electrocuted every time I poke the outlet but I keep trying to **** the outlet so here I am getting electrocuted sorry John Reckless stop putting your dick in electrical sockets you piece of **** delete your Twitter account did you delete",
            "start": 7229.4
        },
        {
            "text": "I keep trying to fix the outlet so here I am getting electrocuted. Sorry, John Reardon. Stop putting your dick in electrical sockets, you piece of shit. Delete your Twitter account yet? You better. I'll wait. Pull over your car and delete your Twitter account. I wouldn't even know how. You're sitting on the side of the road for 20 minutes trying to figure it out. Ladies and gentlemen, this has been PS I Love You XOXO episode 28. Thank you so much for joining us, John. Thank you for letting us give you shit. Remember, PS I Love XOXO is Kinda Funny.com. It's a PlayStation podcast. So go to KindaFunny.com, subscribe to all the YouTube channels, listen to all the podcasts, watch all the videos, follow everybody on Twitter. Follow me on PSN at GameOverGreggy. Go over to Colin's new Instagram and follow him there at KFMarti. Then call your family. What is Grandma up to? Is she still alive? Grandma, yo! Big old grandma. What do you think of Jackie T and Greg's inability to pay the water bill?",
            "start": 7265.68
        },
        {
            "text": "and follow him there at KFM Arti then call your family what is Grandma up to is she still alive Grandma yo big old grandma what do you think of Jackie T and Greg's inability to pay the water bill hey Grandma let me tell you about PlayStation VR stop it he's like a horror villain he's just like haunting this family he wants to have doing it uh we're also the number one PlayStation podcast on the internet so go wherever your podcasts are whether it be youtube.com/kindafunnygames or MP3 services around the globe subscribe like share please it means the world to us when you tell your friends about us no matter how small you think you're following is every episode of PS I Love You XOXO ends in a song in a segment we call Singing a Shoei this is where you go to kindafunny.com/PSM and submit your song that's right you musical artist out there or guy who blows in a jug I need your YouTube video and your I don't know someone John Reckless probably right now begging for change so he can figure out",
            "start": 7308.24
        },
        {
            "text": "that's right, you musical artist out there or guy who blows in a jug I need your YouTube video and your I don't know someone John Rehse probably right now begging for change so he can figure out where his life went wrong John Rehse playing the steel drum outside of the Amarad like all those people I saw this weekend this is where you whatever musical artist you are go to kindafunny.com PSM submit your song I need an MP3 link cuz if you're listening to MP3 I'll play the song at the end and a YouTube link cuz if you're watching the YouTube video and a ha out to this week's artist and this week's artist is Say Girl Say Hey Greg says one of the people in Say Say Girl Say who didn't put his name at the end of it it was cool running into you South by Southwest Gaming Awards Saturday night just wanted to say thanks again for the courage and inspiration to step away from my old career to pursue my new passion of music My Band Say Girl Say is a genre-bending",
            "start": 7352.72
        },
        {
            "text": "gaming Awards Saturday night just wanted to say thanks again for the courage and inspiration to step away from my old career to pursue my new Passion Of Music My Band SE girl say is a genre bending Trio from Houston Texas the song is Tundra from our our debut self-titled album released this summer we are an alternative folk band with a wide range of influences and styles from east to west below is a link to our live video of our song oh my goodness so again why I like SE girl say a lot of promotion here giving us to MP3 gets its own song then you get a link on this to a different song if you like SE girl say it's very simple to go find them go to se girl say I like that again simple and they promoting they even put their Twitter in here @sayirsaycore unfortunate I don't like I this is the one thing I I like you know how it's like Nick Uno Scarpino right and he has a big problem with that I don't mind the underscores when they're connecting things I don't like the hanging Chadore",
            "start": 7395.72
        },
        {
            "text": "The one thing I like, you know how it's like Nick Sorensen right and he has a big problem with that. I don't mind the underscores when they're connecting things; I don't like the hanging chadore say girl say underscore could it have been Saycore Girlcore? Say I would have liked that more. Just putting this out there for next time you guys form a band, and you want to put an underscore at the end. Ladies and gentlemen, wait a minute. John Kodera posted an update on PlayStation blog about the VR launch and the VR core pre-orders. So if you want to uh so it says update thanks to everyone for sharing their feedback on PlayStation VR pre-orders. It's clear that there's a lot of interest for many of you to secure the PlayStation VR core system, ah and I'm happy to share that we've decided to make it available for pre-order on Tuesday March 29th at 7:00 a.m. Pacific time at participating retailers. So to wrap it up here your pre-order options number one PlayStation VR launch bundle which includes",
            "start": 7442.44
        },
        {
            "text": "available for pre-order on Tuesday, March 29th at 7:00 a.m. Pacific Time at participating retailers so to wrap it up here your pre-order options number one PlayStation VR launch bundle which includes uh the and all this kind of **** the camera uh pre-order on March 22nd so after you listen to this 7: a.m. Pacific Time PlayStation VR core and that costs $500 PlayStation Core $400 pre-order on March 29th at 7 a.m. Pacific time um and it says if you're interested in owning PlayStation VR on one on day one Mark those calendars as we're expecting these units to sell out quickly so there's your the update I predicted in The Ropers report is now here there it is and I'd like to tell you this haha PlayStation every week you try to **** us by breaking news in Monday late afternoon into the evening when you know this Show's done so Scott Rogers you're listening your car right now **** you we got you son we **** nailed you on this one gotcha gotcha **** all right it's been a good show",
            "start": 7480.84
        },
        {
            "text": "when you know this Show's done so Scott Rogers you're listening in your car right now **** you we got you son we **** nailed you on this one gotcha gotcha **** all right it's been a good show goodbye ladies and gentlemen here is SE girl Shuhei Yoshida with with with whatever song you're getting depending on where you're watching until next time it's been our pleasure to serve you",
            "start": 7526.56
        }
    ]
}