{
    "id": 2079,
    "video_id": "nGpIfBXgM_s",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Do We Think Of Fan Made Games? - Kinda Funny Gamescast Ep. 87 (Pt. 4)",
    "description": "What do we think of fan made games?\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/gamescast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1475154005,
    "duration": 1436,
    "transcript_chunks": [
        {
            "text": "This episode of the Counter Funny Games Cast is brought to you by Dollar Shave Club. You don't need to choose between price and quality to get an amazing and affordable shave. Dollarshave Club.com's the answer to prove how amazing their shave really is. Right now, they're going to give you your first month free to join the club. Dollarshave Club.com delivers amazing razors right to your door for a third of the price of what the greedy razor corporations charge. Join the club just like I didn't stop dealing with the drugstore hassle and battle the locked up razor fortress ever again. I've been looking damn good, right, Kev? Yeah, Tim. Thanks, Kev. Just go to Dollar Shave Club and pick a razor from their lineup of amazing blades. I've been using the Executive Blade with their Dr. Carver shave butter. I've never used shave butter before, but I'll tell you what, it's good. It It's damn good. The blade just gently glides for the smoothest shave ever. See why over 3 million members love",
            "start": 0.08
        },
        {
            "text": "shave butter. I've never used shave butter before, but I'll tell you what, it's good. It It's damn good. The blade just gently glides for the smoothest shave ever. See why over 3 million members love Dollar Shave Club. They're so confident in the quality of all their products. Now, you can get your first month of the club for free. Just pay shipping. After that, just a few bucks a month. No long-term commitment, no hidden fees. Go to dollarshaveclub.com/gamescast. That's [Music] dollarshaveclub.com/gamescast. So topic four as always brought to you by you over in the kind of funny forums. You can go to kind of funny.comgamescasttopic and leave your topic just like all these people did. And by the way, this episode, yes, brought to you by Steven Eninsler. We hope you're alive, my dude. My dude. I can't believe there Patreon. Only he knows how an RP. One day I want to hear from him. I just want I just want to know if you're out there, Stephen Enler. Why Why don't you reach out? Just Just",
            "start": 35.44
        },
        {
            "text": "I can't believe there Patreon. Only he knows how an RP. One day I want to hear from him. I just want I just want to know if you're out there, Stephen Enler. Why Why don't you reach out? Just Just say hi. Just talk. Well, there are like there are definitely a few people that are just not paying attention to their credit card statements because I I did like a slew I think I did 27 thank you videos or something last month and then filmed them and then Kevin and I haven't very patiently filmed them and I edited them and put them up and you see like people watch them but there's like always one or two people that like no one's like paying attention and like one person in particular like like yeah Stephanie I'm like are you okay? like you've never we ask in the video, are you watching this? We never get a response. Geez, you got to look your credit card. We don't want that. We we we like to make money, but we don't want money un from people unaware that they're giving it to us. But if you",
            "start": 89.28
        },
        {
            "text": "never get a response. Geez, you got to look your credit card. We don't want that. We we we like to make money, but we don't want money un from people unaware that they're giving it to us. But if you do want to give money, patreon.com/counter. Yeah, we appreciate you, but I'd rather be honest about it. All right, this question comes from Cameron Abbott. He has a couple questions. Number one is Greg. Yeah. Are you still playing Gal Gun? No. Why not? I It's just got It's the same thing over and over again. I was like, \"This will be a fun playing game.\" And then I was playing with you guys for like an hour and a half and I was just like, \"You know what? No, I've I've tapped out on tapping on girls titties.\" Yeah. You'd think you never tap out on tapping on girls titties ever. Tapping on on Question number two also came. He says, \"Have you guys heard of Pokemon Uranium? It's not a ROM hack, but a complete game. What are your thoughts?\" Yes, I've heard of it. I have not played it. That's a",
            "start": 133.52
        },
        {
            "text": "number two also came. He says, \"Have you guys heard of Pokemon Uranium? It's not a ROM hack, but a complete game. What are your thoughts?\" Yes, I've heard of it. I have not played it. That's a whole interesting thing with, you know, Nintendo taking things down and all that stuff. And it's that's a complicated topic for another day. Where's Pokemon Snap? Who knows? Who knows, Greg? Um, the trash bin where it belongs. Whoa. Excuse me. I'm only kidding. Or am I? I don't know. We'll never know. Colin Morardi is aware. Remember the whole the advice earlier, Colin? The talk [ __ ] Good shot. We warned you. Who's going to shoot me? Pikachu. I don't know. Little little polygon Pikachu. You're not afraid of him. Good lord. All right. Will at PSN_Rainol says, \"Has Tim heard about the Crash Warped fan remake, Crash Time Twister? What do you think about fan remakes in general? So, these questions went kind of lumped together. I like it. I like what you're doing. So, Crash Time Twister I have",
            "start": 174.6
        },
        {
            "text": "fan remake, Crash Time Twister? What do you think about fan remakes in general? So, these questions went kind of lumped together. I like it. I like what you're doing. So, Crash Time Twister I have heard of. Um, I think it's interesting. I saw some videos of it. It has a problem that I have with pretty much every single 3D fan game and that it just doesn't look good and it doesn't play right and the characters are all kind of sliding around in a really weird way that just takes you out of it. Sure. And it's like you've seen a lot of Sonic games do this. A lot of like these people are trying to do something good, but it's like they're just they're lacking that the polish that's necessary for this [ __ ] to man. Yeah. They're amateurs. I mean, and I don't mean that in a bad way. You're an amateur. I'd be I' Jesus Christ. I wouldn't even know what the hell the first thing to do if I was making a game, you Now, having said that, when you you look at like kind of 2D fan games, um, or things",
            "start": 221.68
        },
        {
            "text": "I'd be I' Jesus Christ. I wouldn't even know what the hell the first thing to do if I was making a game, you Now, having said that, when you you look at like kind of 2D fan games, um, or things like Pokemon Uranium or whatever, I'm sure that's great. Like, I'm sure that that's fine because that people can, uh, kind of wrap their head around that. It's a lot simpler and it's a lot easier to use tools that already exist to um, pallet swap sprites or, you know, even create new sprites or do whatever that I think people can wrap their head around. And like 3D models are rough. Even in CG, like even in movies and stuff, unless you have top quality um VFX house working on stuff, CG looks kind of shitty. So imagine with a video game where you have to animate all of that and there's so much [ __ ] going on like that that's going to be a bad time. But uh in a 2D game, you're going to be you're going to be fine, right? And with this, I have actually a lot of experience with the ROM hacks um for",
            "start": 258.08
        },
        {
            "text": "going on like that that's going to be a bad time. But uh in a 2D game, you're going to be you're going to be fine, right? And with this, I have actually a lot of experience with the ROM hacks um for Pokemon games back in the day uh where they would ROM hack Ruby or Sapphire or whatever on the GBA or um more specifically Mario World of Mario World 2. I played through a whole bunch of like completed fan games that were just what now Mario Maker does where you can just create your own Mario levels, but they create these whole games that like actually had difficulty progressions and uh secrets and all these like different areas and stuff. And those are some of the best Mario games I ever played. There's one uh Super Mario World um Super Demo World is what it's called. And uh it it's up there, man. It's up there. It's better than I I think a lot of the the New Super Mario Bros. games for sure in terms of level design and complexity. And they're games that are designed to just be hard um",
            "start": 295.28
        },
        {
            "text": "man. It's up there. It's better than I I think a lot of the the New Super Mario Bros. games for sure in terms of level design and complexity. And they're games that are designed to just be hard um but still challenging and fun and um deserved in their difficulties where it's not just like there is the the [ __ ] just Super Mario like impossible things where it's like all right, that's not even fun. This is a game that is fun. And um I highly recommend it. I highly recommend looking into it. Uh Yoshi's Island had a bunch of ROM hacks that I got into and those are great and that's why the PSP is so good. Emulation, you can play all these ROM hacks. It's super easy to find. Have you guys ever done any fan games at all? Yeah, a few. Um the the most recent one uh or one of the most I guess it is the most recent one was the Street Fighter cross Mega Man game that Mega Man or Capcom basically co-opted because they forgot it was the 25th anniversary of Mega Man apparently. Um and they",
            "start": 336.0
        },
        {
            "text": "it is the most recent one was the Street Fighter cross Mega Man game that Mega Man or Capcom basically co-opted because they forgot it was the 25th anniversary of Mega Man apparently. Um and they released it officially and it was okay. It was like, you know, I I find a lot of these games and when I play a lot of them when I was a kid, it reminds me of RPG Maker games and stuff like that. Um, and even Fighter Maker, which was a game, um, a little halfbaked, like why bother, you know? Like, like it goes back to the idea of like the Metroid game that was just taken down recently, which was basically Metroid 2 kind of like reimagined. Um, I'm like, I appreciate it. I appreciate the thought and the effort that's put into this. I mean, there's a lot of talent put into this, a lot of, you know, time and that's great, but what do you expect is going to happen? Like especially if you do a Nintendo IP, what do you think is going to happen? Like you think they're just going to let that go? Like",
            "start": 375.36
        },
        {
            "text": "time and that's great, but what do you expect is going to happen? Like especially if you do a Nintendo IP, what do you think is going to happen? Like you think they're just going to let that go? Like that is their IP. And I do feel like some people get up in arms about like why are they taking these games down? It's like cuz this is like this confuses Joemo out there who doesn't [ __ ] know anything and he searches for Sonic. Pokemon Uranium. Yeah. Pokemon Uranium. It's like I I guarantee you there are [ __ ] people out there that thought or think that Pokemon Uranium is maybe real. Yeah. Like maybe a legit game and they you know like but it's not it's not it's not a Pokemon game. So um I like I like the spirit of it. It remind you you know there was a lot of that kind of stuff because it was really to go into like the hex I guess in like eight and 16 bit games it was somewhat easy to I don't want to say easy but like you can manage like moving things around. And I think that's how",
            "start": 409.68
        },
        {
            "text": "it was really to go into like the hex I guess in like eight and 16 bit games it was somewhat easy to I don't want to say easy but like you can manage like moving things around. And I think that's how those Mario games were made or whatever because it's it's all based on um like a cloud in Mario is basically just like a bunch of numbers, you know, and if you know if you put like H372 and then the next line 5532 or whatever, it makes a cloud like and so you figure that out and you put it's a little more complicated these days. And that's why like these 3D games you're talking about are just, you know, you need these talented people that know how to to do what they're doing. So I I think it's a cool scene, dude. More power to you. I'm not I don't I don't give a [ __ ] But um I feel like it's kind of wasted effort because I feel like a lot of these games get taken down or people get sued or it's legal action or at least threatened legal action taken down. Like that guy that worked on",
            "start": 444.88
        },
        {
            "text": "it's kind of wasted effort because I feel like a lot of these games get taken down or people get sued or it's legal action or at least threatened legal action taken down. Like that guy that worked on Metroid for all those years. It's like well what did you think was going to happen? What wouldn't your talents been better used like to make a real a new game? You clearly know what you're doing. So go make some money. I just think people have to kind of redirect those energies towards like their own IP. Yeah. Yeah. Know it's it's definitely interesting. I mean, well, when you look at a more uh professional level, I guess, and that's just because these are the games that made it, but you'd bring up the Street Fighter Mega Man thing, there's the Miss Pac-Man, obviously was just a hacked Pac-Man, and then Counter Strike coming from Halflife. Like, those are real big deals and just they started as fan games. So, yeah. And actually, I mean, you know, to your point, um, I believe Raven, um,",
            "start": 482.56
        },
        {
            "text": "and then Counter Strike coming from Halflife. Like, those are real big deals and just they started as fan games. So, yeah. And actually, I mean, you know, to your point, um, I believe Raven, um, which I think is still located in Wisconsin, which is an Activision studio, um, was founded and they're up there because that's where ID used to be around there somewhere. They were founded because they used to just hack ID games and like [ __ ] around with them and then they became a real studio, you know. So, um, yeah, there is, but that's a one ina million kind of thing, you know. uh where you know these guys might get noticed but more likely than not you're maybe not one in a million but one in a thousand or something but you're more likely than not you're wasting your time um but man I remember RPG Maker you use a what was it Gex drive or whatever they called it Gex drive and you can like transfer games online people used to go on game facts on the Gex drive uh list and then you could",
            "start": 512.8
        },
        {
            "text": "RPG Maker you use a what was it Gex drive or whatever they called it Gex drive and you can like transfer games online people used to go on game facts on the Gex drive uh list and then you could like upload your people went [ __ ] ham on those on those role playing games man RPG Maker was cool really cool idea anyway yes uh Andelius asks I'd love to see something on DSEX and this human X design thing going on. Thought it'd be cool for you to talk about that a little bit. You talking about open biotics and stuff. Oh yeah. No, it's awesome stuff. Um, so at Comic-Con this year, I hosted the panel that was uh DSX and what they're doing with open biotics and uh and I'm saying right why isn't saying biotics not bionics. Biotic I'm saying I'm asking you just make sure now that I'm saying it. Okay. Biotics. Yeah. Bionic is the fusion of like a man with a machine, right? And that's what that's what it is. So b Yeah, it's bionic. There's no T. It's an N. Not Bionic. Open Bionics. Yeah. Okay,",
            "start": 553.2
        },
        {
            "text": "Biotics. Yeah. Bionic is the fusion of like a man with a machine, right? And that's what that's what it is. So b Yeah, it's bionic. There's no T. It's an N. Not Bionic. Open Bionics. Yeah. Okay, we're all set. Good to make. That's what I was saying, right? Bionics. Well, you there was a T in there somewhere. I No, I was making sure I wasn't. Anyway, it's open bionics. Um, yeah. So the idea there is this really cool meetup of the open bionics people are basically open sourcing um appendages for people who don't have arms, don't have legs or whatever. And the idea is that I you know we were talking on this panel at Comic-Con at length or whatever. And if you were if you needed an artificial limb right now it's something egregious, right? They were saying it's really expensive and we're making it cheaper. You know ours are marketkedly cheaper. And I finally asked them like what does that mean? And like I guess right they were saying ballpark obviously these are all estimates it was",
            "start": 598.8
        },
        {
            "text": "making it cheaper. You know ours are marketkedly cheaper. And I finally asked them like what does that mean? And like I guess right they were saying ballpark obviously these are all estimates it was something between60 and $120,000 for uh an arm right something like that and the one they had made for this girl we were showing right who's this little girl who can use this now arm that's 3D printed that cost $5,000 and so they had already been doing this for a while open bionics making these different uh you know limbs for people uh trying to do this uh get and the reason it's open right is that it's open source so they're putting everything they have up online because they're just a small team. I think what was it? Five, I think they said five people. Five people. They're putting all their stuff out there so that other people at home can go in and tweak it, make it better, share it back to them. They can continue to share it. Um the fusion of this comes and they were, you know, during",
            "start": 643.04
        },
        {
            "text": "stuff out there so that other people at home can go in and tweak it, make it better, share it back to them. They can continue to share it. Um the fusion of this comes and they were, you know, during the panel both sides were like, we don't really know anymore. But basically, they were talking about it and somebody's like, well, this sounds a lot like DSX. And then they all started talking about it and how it became this thing of when the writers and designers working on human revolution it was very much like here's where we think you know human augments are going and artificial limbs and all this stuff where it's going in 20 years and in the time of starting that idea and working on what they were doing with human revolution technologies kept growing by leaps and bounds getting crazy to the fact that you get to dx mankind mankind divided they're getting ready to put out they had got to the point where these are now this is now happening. We're getting there to the point. And so they",
            "start": 682.48
        },
        {
            "text": "the fact that you get to dx mankind mankind divided they're getting ready to put out they had got to the point where these are now this is now happening. We're getting there to the point. And so they had this little girl who was awesome whose name is escaping me. Do you remember that? I don't remember. I want to say Tilly, but it is. All right. Tilly. And Till's been blown up now because they're going to like we during our San Diego Comic- Con panel, we talked about the fact that there was a Bionics uh panel coming or trade show coming up and all this stuff. She and then she was just at the White House with all this stuff showing what it is and whatever. Um Open Bionic starts talking to DSX who talks to them. They're going back forth about how they want to make these things cool, right? That since if we can 3D print these things, we can do it super cheap. Why not make them with style? Why not make them look cool and not just have them be a hideous hook or a giant, you know, robot arm",
            "start": 721.52
        },
        {
            "text": "since if we can 3D print these things, we can do it super cheap. Why not make them with style? Why not make them look cool and not just have them be a hideous hook or a giant, you know, robot arm that costs way too much? And so it was that the team at Idos started working with them and they on the panel was the artistic lead, right? who would basically sat there and designed the arm and the colors and what it should do and what it wouldn't do and then showed it to them and Bionics then makes that actually functional and how that's going to work and what it's going to be and that working with them then influences the game because they now see that like when you're having to do it in real life now well why would there be a screw there if it's not functional and taking that all out and stripping that down so that when you play Mankind Divided you are getting Adam Jensen the way that arm should look if it was going to be a prosthetic for somebody and put onto somebody and So the Comic-Con",
            "start": 759.76
        },
        {
            "text": "that down so that when you play Mankind Divided you are getting Adam Jensen the way that arm should look if it was going to be a prosthetic for somebody and put onto somebody and So the Comic-Con panel really felt like their first step out in terms of at least for me in terms of this is what we're doing. This is how we're doing it. And then yeah, now it has been this thing where it's getting all sorts of press because yeah, they were just the White House talking about it. And it's amazing to see, right? Cuz it's not implants. It's not and they definitely think they're going that direction when you talk to the open bionics people that they're going the direction of one day. Yes, it's going to be like mankind divide. It's going to be like the DSX universe where we can do that. But right now it is just sensors, you know, because uh what Till's arm I believe is just below the elbow gone. And so the muscles are still there. So they put sensors there and so she can sit there and flex it and",
            "start": 797.2
        },
        {
            "text": "it is just sensors, you know, because uh what Till's arm I believe is just below the elbow gone. And so the muscles are still there. So they put sensors there and so she can sit there and flex it and it was crazy. It was like it was this hand and she could pick things up like she was picking up balls and stuff and it's like it's unbelievable. I mean it's to the point that you know like you see I put up a photo at the Comic-Con panel with her and what she does is she always does the okay symbol and puts it over her eye and you know looks out and it's like that's the level of control she has where she can control it on a finger basis. You know what I mean? Yeah. No, it was it was very impressive. And going back to you were saying the the price of $60,000 like not only is the jump from $60,000 to $5,000 like a huge huge deal. Um that $60,000 this girl was like what 7 8 years old she's growing. So it's like that's $60,000 that you'd have to keep getting new arms like consistently new",
            "start": 833.12
        },
        {
            "text": "to $5,000 like a huge huge deal. Um that $60,000 this girl was like what 7 8 years old she's growing. So it's like that's $60,000 that you'd have to keep getting new arms like consistently new hands and whatever. So it's like the fact that they are getting to a point that this is a technology that is affordable. You know, you talk to Tilly about it. Like what she's excited about, right, is that one day it's going to be she opens her closet and there are 30 arms there and they're color their colors and she can put them on and whatever her outfit for the day is going to be, she has an arm that looks like that. That's awesome. She can buy a cool blue jacket and wear a cool blue arm. No, she'll buy a cool green jacket like that. I was going to say real quick, it's incred it's incredible that like that's really expens $60,000 $120,000 expensive. I would have thought it would even be more than that. Yeah. So, it's incredible that they're able to get it. Like if someone was like, you know,",
            "start": 867.2
        },
        {
            "text": "like that's really expens $60,000 $120,000 expensive. I would have thought it would even be more than that. Yeah. So, it's incredible that they're able to get it. Like if someone was like, you know, you you lose your leg and they're like, we'll replace your leg for $100,000. I'd be like, that seems like a steal, you know, like. So, it's incredible that they're able to get the technology down to this point and you do open sourcing, which I think is really smart, too, if you're interested. It's a very kind thing because a lot of these guys that know have the knowhow, by the way, to do this stuff, not to interrupt, like they can make a [ __ ] mint, man. And like the fact that like you don't do that says a lot about your character, I think. If you want to know more, jump over. It's openbionics.com or openbionics on Twitter. And opening up the technology by by the way like Google does with a lot of their stuff means that everyone riffs on it constantly and then and then you actually, you",
            "start": 902.96
        },
        {
            "text": "or openbionics on Twitter. And opening up the technology by by the way like Google does with a lot of their stuff means that everyone riffs on it constantly and then and then you actually, you know, you crowdsource it and you you peer review it and and it gets to better places quicker. So I think that that's really cool, too. Yeah. But I had no idea when I when I've seen these Bionic limbs and stuff like that, I honestly thought that these were $500,000 million. Like I'm sure some of the ones you've seen are they're talking about the low run one, the your base model. What is it going to be? It's incred. Just incredible that they can attach a machine to you and you can control it with your mind. It's nuts. It's absolutely absolutely [ __ ] insane. We're really close to the singularity. Joey Greyber says, \"What's the most useless controller button?\" I mean, I feel like it's obvious the select button. Oh, select button can straight go [ __ ] itself cuz when you look back at just the",
            "start": 939.6
        },
        {
            "text": "Joey Greyber says, \"What's the most useless controller button?\" I mean, I feel like it's obvious the select button. Oh, select button can straight go [ __ ] itself cuz when you look back at just the history of controllers, right? Let's go back to the NES controller. Sure. A B necessary. D-pad necessary. Start button necessary. Select necessary for some games. But why wasn't there just a C button then? Yeah, select was weird just in the sense that like a lot of early NES games you had to use select to like actually select uh where you're going. Then you hit start and you never use it again. I I I always I always found it interesting in hindsight that no one really used the select button more, you know, like um some did, but like Mega Man for instance. Uh not you know, I always talk about Mega Man people get mad, but I think it's a good example. You press start to go through the menu, but you can't pause the game out, right? Unless you're playing the original Mega Man, you can't do it.",
            "start": 977.52
        },
        {
            "text": "Man people get mad, but I think it's a good example. You press start to go through the menu, but you can't pause the game out, right? Unless you're playing the original Mega Man, you can't do it. So, um, why not always map actual pause to select for all of the Mega Man games or it was just this option that was there that no one used. I I almost feel like it's not the controller's fault. I feel like it's developers fault because there was just not enough for the games to do. Some games did use it, but um, in modernity, I would say that the, you know, on on both consoles, especially on PlayStation 4, I think they really basically got rid of it um, and made it the share button. share button, but then they replace it with another useless button, which is the the [ __ ] touchpad. Um, but at least the touchpad has more practical application. It doesn't need to be this massive thing on the controller. I don't know what the touchpad can be broken up into four useless buttons. It's true. So,",
            "start": 1020.0
        },
        {
            "text": "the touchpad has more practical application. It doesn't need to be this massive thing on the controller. I don't know what the touchpad can be broken up into four useless buttons. It's true. So, yeah, I would select is actually obvious the obvious choice I would say. Yeah. And in second place, one of the [ __ ] buttons on the Wii. Whenever you're playing with the Wii, there's always something where you'll be do I'll be doing a demo for it and they'll be using a nunchuck or whatever and they're like, \"Well, hit the ZC.\" Oh, there's a little small circular button on the Is it the on the nunchuck? There's the trigger and there's one up there. It's just like, what are we doing? Yeah. Well, [ __ ] you. Okay. [ __ ] select. I remember when I liked Wii at one point in my life. I mean, you were drinking the Kool-Aid hard in that one. I can't even like That just blows my mind. I didn't know you then. That must have been a whole different calling. Well, it's fresh off a Gamecube, which was",
            "start": 1054.32
        },
        {
            "text": "drinking the Kool-Aid hard in that one. I can't even like That just blows my mind. I didn't know you then. That must have been a whole different calling. Well, it's fresh off a Gamecube, which was fantastic. And uh we I was I really thought they were going to give us a new way to play. And I trust in Nintendo. I don't trust Nintendo anymore. That's just that's the only difference is that I was up in I was up DS's ass like it wasn't even [ __ ] funny. I played Gamecube and GBA and NES and S NS and 664. I mean, it was in Game Boy and Game Boy Pocket and Game Boy Color. I mean, they never let me down. And then and then it took me it took me a year to for me to really let you down. Yeah. It took me a solid year for me to accept that Wii sucked. Like I was really hanging on until like late 2007. All your third party games on it. Yeah. Oh yeah. Late 2007 was probably I was like I can't I can't actually do this anymore. What am I doing? Yeah. God, that's funny. Um, Steuart Fox says, \"Did you",
            "start": 1090.0
        },
        {
            "text": "All your third party games on it. Yeah. Oh yeah. Late 2007 was probably I was like I can't I can't actually do this anymore. What am I doing? Yeah. God, that's funny. Um, Steuart Fox says, \"Did you get on with Guitar Hero Live in the end?\" No. Uh, I had a lot of fun with it for I'd say maybe like two weeks. Uh, I think you and I remember talking about this with you where we each did we had it like not talking to each other. We both did it where we played like two or three weekends. Like I came home on a Saturday and just played with it a bit and it's it's super fun. It's just it's a a time and place situation where you know the rhythm games they are what they are. They had their fun especially the the ones with the instruments and you know Rock Band like and original Guitar Heroes like we understand what that is. So that's just a way that we play games now. So adding another gimmicky peripheral. It's kind of like it was fun and I I liked the challenge but I didn't I didn't feel the",
            "start": 1127.44
        },
        {
            "text": "we understand what that is. So that's just a way that we play games now. So adding another gimmicky peripheral. It's kind of like it was fun and I I liked the challenge but I didn't I didn't feel the need to dedicate as much time as it needed or deserved. I think that it was it was good enough to to deserve it, but it just didn't grab me to like I didn't want to. That's the thing like we talk about it, you know, where like Rockman 4 when they announced that and it was coming out, we all go like, \"Oh man, this is going to be fun. We're going to look for it.\" And call and I I'll never forget that day. I'm like, \"You want Rockband came like you want to play Rockband?\" You're like, \"Yeah, I do.\" We unplugged it and we're I unboxed it and plugged it all in and it's just a litany of like it's not sunk, right? This I'm like, \"Fuck this. We're done.\" And then like sitting down to play it at GameStop Expo, we played three songs and I was like, \"That was a lot of fun. I am no I am in no way in",
            "start": 1170.64
        },
        {
            "text": "sunk, right? This I'm like, \"Fuck this. We're done.\" And then like sitting down to play it at GameStop Expo, we played three songs and I was like, \"That was a lot of fun. I am no I am in no way in need of running out to buy Rock Band or play Rock Band when I got Well, so yeah, at GameStop we did uh it was Rockband and this Rock. No one [ __ ] knows the hell's happening. It's Rock Band Rivals is a new expansion for Rock Band 4, but it's New Instruments because they're no longer with Mad Yeah, they're no longer with Mad Cats now. Now they're with um Who the hell knows? [ __ ] I'll look that up. Some other company that's going to go out of business 80k or some [ __ ] like it was some weird letters I think. Okay, anyways, whatever. It was it was I [ __ ] on Mad Cats, by the way, but I actually thought it was a more shrewd move than it ended up being for them to do it again. I actually really thought that the the music genre could not not the way it was in 2006, 2007, 2008, but it could",
            "start": 1205.84
        },
        {
            "text": "thought it was a more shrewd move than it ended up being for them to do it again. I actually really thought that the the music genre could not not the way it was in 2006, 2007, 2008, but it could could have lived again. I was wrong about that. Boy, oh boy, was I wrong about that. Andrew Taylor aka Papa Drew Bear says, \"Do you guys think the launch of PSVR will be smooth or a mess in terms of launch titles and applications you can use with it?\" Smooth. Yeah, I feel like they they got a fair amount of stuff coming out like either at launch or you know throughout the rest of the year. The danger is in six months or a year. The danger is not at launch. Uh Sony very rarely launches with a weak library. I mean we even talked about you know I think the last time they launched with a like profoundly weak library was PS2. Um which the library had a lot of games but there was [ __ ] nothing there. I was like yeah Phantom Vision fantastic you know like Smugglers Run Summoner but a gun to my",
            "start": 1243.44
        },
        {
            "text": "weak library was PS2. Um which the library had a lot of games but there was [ __ ] nothing there. I was like yeah Phantom Vision fantastic you know like Smugglers Run Summoner but a gun to my [ __ ] head playing that game. Street Fighter EX2 or whatever. Madden. Um, so I think PlayStation 2 was really the last time there was a weak launch library. I think PS3 had a pretty smaller but a pretty they had like Resistance and Motortorm and stuff at a launch. It's not a bad way to go. Um, VA I think has the best launch library of any PlayStation platform ever. And I think PSP um had a pretty good launch, too. Uh, not nearly as bad as PS2's. And then PS4 was was good. It did have Luminous. Yeah. Um, so uh I think PSVR is going to have its library of games. you know what they are. It's going to be for you or not. I think the biggest danger is going to see how these games do and then the marketing research they get and the data they research the the data that they garner that will play out",
            "start": 1282.96
        },
        {
            "text": "be for you or not. I think the biggest danger is going to see how these games do and then the marketing research they get and the data they research the the data that they garner that will play out whether this works or not beyond uh 6 months or a year. Um I think it's going to I think it's going to be a slow burn and as I've said before I think that we're being small-minded in thinking about PlayStation VR just VR in general as a gaming application. Well, that's the problem I have with this. Well, not the the problem I have with the launch and what he's talking about his question, right? Gamewise, I think, yeah, if you're informed consumer and you're paying attention to this, yeah, you're getting games. They're going to be experiences. A lot of these are going to be small experiences. Let's not get crazy. But he mentions apps. And I think that's where Sony's missing the boat on this is that there's not going to be apps for it. You're not going to have it tied in. Like there's since",
            "start": 1325.6
        },
        {
            "text": "not get crazy. But he mentions apps. And I think that's where Sony's missing the boat on this is that there's not going to be apps for it. You're not going to have it tied in. Like there's since it's PlayStation, an app has to be, you know, native to it. It has to be ported over and brought over. And I don't think this, you know, when you see the fact of like, you know, on YouTube, you can use your VR headset to watch specific YouTube videos that way, that's not going to be there on PlayStation VR. And that's a huge miss. And there's so many little things like that that granted, it's hard to go down and find company X who is making these small virtual reality things, make them make the app in the hopes that they will be there in 6 months. You don't know, maybe they're going to get out of that technology as well. It would have been cool to see even a dedicated curated PlayStation video app service that hey we're bringing in PlayStation VR things to this thing approved people but they",
            "start": 1355.6
        },
        {
            "text": "that technology as well. It would have been cool to see even a dedicated curated PlayStation video app service that hey we're bringing in PlayStation VR things to this thing approved people but they didn't and that's where it's going to be where I that's my big concern when I talk about it and why I really think the fact people have to know what they're buying is they buy it and they just play their few experiences and then have to wait they're going to see that on the shelf all the time be like I wasted money doing that I don't use that enough da da da yeah ladies and gentlemen this has been the kind of funny games Thank you very much for joining us. As always, I appreciate you and your time. Colin, Greg, thank you for joining me. Thank you. This is a better looking jacket than your blue one. [ __ ] hate you.",
            "start": 1391.44
        }
    ]
}