{
    "id": 2069,
    "video_id": "q1Rp_22DFbU",
    "show_name": "Animated",
    "hosts": [
        "Nick Scarpino",
        "Kevin Coello",
        "Colin Moriarty",
        "Zacq Wenzel"
    ],
    "title": "Destroying Greg Miller's Awards - Kinda Funny Doodles",
    "description": "New episode of Kinda Funny Doodles every Friday!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nAnimated by Zacq Wenzel",
    "published_at": 1474649591,
    "duration": 66,
    "transcript_chunks": [
        {
            "text": "Colin: Now, I have an idea NicK: Yeah? Colin: No one tell anyone Nick: Ok Colin: No one tell Greg Nick: Okay Kevin: He's probably watching Nick: He's not, he's not Colin: He's definitely not Nick: He's definitely not watching Let's take all of his awards and just, and just hide them Or! I'm, I keep wanting to do a Viking funeral in the park Nick: Yeah Colin: Let's build it, and, you (Kevin), you're a builder. Let's build a small boat, what they call a Dingy Nick: Mm hmm (Kevin's beautiful laugh) Colin: and put it in one of the duck ponds Nick: Right Kevin: Sure, sure Colin: Put the, put them in there and I'll take a, like, a bow and arrow cause I'm a, I'm a pretty good archer Nick: You're a good archer, you Colin: And I'm gonna, we'll light it on fire and I'll fucking, we'll light those things up and we'll just see the, the trophies - - Option C! Nick: Yeah We sow it into Portillo like The Dark Knight Colin: Yeah, we could do that we can melt this down, make bullets out of it Nick: We",
            "start": 0.2
        },
        {
            "text": "up and we'll just see the, the trophies - - Option C! Nick: Yeah We sow it into Portillo like The Dark Knight Colin: Yeah, we could do that we can melt this down, make bullets out of it Nick: We could Colin: That, we can use in the zombie apocalypse But, wouldn't it be ironic if Greg turned into a zombie and Kevin had to use a bullet cast, from his own award to put him down Nick: That's dramatic irony, right there Colin: How do you feel about that Kevin? Kevin: We're going somewhere really dark Let's just walk away, Colin: Why?! Kevin: While we're still, ya know, happy Colin: We're going where the show is taking us!",
            "start": 32.7
        }
    ]
}