{
  "id": 1210,
  "video_id": "-AjxGqF8JQ0",
  "show_name": "Gameplay",
  "hosts": ["Greg Miller", "Tim Gettys"],
  "title": "Super Mario Maker: We Play Your Levels - Kinda Funny Plays",
  "description": "You've been posting your Super Mario Maker levels on kindafunny.com/forums, so we thought we'd play them for the world to see.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1442856601,
  "duration": 1898,
  "transcript_chunks": [
    {
      "text": "What's up guys, welcome to Kinda Funny Games. I'm Tim Gettys, this is Greg Miller, what play all this video game guy, one half of the coolest dudes in video recipe circles. Yes, I also remembered that Daniel Dreyer is the third member of that. I didn't know that. Yeah, I was here. No, you were. We did a Game Cast up. So now I wasn't with him later. You were. I was here. I died. So what we're doing today is we're playing Mario Maker. We are, which I'm really excited. We are excited. We're doing something really cool, right? The the best friends out there over the Kinda Funny forums, kindafunny.com/forums. They they they made some Mario Maker levels. What's cool is that I yeah, so ever I was like we we I fell in love with Mario Maker over the weekend and came out of Friday. We started funny. We're having a great time then over on the Kinda Funny forms, calm/kindafunny forms, kindafunny.com/forums. We did so well the first time they went up and they started everybody's like I'm making",
      "start": 0.03
    },
    {
      "text": "great time then over on the Kinda Funny forms, calm/kindafunny forms, kindafunny.com/forums. We did so well the first time they went up and they started everybody's like I'm making this love when they put them all there and then I was like lightbulb, let's and do a let's play for the Kinda Funny best friends where we play their levels. Yeah, so we're gonna start with 17 Jed level. He started this thread, 17 dread. You you get to play this one. Okay, so you got a choice. You can do Jen's Ghost House, Ghost House in Super Mario World style, definitely more of a puzzle level, doesn't change platforming very much, some tough enemies. Jen's Castle, castle level, Mario Super Mario World style, plenty of doors and pipes like my last one, a good mix of everything and not too difficult. SMB 1-1 question mark, original Super Mario Brothers level design in Super Mario World stock, a couple of hidden secrets here. SMB that one. Alright, I like that one. Now I want to see what the secrets are. I want to",
      "start": 40.8
    },
    {
      "text": "mark original Super Mario Brothers level design in Super Mario World stock, a couple of hidden secrets here. SMB that one. Alright, I like that one. Now I want to see what the secrets are. I want to find him. Okay, cuz I am what they would call a kind of seer of Mario. Mario, you are, you sure are. That's exactly what they call you, the connoisseur. It's your type of dinosaur. I know that's not no no no, it's not the pterodactyl and it's not the T-Rex. Alright, the other 117 Jade, we're coming for you. We're searching for your course. Okay, jump in there. There he is. Never played with this controller. You won't play this one. I only buy exclusively played this. Yeah, this feels fine. It then oh this would be my controller. That's your controller. Alright, I am also drinking half of a Coke cabinet. Alright, so you want to play it? I like that you don't need to download them. You can just play it. It's really cool. He did a lot right. Big fan of Super Mario here we go. Look how cute this also I didn't talk about this one.",
      "start": 82.59
    },
    {
      "text": "to play it? I like that you don't need to download them. You can just play it. It's really cool. He did a lot right. Big fan of Super Mario here we go. Look how cute this also I didn't talk about this one like this one. Yes, when we did the yesterday on Games Cast, we talked a lot about this game and I didn't talk about how crazy it is to see Mario in widescreen. Oh, do you know Don am I right is nothing what's weird to is like the top it still looks like Mario one like the time in lots of it's not the Mario World classic with the extra item on the top. Yeah, okay, so I got the secret here. Yeah, and it's also weird being able to go back in this level. Mmm-hmm. Oh, see this is all different jet 17 jet said to me secrets all it's not all different watch out me internal that's different. Alright, so hmm will you do I don't know how do you do big boy hoping are you looking for secrets? Yeah, just throw it out there and all those things make all sorts of crazy crap but then like I need to do it up",
      "start": 122.13
    },
    {
      "text": "hmm will you do I don't know how do you do big boy hoping are you looking for secrets? Yeah, just throw it out there and all those things make all sorts of crazy crap but then like I need to do it up there a bit more. Well you can go through there to do this stuff but is this what 17 jet intended? 17 jet let us know I'm Kinda Funny that comes on forms it's Abidjan dammit I messed up. Alright, whatever we're moving on. Super Mario World is the best of style. I'm gonna start it is I mean just making sure Ronson and I think it's the best style not only graphically and stuff. Okay, here's some your student this ain't normal they say this ain't no Mario Bros there's ain't no Mario Bros. I like it best for the physics oh god I missed I'm talking but anyways the physics of Mario World are best. I like the skidding I like the jump arc and I like that you can go back now that I know what's coming I'm glad that this is happening what I'm saying to you yeah I like mine what can I say I know you",
      "start": 182.29
    },
    {
      "text": "I like the skidding I like the jump arc and I like that you can go back now that I know what's coming I'm glad that this is happening what I'm saying to you yeah I like mine what can I say I know you want to beat me on the inner see here's somewhere that's weird that I don't understand about Mario Maker at least the creation part that should've been a fire flower like right for Mario one physician does the game not know that if you're big the next thing should be I mean I think it would have been yet he put in it but he put in a mushroom rather than a fire flower. I wonder if there's like Jen what's shaking or something well wouldn't it be that if you were small and you ain't gonna go the opposite so I'm either small and you put in you put in a fire flower in your smoke video well yeah but you see I'm saying I think he's only putting in mushrooms he's not putting in anything else **** go you can kill the turtle man are you right he **** that man turtleman Zala I just want that fire",
      "start": 244.54
    },
    {
      "text": "you see I'm saying I think he's only putting in mushrooms he's not putting in anything else **** go you can kill the turtle man are you right he **** that man turtleman Zala I just want that fire so bad wonderful spear it plus he's invulnerable to fire since he spits fire that's not how that works you don't know anyone Mario all right I would say definitely yeah Oh what oh he just got the Wang you see that red it's one tiny spaghetti it was gonna fall oh that's great first off they're pretty clearly SpaghettiOs and even then they're undeniably doughnuts they made their first or not right on the donut Plains they round dad doughnuts out round either yeah they are idiot long johns aren't really what the books along gets a donuts out with no ball donut available lowers some call me old-fashioned a maple bar I wouldn't have maple on Long John yeah Oh God hey spaghetti look at they even look like SpaghettiOs now and sauce now what's an ayat' try to deny it see this doesn't look like a",
      "start": 292.57
    },
    {
      "text": "a maple bar I wouldn't have maple on Long John yeah Oh God hey spaghetti look at they even look like SpaghettiOs now and sauce now what's an ayat' try to deny it see this doesn't look like a spaghetti Odie tripped me out here Greg what is just **** fall on that figure now now I'm gonna follow that but a second go anything in the ding-ding this is some of 17 Jensen secrets Yosh the Yoshimura blush as I said it's the lifetime of a Yoshi my life oh let's go we're just super I'm where there's one design in Super Mario style couples kiddin secrets of course we all remember this from the original Mario Brothers yeah Yoshi the dumb SpaghettiOs yeah they aren't doughnuts and I don't care what Shigeru Miyamoto trying to tell you all right man **** I beat you you know what up see I'm really sad about this Greg listen it needs that whoa or oh yeah okay but that's just cuz you anymore anyone I know it's upsetting we're gonna star it we're gonna leave the comment that's your prize oh",
      "start": 344.83
    },
    {
      "text": "about this Greg listen it needs that whoa or oh yeah okay but that's just cuz you anymore anyone I know it's upsetting we're gonna star it we're gonna leave the comment that's your prize oh yeah you know it doesn't show the Commons gonna be me ah Oh toe all right yeah I didn't spell it right that's a joke general get it when you go play Jed's level you'll know of course you go to Kinda Funny icon slash forums get the code and all that stuff and like I put it up we're moving now it's my turn to play mm-hmm I'm jumping into the Arctic Sloths level. Arctic saw we know him well oh we want to want very much one of the best friends we see him all the time mm-hmm so here we go do this do this four nine four one two three one two one right and B D Mario Maker thank you yes fill the time for moose before 8p okay I think we could download them all that would have been smaller than waste water whatever Franklin sighs let's see how he describes the size more one-to-one the",
      "start": 397.47
    },
    {
      "text": "fill the time for moose before 8p okay I think we could download them all that would have been smaller than waste water whatever Franklin sighs let's see how he describes the size more one-to-one the Arctic Slaw says tried it and kind of got confused I made more straightforward level Sizemore one one made in the new Super Mario style utilizes wall jumps often with hazards on the other side first level I created and they'll get better as I along Ronald all right Franklin Arctic's like Oliver Twist usually so it only has a percent success rate like that this could be the rest let's play it took me forever dude rockers hate him when they put didn't put that bad guy right there did you ever think you'd see a Mario game that's this pretty looking it's growing up I never did but did you ever really think about it did I mean I thought Mario World was amazing okay I definitely pointing at them yeah okay I got it symptom like yeah that's the opposite way yeah but I'm saying I have",
      "start": 477.58
    },
    {
      "text": "you ever really think about it did I mean I thought Mario World was amazing okay I definitely pointing at them yeah okay I got it symptom like yeah that's the opposite way yeah but I'm saying I have to be pointing at the one all right that's all I asked you said yes that's all well I'm never a fan of in these levels while you put the coins in there why didn't put the 1ups in there you know I mean I guess but I mean it just doesn't build anything anymore yeah but one of something that anything in a Mario game its ID so it's a technique I'm not super familiar with it anymore yeah long time since I Walter see I thought I should have had that Oh God can a brother get a mushroom yep hell yeah yeah and it's gotta be boom boom see you Mushroom Kingdom Oh God I'm not a fan of the this the springs I never can understand how to like when to jump yeah yeah there was that when I was doing Drucker's level on Christine stream it's **** all streams all day long yeah I mean",
      "start": 531.39
    },
    {
      "text": "of the this the springs I never can understand how to like when to jump yeah yeah there was that when I was doing Drucker's level on Christine stream it's **** all streams all day long yeah I mean and it's like yeah alright like cuz the problem is just yeah when am I supposed to do what am I not supposed to do you know yeah oh man Sizemore you turd burglar turd burglar stealing people he's out there just burgling turds all day he shouldn't do that guys dude to feel good but he's in and then I go they're gonna do the old butt stop oh yeah poop is Mario goddamnit watching other people play Mario's infuriating it's not even that it's just you want to do something then it doesn't happen and then you get upset come on I don't even blame **** happens man those Springs unpredictable no I thought I had that guy's a **** fat head under me I got cocky I should've waited for the you know be awesome if called when I said gue before Halloween yeah what would be awesome is what we all did",
      "start": 621.29
    },
    {
      "text": "thought I had that guy's a **** fat head under me I got cocky I should've waited for the you know be awesome if called when I said gue before Halloween yeah what would be awesome is what we all did just like a you know group costume we all people we were all people from the Mushroom Kingdom oh god I want to beaverton over you Berta yeah I guess you could why wouldn't why why why I mean I don't know I feel like I get to throw things at people yeah they're gonna be pretty in pink yeah you are pretty pretty pink but otherwise I don't know if you're qualified what do mean spittin eggs yeah I've never seen you spit of egg in your life you see me spit a lot it's true I rarely swallow you yeah so you won't be oh she do I don't want to I don't want anybody riding me I guess Kevin's the smallest among us so he's gotta be Mario and I definitely don't like him right away oh really piece of trash what is it visibility Oh God frames all right let's see it got packaged let's turn it be give me",
      "start": 687.39
    },
    {
      "text": "among us so he's gotta be Mario and I definitely don't like him right away oh really piece of trash what is it visibility Oh God frames all right let's see it got packaged let's turn it be give me address side now or is it no that's the origin of where I got shipped from Mother of God what the hell how do we keep getting Super Mario Maker be a super Morgan I come to this house that's really funny don't get me wrong keep sending them but yeah weird oh I hate when they do that the old bouncy bounce you know yeah I feeling from buffering slow good I like it better designed them you plate how many how many and the other levels even playing a lot you can just jump him to the diddly and then really be just a big fan oh I am I can't stop it it's that stupid oh that was Shady that's cheap **** Frank get your head out your ass so your cool piece Oh Jim whoa Dr. Disability Oh **** skill necessary damn it Mario game I have 69 coins ah of course you did",
      "start": 738.42
    },
    {
      "text": "that's cheap **** Frank get your head out your ass so your cool piece Oh Jim whoa Dr. Disability Oh **** skill necessary damn it Mario game I have 69 coins ah of course you did star won't even comment all right so here's we got Jr. V's next well I made a few levels myself all of them are pretty simple I think came out pretty well first one this is simply a quick movement stage as a few of these stages are the golden move and jump and avoid I hope the advanced this is I get more tools to use second the idea of this stage is a rather simple version of a stage from an old Kirby game just of course play is way differently and with a couple of changes can place Kirby was just four let's do that okay Kirby the curb stop the curb stops that we call me so Nick calls him every place him in Smash Bros um extra lives as levels calling me machines we own classic Mario one my least favorite of the physics bless you I'm allergic Kirby thank you see here's the",
      "start": 828.06
    },
    {
      "text": "him every place him in Smash Bros um extra lives as levels calling me machines we own classic Mario one my least favorite of the physics bless you I'm allergic Kirby thank you see here's the problem with these other designs yeah they **** with you like I feel like her vegan yeah you know that was my foot when I was playing the Metroid levels I was like oh and I can just shoot these things without no community yeah I was playing on mark oh god it was nice I was playing the Mario Kart levels and they made me feel like I could just keep lava the only thought sure actually was go fast another cool gameplay thing that I think's being overlooked is the fact that these are legal things totally throw off they break the game in a lot of ways because you have the power of a big Mario but you're only taking up a small minor space so you can go in the like you could break that block right now and you know other Mario thing did you do that oh Lord look scary you know he's getting",
      "start": 922.92
    },
    {
      "text": "only taking up a small minor space so you can go in the like you could break that block right now and you know other Mario thing did you do that oh Lord look scary you know he's getting the one-up that's why this level called that yeah yeah that's good yeah wow you you use this too far noise music never heard a plane the only Kirby game ever played is Epic Yarn how's that - I don't think so well it's the music when he wins in Smash Bros don't think I've never seen Kirby win a match in Smash Brothers cuz he sucks oh you know I'm saying terrible Oh any blows I got it alright you ready for another one I want some challenge Greg okay I'm reading through who's got the challenges here cuz the internet needs to hate on me for something okay here you go okay Taz gamer has something for your ass - has game it's called noose you my brother's you think just do it you said this was released for everything I thought oh these years the least favorite physics oh you know what no new super",
      "start": 986.98
    },
    {
      "text": "your ass - has game it's called noose you my brother's you think just do it you said this was released for everything I thought oh these years the least favorite physics oh you know what no new super nose is my least favorite really yeah Colin will see me watching me plate came in when I was playing the other day he's like this is my Maker is it oh my god is it I didn't know they had this skimmer go call your he's adorable you're like kind of like how you know mean animals are adorable let's just saw you is alright here you go this is Taz gamer new Super Mario Brother level just do it take whichever one you want this level is a mishmash of different ideas I had and has some challenging parts well challenging for me at least Todd's gamer well there you go I knew what's gonna happen okay oh yeah that didn't happen did the spin the air give you more juice did I spend you did spend a little of course during here nothing what is that what is that no if it actually gives me anything they",
      "start": 1057.86
    },
    {
      "text": "oh yeah that didn't happen did the spin the air give you more juice did I spend you did spend a little of course during here nothing what is that what is that no if it actually gives me anything they display their don't do it you that's it Bobby not I'll do it I'm only doing hit the button okay I'm doing it too early let me try almost all right let's just take turns okay doing the old switch off switch a rug I like that we didn't play with two controllers I need you now you do need it I don't even do it I've never seen this what are you doing you crazy dinosaur Isis bought stuff that's the problem of Yoshi's two Super Mario World you can shoot eggs using the other triggers like you see I don't know about levels like this well you can't see this is a blind just isn't good designer bling yeah if it's gonna be a blind job there should be a like the coin coins or something let me know there's a door in there so I'm assuming I'm just gonna jump straight down okay see",
      "start": 1103.61
    },
    {
      "text": "good designer bling yeah if it's gonna be a blind job there should be a like the coin coins or something let me know there's a door in there so I'm assuming I'm just gonna jump straight down okay see that's just me like it's not challenging it's neat macho so I hit I had to hit the Zr here yeah you jump and then yep I'm suing me you're gonna have to jump off and then how do I need to do the Yoshi side I don't you bought me a few of the same things you just did to do or not you didn't need to he's dead though so he got what's coming to him so this is yeah death right there's nothing down there yeah that's the problem a lot of creators are just being mean here's this level that's like even here right okay you soon oh my jump over that and everything's all kosher but will it be kosher Oh God this is not gonna be fun for everybody oh come on you piece of garbage the woods I don't like that Greg who did this again one **** made this have me Taz gamer you son of a **** Taz",
      "start": 1181.64
    },
    {
      "text": "kosher Oh God this is not gonna be fun for everybody oh come on you piece of garbage the woods I don't like that Greg who did this again one **** made this have me Taz gamer you son of a **** Taz neighbor oh I think you need to Yoshi for those things cuz the issues yeah oh we got an idea it's called grow plants for oxygen so we don't die in the Mushroom Kingdom because chlorophyll is what gives us oxygen from plants we don't want to die in one oxygen Bowser don't kill us ho then you step on that to make those coins there you go there you go Timmy oh **** Timmy Oh oh **** same **** since it man JR V not pulling any punches on this one yeah I could have done that I should just kept running I didn't realize those things we went on with my head did you know that you oh she can do that kind of life anyway all of the money yeah did you know she's a new one not in the world though so that's why the physics I'm happy they made the decision to change the physics for each game",
      "start": 1242.69
    },
    {
      "text": "do that kind of life anyway all of the money yeah did you know she's a new one not in the world though so that's why the physics I'm happy they made the decision to change the physics for each game because originally they're all going to be the exact same thing and I think it's really cool that people are now going to design around the different types of games although it does kind of suck that you can't just switch between dollar styles for any level you want did you vanish yeah I did it looks like there's a way to keep them though there's a spring over there don't throw everything or if you use place something we have nice things for reason oh god no piece of **** **** yeah okay okay no gamer don't we don't want to yell at Tasmania someone else needs a girl I did that I did that didn't I I bumped that thing no doing it when you get another show I think that's on me Taz gamer you piece of **** **** you touch fuzzy Assyrians touch fuzzy ear wonder what they do for that",
      "start": 1339.0
    },
    {
      "text": "I I bumped that thing no doing it when you get another show I think that's on me Taz gamer you piece of **** **** you touch fuzzy Assyrians touch fuzzy ear wonder what they do for that do you know what touch fuzzy is no it's a reference to the seventh level in Super Mario World to where there's these fuzzy things that we touch them Wow drug induced frenzy oh **** I was trying to get cute and it messed me up now that I know I can how I got hit though that their involvement at the fall starts the premature end clean Oh God great you crazy son of a boss because I don't remember what to do I just don't **** around Oh Lord yeah that's stupid being screwed stupid I see but here's the thing though like I mean I'm with you this isn't the most well-designed level yeah but I don't think that that's such a problem because it's not like this is a whole game there is the point this level if that is part of the puzzle and that's what I was kind of trying to say yesterday where this",
      "start": 1401.35
    },
    {
      "text": "that that's such a problem because it's not like this is a whole game there is the point this level if that is part of the puzzle and that's what I was kind of trying to say yesterday where this isn't about making Mario games it's making Mario levels sure it is very trial and error is that spring there you think that's what possibly get there well that's what **** me earlier you can jumped off and tried it I'm not going back with how I sure don't know finish the **** level shove it up Taz gamers ass they come to our house do this to us your date your for your flirt new things yep damn son I was at myself oh one more shot this is it do or die otherwise we'll go into the Kinda Funny forums and we will ban ties to be fair that was totally a me problem because the box has his level was fine there don't really but you love it here's you sick **** jump there you go jump there you go boom oh and you did the little leg dance thing I love that **** it's a celebration I like this it's",
      "start": 1516.88
    },
    {
      "text": "there don't really but you love it here's you sick **** jump there you go jump there you go boom oh and you did the little leg dance thing I love that **** it's a celebration I like this it's his celebration of you getting to his totally unfair level it's something that isn't make Walternate over kill you all right how would you start spitting out turtle shells here then there's like gosh cooling zone you'd say yes good job to Todd's gamer you've been vanquished as gamer like Tim Gettys difference' Mario player ever and now I'm going to give you a test from touch fuzzy this will be your final exam for this less fuzzy it is less fun okay fish fodder is where you're going my newest level are you my newest level and first crack at an underwater stage I'm quite pleased with how this one turned out underwater cannons have been loaded with fish can you navigate your way through played with some fun ideas and have multiple paths you can take if you hold on your power-ups this",
      "start": 1602.2
    },
    {
      "text": "this one turned out underwater cannons have been loaded with fish. Can you navigate your way through? Played with some fun ideas and have multiple paths you can take if you hold on your power-ups. This sounds horrible. I'll start it. Let me start. I hate underwater. Why don't get an order? They got a best soundtrack, yeah, but their controls are garbage. There's like, I don't know why they keep doing them. They should just stop. There's everybody dig son touch fuzzy named Kevin. Wait, touch fuzzy is the creator's name? Yes. Oh, well, I thought it was the level's name. I'm sorry. I just told you this fish fodder. Yes, enough this guy's with Canada. You guys name was fish father. Oh my god, that's a lot less fun. Thank you for the mushroom right away. It's helpful. Now how would you know to change canon? You almost fish food saying if you're a me bhai or you could well you know what buddy stuff it up your butt you know I like I like the linking mark was really disturbing looking it's so disturbing",
      "start": 1679.53
    },
    {
      "text": "fish food saying if you're a me bhai or you could well you know what buddy stuff it up your butt you know I like I like the linking mark was really disturbing looking it's so disturbing looking oh I see that I don't even blame to dude you know you only do doe again cuz I was **** we learned something why I hold sad sometimes because life gets too hard for him so theoretically ashes with interesting interesting oh my god this isn't that bad though one of the challenge levels I played had way too many fish give Greg Naumann no you're fine you're doing great I'm saying this isn't I thought this was gonna be way more like that county level yeah I'm bullying hell but for fish aren't **** around oh **** you okay good I was worried that's it yeah he might stop there I want to stop there but want to keep playing okay so we're gonna do another Mario Maker let's play for tomorrow okay so you should come back we're gonna play more of your levels and it's gonna be",
      "start": 1739.77
    },
    {
      "text": "I want to stop there but want to keep playing okay so we're gonna do another Mario Maker let's play for tomorrow okay so you should come back we're gonna play more of your levels and it's gonna be really fun just like this always yeah fish father was good yeah just play on slide those fish are yeah you've been Starcom haven't thanked you all right come back to Fox here yep subscribe to youtube.com/kindafunnygames right here somewhere there'll be a thing that says subscribe you should click it I don't know where it will be I'm saying all of these fish all these fish dem fish doh alright see you tomorrow guys bye thank you for the levels bring me a half glass cuz I'd like half of his coke bring two half glasses two cokes yes",
      "start": 1837.25
    }
  ]
}
