{
    "id": 1235,
    "video_id": "-l8H3qdIUjI",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Why You Need To Play Lego Dimensions - Kinda Funny Gamescast Ep. 38 (Pt. 2)",
    "description": "Greg Miller pitches us on how awesome Lego Dimensions is.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1443531600,
    "duration": 980,
    "transcript_chunks": [
        {
            "text": "today's sponsor Loot Crate for less than $0 a month. Loot Crate gives the geek in you a special treat every month. Loot Crate's a subscription box service with over $40 worth of geek, gamer, and pop culture gear, collectibles, apparel, comics, and more delivered to your mailbox every month. This month's theme is time, quite appropriately timed with the uh 30th Anniversary Back to the Future in the month and year Marty McFly travels to in Back to the Future Part Two, the timeless appeal of Bill and Ted's Excellent Adventure, and the timey-wimey charm of Doctor Who. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate, and when the cutoff happens, that's it, it's over. So go to LootCrate.com/KFAM and enter code KFAM to save $3 on your new subscription today. So Greg, hi, you have been playing a lot of that Lego Dimensions. I wish I, I got to stream one day of it here and I have been jonesing like a heroin addict for more. Sorry, I hear heroin's addictive, Kevin, not that I would know.",
            "start": 0.0
        },
        {
            "text": "playing a lot of that Lego Dimensions. I wish I, I got to stream one day of it here and I have been jonesing like a heroin addict for more. Sorry, I hear heroin's addictive, Kevin, not that I would know. Kevin, heroin, Kevin. Okay, so you really, you really want to play more of this game, and I think this is one of those games that a lot of people aren't necessarily looking forward to. They got, see trailers for, they see stuff and they're like, oh, that's cool, I'm never going to play that. I don't even think people are looking at the trailer saying they're cool, 'cause like the, the, my story with Lego Dimensions goes that it got announced right with like the teaser art and everything, and Colin Greg Live was on and we were like, oh, this Lego Dimensions thing, it's toys-to-life like we expected. And Colin was like, Greg, you going to get it? And I was like, no man, not unless they put Superman or Ghostbusters into it. And the chat was like, they tease Ghostbusters at the end of it and Superman's in the trailer. I was like,",
            "start": 43.52
        },
        {
            "text": "you going to get it? And I was like, no man, not unless they put Superman or Ghostbusters into it. And the chat was like, they tease Ghostbusters at the end of it and Superman's in the trailer. I was like, ****, all right, so I'm buying this game now, you know what I mean? But like, I was, I was buying it like on the sea of like, well, I like TT Games, I trust them. I don't know what I'm getting though. I don't understand what the gameplay is. Is it going to be like Skylanders? Is it going to be like Disney Infinity when I'm running around doing action RPG things or whatever? And then at Comic-Con this year was the first time I actually played it. Went there to the Doctor Who event where they revealed all those characters, sat down and played it, and it all clicked. And I was like, oh, it's just a Lego game with toys. Okay, go get Port, go get him, you lazy ****. Uh, it's just a Lego game with the toys you put on the thing, you know what I mean? So it's already the Lego gameplay that I, I know that I love, right, of",
            "start": 86.64
        },
        {
            "text": "okay, go get Port, go get him, you lazy ****. Uh, it's just a Lego game with the toys you put on the thing, you know what I mean? So it's already the Lego gameplay that I, I know that I love, right, of collecting, brick building, picking up stuff, you know, seeing how they all interact together. Stop, you're being bad. It's UPS, we like them, they bring us toys. Um, and then yeah, they came through this past week for Twitch, or they came here, Twitch.tv/KindaFunnyGames. I brought it in, sat down, let me play it, switch out the figures, play it from the beginning. And yeah, like I'm 1,000% sold on it now and wanted more. But what I was saying is like my progression of slowly getting excited for it, you saw it in the chat that day where I started it, I put it down, you know, we have the portal, we have the second camera on all the toys and stuff, and people just go them, people aren't uh into it at all in the beginning. And then when they started doing it, that's when they all started freaking out in the comments like,",
            "start": 117.44
        },
        {
            "text": "on all the toys and stuff and people just go them, people aren't uh into it at all in the beginning. And then when they started doing it, that's when they all started freaking out in the comments like, oh my wallet, oh my God, I can't. Yeah, you know what I mean? Like, I'm going to buy all these things, why are you doing this to me? It's like, once you see that game in action, I think you understand what it is and why it's so amazing. Mhm. So what, what are the, I haven't even seen the figures, right? What are they? Take a little Lego guy and you put them on a little stand and that's all it is. And then you take that and you put that into the game and they drop into the game and you have them in their own powers in a world. Is it just the figures or is it also like, like cars and ****? It's also cars and stuff. So like the, like the brilliance of this game is this weird hybrid of it's going to be the games, the Lego games, you know, and then the Lego toys, you know, and what I thought was really smart about it and took",
            "start": 157.92
        },
        {
            "text": "the like the brilliance of this game is this weird hybrid of it's going to be the games, the Lego games, you know, and then the Lego toys, you know, and what I thought was really smart about it and took me back for a second, then I thought, well, that's actually really cool, is the fact that like when you get the starter pack, right, you get the pack, it's got the game in it, obviously, it's got the three guys in there, um, Gandalf from Lord of the Rings, you might know, Batman, and then Wildstyle. And then it's got, you know, you've seen the portal, the whole thing. You get it, you open the box, game, three guys, and then all the bricks to make the portal, but no instructions. So then you put the game in, you go in the story, they go, okay, blah, blah, and the story pulls them all together, they realize what's happening, and somebody's like, why, I think we can build this portal, let's do it. And then the instruction manual pops up on the screen, so you have to stop, you put down the controller and start building the",
            "start": 193.16
        },
        {
            "text": "and somebody's like, why, I think we can build this portal, let's do it. And then the instruction manual pops up on the screen, so you have to stop, you put down the controller and start building the Legos there on your thing. And then you page through it on the screen to do that. That sounds **** awesome. It sounds gimmicky and stupid, but awesome. And I know it sounds gimmicky and stupid, I, I totally understand. I need you to believe me that it's not super gimmicky, you know what I mean? It actually is them trying thing. But I want to do that. I mean, I love Legos. It's like, this is like the one thing where it's like, oh, do this thing in real life. It's like, oh man, I need to build Legos. Oh no, exact **** awesome. And then so then you do all that, right? And then it's like, you, I think the Batmobile comes with it. I'm pretty sure, don't quote me on that, 'cause they have vehicles and all sorts of stuff. But for instance, you buy the uh Back to the Future level pack, right? And it's Marty who has his little guitar,",
            "start": 229.96
        },
        {
            "text": "it, I'm pretty sure, don't quote me on that, 'cause they have vehicles and all sorts of stuff. But for instance, you buy the uh Back to the Future level pack, right? And it's Marty who has his little guitar and then it's the DeLorean. I think you had a Flux Capacitor too. But same deal, you open it up and you have Marty there, you probably have to put his head on, his hair on and stuff, it's obvious. But then you have the DeLorean parts there, and so you put Marty on the thing and it's like, okay, you're bringing Marty into the world, you also need to build this car. And so then it pops up and you do that and you build it and you put it there and then it registers to whatever you have like the loose vehicle tag, you put it on there, you put it there, it registers it all to the thing or whatever. But then throughout the game, like every vehicle has three different mo, like versions, right? And so then it's like, you can rebuild them if you want to, you don't have to, whatever. And that's the same thing with this, if you're in",
            "start": 267.92
        },
        {
            "text": "like every vehicle has three different, like versions, right? And so then it's like, you can rebuild them if you want to, you don't have to, whatever. And that's the same thing with this, if you're in a hurry for time or whatever and you want to build it later, you can skip out, you don't have to build a DeLorean right now if you don't want to build a DeLorean. Like they, for me, coming into it and actually sitting down and playing it, I had a bunch of like, here's where I think this could get **** up and not be a great game, you know what I mean? And in the thing, they went through and knocked every one of them out. And I, and I was, I was telling them, you know, these are my concerns on the stream, and Jonathan from TT Games, his response was, I kept getting amazed by this, that and the like, it, it, it was like, you know, we're switching people in and out and it wasn't until we switched in Marty and then switched out Batman and put in Homer from The Simpsons that I, I was, I finally noticed as a Lego fan, right?",
            "start": 302.2
        },
        {
            "text": "you know, we're switching people in and out and it wasn't until we switched in Marty and then switched out Batman and put in Homer from The Simpsons that I, I was, I finally noticed as a Lego fan, right, that like their HUD was different every time. So like Wildstyle's hearts were like normal Lego hearts. Homer's hearts were donuts. Uh yeah, you, Marty's hearts, I think were, they might have just been hearts or they were, but it had the Back to the Future orange to yellow text font for everything. Everybody had that font. Like Simpsons' font was Simpsons' font. And I was like, I can't believe this. And Jonathan from TT Games turns me, he's like, I know, it's almost as if we care, you know what I mean? And it was like, well, damn, yeah. But like, I've seen so many not phoned in things like, because that sounds bad, but like when we've talked before about like, what's, what's the future of these toys-to-life games? How many can they be? And when Lego Dimensions got announced, right, Colin always makes the point that",
            "start": 338.04
        },
        {
            "text": "like when we've talked before about like, what's, what's the future of these toys-to-life games? How many can they be? And when Lego Dimensions got announced, right, Colin always makes the point that parents only have so much money. So if you're a Skylanders kid, you're a Skylanders kid. And if you're a Disney Infinity kid, you're a Disney Infinity kid. And what does that mean for Lego Dimensions? And for me, and this is based on probably two hours total of playing this game at events and then having them in the house or whatever, to me, Lego Dimensions is the adult game of it, you know what I mean? Not that the content's adult at all, it's a Lego game, so I can play with you and we can have fun or your little cousin can come over and play with you and, you know, you have fun or whatever. But I mean, I think that's something going for it that the other games don't have, exact like Disney Infinity and Skylanders. And this, that, this is why I think I was so impressed with it, is the fact that I came in",
            "start": 377.52
        },
        {
            "text": "I think that's something going for it that the other games don't have, exact like Disney Infinity and Skylanders. And this, that, this is why I think I was so impressed with it, is the fact that I came in expecting them to say the wrong thing. Like I, the other thing I threw at them was like, so how do level packs work? Because, you know, you buy the figures and they come with their own world and stuff. Like they come with basically DLC in there that you go and play their world and do their adventure. And I'm like, is it going to, like, I'm like, I love your games, don't get me wrong, and I, I do love your DLC, but your DLC for Lego Batman, right? Like Lego Batman 3's DLC, like Arrow's DLC is one map, you walk in, you do everything and it's over. It's like, you know, 5, 10 minutes probably, and you come back to get all the trophies and you spend maybe 20 minutes with it, right? And I'm like, am I buying a $30 toy and then a $5 level? And he's like, no, let me show you. And he put down the Back to the Future, we went into",
            "start": 413.48
        },
        {
            "text": "the trophies and you spend maybe 20 minutes with it, right? And I'm like, am I buying a $30 toy and then a $5 level? And he's like, no, let me show you. And he put down the Back to the Future, we went into the Back to the Future world, right? And it starts off and you're in, you know, Doc's uh uh apartment lab or whatever. You have to build the speaker and you're doing all this different stuff. And you go to the Twin Pines Mall and you do all these things. And then you go to, you know, Hill Valley Town Square with the courthouse there and everything else, right? The Clock Tower. And you know, it's 1985. And then over here, if you get in the DeLorean and drive it over here, you can travel through time and you can go to 2015 and it's the future Back to the Future Town Square. And if you've earned enough Lego studs, you can go and spend them over here to activate the Jaws like 3D thing to have it going. And it's like, oh, and like hoverboards are there. And it's like, yeah, and then you go back and you drop and you go",
            "start": 450.48
        },
        {
            "text": "you can go and spend them over here to activate the Jaws like 3D thing to have it going. And it's like, oh, and like hoverboards are there. And it's like, yeah, and then you go back and you drop and you go back to 1885, you know what I mean? And it's like, he's doing that for the trophies. I will. But it was like, he's like, no, we're not, we're not, you know, giving you crappy DLC. We're giving you guys what you want out of these. We're not like phoning it in or anything like that. So, you know, we talk about games being platforms all the time. We even just talking about that a second ago in the last topic. But do you see this as kind of the future of Lego games or do you think Lego games are going to exist next to these? I think if this hits, it'll be the death of the regular Lego game over time. I don't, I mean, you figure right now already Lego Marvel Avengers is still on the slate for January now. So it's not like it's over, don't get me wrong. And the we, so I think if it hits, they'll slowly",
            "start": 488.04
        },
        {
            "text": "you figure right now already Lego Marvel Avengers is still on the slate for January now. So it's not like it's over, don't get me wrong. And the we, so I think if it hits, they'll slowly start peeling back teams and being like, sure, we could do this or you guys could make a Harry Potter World for this game, you know what I mean? And we'd sell bajillion units. Like, okay, yeah, sure, why not? If it doesn't, they keep marching that direction. But the bigger question there is, do Lego games continue in the way we know them alongside Lego Dimensions for the people that can't come to Lego Dimensions? You imagine, and now granted, I'm the guy who said you'll never see Marvel in a Lego game, 'cause you know, Warner Bros. owns DC and why would they have Marvel Lego games? And then they started making them. But right now, Disney owns Marvel. Why would Disney license out Marvel characters to the Lego game that is competing with Disney Infinity that has all the, you know what I mean? Like, that's the weird",
            "start": 525.12
        },
        {
            "text": "but right now, Disney owns Marvel. Why would Disney license out Marvel characters to the Lego game that is competing with Disney Infinity that has all the, you know what I mean? Like, that's the weird. Lego Star Wars was such a big deal. I mean, Lego kind of just kind makes their own rules. And we, I remember back to talk, Break The Rules. No, that they're slogans, break rules. They should have said brick rules. That would have been good. Like, how much bricks come up in the last couple days? Anyways, thanks. It's crazy how Lego's the licensing thing, they just do whatever the hell they want. Like, how the **** do they get Back to the Future, Superman, and Simpsons and all these things in one game? And it's like, how soon until we see or how far until we see Ninja Turtles, right? You know, no, and that's, that's the thing. And that's what I was talking to them about. And like the fact that like, 'cause somebody in the chat had said the same thing, he's like, well, they're going to have a hard time getting non-WB properties in.",
            "start": 566.96
        },
        {
            "text": "and that's what I was talking to them about. And like the fact that like, 'cause somebody in the chat had said the same thing, he's like, well, they're going to have a hard time getting non-WB properties in there. And the guy, like the Jonathan stopped the stream, like, what are you talking about? Like, sure, Superman, Wonder Woman are WB properties, but Simpsons are Fox, Back to the Future's Universal, this is that, you know what I mean? He's like, there's all these different things. And I was like, yeah, so why? And he's like, well, everybody wants to be a Lego. Like everybody get, like Lego's already a phenomenon, you know what I mean? Like, that's the thing. You don't have to worry about it being a competitor because it's been around forever. So yeah, when do they get back to the Teenage Mutant Ninja Turtles in there? When do they get Walking Dead in there? When do they, you know what I mean? When do they start doing the really goofy stuff? Like, I don't know, but I'm super fascinated to watch this. They're saying all the right",
            "start": 607.88
        },
        {
            "text": "they get Walking Dead in there? When do they, you know what I mean? When do they start doing the really goofy stuff? Like, I don't know, but I'm super fascinated to watch this. They're saying all the right things in the same way too of uh like the platform, right? They're like, this is our platform, this is our platform for the next three years or whatever. Don't worry about it. Like, we're not going to release Lego Dimensions 2.0 and make you buy a new platform. Like, you have it, that's it. I just get figures for it. Yeah, that's cool. You know what I mean? Like the level packs are a cool idea. Like what also is cool is the fact that they're doing stuff that aren't already Legos like Portal. Yeah, right? The, and that's the big thing, right, of like when you start opening up the Lego Universe to games like that, that's when it gets really exciting of like, how are you going to pull in? Like, I think adult gamers have never had a problem picking up the Lego games. Like when I'm like, oh, I spent 40 hours platinuming",
            "start": 638.36
        },
        {
            "text": "when it gets really exciting of like, how are you going to pull in? Like, I think adult gamers have never had a problem picking up the Lego games. Like when I'm like, oh, I spent 40 hours platinuming Lego Batman, everybody's like, oh, that's funny, that's cool. But nobody's like, what, you play Lego games? Those are for babies. Like people get what the games are because there is so much fan service layered on top of like just fun gameplay that you can pick up or you can get crazy with and try to find all the red bricks and collect every gold brick and do all these different things. And so yeah, if they can totally open it up where it's like, yeah, we have Portal. So now why don't we get Red Dead? Why don't we go get this? Why don't we get Uncharted? You know what I mean? Like, bring all these things in that get Master Chief. Bringing all these games people love already. I think they're going to get Master Chief. You know, Mega Bloks, uh ****, I can't wait for Mega Bloks to make a game. Mega Bloks Master Chief",
            "start": 672.32
        },
        {
            "text": "Master Chief bringing all these games people love already. I think they're going to get Master Chief. You know, Mega Bloks, uh ****, I can't wait for Mega Bloks to make a game. Mega Bloks Master Chief Adventures. No, so that was the thing is like, yeah, I got to play for that thing that uh that day and that was like the day that I kind of was like, all right, Metal Gear feels like work 'cause I'm going to take a break on this platinum thing and start playing other things just getting ready for Lego Dimensions. Yeah, 'cause once that gets here, I'm going to build it on this table and stream at the playing that damn thing. Okay, going back to that, you were talking about like building the cars and stuff. Are they like uh toned down versions of like scaled down versions of the cars or is it like an actual Lego set? I mean, it's like, it's like this, it's tiny, the basic version. Yeah, yeah, yeah. Okay, that's cool. Yeah, there's a lot of pieces to them, not a lot, but there's pieces to them that I don't think I, I would be able",
            "start": 705.84
        },
        {
            "text": "it's like, it's like this, it's tiny, the basic version. Yeah, yeah, yeah. Okay, that's cool. Yeah, there's a lot of pieces to them, not a lot, but there's pieces to them that I don't think I, I would be able to assemble on just like, here's a pile of Lego blocks, make the DeLorean. I couldn't do that probably. But it's not overbearing at the same time. No, 'cause I, I think they're very well aware that you are playing a video game, you'd like to get back to the video game. You don't have to sit there like, so I mean, do you think this is a game that could work without the toy aspect of it? Like, do you think that they'll, you could just buy the the DLC packs or whatever or do you need, is, is the toys essentially the DLC? Toys are essentially the DLC. Yeah, the whole, that's the whole shtick to the thing, just like every other toys-to-life game, you know what I mean? Like, and that's, could it work if there were no toys involved? Of course, 'cause they already do those and their Lego games and they're awesome. But the hook is",
            "start": 745.56
        },
        {
            "text": "other toys-to-life game, you know what I mean? Like, and that's, could it work if there were no toys involved? Of course, 'cause they already do those and their Lego games and they're awesome. But the hook is now having the cool toys and it is this like cool weird voting thing, right, of like, I, I, I was on a toys-to-life podcast the other day where I was explaining like, there had to be rules for me to getting into this. I can't just, I'm not going to buy everything because they have like Ninjago and whatever and I'm like, I don't know what that is and I don't want that and I'm not going to buy it. They're so cool. Seen the guys on the podcast said you'd be in Ninjago. That's so, there's so, have, have you guys seen this ****? No, that they're **** awesome. I mean, remember the Lego like ninjas you liked when you were younger? These are them but mixed with Power Rangers and they're ****. Am I mixing it up with the other things, the Chima, right? What's the other one? The, there's one, there's no resistance place set.",
            "start": 780.12
        },
        {
            "text": "younger, these are them but mixed with Power Rangers and they're ****. Am I mixing it up with the other things, the Chima, right? What's the other one? The, there's one, there's no resistance place set, one that's like, they're like Eagle people. Yeah, okay. But there's one like Lego, Lego Chima or something. I don't know. Can you, there's two different things that we always see when we go to Target 'cause we're grown ass men. Um, but they're like Power Rangers and they have these like crazy ass like Eagle outfit. That's cool. But my thing is like, I, I wanted to be picky and choosy about it and it's, I'm failing on every, every level 'cause I was like, Portal, of course. Yeah, DC Comics layout. I want Superman and Wonder Woman. And then I found out Superman was wave like three or whatever. I was like, well, Cyborg is wave one. So I'll, I'll take Cyborg. Just they got you. And I, Back to the Future, Marty comes with a hoverboard. Doc comes with the train. And I'm like, well, I'm going to get Marty and the hoverboard. And then I saw a",
            "start": 815.68
        },
        {
            "text": "so I'll, I'll take Cyborg. Just they got you. And I, Back to the Future, Marty comes with a hoverboard. Doc comes with the train. And I'm like, well, I'm going to get Marty and the hoverboard. And then I saw a Doc in the game. Like, now I'm buying a Doc too, you know what I mean? Like, and then I, I had no intention of buying Homer. I saw Homer. I want to play in Simpsons. I want to go to, I want to go to Springfield and do all this different stuff. And then eventually what's going to happen is they're going to pin me down where I'm sure that every one of these play sets will have DLC trophies attached to them. And then I'm going to look at my completion percentage and be like, well, now I need Ninjago. I got it. I might as well get that third bronze. God help us to if like Nintendo does something like this with Pokemon. That's the thing, man. I mean, like once, once that **** starts making actual gameplay sense and that's why I think this is good is that it's working backwards. Let's make a good game and let's have",
            "start": 854.28
        },
        {
            "text": "that's the thing, man. I mean, like once, once that **** starts making actual gameplay sense and that's why I think this is good is that it's working backwards. Let's make a good game and let's have these things just be ways to access the game that's already, already good. And on top of that, let's make it fun in real life. It's **** Legos. That's great. Amiibos are just **** Amiibos. And like back to, and like what we're talking about like them doing it right is the fact that it's like, all right, so, you know, I don't know if you've seen any of the clips. I don't mean to shred, you know, well, own territory. Uh, you, how there's like two Batmans, right? Lego, The Batman Lego Movie had Will Arnett as Batman, but it was like '89 Batman. And I remember being like, Troy Baker's Lego Batman. And so now they have the Lego Batman video game version, Troy Baker Lego Batman. And then they have Will Arnett '89 Batman. They, they're all doing their voices. Elizabeth Banks is there doing her voice for Wildstyle. Chris Pratt",
            "start": 889.32
        },
        {
            "text": "Batman video game version Troy Baker Lego Batman and then they have Will Arnett '89 Batman they they're all doing their voices Elizabeth Banks is there doing her voice for Wyldstyle Chris Pratt is there doing his voice as the dude from Lego Movie who I don't remember the name of and the dude from Lego Jurassic World they got Michael J. Fox and Christopher Lloyd to come back and make their characters you know be their characters it's like hell yeah I want to play this game and I want you to keep making every one of these figures everyone one of these worlds that's **** awesome damn that's so legit I'm sold it's a lot of money yeah yeah it's a lot of money that's why there has to be rules is the music there too or oh yeah oh no that was the thing too I forgot about this nobody cares in when you when you're in in 1985 and you're going around how Power of Love is playing as you just go around the house Square goodness that that is great so it's called the Chima is what we're talking",
            "start": 928.0
        },
        {
            "text": "when you when you're in in 1985 and you're going around how Power of Love is playing as you just go around the house Square goodness that that is great so it's called the Chima is what we're talking about",
            "start": 964.56
        }
    ]
}