{
    "id": 1165,
    "video_id": "3e2-_LUrRGg",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Kristine Steimer"
    ],
    "title": "Getting the Girlfriend to Love Metal Gear Solid V: The Phantom Pain - Kinda Funny Plays",
    "description": "Greg wants to show Kristine Steimer why he loves Metal Gear Solid V. Will she fall in love? With the game. She already loves him.\n\nSubscribe to Kinda Funny Games! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nSubscribe to Kristine! https://www.youtube.com/user/kristinesteimer?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1441220401,
    "duration": 2398,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to another Let's Play here on youtube.com/KindaFunnyGames. I'm Greg and this is my girlfriend Kristine Steimer from SR.com. Hey, how are you? I'm good. How are you? Good. Uh, you haven't been home in a long time and then I went to PAX, but while you were gone, I got Metal Gear Solid V: The Phantom Pain. Yes, I knew. And I played the balls off of it. I know. I was glad that I was gone for Jesus right off of this thing. And so now you're here and I've tried for a while while we were at PAX. I didn't bring the game so it actually do work. I thought we'd actually go through and play it right now. You could see why it's amazing and then you'd understand why you have to play as well. Well, let's not get ahead of ourselves. All right. Well, okay. As you see right here, see if I even, 'cause I watched you play, uh, Ground Zeroes, mhm, but you were, you were just screwing around in it so I kept being like, this doesn't sound fun at all. Like what you were doing when you were just goofing around, 'cause",
            "start": 0.08
        },
        {
            "text": "You play, uh, Ground Zeroes, mhm, but you were, you were just screwing around in it so I kept being like, this doesn't sound fun at all. Like what you were doing when you were just goofing around, 'cause you just kept getting caught and you kept get, I was just like, yeah, I was, you know, trying to break it, see what's going on and stuff like that. Yeah, you weren't having that. No, I was just like, this game sounds dumb. And you were like, no, no, no, no, I'm not actually trying to play it. I was like, okay, right, right, right. Yeah, I wasn't doing it the way it's meant to be played, kind of thing. No, no, no. So what do you want to know? What do you want to see? How do you want this all to work? I want to pet the fox. How do I pet the fox? Oh, you mean a DD? It's not a dog. Uh, it is. That's that on the screen. That was not a dog. Oh, you're actually, you're talking my R1's broken on this controller. Look at it. It keeps, it doesn't come back up, but if I hit like that, it sticks. Oh, that, yeah, so you got to, Lord Almighty, it's",
            "start": 34.68
        },
        {
            "text": "Dog. Oh, you're actually, you're talking my R1's broken on this controller. Look at it. It keeps, it doesn't come back up, but if I hit like that, it sticks. Oh, that, yeah, so you got to, Lord Almighty, it's never easy. It's never easy to be Greg Miller. You got a sticky button. All right, so I've played more than 60 hours and what do you want to do? I want to look at the fox that you keep putting a menu up over his face. Look at him. Oh, DD. Yeah, it's not a dog. But no, his name's DG and see in the thing, he's my, he's my Diamond Dog. I, I, my God, he's so cute, baby. Wait till you see him as a puppy. That's when it really, I'm sure you saw the fox puppy. Well, no, okay, so the, here's why, look, Fox, 'cause I once you, you get to a certain point, oh, by the way, by the way, everybody watching these videos, sorry, this is me 60 hours into the game. A lot of people on the internet watched me do a bunch of Let's Plays last week. They were me starting playing the game. They like, you suck the game. Now a real spoilers about the dog.",
            "start": 76.44
        },
        {
            "text": "Hours into the game. A lot of people on the internet watched me do a bunch of Let's Plays last week. They were me starting playing the game. They like, you suck the game. Now a real spoilers about the dog. Exactly. I was learning to play back then. This no, these are legitimate spoilers for 60 hours in. If you don't know anything, get out of here. So no, what basically is, you eventually can customize DD, right? So when you go in there, you get to make him look however you want, do all this. By default, like this is how he starts off looking. Oh, so he's like a wolf. And so this is why for me, I was like, what are you talking about? What are you talking about? You know what I mean? This is how he starts off looking. Oh my God, he's still really cute. I mean, he start, and when I say starts off, I mean he does start as a puppy, right? He's a very little hor dog. Come with an eye patch from day one. No, he's got, he comes with a bad eye from day one. He's seen some stuff out in the field, some real ****, as they would say. And",
            "start": 118.88
        },
        {
            "text": "Right, he's a very little hor dog. Come with an eye patch from day one. No, he's got, he comes with a bad eye from day one. He's seen some stuff out in the field, some real ****, as they would say. And so yeah, that's why he's there. So eventually though, when you get to be badass after playing forever, you get to go through and you can make him look however you want him to look. That's cute. So like, is that enough now to make you play? 'Cause you, you can walk through, you can have, you have ghost. No, but kind of like the other one, the two are the, this one, I like this actually. I like the other one too. I like all, I just, I want this dog. Like this dog in, I like this dog and I like him in all forms. What do you want him to look like today? Let's go with dark today. This one? Yeah. All right, cool. You want the eye patch or you want the artificial eye? See, that's, that's when he's got the herd eye. I don't like that. And then he's got, I artificial eye. Artificial eye. Let's make him look normal-ish. Okay, cool. What you know,",
            "start": 155.16
        },
        {
            "text": "Or you want the artificial eye? See, that's, that's when he's got the herd eye. I don't like that. And then he's got, I artificial eye. Artificial eye. Let's make him look normal-ish. Okay, cool. What you know, you're familiar with this Quiet character, right? Yeah, I am, sort of. I just, I mean, just with her body. Exactly. Not really with her mind. Okay, Soul. Um, you can screw around with how she looks too. Do you want to do that? Can you screw around with everybody? Not everybody. I mean, like, you know, your horse and stuff. Like you go through, you get these options. Like you, you, I mean, that's how you start screwing around with him and stuff. You, oh my gosh, he's got severe face armor on there. Yeah, well, I'm, I'm in, I'm in some, I'm in the **** out there a lot, baby. Like this isn't, oh, where'd he go? Bye. Nothing. It's just like, now it's going to screw around all this different, show you different colors. Can we be, you could be this. No, no, I do like a Black Stallion. Keep going. Now this thing, Black Stallion. Let's go Black",
            "start": 190.52
        },
        {
            "text": "Like now it's going to screw around all this different, show you different colors. Can we be, you could be this. No, no, I do like a Black Stallion. Keep going. Now this thing, Black Stallion. Let's go Black Stallion. Black Stallion. Now chances are you won't even see this, by the way. That's fine. Oh, look, I didn't know you get do, oh, you can make him have the little stripy poo. What do you want? All black like my soul. Whoa, doctor. Anything with the legs? You want to scream? Uh, give him tiny boots. These ones? You can have tiny white boots. Tiny white boots. Okay, cool. Sure. Jump. So, okay, so those are the animals that you can cut. Right? Then you were saying you can, why is that go, it looked like if you look at it from a different angle, looks like the gun's pointing right at his head. It does. And I customized that gun to be black and white, 'cause I went, you like Oreo cookies? No, well, no, well, yeah, I do. That's not really why though. What I did is I made this Team Fat logo. See, ever seen the Team Fat logo? Since that's white",
            "start": 229.64
        },
        {
            "text": "Be black and white, 'cause I went, you like Oreo cookies? No, well, no, well, yeah, I do. That's not really why though. What I did is I made this Team Fat logo. See, ever seen the Team Fat logo? Since that's white and black and black and white, I was like, I want the Team Fat logo to match my guns and everything that's happening over here. Okay, okay, done that. I'm done with that. I got a bunch of rewards here. I got to accept all these people, 'cause I've been sending them out. You know, I come over, you do that plants. Yeah, you go, they run a plant gathering mission. It's, it's needed. But then I go to combat deployment and see where I want to send people. So it's like Dragon Age: Inquisition where you send people on missions or it's like Metal Gear Peace Walker. But yeah, yeah, I never played that. So, well, I never played Dragon Age: Inquisition and it sounds like they ripped off Metal Gear Peace Walker. So there you go. Sounds like that's really, I'm sure they wouldn't care. M. Night Shyamalan hasn't had an original idea in 14 years. You",
            "start": 276.28
        },
        {
            "text": "Age: Inquisition and it sounds like they ripped off Metal Gear Peace Walker. So there you go. Sounds like that's really, I'm sure they wouldn't care. M. Night Shyamalan hasn't had an original idea in 14 years. You don't talk **** about M. Night Shyamalan. You love M. Night Shyamalan. Don't worry about it. He's a great guy. Uh, yeah, so that's that. So I mean, is some of the dick around, you got these cassette tapes to listen to. Spoilers in here, but we won't listen to them. So we going to, oh, look at the puppy. I just, I'm going to play this game for the dog. Done. So all right, then how about this then? We'll go out and we'll, let's, I, let me show you the puppy in action. How about that? So we'll do a side up. I think I have plenty of people still to collect and stuff. Yeah, here we're going after highly skilled Soldier number 10. Right? Number 10. We're going to start over here. We start over here. There's a chance they might see us. We'll see you and then you get everything will get **** immediately. Yeah, everything would get **** immediately.",
            "start": 311.56
        },
        {
            "text": "10. We're going to start over here. We start over here. There's a chance they might see us. We'll see you and then you get everything will get **** immediately. Yeah, everything would get **** immediately. Get ****, boy. Play some of this stuff. You can see I'm running with my, you know, silenced, uh, knockout stuff. I got my knockout pistol, ZZZ Pistol. Yep, yep, yep. The Sleepy Pistol. Yep. I got my Sleepy Sniper and then a damaged Rifle. Right? Yeah, the, the rifle is only for things when, when they go really wrong. DD. Oh, you have a fake arm. I have him. Yeah, well, he loses his arm there. Yeah. Uh, you got, you got DD. You, he could be just straight up naked if you want. I mean, he's more vulnerable if something goes on. No, put some, no, give him some armor. Give the, give the some armor. Cool. He can stun guys with us in the suit. So he can, he can knock people out for us. He's a very helpful DD. Um, well, Shadow, no. So now you Shadow, no. Oh, what? Oh, nothing. Well, no, no, don't worry about it. I could get into some spoiler",
            "start": 350.52
        },
        {
            "text": "Suit so he can, he can knock people out for us. He's a very helpful DD. Um, well, Shadow, no. So now you Shadow, no. Oh, what? Oh, nothing. Well, no, no, don't worry about it. I could get into some spoiler stuff there. Oh, okay. Yeah, I didn't expect something to see be seen there. Whatever. No big deal. Um, and then do you want to play, you want me to play as Big Boss? I got this bandana. I got to say, which is pretty cool. Yeah, and my sneaking suit, which is pretty cool. But I can play as the other people who are in my, in my infantry. I've been running a lot as Flaming Buffalo Mosquito. He just has a stupid name. Yeah, do you want, I mean, and I've been running out a lot of Flaming Buffalo, 'cause I've seen so much of Snake Buffalo. What are these names? They're just code names. Okay. You can put her in different things too. Feel like I wouldn't pick the name Flaming Buffalo for my, oh my God, she should be Flaming Cheetah. Is, is there a Buffalo print in there? Is there? No, there's not a Buffalo print, babe. That doesn't make",
            "start": 390.32
        },
        {
            "text": "Feel like I wouldn't pick the name Flaming Buffalo for my, oh my God, she should be Flaming Cheetah. Is, is there a Buffalo print in there? Is there? No, there's not a Buffalo print, babe. That doesn't make sense. I can't tell if these sirens are in my headphones or real life. They're in real life. Somebody out there is getting, getting, but their head split in a sec. Golden Tiger. But I know how you like customization. I know it's a big part play games. Those are pretty ugly. But the sneaking suit's where it's at. Yeah, sneaking suit's classic. Looks good. Do you even want to be, should I be, oh, well, go, you only showed me the girl. Well, what then? I just get a random ass green to ranchel. Go Goin' Worm. Jesus Christ, names are amazing. Komodo Dragon Jackal. Is she the only chick? Uh, I, I'm not ready to confirm her D. She might be the only, she might be the only, the only chick on my combat team. And I believe I'd only be able to deploy combat team. Pouncing Hawk. That's not how Hawks work. All right. Um, see, just, just a bunch of",
            "start": 440.04
        },
        {
            "text": "Be the only, she might be the only, the only chick on my combat team. And I believe I'd only be able to deploy combat team. Pouncing Hawk. That's not how Hawks work. All right. Um, see, just, just a bunch of generic ass dudes. There's a Vengeful Hippo. Death Rooster. Sure. Looks like Stone Cold Steve Austin. Oh, he sure does. This, this guy looks like Winston from Ghostbusters. Yes. Razor Hedgehog. So wait, why don't you play as Sonic? Razor Hedgehog. 'Cause he's just some dude. Look at him. I know. But his name, just play Snake or whatever Big Boss or whoever the guy is. Yeah, it's Big Boss Snake. I don't know the whole Metal Gear with the different peoples and all that. Right? But no, no, it's that's the whole thing is that Big Boss is Snake. Don't worry about it. And Snake is Snake. It's when you boil it down. Is, is it, is it Liquid Snake? Is it Solid Snake? Is it Solid Snake? Is it Diamond Snake? Is it Naked Snake? Is it now Punished Snake? Is there a Diamond Snake? 'Cause there should be a Diamond Snake. Yeah, memory serves. I don't",
            "start": 483.76
        },
        {
            "text": "Liquid Snake? Is it Solid Snake? Is it Solid Snake? Is it Diamond Snake? Is it Naked Snake? Is it now Punished Snake? Is there a Diamond Snake? 'Cause there should be a Diamond Snake. Yeah, memory serves. I don't think there's a Diamond Snake yet. But I wouldn't put him past him without his Diamond Dog. So here we're deploying. Let's go. You want to go out it in daytime or night time? A lot of people hate night vision. I learned that the hard way with these Let's Plays. Okay, well, let's do, do to him daytime. Daytime. I'm more, it's more, you know, likely they might see me. I understand. I understand. I haven't played either. I got to shake off from PAX rust. Here we're of course supposed to play this on the GameSpot live stream. Robert Peeler from these Let's Plays. He couldn't get there. Stuck in traffic. Oh, so instead, where did he stay that he needed to drive? I think he landed at the airport and it was like, I got to get to PAX. All right, so here's how every mission opens, Kristine. You come in. It opens like the if",
            "start": 525.84
        },
        {
            "text": "Where did he stay that he needed to drive? I think he landed at the airport and it was like, I got to get to PAX. All right, so here's how every mission opens, Kristine. You come in. It opens like the, if it was a story mission, there'd be credits rolling telling you who's guest starring all these different things. That hair not. Yeah, that's he's, oh, oh my God. Then we go first person for a little bit and look at how cute this dog is. Yeah, see me, Christ, so cute. You got to go watch the Let's Play with the puppy. I'm here youtube.com/KindaFunnyGames. Most likely. Yeah, probably. Well, yeah, I don't know where else you're seeing this. Some bootleg site. Somebody's telling me over in China they rip YouTube videos and they don't have the YouTube so they bootleg them. So we're get, I guess that makes sense. They have a lot of things or they don't have a lot of things. Yeah, you know, I don't understand it all. Now here while we're in here, not that it's going to affect anything we're doing, Kristine, yeah, but I of course",
            "start": 564.72
        },
        {
            "text": "Lot of things or they don't have a lot of things. Yeah, you know, I don't understand it all. Now here while we're in here, not that it's going to affect anything we're doing, Kristine, yeah, but I of course have some things I want to develop. More spoilers here. So let's, but like what level of spoilers? Like that there's things here to unlock. I mean, like it's whatever. People who are sensitive to spoilers should have already quit out by now. That's a good point. And not to mention the things out there. I got to, I can't believe this controller screwed up. So here's the next big thing. I want, you ready? Yeah. The next big thing I'm going for, Kristine Steimer, is the Cyborg Ninja Suit. Ooh. And I'm close. I just got to get my R&D team up, which means getting better R&D players. Wait, that's, that's, uh, not bad. You only got four points up or I mean, it's going to take a while to go and stuff. Here, let me get out of the, get out the, get out the op. We'll do. Oh, look at this convenient car. No, 'cause it, we dropped it in with us.",
            "start": 604.56
        },
        {
            "text": "Got four points up or I mean, it's going to take a while to go and stuff. Here, let me get out of the, get out the, get out the op. We'll do. Oh, look at this convenient car. No, 'cause it, we dropped it in with us. Okay, well, I wanted to make, make sure you know, look at how more convenient the dog is. Look how, oh my God, you can hear Man Eater, 'cause that's what my entrance song is. It's gone now. I can put it on the iDroid if you want. No, it's good. We also get a copyright strike probably. Um, but here what I got to look into is I want to get the R&D team better, which, oh, this thing still taking, see it takes real time here of this building up. Yeah, so it's like a take forever. I think. No, I don't know what Dragon Age is again. You don't know what it is. I've never heard of this. So what we're going to do here is we're looking for this highly skilled Soldier. Chances he's here in this town. It's like an hanging out the, he on the toilet, isn't he? Uh, I mean, I wouldn't put it past it, but no, he probably isn't. I haven't seen",
            "start": 642.36
        },
        {
            "text": "Looking for this highly skilled Soldier. Chances he's here in this town. It's like an hanging out the, he on the toilet, isn't he? Uh, I mean, I wouldn't put it past it, but no, he probably isn't. I haven't seen anybody really **** in their brain. Wait, DG found something already. He's in the car with us. Yeah, but he's got the animal senses so it's easy for him park, park and see stuff like that's why you, that's why you love DG outside of the fact that you know, you eventually get it to wear outside of the fact that he's insanely adorable. Right? Oh, there they are. Shoot. Probably that's the town for sure. W, he's like Portillo. I like that the Team PSK on the side. Is that a tank? Yeah, we got a tank on our horizon. They spotted approaching threat. So they spotted you or no? Or are you spotting the approaching threat? He Spott dog is spotting the approaching threat. Crap, crap, crap, crap. Let's say, see now we scan and we'll figure out who. No, that's great. He's A+. We could use that. Probably. What do you mean? Wait, you're",
            "start": 686.32
        },
        {
            "text": "He Spott dog is spotting the approaching threat. Crap, crap, crap, crap. Let's say, see now we scan and we'll figure out who. No, that's great. He's A+. We could use that. Probably. What do you mean? Wait, you're going to steal him? Who? Look at you crawl backwards. That's hard to do. I fixed it. Oh, maybe. Yeah, see, okay, so in reality, got some **** up here. Those are, that's the highly skilled Soldier right there. We got him. Bam, nailed. So that's easy 'cause he's by himself and not by the base. Right? He's by, he's not by himself. I mean, not by himself, but I'm just meaning he's not in the compound, which is a little easier to get to. Make sure no one's Manning that tank. No, somebody for sure is Manning the tank. So what the plan is going to be is sleep. Make him go sleep. Sleep. What I'm going to do, Kristine Steimer, why you keep saying a full name? You never say my, I always say your full name, don't I? When I say your, when I say the first part of your name, I do. Switch over sniper rifle. I want to get, I want to crawl over. You shake",
            "start": 732.04
        },
        {
            "text": "A full name. You never say my, I always say your full name, don't I? When I say your, when I say the first part of your name, I do. Switch over sniper rifle. I want to get, I want to crawl over. You shake your head. Know with those people. I just puzzled dog. Look, I guess I don't know the head tilt. Oh, wait, so that guy's the guy you want or no? Which this is the guy I want. Okay, put one in his arm and then kill the other guy. I'm going to put one in that guy's arm too. I'm going to take them both. Oh, okay. Why is he, I take everybody. I don't know. I think he, it's whatever. I mean, this guy's not that, you know what I mean? Like he's going to go down. He's, and this guy goes, what it should, watch it should be there it is. Kelly. It's Kelly. It's Kelly. Now we're going to take this tank. Are we going to blow the other guys up with their own tank? No, we just going to, we're just going to take the tank for home, home base. You don't play this game fun. Well, yeah, I know, 'cause it's not, that's not how you play the game. Why not? It",
            "start": 777.28
        },
        {
            "text": "Up with their own tank. No, we just going to, we're just going to take the tank for home, home base. You don't play this game fun. Well, yeah, I know, 'cause it's not, that's not how you play the game. Why not? It feels like, like a legitimate strategy to me. It is. But I mean, isn't it a better thing? Oh, ****. Oh, sheit. What? There's two guys over there I didn't know about. Oh, take this. What? I leveled the **** up. I level that. I leveled my, I the world's most powerful parachute. See something that they're not in down. Wait, so you took the guys in the tank too? Yeah, yeah, yeah. You got to extra him. It's **** weird. It's Miller. What's Miller? The guy who just said that. I'm just, I'm just giving you a little bit of context for who's talking to us right now. He's the man from above. It's true. It's true. Let's see how these guys are playing it. Can you send the dog after one of those guys? Yeah, you want that? Yeah, now we might, you might have set. What did he just do? He pull out a stun rod. Oh my God, that's amazing. He's the",
            "start": 825.76
        },
        {
            "text": "Guys are playing it. Can you send the dog after one of those guys? Yeah, you want that? Yeah, now we might, you might have set. What did he just do? He pull out a stun rod. Oh my God, that's amazing. He's the world's greatest dog. How dare you kick him? He's okay. Kill him. Kill him. He's down. It's okay. No, I, no, I don't want your **** sleeping thing. He kicked the dog. K, well, now honey, we take them and we, we re-educate them into our lifestyle of being Diamond Dogs. No, you don't get re-educated if you kick a dog. Hey, you know what? You get re-educated in the ground. You're just chilling. Tomorrow at the grocery store, you and me, we're at the grocery store. A dog runs up and stuns me. You're going to kick it. You're going to yell at it. No, not if it's as cute as that dog. Not touching it. Except I got to keep in my waiting room. Hurry, hurry, hurry. Miss this. Dismissed. Hungry Hyena. Wait, who are you getting rid of? All these idiots. They're all in the waiting room because they're not good. Oh, damn it. Silent B, Silent Basilisk. You",
            "start": 875.68
        },
        {
            "text": "Hurry, hurry, hurry. Miss this. Dismissed. Hungry Hyena. Wait, who are you getting rid of? All these idiots. They're all in the waiting room because they're not good. Oh, damn it. Silent B, Silent Basilisk. You have to keep him. Apparently he's locked and I there. So now that's done. Why? Well, we don't, hold on two seconds, honey. Basilisk is from Harry Potter. I think it, it was around before Harry Potter, wasn't it? I know. I'm just saying. Oh, okay. Oh, that isn't me. I don't know. He must be important to the story at some point. Sure. Well, I guess Killer Lion's got to go. Wait, how do you tell if they're in the waiting room? Are all these people in right now? I'm in the waiting room. This is my combat unit and so on and so forth. And then over here is my waiting room. And like Alligator, please get rid of him. He sounds like a idiot. Frigid Boa. See, it's not just fighting things, babe. It's going through. I know. It's different things. Really micromanaging stuff. No, I was making a joke about like, look at how much fun we're having in",
            "start": 924.32
        },
        {
            "text": "This stealth action game managing all people, which I am having fun doing. This is some, one of the reasons I'm so happy the names are, I just want whatever random name generator this is. I, it's not random. Hideo Kojima sits there and names each and every one of them. Silent Basilisk. All right, so that's done. Now we got that. Might as well run over here and see what we got and just take on DD. He's a Coyote. Random Coyote. Suit. Does that mean he is a coyote? Don't understand the question anymore. Oh, look at, look at him go. I have, he's running faster than he should be. Heads up. Like, 'cause I, because of my bionic arm. So I don't, if again, how does your arm influence your leg? Because it's a video game. So you get to run faster. You've done this. That would have hurt. Big Boss doesn't feel pain. Big Boss running dive.",
            "start": 976.64
        },
        {
            "text": "Arm so I don't if again how does your arm influence your leg because it's a video game so you get to run faster you've done this that would have hurt Big Boss doesn't feel pain Big Boss running dive into ground Big Boss understands the mission there are some of we need resources too okay we'll take that guy he's good forget it it's so weird that you just snatch people and then they work for you after you kidnap them they yeah you because you I mean they might go in the brig they might need some convincing if you understand what I'm saying so basically you torture these people and you threaten these people and you you basically enslave these people 100% but you figure it's one of those things that these guys are just soldiers for hire and I'm the legendary Big Boss like everybody wants to work for me cuz they like if they did why would they try and kill you if they when they see cuz they're Hired Guns man and plus a lot of people thought I was when they be like dude I'm a big fan dude",
            "start": 1019.24
        },
        {
            "text": "work for me cuz they like if they did why would they try and kill you if they when they see cuz they're Hired Guns man and plus a lot of people thought I was when they be like dude I'm a big fan dude can I join your Squad Squad #Squad Goals oh like Alfredo does yeah look at this dog look how cute this dog is make the dog do something again or actually don't cuz I'm afraid there's too many people there well I'll try and what I'm going to do there's a car rolling through somewhere is behind you he's going to roll and run over your ass he only runs in the streets unless I'm driving so he's going to come through there if anything what if you're on a street I'm not on a street this is clearly a mountain top it's above you then cuz I hear it when you go up there more I'm going to tell you what's going to happen based on the radio sounds or the what whatever you know the surround sound in the headphones do these shitty headphones have surround sound you like I don't know you know what I'm talking",
            "start": 1061.44
        },
        {
            "text": "to happen based on the radio sounds or the what whatever you know the surround sound in the headphones do these shitty headphones have surround sound you like I don't know you know what I'm talking about when you rotate the camera around and then the sound gets more so here's what I'll do we're going to put it in the I'm not guy out not in the butt I'm going to come over here this guy's going to come over there say do it uh oh he sees the dog he doesn't see the dog the dog sees him yeah the dog sees him for sure boom now we got this guy guy oh God they're going to shoot at the dog and I'm going to be sad I mean you made this happen shoot him in the head kill that guy kill this **** damn man down good we clean this up and I've never done this one so I got the Eva calling card so that's great and now we just steal everybody this is so weird we're taking this equipment too cuz one day for Forward Operating Bases we can use it or we could sell it for uh more GMP and stuff or heroism I",
            "start": 1103.92
        },
        {
            "text": "great and now we just steal everybody this is so weird we're taking this equipment too cuz one day for Forward Operating Bases we can use it or we could sell it for uh more GMP and stuff or heroism I forget which I've never done it because it's one of those things we still haven't played FOB right now at least for me still not lot so I cuz I still have yeah not fresh off the boat Forward Operating Base uh and since I haven't been able to do that yet I haven't really F I want to take this picnic table maybe I want to go on a picnic later take that that looks important you the biological materials that doesn't make any sense to me is what the hell that is but I need blood but why would they just have a case of blood like no one's explaining that first someone's uh blood mean like he's like oh okay okay bleeding out yeah I I Now understand you can stop yelling out things that are bleeding out blood video games it's true parachutes freaking hot air balloons can you imagine waking up and",
            "start": 1156.52
        },
        {
            "text": "oh okay okay bleeding out yeah I I Now understand you can stop yelling out things that are bleeding out blood video games it's true parachutes freaking hot air balloons can you imagine waking up and you're floating in midair attached oh my God attached to balloons such a violent exit out of the world now they'll be happy cuz they get to come live with me on Mother Base I don't know what they'll be happy You've never asked them you didn't ask them what they wanted I mean by the fact the fact that their dudes have hung out with me long enough I think that they should be like oh we get it you know what I mean like they're going to get there and be like oh man I remember you oh thanks so much for picking me up off that base I remember you from training camp cuz they're going to run into a whole bunch of friend I was minding my own business felt the beasting passed out yeah woke up here in all the Metal Gear games the one look at the dog run with me too by the way just **** D-Dog he's the",
            "start": 1205.52
        },
        {
            "text": "bunch of friend I was minding my own business felt the beasting passed out yeah woke up here in all the Metal Gear games the one look at the dog run with me too by the way just **** D-Dog he's the best dog he's very smart uh oh people found the Bros no it's just these guys are patrolling where where did they come from we saw them earlier they were I think they're part of the T no you take them down but there's more than just oh Pee-wee Burp Pee-wee Burp remember when Pee-wee burped right one time Pell the wiener dog was being babysat by these kids and their parents too but when I went to pick when I went to pick them up a **** all right we got to take these guys out when I went to pick them up the guy asked me hey why does a **** just get him just kill him just **** kill him get him why you standing there dog cuz he's taking a nap you were no help on that one but we get to some more hoses oh nice you collect Cass why can't you just put these guys on the helicopter with you oh I could have but",
            "start": 1249.0
        },
        {
            "text": "there dog cuz he's taking a nap you were no help on that one but we get to some more hoses oh nice you collect Cass why can't you just put these guys on the helicopter with you oh I could have but that's faster what I just did otherwise I gotta Fulton them up in the I'm sorry I didn't know that would happen that would be that scary you throw up the fireman's carry and you walk him over you toss him I thought somebody was knocking at the door I don't know why why did you think that cuz I cuz I move cuz it was it sounded like a knock I guess if it Portillo isn't here yet he'd be he'd be barking he'd be barking are you okay I'm trying not to sneeze and ruin this Let's Play AO you like how aoo so did that mission convince you you're going to play Metal Gear no kill anybody do you want me to kill people yeah oh okay I didn't understand that how did you not when I was like kill that guy and you were like but like that point we already locked in like we're getting this highly skilled Soldier you",
            "start": 1301.36
        },
        {
            "text": "yeah oh okay I didn't understand that how did you not when I was like kill that guy and you were like but like that point we already locked in like we're getting this highly skilled Soldier you want me to go out another one just **** kill people I mean you can pick up the people you need to raise that thing and then kill other people sure okay let's do that let's going back in the Side Op see what I got over here another Soldier to extract okay a Landing Zone we're going to come in above them well I'm not going to come in like right on their base no no no above them oh you want me up here above them now see but well babe you can see keep saying that it doesn't help that look I mean it looks like it is above them this is one of my complaints with the game not really a big complaint but like sometimes it can be hard to get from point A to point B because of terrain so if you look here I'd be dropped here and then basically have to run along this like Mountain wall to get over here",
            "start": 1354.44
        },
        {
            "text": "like sometimes it can be hard to get from point A to point B because of terrain so if you look here I'd be dropped here and then basically have to run along this like Mountain wall to get over here whereas if I get dropped here this looks to have a clearer path to the road and over okay do do you want to defer to your judgment do you want me to use the dog again or something else what do you mean what else would you select I have different buddies here I have the horse that I can ride Walker is it like a zombie it's a little robot oh I I really haven't screwed around with it yet but I mean I've used it in other settings no he'll he's not going I'm just showing you the thing see you can climb in that and you shoot **** no okay so you want the dog I do want the dog okay do I have yeah now he can kill for us good all right good job good dog I look at him with his little visor he's ready man that's that's going to be that's so he doesn't get blood in his eyes right and I'll switch to a",
            "start": 1399.12
        },
        {
            "text": "he can kill for us good all right good job good dog I look at him with his little visor he's ready man that's that's going to be that's so he doesn't get blood in his eyes right and I'll switch to a mean killing machine load out here right so I I well all damage no cuz you need to you need to put that one guy to sleep right well I could do that in a number of ways let's we'll make it challenging okay I'm going to come in with only the ability to kill outside of the arm which I never used sure sure sure all right oh my God for this one I want to come in at night for my killing spree she only comes out at night that's all H yeah oh is that what it is I was like I remember the first line that's about it again if I wasn't worried if I wasn't worried about the copyright strike you could just say it in like a rap form like like rap the lyrics to it she only comes out at night is that it like angry time I like how to me rap means angry like I got really angry there you know yeah you did I",
            "start": 1435.44
        },
        {
            "text": "say it in like a rap form like like wrap the lyrics to it she only comes out at night is that it like angry time I like how to me rap means angry like I got really angry there you know yeah you did I didn't think Fresh Prince of Bel-Air no fresh oh we need a dog like this how do we get a dog like this Portillo we just put a visor on Portillo Portillo is not that fluffy made a fluffier dog has you think they use the tree maker software I don't know I'm not familiar with the I mean this is Fox Engine remember what a big deal that was yeah but there's a program that Lucy over at GameSpot did a feature on and is called middleware of some kind I don't remember exactly what the feature was called but she was talking about middleware uh-huh which allows developers to instead of taking time to model these **** trees sure they can just insert this program into their engine and it will create trees for them and they use it in movies and stuff too for CG CG trees hey guys don't mind me hey anybody",
            "start": 1483.56
        },
        {
            "text": "**** trees sure they can just insert this program into their engine and it will create trees for them and they use it in movies and stuff too for CG CG trees hey guys don't mind me hey anybody hear a Jeep careening over that hill over there no just me weird no no look at this shitty building oh I was about to say can you thread the needle no you can't knock it down can't knock anything down nothing's destructible or just those in the tin shacks the tin shacks are indestructible wait how are the trees destructible we run into a tree I got to have I don't know if I have enough momentum yeah and maybe it's you know maybe it also could easily be one of those things where it's not every tree is destructible uh oh Bros on the hill no those are those are animals those are animals see they're they're attacking these guys up here what kind of animals you think they are it looks like an alien right there oh Jesus he's coming he look right at me he look right at me Can you tame this hyena dog",
            "start": 1545.08
        },
        {
            "text": "attacking these guys up here what kind of animals you think they are it looks like an alien right there oh Jesus he's coming he look right at me he look right at me Can you tame this hyena dog yeah I could I mean like again I could Fulton it out put it in the zoo you want to go to the zoo oh my God you have a zoo yeah I got a zoo yeah we're going to the zoo this is a weird **** game they call a nature preserve but it's a zoo oh interesting I didn't bring a sniper rifle oh yeah no I thought you did but it was just damaged oh no you got a like a bazooka yeah I saw I'm loaded up from a boss Bazooka Joe remember that comic, Bazooka Joe remember I do remember that gum sucked it sucked I mean it was great and it sucked it really hurt my jaw what about you do you remember that or is that Bazooka Joe did I just get like really still well that too but no you're right about that said was it a little comic or something they had there haven't had that since high school now this is a big moment for us",
            "start": 1601.48
        },
        {
            "text": "did I just get like really still well that too but no you're right about that said was it a little comic or something they had there haven't had that since high school now this is a big moment for us Kristine what's that we got those two tanks there those two like thing like the two flatbed back trucks I don't what you call containers yeah that's the one those are going to be good good for us okay cuz that means there's hella resources in there hell which we need to upgrade all our stuff hello would you like to go to my factory **** I thought I more my factory of people no you want me to kill remember oh no I Oh I thought that was the guy you needed my bad my dog get out run do **** uh now we are an interest we are in interesting spot now cuz I can't knock this guy out I wasn't expecting to want to try crawling backwards like that all right so this is good I don't think you can really do it that easily a **** hold on we're in trouble here no get the dog to take one out why the",
            "start": 1652.8
        },
        {
            "text": "to want to try crawling backwards like that all right so this is good I don't think you can really do it that easily a **** hold on we're in trouble here no get the dog to take one out why the hell you see me over here already **** cuz cuz **** oh that's the guy that got me over there do I have my I do have sleep Holy Hand Grenade I threw a sleep grenade a they move though it looks like or something look you can pet the dog yeah kill him but now the dog is going to get attacked Oh by everybody no okay good yeah well no but I mean like that guy his friend over there is going to be like bro did you just get bit by a dog and Nah that guy's pretty stupid oh no don't kill him oh no D-Dog oh well you can't blame him for self-defense no well I don't think it was actually cuz I I could blame I can't blame him for that no you can't cuz you didn't give him specific orders not to kill that guy well I didn't think he needed specific orders on that one pet him cuz he's a good dog well no now it's",
            "start": 1710.2
        },
        {
            "text": "blame him for that no you can't cuz you didn't give him specific orders not to kill that guy well I didn't think he needed specific orders on that one pet him cuz he's a good dog well no now it's just now it's just we're going to light this place up just set the world on fire set the world on fire oh you kill him real good oh right in the head oh look at his helmet fly off you like that I did like that D-Dog's got that guy over there so that's good D-Dog's got it he's on the job oh one guy got was oh he was sleeping not the guy we wanted well you know you can't win them all yeah it's true go back to that whatever that was that prompt where he's taking a **** oh the dog pet the dog no not you go back no keep walking although good good boy there was some weird prompt where it looked like he was sitting on a toilet oh pick up that was the pick up a guy it's like him lifting with his legs got it got it got it see I thought that yeah the Kill Order would only be executed on the one so I",
            "start": 1768.0
        },
        {
            "text": "he was sitting on a toilet oh pick up that was the pick up a guy it's like him lifting with his legs got it got it got it see I thought that yeah the Kill Order would only be executed on the one so I learned something about Metal Gear today I you learned something about that dog and it's that he's got taste for blood oh head fly whoa you did you what did you decapitate him no are you sure not positive but I I don't think I got I decapitated him only fools are positive can't tell oh he is hello shoot him in the head make him dead shoot him in the head look he's got his perfectly oh come on he's got a he's got a Whatchamacallit on a Whatchamacallit yeah remember that yeah I do we had a whole show about it where I was like what the **** Whatchamacallit and I was like it was a really not that great candy bar although I think it still exists off the night vision internet calm down oh are we murdering everybody so all these little dots well now that I mean now that that guy's dead and I but",
            "start": 1818.28
        },
        {
            "text": "great candy bar although I think it still exists off the night vision internet calm down oh are we murdering everybody so all these little dots well now that I mean now that that guy's dead and I but there's usually when there's a little bit of resources there's more resources if you know what I'm saying some more shipping crates yeah used table over here so it's like a mini game no there's no Gwent or anything no okay oh someone's got really good eyesight you know what I mean I feel like you can **** be right behind people no one will ever know but if oh there they are more crates good good good oh an an I love crates kill him **** kill him oh he's got a night vision thing on you got to run baby no I don't know yet okay they're both see you I guess they don't cuz they don't have the glowy stupid **** pistol's the worst no the pistol's great it's just that idiot has a helmet on climb over there Snake what an idiot Snakey yeah I told you told you Snakey Poo Poo if he would just go",
            "start": 1883.2
        },
        {
            "text": "stupid **** pistol's the worst no the pistol's great it's just that idiot has a helmet on climb over there Snake what an idiot Snakey yeah I told you told you Snakey Poo Poo if he would just go over I mean I'm hitting the triangle button right there for him to go over it he's like I can't I can't climb this little Hill the dog can the dog at that dog the dog's great at climbing **** you just need four legs set the world on fire I just want to pet this time tiny dog kill him I love that he takes out a knife what a badass this dog is more badass than I am I slot trained him well hello is me a plant don't worry about me stupid ow a gun to the face that kind of stings Jesus Christ dude how many bullets to the face can you take is he still alive yeah but he's he's wounded just like the other guys too like they're they're in trouble uh oh we're in trouble going to snuggle up up on the double I don't remember the words I vaguely remember the song I kind of I don't even really remember what it",
            "start": 1945.72
        },
        {
            "text": "guys too like they're they're in trouble uh oh we're in trouble going to snuggle up up on the double I don't remember the words I vaguely remember the song I kind of I don't even really remember what it is I just sometimes you know things just pop into your head and you just have to blurt them out otherwise I don't know get oh can he take out a shielded enemy we're about to find out again I'm learning I don't send him to his death does the dog die do you have to start over to find a new puppy from a puppy mill no has updated oh you got all the heroism see you got more there for killing everybody than you did when you saved everybody just going to say no I no that's 100% wrong cuz it I swear I saw only 30 plus 30 well that's for the those are for the individuals I captured this Outpost that means that all the guys are incapacitated did that guy die did he bleed out yeah he finally bled out yeah get some more resources over here these are chump change resources really but I still wow they're",
            "start": 2012.88
        },
        {
            "text": "that all the guys are incapacitated did that guy die did he bleed out yeah he finally bled out yeah get some more resources over here these are chump change resources really but I still wow they're so helpful right sure where are your crates are those are crates right here but I'm still going to I'm going to pick oh shiny got a blueprint for something a flamethrower **** we got company is it the dog must just be a generator I can't tell what is minus 10 000 that's how much uh it costs to do the Fulton extraction everything money do you have well it's GMP and I got I got a **** ton of it I have uh what 4 million oh yeah 3 million I **** play this game like a maniac so there it could be possible you run in stuff and you can't get it yep you can totally have it where you know you don't have enough GMP to deploy the way you want to so you have to go out there with the equipment I mean it never happened to me I have to imagine you're just so good at Metal Gear no I don't think",
            "start": 2071.76
        },
        {
            "text": "don't have enough GMP to deploy the way you want to so you have to go out there with the equipment I mean it never happened to me I have to imagine you're just so good at Metal Gear no I don't think that's at all and the internet definitely knows after watching those Let's Plays that's not the case but everyone's better on the internet oh no I know everybody whoever watches the YouTube video of anybody playing anything is better than them I totally understand but I what I'm saying is yeah it's I think you'd have to go out of your way not to have GMP really you know what I mean you'd have to really screw it up so does this game encourage you to stealth more and save people or does it encourage you more to kill people no it encourages you oh Jesus Christ I almost fell in the grave yeah I know I won't tell you what was going on there but it wasn't cool **** dead bodies in there this that's sometimes you come up and there'll be a cassette playing there and that's where you get the songs",
            "start": 2131.88
        },
        {
            "text": "I won't tell you what was going on there but it wasn't cool **** dead bodies in there this that's sometimes you come up and there'll be a cassette playing there and that's where you get the songs you're hauling oats and such um how do they get the rights to those songs they paid for them are you sure I'm positive and I don't think they have laws Kojima is just an outlaw he's just stealing music off the internet downloading it to his mixtape Konami legal's like you have to pay people hide like nah I'd like to see holos come for me are they still alive I'm assuming that they are yeah oh I I said with no research done hopefully they are still alive and well where you going now I'm looking to see if there's anything worth picking up there's a water tower do you think Wacko, Yakko, and Dot are in there in that little one yeah no and they were in trouble so they had to knock off Afghanistan Yakko, Wacko, and Dot in there you're in Afghanistan yeah game takes place realize it was real places in the",
            "start": 2165.8
        },
        {
            "text": "in that little one yeah no and they were in trouble so they had to knock off Afghanistan Yakko, Wacko, and Dot in there you're in Afghanistan yeah game takes place realize it was real places in the real world I assumed that they were fake places no I'm here to get Osama Bin Laden's son I don't believe that it's not cuz it's in the past remember all right oh yes the past can hurt no no ah Lion King come on you need even watch more Disney you know that I don't even like I don't like The Lion King I don't like the Disney movies I don't like it I don't like it found a wild animal don't you want to go say hi I promised you a trip to the zoo I was going to do that oh are you running to the zoo I'm running to the pickup oh I got to get a helicopter back to Mother Base running to the zoo but you know what I want to fool around and show you a little bit of Mother Base anyway and maybe really spoil something for me cuz I heard about how to do something from a friend today so we could just stop",
            "start": 2219.6
        },
        {
            "text": "know what I want to fool around and show you a little bit of Mother Base anyway and maybe really spoil something for me cuz I heard about how to do something from a friend today so we could just stop the list here was was it the dog that you heard it from yes it was it was D-Dog there D-Dog told me oh why he whimper happy to get recognized I asse he's like thank you for recognizing that I am the best in this pair right so Kristine yeah as we wrap up this Let's Play we'll do another one after this sure uh it'll go a lot tomorrow here on youtube.com/kindafunnygames subscribe like share um what do you think of what you've seen in Metal Gear so far I think the game needs more killing people but you could do it that way I just don't I choose not to giving you **** um I don't know I mean I might whoa oh that scared me I thought that was coming to hit you in the face what are why are you doing this what's going on you wanted killing and stuff so I don't want to Michael Bay it I just Sorry, my bad I",
            "start": 2275.44
        },
        {
            "text": "oh that scared me I thought that was coming to hit you in the face what are why are you doing this what's going on you wanted killing and stuff so I don't want to Michael Bay it I just Sorry, my bad I appreciate the no problem trying to help me get happy um D-Dog's awesome M so if that happens along the main story line maybe I'll just do that stuff I'm not I'm not going to do all the stuff you're doing extraction at too much are you going to play this game I'll give it a shot for sure okay I got some elite soldiers here too this this is cool ladies and gentlemen this has been another Metal Gear Solid Let's Play here on youtube.com/kindafunnygames I'm Greg this is Kristine from Steimer.com tomorrow YouTube.com well just Steimer says it has it on there I'm saying if you're already on YouTube there's nothing worse than somebody who won't stop promoting themselves Kristine I know cuz I live with you I know it's great subscribe like share Kinda Funny Games we'll be back tomorrow with",
            "start": 2329.56
        },
        {
            "text": "there's nothing worse than somebody who won't stop promoting themselves Kristine I know cuz I live with you I know it's great subscribe like share Kinda Funny Games we'll be back tomorrow with another Metal Gear Solid V let's play before we put up then the next one which is the giant spoiler me and Robert playing through the hospital thing which is the beginning of the thing and asking a bunch of million questions that you've probably seen answered and leaked and all sorts of stuff on the internet until next time it's been my pleasure to serve you",
            "start": 2373.8
        }
    ]
}