{
    "id": 1233,
    "video_id": "52I3q2miZtg",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Greg and Colin Play Uncharted: Drake's Fortune - Kinda Funny Plays",
    "description": "Colin and Greg play a bit of Uncharted 1 in the Uncharted Nathan Drake Collection.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1443553201,
    "duration": 1962,
    "transcript_chunks": [
        {
            "text": "This Kinda Funny Let's Play is brought to you by PS I Love You XOXO, our new PlayStation podcast. Come listen to Colin and I talk about PlayStation games each and every Tuesday at 9:00 a.m. on youtube.com/KindaFunnyGames and podcast services around the globe. Greetings and salutations, welcome to Kinda Funny Games. My name is K. Moriarty. This is uh my lifemate, Greg Miller. Greg, today we're going to play Uncharted: Drake's Fortune from the Uncharted: The Nathan Drake Collection. Oh, I've heard of this collection, which is on PlayStation 4, exclusively on PlayStation 4. Not only does it come with the Uncharted 4 beta pass, but it comes with the three original PS3 Uncharted games. And we're doing this in celebration not only of uh The Nathan Drake Collection, but also to celebrate our brand new PlayStation podcast, PS I Love You XOXO, starting this week. youtube.com/KindaFunnyGames. Subscribe so you don't miss it. And then of course, every podcast service as well. Tuesdays, 9:00 a.m. Pacific video. There's no window.",
            "start": 0.24
        },
        {
            "text": "podcast, PS I Love You XOXO, starting this week. youtube.com/KindaFunnyGames. Subscribe so you don't miss it. And then of course, every podcast service as well. Tuesdays, 9:00 a.m. Pacific video. There's no window, no nothing. It's all just there for your amusement. Yeah, no, people have been wondering how, how can I get it on Patreon? And we're like, well, you can't. It's just going to be there. We do a lot of stuff on Patreon support. I love that. But uh yeah, so you can watch it on YouTube. You can also download as audio. It's there for you. We want to do it, spiritual successor to what we used to do. It's going to be a lot of fun. Today we're going to play Uncharted: Drake's Fortune. Play, I mean, we're just showing the game. You play it on Normal. I'm playing on Crushing right now. My thought process is if I'm starting this and I want to platinum it one day, do I just, I know I'll just do it Normal. We'll get back into it here. I mean, you're not used to it. I, I, I haven't died yet when my Crushing playthrough, but you're a real man.",
            "start": 40.16
        },
        {
            "text": "want to platinum it one day. Do I just, I know I'll just do it Normal. We'll get back into it here. I mean, you're not used to it. I, I, I haven't died yet when my Crushing playthrough, but you're a real man. Exactly. I'm a real man. I mean, that's a given. But also because uh, you know, it's worth noting that uh, the game has hasn't really ramped up. There's, this is the hardest of the three Uncharted games by a mile. Oh yeah, sure. Naughty Dog didn't have the balance just yet. And now that's what I want to talk about with this and every one of these Let's Plays we'll do this week as we, I mean, what a great timing that the Uncharted Collection embargo lifts the week we do PS I Love You XOXO. As if we planned this. But I assure you, ladies and gentlemen, we don't plan anything here. Absolutely not. Uh, what year did Uncharted: Drake's Fortune come out? 2007. Were you, what, run me through this? This, I, I was already at IGN, obviously. I remember this was the first big one. So like we, I remember being on a bus with Ryan and Jeff Haynes.",
            "start": 73.08
        },
        {
            "text": "Fortune come out in 2007. Were you, what, run me through this? This, I, I was already at IGN, obviously. I remember this was the first big one. So like we, I remember being on a bus with Ryan and Jeff Haynes going to Sony's pre-E3 thing. And this is one of the ones people like, oh, I can't wait to see what the guy, the guys who did Jak are going to do next. And we rolled in and I remember picking up the controller and playing it and being like, what the hell is this? You know what I mean? Like it was like so different. It wasn't Jak and Daxter, right? It wasn't that. It was like this very amazing uncanny valley. It looks so, it looks so good. It's funny now that we're going to get into it here. You're going to see how it looks and be like, oh, well, I still think, I mean, this is the thing is, and this is why I'm curious about putting in the original in the might. And I feel like it looks better than I remembered it looking like in my head. Like I don't know. Bluepoint Games did the ports. The Bluepoint does a lot of.",
            "start": 109.36
        },
        {
            "text": "about putting in the original in the might. And I feel like it looks better than I remembered it looking like in my head. Like I don't know. Bluepoint Games did the ports. The Bluepoint does a shit ton of ports. They're very familiar with Sony and Sony's first-party games. But I feel, I mean, this doesn't look as good as Two or Three and certainly not as good as Four. But it looks better than I remember. It's running in 1080, 60 frames a second for me. The funny thing about it is the way they have it set up, like when Elena is walking around the camera right there and stuff that you can, this looks even, this still looks like the map set they always show, right? Where it's so bare bones. Like as Uncharted ramps up and we'll see it as we do Let's Plays for Two and Three as well, you'll just see how more, how much more detail is put into these environments to make them more flesh out. Yeah, Nate looks great. His eyes are a bit weird, right? And like their face and their bodies all are all.",
            "start": 148.08
        },
        {
            "text": "just see how more, how much more detail is put into these environments to make them more flesh out. Yeah, Nate looks great. His eyes are a bit weird, right? And like their face and their bodies all are all like more simple, right? But I mean, just look at how dead everything is around them here as they work and do this. Just the crates and stuff. You can imagine, you know, Emily Rose and Nolan North in the ping-pong ball suits with all the stuff around them trying to figure out. Absolutely. You'll, you'll see later when it pans out in about five minutes or so after you spoil or fight the pirates. Uh, the ocean looks really like you could tell they just use the same like texture over and over again. But it's, and that's why people were so intrigued by Among Thieves, which is Uncharted 2, which we'll play if you're watching this the day this came out. We'll play that tomorrow. Uh, basically like that's such a huge jump. The jump from Two to Three was not as significant. The jump from One to Two was significant. Um, and.",
            "start": 184.76
        },
        {
            "text": "this the day this came out. We'll play that tomorrow. Uh, basically like that's such a huge jump. The jump from Two to Three was not as significant. The jump from One to Two was significant. Um, and that's why we always talk about the fact when we talk about Two versus Three, right? How you and I think Three is the better game, but everybody else thinks it's Two. And we always talk to people, if you were to switch them around and Three came out before Two, everyone would say Three is better than Two. Yeah, absolutely. It's not only us saying that. Like when I did the history of Naughty Dog when we were still at IGN, that's what they said. A lot of them said the same thing that they swear, you know, and they really feel that if Three came out before Two, people would feel the same exact way about that game. I think Three was extraordinary. Also, real quick before we lose it, side of it, Ottsel on their suits. Obviously, Easter egg back to Jak and Daxter, cuz you know, Daxter was indeed, indeed. Remember that? Now if we.",
            "start": 221.68
        },
        {
            "text": "think Three was extraordinary. Also, real quick before we lose it, side of it, Ottsel on their suits. Obviously, Easter egg back to Jak and Daxter, cuz you know, Daxter was indeed, indeed. Remember that? Now if we became Jak and Daxter, would you be the Ottsel or am I the Jak? Um, I lost. You're probably the Ottsel, even though I'm I guess more your sidekick, I guess in in reality. I like this little thing. So you see this? I've been playing it already. So it says Moriarty - IGN. I've killed 10 people with explosive, explosive. Oh, I didn't see. There's all these little things that pop up like these meta games that are available. See if down here. Ah, get out of the way. God, I'm going to fall in love with you one day, but I can't deal with it now. Now it's also interesting that uh R1 is not shoot anymore. No, it's, you can change it. I changed it back cuz I'm used to playing Uncharted with R1 and L1, which is again another example of PS3 Stockholm Syndrome. What do you mean? It totally makes sense to shoot guns without the trigger.",
            "start": 255.96
        },
        {
            "text": "it. I changed it back cuz I'm used to playing Uncharted with R1 and L1, which is again another example of PS3 Stockholm Syndrome. What do you mean? It totally makes sense to shoot guns without the trigger. Now it's weird. The camera feels so weird right now. Did did you find that? Um, the camera just doesn't feel like where it should be for a shooter, let alone Uncharted. Yeah, I mean, it's it's a little, it's a little antiquated, I think. You know, there's only so many things that you could truly fix. I don't know if people are going to have a huge problem with it. I don't think it would be a huge problem. I just think it's interesting. Used to it. This is going, we always talk about going, you know, the big thing lately has been Metal Gear, right? Going back in time and playing Metal Gear 1, right? And how that actually feels and how that plays now to jump back and Uncharted, which is a game I have not played. I platinumed it, you know what I mean? When they put trophies on it, which was, you know, years after came out or.",
            "start": 297.72
        },
        {
            "text": "feels and how that plays now to jump back and Uncharted, which is a game I have not played. I platinumed it, you know what I mean? When they put trophies on it, which was, you know, years after came out or whatever, right? Yeah, a year. And then it was just like, never again. Here comes your brutal combo. Oh, that was the thing I was thinking too was, turn around. No, there was uh, I haven't played it since then either. I think they, I think they, I could have sworn they put trophies in. That happened. That guy had no uh, no spine. How? I mean, that's just how hard Nate punches. He punches you so hard he liquefies your spine. Yeah, you're right though about like the dist, like the the draw distance is great, but there's just nothing around. Like it's definitely not as detailed. But I mean, for the time that this came out, this was a beautiful. Oh my God. And that's what I'm trying, and that's what it's interesting. I'm trying to put in context for people, right? Like when I played this that first time of that event, it was like.",
            "start": 332.64
        },
        {
            "text": "was a beautiful. Oh my God. And that's what I'm trying, and that's what it's interesting. I'm trying to put in context for people, right? Like when I played this that first time of that event, it was like, what is this? And then when we finally got our hands on it to play it, this was like, you know, my first giant, I don't count where, even though that turned out to define my career for uh, this was my first like giant review, my first giant review for IGN, right? And playing this in like, it was a different level, right? It was so amazing what it was doing. Sully's going to come in. It's so cool cuz we have all this context of these characters now and Sully. Like we haven't even met Sully yet. Yeah. Uh, we don't know anything about these characters. So it's funny going back and kind of trying to remove those things from your mind about like where you were when you, yeah, where where Elena is and how that all works out together. Like the propeller looks weird. Yeah, well that whole thing looked weird, but whatever.",
            "start": 377.08
        },
        {
            "text": "from your mind about like where you were when you, yeah, where where Elena is and how that all works out together. Like the propeller looks weird. Yeah, well that whole thing looked weird, but whatever. It's Uncharted and it's back. New trophies, more trophies. But what I think is really exciting about this, about playing this game. So this came out uh, Fall 2007. So that was like a year after PS3 came out. Yeah. So think about the games we got a year after PS4 came out. And then think about what they did with Uncharted 3 and The Last of Us on the same hardware. The amount of power they extracted. Amazing. I think it's going to be extreme. Like what we see, I mean, Uncharted 4 already is ridiculous, but it's going to get better than that. Yeah. By the time we get to the end of the life cycle of the PS4, you can only imagine what people are getting out of it. You look back at this and it'll look like what a PS1 game looked like, right? Right. Tell what a badass. Nothing the years of therapy won't fix this where I.",
            "start": 411.96
        },
        {
            "text": "only imagine what people are getting out of it. You look back at this and it'll look like what a PS1 game looked like, right? Right. Tell what a badass. Nothing the years of therapy won't fix this where I fell in love with her. Fish. I like her too. I'd kill each and every one of you just to be married to her in a fictional land of Uncharted where we don't do the pirate stuff. We just play games. Okay, so you want, so so you'd want to be married to, so you'd want to be married to Elena in real life? Sure. If she could come out of the game world and live with us here in her journal. Em, no, no, no, no, no. Emily Rose is happily married and has kids. I'm not, I'm not, I'm not trying to break up any marriage here. And I say, I don't know Emily Rose like I know Elena Fisher. I know Emily. We're friends. We DM once in a while. I tell her congratulations on these babies and Haven and all that stuff. Like I, I know. Well, and Jericho, of course. Remember when she came on Up at Noon? Those are the questions I had for her. Tell me, did.",
            "start": 450.64
        },
        {
            "text": "I tell her congratulations on these babies and Haven and all that stuff. Like I, I know. Well, and Jericho, of course. Remember when she came on Up at Noon? Those are the questions I had for her. Tell me, did you know sign language on Jericho? Like what are you asking me? Jericho question. Yeah, not don't care. Uncharted or Haven. Tell me about this. Look at, I think I've earned a look at that diary. When like it's funny like now just like just wa like you're talking about watching this whole thing unfold. Like we know so much, you know, of Nathan's backstory now. How him and Sully come together, right? So to have that context to replay this, pretty impressive. It's awesome. And I love this. I forgot how much I love this, this particular scene. Oh, right. Um, which people will see. And then you really gain control and then Uncharted really begins. Back to England. Queen Elizabeth confiscated all. But I swear to God, Bluepoint cleaned this game up. Like I, I had to, that's how this works, right? Cre. I want to go back. I maybe I'll.",
            "start": 494.24
        },
        {
            "text": "Uncharted really begins. Back to England. Queen Elizabeth confiscated all. But I swear to God, Bluepoint cleaned this game up. Like I, I had to, that's how this works, right? Cre. I want to go back. I maybe I'll do that tonight. Just plug in PS3 and just look at what it looked like. C. Med bar. Get your firmware up there. Got to go. I'm many of firmware behind it. I don't know what like, what was the last game? I think the last PS3 game I really played was like Tales of Xillia. So that was like a year ago. JRPG thing. And now it's hysteria coming. I don't even have to play it on. I can play on PS4. So it's like I'm, I'm pretty close to my PS3 away. Just melt it. Melt it. Yeah. Make bullets out of it. Goddamn. L. Goddamn. Dado. There you go. Sully, you son of a bitch. That put a smile on my face when I heard him say that. That's a famous. Yeah, well, unfortunately, no last page was torn out. I'm telling you, Sully, you know what this game reminds me of? Greatness from small beginning. I mean, like think about, I mean, like it's so funny now.",
            "start": 534.12
        },
        {
            "text": "Yeah, well, unfortunately, no last page was torn out. I'm telling you, Sully, you know what this game reminds me of? Greatness from small beginning. I mean, like think about, I mean, like it's so funny now to think about playing this for the first time and like going to see this game for the first time and I can't wait to see Uncharted. It's this pirate game from the guys who did Jak and Daxter. You know what I mean? And like now Naughty Dog is Naughty Dog. You know what I mean? Anything they touch turn. I mean, people really do forget that. I mean, Naughty Dog's made big games before. Crash Bandicoot, obviously substantial game. Naughty Dog was found in 1986. So it's like they've made a lot of games. They made Genesis games. They made PC games. But people really love the Crash games and and they sold very well. And people like Jak and Daxter. I think people love Jak and Daxter a little too much in my opinion. Uh, fuck you, Tim. But uh, I mean, they're fine games. But this was, why did they not rise to the heights of.",
            "start": 578.36
        },
        {
            "text": "and people like Jak and Daxter. I think people love Jak and Daxter a little too much in my opinion. Uh, fuck you, Tim. But uh, I mean, they're fine games. But this was, why did they not rise to the heights of Ratchet & Clank? That's the question. I think Ratchet's better than. That's a bunch of shit. I love you, Ted Price. Don't take it personally. But that's Ted Price is going to come at you. Evil Ted Price. I don't fuck with uh, but this, I agree with you. It was really Uncharted 2 actually that made Naughty Dog Naughty Dog. And when people, when people are like, what, go back and make Jak 4? I'm like, that's what you want them to do? Are you kidding me? Anyone can make that Jak 4 game. Like in the first party, like these guys, you know, are making really true special, right? Realistic games, right? Yeah, yeah. But I mean, that's the thing is like, and that's it's just again, like Naughty Dog's rise to fame, right? Or at least, you know, seen where they are now. You look at this game and this was the game that not a.",
            "start": 624.52
        },
        {
            "text": "but I mean, that's the thing is like, and that's it's just again, like Naughty Dog's rise to fame, right? Or at least, you know, seen where they are now. You look at this game and this was the game that not a lot of people had a PlayStation 3 for, right? We didn't have the price drop yet. The store still sucked. You know what I mean? So the people who were ground level PlayStation fans like myself were playing this and being like, this is amazing. You got to play this. You got to play this. And then, you know, nobody, not nobody does, but it's not like a system selling, right? It's one great out IP or whatever. One game. And then you get to, all right, Uncharted 2 is coming out. That's when people go buy the systems. That's when they're in board. You know, I mean, everybody Slim came out and all that cuz Uncharted 2 was 2009. And that was the most remarkable thing too is that they made Uncharted 2 in a very abbreviated amount of time as well. Um, but I remember when we were at IGN and this came out and and it was Mark.",
            "start": 662.84
        },
        {
            "text": "2009. And that was the most remarkable thing too is that they made Uncharted 2 in a very abbreviated amount of time as well. Um, but I remember when we were at IGN and this came out and and it was Mark Ryan, my boss at the time, was writing the uh, the guide for. And I was looking at him like, this just doesn't look like my kind of game. I like didn't really give it a second thought. You know, sorry, not a bit enough. No, Mega Man. I got my we. I'm happy. Colin Moriarty. I'm like, yeah, it's cool to see Naughty Dog do this. I mean, this is not what I expected them to do, but this is this is cool. And I'm sure it was refreshing for them as well. Do you remember the first treasures? Uh, no, I don't. Did you start playing last night looking for treasures? I have the guide up on my phone, but I, I didn't. We should, I don't know if we should really worry about that in this playthrough, but you could. I mean, that's how I play. I'm like looking at running in every corner. Run. Very fun to watch me play that way. It's just like there was I.",
            "start": 697.84
        },
        {
            "text": "should really worry about that in this playthrough. But you could. I mean, that's how I play. I'm like looking at running in every corner. Run. Very fun to watch me play that way. It's just like there was I, I don't remember the is ever being memorable. You know what I mean? Like cuz this one is when they were still just white orbs and you'd walk up and you're like, all right, I got a fucking Inca face. Great. Paul Ana loves this Inca face. The environment really does look beautiful. I'm telling you. Like I don't remember it looking this good. This makes me more excited. I'm on the stage of it. E3. Yeah. Doing a little pan. Oh, you went, want a pan there? I love the slow pan. Yeah, it's the best. Like no one plays like this. Sorry, Bruce. Try. You're out of a job next E3. I'm there spinning the camera. Pants are wet. Remember that? That was a big deal. Do you remember how big of a deal that was? And his pants will get wet and dry as he moves. It is kind of cool. It is. No, it's really cool. Again, for building the game, they're.",
            "start": 735.76
        },
        {
            "text": "that that was a big deal. Do you remember how big of a deal that was? And his pants will get wet and dry as he moves. It is kind of cool. It is. No, it's really cool. Again, for building the game, they're building, right? I just love these characters. Yeah, it's nice to see him back, right? Well, I don't get it. According to this, we're right on top of the mark. Maybe you're not reading that thing right. Let me see it. Oh, this is the place. Sully doesn't understand technology. There's nothing here, mate. Guy. He's like, let me see that thing. He just glances at the screen. Just relax. Let's take a look around. Do you have the platinum in Golden Abyss? No. See, that's that's a really hard plat. I know it's not a really hard one. It's a time. I think it's random. Yeah, yeah. They're the black market crap. Those so stupid. I really like Golden Abyss. I said though when Golden Abyss came out in 2011 in Japan, when we got it, Japan, that it was better than Drake's Fortune. And I'd be interested to see if I still feel that way now.",
            "start": 780.16
        },
        {
            "text": "Golden Abyss. I said though when Golden Abyss came out in 2011 in Japan, when we got it, Japan, that it was better than Drake's Fortune. And I'd be interested to see if I still feel that way now that I'll be playing this again. And then we go back and just mess around with Golden Abyss because I think Golden Abyss was really quite a feat on Vita. I still think it's like one of Vita's really finest games when it really comes down to it. Oh yeah, which underrated. It goes back to like what I was talking talking about with like the uh WB Montreal Syndrome, right? Oh, this is a Batman game not from the Batman people. Oh, this is an Uncharted game not from the Uncharted people. So no matter what, it's not going to be as good, which sucks because it was great. I remember this. I remember that jump. Remember that? Two hands up. Not you, Kevin. You can put your hands down. There you go. And like any like any epic like clever epic game that teaches you things. I really think Uncharted does a nice job of teaching you things.",
            "start": 832.76
        },
        {
            "text": "hands up. Not you, Kevin. You can put your hands down. There you go. And like any like any epic like clever epic game that teaches you things. I really think Uncharted does a nice job of teaching you things without saying anything too in terms of platforming, where you need to go, putting you in environments. Like it's like this is telling you like you're going to be in these situations a lot. Look for the low area. Look for what like, look around. Pan up because especially at this time too, we weren't necessarily playing games quite like this. You know, these existed obviously on PS2 and Xbox and what not. But you know, like I said, this was an iteration of Tomb Raider, which now Tomb Raider is an iteration of Uncharted, which is funny, right? Mhm. Everything old is new again. Oh, we're going to drop something through that. Don't worry about it. I'm Nathan Drake. I'm on the case. The shimmies, which would come. The animations are a little weird for sure. But oh yeah, but Gen 1, bro. Mhm. I think the best thing Uncharted.",
            "start": 871.4
        },
        {
            "text": "that. Don't worry about it. I'm Nathan Drake. I'm on the case. The shimmies, which would come. The animations are a little weird for sure. But oh yeah, but Gen 1, bro. Mhm. I think the best thing Uncharted ever gave us was Dark Sector, Dark Void. Dark Void, right? Oh yeah. Dark Sector. Dark Sector was Michael Rosenbaum on the Glaive, which is another great game. But I don't think this had much to do with that. Yeah. Little did they know this man with a half tuck shirt would go on to become. Need the flashlights for this vision. They're saying here. Oh, he just jumped everywhere. Tell me like, so that's probably how you speedrun on the. Oh, thank you. On the front. They had that speedrun thing. What is that exactly? I, I don't know. Okay. I don't know anything about it. Trophies aren't live yet either as we're playing this. Uh, so I don't know the, you know, the implication of the speedrun if we have to do that for trophies. The trophies are different apparently. Not quite respawn, huh? I don't know if.",
            "start": 920.52
        },
        {
            "text": "as we're playing this. Uh, so I don't know the, you know, the implication of the speedrun if we have to do that for trophies. The trophies are different apparently. Not quite respawn, huh? I don't know if they're totally completely different, but there are different. Imagine there's additional ones, right? Well, they had to remove two of, they had to remove them from Two and Three for sure because of the online stuff, which doesn't exist in these. Check this out. Looks like the Spanish got here before he did. I'm down. So that's actually probably worth a little bit of money. I'm up to my eyeballs in. I was really counting on this one. Oh, don't worry, Sully. You'll be fine. Too many big Bart tabs in Lima, I guess. That and well, just a few bad deals. Got scored. Yeah, well, I always told you to stay away from the bad guys and the bad girls. Yeah, look who's talking. What's that supposed to mean? That reporter. I saw the way you were eyeing her. They're in love, guys. They don't know it yet. Please. I snuffed any chance with her. The.",
            "start": 986.56
        },
        {
            "text": "the Bad Girls yeah look who's talking what's that supposed to mean that reporter I saw the way you were eyeing her they're in love guys they don't know it yet please I snuffed any chance with her the second we ditched her on that dock all's fair and loving war kid what if you can't tell the difference then my friend you are in big trouble the Spaniard sure left a lot of crap behind yeah maybe you can pay off a little bit of your debt why do you want to pay off your debt right now little patience yeah he's like already giving up just cuz oh well it isn't in the first room we went to I'm old I could die at anytime and that's the other thing you're going to die soon so what's the point you're going to die Sully got a strong n he's extremely strong that he's got really good fingertip grips here let me do that thanks Sully take the cigar out of your **** mouth and do a little work if you couldn't see yeah we knew pretty quick that wasn't going to work so maybe you could have gotten to",
            "start": 1034.32
        },
        {
            "text": "here let me do that thanks Sully take the cigar out of your **** mouth and do a little work if you couldn't see yeah we knew pretty quick that wasn't going to work so maybe you could have gotten to it quicker you never know what on side things sure all right I got to move that thing in here it's been a long time you know what I mean bring her down so all right let go sure this AO hold it hurry Sully well now we're trapped here we're going to die so bad news now you don't have to worry about that death this is no longer our fear you know this looks familiar I think there's something in Drake's Journal about this going to need some fire here oh new icon do I I just tap tap tap tap here it is looks like this thing is some kind of lamp or brazier see if you can light it so after all you're bitching about the cigar now it comes in handy huh all I'm sorry yo bro calm down all right I'm just looking out for your health you're kind of like my father and stuff nice all comes back to",
            "start": 1093.8
        },
        {
            "text": "you're bitching about the cigar now it comes in handy huh all I'm sorry yo bro calm down all right I'm just looking out for your health you're kind of like my father and stuff nice all comes back to you like riding a bike with this Uncharted very smart you're very smart they call me a Nathan Drake on why did you do that cuz that would be funny when you said oh you're one of the Smart Ones immediately jump to your death no no goddamn Diablo Nate might have been able to do that years no one's asking to do anything Sully so just relax yeah I'll as always carry your old ass Sully you've been taking advantage of me since I was a little boy see like you're coming down really fast Nate be careful barely holding on to that rope at all toss me in the lighter you're going to die so when did you give in then that this was for you um you know what I mean you're saying that you weren't you know Mark Ryan you looked at it it wasn't a game for you I think it was actually when it was patched that",
            "start": 1165.16
        },
        {
            "text": "give in then that this was for you um you know what I mean you're saying that you weren't you know Mark Ryan you looked at it it wasn't a game for you I think it was actually when it was patched that I finally went back and yeah I was like all right I'll go take a look at it it got great reviews you loved it other people loved it I just never got around to playing it at that time and then uh I went back and played and I fell it I mean I just and that's when when we got Uncharted 2 early you know in 2009 that's when I was like really really into it and then 3 obviously for you know go I still remember when we got 3 and how excited I was yeah we drove we went to get it they like we might have it we like ran down there harassing everybody we're kind of the worst yeah we really are when you look back at it like we we did that all that wasn't the only time we ever did that we were like they're like oh we'll get it after you we'll come get we'll come to you don't worry",
            "start": 1266.6
        },
        {
            "text": "really are when you look back at it like we we did that all that wasn't the only time we ever did that we were like they're like oh we'll get it after you we'll come get we'll come to you don't worry about do you want to go to lunch no we don't want to go to lunch can you give us the game and leave L thing yeah it's same happened when we got our PS4s yeah yeah I it's happened a number of times yes that's the thing is like you know we're everybody's friend we that's the thing we have the passion for video games so then we're your friends when you're trying to promote them and then when we know you have them just **** give us the game you know what I mean I'll murder somebody I'll hold your kids hostage The Last of Us was another one where was just like man I can't I can't we had it you know two three weeks earlier I was like this is all awesome the order of these signs has some importance but what the order of these signs has some importance is that how he sounded H is that how he sounded in",
            "start": 1308.84
        },
        {
            "text": "three weeks earlier I was like this is all awesome the order of these signs has some importance but what the order of these signs has some importance is that how he sounded H is that how he sounded in my mind yeah okay in my mind's ear in your mind's ear the order of these signs has some importance see what you got puzzle solver if there's a problem you solve it check out the hook while the DJ revolves it the balls on Nate Drake you know what I mean oh whoa dry poo bada bing bada Drakey so it's that the weird circly thing for yeah got to find that one that's not it I don't believe that one's it that's the face there it is that's it you got to jump over there give a little push give me the old whoopsy Daisy pushy no I'm fine Sully I'm fine no every time you like go out of his eyesight who s it's fine don't worry about it there's a guy over there what who whoa we fell a bit there bugged out a little bit all right well you can't press the circle I'm trying my man up there I can't go back he",
            "start": 1343.4
        },
        {
            "text": "fine don't worry about it there's a guy over there what who whoa we fell a bit there bugged out a little bit all right well you can't press the circle I'm trying my man up there I can't go back he looks like the No No that's him oh no it is him you're right okay got to get back up to that man who is this giant man I'm I'm John Quiñones and you're on What Would You Do? John Quiñones is like one of the biggest anomalies in my life I love that guy everyone seems to know him do you think that they film selectively so that like a thousand percent like they have to find the one person in every scenario that knows Quiñones cuz no one is like who the **** are you somebody they must fake it at some point too I'm just like Oh I thought I'd be but there are so many people who go a this looks like What Would You Do? how do you know only Colin and I are obsessed with this show oh trick no I'm pretty sure we're the only ones that actually watch it we remember when like it was like years ago now we used to",
            "start": 1433.24
        },
        {
            "text": "you do how do you know only Colin and I are obsessed with this show oh trick no I'm pretty sure we're the only ones that actually watch it we remember when like it was like years ago now we used to actually go out of our way to watch it yeah we'd be DVR that thing cuz you love it you just want to see what these people would do what would they do these lifeguards are getting **** bombed and then they're going out and saving people what would you do like I don't know Quiñones what the **** would you do why are you worried about what I'm doing I just want to watch this show why are you asking me questions can I make it back this way hard to you can climb up bro good good good good good all right Drake that was a little bit much Drake you could have made that jump you know what I'm tired guys Lollygagging Naughty Dog didn't want to do a long jump no way so this is what they got to do where are the Goddamn Pirates that's all I want to know where where are my next 3,000 people I need to",
            "start": 1487.12
        },
        {
            "text": "murder pretty deep yeah looks like there's a ladder cut into the side wait here while I check it out all right just be careful going just take the jump oh it's water right I'm pretty sure that'll be fine hey as he lets go hey watch your step down there no just bash against the rocks it would be it would be the worst cuz your shins would break first you know that's how you want man I couldn't do this no no way not my scene as they say it'll be fun be scary though yeah I like how many people I just I feel like you get trapped in these places oh yeah oh it's not realistic just like Indiana Jones okay getting somewhere the thing I always wonder with these like complex puzzles and these fake Adventures is like who the **** was making this is really complicated yeah like it's not everyone's",
            "start": 1534.48
        },
        {
            "text": "okay getting somewhere the thing I always wonder with these like complex puzzles and these fake Adventures is like who the **** was making this is really complicated yeah like it's not everyone's like wow I figured out the puzzle I'm like that's not the thing that's complicated who the **** made this yeah yeah this civilization and why you know like well I mean we find out why of course no but like you find out why in 100 hours in a totally different place you mean like yeah I am really wet some people take care of their secrets I mean they can't all be like second grade where you make a little time capsule and bury in your school's front yard this has got to be real deal so we only have about 4 minutes left for for people that don't know uh we're showing you this early but Sony has asked that we only show about a half an hour of every game so we're going to stick to that obviously we're telling them to shove it up their butts Shuhei Yoshida come for me I don't care on the other how",
            "start": 1608.04
        },
        {
            "text": "asked that we only show about a half an hour of every game so we're going to stick to that obviously we're telling them to shove it up their butts Shuhei Yoshida come for me I don't care on the other how great that be though if she ran in the house turn it off you agreed I'm sorry Shu well there's that ancient uh bunch of ancient writing no one bothered to take a digital picture of it's like the it's like the warning right the warning of don't go any further we understand you just are an adventurer you'd like to make some gold bad things that will come to you and your friends if you do this well that's the thing is that that's the big difference and people have brought this up in the past which I think is clever and funny is that Drake's not an archaeologist he is an adventurer he does not give a **** about what he is destroying at all like an archaeologist would never like like Indiana Jones was different like he did that care like Drake destroyed much more than he found he just wants to",
            "start": 1651.88
        },
        {
            "text": "a **** about what he is destroying at all like an archaeologist would never like like Indiana Jones was different like he did that care like Drake destroyed much more than he found he just wants to find out about Sir Francis Drake oh **** see that camera stuff you know what I mean that was not very impressive I got I remember no but I remember being frustrated with this in the original as well cuz like it's all of a sudden the camera like freaks out don't touch anything yeah you got to run forward yeah I hate running at the camera is stupid yeah it is thank God they figure that out no no no no no no no no no no see what I mean like all these like so much easier it's convenient now cuz so can get across but of course all this ancient uh history is ruin who were these people what did they want that we better be just chilling casual walk very very casual some place no one's been in centuries but I don't care oh man the temple must have been built around this around what a statue",
            "start": 1693.72
        },
        {
            "text": "did they want that we better be just chilling casual walk very very casual some place no one's been in centuries but I don't care oh man the temple must have been built around this around what a statue remember the statue don't touch the statue don't deal with the statue don't be around the statue gold statue a huge gold there you go just he gold he like oh good he's just as bad as the Conquistador I think they're people of course El Dorado the golden man Sully it wasn't a city of gold it was this it was a golden idol man can you imagine what that thing it be worth now look over here track I wonder whatever country they're in what the Antiquities Department would think about them just going and stealing **** and then selling it Drake don't care we're 400 years late for this party so the Trail's cold yeah it looks that way son of a **** unless unless what we follow the tracks Drake's always got a **** answer man Drake no the diggy-doo smell a gunfight stop here really no of the",
            "start": 1743.56
        },
        {
            "text": "cold yeah it looks that way son of a **** unless unless what we follow the tracks Drake's always got a **** answer man Drake no the diggy-doo smell a gunfight stop here really no of the temple blown out sure don't Spaniards must have made themselves a it's always that way though when you see like I remember there's a part on Uncharted 3 specifically when you're going to like a train station and there's like all these platforms that are barriers you have to go back through through later got up here treasure you got your treasure Silver Turtle, kaka kaka I am the Silver Turtle that was your first trophy too you got your you got your trophy oh this we're coming up on the end here more to come you hear that there's something you don't see every day there it is the old U-boat remember this one I wonder what Adventures we'll find on that U-boat how did that U-boat get here it's like lost kind of corpses would be on that U-boat right who would be waiting for us when we come out of the U-boat",
            "start": 1808.84
        },
        {
            "text": "one I wonder what Adventures we'll find on that U-boat how did that U-boat get here it's like lost kind of corpses would be on that U-boat right who would be waiting for us when we come out of the U-boat U-boat that's what the Germans called the U-boat is the U-boat uh all right so these are his warning shots that's it for us uh here with our Let's Play of Uncharted: Drake's Fortune uh from the PlayStation 4 exclusive Uncharted: The Nathan Drake Collection we're playing this of course because we want to show you the game it's exciting and exciting that these are coming to PS4 people that to play them again or if you haven't played them for the first time in anticipation of course of Uncharted 4: A Thief's End uh but we can only show you about a half an hour of the game so we have to call it quits now uh keep an eye out for our Uncharted 2 and Uncharted 3 Let's Plays which will be very similar to this one we'll play from the beginning for about a half an hour of each of those as well and remember to",
            "start": 1887.96
        },
        {
            "text": "keep an eye out for our Uncharted 2 and Uncharted 3 Let's Plays which will be very similar to this one we'll play from the beginning for about a half an hour of each of those as well and remember to watch or listen to our new PlayStation podcast the spiritual successor to what we used to do it's called PS I Love You XOXO you can find it on podcast services and here on youtube.com/kindafunnygames as of Tuesday September 9th at 9:00 a.m. first episode we're very excited about super excited happy to get back to talking PlayStation and telling Shuhei Yoshida let us change our **** name bye right you do that",
            "start": 1928.0
        }
    ]
}