{
    "id": 1167,
    "video_id": "6JjJRXdsj7w",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Infamous Games vs. Arkham Series - Kinda Funny Gamescast Ep. 34 (Pt. 3)",
    "description": "We debate the infamous series versus the Batman Series.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1441198800,
    "duration": 668,
    "transcript_chunks": [
        {
            "text": "All right, topic three of the show comes from our boy on Patreon, his name is Robert Gonzalez. Thank you so much, Robert Gonzalez, for supporting the show. Hey guys, I was wanting to know which superhero games do you prefer, the Infamous games or the Batman Arkham games, and why? And do you think Sucker Punch will make another Infamous game? And do you think there'll be more Arkham games? Wow, lots of questions. Question, I like it. I like the topic. It's in my wheelhouse, as they say. I mean, knee-jerk reaction, first blush question, I'm going to say Infamous. I I I I like those games more, and I love Batman, you know this. I I you know, Platinum Arkham Knight and obviously loved the hell out of every other Batman that there was. It's just that Infamous, I don't know, I like that. I like building something on your new, you know what I mean? I'm I'm specifically talking about One and Two, by the way. Like Second Son was fine, really good gameplay. Nobody does the scaling up a building, running off, shooting powers,",
            "start": 0.31
        },
        {
            "text": "your new, you know what I mean? I'm I'm specifically talking about One and Two, by the way. Like Second Son was fine, really good gameplay. Nobody does the scaling up a building, running off, shooting powers, jumping down, that kind of open world gameplay better than Sucker Punch. They're amazing at making you feel awesome when you play their games. Um, but Infamous One and Two, I loved the, this is brand new, you don't know what's going to happen, you know what I mean? Like that was that's was my biggest complaint about Arkham Knight is like, I'm playing a superhero game for a superhero story, you know what I mean? When we're talking about like Metal Gear, right? And that's why one of the reasons Second Son didn't work for me, right? Of like, well, Delsin kind of sucks, and what is going on? Like, you know what I mean? Like Augustine's cool, but what's uh, you know, Infamous One and Two was, I don't know, I literally don't know what's going to happen around to the next thing and what this means and making these choices,",
            "start": 47.12
        },
        {
            "text": "like Augustine's cool, but what's uh, you know, Infamous One and Two was, I don't know, I literally don't know what's going to happen around to the next thing and what this means and making these choices, how they're going to play out, you know what I mean? I like that. I like the duality of, am I going to be played as a good person? Am I going to be bad? Do I want to switch my choices here? How does it end? You know, like the Trish scenario in Infamous One, if you're good, if you're bad, and stuff like that. Whereas Batman, I feel like you know where you're going and what's going to happen and how it's usually going to play out in Arkham Knight, being the biggest example of that, of like how depressed I was when I figured out what was going to happen in Arkham Knight. I was just like, oh, really? All right, well, that's not as much fun. Colin, I'm sorry, you can chime in. No, nothing be sorry about. Uh, I agree. I think Infamous plays better. I think that um, Sucker Punch's strength was, people have to remember when",
            "start": 79.68
        },
        {
            "text": "right? Well, that's not as much fun. Colin, I'm sorry, you can chime in. No, nothing be sorry about. Uh, I agree. I think Infamous plays better. I think that um, Sucker Punch's strength was, people have to remember when Infamous came out in 2009, this game was actually pretty huge surprise. Yeah. Um, Sucker Punch was known for making Sly Cooper games. Sony didn't even own that studio yet. Uh, Infamous came out uh, after a gestation period that was pretty lengthy. I mean, it took him a while to make that game and get that game off the ground. And remember too that this was a game they had wanted to make since uh, before they made Sly Cooper. So this was this was a game that they had on their minds for a long time. Um, and the game came out, it did very well. Sony bought the studio. They made a sequel that was even better than the first one, and they really had great momentum going. And I agree with what Greg was saying that with the exception in my mind of Uncharted, Infamous is probably their PlayStation 3's best exclusive",
            "start": 111.44
        },
        {
            "text": "the first one, and they really had great momentum going. And I agree with what Greg was saying that with the exception in my mind of Uncharted, Infamous is probably their PlayStation 3's best exclusive franchise. Um, like games that there were multiple games or whatever, because I don't want, you know, The Last of Us obviously is like really the cream of the crop, but sure. Um, and I agree with Greg that Second Son was pretty disappointing. Um, not from a gameplay perspective, because as Greg, as Greg noted, the traversal and the parkour and the combat in Infamous games is universally awesome. It's it it's it's not something that they've messed around with uh, to to the detriment of the game. The storytelling is was a little weak. Delsin, as Greg said, is a damn awful character. And and like who really cared about like what was going on in the game? Augustine, I again again, I agree. Augustine was a great villain, just wasted in that game. Um, and Fetch was great too, and that's why it was cool to get First",
            "start": 151.32
        },
        {
            "text": "about like what was going on in the game. Augustine, I again again, I agree. Augustine was a great villain, just wasted in that game. Um, and Fetch was great too, and that's why it was cool to get First Light. And it's like, well, we just make games about her, you know what I mean? Like, yeah. So it's it's so in terms of gameplay, and I think gameplay is king, that those things matter. I would say the Arkham games, having played and beaten Arkham City, and then most of or Arkham Asylum, and then quite a bit of Arkham City, and then all the way through Arkham Knight. I never played Arkham Origins. Um, Arkham Knight, especially Arkham Knight, I think nails aesthetic. I think it nails story. I think it nails voice acting. I think it nails all of those things like almost better than anyone. Um, I probably give combat to the Arkham games. Really? Yeah. Oh, because I was going to say, I think the combat Arkham games is boring, and uh, it's like what I look forward to least. Like, I think traversal and all that kind of stuff is just wonky.",
            "start": 192.32
        },
        {
            "text": "Arkham games really? Yeah. Oh, because I was going to say, I think the combat Arkham games is boring, and uh, it's like what I look forward to least. Like, I think traversal and all that kind of stuff is just wonky. The traversal, I'm not talking about traversal. Traversal, heads and shoulders, Infamous, shooting up poles, doing all this stuff, climbing up the wall, just the fact you can scale any wall you see. But like for me, at least in the Infamous One and Two, I don't know how you feel, like combat always came down to this and then just like side sliding around people and trying to shoot them in the head. Whereas Batman, yeah, it's it's uh, what you call repetitive, or I'm sorry, I lost the Batman is the same thing over and over again, right? But it is that uh, I I feel like damn Batman when I do it, you know what I mean? I feel powerful. I feel like a superhero. Yeah, what bothers me about Batman games, specifically Knight, which I think did it quite definitively, is it locks you. I don't like these arbitrary arenas. Like I",
            "start": 230.2
        },
        {
            "text": "I feel powerful. I feel like a superhero. Yeah, what bothers me about Batman games, specifically Knight, which I think did it quite definitively, is it locks you. I don't like these arbitrary arenas. Like I don't like like when you encounter enemies and it's like, all right, now we're going to fight these enemies like here. It's like what I loved about Infamous was like, I don't have to fight these guys at all. And like I can just I can fight more of them. I can drag these two groups together and and um, blow them all up, you know, do whatever. Like I felt like there was a lot of, we used the word earlier, there's a lot of agency in the way you fight in Infamous. And also Infamous has uh, two different ways to play the game. Like really, like you're good and you're bad, and you're going to get different powers and different stories. Stories, I mean, so I think I think it was surprising that they didn't do more with with Second Son. I think the game's very pretty, um, and it runs well. And and especially the neon power, I",
            "start": 267.32
        },
        {
            "text": "stories stories. I mean, so I think I think it was surprising that they didn't do more with with Second Son. I think the game's very pretty, um, and it runs well. And and especially the neon power, I think is great. The video power is great. I like how they have unorthodox powers. It was it was like neon, video, and concrete and stuff like that. Like I like I liked that that was smoke and smoke. I I thought it was interesting. It's not like ice and fire like they used before. It's like things that you would never think of. I thought that was really really nifty. But um, the one thing I'd love to see, I mean, when we're talking about comparing these two things that Infamous didn't get in One and Two, and I really thought they were going to get it in Second Son and didn't, that Batman nails is weaving it all together and making it feel natural. Like for Infamous One and Two, when they were basically like open world superhero game, they were kind of like making it, they that was like their thing, right? Of like,",
            "start": 302.84
        },
        {
            "text": "and making it feel natural. Like for Infamous One and Two, when they were basically like open world superhero game, they were kind of like making it, they that was like their thing, right? Of like, you're on the map and you're going and you see like the camera icon pointing down of like, oh, there's a camera mission there. I was like, okay, cool. And that's fun and that's great. But it was like reminding that you're in a game and this that and the other. Whereas in Second Son, they did it again. And I was like, oh, all right, this is supposed to be this is Seattle. It's a super beautiful city. It looks photorealistic. Why would there still be this like thing pointing down? Whereas in Batman, right? Like you shoot up the side of the building and damn Man-Bat roars in your face where you're going and you hear the opera music and you have to go find that. And then swinging it all around the Riddler Trophies, the way it's all one world, it didn't feel like segmented parts that were pasted onto the world. Yeah, I mean,",
            "start": 337.24
        },
        {
            "text": "opera music and you have to go find that and then swinging it all around the Riddler Trophies, the way it's all one world, it didn't feel like segmented parts that were pasted onto the world. Yeah, I mean, the the the brilliant, it's same thing I think with Assassin's Creed, which I just don't like where it's if you could just take that world, that Assassin's Creed world or that Arkham Knight world and those characters and the storytelling and just give it better gameplay, then the game to me would have been way better. So I think I think in I think Second Son beats Arkham Knight hands down in gameplay, but I think Arkham Knight beats it in every other way, you know, like I and that's not really I I think that Infamous is set a very high bar for gameplay, so I don't think it's really an insult to Arkham Knight. I liked playing Arkham Knight. I thought it was fun, but I was more impressed with its production value than anything else. I think the combat is the same. It's just I I found the I disagree in the sense I",
            "start": 372.4
        },
        {
            "text": "Knight. I liked playing Arkham Knight. I thought it was fun, but I was more impressed with its production value than anything else. I think the combat is the same. It's just I I found the I disagree in the sense I found the combat stilted and arbitrary, you know, like I really did. It's just like punch punch punch punch punch. This guy has a shield, punch punch, jump punch. This guy has, you know, a lightning thing, hit him with your, you know, your quick attack and then punch him. Like it's just like it's the same thing over and over again. I was just like, there's something about the the look of it though. Like just watching the combat of Batman, even even if both games really just come combat in games usually like those type of third person games pretty repetitive and just like there's a bunch of guys do the same move that affects them the most, you know? But like watching the Batman stuff, no matter how many times you see the animation, it looks slightly different, you know, there's always like the camera's a little",
            "start": 408.92
        },
        {
            "text": "that affects them the most, you know? But like watching the Batman stuff, no matter how many times you see the animation, it looks slightly different, you know, there's always like the camera's a little bit different, the way he does it, like just transitioning between the enemies and stuff. It looks so fluid. Whereas an Infamous, like doing the just the thing, it looks like a a stilted animation that like reminds you this is a video game. Yeah, but and I I don't necessarily disagree with you, but I will remind you that Infamous combat isn't predicated by its aesthetic, right? Like the reason you could just keep hitting the square button and you're just going to jump from any enemy, it's just going to happen automatically in Batman. Like if you kill an enemy in Infamous, he's dead and you can keep shooting in that direction, but it's not going to like automatically point to the next enemy. And what I liked about that was I'm reminded by the Gatling gun enemies that you meet like halfway through Infamous.",
            "start": 444.6
        },
        {
            "text": "in that direction, but it's not going to like automatically point to the next enemy. And what I liked about that was I'm reminded by the Gatling gun enemies that you meet like halfway through Infamous, later in Arkham Knight, where you have to start attacking and and then they you have to quick time them four times. Like they'll start to swing, you you have to and you just kill them the same way every time. If that enemy was an Infamous, you would be able to kill him like in 10 different ways, you know? Like and that that's, you know, so I just I just I look at it through that lens where I just don't feel like there's a lot of choice in Batman. I don't think it's I the fun part about Arkham Knight to me was the story and the characters. What a great they did a really great job of putting that city together. And I thought it was fun to kind of traverse, and I always kind of dreaded the combat. I was just like, yeah, I like the combat in In the same spirit as Arkham Asylum, where I'm sneaking around and like the",
            "start": 477.44
        },
        {
            "text": "I thought it was fun to kind of traverse, and I always kind of dreaded the combat. I was just like, yeah, I like the combat in In the same spirit as Arkham Asylum, where I'm sneaking around and like the uh, the two the two missions I think were awesome, going to the banks and stuff. Yeah, so I I I like the strategic element. Once the element of surprise is lost, like it's just like, Jesus Christ, you know, like uh, it's Batman. Hey, Batman. Yeah, and they're looking around. But I thought Batman over here. But I did, there were cool elements in the game with in Arkham Knight, which I don't think is in the other Batman games, which was like, you can disable their guns, you can disable their healing packs, you can disable like all these things like using your special weapons and stuff. So I thought that was cool. It was last question, is Sucker Punch going to make another Infamous game? No, uh, they they are if Shuhei Yoshida told us at E3 on our live show that he had already played a portion of their next game, which",
            "start": 508.28
        },
        {
            "text": "it was last question, is Sucker Punch going to make another Infamous game? No, uh, they they are if Shuhei Yoshida told us at E3 on our live show that he had already played a portion of their next game, which indicates to me that they had been working on this game for a while before Second Son probably even came out, and that it's not an Infamous game. Um, because there's just no way a studio, you know, I was there, that studio is big. I mean, it's a big studio, but when I was there right before Infamous came out, it looked like all hands were on deck for Second Son, but it seems like they were working on something else the entire time. Um, so my assumption is based on their pedigree, it'll be a similar game, third person, open, just like Sly, just like Infamous, but it'll be something else. Hmm, yeah. And what about Arkham? Arkham is a big question, right? Um, I I they didn't my whole prediction leading up, I guess spoilers for Arkham Knight, not really on a thing that didn't even happen, so whatever. Um, you know, I predicted forever,",
            "start": 541.72
        },
        {
            "text": "is a big question, right? Um, I I they didn't my whole prediction leading up, I guess spoilers for Arkham Knight, not really on a thing that didn't even happen, so whatever. Um, you know, I predicted forever, right? That like, oh, Superman's going to show up in this game, and that'll set up the Justice League game or whatever, right? And that doesn't happen. However, a million references to Superman, phone calls from Lex, Daily Planet things, Keystone City things. I mean, there's like they're making references to, hey, guess what, there is the DC Universe here, this is happening. And so I still think a Justice League game isn't out of the question in terms of like the next game is, and this I won't spoil it, but I think the game, the way the Batman Arkham Knight ends, could leave itself open to a Justice League game of like, all right, cool, now we all come together to do this one thing and figure out what's happening. Yeah, I'm I I think you're probably right from Rocksteady's point of view. I think that I'm surprised,",
            "start": 586.88
        },
        {
            "text": "like, all right, cool, now we all come together to do this one thing and figure out what's happening. Yeah, I'm I I think you're probably right from Rocksteady's point of view. I think that I'm surprised. I think there's 100% going to be another Rocksteady game, you know, like they have this engine and they're just going to give it to another studio and just be like, here you go, you know, like make your make your Origins. And yeah, like I I think they'd be foolish not to do that in the meantime. Like let Rocksteady like really marinate and give, you know, Montreal or another WB Games Studio a chance to make their own Batman game. It seems to that seems to make the most commercial sense. Yeah, no, I agree. I I still yeah, I think we're on the same page. Yeah, I was just talking about rock awesome.",
            "start": 627.52
        }
    ]
}