{
    "id": 1184,
    "video_id": "6UiBRIz4Ylw",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Mega Man 4 Entire Game Full Playthrough - Kinda Funny Plays",
    "description": "Colin Moriarty beats Mega Man 4 on the Mega Man Legacy Collection. Come back tomorrow for Mega Man 5!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1441911600,
    "duration": 4650,
    "transcript_chunks": [
        {
            "text": "all right so today we're going to jump into Mega Man 4. Now my affinity for Mega Man 4 has grown over the years. Mega Man 4 is still out of the six Mega Man games on NES, my second to least favorite, Mega Man 1 being my least favorite actually. Uh, but Mega Man 4 has grown on me, uh, for multiple reasons. I think it's actually very well made. Uh, it's a very well-made game. Robots are interesting. Uh, difficulty is right. Introduces kind of a different kind of plot. Um, but, uh, yeah, we'll get into it. I want to watch the intro first because this is the most robust intro so far in any Mega Man game. Um, and I actually really dig the intro too. So let's enjoy it. I'll be quiet for a minute. I love this shot of him on the train. So awesome. And I like the text, \"Mega Man Shattered Dr. Wily's plans three times.\" And we so far, but history repeats itself. Of course it doesn't, Mega, but it's not what you think. It's Dr. Cossack. So what they're referring to here, the Mega Buster is a new, uh, introduction to Mega Man 4, 5, and",
            "start": 1.68
        },
        {
            "text": "so far, but history repeats itself. Of course it doesn't, Mega, but it's not what you think. It's Dr. Cossack. So what they're referring to here, the Mega Buster is a new, uh, introduction to Mega Man 4, 5, and 6. And then it's carried on to later games too, where you can hold down the attack button, the B button on the NES controller, and power your charger up and use it to great effect. I believe in reading some of, um, some of Inafune and his and his crew's kind of writing later is that they don't really feel like that, that they kind of broke up the purity of Mega Man. The slide was a good addition, but the Mega Buster maybe not so much. So 9 and 10, obviously it was removed. Um, so here with Mega Man 4, we're going to start with, um, we're going to start here with Toad Man stage. And Toad Man stage is interesting because, um, well, well, it's raining and it's not just an aesthetic thing. If I jump forward, you see how I can barely move and I actually get moved backwards. Um, so this is used, this is like the",
            "start": 93.52
        },
        {
            "text": "because, um, well, well, it's raining and it's not just an aesthetic thing. If I jump forward, you see how I can barely move and I actually get moved backwards. Um, so this is used, this is like the mechanic used on this particular stage. Um, so a jump like this, which would be very easy usually, is actually not easy at all. You have to be like very careful, maintain yourself here. So there's no easy jumps. But we start here because he's an easy enemy to interrupt during his attack. He uses an attack called the Rain Flush, uh, which needs to be used, uh, and he needs timing to like power it up. So you can interrupt him and he never gets it off. And so he's a good place to start. And unlike Mega Man 2 and 3, there is a defend, like there is a place to start and you can cycle through the enemies completely. You don't have to start here, of course, you can start elsewhere, but this is the most obvious place to start and this is where most people do start. So we kill that mini boss and we continue on.",
            "start": 147.44
        },
        {
            "text": "have to start here, of course, you can start elsewhere, but this is the most obvious place to start and this is where most people do start. So we kill that mini boss and we continue on our way. Oh man, we should do it. There we go. All right, so we're continuing on here. You can kind of line these fish up and just be patient, wait for them to come. That guy will just go under you. This one here, he'll come and pop over you. Just shoot him as he comes. I mean, they'll just, they're basically just hopping over you. All right, and we are at Toad Man's lair. So you can charge up our Mega Buster to get the first hit off, but then we'll just be kind of hitting him eventually. And you see this, this, this fight's a little boring, but this is the way you just got to kind of do it. So he'll, as long as you keep hitting him, he'll just keep jumping over you and you just have to be patient. So yeah, this is it. And then you get his attack, the Rain Flush, once he's killed. We're almost there. Two",
            "start": 189.32
        },
        {
            "text": "as long as you keep hitting him, he'll just keep jumping over you and you just have to be patient. So yeah, this is it. And then you get his attack, the Rain Flush, once he's killed. We're almost there. Two more and then that's it. So Toad Man is no more. So we got the Rain Flush. We're also going to get a Rush device. Rush is back, of course. This time we're going to get the Rush Marine. Again, not so useful in this game, but it's there. We want to use it. So with Toad, we're going to go to Bright Man. Uh, Bright Man's a strange character. The music on this stage is awesome though. Um, on he does have a light on his head. Kevin is laughing because he has a light bulb on his head. So here there's a light dark dynamic just like in, um, Shadow Man stage in Mega Man 3. When you destroy those light bulbs, the lights go out. And when you destroy the, uh, see there, those guys that shoot fireworks, they'll light, they'll stage your light back up. So it's a cool little mechanic. These grasshoppers will be your conduit over the",
            "start": 293.96
        },
        {
            "text": "and when you destroy the, uh, see there, those guys that shoot fireworks, they'll light, they'll stage your light back up. So it's a cool little mechanic. These grasshoppers will be your conduit over the spikes. We can actually, there is health up there. I might as well just go get it in case we need it. All right, so we continue on. The music's so good. Can you hear the music, Kevin? Mhm. Isn't it awesome? Great. So this part of the stage marks the very first time in a game where there's a split in the path that leads you to a dead end. Um, but there's a reason to go to the dead end. It's to get the E-Tank and the extra life. Um, but on the way back, you're going to be tricked into thinking you can make those jumps and you cannot. Uh, so you break out the Rush Coil that you start the game with. Um, and you spawn it at the end and you can just jump over these things. God, I **** love this music, Kevin. It's emotional. This is not what I wanted to happen. There we go. Why you glowing? Cause I'm",
            "start": 387.0
        },
        {
            "text": "with, um, and you spawn it at the end and you can just jump over these things. God, I **** love this music, Kevin. It's emotional. This is not what I wanted to happen. There we go. Why you glowing? Cause I'm powering myself up. Kevin was asking why I was glowing. I just want to make sure in case, just in case, no one lives. No one lives, Kevin. All right, this part's a little hairy. This part's tough. So this part gets a little crazy. The green platforms go back and forth. They'll stay in perpetuity. The red platforms, ****, we got to start back here. The red platforms, um, don't. And you, if you brush the other platforms, they'll just start going. So it gets a little crazy. Hopefully we'll do it this time so I don't have to carry on too long. There we go. That's what I wanted to happen last time. At least we get to listen to more of this **** rat ass music. Don't jump the gun there. Remember the rule, Kevin. No one lives now. Yeah, okay. I'm actually going to let this guy live. What the rule? Want lights on? Yeah, I'm going",
            "start": 479.76
        },
        {
            "text": "to more of this **** rat ass music. Don't jump the gun there. Remember the rule, Kevin. No one lives now. Yeah, okay. I'm actually going to let this guy live. What the rule? Want lights on? Yeah, I'm going eventually have to kill one of them. There we go. Those bullets are catch up real quick. There we go. Pass. No, that was stupid. That was a dumb thing to do. All right, um, so here we are. Uh, we'll use the Rain Flush on Bright Man. There's only enough Rain Flush to be used to kill him completely. So you need to be judicious with it. And you shoot something up in the air. I'll show you. You'll see exactly how it works. And like Bright Man or like, uh, Flash Man, he can stop time. But if you stay in the air, he can't hit you. But then he'll run in you and he actually does more damage that way. So it's not always the smartest thing to do. And that's Bright Man with his big **** light bulb on his head. And next we'll go to Pharaoh Man, uh, who's a cool design. Pharaoh Man's a tough, tough, tough enemy to fight except for",
            "start": 563.52
        },
        {
            "text": "the smartest thing to do. And that's Bright Man with his big **** light bulb on his head. And next we'll go to Pharaoh Man, uh, who's a cool design. Pharaoh Man's a tough, tough, tough enemy to fight except for if you have Bright Man's weapon. Pharaoh Man stage, along with Dive Man stage, also have alternate, alternate, um, items that you don't necessarily have to find. And this is the first time since the Magnet Beam, really, that something like this had appeared. And really the Magnet Beam was necessary to beat the game. So these are the first time you'll find items that you don't actually have to find and you don't need, um, but you should still get anyway. I'll show you where they are. So here's Pharaoh Man. Pharaoh Man is one of the more popular designs, um, in the Mega Man Robot Masters. What his purpose? Archaeology robot, I would assume. See, that's, that's what's, that's what's fun to me is, is thinking about if I re, if I wrote Mega Man, if I rewrote these games and was writing them to modernize them, I would, I would have a lot of fun with",
            "start": 656.08
        },
        {
            "text": "that's, that's what's, that's what's fun to me is, is thinking about if I re, if I wrote Mega Man, if I rewrote these games and was writing them to modernize them, I would, I would have a lot of fun with like what these guys were really supposed to be doing. I think it'd be cool. Like I would tell you like he was created to be on an archaeological site or something like that. That would be interesting or whatever. Oh man, I usually don't get hit all here. So here, just to be safe, we're going to use, um, the Rain Flush just to get rid of this guy. And the reason that is, is because I don't want to get hit and knocked into this hole because then we can't get what we're looking for. If we jump over this, it's not immediately obvious, but if you jump over this, there's a secret area over here. And in this secret area, you'll find exactly what we're looking for. And what we're looking for is the Balloon Adapter. So we start in Pharaoh Man's base. Now our health is replenished, which is why it's not really",
            "start": 701.68
        },
        {
            "text": "area, you'll find exactly what we're looking for. And what we're looking for is the Balloon Adapter. So we start in Pharaoh Man's base. Now our health is replenished, which is why it's not really a big deal that I was getting hit. And we continue on our way. These bats, of course, you'll remember from Mega Man 2, they are in Wood Man stage amongst other places. Okay, we continue on. We just don't even have to mess with those bats. You could farm them if you needed to, need some energy, but you don't really have to. Here we continue along. Now this is when new enemies are introduced, these mummies that shoot their own heads. That's **** awesome. They spin it by unwrapping it. Yeah, they spin it by unwrapping it. Yes. And you can kill them before they get their heads off if you can. Otherwise, you can just dodge them. But you should kill them because they'll go back into the wall then come back again. So we're already at Pharaoh Man stage. We can use the Bright Man's Time Stopper, um, and we'll use",
            "start": 741.84
        },
        {
            "text": "but you should kill them because they'll go back into the wall then come back again. So we're already at Pharaoh Man stage. We can use the Bright Man's Time Stopper, um, and we'll use it on Pharaoh Man rather, I'm sorry, to to great effect. So I've already used it and so he doesn't move and you jam away on him. I will get him really near death and I'll, I'll show you what he, what he actually fights like. It's insane why you need to fight him like this. That's so sad. All right, so he's almost down to his last health. Okay. And then so, I mean, he's, he's Sandstorm. It's a Pharaoh Shot, he calls it. Yeah. And it's a little Easter egg because it shows you that you can charge it. It's the first weapon that can be charged in the Mega Man series since the Atomic Fire that Heat Man used. Um, but it indicates you, there's no indication in Mega Man 1 that you can actually do that. No one really knew that you can even do that until you figure it out yourself. So that I think him using it like that",
            "start": 820.36
        },
        {
            "text": "it indicates you, there's no indication in Mega Man 1 that you can actually do that. No one really knew that you can even do that until you figure it out yourself. So that I think him using it like that is an indication that you can use a fire shot like that as well. And you will use it like that. So with that, we go to the next enemy who, who is Ring Man. So we were asking like, what is Ring Man's purpose? I would assume that he maybe in a Mega Man rewrite might be at like a, a mine shaft or something like that. Like he's a precious metals robot or something. To deal with these enemies quickly, we'll use, uh, the Toad, uh, Toad Man's Rain Flush. Just get rid of them. The scene. Mhm. And we could use it again here on these little Saturn enemies if we wanted to. We will. And then we'll use it one more time. **** that was stupid. Got to shoot it quicker. It might not be quick enough. Still there. Quick enough though. Here we'll fight a mini boss. He, what'd you say? Do we see you? Do see. That was very clean. But nonetheless,",
            "start": 879.52
        },
        {
            "text": "was stupid. Got to shoot it quicker. It might not be quick enough. Still there. Quick enough though. Here we'll fight a mini boss. He, what'd you say? Do we see you? Do see. That was very clean. But nonetheless, he's dead. Those buzz saws can only be, be killed with Ring Man's weapon, which is why it's devious that they're here. But we are going to trick this a little bit. Once this guy goes away, we'll go in and grab this and get the hell out of there. If you get trapped in there, you are in a bad shape. So be careful if you're playing the game. And the buzz saws will speed up if you're on the ground with them. Here's another mini boss. Just got to time your shots. Oh, too early there. Too early there. We go. Then another mini boss. You like, you like yourself some hitos. So here there's another character introduced in Mega Man lore in this game. His name is Eddie, known as Flip Top to some people. And he appears and just gives you random items. And this is the first time you'll encounter him in the game.",
            "start": 942.16
        },
        {
            "text": "introduced in Mega Man lore in this game. His name is Eddie, known as Flip Top to some people. And he appears and just gives you random items. And this is the first time you'll encounter him in the game. Gave me an E-Tank. That's huge. That's very rare. Very rare drop. Is there any like reason why he exists? No, no reason. Dr. Light made him presumably to help. I don't know. And like only put him in certain spots, I guess. Like he just appears. I don't know. Don't try to use logic here. Doesn't work. So you can see that these things are going backwards. The, the ones that are solid color to go the other way. And there's a super devious **** drop over here as you're going to see here where you have to start moving immediately. Jeez, too early. There we go. Now we are to Ring Man's lair. Now we can use the Pharaoh Shot here. And you can see I can charge it over my head. Now, how many playthroughs did it take young Colin to like figure these all these tricks out? Um, I mean, a few, a lot. I mean, in, I don't know if you",
            "start": 1047.6
        },
        {
            "text": "shot here and you can see I can charge it over my head. Now, how many playthroughs did it take young Colin to like figure these all these tricks out? Um, I mean, a few, a lot. I mean, in, I don't know if you can hear Kevin or not. He's asking how long it took me to figure how to play it like, like this. When you don't to play Mega Man, you want to play Mega Man. When Mega Man 9 and 10 came out, I was working at IGN and they're just like Mega Man 2 and 3 in many ways. And you just, just know how to brute force your way through the game and figure it out. You're not playing super well at first. You just figure things out and you know how to play or you don't, you know. So it all, I think the beauty of these Mega Man games is, Mega Man games, they all the skills translate. All right, so, uh, Ring Man is done. And so with that, we go to Dust Man. What was a giant vacuum on his head? Was TV cool stage. Cool music. Like real cerebral, strange music. Here these Shield enemies are introduced for the first time, time, which are, I think they're",
            "start": 1129.04
        },
        {
            "text": "Dust Man. What was a giant vacuum on his head? Was TV cool stage. Cool music. Like real cerebral, strange music. Here these Shield enemies are introduced for the first time, time, which are, I think they're just machines of some sort. Oh, jeez. There we go. Jeez, you got to deal with those guys quick, Kevin. Quick. Jeez. Oh, Dust Man, you mean? Yeah, no idea what, what he's doing. I would, you know, again, if I was rewriting, there's Eddie again. If I was rewriting it, it would be, I would make him like an industrial robot or something like, which is kind of what he is here. So you want just be thorough here, just in case. You can be crushed very easily here. You'll die instantly if you are. And here you want to be really thorough because you're going to need to slide. See if we can do this. And then you're going to need to kind of go back. You have any memories of like playing this for the first time being like, God damn it, trying to slide back? Yeah, me. Mega Man 4, I remember playing for the first time because I rented it. I couldn't",
            "start": 1182.4
        },
        {
            "text": "of go back. You have any memories of like playing this for the first time being like, God damn it, trying to slide back? Yeah, me. Mega Man 4, I remember playing for the first time because I rented it. I couldn't afford it at the time when I was a kid. Um, I owned 2 and 3. I didn't own 1 until later. And I bought this eventually, um, when it was a little cheaper. But I remember renting it from a place called TriStar Video. Uh, and I remember liking it, but I remember being a little disappointed with it for some reason. I, I always felt like the, the, the enemies in the game are a little underwhelming, like the bosses compared to the other rosters both before and after, with the exception of maybe 1, which is a pretty boring roster of enemies. Yeah, I remember playing it pretty well. So we're at Dust Man. Uh, his, uh, weakness is the Ring Boomerang. And you can see here, it comes back to you. Dust Man's similar in some respects to Magnet Man. And then he can suck you in for, for Mega Man 3. He also shoots these things",
            "start": 1318.2
        },
        {
            "text": "weakness is the Ring Boomerang. And you can see here, it comes back to you. Dust Man's similar in some respects to Magnet Man. And then he can suck you in for, for Mega Man 3. He also shoots these things called Dust Crusher at you, which split up. So you just kind of want to, yeah, when you, when he's sucking you in, you can't, it can't attack him yet. Exactly. But otherwise, you just stand your ground and just deal with them. Got to face directly underneath the vacuum. Yeah, it's awesome. They're so well designed. They are well designed. And for people that don't know out there, so Mega Man 1, all the enemies, Mega Man, Roll, Light, Wily, and then Elec Man, Bomb Man, Fire Man, Ice Man, um, Elec Man, and Cut Man were all designed by Inafune, the creator of Mega Man. After that, people would submit their designs to Capcom and they would, so all the enemies in 2, 3, 4, 5, and 6 were created by fans. And then Inafune would draw them in the Mega Man style to like make sure that they were all congruent with each other. And I always",
            "start": 1367.48
        },
        {
            "text": "so all the enemies in 2, 3, 4, 5, and 6 were created by fans. And then Inafune would draw them in the Mega Man style to like make sure that they were all congruent with each other. And I always loved that. I always gave it, always gave Mega Man a feeling of interactivity. And when we get to Mega Man 6, Mega Man 6 is the only Mega Man game with the boss design contests being held where there's an American and a Canadian robot in it. All the other ones are Japanese. The American robot, the American robot is, I think, Wind Man. And the Canadian robot is Knight Man or vice versa. You watch Sunny? I do watch Sunny, but I'm not, uh, watch, yeah, I've not seen every EP. I've seen every everything maybe through the fourth season and then sporadic from there. There it is. Oh, ****, I didn't mean to do that. It is a great job. So here we've moved on to Skull Man. There's Eddie again. What does he got for us this time? Energy. Could be useful sometimes. Didn't need it this particular time. So here we can continue to",
            "start": 1414.76
        },
        {
            "text": "is a great job. So here we've moved on to Skull Man. There's Eddie again. What does he got for us this time? Energy. Could be useful sometimes. Didn't need it this particular time. So here we can continue to climb up or we can go right. Again, there's going to be a dead end here just like on Bright Man stage. But again, we're going to want to, uh, go down this path because there's an E-Tank down here. So to get to it, you'll, you can use the Balloon Adapter that we found in Pharaoh Man stage, which acts a lot like Item 1 in Mega Man 2, as you can see. And then we can get back up here and then switch back over and just jump over the shield as we see it. And then slide along and then back to the ladder and then go up. Yeah, it's like a, yeah, I think this is like an archaeological dig. And this is Dust Man. This is Skull Man. Oh, Skull Man. So there's another E-Tank down there. It's precarious to get. We will get it. I might die getting back, but it's worth getting. So this jump can be really tough. You got to just deal with this",
            "start": 1464.16
        },
        {
            "text": "oh, Skull Man. So there's another E-Tank down there. It's precarious to get. We will get it. I might die getting back, but it's worth getting. So this jump can be really tough. You got to just deal with this guy. Grab this. And then so we can go back. But there's going to be a problem in that this guy over here is going to be shooting at me. So we'll use the Bright Man's weapon to stop him from doing that. And then we'll jump and get back over. Perfect. You could, you could, not sure what the rain effect would be on Skull Man, those Skull Man enemies. Never tried it. So here you have to use, uh, Pharaoh Shot against these guys or they won't die. It is, it's supposed to be like dusk, I think. Okay, we are to Skull Man now. Skull Man, uh, uses, uh, the famous Shield weapon that, uh, started with Wood Man and then began, continues with Skull Man, continues with Star Man and Mega Man 5, continues with Plant Man and Mega Man 6, etcetera, etcetera. Go to Pump Man and Mega Man 10. But he doesn't use it quite as often as those enemies do. There it is. And he's up. So that's",
            "start": 1552.88
        },
        {
            "text": "with Star Man and Mega Man 5, continues with Plant Man and Mega Man 6, etcetera, etcetera. Go to Pump Man and Mega Man 10. But he doesn't use it quite as often as those enemies do. There it is. And he's up. So that's Skull Man. We get the Skull Barrier from him. All right, we only have two choices left. We'll go to Dive Man this time. Dive Man's a really cool character. I think I like his design a lot. He's a pain in the ass to fight. Good music here too. These, uh, mines can't be destroyed. So you just have to avoid them. Again, you have incredible buoyancy and jump and hop in these on these underwater stages. Although this isn't a fully underwater stage as you're going to find out. Fight this whale. Eddie again. What's he got? Perfect. What, Eddie? I don't know why they name that. Oh, ****, he's going to respawn. Sad that I knew that. All right, so now the water goes up and down here, which makes it a little more difficult to navigate. Fight the whale again. Angry. No, he does look a little angry there. But it is. All right, so here's a",
            "start": 1631.12
        },
        {
            "text": "all right, so now the water goes up and down here, which makes it a little more difficult to navigate. Fight the whale again. Angry. No, he does look a little angry there. But it is. All right, so here's a secret. You can keep going to the right. Well, let's, let's not do that. Let's go down here. Oh, ****. And here we'll get the Wire Adapter, which is another item you don't necessarily need to have, but it's useful. And then it'll bounce us, unlike Pharaoh Man stage, which bounced us forward. This will actually bounce us back. And we'll have to do a part of the stage again that we've already done. But as you can see here in the start menu, now I have Wire and Balloon. So I have both of the secret items that you don't have to find, but are there for you to find if you are interested. What, what can you do with a wire? The wire shoots upwards. So you can like grapple, um, ceilings with it. It'll be useful in Wily's Castle. So here we're back where we were. We can hop over this this time and continue to the right. So these mines when",
            "start": 1762.76
        },
        {
            "text": "shoots upwards. So you can like grapple, um, ceilings with it. It'll be useful in Wily's Castle. So here we're back where we were. We can hop over this this time and continue to the right. So these mines when you get closer to them will explode. We want to keep your distance. Slide on them if you want, like that. Jump between those. And we have arrived. And so here we're going to use Skull Barrier. Now some people opt to actually start with Dive Man and use the arm cannon on him. I find him a bit of a pain in the ass to fight. And the Skull Barrier is hard to use on him, um, because you have to get really close to him, which is an ideal. And he shoots missiles and ****. So would you make a great Dive Man? I think so. And that's it for Dive Man, which leaves us with only one, uh, enemy left. That's Drill Man, who looks a lot like Crash Man for Mega Man 2. So is that him getting teleported? Yeah, it's him like teleporting. It teleport. I know. It's a good question. Drill Man. Very literal. Very literal stage to. Okay, here it",
            "start": 1828.52
        },
        {
            "text": "a lot like Crash Man for Mega Man so is that him getting teleported yeah it's him like teleporting it teleport I know it's a good question. Drill Man, very literal, very literal stage too. Okay, here it seems like you can rush through, but I suggest you don't deal with the bats if you can, at least a couple of them to clear your way, or you're going to maybe get knocked into the spikes. Uh, that extra life down there can be gotten, but it's a bit of a trap. Uh, R into the E-Tank placed or the extra no, it is an E-Tank placed in Metal Man at the end of Metal Man stage, just something you don't want to go there because it's hard to jump out, you see. So these guns, you have to kind of time your shot. They only take one hit to kill though, which is useful. There's an E-Tank up there, obviously we're going to need that and want that, so let's go get it. Cruising along, we're almost to the end now. This thing's got a little hairy here, and so you're going to want to use a Skull Barrier here to just deal with",
            "start": 1902.76
        },
        {
            "text": "to need that and want that, so let's go get it. Cruising along, we're almost to the end now. This thing's got a little hairy here, and so you're going to want to use a Skull Barrier here to just deal with these rocks that appear in these guys as well. Ah, it's a little problematic that no one has dropped any weapon energy for me yet. **** Uh, got to go. The slow down killed me there. Yeah, so I'm out of Skull Barrier. I'm going to have to farm a little bit, unfortunately. I do apologize about that. I might be able to get through without it. We'll see how many times you die in this game. That was my first time. That was just a stupid jump. I was getting overwhelmed. There was too much slow down for me to jump, make that jump. I'm worried about. I need this thing to drop something for me. There we go. I don't even care about getting handed by these enemies at this point. Get through. I'm out again. I almost thought I was going to make it again. All right, we're to Drill Man, so Drill Man's a bit of a pain in the ass.",
            "start": 2016.04
        },
        {
            "text": "care about getting handed by these enemies at this point. Get through. I'm out again. I almost thought I was going to make it again. All right, we're to Drill Man, so Drill Man's a bit of a pain in the ass. We'll use the Dive Missiles Dive Torpedoes here on him. He can go in and out of the ground, uh, and he's invulnerable when he does that. So this first hit is probably going to bounce right off him. See? Yep. Well, if it hit him, I would have bounced off him. So you kind of want to keep just moving and nailing him and see it bounce off in there. Okay, he does a lot of damage when he hits you. There we go. And the missiles also bounce off of his drills. So he has two shields basically. Anyway, that's the end of Drill Man, and now we the eight Robot Masters are done, and now we go to Dr. Cossack, uh, or Cossack, Dr. Cossack, depending how you want to say it. Uh, we go to his stage or his castle, 'cause he apparently made these robots or at least programmed them to be like this. At least that's the rumor. They you can your seat",
            "start": 2113.48
        },
        {
            "text": "depending how you want to say it. Uh, we go to his stage or his castle, 'cause he apparently made these robots or at least programmed them to be like this. At least that's the rumor. They you can your seat closer. I don't think so. Why do I not look good? The framing changed. Oh, so I didn't move. Is it is it okay still? Yeah, fixed it, but it wasn't bad. Uh, yeah, but I don't know for how long. Like I just noticed and I've been watching it for a whole time. I don't think I moved. Maybe I did. I don't know. Okay, so there's Dr. Cossack, his Russian style castle, not surprising considering his name. Behind, yeah, it's cool. I like that slide to nowhere just kills you. So this this jump can be a little crazy there, like that. This is ice in case you're curious, so I'm sliding around on it here. You can use Rush Coil, but since we have uh the balloons from Pharaoh Man stage, we can just use them to get up. Is Rush Jet not in this one? Rush is in this one as well, but the Jet one, the Jet is in this one. Yeah, so here you can go",
            "start": 2194.84
        },
        {
            "text": "since we have uh the balloons from Pharaoh Man stage, we can just use them to get up. Is Rush Jet not in this one? Rush is in this one as well, but the Jet one, the Jet is in this one. Yeah, so here you can go up and down these ladders, but there's really no reason to do it. So I'm going to I'm we have to be a little more patient then I get rid of these BS. There we go. How is it snowing under that part? You're asking questions I can't answer. Uh, there we go. So we can at least um refill if we need it. And then to get this last one is going to be tough. We got to wait for him to kind of go up there. Oh, there. And then for this guy, we're going to have to really hammer him. We're to the first boss in Cossack's Castle. Jeez. There we go. Does this game have a platinum? Um, does this have a platinum? Is that what you ask? Mhm. No, no. I wish that they all had platinums, but this is the one disappointing thing about the Legacy Collection was they really really did drop the ball on uh trophies in a pretty substantial way. What",
            "start": 2341.08
        },
        {
            "text": "mhm. No, no. I wish that they all had platinums, but this is the one disappointing thing about the Legacy Collection was they really really did drop the ball on uh trophies in a pretty substantial way. What the limitations to downloadable games? There are, but there aren't. It's really more up to what we've learned is that it's really more up to the developer if they want to put at this point. It used to be that way. If they want to put trophies, um, platinum in it or not. All right, so we continue along. Remember in these castles and Mega Man games, your health does or your weapon health does not refill, so you need to be cognizant of that. And then here we'll use the Rush Jet. All right, those spikes will obviously damage you if you touch them. It's not a one hit kill. No, these aren't hit kill spikes, which is convenient. All right, I'll show you the Wire Adapter here. We can use him and you can grab the mm. So we'll fill up the balloons. Okay, we're cruising along here. We we want to draw uh the enemy up",
            "start": 2433.16
        },
        {
            "text": "which is convenient. All right, I'll show you the Wire Adapter here. We can use him and you can grab the mm. So we'll fill up the balloons. Okay, we're cruising along here. We we want to draw uh the enemy up if we can and then get below him and do that. That way we get the E-Tank and we can use this weapon energy as well to get rid of these barriers. You will use the Drill Bomb if it pleases you. And then we can use this to fill the wire and we don't really need the extra life, so we'll just leave it up there. So on this enemy, this is a unique kind enemy. We're use the Dust Crusher on him. Oops. Have to wait for it to come back together. **** One more go. All right, glitched my way in. That's it. So that enemy is dead. Do those guys have names? They do have names in the art. We can look at the art later. That there's a bunch of art. I mean, I used to just make up names for these guys. Wall enemy or I don't know something. So this particular stage is the first stage of Mega Man that scrolls automatically like",
            "start": 2517.0
        },
        {
            "text": "there's a bunch of art. I mean, I used to just make up names for these guys. Wall enemy or I don't know something. So this particular stage is the first stage of Mega Man that scrolls automatically like Mario. So you can see it's moving, so you have to kind of hurry. Not a huge rush, but it's something to keep in mind. And those sparks can't be killed by anything, so you have to just kind of avoid them. Not I would prefer to stay up there, but we'll be fine. Oh, he was there. So now that we have the ring, we can just get rid of these guys. Remember last time we reached them, we were on Ring Man stage and we did not have the Ring Boomerang at that point. So slowly it does. I think it's 'cause Mega Man fans like, why is this panning at all? Yeah, so if you get to the edge, it won't move forward any faster. No, I guess there was. I mean, technically, I guess in Mega Man 3, right before you fight the dragon in Wily's Castle, the game scrolls too. Yeah, it does scroll. So I mean, but it's not it's not quite like this. This is",
            "start": 2685.96
        },
        {
            "text": "there was. I mean, technically, I guess in Mega Man 3, right before you fight the dragon in Wily's Castle, the game scrolls too. Yeah, it does scroll. So I mean, but it's not it's not quite like this. This is is this is clearly Mario-esque in my opinion. Definitely an inspiration taken from Mario. I would I would wager to say. So here that E-Tank when I was a kid used to mystify me how to get it. And what you do is spawn a balloon and then slide in. I was like, how the hell did you do that? When I was a kid, I was I used to think maybe use the ring to grab it or something, but that's not the case. All right, so we could use just the Drill Bombs here if you can explode them before they get to the enemy. So if you press B again right when it gets there, it'll explode and the detonation actually does more damage. Oh, done a little more laborious. Use way more drills than I would have want to. Uh, but nonetheless, here we are. We're cruising right along. Kevin moving. We cruise right along. Okay, so here if we want, we should we",
            "start": 2805.72
        },
        {
            "text": "done a little more laborious. Use way more drills than I would have want to. Uh, but nonetheless, here we are. We're cruising right along. Kevin moving. We cruise right along. Okay, so here if we want, we should we we can get up here and replenish the drills we used last time. We're going to need them later. And then we can do the same thing over here. Oops. And we're a little overloaded here at this point on E-Tanks, but it can't hurt that more. So we'll just grab that one with the Drill Bomb. We continue our climb upward. Now here is a path, a split, uh, like a split, um, really the first one in in any Mega Man game where you're not going to see the other part of the stage at all. And this is used to great effect later in actually in Mega Man 6. Um, but we're going to take this path. We just have to get right under a tough one. Ah, there we go. We should be good there. Okay, and this gives us access to basically another E-Tank and we should have nine now, which I think is the max you can actually carry. So we're pretty much",
            "start": 2919.48
        },
        {
            "text": "one. Ah, there we go. We should be good there. Okay, and this gives us access to basically another E-Tank and we should have nine now, which I think is the max you can actually carry. So we're pretty much all good and we haven't even really used any yet in the castles. We will. So I would have come from up there in case you're curious. It is you like those skulls, the things they come out of, you can actually destroy if you wanted to. All right, so this is Dr. Cossack. I don't know why he didn't move for AE. Weird. He does a lot of damage when you run, as you can see. So here we'll start using some E-Tanks just to keep ourselves alive. If he grabs you, you're in bad shape too, so you want to be careful not to get grabbed. And we're using the Dust Crusher here, and that's basically the end of him. But it's not the end. Proto Man appears with Kalinka. Kalinka is Cossack's daughter. Wily appears, of course, it's always him. E. So now we're in Wily's Castle and we're getting pretty close to the end. Is there any reason why Wily has",
            "start": 3043.84
        },
        {
            "text": "Proto Man appears with Kalinka. Kalinka is Cossack's daughter. Wily appears, of course, it's always him. E. So now we're in Wily's Castle and we're getting pretty close to the end. Is there any reason why Wily has why Wily has what? Proto? What do you mean Wily doesn't have Proto? No, Proto Man appeared with Kalinka to show him that Wily was framing him. But Proto Man and Wily have nothing to do with each other right now. So why did you in previous? Because we didn't know who he was, which is what you do when you don't know some who someone as you fight him. Use some. I was about to say I was using fancy footwork there. Wasn't it wasn't so. All right, let's fill up the Dust Crusher. We're going to need it. The weapon we're going to really need here a lot of is the Ring Boomerang actually, but but it can't hurt to fill in these other things too. We will need them. All right, so now we're going down. Now we're going to go into water. I love this effect here by the way. I've always been really fond of the bricks in the back here",
            "start": 3150.72
        },
        {
            "text": "other things too. We will need them. All right, so now we're going down. Now we're going to go into water. I love this effect here by the way. I've always been really fond of the bricks in the back here. And as the water transitions, because it's all I don't know, it's all blurry kind of as if you're going under. I don't know. I think it's just neat looking. Nice little touch. This jump can be a little bit perilous, but we'll do it because remember these jumps are hard because you can jump so high. You have so much boost underwater. That's why it's a little difficult. And of course, what Mega Man Castle would be complete without disappearing blocks? Okay, we're through that. Fill up the uh drill. Get that out of the way. I was always puzzled by the enemy placement of some of the enemies around here. I'll show you guys in a minute. Like those enemies, they're just kind of like they're just there. It's funny 'cause they're they're really not there to do anything but just be there. Damn it. I'm",
            "start": 3271.12
        },
        {
            "text": "I'll show you guys in a minute. Like those enemies, they're just kind of like they're just there. It's funny 'cause they're they're really not there to do anything but just be there. Damn it. I'm going to do that. Should use an E-Tank just in case. Having a little I'm having a little trouble sliding on this controller. See him? Do you think that's the controller or just no? I think it's the I mean, it's a perfect port, so I this think it's I'm not used to this controller playing Mega Man on a PlayStation controller is a little a little unusual. Although, you know, Mega Man 9 and 10 were played on Mega Man, but you weren't sliding in Mega Man 9 and 10. Were you excited when those games came out? I was pumped when they announced Mega Man 9. I couldn't believe it when I went to E3 that year. That was in '08, maybe '09. Um, I was so thrilled. Oh, what am I doing? I was so thrilled um that they had they're making that game. When Mega Man 10 was announced and came, I was like, I can't believe they're doing it again. So cool. It's",
            "start": 3363.68
        },
        {
            "text": "'09. Um, I was so thrilled. Oh, what am I doing? I was so thrilled um that they had they're making that game. When Mega Man 10 was announced and came, I was like, I can't believe they're doing it again. So cool. It's like a dream. I wish they would keep doing them. Those games were profitable apparently. Not that they were very expensive to make, I'm sure. Um, so there's an E-Tank there. We don't really need it. Just ignore it. Say super expensive to make. That technology hasn't gotten cheaper. It's not about the technology. It's it's it's just skill. Like a lot of people that don't a lot of people just don't know how to do it, you know? Actually, that's not the best technique. Use that Jet. I don't know why. You know what what the **** am I doing even not here? Uh, rant Eddie, thanks for nothing about that. All right, so we're cruising right along here. Nothing much to say right now. Use the Wire Adapter here. This part I got to go back down. Powered up. Fill up the ring. Need them later. So is an interesting enemy. You",
            "start": 3455.32
        },
        {
            "text": "so we're cruising right along here. Nothing much to say right now. Use the Wire Adapter here. This part I got to go back down. Powered up. Fill up the ring. Need them later. So is an interesting enemy. You got to be a little patient with this enemy. So the only part of him that's can be hit is that green gem. He'll shoot you out of his nose and out of that little thing on top of him. So you just got to kind of and I prefer just use the Arm Cannon, although I think you can use like Ring Boomerang on him too. He's finished. Sorry, I'm getting a as I'm playing, I'm getting text messages. So we're going to have to fight the bosses again soon, so we should refill everything that we need. Those rings, I would definitely fill up those drill. Uh, actually fill up Toad. We don't need the extra life. Uh, just survived that encounter. All right, start with Drill Man. Get the hardest out of the way first. He didn't go underground very much there. I was quite fortunate. So here we'll use uh Rain Flush again. Going to jump at me",
            "start": 3555.68
        },
        {
            "text": "all right, start with Drill Man. Get the hardest out of the way first. He didn't go underground very much there. I was quite fortunate. So here we'll use uh Rain Flush again. Going to jump at me this time and that should do him in. Is perfect. And then this time we go to Skull Man. Oh, think actually need to use it there, I guess, but better safe than sorry. All right, keep on cruising. Dive Man. See a Dive Man. Toad Man. As you remember, this is quite a mundane battle. Um, I'm going to say save my Drill Bombs. We'll just fight him the old fashioned way. We're going to need the Drill Bombs. Remember, as long as you keep hitting him, he can never get his attacks all. He'll just keep jumping. Toad Man's finished. Next up is Dust Man. Break out those Ring Boomerangs. Let's go to town. And then Ring Man, which we use Pharaoh Shot on. And finally, that leaves Pharaoh Man as the only guy we haven't fought yet. All right, we roll on. Oh, and so we'll use Drill Bombs here. And remember, they'll bounce off. **** I got that using E-Tank.",
            "start": 3793.04
        },
        {
            "text": "shot on. And finally, that leaves Pharaoh Man as the only guy we haven't fought yet. All right, we roll on. Oh, and so we'll use Drill Bombs here. And remember, they'll bounce off. **** I got that using E-Tank. They'll bounce off. Um, you have to explode them before they get to them. There. Got him. But that's not the end. Wily's not quite finished yet. Kevin, hands are sweaty. H right now. Is the enemy also 10? Yeah, no, but is it him that never lands? I'm just going to farm for a minute just in case 'cause we need Pharaoh Shot. No one's that's why those enemies are there by the way. That's just that's good design to not trap people. No one's giving me anything. It's unbelievable. Like nothing. Yeah, that wow, this is really weird. Like no one's given me anything. Wow. Not what I need. Do one more cycle. If not, we'll just kind of go in. See what happens. That might be useful. How much? I'm just I'm so amazed that no one's given me anything. I almost want want to do one more time. Usually you don't have to wait this long. That's something. All right.",
            "start": 3990.88
        },
        {
            "text": "happens that might be useful. How much? I'm just I'm so amazed that no one's given me anything. I almost want want to do one more time. Usually you don't have to wait this long. That's something. All right. This is going to be the last run. See here forever. Nothing. Well, all right. All right, so be it. Let's roll. Yeah, I I'm going to be a little more careful than usual. Um, I'm going to be using a lot of E-Tanks here because I don't want to waste. There we go. Oh, actually, I should ****. There we go. Right there. Done. That's it. Mega Man 4 is over. So we'll enjoy the ending. I'll let you just watch it in peace. But uh remember that we will be doing or have already done, depending on where you are in the series and and what day it is and all that kind of stuff, Let's Plays from the Mega Man Legacy Collection for Mega Man 1, 3, 4, 5, and 6. You can find them on youtube.com/KindaFunnyGames right where you are right now. We hope you enjoy them. Uh, let us know what you think. Uh, love playing these retro games for you",
            "start": 4265.2
        },
        {
            "text": "Mega Man 1, 3, 4, 5, and 6. You can find them on youtube.com/KindaFunnyGames right where you are right now. We hope you enjoy them. Uh, let us know what you think. Uh, love playing these retro games for you guys. I think you guys enjoy it too. So uh hope you like that. Enjoy the ending to Mega Man 4. We'll be back for Mega Man 5 and 6 if you haven't already watched them. If you haven't watched the previous ones, please go watch those as well. We'll see you next time. Bye. E. E. E.",
            "start": 4400.84
        }
    ]
}