{
    "id": 1205,
    "video_id": "7kUUDeS0xDs",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Donald J. Trump - The GameOverGreggy Show Ep. 93 (Pt. 2)",
    "description": "What does Colin Moriarty think about Donald Trump?\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1442300401,
    "duration": 2438,
    "transcript_chunks": [
        {
            "text": "today's sponsor is Loot Crate for less than $0 a month. Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with more than $40 worth of geek and gamer and pop culture gear. Collectibles, apparel, Comics, etcetera, delivered to your mailbox every month. This month they're celebrating all the monsters you can fit in your pocket and the ones you need some crazy circle drawing skills to bring to the Mortal realm. This month's crate features an exclusive collectible there told is quote the most important object in pretty much the whole universe end quote, plus awesome items from Blizzard, Kidrobot, and more. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate and when the cut off happens that's it, it's over. So sad, too bad. So go to lootcrate.com/kindafunny and enter the code Kinda Funny to save $3 on your new subscription. Today, Colin, yes, what's your topic? I want to talk about Donald Trump. I know Donald, uh",
            "start": 0.04
        },
        {
            "text": "so go to lootcrate.com/kindafunny and enter the code Kinda Funny to save $3 on your new subscription. Today, Colin, yes, what's your topic? I want to talk about Donald Trump. I know Donald, uh, but I don't really have anything to say per se about him. I don't have any agenda. Owner of the Mavericks, Shark Tank, uh, that's all I know about. Not Donald Trump. No, not Donald Trump. That's Mark Cuban. Oh, uh, who is a supporter, I think, of Donald Trump. Really? Uh, yeah, okay. Uh, as far as I know, yeah, he always said something that was like supportive of him or something. I don't know. That was, this was some time ago. I don't really have an agenda with this. The reason I brought this up is A, I needed a topic for The GameOverGreggy Show. Works. Yeah. And B, a lot of people, like literally, I would say at this point, hundreds of people have asked me to talk about Donald Trump. No, I'm not really going to say anything about him. What you got? They asked you to talk about him, not us. We're butt idiots. I'm gonna say this.",
            "start": 37.36
        },
        {
            "text": "hundreds of people have asked me to talk about Donald Trump. No, I'm not really going to say anything about him. What you got? They asked you to talk about him, not us. We're butt idiots. I'm gonna say this, uh, to back to back it up to the last topic, uh, the beginning of the last topic is that Colin was right. I do have to pee. I'll be right back. Oh my God, you're the worst. I saw him drop the the hand and I was like, what does, is he really that passion? I'm kind of worried about you. Can you go to the doctor though? You really don't be diabetes. No, no, he doesn't have the bees. We have to taste the pee. If it's sweet, then we know. Kevin, is that true? Is is pee sweet? If I saw this on Reddit, uh, has to be true. Yeah, yeah, yeah. I yeah, it's it's one of those Reddit stories you believe you want to believe is true. But yeah, this guy started seeing this girl and they were just fooling around or whatever. Like they're not seriously into like dating or anything, but they were just like **** buddies, whatever. M, no, she was a",
            "start": 95.56
        },
        {
            "text": "this guy started seeing this girl and they were just fooling around or whatever. Like they're not seriously into like dating or anything, but they were just like **** buddies, whatever. M, no, she was a, and so he thought this was like the hottest thing ever. But he's like, I'm a male, I'm a not a male nurse. What? I don't know. He works in, he's either either a doctor or male nurse, doesn't matter. Uh, and he's like, I don't get me wrong. I, you know, I'm in this field. I know a biology. I know what squirting is. I know she's just peeing on me or whatever, but it's still hot to me. And I'm, and then he said that he was, he started to enjoy the taste of everything that was happening because it was kind of sweet. And he said he snapped awake like like as he was falling asleep. He's like, wait, sweet. Her pee is sweet. And he ran off and got like whatever, took a blood test. She she was totally diabetic like falling and like he had to get out of the hospital and stuff, the emergency room and all stuff. Wow. Yeah, all",
            "start": 139.16
        },
        {
            "text": "and he ran off and got like whatever, took a blood test. She she was totally diabetic like falling and like he had to get out of the hospital and stuff, the emergency room and all stuff. Wow. Yeah, all because he squirted, she squirted, or she squirted rather on his face. Yeah, we've all been there. Does it, Kevin? There's a reason you're over there and we're over here, because we can, we know the **** filter. I'm not a doctor and I'm not a scientist, but I don't think it's pee. It's not. So yeah, I don't think so either. He said basically, but yeah, that those aren't doctor terms either. It's basically pee. Yeah. Uh, what were we talking about? Donald Trump, right? Oh, I mean, we were talking about how we had a problem with Nick Scarpino's pee schedule. Right, right, right. It's a ridic, it's a ridiculous schedule. Get his prostate checked. I'll check your prostate for you if you want. Kevin, can can you watch Colin check my prostate? Thanks, Kevin. I'll check, I'll gladly check your prostate. What would be the point of having me watch?",
            "start": 178.2
        },
        {
            "text": "checked. I'll check your prostate for you if you want. Kevin, can can you watch Colin check my prostate? Thanks, Kevin. I'll check, I'll gladly check your prostate. What would be the point of having me watch? Make sure he does it right because you know how to check prostates. You've been checking mine a lot lately. So Colin, yeah, Donald Trump. Don, right? I'm sorry. I'm like all discombobulated. Were you, you guys spent that entire time talking about my bladder? We don't, we don't want, yeah, it's this girl. It doesn't matter. Anyways, we want to, we wanted to just, we don't want to go to a topic without you as all. So people are just curious about what I thought about him and I'm I'm curious in turn what you guys think about him because he's a incredibly disruptive figure in a good way, I think, and in a bad way, I think, actually a better way than people give him credit for, um, to the political system. And he's a sign of people, especially in the Republican Party, not liking any of their candidates. M, um, what's his",
            "start": 219.72
        },
        {
            "text": "think actually a better way than people give him credit for, um, to the political system. And he's a sign of people, especially in the Republican Party, not liking any of their candidates. M, um, what's his approval rating right now? Last time I looked, it was like he had a ridiculous majority. Well, his approval rating is something different than what, not appr the, uh, how's he poll? He's he's he's got like, I think, 35 in New Hampshire out of 17 people. Uh, Iowa, I think, probably a little less, probably like 30. And I think he, him and Ben Carson's probably what, what he has 35 out of 17, 35% out of 17 candidates. Gotcha. So that's a big majority. A huge majority. Yes. Um, and then in Iowa, I think it's a little less, like 28 to 30 probably. And I think Ben Carson's pretty competitive there. I don't think I don't think Trump's going to win in Iowa, um, because of the nature of the caucuses and more Evangelical. Heads up, that's the first time I've heard of Ben Carson. Ben Carson is the, you asked the, you saw him speak",
            "start": 257.64
        },
        {
            "text": "Trump's going to win in Iowa, um, because of the nature of the caucuses and more Evangelical. Heads up, that's the first time I've heard of Ben Carson. Ben Carson is the, you asked the, you saw him speak the other day, the saw spoken black, ey, you you remember and you asked me if who he was. We were watching. Do you not remember this? I mean, I vaguely remember this because you, but I didn't watch it. You had on your laptop. Was listening to a world famous neurosurgeon. Gotcha. Um, out of um, Carnegie Mellon. He invented the brain. He was the first that I think he was the first, I think he was the first surgeon to successfully um, separate Siamese twins, uh, attach it at the head. Really? That guy? He can't be president. He's too smart. Well, he's very smart. He's way smarter. Too smart. Uh, but so before I get into, I just want to say like, I think that to to kind of set the to to kind of, I like Donald Trump and I don't I don't mean that as like necessarily a politician. As you guys know, I've been a big fan of Donald Trump for",
            "start": 303.76
        },
        {
            "text": "say like, I think that to to kind of set the to to kind of, I like Donald Trump and I don't I don't mean that as like necessarily a politician. As you guys know, I've been a big fan of Donald Trump for many years because I, the, I love The Apprentice and I love Celebrity Apprentice. I just, I think Donald Trump is smart. I think that, um, he's a great showman. I think he's an Entertainer. I think that he knows exactly what he's doing. I think the smartest man in the room most of the time. I think people that deny that don't really know what they're talking about. I don't think you a massive fortune of $10 billion or more. What about the argument that he only, and I already know that counter moved to this, but I'll set you up. I'll tee you up here, but don't come at me. What about the counterargument to when people say, well, he inherited all his money? He he didn't inherit all his money. He inherited some money and he inherited advantages, but he made it stronger. And Trump was not a brand until it was him, right?",
            "start": 346.2
        },
        {
            "text": "say, well, he inherited all his money? He he didn't inherit all his money. He inherited some money and he inherited advantages, but he made it stronger. And Trump was not a brand until it was him, right? Trump was not Trump until it was Donald Trump, not his father. So, you know, when you have a skyscraper in the most expensive city in the world, you know, you know, New York City with your name on it, you've done something right. Um, that said, I think that Donald Trump is a sign, is he's a symptom of an illness with the Republican Party. He is not, um, I don't want to say categorically he's not going to win the nomination because I think it's becoming more and more certain that he might win the nomination. Yeah, which is terri. Who who are the legitimate contenders? Who's it gonna come down to? Trump, Ben Carson's definitely a legitimate Contender. And then you have to assume like Jeb Bush and Rubio and maybe Scott Walker and maybe John Kasich. I don't I can't see it being anyone else. So that's like six of 17. So,",
            "start": 381.36
        },
        {
            "text": "definitely a legitimate Contender. And then you have to assume like Jeb Bush and Rubio and maybe Scott Walker and maybe John Kasich. I don't I can't see it being anyone else. So that's like six of 17. So you're talking about like sitting Governors and three of them are sitting Governors. One of them is a neurosurgeon. One of them is a businessman. And then Jeb Bush is the next Governor. So, um, so and then Kasich's obviously the governor of Ohio. Um, etcetera and on. So to me, he's a like I I people have been saying it in different ways over and over again about and and that's the way it goes. And what it's what it's produced over time. What people don't realize is that the Republicans have lost five of the last six presidential elections by popular vote. And the only one that the only popular vote we've won was in 2004 since Clinton. So 9, 96, 2000, 2004, 2008, and then 2012. Uh, so I guess it's actually really start with 96. So 96, you know, etcetera and so on. We lost all of those, all of them except for",
            "start": 420.96
        },
        {
            "text": "we've won was in 2004 since Clinton. So 9, 96, 2000, 2004, 2008, and then 2012. Uh, so I guess it's actually really start with 96. So 96, you know, etcetera and so on. We lost all of those, all of them except for one. And it's there's an there's existential problem with the party, which is that the party's core platform, I I do believe, is an exciting platform and a platform that resonates with a lot of people. And if we focus on that platform of small government and low tax and stuff, it would be fine. But then because everyone's always in a Mexican standoff with each other where they're all pointing guns at each other, all hate each other, you end up with candidates that are not appealing. And so you end up with like Bob Dole or John McCain or, you know, I like Mitt Romney, but Mitt Romney was certainly, you know, looked at as that kind of candidate. And that eventually the party starts to hate everyone so much, you get Donald Trump. And that's and that's how you arrive in this place. Well, I don't",
            "start": 523.04
        },
        {
            "text": "you know, looked at as that kind of candidate. And that eventually the party starts to hate everyone so much, you get Donald Trump. And that's and that's how you arrive in this place. Well, I don't think you get Donald Trump. I think you open up the door for a Donald Trump to come through like **** this and show everyone the ridiculous flaws that they have within the party and within the system. I I'm with you. I think Donald Trump happens to be a genius. I don't mean a genius, uh, financially or economically or that or he's a business genius, although I'm sure his his business acumen is high. But I think he's a genius because if he understands anything, he it is that that he understands how to use the media to his advantage. And let me give you an example. Every time he says anything, every major and actually every media outlet on the planet has to report it because he's so polarizing. So even if he's saying things that are completely outrageous or flat out wrong, he gets everyone's attention. So as far",
            "start": 562.48
        },
        {
            "text": "every media outlet on the planet has to report it because he's so polarizing. So even if he's saying things that are completely outrageous or flat out wrong, he gets everyone's attention. So as far as mind share is concerned, he's a winner in that regard, um, because he's playing the media and all of us like a **** fiddle and it's working. And I can't not watch him do this, right? And so and so there is something to be said for like, what does it say about our population that we're willing to let a candidate like this not only come in, but from his inception, he has been the leader? Like he has never not pulled higher than anyone else. Am I correct? He's always winning. Yeah, like he came in, everyone like, oh, ha haa, it's a joke. Like he's pulling higher than everyone. And now he's just torn away and he's saying some outrageously radical ****, most of which, uh, I mean, I got I got I got to disagree with a lot of it. Um, but the one thing that I do really respect and appreciate him for is that he is not",
            "start": 606.12
        },
        {
            "text": "saying some outrageously radical ****, most of which, uh, I mean, I got I got I got to disagree with a lot of it. Um, but the one thing that I do really respect and appreciate him for is that he is not backed by any, uh, uh, what's the terminology I'm looking for? U, special interest group, group, right? No, so he is beholden to no one. And that's why that's why I think a lot of people dangerous. If he were actually not using that crazy rhetoric to get attention, if he were actually somehow, which I I have a feeling that if he's serious about this presidency, that he's going to have to start doing that eventually, which he's going to have to take that rhetoric and move it more toward the sane and rational and actually how we're going to get this **** done, uh, side of things. But if you were actually able to do that, he would be a scarily awesome candidate, um, just because he doesn't have like, that's the biggest problem our politics in this country faces is that there's too much money involved and he",
            "start": 650.24
        },
        {
            "text": "to do that, he would be a scarily awesome candidate, um, just because he doesn't have like, that's the biggest problem our politics in this country faces is that there's too much money involved and he can actually take that out. Now, I don't think he will. And I don't think even if he were to get by some crazy stroke of like circumstances were to actually be like to president, I'm terrified for how he would use that to his advantage because that's exactly why. I mean, guys like Donald Trump doesn't run for president because he truly wants to fix things. Guys like Donald Trump runs for president because he wants to take that billion and make it into a trillion, um, which is what every Republican president's done for a really long time anyway. Well, I shouldn't say every, but at least the Bushes were pretty damn good at, uh, uh, stuffing their pockets with money. Um, I just can't like, part of me is like, this is ridiculous. I can't believe we're even entertaining this notion. And the other part",
            "start": 688.12
        },
        {
            "text": "were pretty damn good at, uh, uh, stuffing their pockets with money. Um, I just can't like, part of me is like, this is ridiculous. I can't believe we're even entertaining this notion. And the other part of me is like, what's scarier? Trump getting into office or another Bush? Because Jeb will have, I mean, once all those the 17 candidates start start, uh, fading off and it goes down to, well, they're going to earn money eventually. You know, Trump's, uh, lead that he has is going to, it's going to even out and it's going to become a real, uh, a real primary. And that's, I mean, I I'd love to see what happens with that when when when they go up against each other and just watching some of the quotes from his debate, um, you can't mess with him because the more people that that that went after him, they dropped. I got to be honest with you, dropped my favorite clip. And I'd love to find, I don't, we probably would get in trouble for using it, but my favorite moment of that debate was when Megyn Kelly asked him about all the",
            "start": 724.44
        },
        {
            "text": "be honest with you, dropped my favorite clip. And I'd love to find, I don't, we probably would get in trouble for using it, but my favorite moment of that debate was when Megyn Kelly asked him about all the disparaging thing he said he said about women or whatever. And she's naming all of these things. Did you see this? No, I didn't see it. Oh my, it's like, cuz she's right. Like he really says awful things about people, whatever. Me, Rosie O'Donnell. Yeah, but then he's like, just Rosie O'Donnell. Like all these things. And the crowd just goes **** insane. And I'm like, that was **** awesome. See like a presidential candidate just called out Rosie. What was the question? The question was like, do you take, want, do you wish you take? Because she was like, you you said this about this woman, this, this, this, this, this. And he's like, just Rosie O'Donnell. And then just backs away from the microphone. And everyone and and it's not true. Like he's totally lying. He said awful things. I'm not defending what he said. Yeah, I want to be clear.",
            "start": 764.8
        },
        {
            "text": "just Rosie O'Donnell. And then just backs away from the microphone. And everyone and and it's not true. Like he's totally lying. He said awful things. I'm not defending what he said. Yeah, I want to be clear. I'm I'm saying that that was amazing. No one would ever do that. I mean, no situation. Yeah, he can, he's kind of playing this character at this point where he can literally just do and say whatever he wants. And then people are going to react like what Nick's saying. But what's crazy to me is like, this reminds me when I was way younger and Arnold was our **** Governor. How the **** did that happen? You know, like, but that's the thing though. It's like he's popular. You know, it's like, I've never been a political guy. I don't know this stuff. But when I especially when I was in high school and that happened, like I was a freshman in high school and I remember happened. I was like, I didn't know the other people. I knew Schwarzenegger. And I'm like, this is nuts though that this is that this is really a",
            "start": 805.32
        },
        {
            "text": "like I was a freshman in high school and I remember happened. I was like, I didn't know the other people. I knew Schwarzenegger. And I'm like, this is nuts though that this is that this is really a thing. I can't believe this is really a thing. And I hear about Donald Trump. I'm like, I can't believe this is really a thing. But then it's dangerous with this. It's different because he has the money and he has the popularity and he has friends. He has connections. He has all this stuff. It's a popularity contest. You know, and it's just like, oh my God, he could just do this. Wants it to happen. I know. But that, I mean, isn't that kind of everything in life? Isn't that kind of how you get ahead in business and how do you get ahead and, you know, I mean, really any field? Like that's how actors become famous actors, right? They have friends and they work networks like the network and they figure out how to get up, you know, how to work their way up the the the totem pole. That again, let me be let me back what Colin",
            "start": 845.28
        },
        {
            "text": "right? They have friends and they work networks like the network and they figure out how to get up, you know, how to work their way up the the the totem pole. That again, let me be let me back what Colin said. We I don't disagree. I mean, I don't agree rather with a lot of the disparaging remarks that he said. Actually any of them. I don't think that all all the ones that I could remember, I vehemently disagree with, right? All about Mexicans. I've never met Rosie O'Donnell, so I'm not going to go out on a limb and say she's not nice. Although I can appreciate that she may or may not have a bone to pick with Donald Trump. Um, but the fact that he can say the things is the most fascinating part. Definitely. It's the fact that no one is going, oh, like if any other candidate had talked **** about anyone, they would every every political correspondent across the nation would be like, oh, this person's out of the race because they said something. They actually had an opinion. Something that could be quote unquote",
            "start": 879.68
        },
        {
            "text": "every political correspondent across the nation would be like, oh, this person's out of the race because they said something. They actually had an opinion. Something that could be quote unquote polarizing. So God for **** bid, we don't reward them for that. We in fact, uh, take marks off of them off of their page for that. And we have to kick them out of the race because they actually had an opinion on something. And that's the problem with politics in America is that you're not allowed to have an opinion about anything. It's all backpedaling. It's all answering without answering. Now here you've got a guy that's answering actually pointed. He's there are questions that are being asked and he's pointedly answering them the wrong way, unfortunately, but he's having a **** of an answering them. Yeah, that's the thing that is is so exciting about him, right? In terms of just somebody who's watching from the sidelines to see how it all shakes out is like, it's going to be cool if somebody who can say",
            "start": 919.16
        },
        {
            "text": "whatever the **** they want actually has a shot at this. And it isn't just **** lip service to the, well, I got to play to the Christian Right and I got to do this. And I don't even, you know, Mitt Romney's this great Governor or whatever. And then when he gets on the national stage, he has to be all like, wow, God and abortion. And he like, dude, like you're cooler back there. Why can't you just be that guy? By the way, I found, I want you to, I found the clip. Did you found the clip? It's just 30 seconds here. People love about you is you speak your mind and you don't use a political filter. However, that is not without its downsides. In particular, when it comes to women, you've called women you don't like fat pigs, dogs, slobs, and disgusting animals. Your Twitter account. Only Rosie O'Donnell. No, it wasn't. Damn.",
            "start": 957.04
        },
        {
            "text": "not without its downsides. In particular, when it comes to women, you've called women you don't like fat pigs, dogs, slobs, and disgusting animals. Your Twitter account. Only Rosie O'Donnell. No, it wasn't. Damn. Damn. When that happened, that's insane that he could just **** do that. Yeah, like, and that's that was the thing I was saying. I was like, that's wrong. Like, I don't believe it's the same thing I say about Democrats when they go after the Koch Brothers. I'm like, these are private citizens. And I don't really think that we should be going after people that are not in public life really. And so my first in was like, yikes. Like, but but I was I was sitting there watching with Cheryl. And I started laughing. I'm like, that might be the craziest thing I've ever seen in a primary in my entire life. And I've and I've watched every debate since 9, like literally every one of them probably since 1996. So like since I was like eight or nine, you know, yeah. So like, I was like, that is just as someone who studied",
            "start": 989.48
        },
        {
            "text": "and I've watched every debate since 9, like literally every one of them probably since 1996. So like since I was like eight or nine, you know, yeah. So like, I was like, that is just as someone who studied political science. I'm like, this is unbelievable. And I remember after that first debate, because there's only been one so far. I I I was watching the pundits and I agreed with them. And they were like, like Donald Trump's done. He didn't answer any questions. He didn't say anything. He's going after people, whatever. And he went up 10 points. And I was like, everything about him doesn't make sense from a political science perspective, which is why it's so exciting for someone who studied it where it's like, these things are predictable. Polling and poll testing and all this kind of stuff. This is this people give polls **** sometimes. And sometimes polls are wrong. Polls are very wrong in the midterm, for instance, because their their balance, their, you know, their sample balance was off. But polls are real. They can",
            "start": 1032.44
        },
        {
            "text": "shit sometimes and sometimes polls are wrong polls are very wrong in the midterm for instance because their their balance their you know their sample balance was off but polls are real they can predict a lot and they do predict almost everything that happens which is detrimental to to our Republic in the that people feel like they don't need to go out and vote but I talked to you guys about this too the one thing that's intriguing to me about him and the one then this is something I do believe I was telling you guys something about something that a political science term called the Bradley Effect and the the Bradley Effect is a is something that happened in the early 80s in L.A. when a black man was running for mayor and he was winning in the polls he was winning in every poll and then he was going after he was going against the white guy and the white guy ended up winning and and everyone's like what happened with the polling and they're like What's the Bradley Effect they named it",
            "start": 1065.08
        },
        {
            "text": "was going after he was going against the white guy and the white guy ended up winning and and everyone's like what happened with the polling and they're like What's the Bradley Effect they named it the Bradley Effect they're like people are afraid to say that they're not going to vote for a black person because they don't want to look like they're racist that was the entire idea of the Bradley Effect whatever and what I think it's so what's happening here is clearly not the Bradley Effect but it's something similar and it's reversed I think Donald Trump has more support than the poll show and I think that people are afraid to admit it like when a pollster calls them or they're afraid to admit it they a friend I think I think this is what the statistics show with him which is I think is fascinating and this is this is when I saw this I was like this is shit insane he's winning with Libertarians, evangelical paleo-conservatives, neo-conservatives he's winning with men he's winning with",
            "start": 1098.44
        },
        {
            "text": "fascinating and this is this is when I saw this I was like this is shit insane he's winning with Libertarians, evangelical paleo-conservatives, neo-conservatives he's winning with men he's winning with women he's winning with more moderate Republicans he's winning with all age groups he's winning with everyone in the Republican Party and you never ever ever see that you know the only for instance even in the general election the only thing that Romney won was white men that's what he won so when they do when they do these things to see where we're polling and all that stuff who are they talking to are they talking to people that are active in politics or is it just like surveys for random shit they Garner your number so there's like a there's algorithms that they use and they'll Garner numbers uh polling was questioned for a while because it used to be landlines and now they're call you know so it would skew older and probably more conservative um but they're using cell phones and",
            "start": 1131.64
        },
        {
            "text": "numbers uh polling was questioned for a while because it used to be landlines and now they're call you know so it would skew older and probably more conservative um but they're using cell phones and basically they get your number based on if you donated to a candidate or whatever and then you have to confirm that um I mean there's a lot of trust put into the polling but they confirm that you know you are a registered Republican like for instance any numbers about Donald Trump that have nothing to do with Republicans are useless because no one's going to be voting for him but register Republicans in the primaries unless you're in an Open Primary State um so there's a science behind it and then based on how accurate they think the numbers are there's a margin of error which is usually three and a half points so seven points in in in terms of a swing and um the polling is is typically right I mean Nate Silver for instance who's a master of polling predicted basically every state in 2012 um",
            "start": 1171.32
        },
        {
            "text": "and a half points so seven points in in in terms of a swing and um the polling is is typically right I mean Nate Silver for instance who's a master of polling predicted basically every state in 2012 um so the polling means something and I actually think that that the crazy thing and the interesting thing to me as someone who sits on the sideline and who's someone who I I don't think that I'm going to I mean I don't want to necessarily commit I don't have my guy yet My Hope Is that Mitt Romney gets in I mean that I'm just being totally straight up and honest with you guys like actually have his chance people are apparently like trying to get him in like because they think that this whole field just sucks you know and that they just need someone that we know can do it Mitt Romney I've said it before and I know it's a joke to lot people I think that Romney got robbed in 2012 I think he should have been president and I think the media was totally skewed against him I think he was totally",
            "start": 1204.52
        },
        {
            "text": "it before and I know it's a joke to lot people I think that Romney got robbed in 2012 I think he should have been president and I think the media was totally skewed against him I think he was totally ready for the job and I think people realize that now and as people like Greg say you know after seeing after the dust settled and you see his documentary and you just see him or whatever you're like this guy was kind of character assassinated and everyone knows it um what was that based on I don't remember I don't remember why he uh what was the what was the character flaw then he was more he had he yeah there was that and then he had that uh speech that they had like the shaky cam footage from a table of when he talked about how 53% of Americans pay for everything and the 47% of 47% of Americans like don't like they they'll always vote Democrat because they get free shit basically was his argument um inelegantly put I thought uh wasn't supposed to be recorded but that's that's the",
            "start": 1243.92
        },
        {
            "text": "like don't like they they'll always vote Democrat because they get free shit basically was his argument um inelegantly put I thought uh wasn't supposed to be recorded but that's that's the environment you live in today or whatever so I just think I think I think the media just hard I mean my personal opinion I know some people disagree is just I think the media was really hard on Mitt Romney I think that Mitt Romney is a good man I don't think Barack Obama is a bad man I think Barack Obama's a good man too I think that Mitt Romney roughed the shit out of Barack Obama in the first debate and it woke everyone up um I think that Mitt Romney destroyed Obama in that first debate and everyone knows it and it's it caused a lot of fear and so then they really started to buckle down and really go at him it's interesting though that you're two that this is just for you obviously uh the the two candidates that you gravitate toward most are both like hardcore business person um obviously",
            "start": 1277.08
        },
        {
            "text": "go at him it's interesting though that you're two that this is just for you obviously uh the the two candidates that you gravitate toward most are both like hardcore business person um obviously Donald Trump Mitt Romney being like very very successful in the private sector is that something that you feel like we need is that something that like just someone because that was always kind of the the Allure for me of Mitt Romney of like when he when the man talks about like because that was always something they they kind of went after and for like oh you're not you don't come from politics you don't really have the background for this you don't you don't know what it's like to lead you know to be a governor of a state or to Senator Massachusetts or what was it then or I guess they they kind of came after because he didn't have yeah he didn't have the experience that everyone else had but he was like yeah but I've you know built corporations in a multi-billion dollar Corporation so I kind of know",
            "start": 1309.36
        },
        {
            "text": "because he didn't have yeah he didn't have the experience that everyone else had but he was like yeah but I've you know built corporations in a multi-billion dollar Corporation so I kind of know what it is to lead into have kind of a bottom line result uh which is not something that necessarily people in Washington adhere to is that do you gravitate toward that is that something you think that we would need yeah I mean I I I know a lot of people disagree with it I think that the Republic should be run like a business I think that that's like clear as day I don't understand why anyone would be against that if the if the government's taking your money then it's certainly be run by someone who understands it um it should be held accountable for what it's used for yeah exactly I don't think I like it's the it's not a business you know the government's not a business and I'm like yeah it is it's a shit massive business it employees like one-sixth of the entire country so yeah it's a it's a",
            "start": 1345.2
        },
        {
            "text": "I like it's the it's not a business you know the government's not a business and I'm like yeah it is it's a shit massive business it employees like one-sixth of the entire country so yeah it's a it's a employees way too many people and it's it's it's just this massive shit apparatus you know um not one I mean it's the number is lower than that one-sixth is actually the amount that Healthcare I think uh takes up of the economy um but I'm attracted to people that are Outsiders that you know Carly Fiorina who's also running for president she's the old HP CEO said something really pressing I thought which was why does everyone talk about experience about how long you've been running for office what the shit does that even mean you know it's like if you don't have experience I'd vote for her if she said that during the middle of the thing what the shit does that even mean she's all she's all she's getting hammered because she was just a CEO and stuff and it's like just the CEO you know Jeb Bush was the",
            "start": 1376.64
        },
        {
            "text": "that during the middle of the thing what the shit does that even mean she's all she's all she's getting hammered because she was just a CEO and stuff and it's like just the CEO you know Jeb Bush was the governor of Florida that's great that's all that's valuable experience but why is his experience more valuable than mine you know because he's in the government the only thing that tells you about anyone is that you can't probably trust them you know and um so I think that you know I'm fascinated by Donald Trump just watching him he's not my guy in the I don't think he's going to get through but we'll we'll see what happens I've been saying that for months and he's just becoming more popular do you think he do you think it'll be of his own volition that he doesn't go through do you think he'll just be like okay the the the joke's over I'm just leaving I don't think he's I think he's dead shit serious and I don't think it's a joke at all and and the unfortunate thing about him is that he",
            "start": 1413.64
        },
        {
            "text": "just be like okay the the the joke's over I'm just leaving I don't think he's I think he's dead shit serious and I don't think it's a joke at all and and the unfortunate thing about him is that he brings up topics that I think need to be talked about but he doesn't know how to talk about them this is one of the things I talked about with Greg is that when you have an ego the size of his part of running for president is knowing that you have to surround yourself with people smarter than you that's what that's what good candidates people that understand the system and understand the mechanics of how to run a campaign it's complicated and there are really really talented people that do it that are like that wait every four years and they get in you know a guy like Karl Rove for instance a lot of people give Karl Rove shit but Karl Rove is like an a brilliant architect of of two presidential campaigns like his he knows what he's doing and Donald Trump has an apparatus but he doesn't listen",
            "start": 1446.64
        },
        {
            "text": "of people give Karl Rove shit but Karl Rove is like an a brilliant architect of of two presidential campaigns like his he knows what he's doing and Donald Trump has an apparatus but he doesn't listen to anything anyone says you know like he was campaigning in Alabama and I'm like why are you in Alabama like why are you in Alabama you need to stay in New Hampshire you know like if I was say but like no one's listen like you just won't listen to anyone and when he brings up topics he doesn't know how to how to sensibly talk about them so like yeah illegal immigration is a massive problem in this country and most Americans agree this is not a Republican or Democratic issue like we have an influx of illegal immigrants in this country we have a shortage of jobs we have a porous border these are totally valuable things that we should be talking about but you can't talk about them in an incendiary way and say you're going to deport everyone you know yeah like you can't do so he brings up these",
            "start": 1479.44
        },
        {
            "text": "valuable things that we should be talking about but you can't talk about them in an incendiary way and say you're going to deport everyone you know yeah like you can't do so he brings up these topics that should be talked about doesn't want to talk about them he doesn't want to shut up and that's that's going to be a big problem for him but so far it hasn't been a problem isn't that the thing Everyone likes about him though isn't that the fact that like when when everyone else answers the question to immigration they really don't answer it like what did I see it wasn't immigration it was uh uh maybe it was an immigration issue I forget which candidate said it but they said that they they wouldn't be opposed to using the FBI or um uh or like the National Guard uh to enforce certain things shit I'm I'm I'm slaughtering never mind disregard that but um I think that people respond very well to that because they're not used to hearing someone actually say oh I would absolutely put up a",
            "start": 1516.76
        },
        {
            "text": "shit I'm I'm I'm slaughtering never mind disregard that but um I think that people respond very well to that because they're not used to hearing someone actually say oh I would absolutely put up a wall and it would be a really big wall and I would have my own Corporation Build That Wall which he said he was like oh he even named the the material and the actual like faux thing he would make the wall out of like he was like oh they have these walls that are like they're pre-built you have them shipped in it's super easy we'll put them in there and he's like and I'm not talking about a little wall that someone can hop over I'm talking about a 50-foot cement wall that are pre-fab that you bring in in and you put down like it's crazy to hear someone that might be president actually be like here are the logistics behind that now what what he does he need to start doing is that on every other topic when put someone asks him about it he doesn't allot that side-stepping where he doesn't finish",
            "start": 1554.12
        },
        {
            "text": "the logistics behind that now what what he does he need to start doing is that on every other topic when put someone asks him about it he doesn't allot that side-stepping where he doesn't finish his thought have you noticed that take a helicopter well he'll just start talking and then he goes off tangent and then tangent and then tangent and like the hell are you talking about this is the thing and this is this is what we've realized I think like more like policy wonks have realized like as they've watched him which is he does it doesn't matter he's the candidate of the time it doesn't matter what he says like he he went on Hugh Hewitt's show. Hugh Hewitt's like a pretty popular I don't really like him very much but a popular conservative radio host and asked him a bunch of foreign policy questions he could not answer like he couldn't answer them some of them were complicated some of them I don't even know like really know what the shit he was talking about but the I'm not that I don't",
            "start": 1591.6
        },
        {
            "text": "he could not answer like he couldn't answer them some of them were complicated some of them I don't even know like really know what the shit he was talking about but the I'm not that I don't really get into I don't I don't care much about foreign policy but um anymore but after that Trump was like he asked me gotcha questions shit him you know like and and his polling just went up like it's just like I'm like I'm like what is it's it's as someone who that's why I want to talk about to bring up I'm also curious what our fans think of him I'm somewhat neutral on him I guess is like where I kind of fall on it where I'm like he's fun to watch I like that he's he's setting the narrative he has all this money but what people are ignoring is he hasn't spent any of it he doesn't need to like people are like dying to like have him on their shows he just does whatever he goes to Alabama who the shit goes to Alabama in I don't I don't mean any disrespect to Alabama but you go to New Hampshire",
            "start": 1624.76
        },
        {
            "text": "people are like dying to like have him on their shows he just does whatever he goes to Alabama who the shit goes to Alabama in I don't I don't mean any disrespect to Alabama but you go to New Hampshire you go Iowa, New Hampshire, South Carolina, Florida, Nevada that's the order if you're not in those States almost exclusively you're shit not doing it right sure but he doesn't care he doesn't he maybe yeah I mean that's the thing or maybe there's a method to his Madness right and that's something thing that we just don't know like I don't believe that you ever really understand 100% the strategy behind like that's happening in that man's head I think he's got a strategy I don't know what it is and maybe it doesn't adhere to the normal stratagems of uh you know that have preceded it but he has something that he knows that we don't and he's going to use it to his Advantage but to what end is my question like I still don't buy that the man wants to necessarily be president I would I would not",
            "start": 1660.88
        },
        {
            "text": "that he knows that we don't and he's going to use it to his Advantage but to what end is my question like I still don't buy that the man wants to necessarily be president I would I would not surprise me at all if like two or 3 months from now he dropped out of the the election and went back to NBC and started a show that was like the best show on the shit planet and this whole thing was just to promote that show you know that's the kind of crazy the con of politics that's what I'm say he's he's an interesting dude I mean I I I I'm fascinated by him because we it's like a one he's not the first person to be like a game changer like or like someone that shakes up a race but it happens really only like once in a generation to have someone someone like this and in in a time where matchups really matter because a new poll shows Trump beating all of the Democrats which is even which is even crazier I'm like this is insane like I'm I'm like I'm like I can't believe that this is",
            "start": 1699.6
        },
        {
            "text": "matchups really matter because a new poll shows Trump beating all of the Democrats which is even which is even crazier I'm like this is insane like I'm I'm like I'm like I can't believe that this is happening but in a time where Hillary Clinton's in a lot of trouble yeah she's in a lot of trouble and it's becoming worse and worse for every day Bernie Sanders is beating her in Iowa now uh and Biden who's not even shit running is beating her in Iowa so like there's there's like ma like just major problems for her it's all about matchups and in a time where the Republicans are licking their chops hoping Bernie Sanders gets elected which is what we all hope and wish because there's a lot of delusion about him over he's a very Bernie Sanders is a very good man very consistent man um and says has been consistent for 40 years about what he says my personal take on Bernie Sanders has absolutely no prayer in the general election and a lot of people because he's a socialist and there's nothing",
            "start": 1740.28
        },
        {
            "text": "been consistent for 40 years about what he says my personal take on Bernie Sanders has absolutely no prayer in the general election and a lot of people because he's a socialist and there's nothing wrong if you want to be a socialist whatever but we've never elected anyone even remotely like him before you know and it's easy to go around saying everything you want to say when no one's challenging what you're saying sure want free education for every like free college education I want a $15 minimum wage I want 90% tax on the rich I want like and everyone's like like and and everyone's be like what the shit are you talking about you know like that's not what we do here but um he's an interesting man I think that he's the easiest to beat but that's my opinion A lot of people would disagree with that and that's that's fine we'll see how that all shakes out I could be totally wrong if we elect Someone Like Bernie Sanders this country is totally unpredictable in every respect uh which is",
            "start": 1779.88
        },
        {
            "text": "with that and that's that's fine we'll see how that all shakes out I could be totally wrong if we elect Someone Like Bernie Sanders this country is totally unpredictable in every respect uh which is an exciting way but that was my thing though like when when Trump entered the race I got excited because I was like cool it's going to be hilarious watching him or other him respond to other people right other candidates rather and I was like oh this is gonna the debate's going to be hilarious because it's going to be Donald Trump doing crazy stuff if he makes it that far and then someone's going to say something he's going to call basically be calling other candidates out on their shit that's not what's happening though somehow that shifted and now everyone's trying to take him apart and every time they take a shot at him they go down and he goes up I mean that's what it's like wrestling you you know the bad guy people like the bad guy but is he the bad guy that's the thing it's like but",
            "start": 1815.84
        },
        {
            "text": "time they take a shot at him they go down and he goes up I mean that's what it's like wrestling you you know the bad guy people like the bad guy but is he the bad guy that's the thing it's like but that's the thing the bad guy's in wrestling the bad guy until everyone loves him and then he becomes the good guy because he is the bad guy everyone loves maybe you know I don't know yeah he's an interesting cat man I'm fascinated to watch this I think this is a very Dynamic and fluid election I think that you know we have some interesting people on the left with Bernie Sanders who knows of Elizabeth Warren ends up getting involved there's a lot of people trying to draft her into it Biden looks like he is going to get in like so because Hillary Clinton's wounded and so it's and I I do believe Hillary Clinton's on on the downward spiral now because you think so yeah I I they're really trying to downplay those emails though they're but like didn't the last wasn't the last count like only like",
            "start": 1852.76
        },
        {
            "text": "Clinton's on on the downward spiral now because you think so yeah I I they're really trying to downplay those emails though they're but like didn't the last wasn't the last count like only like out of all of them what was the deal with it they saw Declassified some of them right but then like half of them were quote unquote classified so they can't really share them anyway with yeah and that's all that matters they they found more classified emails the big thing is that the person who set up her server pled the fifth when I saw that I was like that's in shit incredible I'm like I didn't see that cuz you don't plead the fifth you can't just plead the fifth cuz you don't want to testify you plead the fifth if you're going to incriminate yourself yeah that's that's the rule you don't just say like I don't want to talk it's like you're not allowed to talk if you are going to be incriminated that's what the fifth is right yeah exactly so cuz oh he doesn't have to talk and I'm like no he",
            "start": 1886.92
        },
        {
            "text": "say like I don't want to talk it's like you're not allowed to talk if you are going to be incriminated that's what the fifth is right yeah exactly so cuz oh he doesn't have to talk and I'm like no he has to talk unless he's going to incriminate himself so that is that is a a when I saw that I was like oh shit um so I think that she's unraveling and even if she's even if she gets away with it no one trusts her her you think that if because Trump is able to say all the shit that he is saying or whatever that that's going to kind of make this different and allow other people to get away with stuff as well no I think it's putting I think it's the opposite effect that's happening I think it's the more crazy shit that he says the more more people are not willing to put up with and I I I I'm conflicted on Clinton because I think she does I think she gets a lot more scrutiny than she ought to because she's a woman and I don't and I don't want to open up that can of worms but I feel like",
            "start": 1919.88
        },
        {
            "text": "conflicted on Clinton because I think she does I think she gets a lot more scrutiny than she ought to because she's a woman and I don't and I don't want to open up that can of worms but I feel like we we let a lot of guys slide with shit like this and I feel like she's I don't know but understand that General Petraeus did the same exact thing and was removed true CIA so here's the thing here's I mean we we'll close out I know we're going along here's the thing about Donald Trump he's a legitimate candidate now whether or not you agree with him or disagree with him remains to be seen whether or not he craters because he says something stupid remains to be seen But as someone who studied politics and studied history not to the degree that a lot of these that a lot of these wonks have but to a degree where I understand it very well I've never seen anything like this and what like the the what what he's looking for the definition of was it wonk, wonk, yeah a policy wonk in in politics is",
            "start": 1957.24
        },
        {
            "text": "to a degree where I understand it very well I've never seen anything like this and what like the the what what he's looking for the definition of was it wonk, wonk, yeah a policy wonk in in politics is someone who so there are different kinds of politicians a wonk Paul Ryan was a wonk who Romney's running mate it's a guy it's a guy that that crafts and understands policy so he's like the guy that like understands the minutia of a bill or like policy wonks are just people that are nerdy about the little things in politics so they're not just on the stump talking like Trump's the antithesis of a wonk for instance right but like Romney wanted to get Romney wanted to get uh Ryan on the ticket to give him validity with the people like insiders that you know and Paul Ryan writes a lot of legislation so that's just basically that's I mean that's that's about as good as I expl in any way shape or form related to Willy Wonka and the Chocolate not not related to that at all he'd get my vote asking",
            "start": 1993.56
        },
        {
            "text": "so that's just basically that's I mean that's that's about as good as I expl in any way shape or form related to Willy Wonka and the Chocolate not not related to that at all he'd get my vote asking that he would but but yeah I think I think Trump's an interesting dude I think that he's worth keeping an eye on I think someone like Bernie Sanders is interesting too because the the one thing you can't ignore with Bernie Sanders even though I think he's easily beatable in my own mind is that this whole election's been shit topsy-turvy and weird and he is saying things that people want to want to hear you know like the that the deck is stacked against them and that the rich don't care about them they don't pay their fair share and all that kind of stuff here's the interesting thing about that is if it's Trump and Sanders is Trump is saying the same thing and that's one of the things I'm saying is Trump is like I want to raise taxes on the rich I want to raise taxes on Wall Street I want to",
            "start": 2040.84
        },
        {
            "text": "if it's Trump and Sanders is Trump is saying the same thing and that's one of the things I'm saying is Trump is like I want to raise taxes on the rich I want to raise taxes on Wall Street I want to raise taxes on like he's talking about raising taxes and he's still winning like that is like usually like what took down Bush W. no new taxes right read my lips no new taxes and then he raised taxes and that was the end of Bush you know what I mean because we don't take kindly to raising taxes on anyone in the Republican Party it's not the way we are but Bush is walking around or Trump's walking around being like I'll raise taxes I'm gonna do it and and and and and like so he's almost stealing some of their shit where it's like in the general election he might be a pretty interesting character and he puts some pretty interesting states in the play he's definitely an interesting character do we feel like do we feel like the reason a lot of more people trust him on fiscal issues is just because",
            "start": 2074.04
        },
        {
            "text": "he puts some pretty interesting states in the play he's definitely an interesting character do we feel like do we feel like the reason a lot of more people trust him on fiscal issues is just because he is like he is known for being the business person the United States like he is the face of entrepreneurship yeah and and he's and a lot of people attack him because he's had some bankruptcies and stuff I didn't like the way he dealt with that question where he was like he so people were asking like you you've declared bankruptcy four times like your business have declared bankruptcy four times and I was like oh this is such a slam dunk answer and I was expecting what I was expecting him to say was like I own hundreds of businesses so I four of them declared bankruptcy my my success rate is like 98% right what's your success rate you know something like very Trump-like but instead he was basically being like I declared bankruptcy because I could make more money out of it and I was",
            "start": 2115.0
        },
        {
            "text": "is like 98% right what's your success rate you know something like very Trump-like but instead he was basically being like I declared bankruptcy because I could make more money out of it and I was using the system and I was like that's an interesting answer that's an interesting answer not the way I would have went down the road again he needs to listen to people that know what they're doing because he doesn't know how to run a campaign imagine how effective he could be if he had people that he could if he had his own see there in there in lies the problem there in lies the the the issue is because to do that would take away that transparency which I believe people are vibing with people are responding to that full transparency he basically was like I'm gaming the system I'm doing something that no if everyone else did our economy would collapse but I am doing it I am taking advantage of that because it's a smart business that I'm sharing this I this with you guys I'm being honest if you",
            "start": 2148.72
        },
        {
            "text": "no if everyone else did our economy would collapse but I am doing it I am taking advantage of that because it's a smart business that I'm sharing this I this with you guys I'm being honest if you start layering yourself behind those layers of of the Karl Roves or uh your your your sort of political handlers don't you take away a little bit of that magic you do but you don't have to make them like a public figure either like he just I just I can tell when he walks around he doesn't he's not listening to anyone I think he has anyone I think like I think his his opponents backstage have like 40 handlers and then it's to the Trump table and it's like you know a fucking Fanta and maybe a line of cocaine and he's just like let's go after this you know I'm not I'm not accusing Trump he will sue me please don't he's an interesting character and I I I think people I think you're I think people are not taking him seriously at their own risk I guess I'll leave it there like I think that he's in",
            "start": 2190.32
        },
        {
            "text": "me please don't he's an interesting character and I I I think people I think you're I think people are not taking him seriously at their own risk I guess I'll leave it there like I think that he's in this stay I think he's going to win some states and I think that in in the primary and we'll see what happens when when we get to Super Tuesday and stuff if he's still in cuz Super Tuesday is really going to be a test of money and all that kind of stuff so we'll we'll see what happens but but yeah like I find him interesting as someone who just likes politics who doesn't really agree with much of what he says in terms of like like I don't like how he went after John McCain I don't like all these kinds of things I don't I'm a little concerned he doesn't seem to know a lot I like how he I like how he answers a lot in terms of like you know we're just here having a good time he says that a lot he's definitely the awesome I'm like you're they just asked you a fucking foreign policy question",
            "start": 2231.72
        },
        {
            "text": "how he answers a lot in terms of like you know we're just here having a good time he says that a lot he's definitely the awesome I'm like you're they just asked you a fucking foreign policy question and you're talking about how much of a good time you're having the fuck are you talking about and and polling number to go up Five Points so it's totally unpredictable and and again I I'm telling you he has support with Independents he has support broad support across the entire spectrum of Republican Party and that is not something I've ever seen I know and I've never seen it and I don't know if we're ever going to see that again because I think the Republican Party is fucking crumbling in on itself like a dying star anyway so this might be one of the last times we ever see the Republican Party um and it's going to be so he he might be like the Nero of like just fiddling as like Washington burns or as the Republican Party burns or he might be the smartest man in the room and at this point",
            "start": 2265.08
        },
        {
            "text": "um and it's going to be so he he might be like the Nero of like just fiddling as like Washington burns or as the Republican Party burns or he might be the smartest man in the room and at this point I just I fuck don't know it's fascinating I I'm inclined to vote for him just to see if he can turn the White House into Dan Bilzerian's Instagram pages where it's just like like you just like remember they had that they talked about the candidate that you'd most want to have a beer with and it was like that's why Bush one of the main reasons why people liked Bush um because they were like he's just the kind of guy you want to dude he's a normal guy you want to go have a beer with him or whatever and then later Obama tried to have beers with people you're like it's not working um Trump's the kind of guy you want to party in Vegas with he's the kind of guy that's like because he owns a hotel in Vegas right like this he's just he people just want to see what happens and it's crazy sorry Greg",
            "start": 2296.96
        },
        {
            "text": "of guy you want to party in Vegas with he's the kind of guy that's like because he owns a hotel in Vegas right like this he's just he people just want to see what happens and it's crazy sorry Greg you've been trying to wrap up for the last 15 minutes I haven't I'm just listening you finish I can tell because your eyes go sleepy you get sleepy eyes squinted you yeah I don't know maybe you are I mean you always miss the natural end point that's the funny thing about you I don't know if you ever go watch your your your performance Colin always puts a button on it then you got one more thing I like to do that this topic was brought to you by Squarespace Nick we use Squarespace we do use Squarespace you found it you used it it came to you like C little rocket ship that I I mean yes that's exactly how it happened when I was using it I was like this is very very close to the original Richard Donner Superman Squarespace provides simple powerful and beautiful websites that look professionally",
            "start": 2332.64
        },
        {
            "text": "how it happened when I was using it I was like this is very very close to the original Richard Donner Superman Squarespace provides simple powerful and beautiful websites that look professionally designed regardless of skill level no coding required not only does Squarespace provide you with intuitive and easy to use tools to create your website with Squarespace also has state-of-the-art technology powering your site to ensure security and stability and you know you can trust in Squarespace for your website because millions of other people do too when you decide to sign up for Squarespace make sure you use the offer code Kinda Funny to get 10% off your first purchase and to show your support for us Kinda Funny uh we of course thank you Squarespace for taking care of us Squarespace build it beautiful oh you knew it you did oh I know it you're good you're really good build it beautiful build it beautiful build it you beautiful beautiful people put a comment in there and the whole",
            "start": 2371.96
        },
        {
            "text": "it beautiful oh you knew it you did oh I know it you're good you're really good build it beautiful build it beautiful build it you beautiful beautiful people put a comment in there and the whole meaning of the sentences Chang I like it I like it better with the comment that Squarespace just calling everybody beautiful and I I like to think you are Squarespace well thank you that's Donald Trump's thing as well build it beautiful and another skyscraper goes up",
            "start": 2411.28
        }
    ]
}