{
    "id": 1201,
    "video_id": "eks10AqqFRw",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Let's Play Shovel Knight Plague of Shadows - Kinda Funny Plays",
    "description": "Colin and Tim check out the new Shovel Knight DLC.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1442494801,
    "duration": 1565,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to Kinda Funny Games. This is a Let's Play of Shovel Knight: Plague of Shadows, the free DLC on all the different platforms. I'm Tim Gettys, this is Colin Moriarty, it's going to be here with you today. No, Colin, we just, we just did, yes, a recording of this game, yes, and uh, we're not going to use it. No, no, no, because I got the, the intro scene has this one jump. I was looking at my email to make sure that this was free. I'll look at it in a second. I think it is. Uh, the intro sequence has this one jump that's like absurd, insane, insane. And I, so the idea of playing Shadows when you, when you download it is that you have already beaten Shovel Knight and then you choose him as your second character. So it assumes that you have already played the game. So we got through the intro sequence and now I'm back in town and here I'm trying to get in and this Knight's not letting me in. So I'm going to have to like leave. He called me like, he told me to get me a bunch of names. He called me, said I",
            "start": 0.08
        },
        {
            "text": "now I'm back in town and here I'm trying to get in and this Knight's not letting me in. So I'm going to have to like leave. He called me like, he told me to get me a bunch of names. He called me, said I had a bird face, which I didn't really appreciate. Uh, so I'm going to go back this way and this is a new part of town here we have never seen before. So let's start here and see what this gentleman has to say. Hedge pupil, I'm still guarding your secret entrance, but I lost the key. The locksmith should be here in a week or two. Maybe you could wait until then. All right, yeah, let's wait a week or two. Wait, we'll be back, guys. So one of the things you learn here is that when you hold down the attack button and then let it go, you jump. So Plague Knight can double jump. So the biggest thing here is Plague Knight plays completely differently than Shovel Knight. It's not just like a skin change or something. It's like the mechanic. This is a different game, right? And I'm not, and I got to be honest, I'm not like",
            "start": 37.56
        },
        {
            "text": "plays completely differently than Shovel Knight. It's not just like a skin change or something. It's like the mechanic. This is a different game, right? And I'm not, and I got to be honest, I'm not like first blush, not crazy about it. So I want, I want to keep playing and see if my, if, if I change. I'm just very stubborn in the way I like to play games, right? Like that's just, I mean, that's a well about me. So it could just be me not willing to change, having found such perfection with Shovel Knight, which Shovel Knight was my Game of the Year, um, way back in, uh, last year. So way back, yeah. Uh, when we were still at IGN, that was my Game of the Year by far. So, um, I, I'm a little disappointed that it doesn't play more the way I wanted it to play, but you know, I mean, that's to be expected. So we're different though, that's cool. So, um, this woman's in the original, mhm, so we're talking to her. So it seems like we'll go back to the world map again, but it seems like you're basically going to the same stages. I'm",
            "start": 73.0
        },
        {
            "text": "though that's cool. So, um, this woman's in the original, mhm, so we're talking to her. So it seems like we'll go back to the world map again, but it seems like you're basically going to the same stages. I'm interested how they changed them up. I found that when I fought Black Knight, uh, in the original intro stage or whatever, that he was actually quite easy with the projectiles. I, I'm really interested to see what they do with Plague Knight's stage. Me too, seeing that you're, you're him. We were talking about this in our, in the Let's Play we just recorded, but so my favorite is Spectre Knight. Your favorite is Tinker Knight. Tinker Knight, yeah. And yet they went with Plague Knight. Well, I also, I like, I'm a fan of him. I was always a fan of the, the aesthetic of his level and stuff. Sure, sure, sure, sure. And I do think that the gameplay mechanics that he has are interesting and different enough from Shovel Knight to make this worth playing again potentially. Like, 'cause when I thought it just looking at the trailers",
            "start": 111.04
        },
        {
            "text": "that the gameplay mechanics that he has are interesting and different enough from Shovel Knight to make this worth playing again potentially. Like, 'cause when I thought it just looking at the trailers and stuff without really inspecting what this was, I was like, \"Eh, I don't really need to play through it again,\" right, right. But this looks really different and they actually changed the levels. So we got arcs into the air before it comes crashing down. So I can do this and I, so I can talk to her and and buy things. I can research things. I guess this is what the coins are for. I have a bunch of new toys, but we still need to build them. We'll need 40 Cipher Coins. So Cipher Coins. So I don't have enough. I have eight Cipher Coins so far. So it's cool. There's like a whole little like new hub town to explore with all the same people. This is pretty funny. Oh dear, horse dude. This, this gentleman. Oh, long. Oh, so he's the musician. What you need? Science. Play me a song. Oh, okay, cool. So those are the music, that's the music",
            "start": 153.76
        },
        {
            "text": "people. This is pretty funny. Oh dear, horse dude. This, this gentleman. Oh, long. Oh, so he's the musician. What you need? Science. Play me a song. Oh, okay, cool. So those are the music, that's the music I found. All right, so let's get, let's just get back into the business. I'm going to go to, I'm going to go to King Knight, who I actually have for science. I like that instead of shy. I like how he appears like that too. So, so, so the game, you know, the stages seem to be the same. I'm interested to see what they do with, uh, some of the, yeah, his own stage. So yeah, he can double jump, which is quite useful and he can also double jump and then explode and things like that. Um, so King Knight's stage is by far the easiest stage in the game. And so I'm interested to see if it's like absurdly hard, like parts of the, uh, the intro even was. There we go. There we go. All right, so we're cruising. So it's, I thought it was like Metroid where the bombs kind of blow, blow you up, but it's not like that. Instead, you hold X to charge and then",
            "start": 196.6
        },
        {
            "text": "was. There we go. There we go. All right, so we're cruising. So it's, I thought it was like Metroid where the bombs kind of blow, blow you up, but it's not like that. Instead, you hold X to charge and then you can jump and when you release it, you kind of are a bomb yourself and kind of like, exactly, you just fly forward. Well, what I like here, um, is that I'm like, I'm automatically just walking around charging it a lot, which is the way you play like the later Mega Man. You like get the, the Buster. So nothing seems, seems that different so far on King Knight. The, but the intro stage looked the same too until we got a little farther. Yeah, they would remix a lot of the, the different things. Like, yeah, this is the same. God, I played this game. Those are my favorite enemies, the rats. Yeah, they're so funny. The double jump definitely changes the dynamic of the game quite a bit. It's going to change like, the thing is, this projectile is going to change the boss battles. Yeah, but so far, I mean, it feels, it feels",
            "start": 266.68
        },
        {
            "text": "double jump definitely changes the dynamic of the game quite a bit. It's going to change like, the thing is, this projectile is going to change the boss battles. Yeah, but so far, I mean, it feels, it feels nice. It feels fine. I'm not, you know, I'm still getting used to, I'm still acclimating. I guess it doesn't hurt people get this. Eat myself a chicken. Mhm. I always thought it was a turkey. It could be. Oh, this is new. What is this? Something various up here. Got a lot of spikes going on. Yeah, this is like an alternate route. Yes. This is all I remember any of this. That coin. The funny thing is is like figuring out when you shouldn't double jump, like when, well, when you shouldn't explosively jump, 'cause you can't really control yourself once you're in the air. Here we go. I have to go back. Interesting. I think I can go this way. Miss. I'm probably missing something, but **** it. Oh, they're back. Your friends are back. Propeller Mice. They're just so funny. Yeah, they're a little ridiculous. All right.",
            "start": 319.56
        },
        {
            "text": "I think I can go this way. Miss. I'm probably missing something, but **** it. Oh, they're back. Your friends are back. Propeller Mice. They're just so funny. Yeah, they're a little ridiculous. All right. So we'll go back to once we came. I might need like a special item. Yeah, the mice remind me of Batman Returns when the Penguin put the little jetpacks on the penguins. I can respect that analogy. See, so that was a difference, but everything else is the same. And you want to just kind of force these things down. Yeah, beetles ready. I wonder if I can actually fit in there. I guess I can't get. Oh, huh. Should we do it? Yeah. Oh, yeah, I can't into little space. I don't remember that in the original game. Really? Yeah, that was what's it do? It brings you to a special room or one of the treasures is like one of the weapons. Uh, let's see. I remember that very well 'cause I thought it was like so clever. It's funny 'cause a lot of this is made, it's like since the, this particular stage has been very remixed very much. It's",
            "start": 420.2
        },
        {
            "text": "uh, let's see. I remember that very well 'cause I thought it was like so clever. It's funny 'cause a lot of this is made, it's like since the, this particular stage has been very remixed very much. It's like still made for Shovel Knight. You can actually like do things that you can never do. Mhm. Oh God, you can like, I wonder if you can like, it just seems like the platforming is a little off because you don't have to, um, do not limited. Yeah, exact, exactly, right? These guys are funny. I like their little swipe. Yeah, the animations in this game are awesome 'cause some of them are just so weird. Like, I wonder if I, I guess what I'm saying is like, like I can just skip them. Yeah, which is interesting. Yeah, the anime, I mean, the dot art done by this guy named WNC over there and, uh, just he's very, very smart and knows exactly what he's doing. Super impressive. I think one of the best in the business right now and clearly inspired by some of those great games we grew up with. I like this, I like this new, this",
            "start": 493.44
        },
        {
            "text": "exactly what he's doing. Super impressive. I think one of the best in the business right now and clearly inspired by some of those great games we grew up with. I like this, I like this new, this new currency system though, in ter, like I like, I like games that can be lots of things to do that are like optional, but there and you can kind of **** around with. I mean, even the original Shovel Knight was like that. Like I feel like there was so much stuff in towns and all the secret like that, the weird river, yep, thing, whatever that was called, where they do the weird dance for. Yeah, yeah, there's, yeah, see, this is like so much easier to get back up there. Yeah, like you don't back, like you have to use those enemies to bounce. Yeah, so that's what I'm saying is like there's just only so much remixing that seems to have been done, which is fine. Like these guys, you could just skip a lot of it. This part will be interesting too, 'cause I'm not even sure that I, yeah, I guess I won't get it. Yeah, and this",
            "start": 554.52
        },
        {
            "text": "that seems to have been done, which is fine. Like these guys, you could just skip a lot of it. This part will be interesting too, 'cause I'm not even sure that I, yeah, I guess I won't get it. Yeah, and this actually, this is going to be really quite complicated. Oh, ****. Yeah, let's go this way. Yeah, **** it. Yeah, I'm interested to see how you do this. Yeah, 'cause usually you just pogo right on them. I guess this isn't too bad with the jump though. Yeah, it's still going to be, it's going to be still be pretty. There we go. Oh, that was good. That was a pro maneuver. That this is scary. **** those green coins. God damn, worth it. That was rough. Be out. I'm say just skipping him not good for my currency. I mean, if I'm, when I, when it comes to when I played for real there, I'll be playing it much more strictly. I wonder what they, what they say to each other. What I like King Knight a lot. I like how he like isn't really even a king. The name itself doesn't really even make any sense. Yeah, so like the",
            "start": 597.96
        },
        {
            "text": "strictly. I wonder what they, what they say to each other. What I like King Knight a lot. I like how he like isn't really even a king. The name itself doesn't really even make any sense. Yeah, so like the boss fights are a little bit, you know, they're like, they're fighting the same, but you just, it's like when you play Proto Man or Bass and Mega Man opposed to Mega Man. Awesome. Yep, that was simple. Now to be fair, you're a pro at these Shovel Knight games. If you were to play King Knight with Shovel Knight, would you have beaten that fast? If I was played, if I was to, what do you mean? If I was play, if you, if you were Shovel Knight right now facing off against that boss, that would have been way easier than that. I would, I would even gotten hit. Okay, yeah, like I, King Knight, I had down to a science for sure. Drop the essence into my Dynamo Decanter here. Essences are volatile. Once the essences are all distilled together, if my research is correct, then we can craft the ultimate potion. Like I discovered",
            "start": 707.96
        },
        {
            "text": "sure. Drop the essence into my Dynamo Decanter here. Essences are volatile. Once the essences are all distilled together, if my research is correct, then we can craft the ultimate potion. Like I discovered that his crown is a real gold. Do you think you fight Shovel Knight at some point? I hope so. That's what I was actually just wondering though. That's funny that you say that. I hope that that's the case. Let's see what do I want here. Produces wall climbing flames. I'm going to, you know what? I'm not going to buy anything. I'm going to go buy, see if I can go buy some health and then we'll try Spectre Knight to close things out and see you play. We're going to go to Spectre Knight's stage. Just play. Wait, but I thought we wanted to try to play Plague Knight's stage. We can't get there yet. It's not open. Gotcha. Yes. Uh, how can I help you, Percy? I run out of paper. I can't feel any more. Oh, okay. So this is the music. They made a glue joke to the horse, which was funny. Where's the guy that like, who is this young man?",
            "start": 776.68
        },
        {
            "text": "can I help you, Percy? I run out of paper. I can't feel any more. Oh, okay. So this is the music. They made a glue joke to the horse, which was funny. Where's the guy that like, who is this young man? I picked up your special delivery. Want to take a look at, settle the bill. Trying to sell that was for the, when you go to the river, the dancing thing. Of course, my. Okay, well, **** all you. Yeah, useless. Actually, I never went this way. I wonder if this is just an exit, the back. This is a really cool pixel art here is like, and the animations are awesome. Yeah, so we can't go that direction yet. Huh, man. So we're never going to know what happens with Plague Knight. **** with this guy. See what. Oh, oh God. Oh, that was Jesus. Oh, oh, yeah, not ideal. Should have spent that money when I had the chance. Spend that money. **** it. Leave me alone. I love the Mario 3 style. You too. Back and forth of where's he going to end up. Boom. All right, so Spectre Knight's stage. Let's see what we can do here. This is a, this is",
            "start": 831.52
        },
        {
            "text": "money. **** it. Leave me alone. I love the Mario 3 style. You too. Back and forth of where's he going to end up. Boom. All right, so Spectre Knight's stage. Let's see what we can do here. This is a, this is actually a fairly tough stage, um, with the dis, like when the lights disappear and stuff. And this, this thing be like, oh, so even need those anymore. That's funny that you just blow those up. In the real game, you would use them as like pogos and and and stuff like that. You get them to jump up, but you don't need that's funny. Very self-aware. All right, yeah, **** you, frog. Okay, that's a bomb, I think, right? Bomb. Of course. See you. **** you. It's hard for me not to play the way I, I, I'm like, I'm like resisting not playing the very methodical way I'm playing 'cause I feel like it would be boring. Watch. All right. I wasn't turning around. Oh, so I thought he wouldn't turn around until the exploded. That's not true. Just wasn't playing right. So this is another guy we should just be able up hop right over and then",
            "start": 912.12
        },
        {
            "text": "wasn't turning around. Oh, so I thought he wouldn't turn around until the exploded. That's not true. Just wasn't playing right. So this is another guy we should just be able up hop right over and then here again we should be able to. Oh, I guess that enemy's in the way. Try again. No, you got to do it the right way. Clever. I don't think I can make that jump. I think I have to go this way. Yeah, I think you land on just the top. So let's go in here and we'll just to be safe. Spectre Knight's going to be tough actually with the projectile. I'll be interested to see. I love his animations, man. He looks so **** cool. Yeah, he is very cool, very cool. Definitely one of the cooler guys. I've always had a weird obsession with like the Grim Reaper in the sight, that design. You must love Castlevania then. I mean, that he's, that he's like Dracula's like second command in every one of those games. Got that far. Fair enough. All right, that's what I need. I needed that real bad actually. I'm might even bother. I",
            "start": 1001.32
        },
        {
            "text": "I mean, that he's, that he's like Dracula's like second command in every one of those games. Got that far. Fair enough. All right, that's what I need. I needed that real bad actually. I'm might even bother. I usually off there and **** around, but let's just see if we can get through this a lot in one **** piece. Come on. There you go. Yeah, I like those designs as well. This stage is very Castlevania to me. Yeah, I mean, I think that was the, the point, right? Yeah, presumably. Come on, you son of a ****. I'm on Spectre Knight. You though that was invincible, Lord. I think the stage is actually very clever in terms of just design. Really cool. ****. I wish this project that further. Yeah, it's a really weird like arc. Yeah, it's tough. It's tough puzzle solving here. So it's, it's funny how remixed the intro was, but it doesn't seem like the stages are remixed at all. Not that I blame them. I mean, they're giving this away for free and I wouldn't, I wouldn't put, you know, amount of work into it. I work that was all right my way",
            "start": 1084.52
        },
        {
            "text": "seem like the stages are remixed at all. Not that I blame them. I mean, they're giving this away for free and I wouldn't, I wouldn't put, you know, amount of work into it. I work that was all right my way through. I've actually never seen that happen before. I thought it stopped. Guess not. Yeah, the coin. Now I'm just trying, I'm just really focused on surviving. Aren't these, um, I want to be invincible. Yeah, here. **** that noise. All right, this part's going to be tough. Looking good. Oh, oh, man. There's no way to control yourself. I wish you could just pop a little bit. There's no finesse. Let's try it again. Chopping on or something down. What the hell? Here, you got to just go straight up. Double jump. Yeah, the double jump's key. This part might actually be easier in some respects with it. **** you, crazy. Like the last second. Got to do it. All right, here we go. So let's do this first. No, what I was. **** it. Let use. Yeah, what do I have? Lives. It seems like they're pretty common and we'll have hit the checkpoint.",
            "start": 1190.2
        },
        {
            "text": "like the last second. Got to do it. All right, here we go. So let's do this first. No, what I was. **** it. Let use. Yeah, what do I have? Lives. It seems like they're pretty common and we'll have hit the checkpoint. So in case we die, we shouldn't have do that again. Yeah, the animations are just beautiful in this play. Talking a lot of ****. Mm. Yeah, this is going to be tough. Yeah, this is like really, yeah, I don't hard. You know what? Area effect. There we go. Yeah, I think you're going to have to just. ****. This is tough. Down on the ground. Oh, patient. Trade blows. It's kill me. Die for sure. I. Okay. Got him. Yeah. Oh, man, that was clutch. Yeah, that was crazy. Turned it around. Oh, man, I thought you were dead for sure. Me too. Well, that's it. I mean, that's, I mean, that's not it. There's more, but that's going to ruin it all for you guys. Plague of Shadows, Shovel Knight free. Let me verify. I'm going to go on my, I'm going to go on my email right now while we watch this ending animation. Just want to make sure. Let's see, see.",
            "start": 1359.32
        },
        {
            "text": "ruin it all for you guys. Plague of Shadows, Shovel Knight free. Let me verify. I'm going to go on my, I'm going to go on my email right now while we watch this ending animation. Just want to make sure. Let's see, see. Unfortunately, yeah, this is a free update. It's awesome. So I'm playing on PC with an Xbox One controller, but you can play it on everything that it's available on. It'll be available for free for you. Uh, hopefully by the time you watch this, we're around that time. Mhm. Tim, yeah, that's it. I'm, I'm proud of you. Thank you. You did good. Thank you. I appreciate. Did damn good. I appreciate that. Thank you. Look at that. Yeah, the animations are really cool. Um, all right, so that's, uh, Shovel Knight: Plague of Shadows. Thanks for tuning in. I'm Colin. This is Tim. We'll see you next time on Kinda Funny Games. Goodbye.",
            "start": 1516.72
        }
    ]
}