{
    "id": 1179,
    "video_id": "eWOH2UI7j44",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Mega Man 2 Entire Game Full Playthrough - Kinda Funny Plays",
    "description": "Colin Moriarty beats Mega Man 2 on the Mega Man Legacy Collection. Come back tomorrow for Mega Man 3!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1441738800,
    "duration": 3171,
    "transcript_chunks": [
        {
            "text": "today we jump into Mega Man 2 which to many people is the best Mega Man game. I don't agree. It's a fantastic game. We'll watch the intro together. It's a fantastic intro. Uh, Mega Man 2 is uh really when Mega Man came on the scene and really really made it big. Um, and I think it's a fantastic fantastic game. I think Mega Man 3 is the better game. Um, but I think Mega Man 2 is certainly special in its own way. Um, so the beginning section here just um explains the story. Wily in the first Mega Man game reprograms robots he created with Dr. Light. Uh, in this one he's created his own robots, um, which are of a more devious variety as opposed to being reprogramming kind of general robots, which is what Mega Man 1 was all about. Uh, so here in the west we have two difficulty settings. I'll go with difficult, which is the normal difficulty setting really. Um, and we have places that we can begin. I'm going to go to Metal Man Stage first, and the reason is that Metal Man is beatable with the Mega Buster.",
            "start": 1.68
        },
        {
            "text": "which is the normal difficulty setting really. Um, and we have places that we can begin. I'm going to go to Metal Man Stage first, and the reason is that Metal Man is beatable with the Mega Buster, although I might need to use an E-Tank. We'll see depending on the condition I am when I get there. But more importantly, his Metal Blade is just beastly. Um, it's just a beastly weapon. It's like the most overpowered weapon in Mega Man history by a mile. Um, and you're going to see what I mean when I get it. It's even so powerful that I can kill Metal Man himself in one or two hits, like his own weapon, which I love. I love that little Easter egg. So here these like little corn kernel type things come up and I my whole technique here is to just keep moving. No time to dilly-dally. They're going to do some damage to you and that's fine, but there's just no reason to dilly-dally there. Just go them. You could use the Flash Stopper if you beat Flash Man already. The Time Stopper should stop, but we don't have it yet. You could",
            "start": 53.4
        },
        {
            "text": "to you and that's fine, but there's just no reason to dilly-dally there. Just go them. You could use the Flash Stopper if you beat Flash Man already. The Time Stopper should stop, but we don't have it yet. You could also use other weapons to make it easier, but there's just no need. So we're moving and we're cruising. These guys, these clown type characters are going to come on their little tires and kill them. Oh, I can't believe I got hit by that. That's embarrassing. So let's get through this guy here. Extra life. Let's be going to Metal Man a little hurting here. I think now you can get that E-Tank. You don't really need it, um, even though you might use one here to fight Metal Men to get through them. Uh, it's a trap unless you have Item 2, which you don't get out of there. This jump is long, so you want to be really careful with it. Oh jeez. So we're to Metal Man Stage. He's probably going to kill me. I'll let him kill me and then we'll fight him straight up, but fighting him this first time will",
            "start": 106.96
        },
        {
            "text": "want to be really careful with it. Oh jeez. So we're to Metal Man Stage. He's probably going to kill me. I'll let him kill me and then we'll fight him straight up, but fighting him this first time will show you uh one of the cool things about him, which is that he won't really attack you unless you attack him, which I think is really funny programming too. So if I just sit here, he's not going to attack me, but once I start shooting, he'll start attacking. So he killed me there. It's fine. It doesn't really matter. And some people use the technique of trying to stay near him because he'll keep jumping if you stay near him, uh, which is like kind of the technique you use on Bomb Man and Mega Man 1, but that's not really I don't know. I don't really get off on fighting him like that, but I can show you how that is how that's done, which is that, but it just kind of like leaves you open, I think, to attack and bumping into him, which does a lot of damage. So I'll use an E-Tank here just to so we have to do this",
            "start": 175.6
        },
        {
            "text": "is how that's done, which is that, but it just kind of like leaves you open, I think, to attack and bumping into him, which does a lot of damage. So I'll use an E-Tank here just to so we have to do this again. We'll get plenty more. You can only carry four and we will have four in Wily's Castle, plus we can get them in Crash Man Stage and other places, so not a huge deal. All right, so that's Metal Man. We're going to get the Metal Blade now. The Metal Blade is just super useful. It gives us a lot of different options, a lot of different directions we can go from here. Um, we can go to Bubble Man, we can go to Wood Man, we can go to Flash Man. I mean, those are are kind of the places we can use Metal Blades on, and I think we'll probably just knock all three of those out. Um, I guess I'm going to go to Bubble Man first, kind of get over with. So if you watched our Mega Man 1 let's play, you will have heard me uh during Ice Man Stage when we entered an underwater area that the buoyancy of the stage wasn't changed.",
            "start": 226.92
        },
        {
            "text": "kind of get over with. So if you watched our Mega Man 1 let's play, you will have heard me uh during Ice Man Stage when we entered an underwater area that the buoyancy of the stage wasn't changed. Mega Man felt the same underwater. That changes drastically in uh Mega Man 2. Um, and even though the it starts above water, we're going to be in the water soon and you're going to see that the buoyancy increases and this is used uh to great detriment against Mega Man, um, throughout the rest of the series really, not only in this game. These blocks will disappear or fall, so if you don't move quickly enough, you see, so you want to just keep moving here. You can do that, but then the enemies are going to lose their shell. So if you play the game on normal difficulty, like normal easy difficulty, those will die in one hit. The guys in Metal Man Stage that shot apart and then came back together and you got to kill them again, they will also um just die in one shot. So the difficulty does materially change the",
            "start": 273.88
        },
        {
            "text": "in one hit. The guys in Metal Man Stage that shot apart and then came back together and you got to kill them again, they will also um just die in one shot. So the difficulty does materially change the game. Here we'll go to uh Metal Blades. Fight these big fish enemies and what you want to do is kind of just nail this thing on top of his head and you can see now like Mega Man, I don't want to show you too much probably jumping into spikes, but Mega Man, you have to like really measure your jumps here. As you can see, I'm using Metal Blades, which by the way can be shot in eight different directions, which makes them even more useful. All right, so we can jump up here. We're almost to the end of the stage already. Just have to get through a few more parts. Okay, we are almost through. Now you can try to kind of fish him out a little bit. Yeah, these are placed so that they like interrupt your jumps basically, so you just need to be really patient. And then there's none here, so now we're going to go",
            "start": 333.6
        },
        {
            "text": "of fish him out a little bit. Yeah, these are placed so that they like interrupt your jumps basically, so you just need to be really patient. And then there's none here, so now we're going to go back underwater and we're going to fight Bubble Man. Use the Metal Blades and Bubble Man's a chump. He just fights in the same style over and over again. You just can take them out really quick, especially the blades. And because you can just shoot upwards, you just you just put them away. Um, so with this, we'll get the Bubble Lead or the Bubble Lead, depending on who you are and how you want to pronounce it. I called the Bubble Lead for most of my life and then I started calling him Bubble Lead just the last few years because I've heard some people that know the series very well calling it that, but I don't really know. I think I I still feel like it's Bubble Lead, but it doesn't really matter. Call whatever you want. All right, so with that, we have some options here. I'm going to go uh and take care of Flash Man.",
            "start": 415.28
        },
        {
            "text": "know. I think I I still feel like it's Bubble Lead, but it doesn't really matter. Call whatever you want. All right, so with that, we have some options here. I'm going to go uh and take care of Flash Man now 'cause we have the Metal Blades. Man, get through these guys that we can just kind of clown out pretty quickly. Fantastic music on Flash Man Stage, by the way. Please enjoy it with me. And you slide, by the way, on this stage if you stop moving and the stage is a bit of a labyrinth. Uh, you need Crash Bombs to really be able to explore it fully. We don't have them. Those red barriers can only be destroyed with Crash Bombs, and we also don't have what we need to really fight these like AT-ST like enemies, so we're just going to keep moving. You can use the Air Shooter on them from Air Man if you have them, but we don't and that's okay. But what we can use here are uh the Metal Blades on these uh squiggly little enemies and then we'll switch back to the Peashooter um to fight this guy. Grab the health you",
            "start": 467.32
        },
        {
            "text": "we don't and that's okay. But what we can use here are uh the Metal Blades on these uh squiggly little enemies and then we'll switch back to the Peashooter um to fight this guy. Grab the health you really need and we get through there. All right, so we're almost at the end of the stage already. This uh requires some slick jumping up here, um, but if you do it right, you can get an E-Tank. You want to just kind of should ah, I shouldn't have stopped there. Uh, so we're not going to get that E-Tank. We don't really need it, but could have used it. Not a prerequisite. Um, and you can use the Crash Bombs to get on the other side if you had them. Uh, so Flash Man uh uses a weapon that is quite ubiquitous in Mega Man later. Bright Man uses the same weapon. Uh, Centaur Man uses the same weapon. It's a Time Stopper, um, but he's the one that introduces it, so he can freeze time and you really want to try to put him away before you even use it if you can. And it looks like I might. Yeah, so he'll eventually he want Flash Man's",
            "start": 526.68
        },
        {
            "text": "he's the one that introduces it, so he can freeze time and you really want to try to put him away before you even use it if you can. And it looks like I might. Yeah, so he'll eventually he want Flash Man's whole thing is he's going to try to stay on top of you and you just stay still and he's just going to keep running into you. He has no pattern other than that, but eventually he'll stop, freeze time regardless of where you are, and then start shooting at you as well. So he has multiple weapons kind of was to damage you. Dr. Light hook us up with uh an item, Item 3, which is uh not a super useful item, but we're going to use it a lot in Wily's Castle. And these, unfortunately, they learned later in the Mega Man series, these screens can't be skipped and they take for **** ever in Mega Man 2. Um, they kind of remedy that situation later on. So from here we can go in multiple directions. We have the Flash Stopper now, um, so we can go fight Quick Man if we wanted to. Um, I'm actually going to go in a",
            "start": 599.08
        },
        {
            "text": "kind of remedy that situation later on. So from here we can go in multiple directions. We have the Flash Stopper now, um, so we can go fight Quick Man if we wanted to. Um, I'm actually going to go in a different direction and we'll take care of Wood Man right now, um, since we can use the Metal Blades. You can also use Atomic Fire on uh Wood Man if you want to fight Heat Man first, but not really necessary. Wood Man Stage is very cool though. I like Wood Man Stage a lot and some more great music. So here, I mean, you can basically just keep the Metal Blades equipped the entire time you want. If you let these like robotic jack rabbits stay around too much, as you just saw before, they'll shoot carrots at you. If you move quickly, you can just get through these guys without fighting them. Here the these robotic dogs are introduced. Metal Blades will take care of them quickly. You got to kind of be a little bit careful though. He does look like Rush, but he's not, so don't fear. Don't don't worry about it. It's not Rush.",
            "start": 656.28
        },
        {
            "text": "are introduced. Metal Blades will take care of them quickly. You got to kind of be a little bit careful though. He does look like Rush, but he's not, so don't fear. Don't don't worry about it. It's not Rush. He's not Rush. Hasn't been built yet in Mega Man lore. Perfect. Sometimes you just get a serendipitous drop like that. Oh, the hammering. Yeah, someone's hammering again. I don't know what what's going on that. All right, now these guys you can just kill quickly before they even make themselves a nuisance. If you don't kill these, there you go. Uh, these monkey creatures, they'll jump up and attack you. **** that was bad. So we're almost to the end of the stage already. So couple more parts to get through. Why you jump? Hm, why you why do I jump? You move quicker and it's just I just, you know, it's just how I roll, Kevin. It looks more stylish that way, doesn't it? Wouldn't you say, Kevin? Really care. All right, so here's the thing. These enemies will come at you and if you duck away from them, they'll jump over you and",
            "start": 708.76
        },
        {
            "text": "it looks more stylish that way, doesn't it? Wouldn't you say, Kevin? Really care. All right, so here's the thing. These enemies will come at you and if you duck away from them, they'll jump over you and then we are at Wood Man's level. Now again, you can use Atomic Fire on him. He uses a thing called the Leaf Shield. Uh, that's a bit of a pain. Now you can let's see if I can do it actually. I'll see if I can show you. The Leaf Shield can be penetrated, um, but it's not really going to happen this time. I jump one more cycle here. There we go. Wood Man's done and we get the Leaf Shield, which is a super useless weapon, but it'll be useful against Air Man, who we'll go to next. Kind of get him out of the way. Then we'll go to Crash Man and then I will leave us with like Quick Man and Heat Man to deal with. Air Man Stage of the pain in the ass is probably the hardest stage in the in the game outside of Wily's Castle. Um, definitely not friendly for newcomers. It's a place, uh, especially if you're playing on normal.",
            "start": 793.68
        },
        {
            "text": "stage of the pain in the ass is probably the hardest stage in the in the game outside of Wily's Castle. Um, definitely not friendly for newcomers. It's a place, uh, especially if you're playing on normal and you can actually start here pretty reasonably, but um I don't do that when I'm playing on difficult. So these these like these things, the longer you stay on them, the more these things will come out of their ears and attack you, so you want to like not stay down them if you can help it. And then here you can attack these guys uh with your Mega Buster, which is fine, but as usual, the Metal Blades will make quicker work at them, plus you can shoot them in multiple directions, which is going to be useful for one of them. Another great soundtrack. The music's just so good. So see, you can shoot him diagonally there, kind of cut through. And then you here you can just shoot him up again and we run. These birds from Wood Man Stage will make a return here. You can kind of just anticipate him, especially in the",
            "start": 871.8
        },
        {
            "text": "there kind of cut through and then you here you can just shoot him up again and we run. These birds from Wood Man Stage will make a return here. You can kind of just anticipate him, especially in the clouds, kind of cover them up. Here you can just avoid these guys. You really even need to mess with them. And then we'll cruise through the second half of the stage, which is similar, but now instead of jumping from platform to these things, you're jumping from one of these things to these things. And so you need to jump over and kind of activate them, um, and you want to try to sync up these like their little things here. And getting hit intentionally like I just did there is a good way to just go. That was close. And then here we'll use the Metal Blades again since the birds will be coming shortly. These guys, man, just dropping him out of nowhere. All right, so you kind of want to just take it easy here. Let him come to you. Need to really rush. I just got two extra lives. All right, and so here we're going to",
            "start": 925.28
        },
        {
            "text": "just dropping him out of nowhere. All right, so you kind of want to just take it easy here. Let him come to you. Need to really rush. I just got two extra lives. All right, and so here we're going to fight him in two different ways. We'll fight him with the Peashooter and then when he jumps towards us, we'll use the Leaf Shield and put him away. So I'll show you what I mean. So he'll use his Air Shooter and call up a bunch of a bunch of tornadoes that you can try to avoid if you can. Some of them are easier to avoid than other. Like I should be able to avoid them there. Oh, oh, and then he'll come over here and when he does, we'll just there like that. And that's it. So that's Air Man. His weapon pretty useless too. They're good against those AT-ST like Walker enemies that we're going to encounter, like we encounter on Flash Man Stage though, and uh also good on Crash Man. And we'll go fight him next. Maybe we won't. I don't know. I want I'm trying to I'm trying to let me think how I want to do this. You",
            "start": 999.2
        },
        {
            "text": "we encounter on Flash Man Stage though, and uh also good on Crash Man. And we'll go fight him next. Maybe we won't. I don't know. I want I'm trying to I'm trying to let me think how I want to do this. You know what, let's go fight Heat Man. Let's go fight Heat Man. Should get him out of the way. Sick of looking at this stupid **** Zippo lighter face. Yes, we're equipped. We got the equipment. Yes, let's go on the **** game. I like that design though. Heat Man's design is awesome. That he's just it's like one of the more unique designs in Mega Man. All right, this stage can be a little bit rough, but there but once you get Item 2 by beating Air Man, you can basically just kind of cheat your way through. And I'll show you what I mean because this stage is home to the disappearing Block Puzzle from hell, um, and is like really hard to do. You can do it. It's doable for sure, but you don't have to. And this isn't it in case you're curious. All right, so here we can start going to like Metal Blades. So you can",
            "start": 1064.64
        },
        {
            "text": "like really hard to do. You can do it. It's doable for sure, but you don't have to. And this isn't it in case you're curious. All right, so here we can start going to like Metal Blades. So you can see if we had Crash Bombs here, we can actually go through some of these barriers, but we don't. We don't really need them. All right, so this is where we're going to cheat and it's not really cheating. It lets you do it using Item 2, which is basically the precursor to Rush Jet. This disappearing Block Puzzle ahead of us, we can just skip 'cause it's insane. Like look how long it is. So we just don't do it. And then since we have uh the Air Shooter, we can just deal with this guy like that. And then and then we'll go to Bubble Lead uh to fight Air Man or Heat Man rather. So far so good. All right, so that's Heat Man done with little son of a ****. And so now this leaves us two options from here. We can go to Crash Man. We can go to Quick Man. Um, go take care of Crash Man now. Get those Crash Bombs and",
            "start": 1145.56
        },
        {
            "text": "Heat Man done with little son of a ****. And so now this leaves us two options from here. We can go to Crash Man. We can go to Quick Man. Um, go take care of Crash Man now. Get those Crash Bombs and then uh we'll go to Quick Man last. And Quick Man Stage is a famous famous Mega Man stage. This will be Item 1, which is going to be the last item that we'll get. These are like disappearing platforms. There's really only one place in the game you have to use in Wily's Castle. Otherwise, they're pretty useless. So Crash Man also has great music, um, and the Metal Blades here will uh be quite useful. So can switch back to the Peashooter now. And so here we're going to have to go through a series. You these kind of like robing things. And here you could use Item 1 if you want, but I mean it's not really necessary. Um, use the Metal Blades kind of do away with these guys. There'll always be there can be up to three of those enemies on screen at once, and sometimes the best option is to just leave them alone.",
            "start": 1259.12
        },
        {
            "text": "um use the Metal Blades kind of do away with these guys. There'll always be there can be up to three of those enemies on screen at once, and sometimes the best option is to just leave them alone so they don't respawn right on top of you. As you can see here, we like leave him alone until just like let him come right on top of you. All right. All right, so almost to where we need to be. So here switch back to the Peashooter to fight this vertical enemy that we saw Metal Man Stage. Me there we go. And we'll climb up. We'll turn to night after we get through this next couple screams. You can see some of the genetics of like Bomb Man Stage on this screen on this stage, which I like. And then here you don't have to do this, but I just do this because it just makes it a little bit easier. Um, just use Flash Stopper and like work your way through this as quickly as you can to just give yourself a little bit of a buffer between these obnoxious bird enemies. And these are glitched out, so they're",
            "start": 1351.88
        },
        {
            "text": "use Flash Stopper and like work your way through this as quickly as you can to just give yourself a little bit of a buffer between these obnoxious bird enemies. And these are glitched out, so they're going to keep dropping them to the side. They're not going to explode actually, which is quite useful. And then so here you can do a little trick where you can use uh Item 2 to grab the E-Tank and then use it as a platform to get back up and then use it as a platform to get to this ladder. Once you climb up this ladder, you can then use Metal Blades to attack the enemies that are going to land on top of the ladder. Grab the extra life and then we're through. And so Crash Man, we should be able to be pretty easily, uh, pretty quickly. He's a real really tough enemy if you don't have the Air Shooter. And that's it. Crash Man's done. So that leaves one more enemy, Quick Man. And the Quick Man Stage, of course, is I think famous in video games. And so we'll see why that is in a minute. It's very hard. Quick Man was",
            "start": 1438.72
        },
        {
            "text": "it. Crash Man's done. So that leaves one more enemy, Quick Man. And the Quick Man Stage, of course, is I think famous in video games. And so we'll see why that is in a minute. It's very hard. Quick Man was like my favorite back when I was really young. He's so cool. Then Mega Man 3 came out. Magnet Man ended up be my boy. We haven't showed off Item 3, so I'll do that for you real quick. You can use it here. Item 3 is like a wall crawler. You can use it there. So we'll use the Metal Blades early on in Quick Man Stage to eliminate these enemies. Um, ah, it's pretty poor poor showing. Okay, now this is where things get hairy, really really hairy. And this is only the beginning. Here we go. Got to keep moving here. You can collect E-Tank. And then we're halfway through. And then here you actually have to know at some point to jump up. All right, and here's where things get really **** crazy. I actually think I was a little slow there. Okay, oh my God. Okay. All right, we're through. We made it. So use the Air Shooter.",
            "start": 1508.44
        },
        {
            "text": "point to jump up. All right, and here's where things get really **** crazy. I actually think I was a little slow there. Okay, oh my God. Okay. All right, we're through. We made it. So use the Air Shooter to get rid of those guys we did before. Ah, all right. Oh **** that sucks. I might have taken a lethal amount of damage there. All right, let's see what we can do. I'm going to show you a little trick. The trick here is that Flash Man can't do any D you can't do any damage to Flash Man's weapon, but you can. Quick Man is so quick that using it on him will just damage him. Um, and then we can switch over to Crash Bombs. Oh, it's going to be really close. Oh, he got me. Um, the other option too, so the Crash Bombs can be used um in multiple ways. If you can attach him to a wall and let him go into the explosion, it actually does massive damage to him, but it's hard to do so. But if you hit him, don't hit him directly with it, um, then you're going to be in a lot of trouble because you can't shoot",
            "start": 1596.32
        },
        {
            "text": "the explosion. It actually does massive damage to him, but it's hard to do so. But if you hit him, don't hit him directly with it, um, then you're going to be in a lot of trouble because you can't shoot another one until explodes. And you can see that the Peashooter actually does a decent amount of damage to him. He's just really fast. So that's the end of Quick Man. Now all eight enemies are defeated, um, and this allows us to move on to Wily's Castle, uh, with its iconic music and uh iconic look and iconic iconic enemies as well. So we get the Quick Boomerangs, which are super useful against multiple uh enemies. All right, let's while let Wily introduce himself in his classic way with his eyebrows. So here we go rocking. So you want to kind of equip the blades here. So here we're going to use use Item 3, as I was telling you before. There's parts where you're going to really need to use it. This is one of them. And then we'll go back to Metal Blades. I mean, you're going to be switching a lot in Wily's",
            "start": 1699.96
        },
        {
            "text": "as I was telling you before there's parts where you're going to really need to use it this is one of them and then we'll go back to Metal Blades. I mean, you're going to be switching a lot in Wily's Castle between things. Let's, and the other thing that you need to keep in mind in Wily's Castle is that your weapon energy no longer replenishes in between stages, so you need to keep very careful eye on that, uh, and replenish it as you go or you're going to be in a lot of trouble. Here you can do a kind of cool slick thing like jump down and just shoot him and then use item three again here if you want and we can grab the extra life and you can make this jump. It's hard. I don't know if I'll be able to do it. No, so we'll work our way back up. So here you want to like kind of get through. All right, and then again, keep an eye on the weapon energy. Item three, you're going to need it later, so keep it fresh and we begin our climb upwards. This is the only part in the game",
            "start": 1792.4
        },
        {
            "text": "right, and then again, keep an eye on the weapon energy. Item three, you're going to need it later, so keep it fresh and we begin our climb upwards. This is the only part in the game where you have to use item one, so we introduce it to you. Get to the sign here and at this point you can equip Quick Boomerangs, um, and we'll use them in a minute. You don't have to use my these guys, you can if you want, but you don't have to. And so we're almost to the final boss. It's a tough boss if you don't know what you're doing. And so here the idea is to just kind of keep moving. He's going to spawn right behind you. And so my technique here is to get on on the top and just start hammering him, letting him hit me and then using my invincibility to try to kind of nail him and he's going to probably hit me again and you fall back and then you just put him away. So that's one enemy down in, uh, Wily's Castle again, being ever cognizant of your weapon energy. Go",
            "start": 1856.44
        },
        {
            "text": "and he's going to probably hit me again and you fall back and then you just put him away. So that's one enemy down in, uh, Wily's Castle again, being ever cognizant of your weapon energy. Go ahead and fill up. Switch over to Metal Blades since the enemies here are going to be a pain in the ass, spawn around top of you. And then here we'll just fill up one even though we really don't need it again. And then we'll use number two, item two here. Skip the first ladder that you encounter and go to the second one. That way you can get an E-Tank and then you can get an extra life and then fill up. You'll need the number two again or item two rather, later. And then if you want to get crazy with it, you might as well. How many tanks do we have? Yeah, so here just use Crash Bombs to eliminate this wall and then grab the tank hard, right? So you're going to fall into the spikes here. You're going to want to use Flash Stopper. If you don't, as you remember on Metal Man stage, uh, these things will come",
            "start": 1945.24
        },
        {
            "text": "wall and then grab the tank hard, right? So you're going to fall into the spikes here. You're going to want to use Flash Stopper. If you don't, as you remember on Metal Man stage, uh, these things will come out of the walls and the ceiling. Um, so you can just get right through them. Actually, we can go right over to item three here. I kind of can't help but feel like the these presses that you see in Metal Man stage and you see here were inspired by Castlevania. That's my assumption, could be wrong. We drop down. We're almost to the boss. If you want, you can actually go to the right here and use item two. Um, so here you can use Bubble Man's weapon or Metal Blades. Bubble Man's weapon actually, I think, does more damage, but I prefer to just use Metal Blades, so it's easier to use. And so that's the end of the wall enemy and we continue to cruise through Wily's Castle. Okay, so we're going to go down and again we have to be cognizant of the weapon energy that we're using if we want. Now you can get E-Tanks",
            "start": 2029.36
        },
        {
            "text": "enemy and we continue to cruise through Wily's Castle. Okay, so we're going to go down and again we have to be cognizant of the weapon energy that we're using if we want. Now you can get E-Tanks here and like you can just do whatever you want, but not worth using the Crash Bombs. Uh, should have been a little smarter there cuz I'm going to need to use item one now. Here this is like the only enemy in the game. It doesn't is like not impervious to the Metal Blades. All right, so, uh, the first thing we're going to need to do is we're going to need to, uh, refill Crash Bombs. We're going to need them later. Uh, then we want to use, uh, item two to jump over here, uh, where we can refill, uh, Metal Blades since we're just spamming the **** out of them everywhere and we don't want to run out of them. We drop down. These robotic fish will jump out of the water here as you'll see. Oh wow, I wonder if they're not going to pop out at all. Typically these these, yeah, they there. And then this drop here",
            "start": 2119.84
        },
        {
            "text": "drop down. These robotic fish will jump out of the water here as you'll see. Oh wow, I wonder if they're not going to pop out at all. Typically these these, yeah, they there. And then this drop here is like a really difficult drop, probably the hardest drop in in Mega Man, uh, any of them. Be very, very careful. There we go. Did it. And then we continue on. We are underwater, so again, we have a great buoyancy here. Move a little slower. And then here we're going to use Quick Boomerangs again on the Guts Dozer, which is the next enemy based on Guts Man for Mega Man 1. Make great quick quick work out of him and he is finished and we continue our cruise through Wily's Castle. All right, so again, let's be cognizant of what we've used and what we need. Um, we could use the Flash Stopper later on Quick Man, so we can might as well start filling that up. Okay, we are nearing the end of the game, but we have just a little bit more to go. So the thing about this area is that a lot of",
            "start": 2186.56
        },
        {
            "text": "later on Quick Man, so we can might as well start filling that up. Okay, we are nearing the end of the game, but we have just a little bit more to go. So the thing about this area is that a lot of these blocks are actually invincible or invisible like that. You can actually jump through them. I'll show you. See? So you need to be like super careful. Yeah, and then there's more invisible platforms up there. So, uh, uh, just to skip the whole drama, just use item two. Get knock back down. No, cool. All right, so we're cruising. Now we need an E-Tank. We can't carry any more of them anyway. And now shit's going to get a little hectic with, uh, some more of these puzzles like we saw, um, back in, uh, Crash Man station. But this time there's spikes underneath and you'll die instantly if you touch them. So I'm just going to make the jump here. We're going to have to be a little more patient, a little more strategic. You're going to need to jump onto this platform and then wait for it to come back around and",
            "start": 2286.24
        },
        {
            "text": "so I'm just going to make the jump here. We're going to have to be a little more patient, a little more strategic. You're going to need to jump onto this platform and then wait for it to come back around and then jump up. Oh, what? I don't know why I even did that. Um, typically you should wait. Be more patient than that, Kevin. Be more patient than that. That was stupid. That was a silly move. That was something. Now we have to sit here and do it again. I paid for, I paid the price. We all, we have, you have to learn somehow. Mhm. That was a stupid death. I don't know why I did that. I, I never do that. I'll tell you the parts of the game where I usually die and that's not one of them or where I can die, typically die. All right, we're getting back to where we were. We just got to get through this part again. Now here you can get a little clever. You can use item one or item three to kind of expedite the process unless you're speedrunning the game, which I'm not. No really reason to do that. All right, so here where we were",
            "start": 2365.44
        },
        {
            "text": "a little clever. You can use item one or item three to kind of expedite the process unless you're speedrunning the game, which I'm not. No really reason to do that. All right, so here where we were before when we died. Patience is a virtue. See if we can get all the way through without killing anything else. No, this one's a little crazy, so you need to use, uh, item two here. It looks, it's simpler than it looks cuz you can't ride on the top or you'll get knocked off, so you need to just use the platform. Harder than, yes, it's harder than it looks, not easier than it looks. Is that what I said? Simpler? I'm sorry, yeah, you're right. All right, so let's switch back to the Air Shooter, uh, here. Oh, that button is in such a terrible place. Uh, and then we will deal with this clown. Damn it. How tall is? I think he's supposed to be like 4'4\" or something like that. Those guys are really, yeah, Sniper Joes. God damn it. Respawn them. I'm screwed here. She got to get through. All right, so",
            "start": 2440.72
        },
        {
            "text": "damn it. How tall is? I think he's supposed to be like 4'4\" or something like that. Those guys are really, yeah, Sniper Joes. God damn it. Respawn them. I'm screwed here. She got to get through. All right, so there's two ways to go about fighting this enemy and unfortunately I have to use an E-Tank here. Um, there's six platforms or six enemies and there, in other words, the only way you can kill these enemies is with Crash Bombs, but there's only enough Crash Bombs to destroy the the barriers you have to destroy and the enemies. If you use any more than that, you're screwed. You're going to have to die and start again. Um, so and you have to keep moving. These things will shoot at you as you see there. And, uh, so we'll use, uh, Crash Bomb here and we'll use one there. And then I need to hit the star and use my E-Tank. It's unfortunate I have to use an E-Tank already cuz I might need them later. And then we use wall crawler. Damn, come on. There we go. And then here this is the toughest one you have to use to kind",
            "start": 2517.64
        },
        {
            "text": "E-Tank. It's unfortunate I have to use an E-Tank already cuz I might need them later. And then we use wall crawler. Damn, come on. There we go. And then here this is the toughest one you have to use to kind of use the number item one here and then hit the button. Crash Bombs done. So in other words, you can't destroy those three barriers. Now there's a way to do it if it want to make it easier on you is that you can start the battle, use the Crash Bombs on all the barriers, get rid of them. They'll stay permanently gone. When you come back, you kill yourself, refill your Crash Bombs, then back and just slice through the enemies. But there's really no reason to do that if you're just a little more strategic about it. Uh, so that's basically the gamut of bosses apart from Wily, of course, in Mega Man. Great Mega Man tradition. We are going to have to fight all the bosses again. Um, so we will do that now. So we'll fight Heat Man first. Use the Bubble Lead again. Air Man again. We can use use a peashooter. Oh, that's a bad, it's a bad",
            "start": 2574.32
        },
        {
            "text": "we are going to have to fight all the bosses again. Um, so we will do that now. So we'll fight Heat Man first. Use the Bubble Lead again. Air Man again. We can use use a peashooter. Oh, that's a bad, it's a bad, uh, group of tornadoes for me. That's another one. Okay, so here we want to be a little more clever if we can. I'm screwed here. Here I screw that one up. There we go. Trying to get a little too cute here. I was trying not to kill him standing on that because you kill him and stand on that, you you disappear out of the stage and you don't get the, uh, the health, which is a problem. Now here I could use Atomic Fire if I wanted, but, um, you know, let's try it. You can charge Atomic Fire, but unless you do it, um, full blast, it's not going to do much to. Oh, ****. Making this a lot harder than I have to for me myself. Kevin. Bubble Man. Knock his ass out again. Quick Man. Now we filled it up before, so we might as well do it. Crash Man. So again, we'll use the Air Shooter here. Remember to jump, get him to jump. Fight Metal Man.",
            "start": 2647.0
        },
        {
            "text": "Bubble Man. Knock his ass out again. Quick Man. Now we filled it up before, so we might as well do it. Crash Man. So again, we'll use the Air Shooter here. Remember to jump, get him to jump. Fight Metal Man again. Metal Man won't attack you unless you attack him. And remember that his weapon is actually his weakness. Watch if I can connect with it. See? Does half damage. Kills him. And then Flash Man is the final barrier here and he's done. You do these in any order you want. Yeah, so here it's going to be a little difficult cuz I'm almost out of, uh, I'm almost out of blades here. Um, and you can use other things like Atomic Fire if you wanted, et cetera, but you don't really have to. ****. Um, so you have kind of multiple options here. I'm just going to continue with the Buster, especially because I have three E-Tanks. It's not the ideal, but it'll do. So Wily disappears and he's not quite dead yet. We're going to have to fight him one more time. Classic showdown. I love this part. No music. You need just drop. It's so",
            "start": 2745.44
        },
        {
            "text": "it's not the ideal, but it'll do. So Wily disappears and he's not quite dead yet. We're going to have to fight him one more time. Classic showdown. I love this part. No music. You need just drop. It's so cool. Those drops do a lot of damage, so you just want to be patient here. And so the only weapon that you can really use on him is Bubble Lead or Bubble Lead. Wily's alien form. But there's more to the story, of course, that meets the eye. Damn, not getting off a good start here. There we go. E-Tank just to be careful. See? Okay, one more time. There's one more hit. Do the trick. And that's it. Then we'll watch the ending. Of course, Wily wasn't really an alien. He was, he made a machine that he's using now and he'll beg for forgiveness as he usually does because he's a **** someone pointed out to me a while ago. And so, oh, it's so cool. The the glass globe above it is distorting the picture behind it. It's like a really cool touch. I never really paid much attention to that. I find this ending to be super sad",
            "start": 2854.28
        },
        {
            "text": "ago. And so, oh, it's so cool. The the glass globe above it is distorting the picture behind it. It's like a really cool touch. I never really paid much attention to that. I find this ending to be super sad and somber too. I have no idea why. It's just the music. I d",
            "start": 3045.96
        }
    ]
}